{"position": "Release Manager", "company": "IBM", "profiles": ["Languages English Full professional proficiency Hindi Full professional proficiency Oriya Native or bilingual proficiency Bengali Native or bilingual proficiency English Full professional proficiency Hindi Full professional proficiency Oriya Native or bilingual proficiency Bengali Native or bilingual proficiency English Full professional proficiency Hindi Full professional proficiency Oriya Native or bilingual proficiency Bengali Native or bilingual proficiency Full professional proficiency Full professional proficiency Native or bilingual proficiency Native or bilingual proficiency Skills Project Management Project Delivery Release Management Service Management Disaster Recovery SDLC Operational Risk... Software Project... Deployment Management Service Delivery Change Management Software Quality... Incident Management Defect Management Application Management... Risk Assessment Microsoft Project Unix BMC Remedy Rational Team Concert Software Configuration... ClearCase ClearQuest CMVC CA Harvest Defect Life Cycle JIRA Management Requirements Analysis See 14+     See less Skills  Project Management Project Delivery Release Management Service Management Disaster Recovery SDLC Operational Risk... Software Project... Deployment Management Service Delivery Change Management Software Quality... Incident Management Defect Management Application Management... Risk Assessment Microsoft Project Unix BMC Remedy Rational Team Concert Software Configuration... ClearCase ClearQuest CMVC CA Harvest Defect Life Cycle JIRA Management Requirements Analysis See 14+     See less Project Management Project Delivery Release Management Service Management Disaster Recovery SDLC Operational Risk... Software Project... Deployment Management Service Delivery Change Management Software Quality... Incident Management Defect Management Application Management... Risk Assessment Microsoft Project Unix BMC Remedy Rational Team Concert Software Configuration... ClearCase ClearQuest CMVC CA Harvest Defect Life Cycle JIRA Management Requirements Analysis See 14+     See less Project Management Project Delivery Release Management Service Management Disaster Recovery SDLC Operational Risk... Software Project... Deployment Management Service Delivery Change Management Software Quality... Incident Management Defect Management Application Management... Risk Assessment Microsoft Project Unix BMC Remedy Rational Team Concert Software Configuration... ClearCase ClearQuest CMVC CA Harvest Defect Life Cycle JIRA Management Requirements Analysis See 14+     See less ", "Skills Websphere WebSphere Portal WebSphere Application... Java Software Development Agile Methodologies SOA Enterprise Architecture Java Enterprise Edition DB2 REST Portals Skills  Websphere WebSphere Portal WebSphere Application... Java Software Development Agile Methodologies SOA Enterprise Architecture Java Enterprise Edition DB2 REST Portals Websphere WebSphere Portal WebSphere Application... Java Software Development Agile Methodologies SOA Enterprise Architecture Java Enterprise Edition DB2 REST Portals Websphere WebSphere Portal WebSphere Application... Java Software Development Agile Methodologies SOA Enterprise Architecture Java Enterprise Edition DB2 REST Portals ", "Experience Deployment/ Release Manager IBM June 2013  – Present (2 years 3 months) Deploying the Mainframe, Abinitio, Pega and Java code to Production region to have a Go-Live with Validations. Deployment/ Release Manager IBM June 2013  –  November 2013  (6 months) Deployment/ Release Manager Deployment/ Release Manager IBM June 2013  – Present (2 years 3 months) Deploying the Mainframe, Abinitio, Pega and Java code to Production region to have a Go-Live with Validations. Deployment/ Release Manager IBM June 2013  – Present (2 years 3 months) Deploying the Mainframe, Abinitio, Pega and Java code to Production region to have a Go-Live with Validations. Deployment/ Release Manager IBM June 2013  –  November 2013  (6 months) Deployment/ Release Manager Deployment/ Release Manager IBM June 2013  –  November 2013  (6 months) Deployment/ Release Manager Skills IT Service Management SDLC Requirements Analysis Software Project... IT Strategy Agile Methodologies Integration Service Delivery Enterprise Architecture Business Analysis Software Development Skills  IT Service Management SDLC Requirements Analysis Software Project... IT Strategy Agile Methodologies Integration Service Delivery Enterprise Architecture Business Analysis Software Development IT Service Management SDLC Requirements Analysis Software Project... IT Strategy Agile Methodologies Integration Service Delivery Enterprise Architecture Business Analysis Software Development IT Service Management SDLC Requirements Analysis Software Project... IT Strategy Agile Methodologies Integration Service Delivery Enterprise Architecture Business Analysis Software Development Education LalBahadur English Medium High School Bachelor's degree,  Computer Science 1986  – 1994 Studied the following subjects : English, Hindi, Telugu, Mathematics, Physics, Chemistry, Social Studies. Activities and Societies:  Completed the education from 2nd Standard to 10th Standard LalBahadur English Medium High School Bachelor's degree,  Computer Science 1986  – 1994 Studied the following subjects : English, Hindi, Telugu, Mathematics, Physics, Chemistry, Social Studies. Activities and Societies:  Completed the education from 2nd Standard to 10th Standard LalBahadur English Medium High School Bachelor's degree,  Computer Science 1986  – 1994 Studied the following subjects : English, Hindi, Telugu, Mathematics, Physics, Chemistry, Social Studies. Activities and Societies:  Completed the education from 2nd Standard to 10th Standard LalBahadur English Medium High School Bachelor's degree,  Computer Science 1986  – 1994 Studied the following subjects : English, Hindi, Telugu, Mathematics, Physics, Chemistry, Social Studies. Activities and Societies:  Completed the education from 2nd Standard to 10th Standard ", "Summary Many years of IT industry experience in software development, integration & build, and release management.  \n \nKey accomplishments have been: \n•\tSignificant release management and business process experience. \n•\tSignificant architecture and process contributions at the corporate level over the last 25 years. Summary Many years of IT industry experience in software development, integration & build, and release management.  \n \nKey accomplishments have been: \n•\tSignificant release management and business process experience. \n•\tSignificant architecture and process contributions at the corporate level over the last 25 years. Many years of IT industry experience in software development, integration & build, and release management.  \n \nKey accomplishments have been: \n•\tSignificant release management and business process experience. \n•\tSignificant architecture and process contributions at the corporate level over the last 25 years. Many years of IT industry experience in software development, integration & build, and release management.  \n \nKey accomplishments have been: \n•\tSignificant release management and business process experience. \n•\tSignificant architecture and process contributions at the corporate level over the last 25 years. Experience Product Planner and Release Manager -- IBM Systems, z System -- IM IMS Tools IBM March 2014  – Present (1 year 6 months) IBM Silicon Valley Laboratory, San Jose, CA Software Release Manager IBM SWG IM IMS Tools Infinite Computer Solutions 2011  –  February 2014  (3 years) United States Product Planner and Software Release Manager IBM SWG IM IMS Tools Analysts International Corporation (AIC) 2000  –  2011  (11 years) United States Product Planner, Packaging, Integration & Build Team Lead, Tester, Application Programmer IBM 1969  –  2000  (31 years) United States, United Kingdom, Germany Product Planner and Release Manager -- IBM Systems, z System -- IM IMS Tools IBM March 2014  – Present (1 year 6 months) IBM Silicon Valley Laboratory, San Jose, CA Product Planner and Release Manager -- IBM Systems, z System -- IM IMS Tools IBM March 2014  – Present (1 year 6 months) IBM Silicon Valley Laboratory, San Jose, CA Software Release Manager IBM SWG IM IMS Tools Infinite Computer Solutions 2011  –  February 2014  (3 years) United States Software Release Manager IBM SWG IM IMS Tools Infinite Computer Solutions 2011  –  February 2014  (3 years) United States Product Planner and Software Release Manager IBM SWG IM IMS Tools Analysts International Corporation (AIC) 2000  –  2011  (11 years) United States Product Planner and Software Release Manager IBM SWG IM IMS Tools Analysts International Corporation (AIC) 2000  –  2011  (11 years) United States Product Planner, Packaging, Integration & Build Team Lead, Tester, Application Programmer IBM 1969  –  2000  (31 years) United States, United Kingdom, Germany Product Planner, Packaging, Integration & Build Team Lead, Tester, Application Programmer IBM 1969  –  2000  (31 years) United States, United Kingdom, Germany Languages English Native or bilingual proficiency German Native or bilingual proficiency English Native or bilingual proficiency German Native or bilingual proficiency English Native or bilingual proficiency German Native or bilingual proficiency Native or bilingual proficiency Native or bilingual proficiency Skills SQL Business Process XML Integration Software Development z/OS Architectures IBM Mainframe Enterprise Architecture Skills  SQL Business Process XML Integration Software Development z/OS Architectures IBM Mainframe Enterprise Architecture SQL Business Process XML Integration Software Development z/OS Architectures IBM Mainframe Enterprise Architecture SQL Business Process XML Integration Software Development z/OS Architectures IBM Mainframe Enterprise Architecture ", "Summary Skilled Program/Project Manager for a variety of software projects including a Marketing platform,Mobile development,Intelligent Transportation, and software development tools. I excel at balance risks and goals to deliver software on schedule. I have used a wide variety of tools to automate and/or facilitate job functions. \n \nSpecialties: Overall Release coordination, Globalization, people management, Summary Skilled Program/Project Manager for a variety of software projects including a Marketing platform,Mobile development,Intelligent Transportation, and software development tools. I excel at balance risks and goals to deliver software on schedule. I have used a wide variety of tools to automate and/or facilitate job functions. \n \nSpecialties: Overall Release coordination, Globalization, people management, Skilled Program/Project Manager for a variety of software projects including a Marketing platform,Mobile development,Intelligent Transportation, and software development tools. I excel at balance risks and goals to deliver software on schedule. I have used a wide variety of tools to automate and/or facilitate job functions. \n \nSpecialties: Overall Release coordination, Globalization, people management, Skilled Program/Project Manager for a variety of software projects including a Marketing platform,Mobile development,Intelligent Transportation, and software development tools. I excel at balance risks and goals to deliver software on schedule. I have used a wide variety of tools to automate and/or facilitate job functions. \n \nSpecialties: Overall Release coordination, Globalization, people management, Languages English Native or bilingual proficiency English Native or bilingual proficiency English Native or bilingual proficiency Native or bilingual proficiency Skills Software Project... Agile Methodologies Management Testing Software Development Unix Scrum Globalization Project Management Software Lifecycle Mobile Applications SOA Integration Agile Project Management Enterprise Architecture Requirements Analysis Software Engineering XML Enterprise Software Test Automation SDLC Solution Architecture Cloud Computing ClearCase Software Quality... Solaris System Architecture Certified Scrum Master Program Management Cross-functional Team... See 15+     See less Skills  Software Project... Agile Methodologies Management Testing Software Development Unix Scrum Globalization Project Management Software Lifecycle Mobile Applications SOA Integration Agile Project Management Enterprise Architecture Requirements Analysis Software Engineering XML Enterprise Software Test Automation SDLC Solution Architecture Cloud Computing ClearCase Software Quality... Solaris System Architecture Certified Scrum Master Program Management Cross-functional Team... See 15+     See less Software Project... Agile Methodologies Management Testing Software Development Unix Scrum Globalization Project Management Software Lifecycle Mobile Applications SOA Integration Agile Project Management Enterprise Architecture Requirements Analysis Software Engineering XML Enterprise Software Test Automation SDLC Solution Architecture Cloud Computing ClearCase Software Quality... Solaris System Architecture Certified Scrum Master Program Management Cross-functional Team... See 15+     See less Software Project... Agile Methodologies Management Testing Software Development Unix Scrum Globalization Project Management Software Lifecycle Mobile Applications SOA Integration Agile Project Management Enterprise Architecture Requirements Analysis Software Engineering XML Enterprise Software Test Automation SDLC Solution Architecture Cloud Computing ClearCase Software Quality... Solaris System Architecture Certified Scrum Master Program Management Cross-functional Team... See 15+     See less ", "Summary I'm a senior leader in full product delivery cycle, release management, software engineering, customer liaisons, people management, project management and strategy development. \n \nI have been leading global teams across different cultures with over 23 year of industry experience. I have a proven ability to lead large-scale projects including areas outside my direct span or influence using demonstrable collaboration and influencing skills.  \n \nI have been involved in providing direction from both a technical and operational capacity for a number of high profile projects, from original concept through to delivery and general announcement or deployment.. \n \nSpecialties: Leadership and Development, Product Support, Management, Project Management, Technology Deployment, Business Process Engineering. Summary I'm a senior leader in full product delivery cycle, release management, software engineering, customer liaisons, people management, project management and strategy development. \n \nI have been leading global teams across different cultures with over 23 year of industry experience. I have a proven ability to lead large-scale projects including areas outside my direct span or influence using demonstrable collaboration and influencing skills.  \n \nI have been involved in providing direction from both a technical and operational capacity for a number of high profile projects, from original concept through to delivery and general announcement or deployment.. \n \nSpecialties: Leadership and Development, Product Support, Management, Project Management, Technology Deployment, Business Process Engineering. I'm a senior leader in full product delivery cycle, release management, software engineering, customer liaisons, people management, project management and strategy development. \n \nI have been leading global teams across different cultures with over 23 year of industry experience. I have a proven ability to lead large-scale projects including areas outside my direct span or influence using demonstrable collaboration and influencing skills.  \n \nI have been involved in providing direction from both a technical and operational capacity for a number of high profile projects, from original concept through to delivery and general announcement or deployment.. \n \nSpecialties: Leadership and Development, Product Support, Management, Project Management, Technology Deployment, Business Process Engineering. I'm a senior leader in full product delivery cycle, release management, software engineering, customer liaisons, people management, project management and strategy development. \n \nI have been leading global teams across different cultures with over 23 year of industry experience. I have a proven ability to lead large-scale projects including areas outside my direct span or influence using demonstrable collaboration and influencing skills.  \n \nI have been involved in providing direction from both a technical and operational capacity for a number of high profile projects, from original concept through to delivery and general announcement or deployment.. \n \nSpecialties: Leadership and Development, Product Support, Management, Project Management, Technology Deployment, Business Process Engineering. Experience Product Release Manager IBM Watson Group April 2015  – Present (5 months) Austin, Texas Area Americas Resolution Manager IBM (Software Group, Cloud and Smart Infrastructure) July 2013  – Present (2 years 2 months) Austin, Texas Area Product Release Manager IBM Watson Group April 2015  – Present (5 months) Austin, Texas Area Product Release Manager IBM Watson Group April 2015  – Present (5 months) Austin, Texas Area Americas Resolution Manager IBM (Software Group, Cloud and Smart Infrastructure) July 2013  – Present (2 years 2 months) Austin, Texas Area Americas Resolution Manager IBM (Software Group, Cloud and Smart Infrastructure) July 2013  – Present (2 years 2 months) Austin, Texas Area Languages Italian Native or bilingual proficiency French Professional working proficiency English Native or bilingual proficiency Italian Native or bilingual proficiency French Professional working proficiency English Native or bilingual proficiency Italian Native or bilingual proficiency French Professional working proficiency English Native or bilingual proficiency Native or bilingual proficiency Professional working proficiency Native or bilingual proficiency Skills Software Development Software Project... PMP ITIL IT Service Management Program Management Systems Management Agile IT Strategy People Management Tivoli Enterprise Software Cloud Computing IT Management Agile Methodologies Netcool Vendor Management Management Project Management Security Strategy Project Planning Leadership Enterprise Architecture Solution Architecture SaaS Integration Project Portfolio... Service Management Pre-sales Team Leadership See 16+     See less Skills  Software Development Software Project... PMP ITIL IT Service Management Program Management Systems Management Agile IT Strategy People Management Tivoli Enterprise Software Cloud Computing IT Management Agile Methodologies Netcool Vendor Management Management Project Management Security Strategy Project Planning Leadership Enterprise Architecture Solution Architecture SaaS Integration Project Portfolio... Service Management Pre-sales Team Leadership See 16+     See less Software Development Software Project... PMP ITIL IT Service Management Program Management Systems Management Agile IT Strategy People Management Tivoli Enterprise Software Cloud Computing IT Management Agile Methodologies Netcool Vendor Management Management Project Management Security Strategy Project Planning Leadership Enterprise Architecture Solution Architecture SaaS Integration Project Portfolio... Service Management Pre-sales Team Leadership See 16+     See less Software Development Software Project... PMP ITIL IT Service Management Program Management Systems Management Agile IT Strategy People Management Tivoli Enterprise Software Cloud Computing IT Management Agile Methodologies Netcool Vendor Management Management Project Management Security Strategy Project Planning Leadership Enterprise Architecture Solution Architecture SaaS Integration Project Portfolio... Service Management Pre-sales Team Leadership See 16+     See less ", "Experience Release Manager IBM August 2010  – Present (5 years 1 month) Release manager for IBM Lotus Symphony and LotusLive Symphony Project Manager IBM July 2007  – Present (8 years 2 months) Software engineer IBM January 2004  –  June 2007  (3 years 6 months) Release Manager IBM August 2010  – Present (5 years 1 month) Release manager for IBM Lotus Symphony and LotusLive Symphony Release Manager IBM August 2010  – Present (5 years 1 month) Release manager for IBM Lotus Symphony and LotusLive Symphony Project Manager IBM July 2007  – Present (8 years 2 months) Project Manager IBM July 2007  – Present (8 years 2 months) Software engineer IBM January 2004  –  June 2007  (3 years 6 months) Software engineer IBM January 2004  –  June 2007  (3 years 6 months) Education Dalhousie University MSc,  Computer Science 1999  – 2002 Shanghai Jiao Tong University Dalhousie University MSc,  Computer Science 1999  – 2002 Dalhousie University MSc,  Computer Science 1999  – 2002 Dalhousie University MSc,  Computer Science 1999  – 2002 Shanghai Jiao Tong University Shanghai Jiao Tong University Shanghai Jiao Tong University ", "Skills Requirements Analysis Business Intelligence Cash Management Fixed Assets Purchasing Accounts Payable ERP Accounts Receivable Business Analysis Integration Oracle Applications Process Improvement Software Project... Enterprise Software Project Delivery Proposal Writing Account Reconciliation Bookkeeping Small Business Consulting General Ledger Nonprofits PMP Project Management Management Change Management See 11+     See less Skills  Requirements Analysis Business Intelligence Cash Management Fixed Assets Purchasing Accounts Payable ERP Accounts Receivable Business Analysis Integration Oracle Applications Process Improvement Software Project... Enterprise Software Project Delivery Proposal Writing Account Reconciliation Bookkeeping Small Business Consulting General Ledger Nonprofits PMP Project Management Management Change Management See 11+     See less Requirements Analysis Business Intelligence Cash Management Fixed Assets Purchasing Accounts Payable ERP Accounts Receivable Business Analysis Integration Oracle Applications Process Improvement Software Project... Enterprise Software Project Delivery Proposal Writing Account Reconciliation Bookkeeping Small Business Consulting General Ledger Nonprofits PMP Project Management Management Change Management See 11+     See less Requirements Analysis Business Intelligence Cash Management Fixed Assets Purchasing Accounts Payable ERP Accounts Receivable Business Analysis Integration Oracle Applications Process Improvement Software Project... Enterprise Software Project Delivery Proposal Writing Account Reconciliation Bookkeeping Small Business Consulting General Ledger Nonprofits PMP Project Management Management Change Management See 11+     See less ", "Summary I have fourteen years’ experience in developing and delivering software solutions to global clients. I am focused on continuous improvement, and on applying DevOps and Agile techniques to produce quality software that meets customer needs. \n \nI have achieved deep experience in lifecycle management for producing enterprise software. As a technical leader, I understand the importance of excellent interpersonal skills and a strong technical acumen to mentor the best from a team. I am an enthusiastic team player with the ability to develop strong relationships across the business. \n \nTechnical Skills Summary  \n \nI have had the opportunity to develop my skills in many aspects of software engineering including: \n \nDevOps, Agile methodologies, object-oriented analysis and design, systems architecture, design patterns, data modelling, automated testing, build and product release management, source control and stream modelling, web services, internationalisation, accessibility, security, cross-browser/platform support, technical documentation. \n \n* Collaboration Tools: JIRA, Rational CLM, IBM Connections, Jenkins, MS Project \n* Languages/Utilities: Java, Java EE, SQL, XML, XSLT, HTML, JavaScript, ColdFusion MX, Web Services, Ant, JUnit, Log4j, JSSE, Eclipse \n* Application Servers: WebSphere, WebLogic, JBoss, Tomcat \n* Database Applications: Oracle, DB2, SQL Server, H2, MySQL Summary I have fourteen years’ experience in developing and delivering software solutions to global clients. I am focused on continuous improvement, and on applying DevOps and Agile techniques to produce quality software that meets customer needs. \n \nI have achieved deep experience in lifecycle management for producing enterprise software. As a technical leader, I understand the importance of excellent interpersonal skills and a strong technical acumen to mentor the best from a team. I am an enthusiastic team player with the ability to develop strong relationships across the business. \n \nTechnical Skills Summary  \n \nI have had the opportunity to develop my skills in many aspects of software engineering including: \n \nDevOps, Agile methodologies, object-oriented analysis and design, systems architecture, design patterns, data modelling, automated testing, build and product release management, source control and stream modelling, web services, internationalisation, accessibility, security, cross-browser/platform support, technical documentation. \n \n* Collaboration Tools: JIRA, Rational CLM, IBM Connections, Jenkins, MS Project \n* Languages/Utilities: Java, Java EE, SQL, XML, XSLT, HTML, JavaScript, ColdFusion MX, Web Services, Ant, JUnit, Log4j, JSSE, Eclipse \n* Application Servers: WebSphere, WebLogic, JBoss, Tomcat \n* Database Applications: Oracle, DB2, SQL Server, H2, MySQL I have fourteen years’ experience in developing and delivering software solutions to global clients. I am focused on continuous improvement, and on applying DevOps and Agile techniques to produce quality software that meets customer needs. \n \nI have achieved deep experience in lifecycle management for producing enterprise software. As a technical leader, I understand the importance of excellent interpersonal skills and a strong technical acumen to mentor the best from a team. I am an enthusiastic team player with the ability to develop strong relationships across the business. \n \nTechnical Skills Summary  \n \nI have had the opportunity to develop my skills in many aspects of software engineering including: \n \nDevOps, Agile methodologies, object-oriented analysis and design, systems architecture, design patterns, data modelling, automated testing, build and product release management, source control and stream modelling, web services, internationalisation, accessibility, security, cross-browser/platform support, technical documentation. \n \n* Collaboration Tools: JIRA, Rational CLM, IBM Connections, Jenkins, MS Project \n* Languages/Utilities: Java, Java EE, SQL, XML, XSLT, HTML, JavaScript, ColdFusion MX, Web Services, Ant, JUnit, Log4j, JSSE, Eclipse \n* Application Servers: WebSphere, WebLogic, JBoss, Tomcat \n* Database Applications: Oracle, DB2, SQL Server, H2, MySQL I have fourteen years’ experience in developing and delivering software solutions to global clients. I am focused on continuous improvement, and on applying DevOps and Agile techniques to produce quality software that meets customer needs. \n \nI have achieved deep experience in lifecycle management for producing enterprise software. As a technical leader, I understand the importance of excellent interpersonal skills and a strong technical acumen to mentor the best from a team. I am an enthusiastic team player with the ability to develop strong relationships across the business. \n \nTechnical Skills Summary  \n \nI have had the opportunity to develop my skills in many aspects of software engineering including: \n \nDevOps, Agile methodologies, object-oriented analysis and design, systems architecture, design patterns, data modelling, automated testing, build and product release management, source control and stream modelling, web services, internationalisation, accessibility, security, cross-browser/platform support, technical documentation. \n \n* Collaboration Tools: JIRA, Rational CLM, IBM Connections, Jenkins, MS Project \n* Languages/Utilities: Java, Java EE, SQL, XML, XSLT, HTML, JavaScript, ColdFusion MX, Web Services, Ant, JUnit, Log4j, JSSE, Eclipse \n* Application Servers: WebSphere, WebLogic, JBoss, Tomcat \n* Database Applications: Oracle, DB2, SQL Server, H2, MySQL Experience Software Release Manager IBM Cúram and Smarter Care September 2013  – Present (2 years) IBM Technology Campus, Damastown, Dublin 15 Cúram is the leading provider of solutions for health and social program management. \n \nResponsibilities: \n* Define product release strategy and schedule \n* Manage multiple software contributions from global development organisation \n* Technical leadership: co-ordinate product releases, communicate across business functions, manage and mitigate release risk, drive product quality, mentor team members, collaborate with senior management \n* Provide clear status reporting readiness at all times \n \nAchievements: \n* Ensure product releases delivered as planned \n* Establish new practices for controlling and communicating accurate release status across large organisation using dashboards, wikis and other social tools \n* Become a recognised leader within the organisation; a bridge between stakeholders \n* Improve development practices including migration to Rational CLM \n* Adhere to principle of continuously improving, influence development methodologies Software Release Manager IBM Cúram and Smarter Care September 2013  – Present (2 years) IBM Technology Campus, Damastown, Dublin 15 Cúram is the leading provider of solutions for health and social program management. \n \nResponsibilities: \n* Define product release strategy and schedule \n* Manage multiple software contributions from global development organisation \n* Technical leadership: co-ordinate product releases, communicate across business functions, manage and mitigate release risk, drive product quality, mentor team members, collaborate with senior management \n* Provide clear status reporting readiness at all times \n \nAchievements: \n* Ensure product releases delivered as planned \n* Establish new practices for controlling and communicating accurate release status across large organisation using dashboards, wikis and other social tools \n* Become a recognised leader within the organisation; a bridge between stakeholders \n* Improve development practices including migration to Rational CLM \n* Adhere to principle of continuously improving, influence development methodologies Software Release Manager IBM Cúram and Smarter Care September 2013  – Present (2 years) IBM Technology Campus, Damastown, Dublin 15 Cúram is the leading provider of solutions for health and social program management. \n \nResponsibilities: \n* Define product release strategy and schedule \n* Manage multiple software contributions from global development organisation \n* Technical leadership: co-ordinate product releases, communicate across business functions, manage and mitigate release risk, drive product quality, mentor team members, collaborate with senior management \n* Provide clear status reporting readiness at all times \n \nAchievements: \n* Ensure product releases delivered as planned \n* Establish new practices for controlling and communicating accurate release status across large organisation using dashboards, wikis and other social tools \n* Become a recognised leader within the organisation; a bridge between stakeholders \n* Improve development practices including migration to Rational CLM \n* Adhere to principle of continuously improving, influence development methodologies Languages English English English Skills Agile Methodologies Software Development Project Delivery Release Management Software Project... DevOps Scrum Java Enterprise Edition Web Services XML News Writing Ant SQL Java Requirements Analysis JUnit MySQL Enterprise Software Eclipse Tomcat Weblogic WebSphere See 7+     See less Skills  Agile Methodologies Software Development Project Delivery Release Management Software Project... DevOps Scrum Java Enterprise Edition Web Services XML News Writing Ant SQL Java Requirements Analysis JUnit MySQL Enterprise Software Eclipse Tomcat Weblogic WebSphere See 7+     See less Agile Methodologies Software Development Project Delivery Release Management Software Project... DevOps Scrum Java Enterprise Edition Web Services XML News Writing Ant SQL Java Requirements Analysis JUnit MySQL Enterprise Software Eclipse Tomcat Weblogic WebSphere See 7+     See less Agile Methodologies Software Development Project Delivery Release Management Software Project... DevOps Scrum Java Enterprise Edition Web Services XML News Writing Ant SQL Java Requirements Analysis JUnit MySQL Enterprise Software Eclipse Tomcat Weblogic WebSphere See 7+     See less ", "Summary Experienced program & release manager, leading WW Software Development teams in the delivery of enterprise leading software solutions to market. Experience with Agile Software development, world wide development teams, SaaS, Dev Ops, Cloud Planning & Operations, IBM Collaboration Solutions tools and Systems Test Engineering methods. \n \n \nSpecialties: Social Business, program management, quality management, stakeholder management, decision making, negotiation, planning complex projects. \n \nTools: RTC, IBM Connections, Microsoft Project Summary Experienced program & release manager, leading WW Software Development teams in the delivery of enterprise leading software solutions to market. Experience with Agile Software development, world wide development teams, SaaS, Dev Ops, Cloud Planning & Operations, IBM Collaboration Solutions tools and Systems Test Engineering methods. \n \n \nSpecialties: Social Business, program management, quality management, stakeholder management, decision making, negotiation, planning complex projects. \n \nTools: RTC, IBM Connections, Microsoft Project Experienced program & release manager, leading WW Software Development teams in the delivery of enterprise leading software solutions to market. Experience with Agile Software development, world wide development teams, SaaS, Dev Ops, Cloud Planning & Operations, IBM Collaboration Solutions tools and Systems Test Engineering methods. \n \n \nSpecialties: Social Business, program management, quality management, stakeholder management, decision making, negotiation, planning complex projects. \n \nTools: RTC, IBM Connections, Microsoft Project Experienced program & release manager, leading WW Software Development teams in the delivery of enterprise leading software solutions to market. Experience with Agile Software development, world wide development teams, SaaS, Dev Ops, Cloud Planning & Operations, IBM Collaboration Solutions tools and Systems Test Engineering methods. \n \n \nSpecialties: Social Business, program management, quality management, stakeholder management, decision making, negotiation, planning complex projects. \n \nTools: RTC, IBM Connections, Microsoft Project Experience Smarter Workforce Release Manager IBM January 2013  – Present (2 years 8 months) http://www.kenexa.com/SmarterWorkforce/Solutions \n \nProgram and Release Manager for Smarter Workforce Analytics.  \nLeading WW team in the development of the Big Data Analytics Platform which deliveries Advanced Analytics and Talent Insights to IBM Kenexa clients. The projects in this area aim to deliver Business Intelligence, Cognitive and Predictive Analytics solutions to market. In 2014 lead the release of IBM Kenexa Talent Insights.  \n \nhttps://www.youtube.com/watch?v=C2BtcrQiOO4 IBM Connections Release Manager IBM January 2007  –  January 2013  (6 years 1 month) Dublin, Ireland IBM Connections is Social Collaboration Software for Enterprise. \nConnections enables corporations to grow as a Social Business, through its offering of collaboration services that includes social profiles and networking, communities, activities, wikis and files. \nAs Release Manager I am responsible for the delivery of product offering, from concept through development, to general availability. I am the guardian of Integrated Product Development methods compliance for all teams delivering within the offering, leading a world class development and cross-functional organization across 7 timezones. \nStrengths: Program management, WW cross team leadership, managing large projects, Social Business & Collaboration IBM Quality Program Manager IBM January 2004  –  December 2006  (3 years) Dublin, Ireland As Quality Program manager I managed the product installation quality of IBM System z and IBM System p for EMEA and AP. \nI represented IBM as Quality Advocate for Hitachi, OEM. \nI conceptualized and the lead design and development of a comprehensive software solution to manage customer quality calls, to secure closed loop process from issue registration, customer resolution within TAT, root cause analysis though process improvement. This was deployed WW by IBM Systems Series manufacturing. \nIn 2 years achieved >98% Defect Free Installation rate for System z. \nStrengths: Process Innovation, Process Improvement, Negotiation, Program Leadership, Client Advocacy Lead Systems Test Engineer IBM May 1999  –  December 2003  (4 years 8 months) Dublin, Ireland Systems Test Engineering Lead for System z and System p server brands. Lead the systems test engineering and media production engineering teams in Test Process for the Dublin systems fulfillment plant. System z & p debug specialist, test process specialist, 365 support of test process, system applications and test systems. \nManufacturing process and systems expert. \nConsistent high performance, dedication to clients success. \nStrengths: Test Process Definition, Systems Automation, Manufacturing Process Improvement, Lean Manufacturing, Six Sigma, Cycle Time Reduction, Technical Team Leadership, ISO 9001 Audit & Compliance Smarter Workforce Release Manager IBM January 2013  – Present (2 years 8 months) http://www.kenexa.com/SmarterWorkforce/Solutions \n \nProgram and Release Manager for Smarter Workforce Analytics.  \nLeading WW team in the development of the Big Data Analytics Platform which deliveries Advanced Analytics and Talent Insights to IBM Kenexa clients. The projects in this area aim to deliver Business Intelligence, Cognitive and Predictive Analytics solutions to market. In 2014 lead the release of IBM Kenexa Talent Insights.  \n \nhttps://www.youtube.com/watch?v=C2BtcrQiOO4 Smarter Workforce Release Manager IBM January 2013  – Present (2 years 8 months) http://www.kenexa.com/SmarterWorkforce/Solutions \n \nProgram and Release Manager for Smarter Workforce Analytics.  \nLeading WW team in the development of the Big Data Analytics Platform which deliveries Advanced Analytics and Talent Insights to IBM Kenexa clients. The projects in this area aim to deliver Business Intelligence, Cognitive and Predictive Analytics solutions to market. In 2014 lead the release of IBM Kenexa Talent Insights.  \n \nhttps://www.youtube.com/watch?v=C2BtcrQiOO4 IBM Connections Release Manager IBM January 2007  –  January 2013  (6 years 1 month) Dublin, Ireland IBM Connections is Social Collaboration Software for Enterprise. \nConnections enables corporations to grow as a Social Business, through its offering of collaboration services that includes social profiles and networking, communities, activities, wikis and files. \nAs Release Manager I am responsible for the delivery of product offering, from concept through development, to general availability. I am the guardian of Integrated Product Development methods compliance for all teams delivering within the offering, leading a world class development and cross-functional organization across 7 timezones. \nStrengths: Program management, WW cross team leadership, managing large projects, Social Business & Collaboration IBM Connections Release Manager IBM January 2007  –  January 2013  (6 years 1 month) Dublin, Ireland IBM Connections is Social Collaboration Software for Enterprise. \nConnections enables corporations to grow as a Social Business, through its offering of collaboration services that includes social profiles and networking, communities, activities, wikis and files. \nAs Release Manager I am responsible for the delivery of product offering, from concept through development, to general availability. I am the guardian of Integrated Product Development methods compliance for all teams delivering within the offering, leading a world class development and cross-functional organization across 7 timezones. \nStrengths: Program management, WW cross team leadership, managing large projects, Social Business & Collaboration IBM Quality Program Manager IBM January 2004  –  December 2006  (3 years) Dublin, Ireland As Quality Program manager I managed the product installation quality of IBM System z and IBM System p for EMEA and AP. \nI represented IBM as Quality Advocate for Hitachi, OEM. \nI conceptualized and the lead design and development of a comprehensive software solution to manage customer quality calls, to secure closed loop process from issue registration, customer resolution within TAT, root cause analysis though process improvement. This was deployed WW by IBM Systems Series manufacturing. \nIn 2 years achieved >98% Defect Free Installation rate for System z. \nStrengths: Process Innovation, Process Improvement, Negotiation, Program Leadership, Client Advocacy IBM Quality Program Manager IBM January 2004  –  December 2006  (3 years) Dublin, Ireland As Quality Program manager I managed the product installation quality of IBM System z and IBM System p for EMEA and AP. \nI represented IBM as Quality Advocate for Hitachi, OEM. \nI conceptualized and the lead design and development of a comprehensive software solution to manage customer quality calls, to secure closed loop process from issue registration, customer resolution within TAT, root cause analysis though process improvement. This was deployed WW by IBM Systems Series manufacturing. \nIn 2 years achieved >98% Defect Free Installation rate for System z. \nStrengths: Process Innovation, Process Improvement, Negotiation, Program Leadership, Client Advocacy Lead Systems Test Engineer IBM May 1999  –  December 2003  (4 years 8 months) Dublin, Ireland Systems Test Engineering Lead for System z and System p server brands. Lead the systems test engineering and media production engineering teams in Test Process for the Dublin systems fulfillment plant. System z & p debug specialist, test process specialist, 365 support of test process, system applications and test systems. \nManufacturing process and systems expert. \nConsistent high performance, dedication to clients success. \nStrengths: Test Process Definition, Systems Automation, Manufacturing Process Improvement, Lean Manufacturing, Six Sigma, Cycle Time Reduction, Technical Team Leadership, ISO 9001 Audit & Compliance Lead Systems Test Engineer IBM May 1999  –  December 2003  (4 years 8 months) Dublin, Ireland Systems Test Engineering Lead for System z and System p server brands. Lead the systems test engineering and media production engineering teams in Test Process for the Dublin systems fulfillment plant. System z & p debug specialist, test process specialist, 365 support of test process, system applications and test systems. \nManufacturing process and systems expert. \nConsistent high performance, dedication to clients success. \nStrengths: Test Process Definition, Systems Automation, Manufacturing Process Improvement, Lean Manufacturing, Six Sigma, Cycle Time Reduction, Technical Team Leadership, ISO 9001 Audit & Compliance Languages French Limited working proficiency French Limited working proficiency French Limited working proficiency Limited working proficiency Skills Social Business Social Software Enterprise Collaboration Program Management Process Improvement Cross-functional Team... Collaboration Six Sigma Project Management Software Development Testing Smarter Workforce Team Leadership Change Management Product Development Leadership Management Enterprise Software Integration Manufacturing Software Project... Agile Methodologies Business Strategy Cloud Computing Requirements Analysis SaaS Business Intelligence Lean Manufacturing Business Process Business Process... See 15+     See less Skills  Social Business Social Software Enterprise Collaboration Program Management Process Improvement Cross-functional Team... Collaboration Six Sigma Project Management Software Development Testing Smarter Workforce Team Leadership Change Management Product Development Leadership Management Enterprise Software Integration Manufacturing Software Project... Agile Methodologies Business Strategy Cloud Computing Requirements Analysis SaaS Business Intelligence Lean Manufacturing Business Process Business Process... See 15+     See less Social Business Social Software Enterprise Collaboration Program Management Process Improvement Cross-functional Team... Collaboration Six Sigma Project Management Software Development Testing Smarter Workforce Team Leadership Change Management Product Development Leadership Management Enterprise Software Integration Manufacturing Software Project... Agile Methodologies Business Strategy Cloud Computing Requirements Analysis SaaS Business Intelligence Lean Manufacturing Business Process Business Process... See 15+     See less Social Business Social Software Enterprise Collaboration Program Management Process Improvement Cross-functional Team... Collaboration Six Sigma Project Management Software Development Testing Smarter Workforce Team Leadership Change Management Product Development Leadership Management Enterprise Software Integration Manufacturing Software Project... Agile Methodologies Business Strategy Cloud Computing Requirements Analysis SaaS Business Intelligence Lean Manufacturing Business Process Business Process... See 15+     See less Education NITM, University College Dublin MSc,  Technology Management 2003  – 2005 Finance & Business Strategy \nProcess & Product Innovation \nOrganizational change, Leadership & organize to innovate \nMarketing & communications Dublin City University Bachelor,  Physics 1994  – 1998 NITM, University College Dublin MSc,  Technology Management 2003  – 2005 Finance & Business Strategy \nProcess & Product Innovation \nOrganizational change, Leadership & organize to innovate \nMarketing & communications NITM, University College Dublin MSc,  Technology Management 2003  – 2005 Finance & Business Strategy \nProcess & Product Innovation \nOrganizational change, Leadership & organize to innovate \nMarketing & communications NITM, University College Dublin MSc,  Technology Management 2003  – 2005 Finance & Business Strategy \nProcess & Product Innovation \nOrganizational change, Leadership & organize to innovate \nMarketing & communications Dublin City University Bachelor,  Physics 1994  – 1998 Dublin City University Bachelor,  Physics 1994  – 1998 Dublin City University Bachelor,  Physics 1994  – 1998 ", "Summary Managing large scale software and infrastructure releases which includes major/minor projects, enhancements and maintenance items with multiple vendors involved. Summary Managing large scale software and infrastructure releases which includes major/minor projects, enhancements and maintenance items with multiple vendors involved. Managing large scale software and infrastructure releases which includes major/minor projects, enhancements and maintenance items with multiple vendors involved. Managing large scale software and infrastructure releases which includes major/minor projects, enhancements and maintenance items with multiple vendors involved. Experience Vendor Support Release Manager IBM Global Business Process Services July 2013  – Present (2 years 2 months) Kuala Lumpur, Malaysia Managing large scale SAP & non-SAP releases from multiple vendors. SAP Segment release manager IBM Global Business Process Services September 2012  –  June 2013  (10 months) Managing complex releases for a specific FVC segment. SAP Release Manager IBM September 2010  –  August 2012  (2 years) Bangalore Application release SAP Release Analyst IBM September 2008  –  August 2010  (2 years) Analyst to release manager Tech support Executive IBM Global Process Services September 2006  –  August 2008  (2 years) ISP support or Virgin Media Vendor Support Release Manager IBM Global Business Process Services July 2013  – Present (2 years 2 months) Kuala Lumpur, Malaysia Managing large scale SAP & non-SAP releases from multiple vendors. Vendor Support Release Manager IBM Global Business Process Services July 2013  – Present (2 years 2 months) Kuala Lumpur, Malaysia Managing large scale SAP & non-SAP releases from multiple vendors. SAP Segment release manager IBM Global Business Process Services September 2012  –  June 2013  (10 months) Managing complex releases for a specific FVC segment. SAP Segment release manager IBM Global Business Process Services September 2012  –  June 2013  (10 months) Managing complex releases for a specific FVC segment. SAP Release Manager IBM September 2010  –  August 2012  (2 years) Bangalore Application release SAP Release Manager IBM September 2010  –  August 2012  (2 years) Bangalore Application release SAP Release Analyst IBM September 2008  –  August 2010  (2 years) Analyst to release manager SAP Release Analyst IBM September 2008  –  August 2010  (2 years) Analyst to release manager Tech support Executive IBM Global Process Services September 2006  –  August 2008  (2 years) ISP support or Virgin Media Tech support Executive IBM Global Process Services September 2006  –  August 2008  (2 years) ISP support or Virgin Media Languages English Hindi Punjabi English Hindi Punjabi English Hindi Punjabi Skills Release Management Change Management Incident Management Team Management IT Service Management IT Service Delivery SAP Project Management SAP Projects SLA Oracle SDLC Vendor Management ITIL Service Delivery Solution Architecture transport express DevOps CHARMM Management Requirements Analysis Business Analysis Outsourcing Integration See 8+     See less Skills  Release Management Change Management Incident Management Team Management IT Service Management IT Service Delivery SAP Project Management SAP Projects SLA Oracle SDLC Vendor Management ITIL Service Delivery Solution Architecture transport express DevOps CHARMM Management Requirements Analysis Business Analysis Outsourcing Integration See 8+     See less Release Management Change Management Incident Management Team Management IT Service Management IT Service Delivery SAP Project Management SAP Projects SLA Oracle SDLC Vendor Management ITIL Service Delivery Solution Architecture transport express DevOps CHARMM Management Requirements Analysis Business Analysis Outsourcing Integration See 8+     See less Release Management Change Management Incident Management Team Management IT Service Management IT Service Delivery SAP Project Management SAP Projects SLA Oracle SDLC Vendor Management ITIL Service Delivery Solution Architecture transport express DevOps CHARMM Management Requirements Analysis Business Analysis Outsourcing Integration See 8+     See less Education ICFAI University Master of Business Administration (MBA),  Marketing/Marketing Management , General 2011  – 2014 MBA Activities and Societies:  Marketing role play Hans Raj College Bachelor of Science (BSc),  Chemistry 2002  – 2005 Bsc (G) Activities and Societies:  Dramatic & debate ICFAI University Master of Business Administration (MBA),  Marketing/Marketing Management , General 2011  – 2014 MBA Activities and Societies:  Marketing role play ICFAI University Master of Business Administration (MBA),  Marketing/Marketing Management , General 2011  – 2014 MBA Activities and Societies:  Marketing role play ICFAI University Master of Business Administration (MBA),  Marketing/Marketing Management , General 2011  – 2014 MBA Activities and Societies:  Marketing role play Hans Raj College Bachelor of Science (BSc),  Chemistry 2002  – 2005 Bsc (G) Activities and Societies:  Dramatic & debate Hans Raj College Bachelor of Science (BSc),  Chemistry 2002  – 2005 Bsc (G) Activities and Societies:  Dramatic & debate Hans Raj College Bachelor of Science (BSc),  Chemistry 2002  – 2005 Bsc (G) Activities and Societies:  Dramatic & debate Honors & Awards IBM Shining Star IBM March 2009 IBM Bravo Award IBM June 2010 IBM Service Excellence Award IBM September 2012 IBM Emincene and Excellence Award IBM May 2013 IBM Shining Star IBM March 2009 IBM Shining Star IBM March 2009 IBM Shining Star IBM March 2009 IBM Bravo Award IBM June 2010 IBM Bravo Award IBM June 2010 IBM Bravo Award IBM June 2010 IBM Service Excellence Award IBM September 2012 IBM Service Excellence Award IBM September 2012 IBM Service Excellence Award IBM September 2012 IBM Emincene and Excellence Award IBM May 2013 IBM Emincene and Excellence Award IBM May 2013 IBM Emincene and Excellence Award IBM May 2013 ", "Experience Release Manager IBM IT service specialist IBM India Private Limited March 2014  – Present (1 year 6 months) IT Service Delivery Manager (Release manager) IBM India Private Limited December 2006  –  February 2014  (7 years 3 months) Bangalore IT Infrastructure maintenance, Change management, Release and deployment management. Customer care Officer Mphasis April 2005  –  December 2006  (1 year 9 months) Release Manager IBM Release Manager IBM IT service specialist IBM India Private Limited March 2014  – Present (1 year 6 months) IT service specialist IBM India Private Limited March 2014  – Present (1 year 6 months) IT Service Delivery Manager (Release manager) IBM India Private Limited December 2006  –  February 2014  (7 years 3 months) Bangalore IT Infrastructure maintenance, Change management, Release and deployment management. IT Service Delivery Manager (Release manager) IBM India Private Limited December 2006  –  February 2014  (7 years 3 months) Bangalore IT Infrastructure maintenance, Change management, Release and deployment management. Customer care Officer Mphasis April 2005  –  December 2006  (1 year 9 months) Customer care Officer Mphasis April 2005  –  December 2006  (1 year 9 months) Languages English Full professional proficiency Hindi Limited working proficiency Kannada Native or bilingual proficiency Telugu Full professional proficiency Tamil Limited working proficiency English Full professional proficiency Hindi Limited working proficiency Kannada Native or bilingual proficiency Telugu Full professional proficiency Tamil Limited working proficiency English Full professional proficiency Hindi Limited working proficiency Kannada Native or bilingual proficiency Telugu Full professional proficiency Tamil Limited working proficiency Full professional proficiency Limited working proficiency Native or bilingual proficiency Full professional proficiency Limited working proficiency Skills Customer Service Management Leadership Process Improvement Training Project Management Call Centers Team Leadership Team Management Customer Satisfaction Skills  Customer Service Management Leadership Process Improvement Training Project Management Call Centers Team Leadership Team Management Customer Satisfaction Customer Service Management Leadership Process Improvement Training Project Management Call Centers Team Leadership Team Management Customer Satisfaction Customer Service Management Leadership Process Improvement Training Project Management Call Centers Team Leadership Team Management Customer Satisfaction Education Bangalore University BCA Bangalore University BCA Bangalore University BCA Bangalore University BCA ", "Skills Release Management ITIL Testing Change Management Project Management Software Documentation CMMI PRINCE2 Project Planning Management Software Project... Project Portfolio... Scrum IT Strategy Agile Methodologies IT Service Management Requirements Analysis Software Development Team Leadership See 4+     See less Skills  Release Management ITIL Testing Change Management Project Management Software Documentation CMMI PRINCE2 Project Planning Management Software Project... Project Portfolio... Scrum IT Strategy Agile Methodologies IT Service Management Requirements Analysis Software Development Team Leadership See 4+     See less Release Management ITIL Testing Change Management Project Management Software Documentation CMMI PRINCE2 Project Planning Management Software Project... Project Portfolio... Scrum IT Strategy Agile Methodologies IT Service Management Requirements Analysis Software Development Team Leadership See 4+     See less Release Management ITIL Testing Change Management Project Management Software Documentation CMMI PRINCE2 Project Planning Management Software Project... Project Portfolio... Scrum IT Strategy Agile Methodologies IT Service Management Requirements Analysis Software Development Team Leadership See 4+     See less ", "Summary 14 years of experience in IT (10.5 years in IBM) with emphasis on Product development, Release management and people management \n \n- Experienced in handling the Integrated Product delivery processes, interfacing and managing geographically distributed teams \n- Ability to negotitate and convert the requirements from the stakeholders into release & associated sprint plans \n- Strong track record of leading and executing Agile methodologies \n- Excellent communication, interpersonal & analytical skills with ability to thrive in both independent and collaborative work environments \n- Demonstrated continuous improvement in quality & automation for a multitude of deliveries \n- Good people management skills : Nurturing Top Performance, Skill / professional Development, Setting career Roadmaps, Connect / Feedback programs etc. Summary 14 years of experience in IT (10.5 years in IBM) with emphasis on Product development, Release management and people management \n \n- Experienced in handling the Integrated Product delivery processes, interfacing and managing geographically distributed teams \n- Ability to negotitate and convert the requirements from the stakeholders into release & associated sprint plans \n- Strong track record of leading and executing Agile methodologies \n- Excellent communication, interpersonal & analytical skills with ability to thrive in both independent and collaborative work environments \n- Demonstrated continuous improvement in quality & automation for a multitude of deliveries \n- Good people management skills : Nurturing Top Performance, Skill / professional Development, Setting career Roadmaps, Connect / Feedback programs etc. 14 years of experience in IT (10.5 years in IBM) with emphasis on Product development, Release management and people management \n \n- Experienced in handling the Integrated Product delivery processes, interfacing and managing geographically distributed teams \n- Ability to negotitate and convert the requirements from the stakeholders into release & associated sprint plans \n- Strong track record of leading and executing Agile methodologies \n- Excellent communication, interpersonal & analytical skills with ability to thrive in both independent and collaborative work environments \n- Demonstrated continuous improvement in quality & automation for a multitude of deliveries \n- Good people management skills : Nurturing Top Performance, Skill / professional Development, Setting career Roadmaps, Connect / Feedback programs etc. 14 years of experience in IT (10.5 years in IBM) with emphasis on Product development, Release management and people management \n \n- Experienced in handling the Integrated Product delivery processes, interfacing and managing geographically distributed teams \n- Ability to negotitate and convert the requirements from the stakeholders into release & associated sprint plans \n- Strong track record of leading and executing Agile methodologies \n- Excellent communication, interpersonal & analytical skills with ability to thrive in both independent and collaborative work environments \n- Demonstrated continuous improvement in quality & automation for a multitude of deliveries \n- Good people management skills : Nurturing Top Performance, Skill / professional Development, Setting career Roadmaps, Connect / Feedback programs etc. Experience Release Manager IBM January 2012  – Present (3 years 8 months) Bengaluru Area, India As a Release Manager at IBM - Cloud & Smarter Infrastructure division, in the last 3+ years I was responsible for delivering the Install / Deployment for Jazz for Service Management (JazzSM - the platform) which is a set of inter-connected technologies and specifications. JazzSM comprised of common services to enable diverse service management products to be used together providing an integrated experience to their users.  \n \nDuring this, I setup the Install mission for Jazz for Service Management based on the Rational Installation Manager technology. Strong track record of delivery excellence in getting the base release on schedule with quality and also subsequently handling the mod releases, level 3 (support) queries and fixes / fixpack releases effectively. \n \nMore recently (since 2014), I am handling the release management for the common capabilities and automation for providing the service management offerings on the cloud. Working with the team to add capabilities to complement a wide range of offerings.  \n \nAs we add and integrate these new capabilities, our driving goals are to: \n- Enable the SaaS Application/Offering Developer to focus on the Application capabilities, and not the deployment automation while services are deployed and integrations between services snap together (as customers buy services) \n- Reduce time to value, so clients can be up and running in minutes versus days, as would be needed with SaaS and on-premises installation and integrations \n- Deploying reporting capabilities for both SaaS and on-premises products Development Manager IBM March 2010  –  December 2011  (1 year 10 months) Bangalore, India I was responsible for driving the set of components under the Tivoli Navigation Initiative to provide guidance, conventions and tooling that can be used by development teams to streamline user interactions / user interfaces for the process infrastructure and individual products. \n \n- Driving the base release for Tivoli (Tivoli Extensions for Dojo) and consolidation of the various Dojo based missions ( Web Component Library (WCL) & Abstract User Interface Markup Language (AUIML)) \n- Worked with the team comprising Architects & Chief programmers that helped in a strong influence of 20+ adoptions of the component by SWG and STG product portfolio \n- Project managed the transition of AUIML – legacy UI component from Krakow to ISL. Henceforth initiated Community model for legacy UI components with technical contribution from adopters. This resulted in collaboration across teams and also enabled the rotation of resources to other key missions. Project Lead IBM June 2004  –  February 2010  (5 years 9 months) Bengaluru Area, India Switched gears to join IBM - India Software Labs in 2004 as a Team lead, part of the Autonomic Computing division that comprised of several components which were reused by multiple products across brands in the Software Group. \n \nProgressed from the role of an individual contributor to a lead and then project manager over the years where I was responsible for driving a team of 20+ engineers. Worked with the local and the global teams comprising the Offering Lead, and Release Manager to drive and deliver the components that aid in Log Analysis, Problem Determination, Hosted Diagnostics etc. Team Lead Accenture January 2003  –  May 2004  (1 year 5 months) Bengaluru Area, India Continuing on the project delivery model, I joined Accenture as a Team lead. This includes an onsite assignment at U.S to transition the J2EE project that handled the health insurance inquiry/claims/approval (complying to HIPAA standards) \n \n•\tPlayed the role of technical Lead for the J2EE application – Originally developed and maintained for one of the largest Health Care company at onsite U.S \n•\tManaged the team to resolve transition issues from the client and obtain the required sign-off \n•\tEffectively supported the applications on a 24 * 7 basis at offshore to deliver solution for the customers Software Engineer Satyam Computer Services March 2000  –  November 2002  (2 years 9 months) Bangalore My inception into the IT industry started as an Individual contributor at Satyam Computer Services (now Mahindra Satyam) implementing Java / J2EE based projects for the leading worldwide financial services company. This also involved onsite assignments at Zurich, Athens, London for Requirements Gathering and successful demonstration of the proof of concepts.  \n \nBriefly worked as a consultant under Satyam - Hewlett Packard Contract to implement a PLM solution at Hsinchu, Taiwan for ProMOS Technologies Inc, which accounts for ~ 5% of the worldwide DRAM market. Release Manager IBM January 2012  – Present (3 years 8 months) Bengaluru Area, India As a Release Manager at IBM - Cloud & Smarter Infrastructure division, in the last 3+ years I was responsible for delivering the Install / Deployment for Jazz for Service Management (JazzSM - the platform) which is a set of inter-connected technologies and specifications. JazzSM comprised of common services to enable diverse service management products to be used together providing an integrated experience to their users.  \n \nDuring this, I setup the Install mission for Jazz for Service Management based on the Rational Installation Manager technology. Strong track record of delivery excellence in getting the base release on schedule with quality and also subsequently handling the mod releases, level 3 (support) queries and fixes / fixpack releases effectively. \n \nMore recently (since 2014), I am handling the release management for the common capabilities and automation for providing the service management offerings on the cloud. Working with the team to add capabilities to complement a wide range of offerings.  \n \nAs we add and integrate these new capabilities, our driving goals are to: \n- Enable the SaaS Application/Offering Developer to focus on the Application capabilities, and not the deployment automation while services are deployed and integrations between services snap together (as customers buy services) \n- Reduce time to value, so clients can be up and running in minutes versus days, as would be needed with SaaS and on-premises installation and integrations \n- Deploying reporting capabilities for both SaaS and on-premises products Release Manager IBM January 2012  – Present (3 years 8 months) Bengaluru Area, India As a Release Manager at IBM - Cloud & Smarter Infrastructure division, in the last 3+ years I was responsible for delivering the Install / Deployment for Jazz for Service Management (JazzSM - the platform) which is a set of inter-connected technologies and specifications. JazzSM comprised of common services to enable diverse service management products to be used together providing an integrated experience to their users.  \n \nDuring this, I setup the Install mission for Jazz for Service Management based on the Rational Installation Manager technology. Strong track record of delivery excellence in getting the base release on schedule with quality and also subsequently handling the mod releases, level 3 (support) queries and fixes / fixpack releases effectively. \n \nMore recently (since 2014), I am handling the release management for the common capabilities and automation for providing the service management offerings on the cloud. Working with the team to add capabilities to complement a wide range of offerings.  \n \nAs we add and integrate these new capabilities, our driving goals are to: \n- Enable the SaaS Application/Offering Developer to focus on the Application capabilities, and not the deployment automation while services are deployed and integrations between services snap together (as customers buy services) \n- Reduce time to value, so clients can be up and running in minutes versus days, as would be needed with SaaS and on-premises installation and integrations \n- Deploying reporting capabilities for both SaaS and on-premises products Development Manager IBM March 2010  –  December 2011  (1 year 10 months) Bangalore, India I was responsible for driving the set of components under the Tivoli Navigation Initiative to provide guidance, conventions and tooling that can be used by development teams to streamline user interactions / user interfaces for the process infrastructure and individual products. \n \n- Driving the base release for Tivoli (Tivoli Extensions for Dojo) and consolidation of the various Dojo based missions ( Web Component Library (WCL) & Abstract User Interface Markup Language (AUIML)) \n- Worked with the team comprising Architects & Chief programmers that helped in a strong influence of 20+ adoptions of the component by SWG and STG product portfolio \n- Project managed the transition of AUIML – legacy UI component from Krakow to ISL. Henceforth initiated Community model for legacy UI components with technical contribution from adopters. This resulted in collaboration across teams and also enabled the rotation of resources to other key missions. Development Manager IBM March 2010  –  December 2011  (1 year 10 months) Bangalore, India I was responsible for driving the set of components under the Tivoli Navigation Initiative to provide guidance, conventions and tooling that can be used by development teams to streamline user interactions / user interfaces for the process infrastructure and individual products. \n \n- Driving the base release for Tivoli (Tivoli Extensions for Dojo) and consolidation of the various Dojo based missions ( Web Component Library (WCL) & Abstract User Interface Markup Language (AUIML)) \n- Worked with the team comprising Architects & Chief programmers that helped in a strong influence of 20+ adoptions of the component by SWG and STG product portfolio \n- Project managed the transition of AUIML – legacy UI component from Krakow to ISL. Henceforth initiated Community model for legacy UI components with technical contribution from adopters. This resulted in collaboration across teams and also enabled the rotation of resources to other key missions. Project Lead IBM June 2004  –  February 2010  (5 years 9 months) Bengaluru Area, India Switched gears to join IBM - India Software Labs in 2004 as a Team lead, part of the Autonomic Computing division that comprised of several components which were reused by multiple products across brands in the Software Group. \n \nProgressed from the role of an individual contributor to a lead and then project manager over the years where I was responsible for driving a team of 20+ engineers. Worked with the local and the global teams comprising the Offering Lead, and Release Manager to drive and deliver the components that aid in Log Analysis, Problem Determination, Hosted Diagnostics etc. Project Lead IBM June 2004  –  February 2010  (5 years 9 months) Bengaluru Area, India Switched gears to join IBM - India Software Labs in 2004 as a Team lead, part of the Autonomic Computing division that comprised of several components which were reused by multiple products across brands in the Software Group. \n \nProgressed from the role of an individual contributor to a lead and then project manager over the years where I was responsible for driving a team of 20+ engineers. Worked with the local and the global teams comprising the Offering Lead, and Release Manager to drive and deliver the components that aid in Log Analysis, Problem Determination, Hosted Diagnostics etc. Team Lead Accenture January 2003  –  May 2004  (1 year 5 months) Bengaluru Area, India Continuing on the project delivery model, I joined Accenture as a Team lead. This includes an onsite assignment at U.S to transition the J2EE project that handled the health insurance inquiry/claims/approval (complying to HIPAA standards) \n \n•\tPlayed the role of technical Lead for the J2EE application – Originally developed and maintained for one of the largest Health Care company at onsite U.S \n•\tManaged the team to resolve transition issues from the client and obtain the required sign-off \n•\tEffectively supported the applications on a 24 * 7 basis at offshore to deliver solution for the customers Team Lead Accenture January 2003  –  May 2004  (1 year 5 months) Bengaluru Area, India Continuing on the project delivery model, I joined Accenture as a Team lead. This includes an onsite assignment at U.S to transition the J2EE project that handled the health insurance inquiry/claims/approval (complying to HIPAA standards) \n \n•\tPlayed the role of technical Lead for the J2EE application – Originally developed and maintained for one of the largest Health Care company at onsite U.S \n•\tManaged the team to resolve transition issues from the client and obtain the required sign-off \n•\tEffectively supported the applications on a 24 * 7 basis at offshore to deliver solution for the customers Software Engineer Satyam Computer Services March 2000  –  November 2002  (2 years 9 months) Bangalore My inception into the IT industry started as an Individual contributor at Satyam Computer Services (now Mahindra Satyam) implementing Java / J2EE based projects for the leading worldwide financial services company. This also involved onsite assignments at Zurich, Athens, London for Requirements Gathering and successful demonstration of the proof of concepts.  \n \nBriefly worked as a consultant under Satyam - Hewlett Packard Contract to implement a PLM solution at Hsinchu, Taiwan for ProMOS Technologies Inc, which accounts for ~ 5% of the worldwide DRAM market. Software Engineer Satyam Computer Services March 2000  –  November 2002  (2 years 9 months) Bangalore My inception into the IT industry started as an Individual contributor at Satyam Computer Services (now Mahindra Satyam) implementing Java / J2EE based projects for the leading worldwide financial services company. This also involved onsite assignments at Zurich, Athens, London for Requirements Gathering and successful demonstration of the proof of concepts.  \n \nBriefly worked as a consultant under Satyam - Hewlett Packard Contract to implement a PLM solution at Hsinchu, Taiwan for ProMOS Technologies Inc, which accounts for ~ 5% of the worldwide DRAM market. Languages English Full professional proficiency Hindi Professional working proficiency Tamil Professional working proficiency Kannada Limited working proficiency English Full professional proficiency Hindi Professional working proficiency Tamil Professional working proficiency Kannada Limited working proficiency English Full professional proficiency Hindi Professional working proficiency Tamil Professional working proficiency Kannada Limited working proficiency Full professional proficiency Professional working proficiency Professional working proficiency Limited working proficiency Skills Java Enterprise Edition SOA DB2 Websphere WebSphere Application... Eclipse Servlets Java Solution Architecture Weblogic Enterprise Architecture Unix WebSphere Software Development Agile Methodologies Software Project... Requirements Analysis SDLC Integration XML Cloud Computing See 6+     See less Skills  Java Enterprise Edition SOA DB2 Websphere WebSphere Application... Eclipse Servlets Java Solution Architecture Weblogic Enterprise Architecture Unix WebSphere Software Development Agile Methodologies Software Project... Requirements Analysis SDLC Integration XML Cloud Computing See 6+     See less Java Enterprise Edition SOA DB2 Websphere WebSphere Application... Eclipse Servlets Java Solution Architecture Weblogic Enterprise Architecture Unix WebSphere Software Development Agile Methodologies Software Project... Requirements Analysis SDLC Integration XML Cloud Computing See 6+     See less Java Enterprise Edition SOA DB2 Websphere WebSphere Application... Eclipse Servlets Java Solution Architecture Weblogic Enterprise Architecture Unix WebSphere Software Development Agile Methodologies Software Project... Requirements Analysis SDLC Integration XML Cloud Computing See 6+     See less Education Centre for Development of Advanced Computing Diploma in Advanced Computing 1999  – 2000 Bharathiar University B.E,  Electrical & Elecrtronics 1994  – 1998 Centre for Development of Advanced Computing Diploma in Advanced Computing 1999  – 2000 Centre for Development of Advanced Computing Diploma in Advanced Computing 1999  – 2000 Centre for Development of Advanced Computing Diploma in Advanced Computing 1999  – 2000 Bharathiar University B.E,  Electrical & Elecrtronics 1994  – 1998 Bharathiar University B.E,  Electrical & Elecrtronics 1994  – 1998 Bharathiar University B.E,  Electrical & Elecrtronics 1994  – 1998 ", "Summary Experienced Development Manager with a strong track record of delivering and supporting enterprise-grade software. \n \nSuccessful software solutions delivered across multiple industries (Telecoms, Financial Services ,Insurance etc), in multi-national, startup and consultancy environments. \n \nSpecialties: Software Development (incl. Java,JavaEE,Spring,Javascript,C/C++,BPM, Network Management), Customer Support Management (incl. Escalation Handling), Project Management,Team Management Summary Experienced Development Manager with a strong track record of delivering and supporting enterprise-grade software. \n \nSuccessful software solutions delivered across multiple industries (Telecoms, Financial Services ,Insurance etc), in multi-national, startup and consultancy environments. \n \nSpecialties: Software Development (incl. Java,JavaEE,Spring,Javascript,C/C++,BPM, Network Management), Customer Support Management (incl. Escalation Handling), Project Management,Team Management Experienced Development Manager with a strong track record of delivering and supporting enterprise-grade software. \n \nSuccessful software solutions delivered across multiple industries (Telecoms, Financial Services ,Insurance etc), in multi-national, startup and consultancy environments. \n \nSpecialties: Software Development (incl. Java,JavaEE,Spring,Javascript,C/C++,BPM, Network Management), Customer Support Management (incl. Escalation Handling), Project Management,Team Management Experienced Development Manager with a strong track record of delivering and supporting enterprise-grade software. \n \nSuccessful software solutions delivered across multiple industries (Telecoms, Financial Services ,Insurance etc), in multi-national, startup and consultancy environments. \n \nSpecialties: Software Development (incl. Java,JavaEE,Spring,Javascript,C/C++,BPM, Network Management), Customer Support Management (incl. Escalation Handling), Project Management,Team Management Experience Development & Release Manager IBM April 2014  – Present (1 year 5 months) Galway, Ireland Development & Release Manager for 'IBM Tivoli Network Manager' (ITNM) \nhttps://ibm.biz/BdXfmv \nhttps://ibm.biz/BdXfKs \n \nNetwork Manager provides the features necessary to manage complex networks. These features include network discovery, device polling, including storage of polled SNMP and ICMP data for reporting and analysis, and topology visualization. In addition, Network Manager can display network events, perform root-cause analysis of network events, and enrich network events with topology and other network data.  Level 3 Support Manager IBM Tivoli Software March 2012  –  April 2014  (2 years 2 months) Galway, Ireland Level 3 Support Manager for 'IBM Tivoli Network Manager' (https://ibm.biz/BdXfmv) Technical Team Lead IBM Tivoli Software 2010  –  June 2012  (2 years) Galway Technical Lead Houghton Mifflin Harcourt 2009  –  July 2010  (1 year) Dublin The role involves overall responsibility for all technical aspects of several products in the area of online learning management and assessment : including architectural decisions, estimations, daily management of developers as well as liaising with contractors and outsourced vendors. Technical Architect Kainos October 2007  –  December 2009  (2 years 3 months) Dublin 1) Technical Team Lead on a project to add new features to a large eCommerce web-site. This involved integration with legacy systems via Mule. The web-application architecture is based on Spring MVC/WebFlow. \n \n2) Technical Team Lead on a new system for a large Irish Bank which automates the business processes related to credit card accounts. The system scans in all relevant documentation using Kofax, the workflow is implemented using the TIBCO iProcess Engine and the web application uses SpringMVC. Integration is provided to a mainframe credit card processing system. Technical Expert Amdocs March 2004  –  October 2007  (3 years 8 months) Dublin Amdocs Upgrade Manager: Lead Developer on team adding new performance and usability features to an in-house tool for managing very large s/w upgrades. An agile approach was used including SCRUM meetings \n \nAmdocs Billing Platform (Collection component): Lead Developer on integration work with in-house workflow engine (BPM-based). This included \n- Being primary point of contact for all on-site and off-site groups (worldwide) \n- Clarifying requirements (working with Business Analysts), scoping several 10+ man month projects, generating timelines \n- Designing (OOAD) and reviewing with various interested parties; Implementing and testing to strict deadlines as well as scoping work for colleagues \n- Provided on-site support at Elisa, Helsinki (both pre-production and production) \n- Conducted week-long technical training in Cyprus for Amdocs Broadband Layer Developers \n- Acted as TDD trustee for the team \n \n‘Java Foundation’ Team: Contributed code to a Java framework & toolset which is used by all Java Developers across the Enterprise. Senior Software Engineer Am-Beo (now Prime Carrier) 2001  –  2004  (3 years) Galway Worked on various aspects of the rate-rec™ rating and reconciliation product, including: \n \nJava/J2EE:  \nHelped design and code J2EE baseclasses and prototype (running in JBoss app server) as part of a small team \n \nC++: \nTeam Lead responsible for developing various services in C++  \nScreen servers for Java screens ; porting of code affecting - CORBA (Orbix 2.1 to Orbix 2000,Orbix 2000 to TAO), Ascii to Unicode, W2000 to various flavours of Unix Telecommunications Engineer Lucent Technologies 1999  –  2000  (1 year) Sydney Area, Australia Developed an automated test suite for a digital multiplexer . Software Engineer Nortel 1996  –  1998  (2 years) Galway Worked on development and maintenance projects for the Meridian-1 PBX Development & Release Manager IBM April 2014  – Present (1 year 5 months) Galway, Ireland Development & Release Manager for 'IBM Tivoli Network Manager' (ITNM) \nhttps://ibm.biz/BdXfmv \nhttps://ibm.biz/BdXfKs \n \nNetwork Manager provides the features necessary to manage complex networks. These features include network discovery, device polling, including storage of polled SNMP and ICMP data for reporting and analysis, and topology visualization. In addition, Network Manager can display network events, perform root-cause analysis of network events, and enrich network events with topology and other network data.  Development & Release Manager IBM April 2014  – Present (1 year 5 months) Galway, Ireland Development & Release Manager for 'IBM Tivoli Network Manager' (ITNM) \nhttps://ibm.biz/BdXfmv \nhttps://ibm.biz/BdXfKs \n \nNetwork Manager provides the features necessary to manage complex networks. These features include network discovery, device polling, including storage of polled SNMP and ICMP data for reporting and analysis, and topology visualization. In addition, Network Manager can display network events, perform root-cause analysis of network events, and enrich network events with topology and other network data.  Level 3 Support Manager IBM Tivoli Software March 2012  –  April 2014  (2 years 2 months) Galway, Ireland Level 3 Support Manager for 'IBM Tivoli Network Manager' (https://ibm.biz/BdXfmv) Level 3 Support Manager IBM Tivoli Software March 2012  –  April 2014  (2 years 2 months) Galway, Ireland Level 3 Support Manager for 'IBM Tivoli Network Manager' (https://ibm.biz/BdXfmv) Technical Team Lead IBM Tivoli Software 2010  –  June 2012  (2 years) Galway Technical Team Lead IBM Tivoli Software 2010  –  June 2012  (2 years) Galway Technical Lead Houghton Mifflin Harcourt 2009  –  July 2010  (1 year) Dublin The role involves overall responsibility for all technical aspects of several products in the area of online learning management and assessment : including architectural decisions, estimations, daily management of developers as well as liaising with contractors and outsourced vendors. Technical Lead Houghton Mifflin Harcourt 2009  –  July 2010  (1 year) Dublin The role involves overall responsibility for all technical aspects of several products in the area of online learning management and assessment : including architectural decisions, estimations, daily management of developers as well as liaising with contractors and outsourced vendors. Technical Architect Kainos October 2007  –  December 2009  (2 years 3 months) Dublin 1) Technical Team Lead on a project to add new features to a large eCommerce web-site. This involved integration with legacy systems via Mule. The web-application architecture is based on Spring MVC/WebFlow. \n \n2) Technical Team Lead on a new system for a large Irish Bank which automates the business processes related to credit card accounts. The system scans in all relevant documentation using Kofax, the workflow is implemented using the TIBCO iProcess Engine and the web application uses SpringMVC. Integration is provided to a mainframe credit card processing system. Technical Architect Kainos October 2007  –  December 2009  (2 years 3 months) Dublin 1) Technical Team Lead on a project to add new features to a large eCommerce web-site. This involved integration with legacy systems via Mule. The web-application architecture is based on Spring MVC/WebFlow. \n \n2) Technical Team Lead on a new system for a large Irish Bank which automates the business processes related to credit card accounts. The system scans in all relevant documentation using Kofax, the workflow is implemented using the TIBCO iProcess Engine and the web application uses SpringMVC. Integration is provided to a mainframe credit card processing system. Technical Expert Amdocs March 2004  –  October 2007  (3 years 8 months) Dublin Amdocs Upgrade Manager: Lead Developer on team adding new performance and usability features to an in-house tool for managing very large s/w upgrades. An agile approach was used including SCRUM meetings \n \nAmdocs Billing Platform (Collection component): Lead Developer on integration work with in-house workflow engine (BPM-based). This included \n- Being primary point of contact for all on-site and off-site groups (worldwide) \n- Clarifying requirements (working with Business Analysts), scoping several 10+ man month projects, generating timelines \n- Designing (OOAD) and reviewing with various interested parties; Implementing and testing to strict deadlines as well as scoping work for colleagues \n- Provided on-site support at Elisa, Helsinki (both pre-production and production) \n- Conducted week-long technical training in Cyprus for Amdocs Broadband Layer Developers \n- Acted as TDD trustee for the team \n \n‘Java Foundation’ Team: Contributed code to a Java framework & toolset which is used by all Java Developers across the Enterprise. Technical Expert Amdocs March 2004  –  October 2007  (3 years 8 months) Dublin Amdocs Upgrade Manager: Lead Developer on team adding new performance and usability features to an in-house tool for managing very large s/w upgrades. An agile approach was used including SCRUM meetings \n \nAmdocs Billing Platform (Collection component): Lead Developer on integration work with in-house workflow engine (BPM-based). This included \n- Being primary point of contact for all on-site and off-site groups (worldwide) \n- Clarifying requirements (working with Business Analysts), scoping several 10+ man month projects, generating timelines \n- Designing (OOAD) and reviewing with various interested parties; Implementing and testing to strict deadlines as well as scoping work for colleagues \n- Provided on-site support at Elisa, Helsinki (both pre-production and production) \n- Conducted week-long technical training in Cyprus for Amdocs Broadband Layer Developers \n- Acted as TDD trustee for the team \n \n‘Java Foundation’ Team: Contributed code to a Java framework & toolset which is used by all Java Developers across the Enterprise. Senior Software Engineer Am-Beo (now Prime Carrier) 2001  –  2004  (3 years) Galway Worked on various aspects of the rate-rec™ rating and reconciliation product, including: \n \nJava/J2EE:  \nHelped design and code J2EE baseclasses and prototype (running in JBoss app server) as part of a small team \n \nC++: \nTeam Lead responsible for developing various services in C++  \nScreen servers for Java screens ; porting of code affecting - CORBA (Orbix 2.1 to Orbix 2000,Orbix 2000 to TAO), Ascii to Unicode, W2000 to various flavours of Unix Senior Software Engineer Am-Beo (now Prime Carrier) 2001  –  2004  (3 years) Galway Worked on various aspects of the rate-rec™ rating and reconciliation product, including: \n \nJava/J2EE:  \nHelped design and code J2EE baseclasses and prototype (running in JBoss app server) as part of a small team \n \nC++: \nTeam Lead responsible for developing various services in C++  \nScreen servers for Java screens ; porting of code affecting - CORBA (Orbix 2.1 to Orbix 2000,Orbix 2000 to TAO), Ascii to Unicode, W2000 to various flavours of Unix Telecommunications Engineer Lucent Technologies 1999  –  2000  (1 year) Sydney Area, Australia Developed an automated test suite for a digital multiplexer . Telecommunications Engineer Lucent Technologies 1999  –  2000  (1 year) Sydney Area, Australia Developed an automated test suite for a digital multiplexer . Software Engineer Nortel 1996  –  1998  (2 years) Galway Worked on development and maintenance projects for the Meridian-1 PBX Software Engineer Nortel 1996  –  1998  (2 years) Galway Worked on development and maintenance projects for the Meridian-1 PBX Languages French French French Skills Maven Eclipse JavaScript Microsoft SQL Server Integration Databases C# Perl Business Process Design Mule ESB Spring Java Enterprise Edition Agile Methodologies JSP C++ Java Oracle Unix Solution Architecture Program Management Software Development Operations Management Team Management See 8+     See less Skills  Maven Eclipse JavaScript Microsoft SQL Server Integration Databases C# Perl Business Process Design Mule ESB Spring Java Enterprise Edition Agile Methodologies JSP C++ Java Oracle Unix Solution Architecture Program Management Software Development Operations Management Team Management See 8+     See less Maven Eclipse JavaScript Microsoft SQL Server Integration Databases C# Perl Business Process Design Mule ESB Spring Java Enterprise Edition Agile Methodologies JSP C++ Java Oracle Unix Solution Architecture Program Management Software Development Operations Management Team Management See 8+     See less Maven Eclipse JavaScript Microsoft SQL Server Integration Databases C# Perl Business Process Design Mule ESB Spring Java Enterprise Edition Agile Methodologies JSP C++ Java Oracle Unix Solution Architecture Program Management Software Development Operations Management Team Management See 8+     See less Education ACCA ACCA Diploma in Financial Management,  Finance 2007  – 2008 Diploma in Financial Management National University of Ireland, Galway Electronic Engineering 1992  – 1996 St Marys College Galway 1987  – 1992 ACCA ACCA Diploma in Financial Management,  Finance 2007  – 2008 Diploma in Financial Management ACCA ACCA Diploma in Financial Management,  Finance 2007  – 2008 Diploma in Financial Management ACCA ACCA Diploma in Financial Management,  Finance 2007  – 2008 Diploma in Financial Management National University of Ireland, Galway Electronic Engineering 1992  – 1996 National University of Ireland, Galway Electronic Engineering 1992  – 1996 National University of Ireland, Galway Electronic Engineering 1992  – 1996 St Marys College Galway 1987  – 1992 St Marys College Galway 1987  – 1992 St Marys College Galway 1987  – 1992 ", "Experience Release Manager IBM Global Services Release Manager IBM 2009  –  2012  (3 years) Release Manager IBM Global Services Release Manager IBM Global Services Release Manager IBM 2009  –  2012  (3 years) Release Manager IBM 2009  –  2012  (3 years) ", "Skills Agile Methodologies Enterprise Software Software Project... Software Development SOA Enterprise Architecture Solution Architecture Scrum Unix SDLC Skills  Agile Methodologies Enterprise Software Software Project... Software Development SOA Enterprise Architecture Solution Architecture Scrum Unix SDLC Agile Methodologies Enterprise Software Software Project... Software Development SOA Enterprise Architecture Solution Architecture Scrum Unix SDLC Agile Methodologies Enterprise Software Software Project... Software Development SOA Enterprise Architecture Solution Architecture Scrum Unix SDLC ", "Summary Have deep technical background and rich experience in world wide project management with 7+ year experience as a project manager or project lead; Have been leading and managing various types of products development including server management firmware/software, storage cloud solution, Enterprise Content Management software on Cloud; Good at communications, long-range perspective, as well as systematic thinking and planning. Familiar with IBM IPD product development process and Agile approach. PMI certified PM and certified ISO9001 lead auditor. Currently working as a development manager of Enterprise Content Management SaaS offerings. Summary Have deep technical background and rich experience in world wide project management with 7+ year experience as a project manager or project lead; Have been leading and managing various types of products development including server management firmware/software, storage cloud solution, Enterprise Content Management software on Cloud; Good at communications, long-range perspective, as well as systematic thinking and planning. Familiar with IBM IPD product development process and Agile approach. PMI certified PM and certified ISO9001 lead auditor. Currently working as a development manager of Enterprise Content Management SaaS offerings. Have deep technical background and rich experience in world wide project management with 7+ year experience as a project manager or project lead; Have been leading and managing various types of products development including server management firmware/software, storage cloud solution, Enterprise Content Management software on Cloud; Good at communications, long-range perspective, as well as systematic thinking and planning. Familiar with IBM IPD product development process and Agile approach. PMI certified PM and certified ISO9001 lead auditor. Currently working as a development manager of Enterprise Content Management SaaS offerings. Have deep technical background and rich experience in world wide project management with 7+ year experience as a project manager or project lead; Have been leading and managing various types of products development including server management firmware/software, storage cloud solution, Enterprise Content Management software on Cloud; Good at communications, long-range perspective, as well as systematic thinking and planning. Familiar with IBM IPD product development process and Agile approach. PMI certified PM and certified ISO9001 lead auditor. Currently working as a development manager of Enterprise Content Management SaaS offerings. Experience Development Manager IBM May 2015  – Present (4 months) Shanghai City, China I have been Technical Project Manager of IBM System x and BladeCenter platform management firmware including Baseboard Management Controller, Remote Supervisor Adapter II and Integrated Management Module II; Project Manager of IBM Storage Cloud offerings; Currently working as Release Manager of IBM ECM (Enterprise Content Management) products and Development Manager of Enterprise Content Management SaaS offerings. ECM RELEASE MANAGER IBM July 2014  – Present (1 year 2 months) Shanghai City, China I have been Technical Project Manager of IBM System x and BladeCenter platform management firmware including Baseboard Management Controller, Remote Supervisor Adapter II and Integrated Management Module II; Project Manager of IBM Storage Cloud offerings; Currently working as Release Manager of IBM ECM (Enterprise Content Management) products and Development Manager of Enterprise Content Management SaaS offerings. Advisory Project Manager IBM October 2007  –  June 2014  (6 years 9 months) Shanghai City, China I have been Technical Project Manager of IBM System x and BladeCenter platform management firmware including Baseboard Management Controller, Remote Supervisor Adapter II and Integrated Management Module II; Project Manager of IBM Storage Cloud offerings. Software Engineer IBM May 2006  –  October 2007  (1 year 6 months) Shanghai Software engineer of IBM System x and BladeCenter platform management firmware Software Engineer Alcatel-Lucent Shanghai Bell April 2005  –  April 2006  (1 year 1 month) Shanghai Software engineer of radio development, mobile communication group Development Manager IBM May 2015  – Present (4 months) Shanghai City, China I have been Technical Project Manager of IBM System x and BladeCenter platform management firmware including Baseboard Management Controller, Remote Supervisor Adapter II and Integrated Management Module II; Project Manager of IBM Storage Cloud offerings; Currently working as Release Manager of IBM ECM (Enterprise Content Management) products and Development Manager of Enterprise Content Management SaaS offerings. Development Manager IBM May 2015  – Present (4 months) Shanghai City, China I have been Technical Project Manager of IBM System x and BladeCenter platform management firmware including Baseboard Management Controller, Remote Supervisor Adapter II and Integrated Management Module II; Project Manager of IBM Storage Cloud offerings; Currently working as Release Manager of IBM ECM (Enterprise Content Management) products and Development Manager of Enterprise Content Management SaaS offerings. ECM RELEASE MANAGER IBM July 2014  – Present (1 year 2 months) Shanghai City, China I have been Technical Project Manager of IBM System x and BladeCenter platform management firmware including Baseboard Management Controller, Remote Supervisor Adapter II and Integrated Management Module II; Project Manager of IBM Storage Cloud offerings; Currently working as Release Manager of IBM ECM (Enterprise Content Management) products and Development Manager of Enterprise Content Management SaaS offerings. ECM RELEASE MANAGER IBM July 2014  – Present (1 year 2 months) Shanghai City, China I have been Technical Project Manager of IBM System x and BladeCenter platform management firmware including Baseboard Management Controller, Remote Supervisor Adapter II and Integrated Management Module II; Project Manager of IBM Storage Cloud offerings; Currently working as Release Manager of IBM ECM (Enterprise Content Management) products and Development Manager of Enterprise Content Management SaaS offerings. Advisory Project Manager IBM October 2007  –  June 2014  (6 years 9 months) Shanghai City, China I have been Technical Project Manager of IBM System x and BladeCenter platform management firmware including Baseboard Management Controller, Remote Supervisor Adapter II and Integrated Management Module II; Project Manager of IBM Storage Cloud offerings. Advisory Project Manager IBM October 2007  –  June 2014  (6 years 9 months) Shanghai City, China I have been Technical Project Manager of IBM System x and BladeCenter platform management firmware including Baseboard Management Controller, Remote Supervisor Adapter II and Integrated Management Module II; Project Manager of IBM Storage Cloud offerings. Software Engineer IBM May 2006  –  October 2007  (1 year 6 months) Shanghai Software engineer of IBM System x and BladeCenter platform management firmware Software Engineer IBM May 2006  –  October 2007  (1 year 6 months) Shanghai Software engineer of IBM System x and BladeCenter platform management firmware Software Engineer Alcatel-Lucent Shanghai Bell April 2005  –  April 2006  (1 year 1 month) Shanghai Software engineer of radio development, mobile communication group Software Engineer Alcatel-Lucent Shanghai Bell April 2005  –  April 2006  (1 year 1 month) Shanghai Software engineer of radio development, mobile communication group Languages Chinese English Chinese English Chinese English Skills Firmware BladeCenter Software Development Linux Agile Methodologies Software Engineering Software Project... C++ C Cloud Computing Software Design Solution Architecture Virtualization Testing System Architecture Requirements Analysis See 1+     See less Skills  Firmware BladeCenter Software Development Linux Agile Methodologies Software Engineering Software Project... C++ C Cloud Computing Software Design Solution Architecture Virtualization Testing System Architecture Requirements Analysis See 1+     See less Firmware BladeCenter Software Development Linux Agile Methodologies Software Engineering Software Project... C++ C Cloud Computing Software Design Solution Architecture Virtualization Testing System Architecture Requirements Analysis See 1+     See less Firmware BladeCenter Software Development Linux Agile Methodologies Software Engineering Software Project... C++ C Cloud Computing Software Design Solution Architecture Virtualization Testing System Architecture Requirements Analysis See 1+     See less Education Zhejiang University Master,  Computer Science 2002  – 2005 Zhejiang University Bachelor,  Computer Science 1998  – 2002 Zhejiang University Master,  Computer Science 2002  – 2005 Zhejiang University Master,  Computer Science 2002  – 2005 Zhejiang University Master,  Computer Science 2002  – 2005 Zhejiang University Bachelor,  Computer Science 1998  – 2002 Zhejiang University Bachelor,  Computer Science 1998  – 2002 Zhejiang University Bachelor,  Computer Science 1998  – 2002 ", "Languages French French French Skills Agile Methodologies Web Services Java Enterprise Edition Requirements Analysis SQL Java Servlets XML JSP Test Automation Struts DB2 Solaris Software Development Testing Web Applications See 1+     See less Skills  Agile Methodologies Web Services Java Enterprise Edition Requirements Analysis SQL Java Servlets XML JSP Test Automation Struts DB2 Solaris Software Development Testing Web Applications See 1+     See less Agile Methodologies Web Services Java Enterprise Edition Requirements Analysis SQL Java Servlets XML JSP Test Automation Struts DB2 Solaris Software Development Testing Web Applications See 1+     See less Agile Methodologies Web Services Java Enterprise Edition Requirements Analysis SQL Java Servlets XML JSP Test Automation Struts DB2 Solaris Software Development Testing Web Applications See 1+     See less ", "Summary More than 15 years of industry experience in software product development, in which nearly 8 years experience is in Engineering Management / Senior Engineering Management. \n \nSpecialties: Engineering Management / Senior Engineering Management, Project Management, Software Technical Skills - Java/C/C++/Data Structures/Algorithms/Protocols/OS Concepts, REST, Spring, Hibernate, Mule ESB, JMS, Automated Test Software product development (Mobile - Android/iOS, Performance, Functional), Management domains - Finance/Marketing, Six Sigma. Summary More than 15 years of industry experience in software product development, in which nearly 8 years experience is in Engineering Management / Senior Engineering Management. \n \nSpecialties: Engineering Management / Senior Engineering Management, Project Management, Software Technical Skills - Java/C/C++/Data Structures/Algorithms/Protocols/OS Concepts, REST, Spring, Hibernate, Mule ESB, JMS, Automated Test Software product development (Mobile - Android/iOS, Performance, Functional), Management domains - Finance/Marketing, Six Sigma. More than 15 years of industry experience in software product development, in which nearly 8 years experience is in Engineering Management / Senior Engineering Management. \n \nSpecialties: Engineering Management / Senior Engineering Management, Project Management, Software Technical Skills - Java/C/C++/Data Structures/Algorithms/Protocols/OS Concepts, REST, Spring, Hibernate, Mule ESB, JMS, Automated Test Software product development (Mobile - Android/iOS, Performance, Functional), Management domains - Finance/Marketing, Six Sigma. More than 15 years of industry experience in software product development, in which nearly 8 years experience is in Engineering Management / Senior Engineering Management. \n \nSpecialties: Engineering Management / Senior Engineering Management, Project Management, Software Technical Skills - Java/C/C++/Data Structures/Algorithms/Protocols/OS Concepts, REST, Spring, Hibernate, Mule ESB, JMS, Automated Test Software product development (Mobile - Android/iOS, Performance, Functional), Management domains - Finance/Marketing, Six Sigma. Experience Senior Development Manager Intuit December 2014  – Present (9 months) Bangalore Senior Engineering Manager / Senior Development Release Manager IBM India Software Lab November 2012  –  December 2014  (2 years 2 months) Bangalore Senior Engineering Manager / Senior Development Release Manager for IBM Rational Test Workbench & IBM Rational Performance Tester: \n* Led worldwide development across 3 products - Rational Test Workbench Eclipse Client, Rational Performance Tester, Rational Service Tester. Led 3 distinct functions (Development, Functional Testing and Level 3 Support/Sustenance) across engineering teams in 3 locations (India, US & France labs). \n* Led development at India Lab for Mobile Performance test capabilities for Android and iOS platforms in Rational Test Workbench. This product also has extensions for Mobile & Selenium testing, and is used by end-customers for testing their mobile and web applications. This product is predominantly based on Java/Eclipse/Objective-C in Windows, Linux, Android & iOS. \n* Led the development of Rational Performance Tester used by end-customers for automated performance/load testing of web and server based applications. This product is predominantly based on Java/Eclipse/C/Dojo/JavaScript in Windows, Linux, zLinux, AIX & z/OS. \n* Had earlier hired and built from scratch a new product development team (including senior members) in the India lab. Also, had transitioned significant pieces of product ownership from France/US labs to India lab. Engineering Manager IBM India Software Lab December 2011  –  October 2012  (11 months) Bangalore Engineering Manager for IBM Rational Performance Tester: \n* Played a Development Manager role by managing the development of a software product (Rational Performance Tester) used by end-customers for automated performance/load testing of web and server based applications. This product is predominantly based on Java/Eclipse/C/Dojo/JavaScript in Windows, Linux, AIX & z/OS. \n* Hired and built from scratch a new product development team (including senior members) in the India lab. Also, transitioned significant pieces of product ownership from France/US labs to India lab. \n* Led 3 distinct functions (Development, Functional Testing and Level 3 Support/Sustenance) across engineering teams in 3 locations (India, US & France labs). \n* Took on various additional responsibilities at various times - like Quality Software Engineering (QSE) Development Top Gun, and Security Lead for Quality & Requirements Management segment. Engineering Manager IBM India Software Lab February 2008  –  November 2011  (3 years 10 months) Bangalore Engineering Manager for IBM Rational Functional Tester: \n* Played a Development Manager role by managing the development of a software product (Rational Functional Tester) used by end-customers for functional test automation. This product is based on Java/Eclipse/C/C++/C# in Windows & Linux. \n* This product being completely owned out of the India Lab, I had worldwide development ownership & management responsibility for the product delivery in this role.  \n* Additionally managed the sustenance of a legacy functional test automation product (Rational Robot) from Feb 2008 to Nov 2008. This product is based on C/C++ in Windows. Engineering Manager IBM India Software Lab May 2006  –  January 2008  (1 year 9 months) Bangalore Engineering Manager for IBM Rational Host On-Demand and IBM Personal Communications: \n* Played the Development Manager role for development/sustenance of 2 product teams simultaneously (16 members) in the Host Integration domain of IBM’s Middleware portfolio – IBM Rational Host On-Demand and IBM Personal Communications. Host On-Demand is a terminal emulator product based on Java/C in Windows, Linux & Unix, whereas Personal Communications is a terminal emulator product based on C/C++/VC++ in Windows. \n* Apart from core engineering management, also had additional experience in Project Proposals (RFPs), Transition Management, Project Management & Delivery, Software Life Cycle activities, Quality Processes etc. Team Leader IBM India Software Lab February 2005  –  April 2006  (1 year 3 months) Bangalore Team Leader for IBM Rational Host On-Demand: \n* This is a terminal emulator product in Host Integration domain based on Java/C in Windows, Linux & Unix. \n* Ensured delivery of release commitments with respect to development/sustenance of the product. \n* Successfully planned and executed the transition of the product development/sustenance from IBM Raleigh to IBM India Software Lab. \n* Involved in recruitment & setting up of team, technology training, coordinating & executing skills transfer, and gaining product ownership. Component Leader IBM India Software Lab January 2002  –  January 2005  (3 years 1 month) Bangalore Component Leader for IBM Personal Communications: \n* This is a terminal emulator product in Host Integration domain based on C/C++/VC++ in Windows. \n* Was the component leader for the Datastream protocol components (3270, 5250, VT network datastream standards) in the product. \n* Resolved highest no. of work items & achieved highest SLA adherence in year 2002 (top performer in team). \n* 1.5 years of onsite experience at IBM Raleigh lab, USA as component leader-cum-onsite coordinator. Apart from product development/sustenance, was closely involved in interfacing with local & remote teams and also end-customers. Achieved ‘Onsite team support’ Customer Sat Index of 10/10 from IBM Raleigh management. Developer IBM India Software Lab September 1999  –  December 2001  (2 years 4 months) Bangalore Developer for IBM Personal Communications: \n* This is a terminal emulator product in Host Integration domain based on C/C++/VC++ in Windows. \n* Involved in development/sustenance across multiple components in the product. \n* Played a significant role as a developer in generating revenue for IBM ($1.5M+) from Royal Bank of Canada, Bank of Montreal & Orix. \n* Additionally, took on the responsibility of Group ITCS Coordinator to ensure group-level compliance to IBM’s IT Computer Security standards. Senior Development Manager Intuit December 2014  – Present (9 months) Bangalore Senior Development Manager Intuit December 2014  – Present (9 months) Bangalore Senior Engineering Manager / Senior Development Release Manager IBM India Software Lab November 2012  –  December 2014  (2 years 2 months) Bangalore Senior Engineering Manager / Senior Development Release Manager for IBM Rational Test Workbench & IBM Rational Performance Tester: \n* Led worldwide development across 3 products - Rational Test Workbench Eclipse Client, Rational Performance Tester, Rational Service Tester. Led 3 distinct functions (Development, Functional Testing and Level 3 Support/Sustenance) across engineering teams in 3 locations (India, US & France labs). \n* Led development at India Lab for Mobile Performance test capabilities for Android and iOS platforms in Rational Test Workbench. This product also has extensions for Mobile & Selenium testing, and is used by end-customers for testing their mobile and web applications. This product is predominantly based on Java/Eclipse/Objective-C in Windows, Linux, Android & iOS. \n* Led the development of Rational Performance Tester used by end-customers for automated performance/load testing of web and server based applications. This product is predominantly based on Java/Eclipse/C/Dojo/JavaScript in Windows, Linux, zLinux, AIX & z/OS. \n* Had earlier hired and built from scratch a new product development team (including senior members) in the India lab. Also, had transitioned significant pieces of product ownership from France/US labs to India lab. Senior Engineering Manager / Senior Development Release Manager IBM India Software Lab November 2012  –  December 2014  (2 years 2 months) Bangalore Senior Engineering Manager / Senior Development Release Manager for IBM Rational Test Workbench & IBM Rational Performance Tester: \n* Led worldwide development across 3 products - Rational Test Workbench Eclipse Client, Rational Performance Tester, Rational Service Tester. Led 3 distinct functions (Development, Functional Testing and Level 3 Support/Sustenance) across engineering teams in 3 locations (India, US & France labs). \n* Led development at India Lab for Mobile Performance test capabilities for Android and iOS platforms in Rational Test Workbench. This product also has extensions for Mobile & Selenium testing, and is used by end-customers for testing their mobile and web applications. This product is predominantly based on Java/Eclipse/Objective-C in Windows, Linux, Android & iOS. \n* Led the development of Rational Performance Tester used by end-customers for automated performance/load testing of web and server based applications. This product is predominantly based on Java/Eclipse/C/Dojo/JavaScript in Windows, Linux, zLinux, AIX & z/OS. \n* Had earlier hired and built from scratch a new product development team (including senior members) in the India lab. Also, had transitioned significant pieces of product ownership from France/US labs to India lab. Engineering Manager IBM India Software Lab December 2011  –  October 2012  (11 months) Bangalore Engineering Manager for IBM Rational Performance Tester: \n* Played a Development Manager role by managing the development of a software product (Rational Performance Tester) used by end-customers for automated performance/load testing of web and server based applications. This product is predominantly based on Java/Eclipse/C/Dojo/JavaScript in Windows, Linux, AIX & z/OS. \n* Hired and built from scratch a new product development team (including senior members) in the India lab. Also, transitioned significant pieces of product ownership from France/US labs to India lab. \n* Led 3 distinct functions (Development, Functional Testing and Level 3 Support/Sustenance) across engineering teams in 3 locations (India, US & France labs). \n* Took on various additional responsibilities at various times - like Quality Software Engineering (QSE) Development Top Gun, and Security Lead for Quality & Requirements Management segment. Engineering Manager IBM India Software Lab December 2011  –  October 2012  (11 months) Bangalore Engineering Manager for IBM Rational Performance Tester: \n* Played a Development Manager role by managing the development of a software product (Rational Performance Tester) used by end-customers for automated performance/load testing of web and server based applications. This product is predominantly based on Java/Eclipse/C/Dojo/JavaScript in Windows, Linux, AIX & z/OS. \n* Hired and built from scratch a new product development team (including senior members) in the India lab. Also, transitioned significant pieces of product ownership from France/US labs to India lab. \n* Led 3 distinct functions (Development, Functional Testing and Level 3 Support/Sustenance) across engineering teams in 3 locations (India, US & France labs). \n* Took on various additional responsibilities at various times - like Quality Software Engineering (QSE) Development Top Gun, and Security Lead for Quality & Requirements Management segment. Engineering Manager IBM India Software Lab February 2008  –  November 2011  (3 years 10 months) Bangalore Engineering Manager for IBM Rational Functional Tester: \n* Played a Development Manager role by managing the development of a software product (Rational Functional Tester) used by end-customers for functional test automation. This product is based on Java/Eclipse/C/C++/C# in Windows & Linux. \n* This product being completely owned out of the India Lab, I had worldwide development ownership & management responsibility for the product delivery in this role.  \n* Additionally managed the sustenance of a legacy functional test automation product (Rational Robot) from Feb 2008 to Nov 2008. This product is based on C/C++ in Windows. Engineering Manager IBM India Software Lab February 2008  –  November 2011  (3 years 10 months) Bangalore Engineering Manager for IBM Rational Functional Tester: \n* Played a Development Manager role by managing the development of a software product (Rational Functional Tester) used by end-customers for functional test automation. This product is based on Java/Eclipse/C/C++/C# in Windows & Linux. \n* This product being completely owned out of the India Lab, I had worldwide development ownership & management responsibility for the product delivery in this role.  \n* Additionally managed the sustenance of a legacy functional test automation product (Rational Robot) from Feb 2008 to Nov 2008. This product is based on C/C++ in Windows. Engineering Manager IBM India Software Lab May 2006  –  January 2008  (1 year 9 months) Bangalore Engineering Manager for IBM Rational Host On-Demand and IBM Personal Communications: \n* Played the Development Manager role for development/sustenance of 2 product teams simultaneously (16 members) in the Host Integration domain of IBM’s Middleware portfolio – IBM Rational Host On-Demand and IBM Personal Communications. Host On-Demand is a terminal emulator product based on Java/C in Windows, Linux & Unix, whereas Personal Communications is a terminal emulator product based on C/C++/VC++ in Windows. \n* Apart from core engineering management, also had additional experience in Project Proposals (RFPs), Transition Management, Project Management & Delivery, Software Life Cycle activities, Quality Processes etc. Engineering Manager IBM India Software Lab May 2006  –  January 2008  (1 year 9 months) Bangalore Engineering Manager for IBM Rational Host On-Demand and IBM Personal Communications: \n* Played the Development Manager role for development/sustenance of 2 product teams simultaneously (16 members) in the Host Integration domain of IBM’s Middleware portfolio – IBM Rational Host On-Demand and IBM Personal Communications. Host On-Demand is a terminal emulator product based on Java/C in Windows, Linux & Unix, whereas Personal Communications is a terminal emulator product based on C/C++/VC++ in Windows. \n* Apart from core engineering management, also had additional experience in Project Proposals (RFPs), Transition Management, Project Management & Delivery, Software Life Cycle activities, Quality Processes etc. Team Leader IBM India Software Lab February 2005  –  April 2006  (1 year 3 months) Bangalore Team Leader for IBM Rational Host On-Demand: \n* This is a terminal emulator product in Host Integration domain based on Java/C in Windows, Linux & Unix. \n* Ensured delivery of release commitments with respect to development/sustenance of the product. \n* Successfully planned and executed the transition of the product development/sustenance from IBM Raleigh to IBM India Software Lab. \n* Involved in recruitment & setting up of team, technology training, coordinating & executing skills transfer, and gaining product ownership. Team Leader IBM India Software Lab February 2005  –  April 2006  (1 year 3 months) Bangalore Team Leader for IBM Rational Host On-Demand: \n* This is a terminal emulator product in Host Integration domain based on Java/C in Windows, Linux & Unix. \n* Ensured delivery of release commitments with respect to development/sustenance of the product. \n* Successfully planned and executed the transition of the product development/sustenance from IBM Raleigh to IBM India Software Lab. \n* Involved in recruitment & setting up of team, technology training, coordinating & executing skills transfer, and gaining product ownership. Component Leader IBM India Software Lab January 2002  –  January 2005  (3 years 1 month) Bangalore Component Leader for IBM Personal Communications: \n* This is a terminal emulator product in Host Integration domain based on C/C++/VC++ in Windows. \n* Was the component leader for the Datastream protocol components (3270, 5250, VT network datastream standards) in the product. \n* Resolved highest no. of work items & achieved highest SLA adherence in year 2002 (top performer in team). \n* 1.5 years of onsite experience at IBM Raleigh lab, USA as component leader-cum-onsite coordinator. Apart from product development/sustenance, was closely involved in interfacing with local & remote teams and also end-customers. Achieved ‘Onsite team support’ Customer Sat Index of 10/10 from IBM Raleigh management. Component Leader IBM India Software Lab January 2002  –  January 2005  (3 years 1 month) Bangalore Component Leader for IBM Personal Communications: \n* This is a terminal emulator product in Host Integration domain based on C/C++/VC++ in Windows. \n* Was the component leader for the Datastream protocol components (3270, 5250, VT network datastream standards) in the product. \n* Resolved highest no. of work items & achieved highest SLA adherence in year 2002 (top performer in team). \n* 1.5 years of onsite experience at IBM Raleigh lab, USA as component leader-cum-onsite coordinator. Apart from product development/sustenance, was closely involved in interfacing with local & remote teams and also end-customers. Achieved ‘Onsite team support’ Customer Sat Index of 10/10 from IBM Raleigh management. Developer IBM India Software Lab September 1999  –  December 2001  (2 years 4 months) Bangalore Developer for IBM Personal Communications: \n* This is a terminal emulator product in Host Integration domain based on C/C++/VC++ in Windows. \n* Involved in development/sustenance across multiple components in the product. \n* Played a significant role as a developer in generating revenue for IBM ($1.5M+) from Royal Bank of Canada, Bank of Montreal & Orix. \n* Additionally, took on the responsibility of Group ITCS Coordinator to ensure group-level compliance to IBM’s IT Computer Security standards. Developer IBM India Software Lab September 1999  –  December 2001  (2 years 4 months) Bangalore Developer for IBM Personal Communications: \n* This is a terminal emulator product in Host Integration domain based on C/C++/VC++ in Windows. \n* Involved in development/sustenance across multiple components in the product. \n* Played a significant role as a developer in generating revenue for IBM ($1.5M+) from Royal Bank of Canada, Bank of Montreal & Orix. \n* Additionally, took on the responsibility of Group ITCS Coordinator to ensure group-level compliance to IBM’s IT Computer Security standards. Skills Software Project... Java Engineering Management Six Sigma C C++ Algorithms Visual C++ Data Structures Operating Systems Windows Performance Testing Functional Testing Quality Management Marketing Management Senior Engineering... Development Management Test Management Protocols TCP/IP Mobile Testing Android iOS Terminal Emulation Managerial Finance IBM 3270 IBM 5250 Virtual Terminal Linux Software Development Agile Methodologies Scrum Software Engineering Testing Test Automation Agile Project Management RESTful WebServices Spring Framework Hibernate Mule ESB JMS SOAP Ehcache AJAX See 28+     See less Skills  Software Project... Java Engineering Management Six Sigma C C++ Algorithms Visual C++ Data Structures Operating Systems Windows Performance Testing Functional Testing Quality Management Marketing Management Senior Engineering... Development Management Test Management Protocols TCP/IP Mobile Testing Android iOS Terminal Emulation Managerial Finance IBM 3270 IBM 5250 Virtual Terminal Linux Software Development Agile Methodologies Scrum Software Engineering Testing Test Automation Agile Project Management RESTful WebServices Spring Framework Hibernate Mule ESB JMS SOAP Ehcache AJAX See 28+     See less Software Project... Java Engineering Management Six Sigma C C++ Algorithms Visual C++ Data Structures Operating Systems Windows Performance Testing Functional Testing Quality Management Marketing Management Senior Engineering... Development Management Test Management Protocols TCP/IP Mobile Testing Android iOS Terminal Emulation Managerial Finance IBM 3270 IBM 5250 Virtual Terminal Linux Software Development Agile Methodologies Scrum Software Engineering Testing Test Automation Agile Project Management RESTful WebServices Spring Framework Hibernate Mule ESB JMS SOAP Ehcache AJAX See 28+     See less Software Project... Java Engineering Management Six Sigma C C++ Algorithms Visual C++ Data Structures Operating Systems Windows Performance Testing Functional Testing Quality Management Marketing Management Senior Engineering... Development Management Test Management Protocols TCP/IP Mobile Testing Android iOS Terminal Emulation Managerial Finance IBM 3270 IBM 5250 Virtual Terminal Linux Software Development Agile Methodologies Scrum Software Engineering Testing Test Automation Agile Project Management RESTful WebServices Spring Framework Hibernate Mule ESB JMS SOAP Ehcache AJAX See 28+     See less Education Indian Institute of Management, Bangalore MBA - PGSEM,  Finance ,  Marketing , 3.57/4.00 2003  – 2006 Gold Medallist in Academics PSG College of Technology, Coimbatore BE,  Computer Science Engineering , 85.12% 1995  – 1999 Indian Institute of Management, Bangalore MBA - PGSEM,  Finance ,  Marketing , 3.57/4.00 2003  – 2006 Gold Medallist in Academics Indian Institute of Management, Bangalore MBA - PGSEM,  Finance ,  Marketing , 3.57/4.00 2003  – 2006 Gold Medallist in Academics Indian Institute of Management, Bangalore MBA - PGSEM,  Finance ,  Marketing , 3.57/4.00 2003  – 2006 Gold Medallist in Academics PSG College of Technology, Coimbatore BE,  Computer Science Engineering , 85.12% 1995  – 1999 PSG College of Technology, Coimbatore BE,  Computer Science Engineering , 85.12% 1995  – 1999 PSG College of Technology, Coimbatore BE,  Computer Science Engineering , 85.12% 1995  – 1999 Honors & Awards Gold Medallist in Academics in MBA programme (IIM Bangalore) Indian Institute of Management Bangalore Business and Technical Leadership Resource (2009, 2012) IBM India Software Lab Bravo! Awards (2004, 2005, 2008) IBM India Software Lab Appreciation Award for valuable contributions in delighting customers thereby increasing the scope of work (2002) IBM India Software Lab Appreciation Award for resolving Bank of Montreal critical situations (2001) IBM India Software Lab Project Performance Award IBM India Software Lab Gold Medallist in Academics in MBA programme (IIM Bangalore) Indian Institute of Management Bangalore Gold Medallist in Academics in MBA programme (IIM Bangalore) Indian Institute of Management Bangalore Gold Medallist in Academics in MBA programme (IIM Bangalore) Indian Institute of Management Bangalore Business and Technical Leadership Resource (2009, 2012) IBM India Software Lab Business and Technical Leadership Resource (2009, 2012) IBM India Software Lab Business and Technical Leadership Resource (2009, 2012) IBM India Software Lab Bravo! Awards (2004, 2005, 2008) IBM India Software Lab Bravo! Awards (2004, 2005, 2008) IBM India Software Lab Bravo! Awards (2004, 2005, 2008) IBM India Software Lab Appreciation Award for valuable contributions in delighting customers thereby increasing the scope of work (2002) IBM India Software Lab Appreciation Award for valuable contributions in delighting customers thereby increasing the scope of work (2002) IBM India Software Lab Appreciation Award for valuable contributions in delighting customers thereby increasing the scope of work (2002) IBM India Software Lab Appreciation Award for resolving Bank of Montreal critical situations (2001) IBM India Software Lab Appreciation Award for resolving Bank of Montreal critical situations (2001) IBM India Software Lab Appreciation Award for resolving Bank of Montreal critical situations (2001) IBM India Software Lab Project Performance Award IBM India Software Lab Project Performance Award IBM India Software Lab Project Performance Award IBM India Software Lab "]}