{"position": "Reliability Engineer", "company": "Intel Corporation", "profiles": ["Skills Patents Patent Prosecution Intellectual Property Semiconductors Patent Litigation Licensing Medical Devices Software Electrical Engineering Start-ups Data Analysis Patentability Due Diligence Trade Secrets Patent Applications Copyright Law Invention Trademark Infringement Prosecution Client Counseling See 5+     See less Skills  Patents Patent Prosecution Intellectual Property Semiconductors Patent Litigation Licensing Medical Devices Software Electrical Engineering Start-ups Data Analysis Patentability Due Diligence Trade Secrets Patent Applications Copyright Law Invention Trademark Infringement Prosecution Client Counseling See 5+     See less Patents Patent Prosecution Intellectual Property Semiconductors Patent Litigation Licensing Medical Devices Software Electrical Engineering Start-ups Data Analysis Patentability Due Diligence Trade Secrets Patent Applications Copyright Law Invention Trademark Infringement Prosecution Client Counseling See 5+     See less Patents Patent Prosecution Intellectual Property Semiconductors Patent Litigation Licensing Medical Devices Software Electrical Engineering Start-ups Data Analysis Patentability Due Diligence Trade Secrets Patent Applications Copyright Law Invention Trademark Infringement Prosecution Client Counseling See 5+     See less Honors & Awards ", "Experience Product Development Quality and Reliability Engineer Intel Corporation February 2004  – Present (11 years 7 months) Quality and Reliability Engineer Intel Corporation February 2000  –  February 2004  (4 years 1 month) Product Development Quality and Reliability Engineer Intel Corporation February 2004  – Present (11 years 7 months) Product Development Quality and Reliability Engineer Intel Corporation February 2004  – Present (11 years 7 months) Quality and Reliability Engineer Intel Corporation February 2000  –  February 2004  (4 years 1 month) Quality and Reliability Engineer Intel Corporation February 2000  –  February 2004  (4 years 1 month) Skills Semiconductors IC Design of Experiments CMOS Debugging JMP Visual Studio C++ Perl Operating Systems Electronics Testing Lean Manufacturing Manufacturing Embedded Systems Failure Analysis FMEA Engineering SPC Product Development Silicon Reliability See 7+     See less Skills  Semiconductors IC Design of Experiments CMOS Debugging JMP Visual Studio C++ Perl Operating Systems Electronics Testing Lean Manufacturing Manufacturing Embedded Systems Failure Analysis FMEA Engineering SPC Product Development Silicon Reliability See 7+     See less Semiconductors IC Design of Experiments CMOS Debugging JMP Visual Studio C++ Perl Operating Systems Electronics Testing Lean Manufacturing Manufacturing Embedded Systems Failure Analysis FMEA Engineering SPC Product Development Silicon Reliability See 7+     See less Semiconductors IC Design of Experiments CMOS Debugging JMP Visual Studio C++ Perl Operating Systems Electronics Testing Lean Manufacturing Manufacturing Embedded Systems Failure Analysis FMEA Engineering SPC Product Development Silicon Reliability See 7+     See less Education Instituto Tecnologico de Costa Rica Bachelor's degree,  Electronics Engineering 1994  – 2000 Instituto Tecnologico de Costa Rica Bachelor's degree,  Electronics Engineering 1994  – 2000 Instituto Tecnologico de Costa Rica Bachelor's degree,  Electronics Engineering 1994  – 2000 Instituto Tecnologico de Costa Rica Bachelor's degree,  Electronics Engineering 1994  – 2000 ", "Summary Experienced in Quality and Reliability engineering spanning from customer engagement, manufacturing and product development in qualification and certification methodologies on highly integrated products. Knowledge in auditing, ISO 9000, quality systems, change control and excursion management. Excellent interpersonal and leadership skills and ability to reach across boundaries to solve complex problems. Summary Experienced in Quality and Reliability engineering spanning from customer engagement, manufacturing and product development in qualification and certification methodologies on highly integrated products. Knowledge in auditing, ISO 9000, quality systems, change control and excursion management. Excellent interpersonal and leadership skills and ability to reach across boundaries to solve complex problems. Experienced in Quality and Reliability engineering spanning from customer engagement, manufacturing and product development in qualification and certification methodologies on highly integrated products. Knowledge in auditing, ISO 9000, quality systems, change control and excursion management. Excellent interpersonal and leadership skills and ability to reach across boundaries to solve complex problems. Experienced in Quality and Reliability engineering spanning from customer engagement, manufacturing and product development in qualification and certification methodologies on highly integrated products. Knowledge in auditing, ISO 9000, quality systems, change control and excursion management. Excellent interpersonal and leadership skills and ability to reach across boundaries to solve complex problems. Experience Principal Engineer Quality and Reliability Cavium Inc July 2014  – Present (1 year 2 months) Marlborough, Massachusetts Product Development Engineering Manager Intel Corporation October 2013  –  June 2014  (9 months) Hudson, MA Senior Product Development Engineer Intel Corporation May 2013  –  June 2014  (1 year 2 months) Senior Development Quality and Reliability Engineer Intel Corporation December 2004  –  April 2013  (8 years 5 months) Senior Fault Isolation Engineer Intel Corporation December 2001  –  December 2004  (3 years 1 month) Senior Device Engineer Intel Corporation August 2000  –  November 2001  (1 year 4 months) Senior Manufacturing Quality and Reliability Engineer Intel Corporation August 1996  –  July 2000  (4 years) Manufacturing Quality and Reliability Engineer Intel Corporation September 1992  –  July 1996  (3 years 11 months) Principal Engineer Quality and Reliability Cavium Inc July 2014  – Present (1 year 2 months) Marlborough, Massachusetts Principal Engineer Quality and Reliability Cavium Inc July 2014  – Present (1 year 2 months) Marlborough, Massachusetts Product Development Engineering Manager Intel Corporation October 2013  –  June 2014  (9 months) Hudson, MA Product Development Engineering Manager Intel Corporation October 2013  –  June 2014  (9 months) Hudson, MA Senior Product Development Engineer Intel Corporation May 2013  –  June 2014  (1 year 2 months) Senior Product Development Engineer Intel Corporation May 2013  –  June 2014  (1 year 2 months) Senior Development Quality and Reliability Engineer Intel Corporation December 2004  –  April 2013  (8 years 5 months) Senior Development Quality and Reliability Engineer Intel Corporation December 2004  –  April 2013  (8 years 5 months) Senior Fault Isolation Engineer Intel Corporation December 2001  –  December 2004  (3 years 1 month) Senior Fault Isolation Engineer Intel Corporation December 2001  –  December 2004  (3 years 1 month) Senior Device Engineer Intel Corporation August 2000  –  November 2001  (1 year 4 months) Senior Device Engineer Intel Corporation August 2000  –  November 2001  (1 year 4 months) Senior Manufacturing Quality and Reliability Engineer Intel Corporation August 1996  –  July 2000  (4 years) Senior Manufacturing Quality and Reliability Engineer Intel Corporation August 1996  –  July 2000  (4 years) Manufacturing Quality and Reliability Engineer Intel Corporation September 1992  –  July 1996  (3 years 11 months) Manufacturing Quality and Reliability Engineer Intel Corporation September 1992  –  July 1996  (3 years 11 months) Skills Reliability Engineering Product Development Engineering Management Semiconductor Industry Semiconductor Device Cross-functional Team... Quality Management Multi-Cultural Team... Iso 9000 Semiconductor Failure... Failure Analysis Product Engineering Reliability Semiconductors Skills  Reliability Engineering Product Development Engineering Management Semiconductor Industry Semiconductor Device Cross-functional Team... Quality Management Multi-Cultural Team... Iso 9000 Semiconductor Failure... Failure Analysis Product Engineering Reliability Semiconductors Reliability Engineering Product Development Engineering Management Semiconductor Industry Semiconductor Device Cross-functional Team... Quality Management Multi-Cultural Team... Iso 9000 Semiconductor Failure... Failure Analysis Product Engineering Reliability Semiconductors Reliability Engineering Product Development Engineering Management Semiconductor Industry Semiconductor Device Cross-functional Team... Quality Management Multi-Cultural Team... Iso 9000 Semiconductor Failure... Failure Analysis Product Engineering Reliability Semiconductors Education University of Arizona Bachelor of Science (B.S.),  Electrical Engineering 1988  – 1992 Activities and Societies:  Society of Women Engineer's (SWE) University of Arizona Bachelor of Science (B.S.),  Electrical Engineering 1988  – 1992 Activities and Societies:  Society of Women Engineer's (SWE) University of Arizona Bachelor of Science (B.S.),  Electrical Engineering 1988  – 1992 Activities and Societies:  Society of Women Engineer's (SWE) University of Arizona Bachelor of Science (B.S.),  Electrical Engineering 1988  – 1992 Activities and Societies:  Society of Women Engineer's (SWE) ", "Summary Summary of Qualifications \n· 17 years process engineering expertise & direct manufacturing experience \n· 10+ years project and program management \n· 10+ years press & media experience in the Outdoor Industry \n· Bachelor of Science, Materials Science & Engineering \n· Strong understanding of Quality Systems and Process \nControl Statistics \n· Seven Step & Technical Problem Solving (Post Mortem) \n· Strong written and oral communication skills \n· Excellent negotiation, influencing and technical supplier management abilities \n· Ability to lead and motivate diverse cross functional global teams and working groups \n· Strategic Long Range Planning utilizing Management by Objectives and Critical Success Indicators \n \nSummary of Attributes \n· Strong leader and influencer \n· Team player, coach, mentor, people oriented \n· Self motivated focus on detailed and results orientation with a strong desire to succeed \n· Fast learner able to learn new skills and adapt to rapidly changing environments \n· Analytical, creative, outside-the-box thinker \n· Detail oriented with strong organizational and problem resolution skills \n· Customer focused with emphasis on balancing cost, quality, and operational excellence \n· Enthusiastic with a positive attitude \n· Educated risk taker, willing to appropriately challenge the status quo \n \nSpecialties: Technical Problem Solving, project management Summary Summary of Qualifications \n· 17 years process engineering expertise & direct manufacturing experience \n· 10+ years project and program management \n· 10+ years press & media experience in the Outdoor Industry \n· Bachelor of Science, Materials Science & Engineering \n· Strong understanding of Quality Systems and Process \nControl Statistics \n· Seven Step & Technical Problem Solving (Post Mortem) \n· Strong written and oral communication skills \n· Excellent negotiation, influencing and technical supplier management abilities \n· Ability to lead and motivate diverse cross functional global teams and working groups \n· Strategic Long Range Planning utilizing Management by Objectives and Critical Success Indicators \n \nSummary of Attributes \n· Strong leader and influencer \n· Team player, coach, mentor, people oriented \n· Self motivated focus on detailed and results orientation with a strong desire to succeed \n· Fast learner able to learn new skills and adapt to rapidly changing environments \n· Analytical, creative, outside-the-box thinker \n· Detail oriented with strong organizational and problem resolution skills \n· Customer focused with emphasis on balancing cost, quality, and operational excellence \n· Enthusiastic with a positive attitude \n· Educated risk taker, willing to appropriately challenge the status quo \n \nSpecialties: Technical Problem Solving, project management Summary of Qualifications \n· 17 years process engineering expertise & direct manufacturing experience \n· 10+ years project and program management \n· 10+ years press & media experience in the Outdoor Industry \n· Bachelor of Science, Materials Science & Engineering \n· Strong understanding of Quality Systems and Process \nControl Statistics \n· Seven Step & Technical Problem Solving (Post Mortem) \n· Strong written and oral communication skills \n· Excellent negotiation, influencing and technical supplier management abilities \n· Ability to lead and motivate diverse cross functional global teams and working groups \n· Strategic Long Range Planning utilizing Management by Objectives and Critical Success Indicators \n \nSummary of Attributes \n· Strong leader and influencer \n· Team player, coach, mentor, people oriented \n· Self motivated focus on detailed and results orientation with a strong desire to succeed \n· Fast learner able to learn new skills and adapt to rapidly changing environments \n· Analytical, creative, outside-the-box thinker \n· Detail oriented with strong organizational and problem resolution skills \n· Customer focused with emphasis on balancing cost, quality, and operational excellence \n· Enthusiastic with a positive attitude \n· Educated risk taker, willing to appropriately challenge the status quo \n \nSpecialties: Technical Problem Solving, project management Summary of Qualifications \n· 17 years process engineering expertise & direct manufacturing experience \n· 10+ years project and program management \n· 10+ years press & media experience in the Outdoor Industry \n· Bachelor of Science, Materials Science & Engineering \n· Strong understanding of Quality Systems and Process \nControl Statistics \n· Seven Step & Technical Problem Solving (Post Mortem) \n· Strong written and oral communication skills \n· Excellent negotiation, influencing and technical supplier management abilities \n· Ability to lead and motivate diverse cross functional global teams and working groups \n· Strategic Long Range Planning utilizing Management by Objectives and Critical Success Indicators \n \nSummary of Attributes \n· Strong leader and influencer \n· Team player, coach, mentor, people oriented \n· Self motivated focus on detailed and results orientation with a strong desire to succeed \n· Fast learner able to learn new skills and adapt to rapidly changing environments \n· Analytical, creative, outside-the-box thinker \n· Detail oriented with strong organizational and problem resolution skills \n· Customer focused with emphasis on balancing cost, quality, and operational excellence \n· Enthusiastic with a positive attitude \n· Educated risk taker, willing to appropriately challenge the status quo \n \nSpecialties: Technical Problem Solving, project management Experience Quality and Reliability Engineer Intel Corporation October 2013  – Present (1 year 11 months) Responsibility for managing quality and reliability for back end interconnect in one of Intel's High Volume factories on 14 & 22nm process technologies. Job responsibilities include risk assessment and disposition of process changes and excursionary material. Owner / Publisher Todd's Hiking Guide, LLC January 2007  – Present (8 years 8 months) -Program Management and Production - responsible for all aspects of supplier selection, production and marketing for book(s) published by Todd's Desert Hiking Guide. A leading online source of information for Hiking, Backpacking and Canyoneering, the website for Todd's Desert Hiking Guide sees 11,000-18,000 unique visitors per month. \n \n-Available titles: \n-Arizona:Technical Canyoneering (October 2007) \n-Grand Canyoneering: Exploring the Rugged Gorges and Secret Slots of the Grand Canyon (August 2011) (Winner, 2012 National Outdoor Book Award (NOBA) in the Adventure Guidebook Category) Owner Spritely Goods October 2005  – Present (9 years 11 months) Owner/Proprietor of Spritely Goods - an online purveyor of handcrafted knitting and spinning supplies. Responsible for all operations, including, but not limited to product and website development and design, marketing, manufacturing and accounting. Director, Product Reviews BackpackGearTest.org March 2003  – Present (12 years 6 months) Director of Product Reviews for the all volunteer based BackpackGearTest.org, providing leadership and guidance in managing a team of several hundred individuals in the execution of over 100 product reviews per year. BackpackGearTest.org provides detailed consumer reports on outdoor industry products used in backpacking, hiking and backcountry adventures. Integration Engineer Intel Corporation March 2009  –  October 2013  (4 years 8 months) Responsible for managing quality and process health for the back end patterning segment in one of Intel's High Volume factories on 22nm process technology. Actively drive process, yield and cost improvements in addition to problem resolution when yield issues arise. Sr. Materials Engineer & Supplier Manager Intel Corporation July 2004  –  March 2009  (4 years 9 months) Responsible for working with multiple teams internal and external to the corporation to resolve technical problems and improve material quality. \n \nManaged the qualification of alternate source materials for use in Intel’s factories across multiple technologies, mitigating quality and output impacts for high volume technologies. \n \nAlso responsible for Technical Supplier Management activities, including but not limited to change control, quality improvement, and technical problem resolution. Sr. Packaging Engineer Intel Corporation March 2003  –  July 2004  (1 year 5 months) Responsible for supplier selection and development for next generation substrates for non-CPU technologies. \n \nDelivered a successful development and qualification of next generation substrate technology simultaneously enabling 15% cost savings ($7M) while removing a major roadblock for successful platform launch. \n \nSuccessfully established teams of key players to deliver results such as one generation ahead product development, root cause resolution of quality issues and cost reduction, including a innovative product design allowing for 40% cost savings and reduced footprint for future product technologies. \n \nSwiftly resolved technology issues preventing product launch of Intel’s first high volume RF modules by utilizing analytical problem solving, data analysis and auditing skills. In addition to enabling the swift ramp of this critical product, I co-authored an invention disclosure that was selected for defensive publication by Intel. Sr. Process Engineer Intel Corporation August 1996  –  March 2003  (6 years 8 months) Responsible for technical troubleshooting and continuous improvement in performance, quality and cost targets for various manufacturing modules in the semiconductor process. \n \nEffectively executed and mentored execution of full FMEA’s (Failure Mode and Effects Analysis) on various aspects of the semiconductor manufacturing process to identify and implement preventative resolutions to improve production capability and quality. \n \nSuccessfully led cross-functional, global teams of both internal and external resources to complete strategic planning, alignment and execution of deliverables and metrics to support corporate and local company missions, objectives and goals. Quality and Reliability Engineer Intel Corporation October 2013  – Present (1 year 11 months) Responsibility for managing quality and reliability for back end interconnect in one of Intel's High Volume factories on 14 & 22nm process technologies. Job responsibilities include risk assessment and disposition of process changes and excursionary material. Quality and Reliability Engineer Intel Corporation October 2013  – Present (1 year 11 months) Responsibility for managing quality and reliability for back end interconnect in one of Intel's High Volume factories on 14 & 22nm process technologies. Job responsibilities include risk assessment and disposition of process changes and excursionary material. Owner / Publisher Todd's Hiking Guide, LLC January 2007  – Present (8 years 8 months) -Program Management and Production - responsible for all aspects of supplier selection, production and marketing for book(s) published by Todd's Desert Hiking Guide. A leading online source of information for Hiking, Backpacking and Canyoneering, the website for Todd's Desert Hiking Guide sees 11,000-18,000 unique visitors per month. \n \n-Available titles: \n-Arizona:Technical Canyoneering (October 2007) \n-Grand Canyoneering: Exploring the Rugged Gorges and Secret Slots of the Grand Canyon (August 2011) (Winner, 2012 National Outdoor Book Award (NOBA) in the Adventure Guidebook Category) Owner / Publisher Todd's Hiking Guide, LLC January 2007  – Present (8 years 8 months) -Program Management and Production - responsible for all aspects of supplier selection, production and marketing for book(s) published by Todd's Desert Hiking Guide. A leading online source of information for Hiking, Backpacking and Canyoneering, the website for Todd's Desert Hiking Guide sees 11,000-18,000 unique visitors per month. \n \n-Available titles: \n-Arizona:Technical Canyoneering (October 2007) \n-Grand Canyoneering: Exploring the Rugged Gorges and Secret Slots of the Grand Canyon (August 2011) (Winner, 2012 National Outdoor Book Award (NOBA) in the Adventure Guidebook Category) Owner Spritely Goods October 2005  – Present (9 years 11 months) Owner/Proprietor of Spritely Goods - an online purveyor of handcrafted knitting and spinning supplies. Responsible for all operations, including, but not limited to product and website development and design, marketing, manufacturing and accounting. Owner Spritely Goods October 2005  – Present (9 years 11 months) Owner/Proprietor of Spritely Goods - an online purveyor of handcrafted knitting and spinning supplies. Responsible for all operations, including, but not limited to product and website development and design, marketing, manufacturing and accounting. Director, Product Reviews BackpackGearTest.org March 2003  – Present (12 years 6 months) Director of Product Reviews for the all volunteer based BackpackGearTest.org, providing leadership and guidance in managing a team of several hundred individuals in the execution of over 100 product reviews per year. BackpackGearTest.org provides detailed consumer reports on outdoor industry products used in backpacking, hiking and backcountry adventures. Director, Product Reviews BackpackGearTest.org March 2003  – Present (12 years 6 months) Director of Product Reviews for the all volunteer based BackpackGearTest.org, providing leadership and guidance in managing a team of several hundred individuals in the execution of over 100 product reviews per year. BackpackGearTest.org provides detailed consumer reports on outdoor industry products used in backpacking, hiking and backcountry adventures. Integration Engineer Intel Corporation March 2009  –  October 2013  (4 years 8 months) Responsible for managing quality and process health for the back end patterning segment in one of Intel's High Volume factories on 22nm process technology. Actively drive process, yield and cost improvements in addition to problem resolution when yield issues arise. Integration Engineer Intel Corporation March 2009  –  October 2013  (4 years 8 months) Responsible for managing quality and process health for the back end patterning segment in one of Intel's High Volume factories on 22nm process technology. Actively drive process, yield and cost improvements in addition to problem resolution when yield issues arise. Sr. Materials Engineer & Supplier Manager Intel Corporation July 2004  –  March 2009  (4 years 9 months) Responsible for working with multiple teams internal and external to the corporation to resolve technical problems and improve material quality. \n \nManaged the qualification of alternate source materials for use in Intel’s factories across multiple technologies, mitigating quality and output impacts for high volume technologies. \n \nAlso responsible for Technical Supplier Management activities, including but not limited to change control, quality improvement, and technical problem resolution. Sr. Materials Engineer & Supplier Manager Intel Corporation July 2004  –  March 2009  (4 years 9 months) Responsible for working with multiple teams internal and external to the corporation to resolve technical problems and improve material quality. \n \nManaged the qualification of alternate source materials for use in Intel’s factories across multiple technologies, mitigating quality and output impacts for high volume technologies. \n \nAlso responsible for Technical Supplier Management activities, including but not limited to change control, quality improvement, and technical problem resolution. Sr. Packaging Engineer Intel Corporation March 2003  –  July 2004  (1 year 5 months) Responsible for supplier selection and development for next generation substrates for non-CPU technologies. \n \nDelivered a successful development and qualification of next generation substrate technology simultaneously enabling 15% cost savings ($7M) while removing a major roadblock for successful platform launch. \n \nSuccessfully established teams of key players to deliver results such as one generation ahead product development, root cause resolution of quality issues and cost reduction, including a innovative product design allowing for 40% cost savings and reduced footprint for future product technologies. \n \nSwiftly resolved technology issues preventing product launch of Intel’s first high volume RF modules by utilizing analytical problem solving, data analysis and auditing skills. In addition to enabling the swift ramp of this critical product, I co-authored an invention disclosure that was selected for defensive publication by Intel. Sr. Packaging Engineer Intel Corporation March 2003  –  July 2004  (1 year 5 months) Responsible for supplier selection and development for next generation substrates for non-CPU technologies. \n \nDelivered a successful development and qualification of next generation substrate technology simultaneously enabling 15% cost savings ($7M) while removing a major roadblock for successful platform launch. \n \nSuccessfully established teams of key players to deliver results such as one generation ahead product development, root cause resolution of quality issues and cost reduction, including a innovative product design allowing for 40% cost savings and reduced footprint for future product technologies. \n \nSwiftly resolved technology issues preventing product launch of Intel’s first high volume RF modules by utilizing analytical problem solving, data analysis and auditing skills. In addition to enabling the swift ramp of this critical product, I co-authored an invention disclosure that was selected for defensive publication by Intel. Sr. Process Engineer Intel Corporation August 1996  –  March 2003  (6 years 8 months) Responsible for technical troubleshooting and continuous improvement in performance, quality and cost targets for various manufacturing modules in the semiconductor process. \n \nEffectively executed and mentored execution of full FMEA’s (Failure Mode and Effects Analysis) on various aspects of the semiconductor manufacturing process to identify and implement preventative resolutions to improve production capability and quality. \n \nSuccessfully led cross-functional, global teams of both internal and external resources to complete strategic planning, alignment and execution of deliverables and metrics to support corporate and local company missions, objectives and goals. Sr. Process Engineer Intel Corporation August 1996  –  March 2003  (6 years 8 months) Responsible for technical troubleshooting and continuous improvement in performance, quality and cost targets for various manufacturing modules in the semiconductor process. \n \nEffectively executed and mentored execution of full FMEA’s (Failure Mode and Effects Analysis) on various aspects of the semiconductor manufacturing process to identify and implement preventative resolutions to improve production capability and quality. \n \nSuccessfully led cross-functional, global teams of both internal and external resources to complete strategic planning, alignment and execution of deliverables and metrics to support corporate and local company missions, objectives and goals. Skills JMP Product Development Semiconductors Cross-functional Team... Project Management SPC Data Analysis Lean Manufacturing Skills  JMP Product Development Semiconductors Cross-functional Team... Project Management SPC Data Analysis Lean Manufacturing JMP Product Development Semiconductors Cross-functional Team... Project Management SPC Data Analysis Lean Manufacturing JMP Product Development Semiconductors Cross-functional Team... Project Management SPC Data Analysis Lean Manufacturing Education Massachusetts Institute of Technology BS,  Materials Science & Engineering 1992  – 1996 Activities and Societies:  Alpha Chi Sigma ,  Alpha Chi Omega Massachusetts Institute of Technology BS,  Materials Science & Engineering 1992  – 1996 Activities and Societies:  Alpha Chi Sigma ,  Alpha Chi Omega Massachusetts Institute of Technology BS,  Materials Science & Engineering 1992  – 1996 Activities and Societies:  Alpha Chi Sigma ,  Alpha Chi Omega Massachusetts Institute of Technology BS,  Materials Science & Engineering 1992  – 1996 Activities and Societies:  Alpha Chi Sigma ,  Alpha Chi Omega ", "Experience Quality & Reliability Engineer Intel Corporation December 2014  – Present (9 months) HW/SW QA Nokia February 2014  –  December 2014  (11 months) Sunnyvale, CA Manager, Reliability Test and Certification Barnes & Noble, Digital Products September 2010  –  February 2014  (3 years 6 months) Palo Alto, CA Sr. Reliability Engineer Lead Palm, Inc / HP January 2006  –  September 2010  (4 years 9 months) Sunnyvale, CA Reliability Consultant Nanometrics March 2005  –  December 2005  (10 months) Milpitas, CA Systems / Reliability Engineer KLA-Tencor September 2003  –  March 2005  (1 year 7 months) San Jose, CA Product Quality & Reliability Engineer Applied Materials April 2000  –  July 2003  (3 years 4 months) Santa Clara, CA Reliability Engineer Seagate Technology December 1997  –  April 2000  (2 years 5 months) Scotts Valley, CA Manufacturing Engineer Novellus Systems June 1997  –  December 1997  (7 months) Palo Alto, CA Summer Intern Ford Motor Company 1993  –  1996  (3 years) Michigan Quality & Reliability Engineer Intel Corporation December 2014  – Present (9 months) Quality & Reliability Engineer Intel Corporation December 2014  – Present (9 months) HW/SW QA Nokia February 2014  –  December 2014  (11 months) Sunnyvale, CA HW/SW QA Nokia February 2014  –  December 2014  (11 months) Sunnyvale, CA Manager, Reliability Test and Certification Barnes & Noble, Digital Products September 2010  –  February 2014  (3 years 6 months) Palo Alto, CA Manager, Reliability Test and Certification Barnes & Noble, Digital Products September 2010  –  February 2014  (3 years 6 months) Palo Alto, CA Sr. Reliability Engineer Lead Palm, Inc / HP January 2006  –  September 2010  (4 years 9 months) Sunnyvale, CA Sr. Reliability Engineer Lead Palm, Inc / HP January 2006  –  September 2010  (4 years 9 months) Sunnyvale, CA Reliability Consultant Nanometrics March 2005  –  December 2005  (10 months) Milpitas, CA Reliability Consultant Nanometrics March 2005  –  December 2005  (10 months) Milpitas, CA Systems / Reliability Engineer KLA-Tencor September 2003  –  March 2005  (1 year 7 months) San Jose, CA Systems / Reliability Engineer KLA-Tencor September 2003  –  March 2005  (1 year 7 months) San Jose, CA Product Quality & Reliability Engineer Applied Materials April 2000  –  July 2003  (3 years 4 months) Santa Clara, CA Product Quality & Reliability Engineer Applied Materials April 2000  –  July 2003  (3 years 4 months) Santa Clara, CA Reliability Engineer Seagate Technology December 1997  –  April 2000  (2 years 5 months) Scotts Valley, CA Reliability Engineer Seagate Technology December 1997  –  April 2000  (2 years 5 months) Scotts Valley, CA Manufacturing Engineer Novellus Systems June 1997  –  December 1997  (7 months) Palo Alto, CA Manufacturing Engineer Novellus Systems June 1997  –  December 1997  (7 months) Palo Alto, CA Summer Intern Ford Motor Company 1993  –  1996  (3 years) Michigan Summer Intern Ford Motor Company 1993  –  1996  (3 years) Michigan Languages Chinese Chinese Chinese Skills Quality Management Design for Manufacturing Product Design Test Planning Manufacturing Engineering Management Testing Cross-functional Team... Embedded Systems Medical Devices Reliability Failure Analysis Mobile Applications Troubleshooting Root Cause Analysis Wireless Consumer Electronics Six Sigma Product Lifecycle... Design of Experiments Product Development Quality Assurance Electronics Engineering Debugging See 10+     See less Skills  Quality Management Design for Manufacturing Product Design Test Planning Manufacturing Engineering Management Testing Cross-functional Team... Embedded Systems Medical Devices Reliability Failure Analysis Mobile Applications Troubleshooting Root Cause Analysis Wireless Consumer Electronics Six Sigma Product Lifecycle... Design of Experiments Product Development Quality Assurance Electronics Engineering Debugging See 10+     See less Quality Management Design for Manufacturing Product Design Test Planning Manufacturing Engineering Management Testing Cross-functional Team... Embedded Systems Medical Devices Reliability Failure Analysis Mobile Applications Troubleshooting Root Cause Analysis Wireless Consumer Electronics Six Sigma Product Lifecycle... Design of Experiments Product Development Quality Assurance Electronics Engineering Debugging See 10+     See less Quality Management Design for Manufacturing Product Design Test Planning Manufacturing Engineering Management Testing Cross-functional Team... Embedded Systems Medical Devices Reliability Failure Analysis Mobile Applications Troubleshooting Root Cause Analysis Wireless Consumer Electronics Six Sigma Product Lifecycle... Design of Experiments Product Development Quality Assurance Electronics Engineering Debugging See 10+     See less Education University of Michigan BS 1997 San Jose State University Santa Clara University EMGT University of Michigan BS 1997 University of Michigan BS 1997 University of Michigan BS 1997 San Jose State University San Jose State University San Jose State University Santa Clara University EMGT Santa Clara University EMGT Santa Clara University EMGT ", "Skills Six Sigma Lean Manufacturing SPC Process Engineering Manufacturing JMP Photolithography CVD Characterization Skills  Six Sigma Lean Manufacturing SPC Process Engineering Manufacturing JMP Photolithography CVD Characterization Six Sigma Lean Manufacturing SPC Process Engineering Manufacturing JMP Photolithography CVD Characterization Six Sigma Lean Manufacturing SPC Process Engineering Manufacturing JMP Photolithography CVD Characterization Honors & Awards ", "Experience Quality & Reliability Engineer Intel Corporation March 2010  – Present (5 years 6 months) Perform risk assessment \nConduct experiment \nProvide corrective/preventive action for short & long term fix. Quality & Reliability Engineer Intel Corporation 2010  –  2014  (4 years) Worked for 3 years plus as Quality and Reliability Engineer in Quality and Reliability Department.  \n•\tFamiliarized with quality and reliability issues at infant mortality and wear out mode and be the expert for assembly, test, finish and backend process. \n•\tLead on every excursion management to ensure effective containment and disposition of material through proper risk assessment and drive effective corrective action for root cause fix. \n•\tDesigned experiment, provided solution and proposed risk assessment to production team and customer in shortest time. \n•\tDefined certification and reliability experiments requirements for smooth transfer and start up and ramp into high volume manufacturing for five Intel New Technologies CPU from 2011 until 2013. \n•\tLead on LEAN and Quality project on all Intel Penang Microprocessor and Chipset products final visual inspection by eliminating wastes during task execution and optimized process completion time and manpower.  \n•\tPromoted to Senior Quality and Reliability Engineer on 1st April 2013. \n•\tWorking experience with Intel China, Intel Costa Rica and Intel USA. Quality & Reliability Engineer Intel Corporation March 2010  – Present (5 years 6 months) Perform risk assessment \nConduct experiment \nProvide corrective/preventive action for short & long term fix. Quality & Reliability Engineer Intel Corporation March 2010  – Present (5 years 6 months) Perform risk assessment \nConduct experiment \nProvide corrective/preventive action for short & long term fix. Quality & Reliability Engineer Intel Corporation 2010  –  2014  (4 years) Worked for 3 years plus as Quality and Reliability Engineer in Quality and Reliability Department.  \n•\tFamiliarized with quality and reliability issues at infant mortality and wear out mode and be the expert for assembly, test, finish and backend process. \n•\tLead on every excursion management to ensure effective containment and disposition of material through proper risk assessment and drive effective corrective action for root cause fix. \n•\tDesigned experiment, provided solution and proposed risk assessment to production team and customer in shortest time. \n•\tDefined certification and reliability experiments requirements for smooth transfer and start up and ramp into high volume manufacturing for five Intel New Technologies CPU from 2011 until 2013. \n•\tLead on LEAN and Quality project on all Intel Penang Microprocessor and Chipset products final visual inspection by eliminating wastes during task execution and optimized process completion time and manpower.  \n•\tPromoted to Senior Quality and Reliability Engineer on 1st April 2013. \n•\tWorking experience with Intel China, Intel Costa Rica and Intel USA. Quality & Reliability Engineer Intel Corporation 2010  –  2014  (4 years) Worked for 3 years plus as Quality and Reliability Engineer in Quality and Reliability Department.  \n•\tFamiliarized with quality and reliability issues at infant mortality and wear out mode and be the expert for assembly, test, finish and backend process. \n•\tLead on every excursion management to ensure effective containment and disposition of material through proper risk assessment and drive effective corrective action for root cause fix. \n•\tDesigned experiment, provided solution and proposed risk assessment to production team and customer in shortest time. \n•\tDefined certification and reliability experiments requirements for smooth transfer and start up and ramp into high volume manufacturing for five Intel New Technologies CPU from 2011 until 2013. \n•\tLead on LEAN and Quality project on all Intel Penang Microprocessor and Chipset products final visual inspection by eliminating wastes during task execution and optimized process completion time and manpower.  \n•\tPromoted to Senior Quality and Reliability Engineer on 1st April 2013. \n•\tWorking experience with Intel China, Intel Costa Rica and Intel USA. Skills Risk Assessment Quality Control Quality Assurance Reliability Engineering Reliability Test Process Piping Design Skills  Risk Assessment Quality Control Quality Assurance Reliability Engineering Reliability Test Process Piping Design Risk Assessment Quality Control Quality Assurance Reliability Engineering Reliability Test Process Piping Design Risk Assessment Quality Control Quality Assurance Reliability Engineering Reliability Test Process Piping Design ", "Experience Quality & Reliability Engineer Intel Corporation July 2012  – Present (3 years 2 months) Israel Product Qualification Fab Quality and Reliability Engineer Intel Corporation September 2004  –  July 2012  (7 years 11 months) Main activitivties during this time frame: \n- Fab Process Certification management \n- Defect Reliability Analysis \n- Discrepant Material Assessment and Disposition \n- Product and Process Reliability development and support Fab Product Engineer Intel Corporation February 2000  –  September 2004  (4 years 8 months) Activities: \nProduct NPI \nProduct performance FA Analysis Intel Corporation December 1997  –  February 2000  (2 years 3 months) Failure Analysis: Liquid Crystal; FIB, SEM Quality & Reliability Engineer Intel Corporation July 2012  – Present (3 years 2 months) Israel Product Qualification Quality & Reliability Engineer Intel Corporation July 2012  – Present (3 years 2 months) Israel Product Qualification Fab Quality and Reliability Engineer Intel Corporation September 2004  –  July 2012  (7 years 11 months) Main activitivties during this time frame: \n- Fab Process Certification management \n- Defect Reliability Analysis \n- Discrepant Material Assessment and Disposition \n- Product and Process Reliability development and support Fab Quality and Reliability Engineer Intel Corporation September 2004  –  July 2012  (7 years 11 months) Main activitivties during this time frame: \n- Fab Process Certification management \n- Defect Reliability Analysis \n- Discrepant Material Assessment and Disposition \n- Product and Process Reliability development and support Fab Product Engineer Intel Corporation February 2000  –  September 2004  (4 years 8 months) Activities: \nProduct NPI \nProduct performance Fab Product Engineer Intel Corporation February 2000  –  September 2004  (4 years 8 months) Activities: \nProduct NPI \nProduct performance FA Analysis Intel Corporation December 1997  –  February 2000  (2 years 3 months) Failure Analysis: Liquid Crystal; FIB, SEM FA Analysis Intel Corporation December 1997  –  February 2000  (2 years 3 months) Failure Analysis: Liquid Crystal; FIB, SEM Skills Failure Analysis Reliability Reliability Engineering Semiconductors JMP Design of Experiments Semiconductor Industry Data Analysis SPC Process Integration Electronics Intel CMOS FIB Silicon Product Engineering Hebrew Statistics Physics Optics R&D Yield Portuguese Thin Films Metrology Characterization IC DOE Reliability Analysis Foreign Languages Flash Memory CVD Semiconductor Process Device Characterization Microelectronics Semiconductor... Lithography Test Engineering Materials Science Spanish Photolithography Simulations Manufacturing Gage R&R R Programming See 30+     See less Skills  Failure Analysis Reliability Reliability Engineering Semiconductors JMP Design of Experiments Semiconductor Industry Data Analysis SPC Process Integration Electronics Intel CMOS FIB Silicon Product Engineering Hebrew Statistics Physics Optics R&D Yield Portuguese Thin Films Metrology Characterization IC DOE Reliability Analysis Foreign Languages Flash Memory CVD Semiconductor Process Device Characterization Microelectronics Semiconductor... Lithography Test Engineering Materials Science Spanish Photolithography Simulations Manufacturing Gage R&R R Programming See 30+     See less Failure Analysis Reliability Reliability Engineering Semiconductors JMP Design of Experiments Semiconductor Industry Data Analysis SPC Process Integration Electronics Intel CMOS FIB Silicon Product Engineering Hebrew Statistics Physics Optics R&D Yield Portuguese Thin Films Metrology Characterization IC DOE Reliability Analysis Foreign Languages Flash Memory CVD Semiconductor Process Device Characterization Microelectronics Semiconductor... Lithography Test Engineering Materials Science Spanish Photolithography Simulations Manufacturing Gage R&R R Programming See 30+     See less Failure Analysis Reliability Reliability Engineering Semiconductors JMP Design of Experiments Semiconductor Industry Data Analysis SPC Process Integration Electronics Intel CMOS FIB Silicon Product Engineering Hebrew Statistics Physics Optics R&D Yield Portuguese Thin Films Metrology Characterization IC DOE Reliability Analysis Foreign Languages Flash Memory CVD Semiconductor Process Device Characterization Microelectronics Semiconductor... Lithography Test Engineering Materials Science Spanish Photolithography Simulations Manufacturing Gage R&R R Programming See 30+     See less Education University of Haifa M.A.,  Statistics 2009  – 2011 Activities and Societies:  Statistics for Quality Control and Reliability Ha'Universita Ha'Petuha BA,  Physics and Natural Science 1997  – 2001 Intitute of Technology Hadassah Practical Engineer,  Electro-Optics 1990  – 1992 MITx MITx University of Haifa M.A.,  Statistics 2009  – 2011 Activities and Societies:  Statistics for Quality Control and Reliability University of Haifa M.A.,  Statistics 2009  – 2011 Activities and Societies:  Statistics for Quality Control and Reliability University of Haifa M.A.,  Statistics 2009  – 2011 Activities and Societies:  Statistics for Quality Control and Reliability Ha'Universita Ha'Petuha BA,  Physics and Natural Science 1997  – 2001 Ha'Universita Ha'Petuha BA,  Physics and Natural Science 1997  – 2001 Ha'Universita Ha'Petuha BA,  Physics and Natural Science 1997  – 2001 Intitute of Technology Hadassah Practical Engineer,  Electro-Optics 1990  – 1992 Intitute of Technology Hadassah Practical Engineer,  Electro-Optics 1990  – 1992 Intitute of Technology Hadassah Practical Engineer,  Electro-Optics 1990  – 1992 MITx MITx MITx MITx MITx MITx ", "Skills Semiconductors Failure Analysis Problem Solving Product Development New Product... Reliability Engineering Technical Leadership Customer Support SoC Design for Manufacturing Computer Architecture Manufacturing... Analog Intel Processors Engineering Debugging SPC Electronics Packaging Manufacturing Semiconductor Industry Testing Simulations IC FMEA Root Cause Analysis JMP Quality Management Electronics Process Simulation Hardware Hardware Architecture Silicon See 18+     See less Skills  Semiconductors Failure Analysis Problem Solving Product Development New Product... Reliability Engineering Technical Leadership Customer Support SoC Design for Manufacturing Computer Architecture Manufacturing... Analog Intel Processors Engineering Debugging SPC Electronics Packaging Manufacturing Semiconductor Industry Testing Simulations IC FMEA Root Cause Analysis JMP Quality Management Electronics Process Simulation Hardware Hardware Architecture Silicon See 18+     See less Semiconductors Failure Analysis Problem Solving Product Development New Product... Reliability Engineering Technical Leadership Customer Support SoC Design for Manufacturing Computer Architecture Manufacturing... Analog Intel Processors Engineering Debugging SPC Electronics Packaging Manufacturing Semiconductor Industry Testing Simulations IC FMEA Root Cause Analysis JMP Quality Management Electronics Process Simulation Hardware Hardware Architecture Silicon See 18+     See less Semiconductors Failure Analysis Problem Solving Product Development New Product... Reliability Engineering Technical Leadership Customer Support SoC Design for Manufacturing Computer Architecture Manufacturing... Analog Intel Processors Engineering Debugging SPC Electronics Packaging Manufacturing Semiconductor Industry Testing Simulations IC FMEA Root Cause Analysis JMP Quality Management Electronics Process Simulation Hardware Hardware Architecture Silicon See 18+     See less ", "Experience Product Quality and Reliability Engineer Intel Corporation November 2014  – Present (10 months) Sacramento, California Area Responsible for planning and execution of qual activities to meet product release qualification (PRQ) requirements, and providing division support to sustain product health in high volume manufacturing (HVM). Design Reliability Engineer Intel Corporation August 2012  –  October 2014  (2 years 3 months) Sacramento, California Area Design reliability engineer responsible for performing design reviews and risk assessments, preventing Pre-Si escapes and root causing reliability issues in design. Design Engineer - Standard Cell Library Intel Corporation January 2010  –  July 2012  (2 years 7 months) Sacramento, California Area Design engineer responsible for Reliability Verification (RV), parasitic extraction, Apache Power models generation, views integration, and library release. Graduate Intern - Standard Cell Library Intel Corporation June 2008  –  December 2008  (7 months) Sacramento, California Area - Static timing analysis - Developed a suite of tools which utilizes PrimeTime to do library comparisons. Accomplishments were made in the areas of internal power and setup/hold comparisons. \n- Characterization - Determined combination of input factors that would characterize standard cells to produce minimized setup/hold times. \n- Developed multiple Perl scripts to optimize QA checks and data reporting templates. Programmer Analyst Cognizant Technology Solutions September 2006  –  July 2007  (11 months) Chennai Area, India Web developer Engineering Intern Alcatel-Lucent June 2006  –  August 2006  (3 months) Chennai Area, India - Re-designed an existing Perl CGI code and developed an error free Fault Evolution and Analysis Tool. Engineering Intern HCL Technologies January 2006  –  April 2006  (4 months) Chennai Area, India - Developed a code to list the servers available in a network using an in built Service Location Protocol (SLP) method. Product Quality and Reliability Engineer Intel Corporation November 2014  – Present (10 months) Sacramento, California Area Responsible for planning and execution of qual activities to meet product release qualification (PRQ) requirements, and providing division support to sustain product health in high volume manufacturing (HVM). Product Quality and Reliability Engineer Intel Corporation November 2014  – Present (10 months) Sacramento, California Area Responsible for planning and execution of qual activities to meet product release qualification (PRQ) requirements, and providing division support to sustain product health in high volume manufacturing (HVM). Design Reliability Engineer Intel Corporation August 2012  –  October 2014  (2 years 3 months) Sacramento, California Area Design reliability engineer responsible for performing design reviews and risk assessments, preventing Pre-Si escapes and root causing reliability issues in design. Design Reliability Engineer Intel Corporation August 2012  –  October 2014  (2 years 3 months) Sacramento, California Area Design reliability engineer responsible for performing design reviews and risk assessments, preventing Pre-Si escapes and root causing reliability issues in design. Design Engineer - Standard Cell Library Intel Corporation January 2010  –  July 2012  (2 years 7 months) Sacramento, California Area Design engineer responsible for Reliability Verification (RV), parasitic extraction, Apache Power models generation, views integration, and library release. Design Engineer - Standard Cell Library Intel Corporation January 2010  –  July 2012  (2 years 7 months) Sacramento, California Area Design engineer responsible for Reliability Verification (RV), parasitic extraction, Apache Power models generation, views integration, and library release. Graduate Intern - Standard Cell Library Intel Corporation June 2008  –  December 2008  (7 months) Sacramento, California Area - Static timing analysis - Developed a suite of tools which utilizes PrimeTime to do library comparisons. Accomplishments were made in the areas of internal power and setup/hold comparisons. \n- Characterization - Determined combination of input factors that would characterize standard cells to produce minimized setup/hold times. \n- Developed multiple Perl scripts to optimize QA checks and data reporting templates. Graduate Intern - Standard Cell Library Intel Corporation June 2008  –  December 2008  (7 months) Sacramento, California Area - Static timing analysis - Developed a suite of tools which utilizes PrimeTime to do library comparisons. Accomplishments were made in the areas of internal power and setup/hold comparisons. \n- Characterization - Determined combination of input factors that would characterize standard cells to produce minimized setup/hold times. \n- Developed multiple Perl scripts to optimize QA checks and data reporting templates. Programmer Analyst Cognizant Technology Solutions September 2006  –  July 2007  (11 months) Chennai Area, India Web developer Programmer Analyst Cognizant Technology Solutions September 2006  –  July 2007  (11 months) Chennai Area, India Web developer Engineering Intern Alcatel-Lucent June 2006  –  August 2006  (3 months) Chennai Area, India - Re-designed an existing Perl CGI code and developed an error free Fault Evolution and Analysis Tool. Engineering Intern Alcatel-Lucent June 2006  –  August 2006  (3 months) Chennai Area, India - Re-designed an existing Perl CGI code and developed an error free Fault Evolution and Analysis Tool. Engineering Intern HCL Technologies January 2006  –  April 2006  (4 months) Chennai Area, India - Developed a code to list the servers available in a network using an in built Service Location Protocol (SLP) method. Engineering Intern HCL Technologies January 2006  –  April 2006  (4 months) Chennai Area, India - Developed a code to list the servers available in a network using an in built Service Location Protocol (SLP) method. Languages English Tamil English Tamil English Tamil Skills Reliability Verification VLSI Perl Static Timing Analysis CMOS Circuit Design Semiconductors Unix Matlab Java Skills  Reliability Verification VLSI Perl Static Timing Analysis CMOS Circuit Design Semiconductors Unix Matlab Java Reliability Verification VLSI Perl Static Timing Analysis CMOS Circuit Design Semiconductors Unix Matlab Java Reliability Verification VLSI Perl Static Timing Analysis CMOS Circuit Design Semiconductors Unix Matlab Java Education Arizona State University Master's,  Electrical Engineering - VLSI 2007  – 2009 VLSI Design Project  \n- Design & layout of a 32 entry, 32 bit wide register file with two read and one write port. \n- Optimizing critical timing paths to achieve best combination of power and speed using logical effort. \n- Custom layout using Virtuoso to pitch match the Register File with latches/flip-flops and decoders. \n \nStatistical Timing of SRAM using 45nm Predictive Technology Model  \n- Performed Monte Carlo simulations on the critical path of a 64x64 SRAM array under the influence of inter-die, intra die and correlated intra-die threshold voltage (Vth) variations. \n- Modeled the delays of the critical path components, the SRAM cell and the sense amplifier. \n- Compared simulations results and mathematical model with worst case STA corners to discover that statistical analysis of process variations reduces over design and number of characterization corners at nanoscale regime. Anna University Bachelor's,  Electronics and Communication Engineering 2002  – 2006 Arizona State University Master's,  Electrical Engineering - VLSI 2007  – 2009 VLSI Design Project  \n- Design & layout of a 32 entry, 32 bit wide register file with two read and one write port. \n- Optimizing critical timing paths to achieve best combination of power and speed using logical effort. \n- Custom layout using Virtuoso to pitch match the Register File with latches/flip-flops and decoders. \n \nStatistical Timing of SRAM using 45nm Predictive Technology Model  \n- Performed Monte Carlo simulations on the critical path of a 64x64 SRAM array under the influence of inter-die, intra die and correlated intra-die threshold voltage (Vth) variations. \n- Modeled the delays of the critical path components, the SRAM cell and the sense amplifier. \n- Compared simulations results and mathematical model with worst case STA corners to discover that statistical analysis of process variations reduces over design and number of characterization corners at nanoscale regime. Arizona State University Master's,  Electrical Engineering - VLSI 2007  – 2009 VLSI Design Project  \n- Design & layout of a 32 entry, 32 bit wide register file with two read and one write port. \n- Optimizing critical timing paths to achieve best combination of power and speed using logical effort. \n- Custom layout using Virtuoso to pitch match the Register File with latches/flip-flops and decoders. \n \nStatistical Timing of SRAM using 45nm Predictive Technology Model  \n- Performed Monte Carlo simulations on the critical path of a 64x64 SRAM array under the influence of inter-die, intra die and correlated intra-die threshold voltage (Vth) variations. \n- Modeled the delays of the critical path components, the SRAM cell and the sense amplifier. \n- Compared simulations results and mathematical model with worst case STA corners to discover that statistical analysis of process variations reduces over design and number of characterization corners at nanoscale regime. Arizona State University Master's,  Electrical Engineering - VLSI 2007  – 2009 VLSI Design Project  \n- Design & layout of a 32 entry, 32 bit wide register file with two read and one write port. \n- Optimizing critical timing paths to achieve best combination of power and speed using logical effort. \n- Custom layout using Virtuoso to pitch match the Register File with latches/flip-flops and decoders. \n \nStatistical Timing of SRAM using 45nm Predictive Technology Model  \n- Performed Monte Carlo simulations on the critical path of a 64x64 SRAM array under the influence of inter-die, intra die and correlated intra-die threshold voltage (Vth) variations. \n- Modeled the delays of the critical path components, the SRAM cell and the sense amplifier. \n- Compared simulations results and mathematical model with worst case STA corners to discover that statistical analysis of process variations reduces over design and number of characterization corners at nanoscale regime. Anna University Bachelor's,  Electronics and Communication Engineering 2002  – 2006 Anna University Bachelor's,  Electronics and Communication Engineering 2002  – 2006 Anna University Bachelor's,  Electronics and Communication Engineering 2002  – 2006 ", "Summary •Strong supplier management experience with major semiconductor companies, assembly/test houses, fabless companies and equipment suppliers. \n•Broad technical knowledge in Semiconductor Wafer Fab process, Si assembly, Testing, Quality/Reliability and manufacturing. \n•Proven track record of high performance and diligence. Summary •Strong supplier management experience with major semiconductor companies, assembly/test houses, fabless companies and equipment suppliers. \n•Broad technical knowledge in Semiconductor Wafer Fab process, Si assembly, Testing, Quality/Reliability and manufacturing. \n•Proven track record of high performance and diligence. •Strong supplier management experience with major semiconductor companies, assembly/test houses, fabless companies and equipment suppliers. \n•Broad technical knowledge in Semiconductor Wafer Fab process, Si assembly, Testing, Quality/Reliability and manufacturing. \n•Proven track record of high performance and diligence. •Strong supplier management experience with major semiconductor companies, assembly/test houses, fabless companies and equipment suppliers. \n•Broad technical knowledge in Semiconductor Wafer Fab process, Si assembly, Testing, Quality/Reliability and manufacturing. \n•Proven track record of high performance and diligence. Experience Sr. Test Equipment Development Engineer Intel Corporation 2010  – Present (5 years) Portland, Oregon Area Worked with Tester/Burn-in equipment suppliers, technology development teams and factories to develop and deploy Tester/Burn-in equipment. Key responsibilities include development of equipment sourcing strategy, supplier commercial/technical negotiations and supplier management to successfully execute development and deploy the equipments at various Intel factories. Sr. Supplier Product Engineer Intel Corporation 2005  –  2010  (5 years) Portland, Oregon Area Worked with various semiconductor companies (i.e. Integrated circuit foundries, Memory suppliers and NAND controller suppliers) to manage technical aspect of external product procurement. Responsible for technical supplier management, external product qualification and ramp as well as cost and lead time reduction. Worked on broad aspects of semiconductor business (fab, assembly, test and quality/reliability) to ensure smooth product supply with high quality and low cost. Performed various supplier risk assessment, product qualifications and cost analysis. Sr. Quality Reliability Engineer Intel Corporation 2003  –  2005  (2 years) Portland, Oregon Area Responsible for quality and reliability of Intel’s microprocessor for the embedded markets. Closely worked with technology development team and marketing to bring leading edge products to new market segments by performing reliability and use conditions analysis. Established product quality and reliability goals and strategies for new market segments. Supplier Quality & Reliability Engineer Intel Corporation 1997  –  2004  (7 years) Portland, Oregon Area Worked with various semiconductor companies (Graphics & Audio suppliers) to provide high quality and low cost external products. Responsible for supplier technical and quality management through product risk assessments, supplier audits and product qualification. Quality Reliability Engineer Intel Corporation 1990  –  1997  (7 years) Folsom California Responsible for new product qualification and process certification. Key activities include development of product qualification plan, product quality/reliability assessment through data collection/analysis, failure analysis and first silicon debug. Applications Engineer KLA-Tencor 1989  –  1991  (2 years) Developed defect inspection applications and supported sales by making technical presentations for potential customers. Trained customers on key features and options for automated wafer inspection systems; worked with customers to develop new defect inspection methodologies. Sr. Test Equipment Development Engineer Intel Corporation 2010  – Present (5 years) Portland, Oregon Area Worked with Tester/Burn-in equipment suppliers, technology development teams and factories to develop and deploy Tester/Burn-in equipment. Key responsibilities include development of equipment sourcing strategy, supplier commercial/technical negotiations and supplier management to successfully execute development and deploy the equipments at various Intel factories. Sr. Test Equipment Development Engineer Intel Corporation 2010  – Present (5 years) Portland, Oregon Area Worked with Tester/Burn-in equipment suppliers, technology development teams and factories to develop and deploy Tester/Burn-in equipment. Key responsibilities include development of equipment sourcing strategy, supplier commercial/technical negotiations and supplier management to successfully execute development and deploy the equipments at various Intel factories. Sr. Supplier Product Engineer Intel Corporation 2005  –  2010  (5 years) Portland, Oregon Area Worked with various semiconductor companies (i.e. Integrated circuit foundries, Memory suppliers and NAND controller suppliers) to manage technical aspect of external product procurement. Responsible for technical supplier management, external product qualification and ramp as well as cost and lead time reduction. Worked on broad aspects of semiconductor business (fab, assembly, test and quality/reliability) to ensure smooth product supply with high quality and low cost. Performed various supplier risk assessment, product qualifications and cost analysis. Sr. Supplier Product Engineer Intel Corporation 2005  –  2010  (5 years) Portland, Oregon Area Worked with various semiconductor companies (i.e. Integrated circuit foundries, Memory suppliers and NAND controller suppliers) to manage technical aspect of external product procurement. Responsible for technical supplier management, external product qualification and ramp as well as cost and lead time reduction. Worked on broad aspects of semiconductor business (fab, assembly, test and quality/reliability) to ensure smooth product supply with high quality and low cost. Performed various supplier risk assessment, product qualifications and cost analysis. Sr. Quality Reliability Engineer Intel Corporation 2003  –  2005  (2 years) Portland, Oregon Area Responsible for quality and reliability of Intel’s microprocessor for the embedded markets. Closely worked with technology development team and marketing to bring leading edge products to new market segments by performing reliability and use conditions analysis. Established product quality and reliability goals and strategies for new market segments. Sr. Quality Reliability Engineer Intel Corporation 2003  –  2005  (2 years) Portland, Oregon Area Responsible for quality and reliability of Intel’s microprocessor for the embedded markets. Closely worked with technology development team and marketing to bring leading edge products to new market segments by performing reliability and use conditions analysis. Established product quality and reliability goals and strategies for new market segments. Supplier Quality & Reliability Engineer Intel Corporation 1997  –  2004  (7 years) Portland, Oregon Area Worked with various semiconductor companies (Graphics & Audio suppliers) to provide high quality and low cost external products. Responsible for supplier technical and quality management through product risk assessments, supplier audits and product qualification. Supplier Quality & Reliability Engineer Intel Corporation 1997  –  2004  (7 years) Portland, Oregon Area Worked with various semiconductor companies (Graphics & Audio suppliers) to provide high quality and low cost external products. Responsible for supplier technical and quality management through product risk assessments, supplier audits and product qualification. Quality Reliability Engineer Intel Corporation 1990  –  1997  (7 years) Folsom California Responsible for new product qualification and process certification. Key activities include development of product qualification plan, product quality/reliability assessment through data collection/analysis, failure analysis and first silicon debug. Quality Reliability Engineer Intel Corporation 1990  –  1997  (7 years) Folsom California Responsible for new product qualification and process certification. Key activities include development of product qualification plan, product quality/reliability assessment through data collection/analysis, failure analysis and first silicon debug. Applications Engineer KLA-Tencor 1989  –  1991  (2 years) Developed defect inspection applications and supported sales by making technical presentations for potential customers. Trained customers on key features and options for automated wafer inspection systems; worked with customers to develop new defect inspection methodologies. Applications Engineer KLA-Tencor 1989  –  1991  (2 years) Developed defect inspection applications and supported sales by making technical presentations for potential customers. Trained customers on key features and options for automated wafer inspection systems; worked with customers to develop new defect inspection methodologies. Languages English Korean English Korean English Korean Skills Semiconductor... Quality and Reliability Capital Equipment ASIC IC Silicon Semiconductor Industry Failure Analysis Yield Operations Management Supply Chain Management Supplier Quality... Manufacturing... Procurement Foundry Management Capital Equipment... Video Production Video Editing Korean See 4+     See less Skills  Semiconductor... Quality and Reliability Capital Equipment ASIC IC Silicon Semiconductor Industry Failure Analysis Yield Operations Management Supply Chain Management Supplier Quality... Manufacturing... Procurement Foundry Management Capital Equipment... Video Production Video Editing Korean See 4+     See less Semiconductor... Quality and Reliability Capital Equipment ASIC IC Silicon Semiconductor Industry Failure Analysis Yield Operations Management Supply Chain Management Supplier Quality... Manufacturing... Procurement Foundry Management Capital Equipment... Video Production Video Editing Korean See 4+     See less Semiconductor... Quality and Reliability Capital Equipment ASIC IC Silicon Semiconductor Industry Failure Analysis Yield Operations Management Supply Chain Management Supplier Quality... Manufacturing... Procurement Foundry Management Capital Equipment... Video Production Video Editing Korean See 4+     See less Education University of Illinois at Urbana-Champaign BS,  Electrical Engineering University of Illinois at Urbana-Champaign BS,  Electrical Engineering University of Illinois at Urbana-Champaign BS,  Electrical Engineering University of Illinois at Urbana-Champaign BS,  Electrical Engineering ", "Summary Senior Product Quality and Reliability engineer at Intel Corporation in Hudson, MA with 18 years of experience in semiconductor quality and reliability. Summary Senior Product Quality and Reliability engineer at Intel Corporation in Hudson, MA with 18 years of experience in semiconductor quality and reliability. Senior Product Quality and Reliability engineer at Intel Corporation in Hudson, MA with 18 years of experience in semiconductor quality and reliability. Senior Product Quality and Reliability engineer at Intel Corporation in Hudson, MA with 18 years of experience in semiconductor quality and reliability. Experience Silicon Architect Engineer Intel Corporation May 2013  – Present (2 years 4 months) Hudson, MA Developed Xeon processor soft error rate modeling capabilities, including system-level statistical fault injection for program vulnerability factor calculations. Developed new hardware soft error rate testing methodologies. Continued to own product soft error rate proton and neutron beam testing. Quality and Reliability Engineer Intel 2011  –  May 2013  (2 years) Intel Development Group, Hudson, MA Owns assessing product SER performance through beam testing, and driving the development of capabilities related to product SER testing and modeling, and to providing technical guidance to Intel on managing SER performance for future products.  \n \nCoordinates all aspects of system level beam testing for Xeon, Xeon Phi, Itanium and Atom products, including hardware and workload set up, beam testing logistics and data analysis. Product Quality and Reliability Engineer Intel Corporation 2008  –  2011  (3 years) Enterprise Microprocessor Group Product Quality and Reliability Engineer for the Itanium processor family. Primarily focused on frequency degradation guardband bin split optimization and Vccmin erratic bit analysis. Set up the lab and ran the Itanium system stress experiments. Set up the Itanium on-site validation (OSV) system and wrote the test flow controller software. Chaired the CPU-Chipset Goals And Use Conditions Joint Engineering team. Product Quality and Reliability Engineer Intel Corporation 1998  –  2008  (10 years) Chipset Product Division, Folsom, CA Technical lead for Chipset Design in Quality and Reliability team, responsible for analysis of electromigration, gate oxide breakdown, vccmin erratic bit, frequency degradation and soft error rate. Designed a novel “NAND-fill” test chip to measure metal layer defect density. Product Engineer Intel Corporation 1995  –  1998  (3 years) Flash Memory Product Division - Folsom, CA Silicon Architect Engineer Intel Corporation May 2013  – Present (2 years 4 months) Hudson, MA Developed Xeon processor soft error rate modeling capabilities, including system-level statistical fault injection for program vulnerability factor calculations. Developed new hardware soft error rate testing methodologies. Continued to own product soft error rate proton and neutron beam testing. Silicon Architect Engineer Intel Corporation May 2013  – Present (2 years 4 months) Hudson, MA Developed Xeon processor soft error rate modeling capabilities, including system-level statistical fault injection for program vulnerability factor calculations. Developed new hardware soft error rate testing methodologies. Continued to own product soft error rate proton and neutron beam testing. Quality and Reliability Engineer Intel 2011  –  May 2013  (2 years) Intel Development Group, Hudson, MA Owns assessing product SER performance through beam testing, and driving the development of capabilities related to product SER testing and modeling, and to providing technical guidance to Intel on managing SER performance for future products.  \n \nCoordinates all aspects of system level beam testing for Xeon, Xeon Phi, Itanium and Atom products, including hardware and workload set up, beam testing logistics and data analysis. Quality and Reliability Engineer Intel 2011  –  May 2013  (2 years) Intel Development Group, Hudson, MA Owns assessing product SER performance through beam testing, and driving the development of capabilities related to product SER testing and modeling, and to providing technical guidance to Intel on managing SER performance for future products.  \n \nCoordinates all aspects of system level beam testing for Xeon, Xeon Phi, Itanium and Atom products, including hardware and workload set up, beam testing logistics and data analysis. Product Quality and Reliability Engineer Intel Corporation 2008  –  2011  (3 years) Enterprise Microprocessor Group Product Quality and Reliability Engineer for the Itanium processor family. Primarily focused on frequency degradation guardband bin split optimization and Vccmin erratic bit analysis. Set up the lab and ran the Itanium system stress experiments. Set up the Itanium on-site validation (OSV) system and wrote the test flow controller software. Chaired the CPU-Chipset Goals And Use Conditions Joint Engineering team. Product Quality and Reliability Engineer Intel Corporation 2008  –  2011  (3 years) Enterprise Microprocessor Group Product Quality and Reliability Engineer for the Itanium processor family. Primarily focused on frequency degradation guardband bin split optimization and Vccmin erratic bit analysis. Set up the lab and ran the Itanium system stress experiments. Set up the Itanium on-site validation (OSV) system and wrote the test flow controller software. Chaired the CPU-Chipset Goals And Use Conditions Joint Engineering team. Product Quality and Reliability Engineer Intel Corporation 1998  –  2008  (10 years) Chipset Product Division, Folsom, CA Technical lead for Chipset Design in Quality and Reliability team, responsible for analysis of electromigration, gate oxide breakdown, vccmin erratic bit, frequency degradation and soft error rate. Designed a novel “NAND-fill” test chip to measure metal layer defect density. Product Quality and Reliability Engineer Intel Corporation 1998  –  2008  (10 years) Chipset Product Division, Folsom, CA Technical lead for Chipset Design in Quality and Reliability team, responsible for analysis of electromigration, gate oxide breakdown, vccmin erratic bit, frequency degradation and soft error rate. Designed a novel “NAND-fill” test chip to measure metal layer defect density. Product Engineer Intel Corporation 1995  –  1998  (3 years) Flash Memory Product Division - Folsom, CA Product Engineer Intel Corporation 1995  –  1998  (3 years) Flash Memory Product Division - Folsom, CA Skills Semiconductors Failure Analysis IC JMP Design of Experiments Reliability Engineering CMOS Reliability Silicon SoC Product Engineering Skills  Semiconductors Failure Analysis IC JMP Design of Experiments Reliability Engineering CMOS Reliability Silicon SoC Product Engineering Semiconductors Failure Analysis IC JMP Design of Experiments Reliability Engineering CMOS Reliability Silicon SoC Product Engineering Semiconductors Failure Analysis IC JMP Design of Experiments Reliability Engineering CMOS Reliability Silicon SoC Product Engineering Education Rochester Institute of Technology Bachelor of Science (B.S.),  Microelectronic Engineering 1990  – 1995 Rochester Institute of Technology Bachelor of Science (B.S.),  Microelectronic Engineering 1990  – 1995 Rochester Institute of Technology Bachelor of Science (B.S.),  Microelectronic Engineering 1990  – 1995 Rochester Institute of Technology Bachelor of Science (B.S.),  Microelectronic Engineering 1990  – 1995 ", "Summary ●\tStrong initiative and leadership in technical problem solving \n●\tSolid statistical data analytical skills and Quality and Reliability knowledge/applications \n●\t9+ years IT industry experience in technical project management and 4+ years in Quality/Reliability service \n●\tExcellent global cross functional team working skills \n●\tExtensive experience in working with Asian customers/suppliers and US third parties \n●\tMature, teliable and effective communication skills; Mentoring and coaching experience Specialties:Quality and Reliabity in consumer electronics, Suplier Quality management, Reliability model and testing, Statistical data analysis, FMEA, manufacturing process and quality control Summary ●\tStrong initiative and leadership in technical problem solving \n●\tSolid statistical data analytical skills and Quality and Reliability knowledge/applications \n●\t9+ years IT industry experience in technical project management and 4+ years in Quality/Reliability service \n●\tExcellent global cross functional team working skills \n●\tExtensive experience in working with Asian customers/suppliers and US third parties \n●\tMature, teliable and effective communication skills; Mentoring and coaching experience Specialties:Quality and Reliabity in consumer electronics, Suplier Quality management, Reliability model and testing, Statistical data analysis, FMEA, manufacturing process and quality control ●\tStrong initiative and leadership in technical problem solving \n●\tSolid statistical data analytical skills and Quality and Reliability knowledge/applications \n●\t9+ years IT industry experience in technical project management and 4+ years in Quality/Reliability service \n●\tExcellent global cross functional team working skills \n●\tExtensive experience in working with Asian customers/suppliers and US third parties \n●\tMature, teliable and effective communication skills; Mentoring and coaching experience Specialties:Quality and Reliabity in consumer electronics, Suplier Quality management, Reliability model and testing, Statistical data analysis, FMEA, manufacturing process and quality control ●\tStrong initiative and leadership in technical problem solving \n●\tSolid statistical data analytical skills and Quality and Reliability knowledge/applications \n●\t9+ years IT industry experience in technical project management and 4+ years in Quality/Reliability service \n●\tExcellent global cross functional team working skills \n●\tExtensive experience in working with Asian customers/suppliers and US third parties \n●\tMature, teliable and effective communication skills; Mentoring and coaching experience Specialties:Quality and Reliabity in consumer electronics, Suplier Quality management, Reliability model and testing, Statistical data analysis, FMEA, manufacturing process and quality control Experience Lead System Product Quality Reliability Engineer Intel Corporation January 2012  – Present (3 years 8 months) Folsom, CA Qualified first worldwide 20nm SSD (Solid State Disk) within 8 months. Define RDT (Reliability Demonstration Test) test infrastructure and improve test cvoverage to address reliability concerns. Divisional Customer Quality and Reliability Engineer Intel Corporation January 2011  –  December 2011  (1 year) Folsom, California Facilitate Outgoing DPM (Defect per million) goal by provide in-depth technical support to customer qualification and production issue. Drive systematical failure analysis and effective communication to major channel and OEM customers. Customer Quality/Service Representative Intel Corporation January 2007  –  January 2009  (2 years 1 month) Shanghai, China Provide tier 1 ODM in China with world class CPU/chipset production line/field return services. Grow ODM customer in Small Form factor PCB mechanical design by facilitating in-depth technical engagement. Project Manager/Product Engineer Intel July 2001  –  December 2006  (5 years 6 months) Shanghai, China Facilitate P803~P806 generation Stacked Chip Scale Package products pre-launch and manufacturing certification. Manage RAM supplier and assembly line health. Mitigate customer excursions and address yield concerns by continuously improve manufacturing process and test coverage. Lead System Product Quality Reliability Engineer Intel Corporation January 2012  – Present (3 years 8 months) Folsom, CA Qualified first worldwide 20nm SSD (Solid State Disk) within 8 months. Define RDT (Reliability Demonstration Test) test infrastructure and improve test cvoverage to address reliability concerns. Lead System Product Quality Reliability Engineer Intel Corporation January 2012  – Present (3 years 8 months) Folsom, CA Qualified first worldwide 20nm SSD (Solid State Disk) within 8 months. Define RDT (Reliability Demonstration Test) test infrastructure and improve test cvoverage to address reliability concerns. Divisional Customer Quality and Reliability Engineer Intel Corporation January 2011  –  December 2011  (1 year) Folsom, California Facilitate Outgoing DPM (Defect per million) goal by provide in-depth technical support to customer qualification and production issue. Drive systematical failure analysis and effective communication to major channel and OEM customers. Divisional Customer Quality and Reliability Engineer Intel Corporation January 2011  –  December 2011  (1 year) Folsom, California Facilitate Outgoing DPM (Defect per million) goal by provide in-depth technical support to customer qualification and production issue. Drive systematical failure analysis and effective communication to major channel and OEM customers. Customer Quality/Service Representative Intel Corporation January 2007  –  January 2009  (2 years 1 month) Shanghai, China Provide tier 1 ODM in China with world class CPU/chipset production line/field return services. Grow ODM customer in Small Form factor PCB mechanical design by facilitating in-depth technical engagement. Customer Quality/Service Representative Intel Corporation January 2007  –  January 2009  (2 years 1 month) Shanghai, China Provide tier 1 ODM in China with world class CPU/chipset production line/field return services. Grow ODM customer in Small Form factor PCB mechanical design by facilitating in-depth technical engagement. Project Manager/Product Engineer Intel July 2001  –  December 2006  (5 years 6 months) Shanghai, China Facilitate P803~P806 generation Stacked Chip Scale Package products pre-launch and manufacturing certification. Manage RAM supplier and assembly line health. Mitigate customer excursions and address yield concerns by continuously improve manufacturing process and test coverage. Project Manager/Product Engineer Intel July 2001  –  December 2006  (5 years 6 months) Shanghai, China Facilitate P803~P806 generation Stacked Chip Scale Package products pre-launch and manufacturing certification. Manage RAM supplier and assembly line health. Mitigate customer excursions and address yield concerns by continuously improve manufacturing process and test coverage. Languages Chinese Chinese Chinese Skills Product Development Cross-functional Team... Semiconductors Reliability Engineering Reliability Data Analysis Failure Analysis Data Mining Statistics Six Sigma Design of Experiments Manufacturing Processes FMEA Testing Survival Analysis Program Management Supplier Quality... Product Management R Perl SAS C++ Databases See 8+     See less Skills  Product Development Cross-functional Team... Semiconductors Reliability Engineering Reliability Data Analysis Failure Analysis Data Mining Statistics Six Sigma Design of Experiments Manufacturing Processes FMEA Testing Survival Analysis Program Management Supplier Quality... Product Management R Perl SAS C++ Databases See 8+     See less Product Development Cross-functional Team... Semiconductors Reliability Engineering Reliability Data Analysis Failure Analysis Data Mining Statistics Six Sigma Design of Experiments Manufacturing Processes FMEA Testing Survival Analysis Program Management Supplier Quality... Product Management R Perl SAS C++ Databases See 8+     See less Product Development Cross-functional Team... Semiconductors Reliability Engineering Reliability Data Analysis Failure Analysis Data Mining Statistics Six Sigma Design of Experiments Manufacturing Processes FMEA Testing Survival Analysis Program Management Supplier Quality... Product Management R Perl SAS C++ Databases See 8+     See less Education University of North Carolina at Chapel Hill Master of Science (M.S.),  Statistics and Operations Research 2009  – 2010 PMI U.S PMP,  Project Management Professional 2004  – 2007 Zhejiang University B.S.,  Information Engineering 1997  – 2001 University of North Carolina at Chapel Hill Master of Science (M.S.),  Statistics and Operations Research 2009  – 2010 University of North Carolina at Chapel Hill Master of Science (M.S.),  Statistics and Operations Research 2009  – 2010 University of North Carolina at Chapel Hill Master of Science (M.S.),  Statistics and Operations Research 2009  – 2010 PMI U.S PMP,  Project Management Professional 2004  – 2007 PMI U.S PMP,  Project Management Professional 2004  – 2007 PMI U.S PMP,  Project Management Professional 2004  – 2007 Zhejiang University B.S.,  Information Engineering 1997  – 2001 Zhejiang University B.S.,  Information Engineering 1997  – 2001 Zhejiang University B.S.,  Information Engineering 1997  – 2001 ", "Skills Reliability Engineering Management Statistical Tools Reliability Test Materials Science IC packaging IC Testing IC Assembly Skills  Reliability Engineering Management Statistical Tools Reliability Test Materials Science IC packaging IC Testing IC Assembly Reliability Engineering Management Statistical Tools Reliability Test Materials Science IC packaging IC Testing IC Assembly Reliability Engineering Management Statistical Tools Reliability Test Materials Science IC packaging IC Testing IC Assembly ", "Summary With 9 years’ semiconductor professional working experience in flash memory R&D group; Familiar with NOR flash working model, qualification and reliability flow Electric and physical failure analysis tool and method; Working area has covered pre-silicon simulation, post silicon validation, qualification and failure analysis; Participated R&D qualification and validation activities of 3 generation flash memory, and responsible for Qualification and customer issues support; Accumulated Project management skills and Comprehensive Analysis capability. Summary With 9 years’ semiconductor professional working experience in flash memory R&D group; Familiar with NOR flash working model, qualification and reliability flow Electric and physical failure analysis tool and method; Working area has covered pre-silicon simulation, post silicon validation, qualification and failure analysis; Participated R&D qualification and validation activities of 3 generation flash memory, and responsible for Qualification and customer issues support; Accumulated Project management skills and Comprehensive Analysis capability. With 9 years’ semiconductor professional working experience in flash memory R&D group; Familiar with NOR flash working model, qualification and reliability flow Electric and physical failure analysis tool and method; Working area has covered pre-silicon simulation, post silicon validation, qualification and failure analysis; Participated R&D qualification and validation activities of 3 generation flash memory, and responsible for Qualification and customer issues support; Accumulated Project management skills and Comprehensive Analysis capability. With 9 years’ semiconductor professional working experience in flash memory R&D group; Familiar with NOR flash working model, qualification and reliability flow Electric and physical failure analysis tool and method; Working area has covered pre-silicon simulation, post silicon validation, qualification and failure analysis; Participated R&D qualification and validation activities of 3 generation flash memory, and responsible for Qualification and customer issues support; Accumulated Project management skills and Comprehensive Analysis capability. Experience Quality and Reliability Engineer Intel Corporation January 2014  – Present (1 year 8 months) Shanghai City, China Design Engineer of Validation Team Micron Technology April 2011  –  January 2014  (2 years 10 months) Mainly Support Root Cause Debug and Corrective Action Devlopment for Flash Memory customer issues Quality and Reliability Engineer Numonyx January 2010  –  March 2011  (1 year 3 months) Be responsible for solving customer issue during new flash product ramp up process. Take charge of failure analysis for customer return, driving out root cause and containment action, and generating 8D report. Quality and Reliability Engineer Intel Corporation May 2007  –  December 2009  (2 years 8 months) Joined new generation NOR flash memory R&D as QRE project leader, took responsibilities of qualification plan, risk assessment, and data collection/analysis, qualified the new product to meet datasheet and JEDEC spec. Failure Analysis Engineer team leader Intel Corporation April 2004  –  April 2007  (3 years 1 month) Took the role of FAE team leader, supported all the physical failure analysis work of flash memory which qualified in Shanghai.  \nMade efforts on FA technique and equipment development. Setup the first dual beam FIB in the lab and extended the FIB capability, upgraded the FA/FI tool, which made FI successful rate increased to near 90% from previous 40%, improved FA lab capability. Quality and Reliability Engineer Intel Corporation January 2014  – Present (1 year 8 months) Shanghai City, China Quality and Reliability Engineer Intel Corporation January 2014  – Present (1 year 8 months) Shanghai City, China Design Engineer of Validation Team Micron Technology April 2011  –  January 2014  (2 years 10 months) Mainly Support Root Cause Debug and Corrective Action Devlopment for Flash Memory customer issues Design Engineer of Validation Team Micron Technology April 2011  –  January 2014  (2 years 10 months) Mainly Support Root Cause Debug and Corrective Action Devlopment for Flash Memory customer issues Quality and Reliability Engineer Numonyx January 2010  –  March 2011  (1 year 3 months) Be responsible for solving customer issue during new flash product ramp up process. Take charge of failure analysis for customer return, driving out root cause and containment action, and generating 8D report. Quality and Reliability Engineer Numonyx January 2010  –  March 2011  (1 year 3 months) Be responsible for solving customer issue during new flash product ramp up process. Take charge of failure analysis for customer return, driving out root cause and containment action, and generating 8D report. Quality and Reliability Engineer Intel Corporation May 2007  –  December 2009  (2 years 8 months) Joined new generation NOR flash memory R&D as QRE project leader, took responsibilities of qualification plan, risk assessment, and data collection/analysis, qualified the new product to meet datasheet and JEDEC spec. Quality and Reliability Engineer Intel Corporation May 2007  –  December 2009  (2 years 8 months) Joined new generation NOR flash memory R&D as QRE project leader, took responsibilities of qualification plan, risk assessment, and data collection/analysis, qualified the new product to meet datasheet and JEDEC spec. Failure Analysis Engineer team leader Intel Corporation April 2004  –  April 2007  (3 years 1 month) Took the role of FAE team leader, supported all the physical failure analysis work of flash memory which qualified in Shanghai.  \nMade efforts on FA technique and equipment development. Setup the first dual beam FIB in the lab and extended the FIB capability, upgraded the FA/FI tool, which made FI successful rate increased to near 90% from previous 40%, improved FA lab capability. Failure Analysis Engineer team leader Intel Corporation April 2004  –  April 2007  (3 years 1 month) Took the role of FAE team leader, supported all the physical failure analysis work of flash memory which qualified in Shanghai.  \nMade efforts on FA technique and equipment development. Setup the first dual beam FIB in the lab and extended the FIB capability, upgraded the FA/FI tool, which made FI successful rate increased to near 90% from previous 40%, improved FA lab capability. Skills Experience in handling... Proficient in physical... Familiar with... Skills  Experience in handling... Proficient in physical... Familiar with... Experience in handling... Proficient in physical... Familiar with... Experience in handling... Proficient in physical... Familiar with... Education East China Normal University Master,  Microelectronics 2001  – 2004 East China Normal University Bachelor,  Microelectronics 1997  – 2001 East China Normal University Master,  Microelectronics 2001  – 2004 East China Normal University Master,  Microelectronics 2001  – 2004 East China Normal University Master,  Microelectronics 2001  – 2004 East China Normal University Bachelor,  Microelectronics 1997  – 2001 East China Normal University Bachelor,  Microelectronics 1997  – 2001 East China Normal University Bachelor,  Microelectronics 1997  – 2001 ", "Languages Spanish English Spanish English Spanish English Skills Failure Analysis Manufacturing Root Cause Analysis Design of Experiments Testing Engineering Continuous Improvement Reliability Engineering Semiconductor Industry Lean Manufacturing JMP Semiconductors Cross-functional Team... FMEA Reliability Electronics Process Engineering Root Cause Problem... SPC Process Improvement Business Process... ISO 13485:2003 Risk Management Risk Assessment CAPA Product Certification Technology Transfer Product Transfer DMAIC Electronics Packaging Quality System Product Development Lean manufacturing Six Sigma See 19+     See less Skills  Failure Analysis Manufacturing Root Cause Analysis Design of Experiments Testing Engineering Continuous Improvement Reliability Engineering Semiconductor Industry Lean Manufacturing JMP Semiconductors Cross-functional Team... FMEA Reliability Electronics Process Engineering Root Cause Problem... SPC Process Improvement Business Process... ISO 13485:2003 Risk Management Risk Assessment CAPA Product Certification Technology Transfer Product Transfer DMAIC Electronics Packaging Quality System Product Development Lean manufacturing Six Sigma See 19+     See less Failure Analysis Manufacturing Root Cause Analysis Design of Experiments Testing Engineering Continuous Improvement Reliability Engineering Semiconductor Industry Lean Manufacturing JMP Semiconductors Cross-functional Team... FMEA Reliability Electronics Process Engineering Root Cause Problem... SPC Process Improvement Business Process... ISO 13485:2003 Risk Management Risk Assessment CAPA Product Certification Technology Transfer Product Transfer DMAIC Electronics Packaging Quality System Product Development Lean manufacturing Six Sigma See 19+     See less Failure Analysis Manufacturing Root Cause Analysis Design of Experiments Testing Engineering Continuous Improvement Reliability Engineering Semiconductor Industry Lean Manufacturing JMP Semiconductors Cross-functional Team... FMEA Reliability Electronics Process Engineering Root Cause Problem... SPC Process Improvement Business Process... ISO 13485:2003 Risk Management Risk Assessment CAPA Product Certification Technology Transfer Product Transfer DMAIC Electronics Packaging Quality System Product Development Lean manufacturing Six Sigma See 19+     See less ", "Skills Process Integration JMP Semiconductors Metrology Yield Process Engineering Process Simulation Etching Lithography Semiconductor Process Manufacturing Continuous Improvement Root Cause Analysis Engineering Design of Experiments Silicon Thin Films SPC Failure Analysis Semiconductor Industry Characterization Photolithography CMOS PVD Plasma Etch See 10+     See less Skills  Process Integration JMP Semiconductors Metrology Yield Process Engineering Process Simulation Etching Lithography Semiconductor Process Manufacturing Continuous Improvement Root Cause Analysis Engineering Design of Experiments Silicon Thin Films SPC Failure Analysis Semiconductor Industry Characterization Photolithography CMOS PVD Plasma Etch See 10+     See less Process Integration JMP Semiconductors Metrology Yield Process Engineering Process Simulation Etching Lithography Semiconductor Process Manufacturing Continuous Improvement Root Cause Analysis Engineering Design of Experiments Silicon Thin Films SPC Failure Analysis Semiconductor Industry Characterization Photolithography CMOS PVD Plasma Etch See 10+     See less Process Integration JMP Semiconductors Metrology Yield Process Engineering Process Simulation Etching Lithography Semiconductor Process Manufacturing Continuous Improvement Root Cause Analysis Engineering Design of Experiments Silicon Thin Films SPC Failure Analysis Semiconductor Industry Characterization Photolithography CMOS PVD Plasma Etch See 10+     See less ", "Skills Semiconductors CMOS IC Mixed Signal Analog Cadence Virtuoso Analog Circuit Design Circuit Design PLL VLSI Semiconductor Industry Integrated Circuit... Digital Signal... Power Management RF Intel Low-power Design SoC DFT Silicon PCIe Microprocessors Product Engineering SRAM ASIC Microelectronics Processors Physical Design Signal Integrity Hardware Architecture Failure Analysis Spectre SystemVerilog Static Timing Analysis SPICE EDA Verilog RTL design Functional Verification Debugging TCL Computer Architecture RTL verification FPGA ModelSim JMP Cadence Characterization Semiconductor Process ADCs See 35+     See less Skills  Semiconductors CMOS IC Mixed Signal Analog Cadence Virtuoso Analog Circuit Design Circuit Design PLL VLSI Semiconductor Industry Integrated Circuit... Digital Signal... Power Management RF Intel Low-power Design SoC DFT Silicon PCIe Microprocessors Product Engineering SRAM ASIC Microelectronics Processors Physical Design Signal Integrity Hardware Architecture Failure Analysis Spectre SystemVerilog Static Timing Analysis SPICE EDA Verilog RTL design Functional Verification Debugging TCL Computer Architecture RTL verification FPGA ModelSim JMP Cadence Characterization Semiconductor Process ADCs See 35+     See less Semiconductors CMOS IC Mixed Signal Analog Cadence Virtuoso Analog Circuit Design Circuit Design PLL VLSI Semiconductor Industry Integrated Circuit... Digital Signal... Power Management RF Intel Low-power Design SoC DFT Silicon PCIe Microprocessors Product Engineering SRAM ASIC Microelectronics Processors Physical Design Signal Integrity Hardware Architecture Failure Analysis Spectre SystemVerilog Static Timing Analysis SPICE EDA Verilog RTL design Functional Verification Debugging TCL Computer Architecture RTL verification FPGA ModelSim JMP Cadence Characterization Semiconductor Process ADCs See 35+     See less Semiconductors CMOS IC Mixed Signal Analog Cadence Virtuoso Analog Circuit Design Circuit Design PLL VLSI Semiconductor Industry Integrated Circuit... Digital Signal... Power Management RF Intel Low-power Design SoC DFT Silicon PCIe Microprocessors Product Engineering SRAM ASIC Microelectronics Processors Physical Design Signal Integrity Hardware Architecture Failure Analysis Spectre SystemVerilog Static Timing Analysis SPICE EDA Verilog RTL design Functional Verification Debugging TCL Computer Architecture RTL verification FPGA ModelSim JMP Cadence Characterization Semiconductor Process ADCs See 35+     See less Honors & Awards ", "Languages English Mandarin Cantonese Malay English Mandarin Cantonese Malay English Mandarin Cantonese Malay Skills Six Sigma Quality Assurance Quality Management Engineering Management Cross-functional Team... Root Cause Analysis Quality Control Lean Manufacturing Testing SPC Electronics FMEA Supplier Quality Manufacturing Quality Auditing Semiconductors Process Improvement Process Simulation Process Engineering Design of Experiments Product Lifecycle... Failure Analysis Design for Manufacturing See 8+     See less Skills  Six Sigma Quality Assurance Quality Management Engineering Management Cross-functional Team... Root Cause Analysis Quality Control Lean Manufacturing Testing SPC Electronics FMEA Supplier Quality Manufacturing Quality Auditing Semiconductors Process Improvement Process Simulation Process Engineering Design of Experiments Product Lifecycle... Failure Analysis Design for Manufacturing See 8+     See less Six Sigma Quality Assurance Quality Management Engineering Management Cross-functional Team... Root Cause Analysis Quality Control Lean Manufacturing Testing SPC Electronics FMEA Supplier Quality Manufacturing Quality Auditing Semiconductors Process Improvement Process Simulation Process Engineering Design of Experiments Product Lifecycle... Failure Analysis Design for Manufacturing See 8+     See less Six Sigma Quality Assurance Quality Management Engineering Management Cross-functional Team... Root Cause Analysis Quality Control Lean Manufacturing Testing SPC Electronics FMEA Supplier Quality Manufacturing Quality Auditing Semiconductors Process Improvement Process Simulation Process Engineering Design of Experiments Product Lifecycle... Failure Analysis Design for Manufacturing See 8+     See less ", "Experience Senior Member of Technical Staff Micron Technology November 2014  – Present (10 months) Folsom, CA As a Senior Member of Technical Staff at Micron it is my responsibility to bridge the gap between NAND silicon design, process and product development to enable integration into world-class SSDs. This includes resuming my previous role leading a team of engineers on the NAND integration of all Micron enterprise Solid State Drives (SSDs) as well as supporting automotive and PCIe-based SSDs. My primary focuses are silicon reliability characterization and development, including JEDEC-tailored testing, material quality selection and disposition, error recovery and trim optimization techniques and overall NAND requirement assessments. Component System Integration Manager Micron Technology January 2013  – Present (2 years 8 months) Folsom, California Currently I am leading a team of product engineers in the integration of NAND silicon into internal SSDs. This includes optimizing process, test, and NAND trims to enable world class enterprise SSDs. Additionally I am developing the data infrastructure to house NAND reliability data from multiple test platforms into a central database location and providing the tools to a wide audience to analyze the data. Senior Member of Technical Staff Micron Technology November 2014  – Present (10 months) Folsom, CA As a Senior Member of Technical Staff at Micron it is my responsibility to bridge the gap between NAND silicon design, process and product development to enable integration into world-class SSDs. This includes resuming my previous role leading a team of engineers on the NAND integration of all Micron enterprise Solid State Drives (SSDs) as well as supporting automotive and PCIe-based SSDs. My primary focuses are silicon reliability characterization and development, including JEDEC-tailored testing, material quality selection and disposition, error recovery and trim optimization techniques and overall NAND requirement assessments. Senior Member of Technical Staff Micron Technology November 2014  – Present (10 months) Folsom, CA As a Senior Member of Technical Staff at Micron it is my responsibility to bridge the gap between NAND silicon design, process and product development to enable integration into world-class SSDs. This includes resuming my previous role leading a team of engineers on the NAND integration of all Micron enterprise Solid State Drives (SSDs) as well as supporting automotive and PCIe-based SSDs. My primary focuses are silicon reliability characterization and development, including JEDEC-tailored testing, material quality selection and disposition, error recovery and trim optimization techniques and overall NAND requirement assessments. Component System Integration Manager Micron Technology January 2013  – Present (2 years 8 months) Folsom, California Currently I am leading a team of product engineers in the integration of NAND silicon into internal SSDs. This includes optimizing process, test, and NAND trims to enable world class enterprise SSDs. Additionally I am developing the data infrastructure to house NAND reliability data from multiple test platforms into a central database location and providing the tools to a wide audience to analyze the data. Component System Integration Manager Micron Technology January 2013  – Present (2 years 8 months) Folsom, California Currently I am leading a team of product engineers in the integration of NAND silicon into internal SSDs. This includes optimizing process, test, and NAND trims to enable world class enterprise SSDs. Additionally I am developing the data infrastructure to house NAND reliability data from multiple test platforms into a central database location and providing the tools to a wide audience to analyze the data. Skills Flash Memory Intel Semiconductors IC SSD Failure Analysis Testing Silicon Semiconductor Industry CMOS Debugging Product Engineering Manufacturing NAND Flash Perl Hardware Architecture Firmware Program Management Device Characterization Design of Experiments JMP Reliability Database Design MySQL NOR Flash Theory of Constraints People Management See 12+     See less Skills  Flash Memory Intel Semiconductors IC SSD Failure Analysis Testing Silicon Semiconductor Industry CMOS Debugging Product Engineering Manufacturing NAND Flash Perl Hardware Architecture Firmware Program Management Device Characterization Design of Experiments JMP Reliability Database Design MySQL NOR Flash Theory of Constraints People Management See 12+     See less Flash Memory Intel Semiconductors IC SSD Failure Analysis Testing Silicon Semiconductor Industry CMOS Debugging Product Engineering Manufacturing NAND Flash Perl Hardware Architecture Firmware Program Management Device Characterization Design of Experiments JMP Reliability Database Design MySQL NOR Flash Theory of Constraints People Management See 12+     See less Flash Memory Intel Semiconductors IC SSD Failure Analysis Testing Silicon Semiconductor Industry CMOS Debugging Product Engineering Manufacturing NAND Flash Perl Hardware Architecture Firmware Program Management Device Characterization Design of Experiments JMP Reliability Database Design MySQL NOR Flash Theory of Constraints People Management See 12+     See less Education California Polytechnic State University-San Luis Obispo BSEE,  Electrical Engineering 1998  – 2003 I love Cal Poly. They have one of the best programs for engineering encompassing book learning with lab experience to get a person ready for real life work. Would recommend this school to ANYONE. Activities and Societies:  Work California Polytechnic State University-San Luis Obispo BSEE,  Electrical Engineering 1998  – 2003 I love Cal Poly. They have one of the best programs for engineering encompassing book learning with lab experience to get a person ready for real life work. Would recommend this school to ANYONE. Activities and Societies:  Work California Polytechnic State University-San Luis Obispo BSEE,  Electrical Engineering 1998  – 2003 I love Cal Poly. They have one of the best programs for engineering encompassing book learning with lab experience to get a person ready for real life work. Would recommend this school to ANYONE. Activities and Societies:  Work California Polytechnic State University-San Luis Obispo BSEE,  Electrical Engineering 1998  – 2003 I love Cal Poly. They have one of the best programs for engineering encompassing book learning with lab experience to get a person ready for real life work. Would recommend this school to ANYONE. Activities and Societies:  Work Honors & Awards Additional Honors & Awards Intel Acheivement Award (2008, 2010) Additional Honors & Awards Intel Acheivement Award (2008, 2010) Additional Honors & Awards Intel Acheivement Award (2008, 2010) Additional Honors & Awards Intel Acheivement Award (2008, 2010) ", "Experience Senior Quality and Reliability Engineer Intel Corporation August 2013  – Present (2 years 1 month) Santa Cara, CA Quality and Reliability Engineer Intel Corporation January 2006  –  July 2013  (7 years 7 months) Hudson, MA Component Design Engineer Intel June 2005  –  December 2005  (7 months) Bangalore, India Senior Quality and Reliability Engineer Intel Corporation August 2013  – Present (2 years 1 month) Santa Cara, CA Senior Quality and Reliability Engineer Intel Corporation August 2013  – Present (2 years 1 month) Santa Cara, CA Quality and Reliability Engineer Intel Corporation January 2006  –  July 2013  (7 years 7 months) Hudson, MA Quality and Reliability Engineer Intel Corporation January 2006  –  July 2013  (7 years 7 months) Hudson, MA Component Design Engineer Intel June 2005  –  December 2005  (7 months) Bangalore, India Component Design Engineer Intel June 2005  –  December 2005  (7 months) Bangalore, India Skills VLSI C++ RTL design Algorithms Simulations Java Verilog Perl Semiconductors Microprocessors Python ASIC EDA VHDL CMOS C IC Debugging See 3+     See less Skills  VLSI C++ RTL design Algorithms Simulations Java Verilog Perl Semiconductors Microprocessors Python ASIC EDA VHDL CMOS C IC Debugging See 3+     See less VLSI C++ RTL design Algorithms Simulations Java Verilog Perl Semiconductors Microprocessors Python ASIC EDA VHDL CMOS C IC Debugging See 3+     See less VLSI C++ RTL design Algorithms Simulations Java Verilog Perl Semiconductors Microprocessors Python ASIC EDA VHDL CMOS C IC Debugging See 3+     See less Education Indian Institute of Technology, Kharagpur Master's,  Computer Science Engineering 2004  – 2005 Indian Institute of Technology, Kharagpur Bachelor's,  Computer Science Enginnering 2000  – 2004 Indian Institute of Technology, Kharagpur Master's,  Computer Science Engineering 2004  – 2005 Indian Institute of Technology, Kharagpur Master's,  Computer Science Engineering 2004  – 2005 Indian Institute of Technology, Kharagpur Master's,  Computer Science Engineering 2004  – 2005 Indian Institute of Technology, Kharagpur Bachelor's,  Computer Science Enginnering 2000  – 2004 Indian Institute of Technology, Kharagpur Bachelor's,  Computer Science Enginnering 2000  – 2004 Indian Institute of Technology, Kharagpur Bachelor's,  Computer Science Enginnering 2000  – 2004 ", "Summary Ameya is working in the Quality in Reliability group at Intel Corporation since 2012 and has exposure to wide variety of areas. He started with a position where he qualified packaged ICs manufactured on Intel’s processes. His primary expertise was in the development of hardware and DOEs for Burn-In and System-level stressing lifetime acceleration experiments. He also did ESD testing, platform level validation, yield and excursion management. Then he moved on to position a where he qualified Intel designed IPs for EMSH, EOS, Aging, ESD, LU, C4-Imax and SER for Intel’s foundry customers, internal and external. Part of his job is also to automate the review process and make it LEAN. \n \nHe has also done a short-term assignment in OVM verification, where he did simulations, regression testing and debugging. While in school, he did an Internship as a Firmware Engineer at a Bio-medical company, Applied Microarrays Inc. When he was in India, he worked for about a year as an Embedded Systems engineer. \n \nAmeya has a BE in Electronics Engineering from Maharaja Sayajirao University in India; and a MS EE (specialization: VLSI and Mixed-Signal Circuit Design) from Arizona State University in USA. Currently he is pursuing a MBA from Kelley School of Business (Indiana University). \n Summary Ameya is working in the Quality in Reliability group at Intel Corporation since 2012 and has exposure to wide variety of areas. He started with a position where he qualified packaged ICs manufactured on Intel’s processes. His primary expertise was in the development of hardware and DOEs for Burn-In and System-level stressing lifetime acceleration experiments. He also did ESD testing, platform level validation, yield and excursion management. Then he moved on to position a where he qualified Intel designed IPs for EMSH, EOS, Aging, ESD, LU, C4-Imax and SER for Intel’s foundry customers, internal and external. Part of his job is also to automate the review process and make it LEAN. \n \nHe has also done a short-term assignment in OVM verification, where he did simulations, regression testing and debugging. While in school, he did an Internship as a Firmware Engineer at a Bio-medical company, Applied Microarrays Inc. When he was in India, he worked for about a year as an Embedded Systems engineer. \n \nAmeya has a BE in Electronics Engineering from Maharaja Sayajirao University in India; and a MS EE (specialization: VLSI and Mixed-Signal Circuit Design) from Arizona State University in USA. Currently he is pursuing a MBA from Kelley School of Business (Indiana University). \n Ameya is working in the Quality in Reliability group at Intel Corporation since 2012 and has exposure to wide variety of areas. He started with a position where he qualified packaged ICs manufactured on Intel’s processes. His primary expertise was in the development of hardware and DOEs for Burn-In and System-level stressing lifetime acceleration experiments. He also did ESD testing, platform level validation, yield and excursion management. Then he moved on to position a where he qualified Intel designed IPs for EMSH, EOS, Aging, ESD, LU, C4-Imax and SER for Intel’s foundry customers, internal and external. Part of his job is also to automate the review process and make it LEAN. \n \nHe has also done a short-term assignment in OVM verification, where he did simulations, regression testing and debugging. While in school, he did an Internship as a Firmware Engineer at a Bio-medical company, Applied Microarrays Inc. When he was in India, he worked for about a year as an Embedded Systems engineer. \n \nAmeya has a BE in Electronics Engineering from Maharaja Sayajirao University in India; and a MS EE (specialization: VLSI and Mixed-Signal Circuit Design) from Arizona State University in USA. Currently he is pursuing a MBA from Kelley School of Business (Indiana University). \n Ameya is working in the Quality in Reliability group at Intel Corporation since 2012 and has exposure to wide variety of areas. He started with a position where he qualified packaged ICs manufactured on Intel’s processes. His primary expertise was in the development of hardware and DOEs for Burn-In and System-level stressing lifetime acceleration experiments. He also did ESD testing, platform level validation, yield and excursion management. Then he moved on to position a where he qualified Intel designed IPs for EMSH, EOS, Aging, ESD, LU, C4-Imax and SER for Intel’s foundry customers, internal and external. Part of his job is also to automate the review process and make it LEAN. \n \nHe has also done a short-term assignment in OVM verification, where he did simulations, regression testing and debugging. While in school, he did an Internship as a Firmware Engineer at a Bio-medical company, Applied Microarrays Inc. When he was in India, he worked for about a year as an Embedded Systems engineer. \n \nAmeya has a BE in Electronics Engineering from Maharaja Sayajirao University in India; and a MS EE (specialization: VLSI and Mixed-Signal Circuit Design) from Arizona State University in USA. Currently he is pursuing a MBA from Kelley School of Business (Indiana University). \n Experience Pre Si Quality and Reliability Engineer Intel Corporation January 2014  – Present (1 year 8 months) Hillsboro, Oregon • Definition & delivery of Quality and Reliability (Q&R) methodology and requirements for IPs on Intel’s leading edge semiconductor process (22nm, 14 nm and beyond) for Intel’s Foundry business \n• Responsible for reviewing and signing off on RV requirements for Aging, EOS, LU, ESD, SER, EM, SH, LTE, HV, OSUS, etc. Analyze and assess miscorrelation and violations, and perform risk assessments \n• Identifying potential methodology, tool and capability gaps. Driving solutions to closure by coordinating the Design, Tool/Flow and Technology Development teams. Collaborating teams in different geographic locations of US and Asia and lead the fulfillment of Q&R requirements for multiple products and IPs. Managing product schedule and deliverables \n• Key accomplishments:  \no Automated the requirements review process and made it LEAN, exponential time savings (up to 60X and more) and resources (~$14K YOY). Recognized at the organization level for Innovation and Risk-Taking \no Innovated and improved Q&R review methodology of Intel’s Foundry products and made it more reliable. Recognized by peers. Time and resource saving of about $5K per year \n Pre-Si Verification Engineer (DOT) Intel Corporation November 2013  –  February 2014  (4 months) • Deep dive analysis of logic functionality of power unit in SoC on Intel’s 14nm technology, using system-verilog and OVM methodology \n• Job included doing simulations, running regressions and individual tests in ACE environment, to identify issues in validation environment and incorporate fixes \n• Prepared and presented status reports to upper management, issues, proposals & risk escalation  \n SoC Product Quality and Reliability Engineer Intel Corporation July 2012  –  January 2014  (1 year 7 months) Chandler, Arizona • Worked directly with customers for issues found during product qualification and coordinated multiple cross-functional teams in US, Europe and Asia in order to drive fixes \n• Investigated and solved fallout issues in high-volume testing. Yield management and root cause analysis for high bin failures due to test vectors, hardware, software, package, design, etc. Coordinated design, test development and manufacturing teams to fix issues \n• Statistical data analysis on the high volume test data to monitor trends and excursions. Wrote automation scripts for data extraction and generation of indicators. Rel monitoring and excursion management for factories and high volume testers \n• Designed and developed hardware and software for Burn-In lifetime acceleration testing. Responsible for the entire life cycle namely spec definition, board design, test vector generation and validation; also supported production Burn-In in factories and CSE (cold-socket elimination) analysis. Developed stress testing programs for system-level stressing on reference platforms. Performed ESD/DPZ and Temperature cycling testing on reference platforms and designs. Collaborated vendors and engineers during hardware development \n• Key accomplishments: \no Root-caused a high yield issue related to early design-phase. This drove a lot of fixes in many stages of product definition and development. Pulled-in the time to market by 2 quarters leading to increased revenue generation and cost efficiency around resources (hardware, software, licenses, people) \no Designed new methodology to ensure high reliability Burn-In experiment hardware in the first attempt. Saved many redesigns, which translated to a lot of time (~1 quarter, for every product) and cost savings \no Developed hardware to enable use IREM (Infrared Emissions) for debug during Burn-In. This helped in some early-findings of major issues  \n Firmware Engineering Intern Applied Microarrays May 2011  –  October 2011  (6 months) • Developed firmware that controlled the hardware for manufacturing custom microarrays using PIC controllers \n• The work involved but was not limited to understanding the board connections and peripherals, understanding the interface to PC, debugging and writing code \n• Key accomplishments: \no Worked independently from start to finish as I was the only person in the company that had Firmware engineering knowledge \no Received recognition from the VP and CEO, since the new development lead to increased efficiency, accuracy and granularity in manufacturing, and possibility of new product offerings \n Embedded Systems Engineer Matrix Comsec Private Ltd. May 2009  –  April 2010  (1 year) Responsible for PCB Design, board bring up and Characterization of video surveillance products. \nAssembly language programming using Embedded-C. Faculty Representative (F.R.) Maharaja Sayajirao University, Vadodara August 2008  –  May 2009  (10 months) Elected with wide majority as the representative of the students of the Engineering school at the University level and became a part of the student-governing body of the University’s Union. Organized and coordinated several Annual and cultural events and of the University that were organized at the State and National level. Pre Si Quality and Reliability Engineer Intel Corporation January 2014  – Present (1 year 8 months) Hillsboro, Oregon • Definition & delivery of Quality and Reliability (Q&R) methodology and requirements for IPs on Intel’s leading edge semiconductor process (22nm, 14 nm and beyond) for Intel’s Foundry business \n• Responsible for reviewing and signing off on RV requirements for Aging, EOS, LU, ESD, SER, EM, SH, LTE, HV, OSUS, etc. Analyze and assess miscorrelation and violations, and perform risk assessments \n• Identifying potential methodology, tool and capability gaps. Driving solutions to closure by coordinating the Design, Tool/Flow and Technology Development teams. Collaborating teams in different geographic locations of US and Asia and lead the fulfillment of Q&R requirements for multiple products and IPs. Managing product schedule and deliverables \n• Key accomplishments:  \no Automated the requirements review process and made it LEAN, exponential time savings (up to 60X and more) and resources (~$14K YOY). Recognized at the organization level for Innovation and Risk-Taking \no Innovated and improved Q&R review methodology of Intel’s Foundry products and made it more reliable. Recognized by peers. Time and resource saving of about $5K per year \n Pre Si Quality and Reliability Engineer Intel Corporation January 2014  – Present (1 year 8 months) Hillsboro, Oregon • Definition & delivery of Quality and Reliability (Q&R) methodology and requirements for IPs on Intel’s leading edge semiconductor process (22nm, 14 nm and beyond) for Intel’s Foundry business \n• Responsible for reviewing and signing off on RV requirements for Aging, EOS, LU, ESD, SER, EM, SH, LTE, HV, OSUS, etc. Analyze and assess miscorrelation and violations, and perform risk assessments \n• Identifying potential methodology, tool and capability gaps. Driving solutions to closure by coordinating the Design, Tool/Flow and Technology Development teams. Collaborating teams in different geographic locations of US and Asia and lead the fulfillment of Q&R requirements for multiple products and IPs. Managing product schedule and deliverables \n• Key accomplishments:  \no Automated the requirements review process and made it LEAN, exponential time savings (up to 60X and more) and resources (~$14K YOY). Recognized at the organization level for Innovation and Risk-Taking \no Innovated and improved Q&R review methodology of Intel’s Foundry products and made it more reliable. Recognized by peers. Time and resource saving of about $5K per year \n Pre-Si Verification Engineer (DOT) Intel Corporation November 2013  –  February 2014  (4 months) • Deep dive analysis of logic functionality of power unit in SoC on Intel’s 14nm technology, using system-verilog and OVM methodology \n• Job included doing simulations, running regressions and individual tests in ACE environment, to identify issues in validation environment and incorporate fixes \n• Prepared and presented status reports to upper management, issues, proposals & risk escalation  \n Pre-Si Verification Engineer (DOT) Intel Corporation November 2013  –  February 2014  (4 months) • Deep dive analysis of logic functionality of power unit in SoC on Intel’s 14nm technology, using system-verilog and OVM methodology \n• Job included doing simulations, running regressions and individual tests in ACE environment, to identify issues in validation environment and incorporate fixes \n• Prepared and presented status reports to upper management, issues, proposals & risk escalation  \n SoC Product Quality and Reliability Engineer Intel Corporation July 2012  –  January 2014  (1 year 7 months) Chandler, Arizona • Worked directly with customers for issues found during product qualification and coordinated multiple cross-functional teams in US, Europe and Asia in order to drive fixes \n• Investigated and solved fallout issues in high-volume testing. Yield management and root cause analysis for high bin failures due to test vectors, hardware, software, package, design, etc. Coordinated design, test development and manufacturing teams to fix issues \n• Statistical data analysis on the high volume test data to monitor trends and excursions. Wrote automation scripts for data extraction and generation of indicators. Rel monitoring and excursion management for factories and high volume testers \n• Designed and developed hardware and software for Burn-In lifetime acceleration testing. Responsible for the entire life cycle namely spec definition, board design, test vector generation and validation; also supported production Burn-In in factories and CSE (cold-socket elimination) analysis. Developed stress testing programs for system-level stressing on reference platforms. Performed ESD/DPZ and Temperature cycling testing on reference platforms and designs. Collaborated vendors and engineers during hardware development \n• Key accomplishments: \no Root-caused a high yield issue related to early design-phase. This drove a lot of fixes in many stages of product definition and development. Pulled-in the time to market by 2 quarters leading to increased revenue generation and cost efficiency around resources (hardware, software, licenses, people) \no Designed new methodology to ensure high reliability Burn-In experiment hardware in the first attempt. Saved many redesigns, which translated to a lot of time (~1 quarter, for every product) and cost savings \no Developed hardware to enable use IREM (Infrared Emissions) for debug during Burn-In. This helped in some early-findings of major issues  \n SoC Product Quality and Reliability Engineer Intel Corporation July 2012  –  January 2014  (1 year 7 months) Chandler, Arizona • Worked directly with customers for issues found during product qualification and coordinated multiple cross-functional teams in US, Europe and Asia in order to drive fixes \n• Investigated and solved fallout issues in high-volume testing. Yield management and root cause analysis for high bin failures due to test vectors, hardware, software, package, design, etc. Coordinated design, test development and manufacturing teams to fix issues \n• Statistical data analysis on the high volume test data to monitor trends and excursions. Wrote automation scripts for data extraction and generation of indicators. Rel monitoring and excursion management for factories and high volume testers \n• Designed and developed hardware and software for Burn-In lifetime acceleration testing. Responsible for the entire life cycle namely spec definition, board design, test vector generation and validation; also supported production Burn-In in factories and CSE (cold-socket elimination) analysis. Developed stress testing programs for system-level stressing on reference platforms. Performed ESD/DPZ and Temperature cycling testing on reference platforms and designs. Collaborated vendors and engineers during hardware development \n• Key accomplishments: \no Root-caused a high yield issue related to early design-phase. This drove a lot of fixes in many stages of product definition and development. Pulled-in the time to market by 2 quarters leading to increased revenue generation and cost efficiency around resources (hardware, software, licenses, people) \no Designed new methodology to ensure high reliability Burn-In experiment hardware in the first attempt. Saved many redesigns, which translated to a lot of time (~1 quarter, for every product) and cost savings \no Developed hardware to enable use IREM (Infrared Emissions) for debug during Burn-In. This helped in some early-findings of major issues  \n Firmware Engineering Intern Applied Microarrays May 2011  –  October 2011  (6 months) • Developed firmware that controlled the hardware for manufacturing custom microarrays using PIC controllers \n• The work involved but was not limited to understanding the board connections and peripherals, understanding the interface to PC, debugging and writing code \n• Key accomplishments: \no Worked independently from start to finish as I was the only person in the company that had Firmware engineering knowledge \no Received recognition from the VP and CEO, since the new development lead to increased efficiency, accuracy and granularity in manufacturing, and possibility of new product offerings \n Firmware Engineering Intern Applied Microarrays May 2011  –  October 2011  (6 months) • Developed firmware that controlled the hardware for manufacturing custom microarrays using PIC controllers \n• The work involved but was not limited to understanding the board connections and peripherals, understanding the interface to PC, debugging and writing code \n• Key accomplishments: \no Worked independently from start to finish as I was the only person in the company that had Firmware engineering knowledge \no Received recognition from the VP and CEO, since the new development lead to increased efficiency, accuracy and granularity in manufacturing, and possibility of new product offerings \n Embedded Systems Engineer Matrix Comsec Private Ltd. May 2009  –  April 2010  (1 year) Responsible for PCB Design, board bring up and Characterization of video surveillance products. \nAssembly language programming using Embedded-C. Embedded Systems Engineer Matrix Comsec Private Ltd. May 2009  –  April 2010  (1 year) Responsible for PCB Design, board bring up and Characterization of video surveillance products. \nAssembly language programming using Embedded-C. Faculty Representative (F.R.) Maharaja Sayajirao University, Vadodara August 2008  –  May 2009  (10 months) Elected with wide majority as the representative of the students of the Engineering school at the University level and became a part of the student-governing body of the University’s Union. Organized and coordinated several Annual and cultural events and of the University that were organized at the State and National level. Faculty Representative (F.R.) Maharaja Sayajirao University, Vadodara August 2008  –  May 2009  (10 months) Elected with wide majority as the representative of the students of the Engineering school at the University level and became a part of the student-governing body of the University’s Union. Organized and coordinated several Annual and cultural events and of the University that were organized at the State and National level. Languages English Hindi Gujarati Marathi English Hindi Gujarati Marathi English Hindi Gujarati Marathi Skills Cadence Virtuoso Monte Carlo Simulation SPICE Circuit Design Analog Circuit Design Electronic Circuit... Digital Design Circuit Analysis Circuit Simulation Static Timing Analysis Logic Design Virtuoso Layout Editor Filter Design Assembly C C++ Verilog System Verification FPGA Functional Verification Hardware Verification Formal Verification Spectre CMOS Hardware Design Analog Hardware Simulations Integrated Circuit... See 14+     See less Skills  Cadence Virtuoso Monte Carlo Simulation SPICE Circuit Design Analog Circuit Design Electronic Circuit... Digital Design Circuit Analysis Circuit Simulation Static Timing Analysis Logic Design Virtuoso Layout Editor Filter Design Assembly C C++ Verilog System Verification FPGA Functional Verification Hardware Verification Formal Verification Spectre CMOS Hardware Design Analog Hardware Simulations Integrated Circuit... See 14+     See less Cadence Virtuoso Monte Carlo Simulation SPICE Circuit Design Analog Circuit Design Electronic Circuit... Digital Design Circuit Analysis Circuit Simulation Static Timing Analysis Logic Design Virtuoso Layout Editor Filter Design Assembly C C++ Verilog System Verification FPGA Functional Verification Hardware Verification Formal Verification Spectre CMOS Hardware Design Analog Hardware Simulations Integrated Circuit... See 14+     See less Cadence Virtuoso Monte Carlo Simulation SPICE Circuit Design Analog Circuit Design Electronic Circuit... Digital Design Circuit Analysis Circuit Simulation Static Timing Analysis Logic Design Virtuoso Layout Editor Filter Design Assembly C C++ Verilog System Verification FPGA Functional Verification Hardware Verification Formal Verification Spectre CMOS Hardware Design Analog Hardware Simulations Integrated Circuit... See 14+     See less Education Maharaja Sayajirao University (Baroda) Bachelors of Engineering,  Electronics Engineering 2006  – 2010 Cum GPA : 3.86/4.0 \nAmongst the top 5% students of the Electrical Engineering Department. \n \n Activities and Societies:  Faculty Representative (Faculty of Technology and Engineering ,  Maharaja Sayajirao University) ,  Maharaja Sayajirao University Union. Arizona State University MSE,  Electrical Engineering Cum GPA: 3.56/4.0 \n \nCOURSEWORK: Digital Signal Processing, Analog Integrated Circuits, Advanced Analog Integrated Circuits, Analog to Digital Converters, Switch Capacitor Analog design, VLSI Design, Advance VLSI Design, Advanced Hardware System Design, Design of Engineering Experiments. \n \nPROJECT'S: Switched Capacitor Filter Design, 4 entry micro-TLB and cache, 8KB SRAM with Layout, Multibit/stage Pipeline ADC, 16-bit SIPO and PISO with LIFO memory, 4-way Traffic Light Controller (FPGA Design) Activities and Societies:  Graduate Student\nSpecialization: Electronic and mixed-signal circuit design Indiana University Bloomington Master of Business Administration (M.B.A.),  Business Administration , Management and Operations Cum GPA: 4.0/4.0 \n \nGMAT: 710 \nReceived Academic Scholarship from University. \n \nPROJECTS (upto now): \n1. Worked with a manager of a local Veterinary Hospital in Indiana, and prepared a marketing/consulting plan for the clinic to increase profitability and market share. Maharaja Sayajirao University (Baroda) Bachelors of Engineering,  Electronics Engineering 2006  – 2010 Cum GPA : 3.86/4.0 \nAmongst the top 5% students of the Electrical Engineering Department. \n \n Activities and Societies:  Faculty Representative (Faculty of Technology and Engineering ,  Maharaja Sayajirao University) ,  Maharaja Sayajirao University Union. Maharaja Sayajirao University (Baroda) Bachelors of Engineering,  Electronics Engineering 2006  – 2010 Cum GPA : 3.86/4.0 \nAmongst the top 5% students of the Electrical Engineering Department. \n \n Activities and Societies:  Faculty Representative (Faculty of Technology and Engineering ,  Maharaja Sayajirao University) ,  Maharaja Sayajirao University Union. Maharaja Sayajirao University (Baroda) Bachelors of Engineering,  Electronics Engineering 2006  – 2010 Cum GPA : 3.86/4.0 \nAmongst the top 5% students of the Electrical Engineering Department. \n \n Activities and Societies:  Faculty Representative (Faculty of Technology and Engineering ,  Maharaja Sayajirao University) ,  Maharaja Sayajirao University Union. Arizona State University MSE,  Electrical Engineering Cum GPA: 3.56/4.0 \n \nCOURSEWORK: Digital Signal Processing, Analog Integrated Circuits, Advanced Analog Integrated Circuits, Analog to Digital Converters, Switch Capacitor Analog design, VLSI Design, Advance VLSI Design, Advanced Hardware System Design, Design of Engineering Experiments. \n \nPROJECT'S: Switched Capacitor Filter Design, 4 entry micro-TLB and cache, 8KB SRAM with Layout, Multibit/stage Pipeline ADC, 16-bit SIPO and PISO with LIFO memory, 4-way Traffic Light Controller (FPGA Design) Activities and Societies:  Graduate Student\nSpecialization: Electronic and mixed-signal circuit design Arizona State University MSE,  Electrical Engineering Cum GPA: 3.56/4.0 \n \nCOURSEWORK: Digital Signal Processing, Analog Integrated Circuits, Advanced Analog Integrated Circuits, Analog to Digital Converters, Switch Capacitor Analog design, VLSI Design, Advance VLSI Design, Advanced Hardware System Design, Design of Engineering Experiments. \n \nPROJECT'S: Switched Capacitor Filter Design, 4 entry micro-TLB and cache, 8KB SRAM with Layout, Multibit/stage Pipeline ADC, 16-bit SIPO and PISO with LIFO memory, 4-way Traffic Light Controller (FPGA Design) Activities and Societies:  Graduate Student\nSpecialization: Electronic and mixed-signal circuit design Arizona State University MSE,  Electrical Engineering Cum GPA: 3.56/4.0 \n \nCOURSEWORK: Digital Signal Processing, Analog Integrated Circuits, Advanced Analog Integrated Circuits, Analog to Digital Converters, Switch Capacitor Analog design, VLSI Design, Advance VLSI Design, Advanced Hardware System Design, Design of Engineering Experiments. \n \nPROJECT'S: Switched Capacitor Filter Design, 4 entry micro-TLB and cache, 8KB SRAM with Layout, Multibit/stage Pipeline ADC, 16-bit SIPO and PISO with LIFO memory, 4-way Traffic Light Controller (FPGA Design) Activities and Societies:  Graduate Student\nSpecialization: Electronic and mixed-signal circuit design Indiana University Bloomington Master of Business Administration (M.B.A.),  Business Administration , Management and Operations Cum GPA: 4.0/4.0 \n \nGMAT: 710 \nReceived Academic Scholarship from University. \n \nPROJECTS (upto now): \n1. Worked with a manager of a local Veterinary Hospital in Indiana, and prepared a marketing/consulting plan for the clinic to increase profitability and market share. Indiana University Bloomington Master of Business Administration (M.B.A.),  Business Administration , Management and Operations Cum GPA: 4.0/4.0 \n \nGMAT: 710 \nReceived Academic Scholarship from University. \n \nPROJECTS (upto now): \n1. Worked with a manager of a local Veterinary Hospital in Indiana, and prepared a marketing/consulting plan for the clinic to increase profitability and market share. Indiana University Bloomington Master of Business Administration (M.B.A.),  Business Administration , Management and Operations Cum GPA: 4.0/4.0 \n \nGMAT: 710 \nReceived Academic Scholarship from University. \n \nPROJECTS (upto now): \n1. Worked with a manager of a local Veterinary Hospital in Indiana, and prepared a marketing/consulting plan for the clinic to increase profitability and market share. Honors & Awards Additional Honors & Awards - Stood 4th in the Gujarat State Merit list in the 12th Grade examinations (H.S.C). Also, stood 8th in Vadodara city for overall marks in the same examination. \n \n- Was elected as the Faculty Representative of the Faculty of Technology and Engineering for the academic year 2008-09. Was also a member of the M.S. University Union at the same time. Additional Honors & Awards - Stood 4th in the Gujarat State Merit list in the 12th Grade examinations (H.S.C). Also, stood 8th in Vadodara city for overall marks in the same examination. \n \n- Was elected as the Faculty Representative of the Faculty of Technology and Engineering for the academic year 2008-09. Was also a member of the M.S. University Union at the same time. Additional Honors & Awards - Stood 4th in the Gujarat State Merit list in the 12th Grade examinations (H.S.C). Also, stood 8th in Vadodara city for overall marks in the same examination. \n \n- Was elected as the Faculty Representative of the Faculty of Technology and Engineering for the academic year 2008-09. Was also a member of the M.S. University Union at the same time. Additional Honors & Awards - Stood 4th in the Gujarat State Merit list in the 12th Grade examinations (H.S.C). Also, stood 8th in Vadodara city for overall marks in the same examination. \n \n- Was elected as the Faculty Representative of the Faculty of Technology and Engineering for the academic year 2008-09. Was also a member of the M.S. University Union at the same time. ", "Skills Materials Science Semiconductor... Semiconductors SPC Statistics Design of Experiments XRD Thin Films Powder X-ray Diffraction JMP Process Control Ferroelectrics Ceramic Processing SEM Dielectrics Piezoelectric PVD Reliability Failure Analysis Characterization Silicon AFM Engineering Management Semiconductor Industry Manufacturing Quality Auditing Process Engineering See 12+     See less Skills  Materials Science Semiconductor... Semiconductors SPC Statistics Design of Experiments XRD Thin Films Powder X-ray Diffraction JMP Process Control Ferroelectrics Ceramic Processing SEM Dielectrics Piezoelectric PVD Reliability Failure Analysis Characterization Silicon AFM Engineering Management Semiconductor Industry Manufacturing Quality Auditing Process Engineering See 12+     See less Materials Science Semiconductor... Semiconductors SPC Statistics Design of Experiments XRD Thin Films Powder X-ray Diffraction JMP Process Control Ferroelectrics Ceramic Processing SEM Dielectrics Piezoelectric PVD Reliability Failure Analysis Characterization Silicon AFM Engineering Management Semiconductor Industry Manufacturing Quality Auditing Process Engineering See 12+     See less Materials Science Semiconductor... Semiconductors SPC Statistics Design of Experiments XRD Thin Films Powder X-ray Diffraction JMP Process Control Ferroelectrics Ceramic Processing SEM Dielectrics Piezoelectric PVD Reliability Failure Analysis Characterization Silicon AFM Engineering Management Semiconductor Industry Manufacturing Quality Auditing Process Engineering See 12+     See less ", "Skills Product Engineering Semiconductors Debugging Test Equipment DFT Engineering CMOS Quality Control Test Engineering Failure Analysis SoC Analog Hardware Architecture Electronics Product Development Reliability Silicon IC VLSI Intel Circuit Design JMP See 7+     See less Skills  Product Engineering Semiconductors Debugging Test Equipment DFT Engineering CMOS Quality Control Test Engineering Failure Analysis SoC Analog Hardware Architecture Electronics Product Development Reliability Silicon IC VLSI Intel Circuit Design JMP See 7+     See less Product Engineering Semiconductors Debugging Test Equipment DFT Engineering CMOS Quality Control Test Engineering Failure Analysis SoC Analog Hardware Architecture Electronics Product Development Reliability Silicon IC VLSI Intel Circuit Design JMP See 7+     See less Product Engineering Semiconductors Debugging Test Equipment DFT Engineering CMOS Quality Control Test Engineering Failure Analysis SoC Analog Hardware Architecture Electronics Product Development Reliability Silicon IC VLSI Intel Circuit Design JMP See 7+     See less "]}