{"position": "Research Scientist", "company": "Intel Corporation", "profiles": ["Languages Tagalog Tagalog Tagalog Skills Healthcare Research Psychological Assessment Brain Health Assessment... Learning assessment and... Wellness Coaching Psychotherapy Health Psychology Clinical Psychology Industrial/Organizationa... Skills  Healthcare Research Psychological Assessment Brain Health Assessment... Learning assessment and... Wellness Coaching Psychotherapy Health Psychology Clinical Psychology Industrial/Organizationa... Healthcare Research Psychological Assessment Brain Health Assessment... Learning assessment and... Wellness Coaching Psychotherapy Health Psychology Clinical Psychology Industrial/Organizationa... Healthcare Research Psychological Assessment Brain Health Assessment... Learning assessment and... Wellness Coaching Psychotherapy Health Psychology Clinical Psychology Industrial/Organizationa... ", "Summary I am broadly interested in the design, modeling, and performance analysis of wireless architectures and technologies that enable future high rate applications. Recently, we proposed models to design and analyze (r)evolutionary architectures like self-backhauled millimeter wave wireless cellular networks and decoupled uplink/downlink access in HetNets. In past, I studied techniques and algorithms to leverage the true capacity potential of heterogeneous wireless networks (LTE, GSM, WiFi, macrocells, smallcells) by smartly steering traffic across them. See publications section for more details on these activities. \n \nBrief Bio: Sarabjot Singh is a Research Scientist at Intel Corporation, Santa Clara, CA. He received the Bachelor of Technology in Electronics and Communication Engineering from Indian Institute of Technology Guwahati, India, in 2010 and was awarded the President of India Gold Medal for scoring the highest GPA among all the graduating students of IITG. He received the M.S.E in 2012 and Ph.D. in 2014 both from The University of Texas at Austin in Electrical Engineering, where his research focused on the modeling, analysis, and design of load balancing in wireless heterogeneous networks. His other research interests include RF-localization in indoor networks, scheduling for video streaming in LTE-Advanced, and interference coordination in wireless networks. His paper on multi-RAT offloading received the best paper award at IEEE ICC 2013. He has held industrial internships at Alcatel-Lucent Bell Labs in Crawford Hill, NJ; Intel Corp. in Santa Clara, CA; and Qualcomm Inc. in San Diego, CA. Summary I am broadly interested in the design, modeling, and performance analysis of wireless architectures and technologies that enable future high rate applications. Recently, we proposed models to design and analyze (r)evolutionary architectures like self-backhauled millimeter wave wireless cellular networks and decoupled uplink/downlink access in HetNets. In past, I studied techniques and algorithms to leverage the true capacity potential of heterogeneous wireless networks (LTE, GSM, WiFi, macrocells, smallcells) by smartly steering traffic across them. See publications section for more details on these activities. \n \nBrief Bio: Sarabjot Singh is a Research Scientist at Intel Corporation, Santa Clara, CA. He received the Bachelor of Technology in Electronics and Communication Engineering from Indian Institute of Technology Guwahati, India, in 2010 and was awarded the President of India Gold Medal for scoring the highest GPA among all the graduating students of IITG. He received the M.S.E in 2012 and Ph.D. in 2014 both from The University of Texas at Austin in Electrical Engineering, where his research focused on the modeling, analysis, and design of load balancing in wireless heterogeneous networks. His other research interests include RF-localization in indoor networks, scheduling for video streaming in LTE-Advanced, and interference coordination in wireless networks. His paper on multi-RAT offloading received the best paper award at IEEE ICC 2013. He has held industrial internships at Alcatel-Lucent Bell Labs in Crawford Hill, NJ; Intel Corp. in Santa Clara, CA; and Qualcomm Inc. in San Diego, CA. I am broadly interested in the design, modeling, and performance analysis of wireless architectures and technologies that enable future high rate applications. Recently, we proposed models to design and analyze (r)evolutionary architectures like self-backhauled millimeter wave wireless cellular networks and decoupled uplink/downlink access in HetNets. In past, I studied techniques and algorithms to leverage the true capacity potential of heterogeneous wireless networks (LTE, GSM, WiFi, macrocells, smallcells) by smartly steering traffic across them. See publications section for more details on these activities. \n \nBrief Bio: Sarabjot Singh is a Research Scientist at Intel Corporation, Santa Clara, CA. He received the Bachelor of Technology in Electronics and Communication Engineering from Indian Institute of Technology Guwahati, India, in 2010 and was awarded the President of India Gold Medal for scoring the highest GPA among all the graduating students of IITG. He received the M.S.E in 2012 and Ph.D. in 2014 both from The University of Texas at Austin in Electrical Engineering, where his research focused on the modeling, analysis, and design of load balancing in wireless heterogeneous networks. His other research interests include RF-localization in indoor networks, scheduling for video streaming in LTE-Advanced, and interference coordination in wireless networks. His paper on multi-RAT offloading received the best paper award at IEEE ICC 2013. He has held industrial internships at Alcatel-Lucent Bell Labs in Crawford Hill, NJ; Intel Corp. in Santa Clara, CA; and Qualcomm Inc. in San Diego, CA. I am broadly interested in the design, modeling, and performance analysis of wireless architectures and technologies that enable future high rate applications. Recently, we proposed models to design and analyze (r)evolutionary architectures like self-backhauled millimeter wave wireless cellular networks and decoupled uplink/downlink access in HetNets. In past, I studied techniques and algorithms to leverage the true capacity potential of heterogeneous wireless networks (LTE, GSM, WiFi, macrocells, smallcells) by smartly steering traffic across them. See publications section for more details on these activities. \n \nBrief Bio: Sarabjot Singh is a Research Scientist at Intel Corporation, Santa Clara, CA. He received the Bachelor of Technology in Electronics and Communication Engineering from Indian Institute of Technology Guwahati, India, in 2010 and was awarded the President of India Gold Medal for scoring the highest GPA among all the graduating students of IITG. He received the M.S.E in 2012 and Ph.D. in 2014 both from The University of Texas at Austin in Electrical Engineering, where his research focused on the modeling, analysis, and design of load balancing in wireless heterogeneous networks. His other research interests include RF-localization in indoor networks, scheduling for video streaming in LTE-Advanced, and interference coordination in wireless networks. His paper on multi-RAT offloading received the best paper award at IEEE ICC 2013. He has held industrial internships at Alcatel-Lucent Bell Labs in Crawford Hill, NJ; Intel Corp. in Santa Clara, CA; and Qualcomm Inc. in San Diego, CA. Experience Research Scientist Intel Corporation May 2015  – Present (4 months) San Francisco Bay Area Research on \"5G\". Senior Researcher Nokia Technologies January 2015  –  May 2015  (5 months) Berkeley, CA Research and standardization of next generation wireless technologies. \n- Optimization of clear channel assessment (CCA) threshold for IEEE 802.11 ax.  \n- Scheduling algorithms for wireless ad-hoc networks.  \n- Framework for enabling OFDMA in IEEE 802.11 ax. \n Graduate Student University of Texas at Austin January 2011  –  December 2014  (4 years) Austin, Texas Area Modeling and performance analysis of 5G and 4G wireless heterogeneous networks. \n- Millimeter wave wireless networks for access and backhaul. \n- Load balancing in HetNets. \n- Uplink-downlink decoupled association in HetNets. Research Intern Bell Laboratories May 2013  –  August 2013  (4 months) Holmdel, NJ Proposed and analyzed algorithms for high precision  \n(sub-meter) RF localization in indoor environments. Graduate Technical Intern Intel Corporation June 2011  –  December 2011  (7 months) Developed quality of experience aware radio resource management strategies for optimized video delivery in LTE networks. Graduate Teaching Assistant University of Texas at Austin August 2010  –  December 2010  (5 months) Developed and graded homework, and held tutorial sessions for the undergraduate electrical engineering linear signals and systems. Interim Engineering Intern Qualcomm 2009  –  2009  (less than a year) Investigate the impact of downlink-uplink imbalance on TCP in HSDPA. Study the interplay of different system level parameters and improve TCP's performance by dynamic tuning of the same. Research Intern Indian Institute of Science 2008  –  2009  (1 year) Modeling and analysis of uplink interference in shadowed wireless systems particularly CDMA. Intern National Physical Laboratory 2007  –  2007  (less than a year) Algorithms for filtering ECG recordings Research Scientist Intel Corporation May 2015  – Present (4 months) San Francisco Bay Area Research on \"5G\". Research Scientist Intel Corporation May 2015  – Present (4 months) San Francisco Bay Area Research on \"5G\". Senior Researcher Nokia Technologies January 2015  –  May 2015  (5 months) Berkeley, CA Research and standardization of next generation wireless technologies. \n- Optimization of clear channel assessment (CCA) threshold for IEEE 802.11 ax.  \n- Scheduling algorithms for wireless ad-hoc networks.  \n- Framework for enabling OFDMA in IEEE 802.11 ax. \n Senior Researcher Nokia Technologies January 2015  –  May 2015  (5 months) Berkeley, CA Research and standardization of next generation wireless technologies. \n- Optimization of clear channel assessment (CCA) threshold for IEEE 802.11 ax.  \n- Scheduling algorithms for wireless ad-hoc networks.  \n- Framework for enabling OFDMA in IEEE 802.11 ax. \n Graduate Student University of Texas at Austin January 2011  –  December 2014  (4 years) Austin, Texas Area Modeling and performance analysis of 5G and 4G wireless heterogeneous networks. \n- Millimeter wave wireless networks for access and backhaul. \n- Load balancing in HetNets. \n- Uplink-downlink decoupled association in HetNets. Graduate Student University of Texas at Austin January 2011  –  December 2014  (4 years) Austin, Texas Area Modeling and performance analysis of 5G and 4G wireless heterogeneous networks. \n- Millimeter wave wireless networks for access and backhaul. \n- Load balancing in HetNets. \n- Uplink-downlink decoupled association in HetNets. Research Intern Bell Laboratories May 2013  –  August 2013  (4 months) Holmdel, NJ Proposed and analyzed algorithms for high precision  \n(sub-meter) RF localization in indoor environments. Research Intern Bell Laboratories May 2013  –  August 2013  (4 months) Holmdel, NJ Proposed and analyzed algorithms for high precision  \n(sub-meter) RF localization in indoor environments. Graduate Technical Intern Intel Corporation June 2011  –  December 2011  (7 months) Developed quality of experience aware radio resource management strategies for optimized video delivery in LTE networks. Graduate Technical Intern Intel Corporation June 2011  –  December 2011  (7 months) Developed quality of experience aware radio resource management strategies for optimized video delivery in LTE networks. Graduate Teaching Assistant University of Texas at Austin August 2010  –  December 2010  (5 months) Developed and graded homework, and held tutorial sessions for the undergraduate electrical engineering linear signals and systems. Graduate Teaching Assistant University of Texas at Austin August 2010  –  December 2010  (5 months) Developed and graded homework, and held tutorial sessions for the undergraduate electrical engineering linear signals and systems. Interim Engineering Intern Qualcomm 2009  –  2009  (less than a year) Investigate the impact of downlink-uplink imbalance on TCP in HSDPA. Study the interplay of different system level parameters and improve TCP's performance by dynamic tuning of the same. Interim Engineering Intern Qualcomm 2009  –  2009  (less than a year) Investigate the impact of downlink-uplink imbalance on TCP in HSDPA. Study the interplay of different system level parameters and improve TCP's performance by dynamic tuning of the same. Research Intern Indian Institute of Science 2008  –  2009  (1 year) Modeling and analysis of uplink interference in shadowed wireless systems particularly CDMA. Research Intern Indian Institute of Science 2008  –  2009  (1 year) Modeling and analysis of uplink interference in shadowed wireless systems particularly CDMA. Intern National Physical Laboratory 2007  –  2007  (less than a year) Algorithms for filtering ECG recordings Intern National Physical Laboratory 2007  –  2007  (less than a year) Algorithms for filtering ECG recordings Languages Punjabi English Hindi Punjabi English Hindi Punjabi English Hindi Skills LTE Wireless Matlab LaTeX Signal Processing Algorithms C Machine Learning Digital Signal... Systems Engineering C++ Optimization QoS Embedded Systems Simulations FPGA Verilog RF WiFi Radio Planning Image Processing Simulink Digital Signal... Wireless Networking Perl Wireless System... QoE Radio Resource... Wireless Communications... Mathematica OFDM CDMA IEEE 802.11 See 18+     See less Skills  LTE Wireless Matlab LaTeX Signal Processing Algorithms C Machine Learning Digital Signal... Systems Engineering C++ Optimization QoS Embedded Systems Simulations FPGA Verilog RF WiFi Radio Planning Image Processing Simulink Digital Signal... Wireless Networking Perl Wireless System... QoE Radio Resource... Wireless Communications... Mathematica OFDM CDMA IEEE 802.11 See 18+     See less LTE Wireless Matlab LaTeX Signal Processing Algorithms C Machine Learning Digital Signal... Systems Engineering C++ Optimization QoS Embedded Systems Simulations FPGA Verilog RF WiFi Radio Planning Image Processing Simulink Digital Signal... Wireless Networking Perl Wireless System... QoE Radio Resource... Wireless Communications... Mathematica OFDM CDMA IEEE 802.11 See 18+     See less LTE Wireless Matlab LaTeX Signal Processing Algorithms C Machine Learning Digital Signal... Systems Engineering C++ Optimization QoS Embedded Systems Simulations FPGA Verilog RF WiFi Radio Planning Image Processing Simulink Digital Signal... Wireless Networking Perl Wireless System... QoE Radio Resource... Wireless Communications... Mathematica OFDM CDMA IEEE 802.11 See 18+     See less Education The University of Texas at Austin Doctor of Philosophy (PhD),  Electrical Engineering 2010  – 2014 The University of Texas at Austin Master of Science (MS),  Electrical Engineering 2010  – 2012 Indian Institute of Technology, Guwahati B.Tech,  Electronics and Communication Engineering 2006  – 2010 Electronics and Communication Engineering The University of Texas at Austin Doctor of Philosophy (PhD),  Electrical Engineering 2010  – 2014 The University of Texas at Austin Doctor of Philosophy (PhD),  Electrical Engineering 2010  – 2014 The University of Texas at Austin Doctor of Philosophy (PhD),  Electrical Engineering 2010  – 2014 The University of Texas at Austin Master of Science (MS),  Electrical Engineering 2010  – 2012 The University of Texas at Austin Master of Science (MS),  Electrical Engineering 2010  – 2012 The University of Texas at Austin Master of Science (MS),  Electrical Engineering 2010  – 2012 Indian Institute of Technology, Guwahati B.Tech,  Electronics and Communication Engineering 2006  – 2010 Electronics and Communication Engineering Indian Institute of Technology, Guwahati B.Tech,  Electronics and Communication Engineering 2006  – 2010 Electronics and Communication Engineering Indian Institute of Technology, Guwahati B.Tech,  Electronics and Communication Engineering 2006  – 2010 Electronics and Communication Engineering Honors & Awards Additional Honors & Awards Best Paper Award, IEEE International Conference on Communications 2013 \nPresident of India Gold Medalist, IIT Guwahati 2010 Additional Honors & Awards Best Paper Award, IEEE International Conference on Communications 2013 \nPresident of India Gold Medalist, IIT Guwahati 2010 Additional Honors & Awards Best Paper Award, IEEE International Conference on Communications 2013 \nPresident of India Gold Medalist, IIT Guwahati 2010 Additional Honors & Awards Best Paper Award, IEEE International Conference on Communications 2013 \nPresident of India Gold Medalist, IIT Guwahati 2010 ", "Experience Senior Research Scientist Intel Corporation April 2014  – Present (1 year 5 months) Santa Clara Sensors and Systems Research Lab, Intel Labs \n \nTeam lead in research and development projects involving sensors, sensor back-end & sensing systems and actuators. \n \n• Focusing on optical sensors for environmental sensing. Investigating miniaturization feasibility of the sensing concepts for wearable and portable form factor devices\t \n \n• Defining technology limits for miniaturization with prototyping as well as developing trade off analysis between performance, size, cost, and power with experimental characterization in conjunction with numerical modeling. \n \n• Hands-on work on: \n- Miniature optomechanical design, fabrication and assembly \n- Application of fast turn around traditional as well as novel fabrication methods in proof-of-concept prototype development: Machining, additive fabrication (3D printing, DMLS), sheet metal, injection molding, LDS, conformal and optical coatings, laser cutting \n- Back-end analog circuit design with help of analog engineers, SPICE simulations, and circuit validation measurements (noise, BW) for a high speed, high gain, low noise transimpendance amplifier in photodetector measurements \n- Custom test setup development to characterize environmental sensors and proof-of-concept prototypes (aerosolizing known particulates, delivery and metering of different gasses...etc) \n Senior Research Scientist Intel Corporation April 2013  –  April 2014  (1 year 1 month) Santa Clara Integrated Biosystems Lab, Circuits and Systems Lab, Intel Labs \n \nResponsible for the architecture design and system development of automated microfluidic DNA sequencing platforms to test and validate integrated silicon biosensors \n \n• Worked with electrochemists, biochemists and integrated circuit designers to define requirements of the sequencing platform. Architected, built and then deployed automated assay systems to be used in device validation, biochemistry research and development, electrochemical sensor validation, as well as root causing failures in integrated circuitry, packaging, and tooling.  \n \n• Wrote system controller software to: deliver reagents, run cleaning cycles, control pumps and valves, temperature control of the device, interface with the electrical measurement hardware to conduct sequencing assay electrochemical measurements, and manage recipes for automated runs of different assays. \n \n• Used rapid prototyping techniques such as 3D printing and open source SW/HW platforms to significantly reduce time to data from weeks to days. Designed and deployed a custom embedded temperature controller to set the integrated biosensor temperature during sequencing assays using a thermoelectric device without negatively impacting sensitive electrochemical measurements. \n R&D Test Engineer Intel Corporation September 2007  –  April 2013  (5 years 8 months) Chandler, AZ Sort Test Technology Development, TMG \n \nWorked on numerous aspects of equipment development, taking a concept of a superior thermal management technology from paper study to a manufacturing ready tool for testing Intel’s microprocessor products \n \n• Demonstrated the technical feasibility of a novel, cost effective direct-liquid contact microchannel concept for the thermal management of test modules. Optimized and evolved the microchannel concept for high volume manufacturing environments using CFD.  \n \n• Lead an agile and lean technical hardware team responsible to deploy a manufacturing ready prototype tool in factory to enable direct liquid cooling microchannel technology.  \n \n• Designed the hardware system architecture of the tool, developed fixtures and metrologies for conducting reliability testing of the tool and drove design of experiments for capability characterization.  \n \n• Engaged in commercial and technical discussion with supplier(s): created technical specifications and requirements, engineering CAD models, logic diagrams, SOWs, and came up with should costs based on BOM of the internally developed prototypes for commercial negotiations with the supplier.  \n \n• Hands-on work on: Overall system fluidics and power delivery design, design and development of the communication and automation system interface, mechanical design of hardware, embedded system design and development of system controller (i.e. PID controllers, stepper motor control...), firmware programming, circuit and PCB design, development of an engineering GUI for the control of the tool, data acquisition setups to ensure the tool meets the target criteria\t \n \n• Lead Thermal Working Group in the department (STTD); work group charter: peer review and guidance on the thermal aspects of numerous pathfinding and development projects ranging from TIMs to TECs to dynamic thermal characterization methodologies \n \n Research Assistant Purdue University August 2000  –  September 2007  (7 years 2 months) Cooling Technologies Research Center \n \nResearch and development of piezoelectric fans for thermal management Thermal Analyst Intel Corporation May 2004  –  August 2004  (4 months) Senior Research Scientist Intel Corporation April 2014  – Present (1 year 5 months) Santa Clara Sensors and Systems Research Lab, Intel Labs \n \nTeam lead in research and development projects involving sensors, sensor back-end & sensing systems and actuators. \n \n• Focusing on optical sensors for environmental sensing. Investigating miniaturization feasibility of the sensing concepts for wearable and portable form factor devices\t \n \n• Defining technology limits for miniaturization with prototyping as well as developing trade off analysis between performance, size, cost, and power with experimental characterization in conjunction with numerical modeling. \n \n• Hands-on work on: \n- Miniature optomechanical design, fabrication and assembly \n- Application of fast turn around traditional as well as novel fabrication methods in proof-of-concept prototype development: Machining, additive fabrication (3D printing, DMLS), sheet metal, injection molding, LDS, conformal and optical coatings, laser cutting \n- Back-end analog circuit design with help of analog engineers, SPICE simulations, and circuit validation measurements (noise, BW) for a high speed, high gain, low noise transimpendance amplifier in photodetector measurements \n- Custom test setup development to characterize environmental sensors and proof-of-concept prototypes (aerosolizing known particulates, delivery and metering of different gasses...etc) \n Senior Research Scientist Intel Corporation April 2014  – Present (1 year 5 months) Santa Clara Sensors and Systems Research Lab, Intel Labs \n \nTeam lead in research and development projects involving sensors, sensor back-end & sensing systems and actuators. \n \n• Focusing on optical sensors for environmental sensing. Investigating miniaturization feasibility of the sensing concepts for wearable and portable form factor devices\t \n \n• Defining technology limits for miniaturization with prototyping as well as developing trade off analysis between performance, size, cost, and power with experimental characterization in conjunction with numerical modeling. \n \n• Hands-on work on: \n- Miniature optomechanical design, fabrication and assembly \n- Application of fast turn around traditional as well as novel fabrication methods in proof-of-concept prototype development: Machining, additive fabrication (3D printing, DMLS), sheet metal, injection molding, LDS, conformal and optical coatings, laser cutting \n- Back-end analog circuit design with help of analog engineers, SPICE simulations, and circuit validation measurements (noise, BW) for a high speed, high gain, low noise transimpendance amplifier in photodetector measurements \n- Custom test setup development to characterize environmental sensors and proof-of-concept prototypes (aerosolizing known particulates, delivery and metering of different gasses...etc) \n Senior Research Scientist Intel Corporation April 2013  –  April 2014  (1 year 1 month) Santa Clara Integrated Biosystems Lab, Circuits and Systems Lab, Intel Labs \n \nResponsible for the architecture design and system development of automated microfluidic DNA sequencing platforms to test and validate integrated silicon biosensors \n \n• Worked with electrochemists, biochemists and integrated circuit designers to define requirements of the sequencing platform. Architected, built and then deployed automated assay systems to be used in device validation, biochemistry research and development, electrochemical sensor validation, as well as root causing failures in integrated circuitry, packaging, and tooling.  \n \n• Wrote system controller software to: deliver reagents, run cleaning cycles, control pumps and valves, temperature control of the device, interface with the electrical measurement hardware to conduct sequencing assay electrochemical measurements, and manage recipes for automated runs of different assays. \n \n• Used rapid prototyping techniques such as 3D printing and open source SW/HW platforms to significantly reduce time to data from weeks to days. Designed and deployed a custom embedded temperature controller to set the integrated biosensor temperature during sequencing assays using a thermoelectric device without negatively impacting sensitive electrochemical measurements. \n Senior Research Scientist Intel Corporation April 2013  –  April 2014  (1 year 1 month) Santa Clara Integrated Biosystems Lab, Circuits and Systems Lab, Intel Labs \n \nResponsible for the architecture design and system development of automated microfluidic DNA sequencing platforms to test and validate integrated silicon biosensors \n \n• Worked with electrochemists, biochemists and integrated circuit designers to define requirements of the sequencing platform. Architected, built and then deployed automated assay systems to be used in device validation, biochemistry research and development, electrochemical sensor validation, as well as root causing failures in integrated circuitry, packaging, and tooling.  \n \n• Wrote system controller software to: deliver reagents, run cleaning cycles, control pumps and valves, temperature control of the device, interface with the electrical measurement hardware to conduct sequencing assay electrochemical measurements, and manage recipes for automated runs of different assays. \n \n• Used rapid prototyping techniques such as 3D printing and open source SW/HW platforms to significantly reduce time to data from weeks to days. Designed and deployed a custom embedded temperature controller to set the integrated biosensor temperature during sequencing assays using a thermoelectric device without negatively impacting sensitive electrochemical measurements. \n R&D Test Engineer Intel Corporation September 2007  –  April 2013  (5 years 8 months) Chandler, AZ Sort Test Technology Development, TMG \n \nWorked on numerous aspects of equipment development, taking a concept of a superior thermal management technology from paper study to a manufacturing ready tool for testing Intel’s microprocessor products \n \n• Demonstrated the technical feasibility of a novel, cost effective direct-liquid contact microchannel concept for the thermal management of test modules. Optimized and evolved the microchannel concept for high volume manufacturing environments using CFD.  \n \n• Lead an agile and lean technical hardware team responsible to deploy a manufacturing ready prototype tool in factory to enable direct liquid cooling microchannel technology.  \n \n• Designed the hardware system architecture of the tool, developed fixtures and metrologies for conducting reliability testing of the tool and drove design of experiments for capability characterization.  \n \n• Engaged in commercial and technical discussion with supplier(s): created technical specifications and requirements, engineering CAD models, logic diagrams, SOWs, and came up with should costs based on BOM of the internally developed prototypes for commercial negotiations with the supplier.  \n \n• Hands-on work on: Overall system fluidics and power delivery design, design and development of the communication and automation system interface, mechanical design of hardware, embedded system design and development of system controller (i.e. PID controllers, stepper motor control...), firmware programming, circuit and PCB design, development of an engineering GUI for the control of the tool, data acquisition setups to ensure the tool meets the target criteria\t \n \n• Lead Thermal Working Group in the department (STTD); work group charter: peer review and guidance on the thermal aspects of numerous pathfinding and development projects ranging from TIMs to TECs to dynamic thermal characterization methodologies \n \n R&D Test Engineer Intel Corporation September 2007  –  April 2013  (5 years 8 months) Chandler, AZ Sort Test Technology Development, TMG \n \nWorked on numerous aspects of equipment development, taking a concept of a superior thermal management technology from paper study to a manufacturing ready tool for testing Intel’s microprocessor products \n \n• Demonstrated the technical feasibility of a novel, cost effective direct-liquid contact microchannel concept for the thermal management of test modules. Optimized and evolved the microchannel concept for high volume manufacturing environments using CFD.  \n \n• Lead an agile and lean technical hardware team responsible to deploy a manufacturing ready prototype tool in factory to enable direct liquid cooling microchannel technology.  \n \n• Designed the hardware system architecture of the tool, developed fixtures and metrologies for conducting reliability testing of the tool and drove design of experiments for capability characterization.  \n \n• Engaged in commercial and technical discussion with supplier(s): created technical specifications and requirements, engineering CAD models, logic diagrams, SOWs, and came up with should costs based on BOM of the internally developed prototypes for commercial negotiations with the supplier.  \n \n• Hands-on work on: Overall system fluidics and power delivery design, design and development of the communication and automation system interface, mechanical design of hardware, embedded system design and development of system controller (i.e. PID controllers, stepper motor control...), firmware programming, circuit and PCB design, development of an engineering GUI for the control of the tool, data acquisition setups to ensure the tool meets the target criteria\t \n \n• Lead Thermal Working Group in the department (STTD); work group charter: peer review and guidance on the thermal aspects of numerous pathfinding and development projects ranging from TIMs to TECs to dynamic thermal characterization methodologies \n \n Research Assistant Purdue University August 2000  –  September 2007  (7 years 2 months) Cooling Technologies Research Center \n \nResearch and development of piezoelectric fans for thermal management Research Assistant Purdue University August 2000  –  September 2007  (7 years 2 months) Cooling Technologies Research Center \n \nResearch and development of piezoelectric fans for thermal management Thermal Analyst Intel Corporation May 2004  –  August 2004  (4 months) Thermal Analyst Intel Corporation May 2004  –  August 2004  (4 months) Skills R&D Thermal Simulations Characterization Matlab Design of Experiments Labview Semiconductors Heat Transfer Fluid Mechanics Finite Element Analysis Failure Analysis JMP Mechanical Engineering Design for Manufacturing CFD Microfluidics Firmware Embedded Systems Data Acquisition Embedded C Solidworks Prototyping Optomechanical design Sensors 3D Printing Aerosol Science DNA Sequencing Optical Sensors Instrumentation See 15+     See less Skills  R&D Thermal Simulations Characterization Matlab Design of Experiments Labview Semiconductors Heat Transfer Fluid Mechanics Finite Element Analysis Failure Analysis JMP Mechanical Engineering Design for Manufacturing CFD Microfluidics Firmware Embedded Systems Data Acquisition Embedded C Solidworks Prototyping Optomechanical design Sensors 3D Printing Aerosol Science DNA Sequencing Optical Sensors Instrumentation See 15+     See less R&D Thermal Simulations Characterization Matlab Design of Experiments Labview Semiconductors Heat Transfer Fluid Mechanics Finite Element Analysis Failure Analysis JMP Mechanical Engineering Design for Manufacturing CFD Microfluidics Firmware Embedded Systems Data Acquisition Embedded C Solidworks Prototyping Optomechanical design Sensors 3D Printing Aerosol Science DNA Sequencing Optical Sensors Instrumentation See 15+     See less R&D Thermal Simulations Characterization Matlab Design of Experiments Labview Semiconductors Heat Transfer Fluid Mechanics Finite Element Analysis Failure Analysis JMP Mechanical Engineering Design for Manufacturing CFD Microfluidics Firmware Embedded Systems Data Acquisition Embedded C Solidworks Prototyping Optomechanical design Sensors 3D Printing Aerosol Science DNA Sequencing Optical Sensors Instrumentation See 15+     See less Education Purdue University Doctor of Philosophy (PhD),  Mechanical Engineering 2003  – 2007 PhD dissertation: \"Thermal and Fluidic Characterization of Piezoelectric Fans\", 2007. Activities and Societies:  Cooling Technologies Research Center Purdue University MSME,  Mechanical Engineering 2000  – 2003 MS Thesis: \"Miniature Piezoelectric Fans for Thermal Management of Electronics\", 2003. Activities and Societies:  Cooling Technologies Research Center Orta Doğu Teknik Üniversitesi BS,  Mechanical Engineering 1996  – 2000 Purdue University Doctor of Philosophy (PhD),  Mechanical Engineering 2003  – 2007 PhD dissertation: \"Thermal and Fluidic Characterization of Piezoelectric Fans\", 2007. Activities and Societies:  Cooling Technologies Research Center Purdue University Doctor of Philosophy (PhD),  Mechanical Engineering 2003  – 2007 PhD dissertation: \"Thermal and Fluidic Characterization of Piezoelectric Fans\", 2007. Activities and Societies:  Cooling Technologies Research Center Purdue University Doctor of Philosophy (PhD),  Mechanical Engineering 2003  – 2007 PhD dissertation: \"Thermal and Fluidic Characterization of Piezoelectric Fans\", 2007. Activities and Societies:  Cooling Technologies Research Center Purdue University MSME,  Mechanical Engineering 2000  – 2003 MS Thesis: \"Miniature Piezoelectric Fans for Thermal Management of Electronics\", 2003. Activities and Societies:  Cooling Technologies Research Center Purdue University MSME,  Mechanical Engineering 2000  – 2003 MS Thesis: \"Miniature Piezoelectric Fans for Thermal Management of Electronics\", 2003. Activities and Societies:  Cooling Technologies Research Center Purdue University MSME,  Mechanical Engineering 2000  – 2003 MS Thesis: \"Miniature Piezoelectric Fans for Thermal Management of Electronics\", 2003. Activities and Societies:  Cooling Technologies Research Center Orta Doğu Teknik Üniversitesi BS,  Mechanical Engineering 1996  – 2000 Orta Doğu Teknik Üniversitesi BS,  Mechanical Engineering 1996  – 2000 Orta Doğu Teknik Üniversitesi BS,  Mechanical Engineering 1996  – 2000 ", "Skills Circuit Design Electrical Engineering IC Sensors RF ADC CMOS ASIC Digital Signal... Mixed Signal Integrated Circuit... VLSI MEMS Thin Films Debugging ADCs Analog Circuit Design Management PLL FPGA Microprocessors Silicon Characterization Hardware Architecture Cadence Virtuoso Semiconductors Cadence SoC Analog Verilog Logic Synthesis Algorithms See 17+     See less Skills  Circuit Design Electrical Engineering IC Sensors RF ADC CMOS ASIC Digital Signal... Mixed Signal Integrated Circuit... VLSI MEMS Thin Films Debugging ADCs Analog Circuit Design Management PLL FPGA Microprocessors Silicon Characterization Hardware Architecture Cadence Virtuoso Semiconductors Cadence SoC Analog Verilog Logic Synthesis Algorithms See 17+     See less Circuit Design Electrical Engineering IC Sensors RF ADC CMOS ASIC Digital Signal... Mixed Signal Integrated Circuit... VLSI MEMS Thin Films Debugging ADCs Analog Circuit Design Management PLL FPGA Microprocessors Silicon Characterization Hardware Architecture Cadence Virtuoso Semiconductors Cadence SoC Analog Verilog Logic Synthesis Algorithms See 17+     See less Circuit Design Electrical Engineering IC Sensors RF ADC CMOS ASIC Digital Signal... Mixed Signal Integrated Circuit... VLSI MEMS Thin Films Debugging ADCs Analog Circuit Design Management PLL FPGA Microprocessors Silicon Characterization Hardware Architecture Cadence Virtuoso Semiconductors Cadence SoC Analog Verilog Logic Synthesis Algorithms See 17+     See less ", "Summary Discovery and simulation of nanoscale logic devices. \nManaging of joint research projects with universities in nanotechnology, emerging logic devices. \n60 publications in refereed journals in quantum optics, lasers, nanoelectronics and spintronics, and 35 issued patents in optoelectronics, integrated optic and spintronic devices. Summary Discovery and simulation of nanoscale logic devices. \nManaging of joint research projects with universities in nanotechnology, emerging logic devices. \n60 publications in refereed journals in quantum optics, lasers, nanoelectronics and spintronics, and 35 issued patents in optoelectronics, integrated optic and spintronic devices. Discovery and simulation of nanoscale logic devices. \nManaging of joint research projects with universities in nanotechnology, emerging logic devices. \n60 publications in refereed journals in quantum optics, lasers, nanoelectronics and spintronics, and 35 issued patents in optoelectronics, integrated optic and spintronic devices. Discovery and simulation of nanoscale logic devices. \nManaging of joint research projects with universities in nanotechnology, emerging logic devices. \n60 publications in refereed journals in quantum optics, lasers, nanoelectronics and spintronics, and 35 issued patents in optoelectronics, integrated optic and spintronic devices. Experience Research Scientist Intel Corporation June 2009  – Present (6 years 3 months) Hillsboro, Oregon Research Scientist Intel Corporation June 2009  – Present (6 years 3 months) Hillsboro, Oregon Research Scientist Intel Corporation June 2009  – Present (6 years 3 months) Hillsboro, Oregon Languages English Russian English Russian English Russian Skills Physics Simulation Research Laser Simulations Optoelectronics Semiconductors Nanotechnology Spintronics Photonics Optics Signal Processing Patents Nanoscience Magnetics Condensed Matter Physics CMOS IC Characterization Design of Experiments Thin Films Materials Science MEMS Semiconductor Device AFM R&D Spectroscopy Metrology Quantum Mechanics Silicon Etching Semiconductor Industry Failure Analysis Process Integration Photolithography PVD JMP Sensors Lithography Nanofabrication Device Characterization Scanning Electron... Sputtering Nanomaterials Microelectronics PECVD Electron Beam... Microfabrication See 33+     See less Skills  Physics Simulation Research Laser Simulations Optoelectronics Semiconductors Nanotechnology Spintronics Photonics Optics Signal Processing Patents Nanoscience Magnetics Condensed Matter Physics CMOS IC Characterization Design of Experiments Thin Films Materials Science MEMS Semiconductor Device AFM R&D Spectroscopy Metrology Quantum Mechanics Silicon Etching Semiconductor Industry Failure Analysis Process Integration Photolithography PVD JMP Sensors Lithography Nanofabrication Device Characterization Scanning Electron... Sputtering Nanomaterials Microelectronics PECVD Electron Beam... Microfabrication See 33+     See less Physics Simulation Research Laser Simulations Optoelectronics Semiconductors Nanotechnology Spintronics Photonics Optics Signal Processing Patents Nanoscience Magnetics Condensed Matter Physics CMOS IC Characterization Design of Experiments Thin Films Materials Science MEMS Semiconductor Device AFM R&D Spectroscopy Metrology Quantum Mechanics Silicon Etching Semiconductor Industry Failure Analysis Process Integration Photolithography PVD JMP Sensors Lithography Nanofabrication Device Characterization Scanning Electron... Sputtering Nanomaterials Microelectronics PECVD Electron Beam... Microfabrication See 33+     See less Physics Simulation Research Laser Simulations Optoelectronics Semiconductors Nanotechnology Spintronics Photonics Optics Signal Processing Patents Nanoscience Magnetics Condensed Matter Physics CMOS IC Characterization Design of Experiments Thin Films Materials Science MEMS Semiconductor Device AFM R&D Spectroscopy Metrology Quantum Mechanics Silicon Etching Semiconductor Industry Failure Analysis Process Integration Photolithography PVD JMP Sensors Lithography Nanofabrication Device Characterization Scanning Electron... Sputtering Nanomaterials Microelectronics PECVD Electron Beam... Microfabrication See 33+     See less Honors & Awards ", "Experience Principal Engineer Intel April 2015  – Present (5 months) Santa Clara, CA Senior Staff Research Scientist Intel Corporation April 2011  –  March 2015  (4 years) Greater Los Angeles Area Location Architect for Cross Platform Solutions Intel Corporation May 2013  –  May 2014  (1 year 1 month) Santa Clara, CA Staff Research Scientist Intel Corporation April 2008  –  March 2011  (3 years) Greater Los Angeles Area Co-chair of Bluetooth/MWS coexistence subgroup Bluetooth SIG July 2007  –  April 2010  (2 years 10 months) Senior Research Scientist Intel Corporation January 2006  –  March 2008  (2 years 3 months) Portland, Oregon Area Summer Intern Palo Alto Research Center (PARC) 2003  –  2003  (less than a year) Principal Engineer Intel April 2015  – Present (5 months) Santa Clara, CA Principal Engineer Intel April 2015  – Present (5 months) Santa Clara, CA Senior Staff Research Scientist Intel Corporation April 2011  –  March 2015  (4 years) Greater Los Angeles Area Senior Staff Research Scientist Intel Corporation April 2011  –  March 2015  (4 years) Greater Los Angeles Area Location Architect for Cross Platform Solutions Intel Corporation May 2013  –  May 2014  (1 year 1 month) Santa Clara, CA Location Architect for Cross Platform Solutions Intel Corporation May 2013  –  May 2014  (1 year 1 month) Santa Clara, CA Staff Research Scientist Intel Corporation April 2008  –  March 2011  (3 years) Greater Los Angeles Area Staff Research Scientist Intel Corporation April 2008  –  March 2011  (3 years) Greater Los Angeles Area Co-chair of Bluetooth/MWS coexistence subgroup Bluetooth SIG July 2007  –  April 2010  (2 years 10 months) Co-chair of Bluetooth/MWS coexistence subgroup Bluetooth SIG July 2007  –  April 2010  (2 years 10 months) Senior Research Scientist Intel Corporation January 2006  –  March 2008  (2 years 3 months) Portland, Oregon Area Senior Research Scientist Intel Corporation January 2006  –  March 2008  (2 years 3 months) Portland, Oregon Area Summer Intern Palo Alto Research Center (PARC) 2003  –  2003  (less than a year) Summer Intern Palo Alto Research Center (PARC) 2003  –  2003  (less than a year) Skills Algorithms Embedded Systems Matlab Computer Architecture Signal Processing Simulations C Embedded Software Python Software Engineering Perl Digital Signal... Semiconductors FPGA Distributed Systems VHDL LaTeX Machine Learning Computer Science C++ Wireless System Architecture Mobile Devices See 8+     See less Skills  Algorithms Embedded Systems Matlab Computer Architecture Signal Processing Simulations C Embedded Software Python Software Engineering Perl Digital Signal... Semiconductors FPGA Distributed Systems VHDL LaTeX Machine Learning Computer Science C++ Wireless System Architecture Mobile Devices See 8+     See less Algorithms Embedded Systems Matlab Computer Architecture Signal Processing Simulations C Embedded Software Python Software Engineering Perl Digital Signal... Semiconductors FPGA Distributed Systems VHDL LaTeX Machine Learning Computer Science C++ Wireless System Architecture Mobile Devices See 8+     See less Algorithms Embedded Systems Matlab Computer Architecture Signal Processing Simulations C Embedded Software Python Software Engineering Perl Digital Signal... Semiconductors FPGA Distributed Systems VHDL LaTeX Machine Learning Computer Science C++ Wireless System Architecture Mobile Devices See 8+     See less Education University of Illinois at Urbana-Champaign Ph.D.,  Computer Engineering 2001  – 2005 University of Illinois at Urbana-Champaign Ph.D.,  Computer Engineering 2001  – 2005 University of Illinois at Urbana-Champaign Ph.D.,  Computer Engineering 2001  – 2005 University of Illinois at Urbana-Champaign Ph.D.,  Computer Engineering 2001  – 2005 ", "Experience Research Scientist Intel Corporation October 2014  – Present (11 months) San Francisco Bay Area Research Scientist Intel Corporation October 2014  – Present (11 months) San Francisco Bay Area Research Scientist Intel Corporation October 2014  – Present (11 months) San Francisco Bay Area Skills Analog Circuit Design Cadence Virtuoso Matlab CMOS Testing Simulations SRAM Semiconductors IC Verilog Circuit Design Signal Processing Skills  Analog Circuit Design Cadence Virtuoso Matlab CMOS Testing Simulations SRAM Semiconductors IC Verilog Circuit Design Signal Processing Analog Circuit Design Cadence Virtuoso Matlab CMOS Testing Simulations SRAM Semiconductors IC Verilog Circuit Design Signal Processing Analog Circuit Design Cadence Virtuoso Matlab CMOS Testing Simulations SRAM Semiconductors IC Verilog Circuit Design Signal Processing Education Carnegie Mellon University Ph. D.,  Electrical and Computer Eng. 2007  – 2010 Self-Healing Circuits Using Statistical Element Selection \n-Flash ADC Design in the presence of process variations. Test chips in 65nm bulk and 45nm SOI CMOS. \n-SRAM sense amplifier modeling and test (65nm bulk CMOS). Carnegie Mellon University M.S,  Electrical and Computer Engineering 2003  – 2005 Analysis and Control of IC Power Grids \n-Test chips at 0.13um CMOS Bilkent University B.S,  Electrical and Electronics Engineering 1999  – 2003 Izmir Fen Lisesi Carnegie Mellon University Ph. D.,  Electrical and Computer Eng. 2007  – 2010 Self-Healing Circuits Using Statistical Element Selection \n-Flash ADC Design in the presence of process variations. Test chips in 65nm bulk and 45nm SOI CMOS. \n-SRAM sense amplifier modeling and test (65nm bulk CMOS). Carnegie Mellon University Ph. D.,  Electrical and Computer Eng. 2007  – 2010 Self-Healing Circuits Using Statistical Element Selection \n-Flash ADC Design in the presence of process variations. Test chips in 65nm bulk and 45nm SOI CMOS. \n-SRAM sense amplifier modeling and test (65nm bulk CMOS). Carnegie Mellon University Ph. D.,  Electrical and Computer Eng. 2007  – 2010 Self-Healing Circuits Using Statistical Element Selection \n-Flash ADC Design in the presence of process variations. Test chips in 65nm bulk and 45nm SOI CMOS. \n-SRAM sense amplifier modeling and test (65nm bulk CMOS). Carnegie Mellon University M.S,  Electrical and Computer Engineering 2003  – 2005 Analysis and Control of IC Power Grids \n-Test chips at 0.13um CMOS Carnegie Mellon University M.S,  Electrical and Computer Engineering 2003  – 2005 Analysis and Control of IC Power Grids \n-Test chips at 0.13um CMOS Carnegie Mellon University M.S,  Electrical and Computer Engineering 2003  – 2005 Analysis and Control of IC Power Grids \n-Test chips at 0.13um CMOS Bilkent University B.S,  Electrical and Electronics Engineering 1999  – 2003 Bilkent University B.S,  Electrical and Electronics Engineering 1999  – 2003 Bilkent University B.S,  Electrical and Electronics Engineering 1999  – 2003 Izmir Fen Lisesi Izmir Fen Lisesi Izmir Fen Lisesi Honors & Awards ", "Experience Senior Research Scientist Intel Corporation April 2015  – Present (5 months) Hillsboro, OR Research on 5G wireless technology and mobile computing Research Scientist Intel Corporation May 2013  –  March 2015  (1 year 11 months) Hillsboro Research on 5G wireless technology and mobile computing Software Engineer Amazon August 2011  –  May 2013  (1 year 10 months) Greater Seattle Area Research Intern Intel Corporation January 2008  –  July 2008  (7 months) Hillsboro, OR Graduate Student Researcher (part-time) Telecommunications Research Labs May 2002  –  April 2004  (2 years) Winnipeg, MB Senior Research Scientist Intel Corporation April 2015  – Present (5 months) Hillsboro, OR Research on 5G wireless technology and mobile computing Senior Research Scientist Intel Corporation April 2015  – Present (5 months) Hillsboro, OR Research on 5G wireless technology and mobile computing Research Scientist Intel Corporation May 2013  –  March 2015  (1 year 11 months) Hillsboro Research on 5G wireless technology and mobile computing Research Scientist Intel Corporation May 2013  –  March 2015  (1 year 11 months) Hillsboro Research on 5G wireless technology and mobile computing Software Engineer Amazon August 2011  –  May 2013  (1 year 10 months) Greater Seattle Area Software Engineer Amazon August 2011  –  May 2013  (1 year 10 months) Greater Seattle Area Research Intern Intel Corporation January 2008  –  July 2008  (7 months) Hillsboro, OR Research Intern Intel Corporation January 2008  –  July 2008  (7 months) Hillsboro, OR Graduate Student Researcher (part-time) Telecommunications Research Labs May 2002  –  April 2004  (2 years) Winnipeg, MB Graduate Student Researcher (part-time) Telecommunications Research Labs May 2002  –  April 2004  (2 years) Winnipeg, MB Skills Machine Learning Wireless Networking SaaS C++ LTE Convex Optimization Java Web Services Multimedia Computational... Matlab Distributed Systems Algorithms Skills  Machine Learning Wireless Networking SaaS C++ LTE Convex Optimization Java Web Services Multimedia Computational... Matlab Distributed Systems Algorithms Machine Learning Wireless Networking SaaS C++ LTE Convex Optimization Java Web Services Multimedia Computational... Matlab Distributed Systems Algorithms Machine Learning Wireless Networking SaaS C++ LTE Convex Optimization Java Web Services Multimedia Computational... Matlab Distributed Systems Algorithms Education The University of British Columbia / UBC Doctor of Philosophy (PhD),  Electrical and Computer Engineering 2005  – 2010 Buet The University of British Columbia / UBC Doctor of Philosophy (PhD),  Electrical and Computer Engineering 2005  – 2010 The University of British Columbia / UBC Doctor of Philosophy (PhD),  Electrical and Computer Engineering 2005  – 2010 The University of British Columbia / UBC Doctor of Philosophy (PhD),  Electrical and Computer Engineering 2005  – 2010 Buet Buet Buet ", "Summary Research Scientist with over 8 years of experience in the field of silicon photonics. Experienced with design of photonic component of high speed receiver systems (10/25/40Gbps) for next generation optical networks. Extensive knowledge of high speed avalanche photodiode/photodiodes for long haul fiber communications. \n \nOther experiences include interconnect technology, component thermal design and simulation, optical component fabrication and optical component characterization. \n \nSpecialties: Device level simulation (Senaturus TCAD), PD/APD design, Various Photonic Device Characterizations, Measurement equipment automation (MATLAB), CAD design software (Solid Works). \n \nLanguage: Fluent in Chinese-Mandarin (native level), English (native level) and Japanese (Business level). Summary Research Scientist with over 8 years of experience in the field of silicon photonics. Experienced with design of photonic component of high speed receiver systems (10/25/40Gbps) for next generation optical networks. Extensive knowledge of high speed avalanche photodiode/photodiodes for long haul fiber communications. \n \nOther experiences include interconnect technology, component thermal design and simulation, optical component fabrication and optical component characterization. \n \nSpecialties: Device level simulation (Senaturus TCAD), PD/APD design, Various Photonic Device Characterizations, Measurement equipment automation (MATLAB), CAD design software (Solid Works). \n \nLanguage: Fluent in Chinese-Mandarin (native level), English (native level) and Japanese (Business level). Research Scientist with over 8 years of experience in the field of silicon photonics. Experienced with design of photonic component of high speed receiver systems (10/25/40Gbps) for next generation optical networks. Extensive knowledge of high speed avalanche photodiode/photodiodes for long haul fiber communications. \n \nOther experiences include interconnect technology, component thermal design and simulation, optical component fabrication and optical component characterization. \n \nSpecialties: Device level simulation (Senaturus TCAD), PD/APD design, Various Photonic Device Characterizations, Measurement equipment automation (MATLAB), CAD design software (Solid Works). \n \nLanguage: Fluent in Chinese-Mandarin (native level), English (native level) and Japanese (Business level). Research Scientist with over 8 years of experience in the field of silicon photonics. Experienced with design of photonic component of high speed receiver systems (10/25/40Gbps) for next generation optical networks. Extensive knowledge of high speed avalanche photodiode/photodiodes for long haul fiber communications. \n \nOther experiences include interconnect technology, component thermal design and simulation, optical component fabrication and optical component characterization. \n \nSpecialties: Device level simulation (Senaturus TCAD), PD/APD design, Various Photonic Device Characterizations, Measurement equipment automation (MATLAB), CAD design software (Solid Works). \n \nLanguage: Fluent in Chinese-Mandarin (native level), English (native level) and Japanese (Business level). Experience Senior Optical Research Scientist Intel Corporation April 2011  –  August 2014  (3 years 5 months) Santa Clara, CA Development of state of the art Si/Ge photodiodes and avalanche photodiodes. Improving photodiode/avalanche photodiode performance. \n \nIntegration lead for on chip integration of receiver photonic components. \n \nProvided module assembly solution and module level (high speed receiver module) performance analysis including WDM systems. Intern Research Scientist Intel Corporation May 2010  –  April 2011  (1 year) Developed state of the art Si/Ge Avalanche photodiodes. Responsible for design, monitoring fabrication, characterization and analysis of the Si/Ge APDs. Research Assistant University of Virginia November 2008  –  May 2010  (1 year 7 months) Charlottesville, Virginia Area Conducted research on SiC related avalanche photodiodes. Intern Research Scientist Intel Corporation March 2008  –  October 2008  (8 months) Santa Clara, CA Worked on development of high performance Si/Ge avalanche photodiodes. Responsible for characterization and analysis of avalanche photodiodes. Achieved record results with publication in Journal photonics \"Monolithic germanium/silicon avalanche photodiodes with 340 GHz gain–bandwidth product\" in 2009.  \n \n•\t-Analyzed Si/Ge avalanche photodiode performance including current-voltage and capacitance-voltage characteristics, spatial uniformity, bit-error rate, bandwidth and \ndevice reliability. \n•\tDetermined punch-through gain from excess noise measurements of Si/Ge hetero-junction separate absorption, charge and multiplication APDs with unique techniques. This gain \nvalue was crucial to the evaluation of device performance. \n•\tDeveloped Labview program for automated spatial photo-response scans. \n•\tInvestigated dark current behavior of Si/Ge SACM APDs in detail, and determined the origin and mechanism responsible for the dominant component of the dark current. \n•\tPerformed APD device design through modeling/simulation with Sentaurus TCAD software to design Si/Ge APD of low dark current, low excess noise, high speed and high responsivity. \n•\tExtensively modeled high performance Si/Ge APDs to fully understand APD behaviors and device physics.  \n•\tEvaluated 3 dimensional simulation softwares including Sentaurus TCAD and Crosslight pic3D for 3 dimensional photodiode simulations. Research Assistant supervised by Professor Joe Cambpell University of Virginia January 2006  –  March 2008  (2 years 3 months) Charlottesville, Virginia Area •\tDesigned and optimized 4H-SiC recessed window APDs improving the external quantum efficiency by ~50%. \n•\tDesigned and optimized 4H-SiC double mesa APDs which greatly improves fill factor for detector arrays by ~90%. \n•\tDeveloped a novel technique to determine punch-through gain from excess noise measurement for Separate Absorption and Multiplication APDs. \n•\tCollaborated with General Electric in designing high performance single photon counting SiC APD arrays. \n•\tFabricated and characterized GaN on SiC hetero-junction SACM APD in collaboration with Army Research Lab. \n•\tCharacterized various designs of SiC Single Photon APD performances operating under ultraviolet illumination. \n•\tModeled/simulated 4H-SiC APD to optimize APD design and understand fundamental physics of the APD operation. Research Assistant UNIVERSITY OF TEXAS January 2005  –  December 2005  (1 year) supervised by: Prof. Joe Campbell \n•\t-Demonstrated high performance 6H-SiC APDs. \n•\tDesigned, fabricated and analyzed the performance of p-i-n structured 4H-SiC APD with \nvarious i-layer thicknesses. \n- \nSkills  \n \n•\tCharacterization of Semiconductor Devices: Current-Voltage, Capacitance-Voltage, Gain, \nExcess Noise, Bandwidth, Sensitivity (Bit Error Rate Testing), Quantum Efficiency, Spatial \nResponse Uniformity Scan, waveguide loss, Photon Detection Efficiency, Dark Count \nProbability. \n•\tGeneral Testing Equipment: Semiconductor Parameter Analyzer, Oscilloscope, \nSpectrometer, SEM, Lasers, Modulators, Detectors, Fiber/Free-space Optics, Noise-Figure \nAnalyzer, Array Tester. \n•\tMicrofabrication: Photolithography, Chemical Etching, Electroplating, Thermal Senior Optical Research Scientist Intel Corporation April 2011  –  August 2014  (3 years 5 months) Santa Clara, CA Development of state of the art Si/Ge photodiodes and avalanche photodiodes. Improving photodiode/avalanche photodiode performance. \n \nIntegration lead for on chip integration of receiver photonic components. \n \nProvided module assembly solution and module level (high speed receiver module) performance analysis including WDM systems. Senior Optical Research Scientist Intel Corporation April 2011  –  August 2014  (3 years 5 months) Santa Clara, CA Development of state of the art Si/Ge photodiodes and avalanche photodiodes. Improving photodiode/avalanche photodiode performance. \n \nIntegration lead for on chip integration of receiver photonic components. \n \nProvided module assembly solution and module level (high speed receiver module) performance analysis including WDM systems. Intern Research Scientist Intel Corporation May 2010  –  April 2011  (1 year) Developed state of the art Si/Ge Avalanche photodiodes. Responsible for design, monitoring fabrication, characterization and analysis of the Si/Ge APDs. Intern Research Scientist Intel Corporation May 2010  –  April 2011  (1 year) Developed state of the art Si/Ge Avalanche photodiodes. Responsible for design, monitoring fabrication, characterization and analysis of the Si/Ge APDs. Research Assistant University of Virginia November 2008  –  May 2010  (1 year 7 months) Charlottesville, Virginia Area Conducted research on SiC related avalanche photodiodes. Research Assistant University of Virginia November 2008  –  May 2010  (1 year 7 months) Charlottesville, Virginia Area Conducted research on SiC related avalanche photodiodes. Intern Research Scientist Intel Corporation March 2008  –  October 2008  (8 months) Santa Clara, CA Worked on development of high performance Si/Ge avalanche photodiodes. Responsible for characterization and analysis of avalanche photodiodes. Achieved record results with publication in Journal photonics \"Monolithic germanium/silicon avalanche photodiodes with 340 GHz gain–bandwidth product\" in 2009.  \n \n•\t-Analyzed Si/Ge avalanche photodiode performance including current-voltage and capacitance-voltage characteristics, spatial uniformity, bit-error rate, bandwidth and \ndevice reliability. \n•\tDetermined punch-through gain from excess noise measurements of Si/Ge hetero-junction separate absorption, charge and multiplication APDs with unique techniques. This gain \nvalue was crucial to the evaluation of device performance. \n•\tDeveloped Labview program for automated spatial photo-response scans. \n•\tInvestigated dark current behavior of Si/Ge SACM APDs in detail, and determined the origin and mechanism responsible for the dominant component of the dark current. \n•\tPerformed APD device design through modeling/simulation with Sentaurus TCAD software to design Si/Ge APD of low dark current, low excess noise, high speed and high responsivity. \n•\tExtensively modeled high performance Si/Ge APDs to fully understand APD behaviors and device physics.  \n•\tEvaluated 3 dimensional simulation softwares including Sentaurus TCAD and Crosslight pic3D for 3 dimensional photodiode simulations. Intern Research Scientist Intel Corporation March 2008  –  October 2008  (8 months) Santa Clara, CA Worked on development of high performance Si/Ge avalanche photodiodes. Responsible for characterization and analysis of avalanche photodiodes. Achieved record results with publication in Journal photonics \"Monolithic germanium/silicon avalanche photodiodes with 340 GHz gain–bandwidth product\" in 2009.  \n \n•\t-Analyzed Si/Ge avalanche photodiode performance including current-voltage and capacitance-voltage characteristics, spatial uniformity, bit-error rate, bandwidth and \ndevice reliability. \n•\tDetermined punch-through gain from excess noise measurements of Si/Ge hetero-junction separate absorption, charge and multiplication APDs with unique techniques. This gain \nvalue was crucial to the evaluation of device performance. \n•\tDeveloped Labview program for automated spatial photo-response scans. \n•\tInvestigated dark current behavior of Si/Ge SACM APDs in detail, and determined the origin and mechanism responsible for the dominant component of the dark current. \n•\tPerformed APD device design through modeling/simulation with Sentaurus TCAD software to design Si/Ge APD of low dark current, low excess noise, high speed and high responsivity. \n•\tExtensively modeled high performance Si/Ge APDs to fully understand APD behaviors and device physics.  \n•\tEvaluated 3 dimensional simulation softwares including Sentaurus TCAD and Crosslight pic3D for 3 dimensional photodiode simulations. Research Assistant supervised by Professor Joe Cambpell University of Virginia January 2006  –  March 2008  (2 years 3 months) Charlottesville, Virginia Area •\tDesigned and optimized 4H-SiC recessed window APDs improving the external quantum efficiency by ~50%. \n•\tDesigned and optimized 4H-SiC double mesa APDs which greatly improves fill factor for detector arrays by ~90%. \n•\tDeveloped a novel technique to determine punch-through gain from excess noise measurement for Separate Absorption and Multiplication APDs. \n•\tCollaborated with General Electric in designing high performance single photon counting SiC APD arrays. \n•\tFabricated and characterized GaN on SiC hetero-junction SACM APD in collaboration with Army Research Lab. \n•\tCharacterized various designs of SiC Single Photon APD performances operating under ultraviolet illumination. \n•\tModeled/simulated 4H-SiC APD to optimize APD design and understand fundamental physics of the APD operation. Research Assistant supervised by Professor Joe Cambpell University of Virginia January 2006  –  March 2008  (2 years 3 months) Charlottesville, Virginia Area •\tDesigned and optimized 4H-SiC recessed window APDs improving the external quantum efficiency by ~50%. \n•\tDesigned and optimized 4H-SiC double mesa APDs which greatly improves fill factor for detector arrays by ~90%. \n•\tDeveloped a novel technique to determine punch-through gain from excess noise measurement for Separate Absorption and Multiplication APDs. \n•\tCollaborated with General Electric in designing high performance single photon counting SiC APD arrays. \n•\tFabricated and characterized GaN on SiC hetero-junction SACM APD in collaboration with Army Research Lab. \n•\tCharacterized various designs of SiC Single Photon APD performances operating under ultraviolet illumination. \n•\tModeled/simulated 4H-SiC APD to optimize APD design and understand fundamental physics of the APD operation. Research Assistant UNIVERSITY OF TEXAS January 2005  –  December 2005  (1 year) supervised by: Prof. Joe Campbell \n•\t-Demonstrated high performance 6H-SiC APDs. \n•\tDesigned, fabricated and analyzed the performance of p-i-n structured 4H-SiC APD with \nvarious i-layer thicknesses. \n- \nSkills  \n \n•\tCharacterization of Semiconductor Devices: Current-Voltage, Capacitance-Voltage, Gain, \nExcess Noise, Bandwidth, Sensitivity (Bit Error Rate Testing), Quantum Efficiency, Spatial \nResponse Uniformity Scan, waveguide loss, Photon Detection Efficiency, Dark Count \nProbability. \n•\tGeneral Testing Equipment: Semiconductor Parameter Analyzer, Oscilloscope, \nSpectrometer, SEM, Lasers, Modulators, Detectors, Fiber/Free-space Optics, Noise-Figure \nAnalyzer, Array Tester. \n•\tMicrofabrication: Photolithography, Chemical Etching, Electroplating, Thermal Research Assistant UNIVERSITY OF TEXAS January 2005  –  December 2005  (1 year) supervised by: Prof. Joe Campbell \n•\t-Demonstrated high performance 6H-SiC APDs. \n•\tDesigned, fabricated and analyzed the performance of p-i-n structured 4H-SiC APD with \nvarious i-layer thicknesses. \n- \nSkills  \n \n•\tCharacterization of Semiconductor Devices: Current-Voltage, Capacitance-Voltage, Gain, \nExcess Noise, Bandwidth, Sensitivity (Bit Error Rate Testing), Quantum Efficiency, Spatial \nResponse Uniformity Scan, waveguide loss, Photon Detection Efficiency, Dark Count \nProbability. \n•\tGeneral Testing Equipment: Semiconductor Parameter Analyzer, Oscilloscope, \nSpectrometer, SEM, Lasers, Modulators, Detectors, Fiber/Free-space Optics, Noise-Figure \nAnalyzer, Array Tester. \n•\tMicrofabrication: Photolithography, Chemical Etching, Electroplating, Thermal Languages English Native or bilingual proficiency Chinese Native or bilingual proficiency Japanese Full professional proficiency English Native or bilingual proficiency Chinese Native or bilingual proficiency Japanese Full professional proficiency English Native or bilingual proficiency Chinese Native or bilingual proficiency Japanese Full professional proficiency Native or bilingual proficiency Native or bilingual proficiency Full professional proficiency Skills Synopsys tools Device Physics Matlab Silicon Photonics Silicon Carbide Optics Photodiodes Research avalanche photodiodes Skills  Synopsys tools Device Physics Matlab Silicon Photonics Silicon Carbide Optics Photodiodes Research avalanche photodiodes Synopsys tools Device Physics Matlab Silicon Photonics Silicon Carbide Optics Photodiodes Research avalanche photodiodes Synopsys tools Device Physics Matlab Silicon Photonics Silicon Carbide Optics Photodiodes Research avalanche photodiodes Education University of Virginia PhD,  Electrical Engineering 2006  – 2010 Activities and Societies:  Studied the mechanism avalanche photodiodes. Designed ,  fabricated ,  characterized and analyzed the performance of avalanche photodiodes. Optical detection in the UV range with the SiC material was of primary interest. University of Virginia, Graduate School of Engineering Master of Engineering,  Electrical Engineering 2006  – 2010 The University of Texas at Austin Bachelor of Science,  Electrical Engineering 2003  – 2005 University of Wisconsin-Madison Physics & Computer Science 2001  – 2003 University of Virginia PhD,  Electrical Engineering 2006  – 2010 Activities and Societies:  Studied the mechanism avalanche photodiodes. Designed ,  fabricated ,  characterized and analyzed the performance of avalanche photodiodes. Optical detection in the UV range with the SiC material was of primary interest. University of Virginia PhD,  Electrical Engineering 2006  – 2010 Activities and Societies:  Studied the mechanism avalanche photodiodes. Designed ,  fabricated ,  characterized and analyzed the performance of avalanche photodiodes. Optical detection in the UV range with the SiC material was of primary interest. University of Virginia PhD,  Electrical Engineering 2006  – 2010 Activities and Societies:  Studied the mechanism avalanche photodiodes. Designed ,  fabricated ,  characterized and analyzed the performance of avalanche photodiodes. Optical detection in the UV range with the SiC material was of primary interest. University of Virginia, Graduate School of Engineering Master of Engineering,  Electrical Engineering 2006  – 2010 University of Virginia, Graduate School of Engineering Master of Engineering,  Electrical Engineering 2006  – 2010 University of Virginia, Graduate School of Engineering Master of Engineering,  Electrical Engineering 2006  – 2010 The University of Texas at Austin Bachelor of Science,  Electrical Engineering 2003  – 2005 The University of Texas at Austin Bachelor of Science,  Electrical Engineering 2003  – 2005 The University of Texas at Austin Bachelor of Science,  Electrical Engineering 2003  – 2005 University of Wisconsin-Madison Physics & Computer Science 2001  – 2003 University of Wisconsin-Madison Physics & Computer Science 2001  – 2003 University of Wisconsin-Madison Physics & Computer Science 2001  – 2003 ", "Summary I have been a Staff Research Scientist of Systems and Software Research in Intel Labs since June 2014. Prior to joining Intel, I was a Senior Research Scientist at Deutsche Telekom Innovation Center in Silicon Valley. I received my PhD in Computer Science from ETH Zurich, Switzerland in 2007. After two years building search engine and information logistics systems at the German software company Caatoosee, I joined ETH Zurich, working on adaptive software architectures. There I was the leader, designer and builder of the PROSE open source project. Prior to that I had internships with Google and Webquote in Silicon Valley. In the summer of 2000, I was selected, together with 10 other students from all over Romania, for the American Romanian Student Internship Program (ARSIP) organized in association with high tech companies from Silicon Valley. During all years of my university studies I was a recipient of the High-Performance Scholarship at Politehnica University of Timisoara, Romania for superior academic performance. \n \nMy interests are in the areas of mobile platforms and services, mobile computing, embedded systems, persistent memories, networking, adaptive software architectures, distributed systems, virtual machines, middleware for mobile and distributed computing. \n \nMy work has been published in numerous leading technical conferences, workshops and symposia proceedings. I am a regular speaker and panelist at premium international industry and scientific conferences. I have received several prestigious awards and honors for my work and technical contributions, the most recent ones include the Best Paper Award from IEEE RTAS 2012 and Best Student Paper Award from ACM WWW 2012. My work has been quoted by the press and media, as well as chaired and served as a technical program committee member of multiple industry and scientific conferences. I am a member of ACM and IEEE societies. Summary I have been a Staff Research Scientist of Systems and Software Research in Intel Labs since June 2014. Prior to joining Intel, I was a Senior Research Scientist at Deutsche Telekom Innovation Center in Silicon Valley. I received my PhD in Computer Science from ETH Zurich, Switzerland in 2007. After two years building search engine and information logistics systems at the German software company Caatoosee, I joined ETH Zurich, working on adaptive software architectures. There I was the leader, designer and builder of the PROSE open source project. Prior to that I had internships with Google and Webquote in Silicon Valley. In the summer of 2000, I was selected, together with 10 other students from all over Romania, for the American Romanian Student Internship Program (ARSIP) organized in association with high tech companies from Silicon Valley. During all years of my university studies I was a recipient of the High-Performance Scholarship at Politehnica University of Timisoara, Romania for superior academic performance. \n \nMy interests are in the areas of mobile platforms and services, mobile computing, embedded systems, persistent memories, networking, adaptive software architectures, distributed systems, virtual machines, middleware for mobile and distributed computing. \n \nMy work has been published in numerous leading technical conferences, workshops and symposia proceedings. I am a regular speaker and panelist at premium international industry and scientific conferences. I have received several prestigious awards and honors for my work and technical contributions, the most recent ones include the Best Paper Award from IEEE RTAS 2012 and Best Student Paper Award from ACM WWW 2012. My work has been quoted by the press and media, as well as chaired and served as a technical program committee member of multiple industry and scientific conferences. I am a member of ACM and IEEE societies. I have been a Staff Research Scientist of Systems and Software Research in Intel Labs since June 2014. Prior to joining Intel, I was a Senior Research Scientist at Deutsche Telekom Innovation Center in Silicon Valley. I received my PhD in Computer Science from ETH Zurich, Switzerland in 2007. After two years building search engine and information logistics systems at the German software company Caatoosee, I joined ETH Zurich, working on adaptive software architectures. There I was the leader, designer and builder of the PROSE open source project. Prior to that I had internships with Google and Webquote in Silicon Valley. In the summer of 2000, I was selected, together with 10 other students from all over Romania, for the American Romanian Student Internship Program (ARSIP) organized in association with high tech companies from Silicon Valley. During all years of my university studies I was a recipient of the High-Performance Scholarship at Politehnica University of Timisoara, Romania for superior academic performance. \n \nMy interests are in the areas of mobile platforms and services, mobile computing, embedded systems, persistent memories, networking, adaptive software architectures, distributed systems, virtual machines, middleware for mobile and distributed computing. \n \nMy work has been published in numerous leading technical conferences, workshops and symposia proceedings. I am a regular speaker and panelist at premium international industry and scientific conferences. I have received several prestigious awards and honors for my work and technical contributions, the most recent ones include the Best Paper Award from IEEE RTAS 2012 and Best Student Paper Award from ACM WWW 2012. My work has been quoted by the press and media, as well as chaired and served as a technical program committee member of multiple industry and scientific conferences. I am a member of ACM and IEEE societies. I have been a Staff Research Scientist of Systems and Software Research in Intel Labs since June 2014. Prior to joining Intel, I was a Senior Research Scientist at Deutsche Telekom Innovation Center in Silicon Valley. I received my PhD in Computer Science from ETH Zurich, Switzerland in 2007. After two years building search engine and information logistics systems at the German software company Caatoosee, I joined ETH Zurich, working on adaptive software architectures. There I was the leader, designer and builder of the PROSE open source project. Prior to that I had internships with Google and Webquote in Silicon Valley. In the summer of 2000, I was selected, together with 10 other students from all over Romania, for the American Romanian Student Internship Program (ARSIP) organized in association with high tech companies from Silicon Valley. During all years of my university studies I was a recipient of the High-Performance Scholarship at Politehnica University of Timisoara, Romania for superior academic performance. \n \nMy interests are in the areas of mobile platforms and services, mobile computing, embedded systems, persistent memories, networking, adaptive software architectures, distributed systems, virtual machines, middleware for mobile and distributed computing. \n \nMy work has been published in numerous leading technical conferences, workshops and symposia proceedings. I am a regular speaker and panelist at premium international industry and scientific conferences. I have received several prestigious awards and honors for my work and technical contributions, the most recent ones include the Best Paper Award from IEEE RTAS 2012 and Best Student Paper Award from ACM WWW 2012. My work has been quoted by the press and media, as well as chaired and served as a technical program committee member of multiple industry and scientific conferences. I am a member of ACM and IEEE societies. Experience Staff Research Scientist Intel Corporation – Intel Labs, Systems and Software Research June 2014  – Present (1 year 3 months) – Innovate, lead, and conduct research and development in systems software, mobile platforms and services, mobile computing, distributed systems, embedded systems, and persistent memories Senior Research Scientist Deutsche Telekom Silicon Valley Innovation Center, USA 2008  –  2014  (6 years) – Invented and implemented cutting-edge mobile systems, applications and services \n– Proven track record of success and recognition in building novel solutions that shape the emerging trends in mobile infrastructure and services sectors \n– Primary focus is on the development of open and programmable mobile platforms (e.g., Android) and novel information technology services – Developed the vision and goals, novel technologies, systems and services, delivering significant business impact for Deutsche Telekom \n– Led and conducted research and development of mobile systems, apps and services \n– Invented and filled 8 patents to advance the state-of-the-art in services and mobile platforms \n– Received internationally prestigious awards and honors for my innovations and technical contributions; Best Paper Award at IEEE RTAS 2012, Best Student Paper Award at ACM WWW 2012, DT Innovation Day 2010 Award \n– My work attracted the attention of press and media \n– Interviewed by BBC and O'Reilly Media for my work and technical contributions on mobile device battery drainage \n– Regular speaker and panelist at premium international industry and scientific conferences Ph.D. – Research and Teaching Assistant ETH Zurich (Swiss Federal Institute of Technology Zurich), Switzerland October 2002  –  December 2007  (5 years 3 months) – My dissertation research is focused on the problem of dynamic adaptation of applications through dynamic bytecode manipulations using a variety of techniques.  \n– Developed PROSE, a system that performs controlled, systematic, and efficient modification of the code of running Java applications without requiring them to be shut down. \n– PROSE Open Source Project: http://prose.ethz.ch, Download: SourceForge.net => http://sourceforge.net/projects/jprose – Total # of downloads: 3,348. Engineering Intern Google Inc., Mountain View, California, USA July 2004  –  October 2004  (4 months) While working on my PhD, in the summer of 2004, I was selected for a summer internship with Google Inc. in Mountain View, California, USA. There I had the opportunity to experience a period of actual work together with the Google team in California, USA. I have been exposed to the leading, cutting-edge and innovative technologies Google employs, which proved to be a great challenge and an extraordinary experience for me. Software Engineer – Java and C/C++ Developer Caatoosee Ltd., Timisoara, Romania September 2000  –  August 2002  (2 years) – Search Engine, 2000 – 2001 \nWorked on a module of a Search Engine, called the “Managing Module”, that was part of a distributed web app and its purpose was to offer companies strong facilities of storage, indexing, searching, and highlighting of web docs. The “Managing Module” is responsible for the management of the whole crawling and indexing system, and offers the user a way to control the functionality of the entire system. \n \n– IQ-Server, 2001 – 2002 \nDesigned and developed two modules of the IQ-Server project that were part of an advanced dynamic approach to information logistics and its goal was to offer companies fast access to all relevant information, irrespective of the kinds of data sources. \n--- Designed and implemented the “NTFS2K-Agent (Native File System 2000 Agent)” that monitors the changes made to the files or directories on an NTFS 5.0 volume.  \n--- Designed and implemented a translator from Microsoft PowerPoint documents to XHTML formats. Engineering Intern WebQuote (now called EmpactSoftware), Los Gatos, California, USA July 2000  –  August 2000  (2 months) One of 11 students from all over Romania selected for an internship in Silicon Valley, USA. \n \n– Sales Process Automation for PCBs \nDesigned and developed the GenCAM component for a software infrastructure that automates the sales process of printed circuit boards (PCBs). The GenCAM component enables the automatic translation of CAD file formats of type GenCAM, which include all information about a PCB, into quotable formats. The GenCAM file is parsed, generating the specification fields for PCBs that impact costs (e.g., dimensions, layer stacking, vias, surface mount pads, trace and gap, gold fingers, components, routing, technology, fabrication and testing), and then automatically converted into quotable formats that draw costs from a price model. Summer Intern Arpechim, Pitesti, Romania July 1999  –  August 1999  (2 months) Summer intern - internship focus on DBMS (SAP R/3) Staff Research Scientist Intel Corporation – Intel Labs, Systems and Software Research June 2014  – Present (1 year 3 months) – Innovate, lead, and conduct research and development in systems software, mobile platforms and services, mobile computing, distributed systems, embedded systems, and persistent memories Staff Research Scientist Intel Corporation – Intel Labs, Systems and Software Research June 2014  – Present (1 year 3 months) – Innovate, lead, and conduct research and development in systems software, mobile platforms and services, mobile computing, distributed systems, embedded systems, and persistent memories Senior Research Scientist Deutsche Telekom Silicon Valley Innovation Center, USA 2008  –  2014  (6 years) – Invented and implemented cutting-edge mobile systems, applications and services \n– Proven track record of success and recognition in building novel solutions that shape the emerging trends in mobile infrastructure and services sectors \n– Primary focus is on the development of open and programmable mobile platforms (e.g., Android) and novel information technology services – Developed the vision and goals, novel technologies, systems and services, delivering significant business impact for Deutsche Telekom \n– Led and conducted research and development of mobile systems, apps and services \n– Invented and filled 8 patents to advance the state-of-the-art in services and mobile platforms \n– Received internationally prestigious awards and honors for my innovations and technical contributions; Best Paper Award at IEEE RTAS 2012, Best Student Paper Award at ACM WWW 2012, DT Innovation Day 2010 Award \n– My work attracted the attention of press and media \n– Interviewed by BBC and O'Reilly Media for my work and technical contributions on mobile device battery drainage \n– Regular speaker and panelist at premium international industry and scientific conferences Senior Research Scientist Deutsche Telekom Silicon Valley Innovation Center, USA 2008  –  2014  (6 years) – Invented and implemented cutting-edge mobile systems, applications and services \n– Proven track record of success and recognition in building novel solutions that shape the emerging trends in mobile infrastructure and services sectors \n– Primary focus is on the development of open and programmable mobile platforms (e.g., Android) and novel information technology services – Developed the vision and goals, novel technologies, systems and services, delivering significant business impact for Deutsche Telekom \n– Led and conducted research and development of mobile systems, apps and services \n– Invented and filled 8 patents to advance the state-of-the-art in services and mobile platforms \n– Received internationally prestigious awards and honors for my innovations and technical contributions; Best Paper Award at IEEE RTAS 2012, Best Student Paper Award at ACM WWW 2012, DT Innovation Day 2010 Award \n– My work attracted the attention of press and media \n– Interviewed by BBC and O'Reilly Media for my work and technical contributions on mobile device battery drainage \n– Regular speaker and panelist at premium international industry and scientific conferences Ph.D. – Research and Teaching Assistant ETH Zurich (Swiss Federal Institute of Technology Zurich), Switzerland October 2002  –  December 2007  (5 years 3 months) – My dissertation research is focused on the problem of dynamic adaptation of applications through dynamic bytecode manipulations using a variety of techniques.  \n– Developed PROSE, a system that performs controlled, systematic, and efficient modification of the code of running Java applications without requiring them to be shut down. \n– PROSE Open Source Project: http://prose.ethz.ch, Download: SourceForge.net => http://sourceforge.net/projects/jprose – Total # of downloads: 3,348. Ph.D. – Research and Teaching Assistant ETH Zurich (Swiss Federal Institute of Technology Zurich), Switzerland October 2002  –  December 2007  (5 years 3 months) – My dissertation research is focused on the problem of dynamic adaptation of applications through dynamic bytecode manipulations using a variety of techniques.  \n– Developed PROSE, a system that performs controlled, systematic, and efficient modification of the code of running Java applications without requiring them to be shut down. \n– PROSE Open Source Project: http://prose.ethz.ch, Download: SourceForge.net => http://sourceforge.net/projects/jprose – Total # of downloads: 3,348. Engineering Intern Google Inc., Mountain View, California, USA July 2004  –  October 2004  (4 months) While working on my PhD, in the summer of 2004, I was selected for a summer internship with Google Inc. in Mountain View, California, USA. There I had the opportunity to experience a period of actual work together with the Google team in California, USA. I have been exposed to the leading, cutting-edge and innovative technologies Google employs, which proved to be a great challenge and an extraordinary experience for me. Engineering Intern Google Inc., Mountain View, California, USA July 2004  –  October 2004  (4 months) While working on my PhD, in the summer of 2004, I was selected for a summer internship with Google Inc. in Mountain View, California, USA. There I had the opportunity to experience a period of actual work together with the Google team in California, USA. I have been exposed to the leading, cutting-edge and innovative technologies Google employs, which proved to be a great challenge and an extraordinary experience for me. Software Engineer – Java and C/C++ Developer Caatoosee Ltd., Timisoara, Romania September 2000  –  August 2002  (2 years) – Search Engine, 2000 – 2001 \nWorked on a module of a Search Engine, called the “Managing Module”, that was part of a distributed web app and its purpose was to offer companies strong facilities of storage, indexing, searching, and highlighting of web docs. The “Managing Module” is responsible for the management of the whole crawling and indexing system, and offers the user a way to control the functionality of the entire system. \n \n– IQ-Server, 2001 – 2002 \nDesigned and developed two modules of the IQ-Server project that were part of an advanced dynamic approach to information logistics and its goal was to offer companies fast access to all relevant information, irrespective of the kinds of data sources. \n--- Designed and implemented the “NTFS2K-Agent (Native File System 2000 Agent)” that monitors the changes made to the files or directories on an NTFS 5.0 volume.  \n--- Designed and implemented a translator from Microsoft PowerPoint documents to XHTML formats. Software Engineer – Java and C/C++ Developer Caatoosee Ltd., Timisoara, Romania September 2000  –  August 2002  (2 years) – Search Engine, 2000 – 2001 \nWorked on a module of a Search Engine, called the “Managing Module”, that was part of a distributed web app and its purpose was to offer companies strong facilities of storage, indexing, searching, and highlighting of web docs. The “Managing Module” is responsible for the management of the whole crawling and indexing system, and offers the user a way to control the functionality of the entire system. \n \n– IQ-Server, 2001 – 2002 \nDesigned and developed two modules of the IQ-Server project that were part of an advanced dynamic approach to information logistics and its goal was to offer companies fast access to all relevant information, irrespective of the kinds of data sources. \n--- Designed and implemented the “NTFS2K-Agent (Native File System 2000 Agent)” that monitors the changes made to the files or directories on an NTFS 5.0 volume.  \n--- Designed and implemented a translator from Microsoft PowerPoint documents to XHTML formats. Engineering Intern WebQuote (now called EmpactSoftware), Los Gatos, California, USA July 2000  –  August 2000  (2 months) One of 11 students from all over Romania selected for an internship in Silicon Valley, USA. \n \n– Sales Process Automation for PCBs \nDesigned and developed the GenCAM component for a software infrastructure that automates the sales process of printed circuit boards (PCBs). The GenCAM component enables the automatic translation of CAD file formats of type GenCAM, which include all information about a PCB, into quotable formats. The GenCAM file is parsed, generating the specification fields for PCBs that impact costs (e.g., dimensions, layer stacking, vias, surface mount pads, trace and gap, gold fingers, components, routing, technology, fabrication and testing), and then automatically converted into quotable formats that draw costs from a price model. Engineering Intern WebQuote (now called EmpactSoftware), Los Gatos, California, USA July 2000  –  August 2000  (2 months) One of 11 students from all over Romania selected for an internship in Silicon Valley, USA. \n \n– Sales Process Automation for PCBs \nDesigned and developed the GenCAM component for a software infrastructure that automates the sales process of printed circuit boards (PCBs). The GenCAM component enables the automatic translation of CAD file formats of type GenCAM, which include all information about a PCB, into quotable formats. The GenCAM file is parsed, generating the specification fields for PCBs that impact costs (e.g., dimensions, layer stacking, vias, surface mount pads, trace and gap, gold fingers, components, routing, technology, fabrication and testing), and then automatically converted into quotable formats that draw costs from a price model. Summer Intern Arpechim, Pitesti, Romania July 1999  –  August 1999  (2 months) Summer intern - internship focus on DBMS (SAP R/3) Summer Intern Arpechim, Pitesti, Romania July 1999  –  August 1999  (2 months) Summer intern - internship focus on DBMS (SAP R/3) Languages   Skills Skills     Education University of California, Berkeley Project Management Professional (PMP) 2010  – 2010 Project Management, Integration, Scope, Planning, Cost, Quality, Human Resources, Communications, Risk, Procurement, Professional Responsibility, and Leadership Skills ETH Zurich (Swiss Federal Institute of Technology Zurich), Switzerland Ph.D. – Dr. sc. ETH Zurich, Switzerland,  Computer Science 2002  – 2007 Systems Research Group \n– Developed an infrastructure that supports software adaptation by extending applications at runtime: PROSE (PROgrammable extenSions of sErvices) (http://prose.ethz.ch) \n– I defended my PhD dissertation entitled \"Controlled, Systematic, and Efficient Code Replacement for Running Java Programs\" on Dec 12, 2007 at ETH Zurich.It was accepted on the recommendation of Prof. Gustavo Alonso (advisor), Prof. Thomas Gross and Prof. Timothy Roscoe (co-advisors). \n– Involved in the National Centres of Competence in Research, Mobile Information and Communication Systems (NCCR MICS), IP8 (System and Software Architecture) project (http://www.mics.org) \n \nTeaching Assistant in the Department of Computer Science, ETH Zurich \n– Computer Networks \n– Parallel and Distributed Databases \n– System Software \n– Information and Communication Systems \n– Supervised four post graduate level theses Activities and Societies:  Teaching and Research Assistant ,  NCCR MICS ,  Scientific Reviewer for EuroSys 2006 ,  PC Member for VMIL 2008 \"Politehnica\" University of Timisoara, Romania, Faculty of Automation and Computer Science Bachelor of Science (Computer Science Major),  Computer Science 1996  – 2001 – High-Performance Scholarship – Received the High-Performance Scholarship by the “Politehnica” University of Timisoara, Faculty of Automation and Computer Science, Department of Computer Science for superior academic performance during all 5 years of my universities studies – GPA 9.10 (on a scale from 1 to 10). \n– Graduation Thesis: “The Managing Module for a Search Engine”, GPA 10 on a scale from 1 to 10 \n– Beginning 2000 - Motorola Grant at the \"Politehnica\" University of Timisoara, Romania - \"Human face recognition\" project \n– September 1998 - June 1999 - leader of a 10-member team working on instruction execution in digital systems University of California, Berkeley Project Management Professional (PMP) 2010  – 2010 Project Management, Integration, Scope, Planning, Cost, Quality, Human Resources, Communications, Risk, Procurement, Professional Responsibility, and Leadership Skills University of California, Berkeley Project Management Professional (PMP) 2010  – 2010 Project Management, Integration, Scope, Planning, Cost, Quality, Human Resources, Communications, Risk, Procurement, Professional Responsibility, and Leadership Skills University of California, Berkeley Project Management Professional (PMP) 2010  – 2010 Project Management, Integration, Scope, Planning, Cost, Quality, Human Resources, Communications, Risk, Procurement, Professional Responsibility, and Leadership Skills ETH Zurich (Swiss Federal Institute of Technology Zurich), Switzerland Ph.D. – Dr. sc. ETH Zurich, Switzerland,  Computer Science 2002  – 2007 Systems Research Group \n– Developed an infrastructure that supports software adaptation by extending applications at runtime: PROSE (PROgrammable extenSions of sErvices) (http://prose.ethz.ch) \n– I defended my PhD dissertation entitled \"Controlled, Systematic, and Efficient Code Replacement for Running Java Programs\" on Dec 12, 2007 at ETH Zurich.It was accepted on the recommendation of Prof. Gustavo Alonso (advisor), Prof. Thomas Gross and Prof. Timothy Roscoe (co-advisors). \n– Involved in the National Centres of Competence in Research, Mobile Information and Communication Systems (NCCR MICS), IP8 (System and Software Architecture) project (http://www.mics.org) \n \nTeaching Assistant in the Department of Computer Science, ETH Zurich \n– Computer Networks \n– Parallel and Distributed Databases \n– System Software \n– Information and Communication Systems \n– Supervised four post graduate level theses Activities and Societies:  Teaching and Research Assistant ,  NCCR MICS ,  Scientific Reviewer for EuroSys 2006 ,  PC Member for VMIL 2008 ETH Zurich (Swiss Federal Institute of Technology Zurich), Switzerland Ph.D. – Dr. sc. ETH Zurich, Switzerland,  Computer Science 2002  – 2007 Systems Research Group \n– Developed an infrastructure that supports software adaptation by extending applications at runtime: PROSE (PROgrammable extenSions of sErvices) (http://prose.ethz.ch) \n– I defended my PhD dissertation entitled \"Controlled, Systematic, and Efficient Code Replacement for Running Java Programs\" on Dec 12, 2007 at ETH Zurich.It was accepted on the recommendation of Prof. Gustavo Alonso (advisor), Prof. Thomas Gross and Prof. Timothy Roscoe (co-advisors). \n– Involved in the National Centres of Competence in Research, Mobile Information and Communication Systems (NCCR MICS), IP8 (System and Software Architecture) project (http://www.mics.org) \n \nTeaching Assistant in the Department of Computer Science, ETH Zurich \n– Computer Networks \n– Parallel and Distributed Databases \n– System Software \n– Information and Communication Systems \n– Supervised four post graduate level theses Activities and Societies:  Teaching and Research Assistant ,  NCCR MICS ,  Scientific Reviewer for EuroSys 2006 ,  PC Member for VMIL 2008 ETH Zurich (Swiss Federal Institute of Technology Zurich), Switzerland Ph.D. – Dr. sc. ETH Zurich, Switzerland,  Computer Science 2002  – 2007 Systems Research Group \n– Developed an infrastructure that supports software adaptation by extending applications at runtime: PROSE (PROgrammable extenSions of sErvices) (http://prose.ethz.ch) \n– I defended my PhD dissertation entitled \"Controlled, Systematic, and Efficient Code Replacement for Running Java Programs\" on Dec 12, 2007 at ETH Zurich.It was accepted on the recommendation of Prof. Gustavo Alonso (advisor), Prof. Thomas Gross and Prof. Timothy Roscoe (co-advisors). \n– Involved in the National Centres of Competence in Research, Mobile Information and Communication Systems (NCCR MICS), IP8 (System and Software Architecture) project (http://www.mics.org) \n \nTeaching Assistant in the Department of Computer Science, ETH Zurich \n– Computer Networks \n– Parallel and Distributed Databases \n– System Software \n– Information and Communication Systems \n– Supervised four post graduate level theses Activities and Societies:  Teaching and Research Assistant ,  NCCR MICS ,  Scientific Reviewer for EuroSys 2006 ,  PC Member for VMIL 2008 \"Politehnica\" University of Timisoara, Romania, Faculty of Automation and Computer Science Bachelor of Science (Computer Science Major),  Computer Science 1996  – 2001 – High-Performance Scholarship – Received the High-Performance Scholarship by the “Politehnica” University of Timisoara, Faculty of Automation and Computer Science, Department of Computer Science for superior academic performance during all 5 years of my universities studies – GPA 9.10 (on a scale from 1 to 10). \n– Graduation Thesis: “The Managing Module for a Search Engine”, GPA 10 on a scale from 1 to 10 \n– Beginning 2000 - Motorola Grant at the \"Politehnica\" University of Timisoara, Romania - \"Human face recognition\" project \n– September 1998 - June 1999 - leader of a 10-member team working on instruction execution in digital systems \"Politehnica\" University of Timisoara, Romania, Faculty of Automation and Computer Science Bachelor of Science (Computer Science Major),  Computer Science 1996  – 2001 – High-Performance Scholarship – Received the High-Performance Scholarship by the “Politehnica” University of Timisoara, Faculty of Automation and Computer Science, Department of Computer Science for superior academic performance during all 5 years of my universities studies – GPA 9.10 (on a scale from 1 to 10). \n– Graduation Thesis: “The Managing Module for a Search Engine”, GPA 10 on a scale from 1 to 10 \n– Beginning 2000 - Motorola Grant at the \"Politehnica\" University of Timisoara, Romania - \"Human face recognition\" project \n– September 1998 - June 1999 - leader of a 10-member team working on instruction execution in digital systems \"Politehnica\" University of Timisoara, Romania, Faculty of Automation and Computer Science Bachelor of Science (Computer Science Major),  Computer Science 1996  – 2001 – High-Performance Scholarship – Received the High-Performance Scholarship by the “Politehnica” University of Timisoara, Faculty of Automation and Computer Science, Department of Computer Science for superior academic performance during all 5 years of my universities studies – GPA 9.10 (on a scale from 1 to 10). \n– Graduation Thesis: “The Managing Module for a Search Engine”, GPA 10 on a scale from 1 to 10 \n– Beginning 2000 - Motorola Grant at the \"Politehnica\" University of Timisoara, Romania - \"Human face recognition\" project \n– September 1998 - June 1999 - leader of a 10-member team working on instruction execution in digital systems Honors & Awards Interviewed by O’Reilly Media May 2013 My work has attracted the attention of the American media – Interviewed by O’Reilly Media about my work on mobile browsing energy consumption (my original report was titled \"Who Killed My Battery\"). Link to the O’Reilly Media article: \"How Web Pages Can Extend (or Drain) Mobile Device Battery Life\" – http://programming.oreilly.com/2013/05/measuring-the-impact-of-web-page-structures-on-battery-usage-in-mobile-devices.html Interviewed by BBC February 2013 Interviewed by BBC for my work and investigation I did in collaboration with Prof. Dan Boneh’s group from Stanford University on mobile device battery drainage (my original report was titled \"Who Killed My Battery\"). The work was picked up by BBC.com as part of Roland Pease’s series on the future of mobile phones. Link to the BBC article: \"What is killing smartphones?\" – http://www.bbc.com/future/story/20130227-what-is-killing-smartphones Best Student Paper Award April 2012 Awarded the Best Student Paper Award at ACM World Wide Web Conference (WWW 2012) – premium conference in Internet technologies in the world. Acceptance rate is 12% (out of 885 full papers submissions). Best Paper Award April 2012 Awarded the Best Paper Award at IEEE Real-Time and Embedded Technology and Applications Symposium (RTAS 2012) – premium venue in real-time & embedded systems worldwide. Acceptance rate is about 20%. Alien of Extraordinary Ability Honor 2012 Honored the Extraordinary Ability Priority Worker (EB1-1) Green Card – High honor to only those individuals in that small percentage who have risen to the top of their field of endeavor. Demonstrated extraordinary ability in computer science through sustained national and international acclaim; Achievements recognized in the field. \n Deutsche Telekom Innovation Day 2010 Award 2010 Awarded for the “Connected Life & Drive” Project selected as one of top three innovation projects for Deutsche Telekom Innovation Day 2010, DT’s top event for innovation trends and developments Google Summer Internship 2004 Selected for a summer internship with Google Inc. in Mountain View, California, USA. High-Performance Scholarship 1996 – 2001 Received the High-Performance Scholarship by the “Politehnica” University of Timisoara, Department of Computer Science for superior academic performance during all 5 years of my university studies – GPA 9.10 (on a scale from 1 to 10). American Romanian Student Internship Program (A.R.S.I.P.) 2000 Selected together with 10 other students from all over Romania for an internship organized in association with high-technology companies from Silicon Valley, California, USA. \n \nLinks: 1) http://www.casaromana.org/arsip-2003.htm, 2) http://www.casaromana.org/arsip-2004.htm, 3) http://www.casaromana.org/programul-arsip.htm 5th place in the national chess championship 1991 Interviewed by O’Reilly Media May 2013 My work has attracted the attention of the American media – Interviewed by O’Reilly Media about my work on mobile browsing energy consumption (my original report was titled \"Who Killed My Battery\"). Link to the O’Reilly Media article: \"How Web Pages Can Extend (or Drain) Mobile Device Battery Life\" – http://programming.oreilly.com/2013/05/measuring-the-impact-of-web-page-structures-on-battery-usage-in-mobile-devices.html Interviewed by O’Reilly Media May 2013 My work has attracted the attention of the American media – Interviewed by O’Reilly Media about my work on mobile browsing energy consumption (my original report was titled \"Who Killed My Battery\"). Link to the O’Reilly Media article: \"How Web Pages Can Extend (or Drain) Mobile Device Battery Life\" – http://programming.oreilly.com/2013/05/measuring-the-impact-of-web-page-structures-on-battery-usage-in-mobile-devices.html Interviewed by O’Reilly Media May 2013 My work has attracted the attention of the American media – Interviewed by O’Reilly Media about my work on mobile browsing energy consumption (my original report was titled \"Who Killed My Battery\"). Link to the O’Reilly Media article: \"How Web Pages Can Extend (or Drain) Mobile Device Battery Life\" – http://programming.oreilly.com/2013/05/measuring-the-impact-of-web-page-structures-on-battery-usage-in-mobile-devices.html Interviewed by BBC February 2013 Interviewed by BBC for my work and investigation I did in collaboration with Prof. Dan Boneh’s group from Stanford University on mobile device battery drainage (my original report was titled \"Who Killed My Battery\"). The work was picked up by BBC.com as part of Roland Pease’s series on the future of mobile phones. Link to the BBC article: \"What is killing smartphones?\" – http://www.bbc.com/future/story/20130227-what-is-killing-smartphones Interviewed by BBC February 2013 Interviewed by BBC for my work and investigation I did in collaboration with Prof. Dan Boneh’s group from Stanford University on mobile device battery drainage (my original report was titled \"Who Killed My Battery\"). The work was picked up by BBC.com as part of Roland Pease’s series on the future of mobile phones. Link to the BBC article: \"What is killing smartphones?\" – http://www.bbc.com/future/story/20130227-what-is-killing-smartphones Interviewed by BBC February 2013 Interviewed by BBC for my work and investigation I did in collaboration with Prof. Dan Boneh’s group from Stanford University on mobile device battery drainage (my original report was titled \"Who Killed My Battery\"). The work was picked up by BBC.com as part of Roland Pease’s series on the future of mobile phones. Link to the BBC article: \"What is killing smartphones?\" – http://www.bbc.com/future/story/20130227-what-is-killing-smartphones Best Student Paper Award April 2012 Awarded the Best Student Paper Award at ACM World Wide Web Conference (WWW 2012) – premium conference in Internet technologies in the world. Acceptance rate is 12% (out of 885 full papers submissions). Best Student Paper Award April 2012 Awarded the Best Student Paper Award at ACM World Wide Web Conference (WWW 2012) – premium conference in Internet technologies in the world. Acceptance rate is 12% (out of 885 full papers submissions). Best Student Paper Award April 2012 Awarded the Best Student Paper Award at ACM World Wide Web Conference (WWW 2012) – premium conference in Internet technologies in the world. Acceptance rate is 12% (out of 885 full papers submissions). Best Paper Award April 2012 Awarded the Best Paper Award at IEEE Real-Time and Embedded Technology and Applications Symposium (RTAS 2012) – premium venue in real-time & embedded systems worldwide. Acceptance rate is about 20%. Best Paper Award April 2012 Awarded the Best Paper Award at IEEE Real-Time and Embedded Technology and Applications Symposium (RTAS 2012) – premium venue in real-time & embedded systems worldwide. Acceptance rate is about 20%. Best Paper Award April 2012 Awarded the Best Paper Award at IEEE Real-Time and Embedded Technology and Applications Symposium (RTAS 2012) – premium venue in real-time & embedded systems worldwide. Acceptance rate is about 20%. Alien of Extraordinary Ability Honor 2012 Honored the Extraordinary Ability Priority Worker (EB1-1) Green Card – High honor to only those individuals in that small percentage who have risen to the top of their field of endeavor. Demonstrated extraordinary ability in computer science through sustained national and international acclaim; Achievements recognized in the field. \n Alien of Extraordinary Ability Honor 2012 Honored the Extraordinary Ability Priority Worker (EB1-1) Green Card – High honor to only those individuals in that small percentage who have risen to the top of their field of endeavor. Demonstrated extraordinary ability in computer science through sustained national and international acclaim; Achievements recognized in the field. \n Alien of Extraordinary Ability Honor 2012 Honored the Extraordinary Ability Priority Worker (EB1-1) Green Card – High honor to only those individuals in that small percentage who have risen to the top of their field of endeavor. Demonstrated extraordinary ability in computer science through sustained national and international acclaim; Achievements recognized in the field. \n Deutsche Telekom Innovation Day 2010 Award 2010 Awarded for the “Connected Life & Drive” Project selected as one of top three innovation projects for Deutsche Telekom Innovation Day 2010, DT’s top event for innovation trends and developments Deutsche Telekom Innovation Day 2010 Award 2010 Awarded for the “Connected Life & Drive” Project selected as one of top three innovation projects for Deutsche Telekom Innovation Day 2010, DT’s top event for innovation trends and developments Deutsche Telekom Innovation Day 2010 Award 2010 Awarded for the “Connected Life & Drive” Project selected as one of top three innovation projects for Deutsche Telekom Innovation Day 2010, DT’s top event for innovation trends and developments Google Summer Internship 2004 Selected for a summer internship with Google Inc. in Mountain View, California, USA. Google Summer Internship 2004 Selected for a summer internship with Google Inc. in Mountain View, California, USA. Google Summer Internship 2004 Selected for a summer internship with Google Inc. in Mountain View, California, USA. High-Performance Scholarship 1996 – 2001 Received the High-Performance Scholarship by the “Politehnica” University of Timisoara, Department of Computer Science for superior academic performance during all 5 years of my university studies – GPA 9.10 (on a scale from 1 to 10). High-Performance Scholarship 1996 – 2001 Received the High-Performance Scholarship by the “Politehnica” University of Timisoara, Department of Computer Science for superior academic performance during all 5 years of my university studies – GPA 9.10 (on a scale from 1 to 10). High-Performance Scholarship 1996 – 2001 Received the High-Performance Scholarship by the “Politehnica” University of Timisoara, Department of Computer Science for superior academic performance during all 5 years of my university studies – GPA 9.10 (on a scale from 1 to 10). American Romanian Student Internship Program (A.R.S.I.P.) 2000 Selected together with 10 other students from all over Romania for an internship organized in association with high-technology companies from Silicon Valley, California, USA. \n \nLinks: 1) http://www.casaromana.org/arsip-2003.htm, 2) http://www.casaromana.org/arsip-2004.htm, 3) http://www.casaromana.org/programul-arsip.htm American Romanian Student Internship Program (A.R.S.I.P.) 2000 Selected together with 10 other students from all over Romania for an internship organized in association with high-technology companies from Silicon Valley, California, USA. \n \nLinks: 1) http://www.casaromana.org/arsip-2003.htm, 2) http://www.casaromana.org/arsip-2004.htm, 3) http://www.casaromana.org/programul-arsip.htm American Romanian Student Internship Program (A.R.S.I.P.) 2000 Selected together with 10 other students from all over Romania for an internship organized in association with high-technology companies from Silicon Valley, California, USA. \n \nLinks: 1) http://www.casaromana.org/arsip-2003.htm, 2) http://www.casaromana.org/arsip-2004.htm, 3) http://www.casaromana.org/programul-arsip.htm 5th place in the national chess championship 1991 5th place in the national chess championship 1991 5th place in the national chess championship 1991 ", "Summary I was working on JIT of Ct for almost 5 years. Ct is a programming model of nested-data parallel and deterministic task parallel programming. \nI switch to big data research now. Main focus point is Hadoop software stack optimization and customization. Specialties:compilation, cloud computing, big data, application optimization, parallel programming Summary I was working on JIT of Ct for almost 5 years. Ct is a programming model of nested-data parallel and deterministic task parallel programming. \nI switch to big data research now. Main focus point is Hadoop software stack optimization and customization. Specialties:compilation, cloud computing, big data, application optimization, parallel programming I was working on JIT of Ct for almost 5 years. Ct is a programming model of nested-data parallel and deterministic task parallel programming. \nI switch to big data research now. Main focus point is Hadoop software stack optimization and customization. Specialties:compilation, cloud computing, big data, application optimization, parallel programming I was working on JIT of Ct for almost 5 years. Ct is a programming model of nested-data parallel and deterministic task parallel programming. \nI switch to big data research now. Main focus point is Hadoop software stack optimization and customization. Specialties:compilation, cloud computing, big data, application optimization, parallel programming Experience research scientist Intel Corporation December 2010  – Present (4 years 9 months) China I switch to investigate big data. More specifically, I am focus on Hadoop software stack optimization and customization. research scientist Intel Corporation July 2006  –  December 2010  (4 years 6 months) China I worked for a data parallel programming model. I took responsibility of compiler of it. More specifically, I took responsibility of high level optimization of data parallel applications. research scientist Intel Corporation December 2010  – Present (4 years 9 months) China I switch to investigate big data. More specifically, I am focus on Hadoop software stack optimization and customization. research scientist Intel Corporation December 2010  – Present (4 years 9 months) China I switch to investigate big data. More specifically, I am focus on Hadoop software stack optimization and customization. research scientist Intel Corporation July 2006  –  December 2010  (4 years 6 months) China I worked for a data parallel programming model. I took responsibility of compiler of it. More specifically, I took responsibility of high level optimization of data parallel applications. research scientist Intel Corporation July 2006  –  December 2010  (4 years 6 months) China I worked for a data parallel programming model. I took responsibility of compiler of it. More specifically, I took responsibility of high level optimization of data parallel applications. Skills Hadoop Parallel Programming Cloud Computing Big Data Skills  Hadoop Parallel Programming Cloud Computing Big Data Hadoop Parallel Programming Cloud Computing Big Data Hadoop Parallel Programming Cloud Computing Big Data Education University of Science and Technology of China phd,  computer architecture 2001  – 2006 University of Science and Technology of China bachelor,  computer scientist 1996  – 2001 University of Science and Technology of China phd,  computer architecture 2001  – 2006 University of Science and Technology of China phd,  computer architecture 2001  – 2006 University of Science and Technology of China phd,  computer architecture 2001  – 2006 University of Science and Technology of China bachelor,  computer scientist 1996  – 2001 University of Science and Technology of China bachelor,  computer scientist 1996  – 2001 University of Science and Technology of China bachelor,  computer scientist 1996  – 2001 ", "Skills Parallel Computing C++ High Performance... Transactional Memory Parallel Programming Software Design Algorithms Parallel Algorithms Software Engineering Compilers Distributed Systems Programming Computer Architecture Object Oriented Design Computer Science Java Debugging C Perl Embedded Software Embedded Systems Python System Architecture Machine Learning See 9+     See less Skills  Parallel Computing C++ High Performance... Transactional Memory Parallel Programming Software Design Algorithms Parallel Algorithms Software Engineering Compilers Distributed Systems Programming Computer Architecture Object Oriented Design Computer Science Java Debugging C Perl Embedded Software Embedded Systems Python System Architecture Machine Learning See 9+     See less Parallel Computing C++ High Performance... Transactional Memory Parallel Programming Software Design Algorithms Parallel Algorithms Software Engineering Compilers Distributed Systems Programming Computer Architecture Object Oriented Design Computer Science Java Debugging C Perl Embedded Software Embedded Systems Python System Architecture Machine Learning See 9+     See less Parallel Computing C++ High Performance... Transactional Memory Parallel Programming Software Design Algorithms Parallel Algorithms Software Engineering Compilers Distributed Systems Programming Computer Architecture Object Oriented Design Computer Science Java Debugging C Perl Embedded Software Embedded Systems Python System Architecture Machine Learning See 9+     See less ", "Languages Swedish Native or bilingual proficiency English Native or bilingual proficiency French Limited working proficiency Swedish Native or bilingual proficiency English Native or bilingual proficiency French Limited working proficiency Swedish Native or bilingual proficiency English Native or bilingual proficiency French Limited working proficiency Native or bilingual proficiency Native or bilingual proficiency Limited working proficiency Skills IEEE 802.11 Simulations Links Wireless Cellular Communications WiFi Algorithms Embedded Systems RF Wireless Networking LTE Semiconductors SoC IC Skills  IEEE 802.11 Simulations Links Wireless Cellular Communications WiFi Algorithms Embedded Systems RF Wireless Networking LTE Semiconductors SoC IC IEEE 802.11 Simulations Links Wireless Cellular Communications WiFi Algorithms Embedded Systems RF Wireless Networking LTE Semiconductors SoC IC IEEE 802.11 Simulations Links Wireless Cellular Communications WiFi Algorithms Embedded Systems RF Wireless Networking LTE Semiconductors SoC IC Education Stanford University Ph.D. 2004 KTH Royal Institute of Technology 2000  – 2003 University of Chicago Bachelor of Science (B.Sc.) Stanford University Ph.D. 2004 Stanford University Ph.D. 2004 Stanford University Ph.D. 2004 KTH Royal Institute of Technology 2000  – 2003 KTH Royal Institute of Technology 2000  – 2003 KTH Royal Institute of Technology 2000  – 2003 University of Chicago Bachelor of Science (B.Sc.) University of Chicago Bachelor of Science (B.Sc.) University of Chicago Bachelor of Science (B.Sc.) ", "Skills Machine Learning Applied Mathematics Software Engineering Pattern Recognition Algorithms Signal Processing Digital Signal... Skills  Machine Learning Applied Mathematics Software Engineering Pattern Recognition Algorithms Signal Processing Digital Signal... Machine Learning Applied Mathematics Software Engineering Pattern Recognition Algorithms Signal Processing Digital Signal... Machine Learning Applied Mathematics Software Engineering Pattern Recognition Algorithms Signal Processing Digital Signal... "]}