{"position": "Research Scientist Intern", "company": "Intel Corporation", "profiles": ["Experience Researcher UC Irvine September 2014  – Present (1 year) Donald Bren School of Information and Computer Sciences Graphics and Parallel Processing Intern Intel Corporation June 2013  –  September 2014  (1 year 4 months) Santa Clara, CA Developing infrastructure software solutions for performance analysis of hardware-accelerated media codec and processing: Application development in C/C++ environment, to provide Intel graphics-driver test environment. This is a cross-platform application, supported in Windows, Linux, and Android. \n \nResearch of forward-looking methods: Research and analysis of video quality metrics based on human visual perception. These metrics are utilized by the performance analysis application to verify hardware-accelerated decode/encode and processing. Research Scientist Intern Intel Corporation September 2012  –  January 2013  (5 months) Santa Clara, CA High Dynamic Range (HDR) Imaging: A fast and efficient algorithm to retrieve the real irradiance in multi-exposure images was the primary goal of this research. Delivering a framework for HDR imaging, acquisition, irradiance retrieval, compression and tone-mapping. \n \nViewing Interpolation: Given multiple images of a 3D scene captured by a set of cameras, generated a synthetic view of a scene as it would appear from a new viewpoint. Researcher UC Davis January 2011  –  September 2012  (1 year 9 months) NSF Center for Bio-photonic Science and technology (CBST) Cell Counter Algorithm for Cell-Phone Microscope: Image segmentation and pattern recognition, \nalgorithm development to perform blood cell counting; this algorithm is a part of cell-phone microscope \ndeveloped in CBST. Developed a fuzzy logic based method to enhance counting algorithms that enables identifying overlapped cells. \n \nMicro-Lens Distortion Corrector: An Automatic image distortion correction algorithm, which \nautomatically finds the image distortion characteristics, introduced by the lens, and maps the distorted \nimage to its original scene. Researcher UC Irvine September 2014  – Present (1 year) Donald Bren School of Information and Computer Sciences Researcher UC Irvine September 2014  – Present (1 year) Donald Bren School of Information and Computer Sciences Graphics and Parallel Processing Intern Intel Corporation June 2013  –  September 2014  (1 year 4 months) Santa Clara, CA Developing infrastructure software solutions for performance analysis of hardware-accelerated media codec and processing: Application development in C/C++ environment, to provide Intel graphics-driver test environment. This is a cross-platform application, supported in Windows, Linux, and Android. \n \nResearch of forward-looking methods: Research and analysis of video quality metrics based on human visual perception. These metrics are utilized by the performance analysis application to verify hardware-accelerated decode/encode and processing. Graphics and Parallel Processing Intern Intel Corporation June 2013  –  September 2014  (1 year 4 months) Santa Clara, CA Developing infrastructure software solutions for performance analysis of hardware-accelerated media codec and processing: Application development in C/C++ environment, to provide Intel graphics-driver test environment. This is a cross-platform application, supported in Windows, Linux, and Android. \n \nResearch of forward-looking methods: Research and analysis of video quality metrics based on human visual perception. These metrics are utilized by the performance analysis application to verify hardware-accelerated decode/encode and processing. Research Scientist Intern Intel Corporation September 2012  –  January 2013  (5 months) Santa Clara, CA High Dynamic Range (HDR) Imaging: A fast and efficient algorithm to retrieve the real irradiance in multi-exposure images was the primary goal of this research. Delivering a framework for HDR imaging, acquisition, irradiance retrieval, compression and tone-mapping. \n \nViewing Interpolation: Given multiple images of a 3D scene captured by a set of cameras, generated a synthetic view of a scene as it would appear from a new viewpoint. Research Scientist Intern Intel Corporation September 2012  –  January 2013  (5 months) Santa Clara, CA High Dynamic Range (HDR) Imaging: A fast and efficient algorithm to retrieve the real irradiance in multi-exposure images was the primary goal of this research. Delivering a framework for HDR imaging, acquisition, irradiance retrieval, compression and tone-mapping. \n \nViewing Interpolation: Given multiple images of a 3D scene captured by a set of cameras, generated a synthetic view of a scene as it would appear from a new viewpoint. Researcher UC Davis January 2011  –  September 2012  (1 year 9 months) NSF Center for Bio-photonic Science and technology (CBST) Cell Counter Algorithm for Cell-Phone Microscope: Image segmentation and pattern recognition, \nalgorithm development to perform blood cell counting; this algorithm is a part of cell-phone microscope \ndeveloped in CBST. Developed a fuzzy logic based method to enhance counting algorithms that enables identifying overlapped cells. \n \nMicro-Lens Distortion Corrector: An Automatic image distortion correction algorithm, which \nautomatically finds the image distortion characteristics, introduced by the lens, and maps the distorted \nimage to its original scene. Researcher UC Davis January 2011  –  September 2012  (1 year 9 months) NSF Center for Bio-photonic Science and technology (CBST) Cell Counter Algorithm for Cell-Phone Microscope: Image segmentation and pattern recognition, \nalgorithm development to perform blood cell counting; this algorithm is a part of cell-phone microscope \ndeveloped in CBST. Developed a fuzzy logic based method to enhance counting algorithms that enables identifying overlapped cells. \n \nMicro-Lens Distortion Corrector: An Automatic image distortion correction algorithm, which \nautomatically finds the image distortion characteristics, introduced by the lens, and maps the distorted \nimage to its original scene. Languages English English English Skills Algorithms Optics Matlab Image Processing Computer Graphics Computer Vision C++ Machine Learning Signal Processing Pattern Recognition Augmented Reality Virtual Reality Mixed Reality Software Engineering Computer Science LaTeX C Artificial Intelligence Camera Calibration Structure from Motion Multi Projector Display See 6+     See less Skills  Algorithms Optics Matlab Image Processing Computer Graphics Computer Vision C++ Machine Learning Signal Processing Pattern Recognition Augmented Reality Virtual Reality Mixed Reality Software Engineering Computer Science LaTeX C Artificial Intelligence Camera Calibration Structure from Motion Multi Projector Display See 6+     See less Algorithms Optics Matlab Image Processing Computer Graphics Computer Vision C++ Machine Learning Signal Processing Pattern Recognition Augmented Reality Virtual Reality Mixed Reality Software Engineering Computer Science LaTeX C Artificial Intelligence Camera Calibration Structure from Motion Multi Projector Display See 6+     See less Algorithms Optics Matlab Image Processing Computer Graphics Computer Vision C++ Machine Learning Signal Processing Pattern Recognition Augmented Reality Virtual Reality Mixed Reality Software Engineering Computer Science LaTeX C Artificial Intelligence Camera Calibration Structure from Motion Multi Projector Display See 6+     See less Education University of California, Irvine Doctor of Philosophy (Ph.D.),  Computer Science - Computer Graphics 2014  – 2017 California State University-Sacramento Master’s Degree,  Electrical Engineering - Telecommunications , MSc 2009  – 2011 Cell-Phone-Based Platform for Biomedical Device Development and Education Applications \nhttp://journals.plos.org/plosone/article?id=10.1371/journal.pone.0017150 Activities and Societies:  NSF Center for Biophotonic Science and Technology (CBST) University of California, Davis Certificate of Accomplishment UC Davis Entreprenuership Academy,  Entrepreneurship/Entrepreneurial Studies 2010  – 2010 University of California, Irvine Doctor of Philosophy (Ph.D.),  Computer Science - Computer Graphics 2014  – 2017 University of California, Irvine Doctor of Philosophy (Ph.D.),  Computer Science - Computer Graphics 2014  – 2017 University of California, Irvine Doctor of Philosophy (Ph.D.),  Computer Science - Computer Graphics 2014  – 2017 California State University-Sacramento Master’s Degree,  Electrical Engineering - Telecommunications , MSc 2009  – 2011 Cell-Phone-Based Platform for Biomedical Device Development and Education Applications \nhttp://journals.plos.org/plosone/article?id=10.1371/journal.pone.0017150 Activities and Societies:  NSF Center for Biophotonic Science and Technology (CBST) California State University-Sacramento Master’s Degree,  Electrical Engineering - Telecommunications , MSc 2009  – 2011 Cell-Phone-Based Platform for Biomedical Device Development and Education Applications \nhttp://journals.plos.org/plosone/article?id=10.1371/journal.pone.0017150 Activities and Societies:  NSF Center for Biophotonic Science and Technology (CBST) California State University-Sacramento Master’s Degree,  Electrical Engineering - Telecommunications , MSc 2009  – 2011 Cell-Phone-Based Platform for Biomedical Device Development and Education Applications \nhttp://journals.plos.org/plosone/article?id=10.1371/journal.pone.0017150 Activities and Societies:  NSF Center for Biophotonic Science and Technology (CBST) University of California, Davis Certificate of Accomplishment UC Davis Entreprenuership Academy,  Entrepreneurship/Entrepreneurial Studies 2010  – 2010 University of California, Davis Certificate of Accomplishment UC Davis Entreprenuership Academy,  Entrepreneurship/Entrepreneurial Studies 2010  – 2010 University of California, Davis Certificate of Accomplishment UC Davis Entreprenuership Academy,  Entrepreneurship/Entrepreneurial Studies 2010  – 2010 ", "Summary I am currently applying ideas from dynamics and control to problems in computational epidemiology. My research centers on HIV, but I also develop algorithms that can be used across a broad range of interdisciplinary applications.  \n \nThe main idea of computational epi is that we can try novel interventions thousands of times in-silico before applying them in the real world. This not only allows intervention optimization, but additionally enables sensitivity and uncertainty analysis to direct future research efforts. Summary I am currently applying ideas from dynamics and control to problems in computational epidemiology. My research centers on HIV, but I also develop algorithms that can be used across a broad range of interdisciplinary applications.  \n \nThe main idea of computational epi is that we can try novel interventions thousands of times in-silico before applying them in the real world. This not only allows intervention optimization, but additionally enables sensitivity and uncertainty analysis to direct future research efforts. I am currently applying ideas from dynamics and control to problems in computational epidemiology. My research centers on HIV, but I also develop algorithms that can be used across a broad range of interdisciplinary applications.  \n \nThe main idea of computational epi is that we can try novel interventions thousands of times in-silico before applying them in the real world. This not only allows intervention optimization, but additionally enables sensitivity and uncertainty analysis to direct future research efforts. I am currently applying ideas from dynamics and control to problems in computational epidemiology. My research centers on HIV, but I also develop algorithms that can be used across a broad range of interdisciplinary applications.  \n \nThe main idea of computational epi is that we can try novel interventions thousands of times in-silico before applying them in the real world. This not only allows intervention optimization, but additionally enables sensitivity and uncertainty analysis to direct future research efforts. Experience Chair of Applied Math, Senior Research Manager Institute for Disease Modeling December 2010  – Present (4 years 9 months) greater seattle area Working on computational epidemiology within the Institute for Disease Modeling at Intellectual Ventures Lab. Postdoctoral Scholar UC Santa Barbara October 2008  –  October 2010  (2 years 1 month) Santa Barbara, California Area Worked on control theory for multi-agent systems control, estimation, and communication under the guidance of Prof. Joao Hespanha. Lead UAV field tests to demonstrate theoretical results on trajectory planning and distributed estimation. Connected delay-tolerant networking with epidemiology to devise new performance scaling laws for message passing. Research Scientist Intern Intel Corporation June 2006  –  October 2007  (1 year 5 months) Greater Seattle Area Developed a quaternion-based orientation estimator for an embedded microcomputer. Information Technology Intern Affiliated Engineers July 1995  –  October 1996  (1 year 4 months) Madison, Wisconsin Area Chair of Applied Math, Senior Research Manager Institute for Disease Modeling December 2010  – Present (4 years 9 months) greater seattle area Working on computational epidemiology within the Institute for Disease Modeling at Intellectual Ventures Lab. Chair of Applied Math, Senior Research Manager Institute for Disease Modeling December 2010  – Present (4 years 9 months) greater seattle area Working on computational epidemiology within the Institute for Disease Modeling at Intellectual Ventures Lab. Postdoctoral Scholar UC Santa Barbara October 2008  –  October 2010  (2 years 1 month) Santa Barbara, California Area Worked on control theory for multi-agent systems control, estimation, and communication under the guidance of Prof. Joao Hespanha. Lead UAV field tests to demonstrate theoretical results on trajectory planning and distributed estimation. Connected delay-tolerant networking with epidemiology to devise new performance scaling laws for message passing. Postdoctoral Scholar UC Santa Barbara October 2008  –  October 2010  (2 years 1 month) Santa Barbara, California Area Worked on control theory for multi-agent systems control, estimation, and communication under the guidance of Prof. Joao Hespanha. Lead UAV field tests to demonstrate theoretical results on trajectory planning and distributed estimation. Connected delay-tolerant networking with epidemiology to devise new performance scaling laws for message passing. Research Scientist Intern Intel Corporation June 2006  –  October 2007  (1 year 5 months) Greater Seattle Area Developed a quaternion-based orientation estimator for an embedded microcomputer. Research Scientist Intern Intel Corporation June 2006  –  October 2007  (1 year 5 months) Greater Seattle Area Developed a quaternion-based orientation estimator for an embedded microcomputer. Information Technology Intern Affiliated Engineers July 1995  –  October 1996  (1 year 4 months) Madison, Wisconsin Area Information Technology Intern Affiliated Engineers July 1995  –  October 1996  (1 year 4 months) Madison, Wisconsin Area Languages English Native or bilingual proficiency Spanish Elementary proficiency English Native or bilingual proficiency Spanish Elementary proficiency English Native or bilingual proficiency Spanish Elementary proficiency Native or bilingual proficiency Elementary proficiency Skills Control Theory Mathematical Modeling Simulations HIV Polio Matlab Algorithms LaTeX Machine Learning Signal Processing Research Computer Vision Mathematica Image Processing Statistics C Data Analysis R&D Immunology C++ Programming Python Numerical Analysis UAV Optimization Simulink Physics Embedded Systems Distributed Systems Modeling Robotics See 16+     See less Skills  Control Theory Mathematical Modeling Simulations HIV Polio Matlab Algorithms LaTeX Machine Learning Signal Processing Research Computer Vision Mathematica Image Processing Statistics C Data Analysis R&D Immunology C++ Programming Python Numerical Analysis UAV Optimization Simulink Physics Embedded Systems Distributed Systems Modeling Robotics See 16+     See less Control Theory Mathematical Modeling Simulations HIV Polio Matlab Algorithms LaTeX Machine Learning Signal Processing Research Computer Vision Mathematica Image Processing Statistics C Data Analysis R&D Immunology C++ Programming Python Numerical Analysis UAV Optimization Simulink Physics Embedded Systems Distributed Systems Modeling Robotics See 16+     See less Control Theory Mathematical Modeling Simulations HIV Polio Matlab Algorithms LaTeX Machine Learning Signal Processing Research Computer Vision Mathematica Image Processing Statistics C Data Analysis R&D Immunology C++ Programming Python Numerical Analysis UAV Optimization Simulink Physics Embedded Systems Distributed Systems Modeling Robotics See 16+     See less Education University of Washington Doctor of Philosophy (Ph.D.),  Aerospace , Aeronautical and Astronautical Engineering 2004  – 2008 University of Wisconsin-Madison Bachelor of Science (B.S.),  Mechanical Engineering 2000  – 2004 Worked on medical image processing and computer vision in the lab of Prof. Nicola Ferrier. University of Washington Doctor of Philosophy (Ph.D.),  Aerospace , Aeronautical and Astronautical Engineering 2004  – 2008 University of Washington Doctor of Philosophy (Ph.D.),  Aerospace , Aeronautical and Astronautical Engineering 2004  – 2008 University of Washington Doctor of Philosophy (Ph.D.),  Aerospace , Aeronautical and Astronautical Engineering 2004  – 2008 University of Wisconsin-Madison Bachelor of Science (B.S.),  Mechanical Engineering 2000  – 2004 Worked on medical image processing and computer vision in the lab of Prof. Nicola Ferrier. University of Wisconsin-Madison Bachelor of Science (B.S.),  Mechanical Engineering 2000  – 2004 Worked on medical image processing and computer vision in the lab of Prof. Nicola Ferrier. University of Wisconsin-Madison Bachelor of Science (B.S.),  Mechanical Engineering 2000  – 2004 Worked on medical image processing and computer vision in the lab of Prof. Nicola Ferrier. Honors & Awards DINO Award Gene Oates, Senior Software Engineering Manager and Philip Eckhoff, Research Scientist – Principal Investigator November 2012 “Dan has been essential in improving our computational processes and has raised the level of rigor and mathematical quality on the EMOD project. He is always ready to help out on work streams and recently made a huge impact on improving the quality of the EMOD polio model. Dan also leads the work on modeling HIV transmission networks. He is active in team discussions and brings a necessary expertise and perspective to every part of the EMOD project in which he is involved. His contributions are making a lasting impact on global health in malaria, polio, and HIV. “ DINO Award Gene Oates, Senior Software Engineering Manager and Philip Eckhoff, Research Scientist – Principal Investigator November 2012 “Dan has been essential in improving our computational processes and has raised the level of rigor and mathematical quality on the EMOD project. He is always ready to help out on work streams and recently made a huge impact on improving the quality of the EMOD polio model. Dan also leads the work on modeling HIV transmission networks. He is active in team discussions and brings a necessary expertise and perspective to every part of the EMOD project in which he is involved. His contributions are making a lasting impact on global health in malaria, polio, and HIV. “ DINO Award Gene Oates, Senior Software Engineering Manager and Philip Eckhoff, Research Scientist – Principal Investigator November 2012 “Dan has been essential in improving our computational processes and has raised the level of rigor and mathematical quality on the EMOD project. He is always ready to help out on work streams and recently made a huge impact on improving the quality of the EMOD polio model. Dan also leads the work on modeling HIV transmission networks. He is active in team discussions and brings a necessary expertise and perspective to every part of the EMOD project in which he is involved. His contributions are making a lasting impact on global health in malaria, polio, and HIV. “ DINO Award Gene Oates, Senior Software Engineering Manager and Philip Eckhoff, Research Scientist – Principal Investigator November 2012 “Dan has been essential in improving our computational processes and has raised the level of rigor and mathematical quality on the EMOD project. He is always ready to help out on work streams and recently made a huge impact on improving the quality of the EMOD polio model. Dan also leads the work on modeling HIV transmission networks. He is active in team discussions and brings a necessary expertise and perspective to every part of the EMOD project in which he is involved. His contributions are making a lasting impact on global health in malaria, polio, and HIV. “ ", "Languages Chinese Taiwanese Chinese Taiwanese Chinese Taiwanese Skills C++ C Programming Data Structures Matlab Image Processing Computer Vision Algorithms Machine Learning Signal Processing OpenCV LaTeX Pattern Recognition Image Analysis Digital Signal... Simulations Python See 2+     See less Skills  C++ C Programming Data Structures Matlab Image Processing Computer Vision Algorithms Machine Learning Signal Processing OpenCV LaTeX Pattern Recognition Image Analysis Digital Signal... Simulations Python See 2+     See less C++ C Programming Data Structures Matlab Image Processing Computer Vision Algorithms Machine Learning Signal Processing OpenCV LaTeX Pattern Recognition Image Analysis Digital Signal... Simulations Python See 2+     See less C++ C Programming Data Structures Matlab Image Processing Computer Vision Algorithms Machine Learning Signal Processing OpenCV LaTeX Pattern Recognition Image Analysis Digital Signal... Simulations Python See 2+     See less Education University of California, Santa Barbara Doctor of Philosophy (PhD),  Electrical and Computer Engineering 2009  – 2014 National Tsing Hua University Master of Science (MS),  Electrical , Electronics and Communications Engineering 2005  – 2007 National Chiao Tung University BS,  Communication Engineering 2001  – 2005 Activities and Societies:  NCTU Sign Language Club University of California, Santa Barbara Doctor of Philosophy (PhD),  Electrical and Computer Engineering 2009  – 2014 University of California, Santa Barbara Doctor of Philosophy (PhD),  Electrical and Computer Engineering 2009  – 2014 University of California, Santa Barbara Doctor of Philosophy (PhD),  Electrical and Computer Engineering 2009  – 2014 National Tsing Hua University Master of Science (MS),  Electrical , Electronics and Communications Engineering 2005  – 2007 National Tsing Hua University Master of Science (MS),  Electrical , Electronics and Communications Engineering 2005  – 2007 National Tsing Hua University Master of Science (MS),  Electrical , Electronics and Communications Engineering 2005  – 2007 National Chiao Tung University BS,  Communication Engineering 2001  – 2005 Activities and Societies:  NCTU Sign Language Club National Chiao Tung University BS,  Communication Engineering 2001  – 2005 Activities and Societies:  NCTU Sign Language Club National Chiao Tung University BS,  Communication Engineering 2001  – 2005 Activities and Societies:  NCTU Sign Language Club ", "Skills Project Management User Experience Android Java Mobile Devices Web Development Mobile Applications Web Applications Networking Skills  Project Management User Experience Android Java Mobile Devices Web Development Mobile Applications Web Applications Networking Project Management User Experience Android Java Mobile Devices Web Development Mobile Applications Web Applications Networking Project Management User Experience Android Java Mobile Devices Web Development Mobile Applications Web Applications Networking Honors & Awards UW Graduate School Medal University of Washington 2011 Awarded to Ph.D. candidates whose academic expertise and social awareness are integrated in a way that demonstrates an exemplary commitment to the University and its larger community. Yahoo! Key Scientific Challenge Grant Yahoo! 2010 Awarded to exceptional PhD students who are considered future thought leaders. NSF Graduate Research Fellowship National Science Foundation 2006 Awarded to approximately 2,000 doctoral-level students in the natural, social, and engineering sciences at US institutions. Ford Motor Company Fellowship Ford Motor Company 2006 Awarded for research related to technologies and problems that would be of interest to the Ford Company. Most Outstanding Male Student Award Butler University 2004 Outstanding Engineering Dual Degree Program Student Award Purdue School of Engineering 2003 Online Journalist of the Year Award Butler University 2011 Pizzigati Prize for Software in the Public Interest Tides Foundation 2010 A team award for creating or leading an effort to create an open source software product of significant value to the nonprofit sector and movements for social change. WTIA Industry Achievement Award Washington Technology Industry Association 2011 A team award for best use of technology in government, non-profit or educational sectors. UW Graduate School Medal University of Washington 2011 Awarded to Ph.D. candidates whose academic expertise and social awareness are integrated in a way that demonstrates an exemplary commitment to the University and its larger community. UW Graduate School Medal University of Washington 2011 Awarded to Ph.D. candidates whose academic expertise and social awareness are integrated in a way that demonstrates an exemplary commitment to the University and its larger community. UW Graduate School Medal University of Washington 2011 Awarded to Ph.D. candidates whose academic expertise and social awareness are integrated in a way that demonstrates an exemplary commitment to the University and its larger community. Yahoo! Key Scientific Challenge Grant Yahoo! 2010 Awarded to exceptional PhD students who are considered future thought leaders. Yahoo! Key Scientific Challenge Grant Yahoo! 2010 Awarded to exceptional PhD students who are considered future thought leaders. Yahoo! Key Scientific Challenge Grant Yahoo! 2010 Awarded to exceptional PhD students who are considered future thought leaders. NSF Graduate Research Fellowship National Science Foundation 2006 Awarded to approximately 2,000 doctoral-level students in the natural, social, and engineering sciences at US institutions. NSF Graduate Research Fellowship National Science Foundation 2006 Awarded to approximately 2,000 doctoral-level students in the natural, social, and engineering sciences at US institutions. NSF Graduate Research Fellowship National Science Foundation 2006 Awarded to approximately 2,000 doctoral-level students in the natural, social, and engineering sciences at US institutions. Ford Motor Company Fellowship Ford Motor Company 2006 Awarded for research related to technologies and problems that would be of interest to the Ford Company. Ford Motor Company Fellowship Ford Motor Company 2006 Awarded for research related to technologies and problems that would be of interest to the Ford Company. Ford Motor Company Fellowship Ford Motor Company 2006 Awarded for research related to technologies and problems that would be of interest to the Ford Company. Most Outstanding Male Student Award Butler University 2004 Most Outstanding Male Student Award Butler University 2004 Most Outstanding Male Student Award Butler University 2004 Outstanding Engineering Dual Degree Program Student Award Purdue School of Engineering 2003 Outstanding Engineering Dual Degree Program Student Award Purdue School of Engineering 2003 Outstanding Engineering Dual Degree Program Student Award Purdue School of Engineering 2003 Online Journalist of the Year Award Butler University 2011 Online Journalist of the Year Award Butler University 2011 Online Journalist of the Year Award Butler University 2011 Pizzigati Prize for Software in the Public Interest Tides Foundation 2010 A team award for creating or leading an effort to create an open source software product of significant value to the nonprofit sector and movements for social change. Pizzigati Prize for Software in the Public Interest Tides Foundation 2010 A team award for creating or leading an effort to create an open source software product of significant value to the nonprofit sector and movements for social change. Pizzigati Prize for Software in the Public Interest Tides Foundation 2010 A team award for creating or leading an effort to create an open source software product of significant value to the nonprofit sector and movements for social change. WTIA Industry Achievement Award Washington Technology Industry Association 2011 A team award for best use of technology in government, non-profit or educational sectors. WTIA Industry Achievement Award Washington Technology Industry Association 2011 A team award for best use of technology in government, non-profit or educational sectors. WTIA Industry Achievement Award Washington Technology Industry Association 2011 A team award for best use of technology in government, non-profit or educational sectors. "]}