{"position": "Sales Assistant", "company": "IBM", "profiles": ["Experience Sales Assistant IBM SPSS UK Ltd. October 2010  – Present (4 years 11 months) Sales Assistant IBM SPSS UK Ltd. October 2010  – Present (4 years 11 months) Sales Assistant IBM SPSS UK Ltd. October 2010  – Present (4 years 11 months) Education Fullbrook 1979  – 1986 Fullbrook 1979  – 1986 Fullbrook 1979  – 1986 Fullbrook 1979  – 1986 ", "Summary Sales \nDirector of sales department - Webteh d.o.o. \nAccount Manager - Metronet telekomunikacije d.d. \nDell sales specialist - Combis d.o.o. \nMarketing and sales assistant - IBM Hrvatska d.o.o. \n \nSpecialties: Mergers and Acquisition, Sales, Negotiation, Business Development, Problem Solving, Project Management Summary Sales \nDirector of sales department - Webteh d.o.o. \nAccount Manager - Metronet telekomunikacije d.d. \nDell sales specialist - Combis d.o.o. \nMarketing and sales assistant - IBM Hrvatska d.o.o. \n \nSpecialties: Mergers and Acquisition, Sales, Negotiation, Business Development, Problem Solving, Project Management Sales \nDirector of sales department - Webteh d.o.o. \nAccount Manager - Metronet telekomunikacije d.d. \nDell sales specialist - Combis d.o.o. \nMarketing and sales assistant - IBM Hrvatska d.o.o. \n \nSpecialties: Mergers and Acquisition, Sales, Negotiation, Business Development, Problem Solving, Project Management Sales \nDirector of sales department - Webteh d.o.o. \nAccount Manager - Metronet telekomunikacije d.d. \nDell sales specialist - Combis d.o.o. \nMarketing and sales assistant - IBM Hrvatska d.o.o. \n \nSpecialties: Mergers and Acquisition, Sales, Negotiation, Business Development, Problem Solving, Project Management Experience Sales Manager for small customers RRC May 2014  – Present (1 year 4 months) Croatia Director of sales department Webteh d.o.o September 2010  –  May 2014  (3 years 9 months) Prepaid debit card issuing Account Manager Metronet telekomunikacije d.d. March 2010  –  September 2010  (7 months) Making offers for integrated communication solutions for business users \nRetention process through new services and contacts \nFinding new users and checking existing ones \nAnalyzing the market and competition Dell sales specialist Combis d.o.o. February 2003  –  February 2010  (7 years 1 month) Configuring and ordering Dell equipment for company key customers \nMonitoring tender offer \nParticipation in business organisation \nSubmitting dispatch notes, preparing goods for delivery to business partners Marketing and sales assistant IBM September 1996  –  March 2001  (4 years 7 months) Participation in event organization and contracting business contracts \nParticipation in the organization of various promotional activities with the goal of increasing company's productivity \nBusiness contacts and customer support functions \nCustomer contacts, informing, promotional activities Sales Manager for small customers RRC May 2014  – Present (1 year 4 months) Croatia Sales Manager for small customers RRC May 2014  – Present (1 year 4 months) Croatia Director of sales department Webteh d.o.o September 2010  –  May 2014  (3 years 9 months) Prepaid debit card issuing Director of sales department Webteh d.o.o September 2010  –  May 2014  (3 years 9 months) Prepaid debit card issuing Account Manager Metronet telekomunikacije d.d. March 2010  –  September 2010  (7 months) Making offers for integrated communication solutions for business users \nRetention process through new services and contacts \nFinding new users and checking existing ones \nAnalyzing the market and competition Account Manager Metronet telekomunikacije d.d. March 2010  –  September 2010  (7 months) Making offers for integrated communication solutions for business users \nRetention process through new services and contacts \nFinding new users and checking existing ones \nAnalyzing the market and competition Dell sales specialist Combis d.o.o. February 2003  –  February 2010  (7 years 1 month) Configuring and ordering Dell equipment for company key customers \nMonitoring tender offer \nParticipation in business organisation \nSubmitting dispatch notes, preparing goods for delivery to business partners Dell sales specialist Combis d.o.o. February 2003  –  February 2010  (7 years 1 month) Configuring and ordering Dell equipment for company key customers \nMonitoring tender offer \nParticipation in business organisation \nSubmitting dispatch notes, preparing goods for delivery to business partners Marketing and sales assistant IBM September 1996  –  March 2001  (4 years 7 months) Participation in event organization and contracting business contracts \nParticipation in the organization of various promotional activities with the goal of increasing company's productivity \nBusiness contacts and customer support functions \nCustomer contacts, informing, promotional activities Marketing and sales assistant IBM September 1996  –  March 2001  (4 years 7 months) Participation in event organization and contracting business contracts \nParticipation in the organization of various promotional activities with the goal of increasing company's productivity \nBusiness contacts and customer support functions \nCustomer contacts, informing, promotional activities Skills Negotiation Problem Solving Mergers Sales Management Customer Relations Team Leadership Business Planning Contract Negotiation Product Management Business Strategy Product Development Project Planning Key Account Management Team Building Analysis Project Management Mergers & Acquisitions Teamwork Sales Business Development Solution Selling Telecommunications Management See 8+     See less Skills  Negotiation Problem Solving Mergers Sales Management Customer Relations Team Leadership Business Planning Contract Negotiation Product Management Business Strategy Product Development Project Planning Key Account Management Team Building Analysis Project Management Mergers & Acquisitions Teamwork Sales Business Development Solution Selling Telecommunications Management See 8+     See less Negotiation Problem Solving Mergers Sales Management Customer Relations Team Leadership Business Planning Contract Negotiation Product Management Business Strategy Product Development Project Planning Key Account Management Team Building Analysis Project Management Mergers & Acquisitions Teamwork Sales Business Development Solution Selling Telecommunications Management See 8+     See less Negotiation Problem Solving Mergers Sales Management Customer Relations Team Leadership Business Planning Contract Negotiation Product Management Business Strategy Product Development Project Planning Key Account Management Team Building Analysis Project Management Mergers & Acquisitions Teamwork Sales Business Development Solution Selling Telecommunications Management See 8+     See less Education Zagreb School of Economics and Management, Croatia MBA , Management 2011  – 2013 University of Zagreb, Croatia Faculty of Humanities and Social Sciences 1996  – 2003 Zagreb School of Economics and Management, Croatia MBA , Management 2011  – 2013 Zagreb School of Economics and Management, Croatia MBA , Management 2011  – 2013 Zagreb School of Economics and Management, Croatia MBA , Management 2011  – 2013 University of Zagreb, Croatia Faculty of Humanities and Social Sciences 1996  – 2003 University of Zagreb, Croatia Faculty of Humanities and Social Sciences 1996  – 2003 University of Zagreb, Croatia Faculty of Humanities and Social Sciences 1996  – 2003 ", "Experience Sales Assistant IBM Corporation Sales Assistant IBM Corporation Sales Assistant IBM Corporation ", "Experience SALES ASSISTANT IBM SALES ASSISTANT IBM SALES ASSISTANT IBM ", "Skills Sales Operations CRM Skills  Sales Operations CRM Sales Operations CRM Sales Operations CRM ", "Experience Sales Assistant IBM France Sales Assistant IBM France Sales Assistant IBM France ", "Experience Sales Assistant IBM Global Business Services Sales Assistant IBM Global Business Services Sales Assistant IBM Global Business Services ", "Summary Jag strävar alltid för att styra mitt liv med en positivt inställd kompass. Känner mig på topp då jag är i ett flow på arbetsplatsen, fokuserad på arbetet utan att bli distraherad. En personlig värdering för mig är närvaro samt en personlig styrka är empati. Summary Jag strävar alltid för att styra mitt liv med en positivt inställd kompass. Känner mig på topp då jag är i ett flow på arbetsplatsen, fokuserad på arbetet utan att bli distraherad. En personlig värdering för mig är närvaro samt en personlig styrka är empati. Jag strävar alltid för att styra mitt liv med en positivt inställd kompass. Känner mig på topp då jag är i ett flow på arbetsplatsen, fokuserad på arbetet utan att bli distraherad. En personlig värdering för mig är närvaro samt en personlig styrka är empati. Jag strävar alltid för att styra mitt liv med en positivt inställd kompass. Känner mig på topp då jag är i ett flow på arbetsplatsen, fokuserad på arbetet utan att bli distraherad. En personlig värdering för mig är närvaro samt en personlig styrka är empati. Experience Sales assistant IBM March 2013  –  September 2014  (1 year 7 months) Stockholm, Sweden Customer Service Representative Europcar May 2009  –  February 2013  (3 years 10 months) Stockholm, Sweden Company Service Representative Armada May 2012  –  November 2012  (7 months) Stockholm, Sweden Postman Posten AB September 2008  –  April 2009  (8 months) Saltsjö-boo Fritidspedagog Järla skola September 2007  –  May 2008  (9 months) Sales assistant IBM March 2013  –  September 2014  (1 year 7 months) Stockholm, Sweden Sales assistant IBM March 2013  –  September 2014  (1 year 7 months) Stockholm, Sweden Customer Service Representative Europcar May 2009  –  February 2013  (3 years 10 months) Stockholm, Sweden Customer Service Representative Europcar May 2009  –  February 2013  (3 years 10 months) Stockholm, Sweden Company Service Representative Armada May 2012  –  November 2012  (7 months) Stockholm, Sweden Company Service Representative Armada May 2012  –  November 2012  (7 months) Stockholm, Sweden Postman Posten AB September 2008  –  April 2009  (8 months) Saltsjö-boo Postman Posten AB September 2008  –  April 2009  (8 months) Saltsjö-boo Fritidspedagog Järla skola September 2007  –  May 2008  (9 months) Fritidspedagog Järla skola September 2007  –  May 2008  (9 months) Skills Lease Financing Account Management PowerPoint English Team Leadership Project Planning Microsoft Excel Microsoft Office Skills  Lease Financing Account Management PowerPoint English Team Leadership Project Planning Microsoft Excel Microsoft Office Lease Financing Account Management PowerPoint English Team Leadership Project Planning Microsoft Excel Microsoft Office Lease Financing Account Management PowerPoint English Team Leadership Project Planning Microsoft Excel Microsoft Office Education KTH Royal Institute of Technology M.Sc. Industrial Management,  Design and Product Realization 2009  – 2014 Griffith University Exhange Semester 2011  – 2011 KTH Royal Institute of Technology M.Sc. Industrial Management,  Design and Product Realization 2009  – 2014 KTH Royal Institute of Technology M.Sc. Industrial Management,  Design and Product Realization 2009  – 2014 KTH Royal Institute of Technology M.Sc. Industrial Management,  Design and Product Realization 2009  – 2014 Griffith University Exhange Semester 2011  – 2011 Griffith University Exhange Semester 2011  – 2011 Griffith University Exhange Semester 2011  – 2011 ", "Experience Sales Assistant IBM February 2010  – Present (5 years 7 months) Sales Assistant IBM February 2010  – Present (5 years 7 months) Sales Assistant IBM February 2010  – Present (5 years 7 months) Education Montpellier Business School 2007  – 2011 Montpellier Business School 2007  – 2011 Montpellier Business School 2007  – 2011 Montpellier Business School 2007  – 2011 ", "Experience Sales Assistant IBM February 2010  – Present (5 years 7 months) Sales Assistant IBM February 2010  – Present (5 years 7 months) Sales Assistant IBM February 2010  – Present (5 years 7 months) Education Montpellier Business School 2007  – 2011 Montpellier Business School 2007  – 2011 Montpellier Business School 2007  – 2011 Montpellier Business School 2007  – 2011 ", "Summary Talented, results orientated professional, recognized for consistent & excellent track record in developing and capitalizing on strategic relationships.  Proven results in creating/executing diverse strategies to significantly improve process efficiency and operational risk controls. Strong leadership skills including developing talent and leading high performing teams.  Selected to address and solve extensive, complex, and sensitive issues across different cultures and interests. \n \nYou can reach me at johnweidner@comcast.net. Summary Talented, results orientated professional, recognized for consistent & excellent track record in developing and capitalizing on strategic relationships.  Proven results in creating/executing diverse strategies to significantly improve process efficiency and operational risk controls. Strong leadership skills including developing talent and leading high performing teams.  Selected to address and solve extensive, complex, and sensitive issues across different cultures and interests. \n \nYou can reach me at johnweidner@comcast.net. Talented, results orientated professional, recognized for consistent & excellent track record in developing and capitalizing on strategic relationships.  Proven results in creating/executing diverse strategies to significantly improve process efficiency and operational risk controls. Strong leadership skills including developing talent and leading high performing teams.  Selected to address and solve extensive, complex, and sensitive issues across different cultures and interests. \n \nYou can reach me at johnweidner@comcast.net. Talented, results orientated professional, recognized for consistent & excellent track record in developing and capitalizing on strategic relationships.  Proven results in creating/executing diverse strategies to significantly improve process efficiency and operational risk controls. Strong leadership skills including developing talent and leading high performing teams.  Selected to address and solve extensive, complex, and sensitive issues across different cultures and interests. \n \nYou can reach me at johnweidner@comcast.net. Experience Vice President - Risk Management and Consulting U.S. Bank 2014  – Present (1 year) Greater Minneapolis-St. Paul Area Provide strategic leadership and management for trustee litigation, issue management, audits, quality assurance testing, project management and training. Secretary and Member, Board of Directors The Bridge For Youth 2013  – Present (2 years) Greater Minneapolis-St. Paul Area The Bridge for Youth is dedicated to providing the connection between the current realities of homelessness and a brighter, safer, more stable future. \n \nThe Bridge is a safe and welcoming place for youth ages 10-17 in the Twin Cities who have no one to turn to, nowhere to go. With a dedicated staff and strong support from the community, we help hundreds of youth get off the street, into safe shelter, and on to a better life. Our welcoming, residential setting is unique among programs for runaway and homeless youth, providing services at no charge, 24/7/365. \n \nThe Bridge develops approaches that help youth and their families resolve their conflicts and move toward healthier relationships. Each year we serve more than a thousand young people and families with a continuum of services, including: \n \n24-hour hotline \nCrisis shelter and counseling \nYouth, parent, and family counseling \nTransitional programs \nOngoing support services Vice President (VP) - Issue Management & Consulting - Corporate, Municipal and Escrow Services Wells Fargo 2010  –  2014  (4 years) Greater Minneapolis-St. Paul Area Managed all aspects of corporate, municipal and escrow services issue management, account consulting, document review and related budgets to ensure proper management of operational, reputational and financial risk. Vice President (VP) - Asset Securitization Group Wells Fargo Bank 1997  –  2010  (13 years) Greater Minneapolis-St. Paul Area Provided strategic direction and operational risk management leadership for all facets of Trust Oversight relating to Structured Finance Trust administration including managing distressed transactions and relationships across issuers, investors and servicers. Provided strategic direction and build-out support for international trust administration function in London office. Account Representative Norwest Bank, N.A. 1994  –  1997  (3 years) Greater Minneapolis-St. Paul Area Worked in temporary capacity while pursuing Masters Degree and teaching at the elementary level. Corporate Bank Trainee/Fixed Income Portfolio Manager Norwest Bank, N.A. 1991  –  1993  (2 years) Greater Minneapolis-St. Paul Area As Trainee, completed comprehensive sales and credit program followed by nine months of rotations across corporate banking. As portfolio manager, managed overnight repo portfolio of $500 million and co-managed over $4 billion across seven Norwest fixed income money market funds and 10 client portfolios. Staff Consultant Accenture 1990  –  1991  (1 year) Greater Minneapolis-St. Paul Area Planned, designed and presented client proposals, initiated new business cold calling effort and organized vendors for engineering contract proposals. Branch Sales Assistant IBM 1988  –  1990  (2 years) Greater Minneapolis-St. Paul Area Assisted Marketing Representatives in sales calls, managed another Sales Assistant, developed proposals and presentations, created and managed graphics resource center and worked with customers to resolve technical problems. Branch Sales Assistant IBM World Trade Asia, Corporation 1988  –  1988  (less than a year) Hong Kong Supported Marketing Representatives by developing proposals and presentations, working with customers to resolve technical problems and supporting trade show marketing efforts. Vice President - Risk Management and Consulting U.S. Bank 2014  – Present (1 year) Greater Minneapolis-St. Paul Area Provide strategic leadership and management for trustee litigation, issue management, audits, quality assurance testing, project management and training. Vice President - Risk Management and Consulting U.S. Bank 2014  – Present (1 year) Greater Minneapolis-St. Paul Area Provide strategic leadership and management for trustee litigation, issue management, audits, quality assurance testing, project management and training. Secretary and Member, Board of Directors The Bridge For Youth 2013  – Present (2 years) Greater Minneapolis-St. Paul Area The Bridge for Youth is dedicated to providing the connection between the current realities of homelessness and a brighter, safer, more stable future. \n \nThe Bridge is a safe and welcoming place for youth ages 10-17 in the Twin Cities who have no one to turn to, nowhere to go. With a dedicated staff and strong support from the community, we help hundreds of youth get off the street, into safe shelter, and on to a better life. Our welcoming, residential setting is unique among programs for runaway and homeless youth, providing services at no charge, 24/7/365. \n \nThe Bridge develops approaches that help youth and their families resolve their conflicts and move toward healthier relationships. Each year we serve more than a thousand young people and families with a continuum of services, including: \n \n24-hour hotline \nCrisis shelter and counseling \nYouth, parent, and family counseling \nTransitional programs \nOngoing support services Secretary and Member, Board of Directors The Bridge For Youth 2013  – Present (2 years) Greater Minneapolis-St. Paul Area The Bridge for Youth is dedicated to providing the connection between the current realities of homelessness and a brighter, safer, more stable future. \n \nThe Bridge is a safe and welcoming place for youth ages 10-17 in the Twin Cities who have no one to turn to, nowhere to go. With a dedicated staff and strong support from the community, we help hundreds of youth get off the street, into safe shelter, and on to a better life. Our welcoming, residential setting is unique among programs for runaway and homeless youth, providing services at no charge, 24/7/365. \n \nThe Bridge develops approaches that help youth and their families resolve their conflicts and move toward healthier relationships. Each year we serve more than a thousand young people and families with a continuum of services, including: \n \n24-hour hotline \nCrisis shelter and counseling \nYouth, parent, and family counseling \nTransitional programs \nOngoing support services Vice President (VP) - Issue Management & Consulting - Corporate, Municipal and Escrow Services Wells Fargo 2010  –  2014  (4 years) Greater Minneapolis-St. Paul Area Managed all aspects of corporate, municipal and escrow services issue management, account consulting, document review and related budgets to ensure proper management of operational, reputational and financial risk. Vice President (VP) - Issue Management & Consulting - Corporate, Municipal and Escrow Services Wells Fargo 2010  –  2014  (4 years) Greater Minneapolis-St. Paul Area Managed all aspects of corporate, municipal and escrow services issue management, account consulting, document review and related budgets to ensure proper management of operational, reputational and financial risk. Vice President (VP) - Asset Securitization Group Wells Fargo Bank 1997  –  2010  (13 years) Greater Minneapolis-St. Paul Area Provided strategic direction and operational risk management leadership for all facets of Trust Oversight relating to Structured Finance Trust administration including managing distressed transactions and relationships across issuers, investors and servicers. Provided strategic direction and build-out support for international trust administration function in London office. Vice President (VP) - Asset Securitization Group Wells Fargo Bank 1997  –  2010  (13 years) Greater Minneapolis-St. Paul Area Provided strategic direction and operational risk management leadership for all facets of Trust Oversight relating to Structured Finance Trust administration including managing distressed transactions and relationships across issuers, investors and servicers. Provided strategic direction and build-out support for international trust administration function in London office. Account Representative Norwest Bank, N.A. 1994  –  1997  (3 years) Greater Minneapolis-St. Paul Area Worked in temporary capacity while pursuing Masters Degree and teaching at the elementary level. Account Representative Norwest Bank, N.A. 1994  –  1997  (3 years) Greater Minneapolis-St. Paul Area Worked in temporary capacity while pursuing Masters Degree and teaching at the elementary level. Corporate Bank Trainee/Fixed Income Portfolio Manager Norwest Bank, N.A. 1991  –  1993  (2 years) Greater Minneapolis-St. Paul Area As Trainee, completed comprehensive sales and credit program followed by nine months of rotations across corporate banking. As portfolio manager, managed overnight repo portfolio of $500 million and co-managed over $4 billion across seven Norwest fixed income money market funds and 10 client portfolios. Corporate Bank Trainee/Fixed Income Portfolio Manager Norwest Bank, N.A. 1991  –  1993  (2 years) Greater Minneapolis-St. Paul Area As Trainee, completed comprehensive sales and credit program followed by nine months of rotations across corporate banking. As portfolio manager, managed overnight repo portfolio of $500 million and co-managed over $4 billion across seven Norwest fixed income money market funds and 10 client portfolios. Staff Consultant Accenture 1990  –  1991  (1 year) Greater Minneapolis-St. Paul Area Planned, designed and presented client proposals, initiated new business cold calling effort and organized vendors for engineering contract proposals. Staff Consultant Accenture 1990  –  1991  (1 year) Greater Minneapolis-St. Paul Area Planned, designed and presented client proposals, initiated new business cold calling effort and organized vendors for engineering contract proposals. Branch Sales Assistant IBM 1988  –  1990  (2 years) Greater Minneapolis-St. Paul Area Assisted Marketing Representatives in sales calls, managed another Sales Assistant, developed proposals and presentations, created and managed graphics resource center and worked with customers to resolve technical problems. Branch Sales Assistant IBM 1988  –  1990  (2 years) Greater Minneapolis-St. Paul Area Assisted Marketing Representatives in sales calls, managed another Sales Assistant, developed proposals and presentations, created and managed graphics resource center and worked with customers to resolve technical problems. Branch Sales Assistant IBM World Trade Asia, Corporation 1988  –  1988  (less than a year) Hong Kong Supported Marketing Representatives by developing proposals and presentations, working with customers to resolve technical problems and supporting trade show marketing efforts. Branch Sales Assistant IBM World Trade Asia, Corporation 1988  –  1988  (less than a year) Hong Kong Supported Marketing Representatives by developing proposals and presentations, working with customers to resolve technical problems and supporting trade show marketing efforts. Skills Risk Management Securitization Corporate Trust Leadership Management Relationship Management Portfolio Management Strategic Planning Municipal Bonds MBS CRM mortgage ser Cross-functional Team... Workout Litigation Management Issue Management Creative Problem Solving Collaborative Problem... Operational Risk... Fixed Income Portfolio... Consulting Housing Finance Asset Backed Financing Turnaround Strategy Compliance Presentations Public Speaking Education Elementary Education Non-profit... Non-profit Leadership Community Engagement Community Support Community Outreach Project Management Situational Leadership New Business Development Business Strategy Culture Change Change Management Capital Markets P&L Management Banking Financial Services See 29+     See less Skills  Risk Management Securitization Corporate Trust Leadership Management Relationship Management Portfolio Management Strategic Planning Municipal Bonds MBS CRM mortgage ser Cross-functional Team... Workout Litigation Management Issue Management Creative Problem Solving Collaborative Problem... Operational Risk... Fixed Income Portfolio... Consulting Housing Finance Asset Backed Financing Turnaround Strategy Compliance Presentations Public Speaking Education Elementary Education Non-profit... Non-profit Leadership Community Engagement Community Support Community Outreach Project Management Situational Leadership New Business Development Business Strategy Culture Change Change Management Capital Markets P&L Management Banking Financial Services See 29+     See less Risk Management Securitization Corporate Trust Leadership Management Relationship Management Portfolio Management Strategic Planning Municipal Bonds MBS CRM mortgage ser Cross-functional Team... Workout Litigation Management Issue Management Creative Problem Solving Collaborative Problem... Operational Risk... Fixed Income Portfolio... Consulting Housing Finance Asset Backed Financing Turnaround Strategy Compliance Presentations Public Speaking Education Elementary Education Non-profit... Non-profit Leadership Community Engagement Community Support Community Outreach Project Management Situational Leadership New Business Development Business Strategy Culture Change Change Management Capital Markets P&L Management Banking Financial Services See 29+     See less Risk Management Securitization Corporate Trust Leadership Management Relationship Management Portfolio Management Strategic Planning Municipal Bonds MBS CRM mortgage ser Cross-functional Team... Workout Litigation Management Issue Management Creative Problem Solving Collaborative Problem... Operational Risk... Fixed Income Portfolio... Consulting Housing Finance Asset Backed Financing Turnaround Strategy Compliance Presentations Public Speaking Education Elementary Education Non-profit... Non-profit Leadership Community Engagement Community Support Community Outreach Project Management Situational Leadership New Business Development Business Strategy Culture Change Change Management Capital Markets P&L Management Banking Financial Services See 29+     See less Education University of Minnesota - Carlson School of Management Bachelor of Science (BS),  Business Administration (BA) - Finance University of Minnesota-Twin Cities Master of Education (MEd),  Education Lourdes High School University of Minnesota - Carlson School of Management Bachelor of Science (BS),  Business Administration (BA) - Finance University of Minnesota - Carlson School of Management Bachelor of Science (BS),  Business Administration (BA) - Finance University of Minnesota - Carlson School of Management Bachelor of Science (BS),  Business Administration (BA) - Finance University of Minnesota-Twin Cities Master of Education (MEd),  Education University of Minnesota-Twin Cities Master of Education (MEd),  Education University of Minnesota-Twin Cities Master of Education (MEd),  Education Lourdes High School Lourdes High School Lourdes High School ", "Experience Sales assistant IBM Sales assistant IBM Sales assistant IBM ", "Skills Management Project Management Skills  Management Project Management Management Project Management Management Project Management ", "Experience Sales Assistant IBM November 2011  –  April 2015  (3 years 6 months) Greater New York City Area Michael Kors Specialist Bloomingdales' January 2011  –  March 2013  (2 years 3 months) Specialist for Michael Kors shop at Bloomingdales' responsible for providing high end-clientele with product knowledge and a personal shopping experience, merchandising the sales floor and maintaining inventory of merchandise. Assistant Teacher Growing Tree North Nursery School 2009  –  2010  (1 year) Assisted head teacher in the development and execution of strategic lessons plans \nDeveloped and provided daily individualized progress reports for parental review \nPlanned and directed all summertime activities, ensuring a healthy balance of physical exercise and mental stimulation \nActively participated in early childhood, education and development workshops \nPrepared meals and snacks for children, including those with dietary restrictions  \nFostered and maintained a caring, safe and nurturing environment for preschool children to learn, have fun and grow Sales Assistant IBM November 2011  –  April 2015  (3 years 6 months) Greater New York City Area Sales Assistant IBM November 2011  –  April 2015  (3 years 6 months) Greater New York City Area Michael Kors Specialist Bloomingdales' January 2011  –  March 2013  (2 years 3 months) Specialist for Michael Kors shop at Bloomingdales' responsible for providing high end-clientele with product knowledge and a personal shopping experience, merchandising the sales floor and maintaining inventory of merchandise. Michael Kors Specialist Bloomingdales' January 2011  –  March 2013  (2 years 3 months) Specialist for Michael Kors shop at Bloomingdales' responsible for providing high end-clientele with product knowledge and a personal shopping experience, merchandising the sales floor and maintaining inventory of merchandise. Assistant Teacher Growing Tree North Nursery School 2009  –  2010  (1 year) Assisted head teacher in the development and execution of strategic lessons plans \nDeveloped and provided daily individualized progress reports for parental review \nPlanned and directed all summertime activities, ensuring a healthy balance of physical exercise and mental stimulation \nActively participated in early childhood, education and development workshops \nPrepared meals and snacks for children, including those with dietary restrictions  \nFostered and maintained a caring, safe and nurturing environment for preschool children to learn, have fun and grow Assistant Teacher Growing Tree North Nursery School 2009  –  2010  (1 year) Assisted head teacher in the development and execution of strategic lessons plans \nDeveloped and provided daily individualized progress reports for parental review \nPlanned and directed all summertime activities, ensuring a healthy balance of physical exercise and mental stimulation \nActively participated in early childhood, education and development workshops \nPrepared meals and snacks for children, including those with dietary restrictions  \nFostered and maintained a caring, safe and nurturing environment for preschool children to learn, have fun and grow Skills Microsoft Excel Sales Merchandising Microsoft Office Strategy Skills  Microsoft Excel Sales Merchandising Microsoft Office Strategy Microsoft Excel Sales Merchandising Microsoft Office Strategy Microsoft Excel Sales Merchandising Microsoft Office Strategy Education Purchase College, SUNY Bachelor of Arts Degree,  Liberal Arts & Communications Studies Purchase College, SUNY Bachelor of Arts Degree,  Liberal Arts & Communications Studies Purchase College, SUNY Bachelor of Arts Degree,  Liberal Arts & Communications Studies Purchase College, SUNY Bachelor of Arts Degree,  Liberal Arts & Communications Studies ", "Experience Sales assistant IBM Sales assistant IBM Sales assistant IBM ", "Experience Enterprise Sales Assistant IBM July 2015  – Present (2 months) London, United Kingdom Student Nottingham Trent University September 2013  – Present (2 years) Nottingham, United Kingdom I am a BA Honours Accounting and Finance Student, currently in my second year of study. I have covered modules in: Economics, Applied Business Skills; in which I learnt advanced Excel and Sage and gained a high First; Statistics; Business Law; Managerial and Financial Accounting; Financial Reporting and Financial Management. Later this year I will go onto study Taxation, Accounting and Assurance and International Business and Communications. Barman/ Waiter White Horse pub June 2014  – Present (1 year 3 months) Welham green I work as a barman and a waiter at a busy local pub. Working within the team to ensure efficiency so the customer experience was excellent. I enjoy working as part of a team and interacting with customers. Barista Costa Coffee 2010  –  2014  (4 years) Stevenage, United Kingdom During this time I was given the responsibility of closing and cashing up which involves handling the keys and the safe. I have received awards for both exceptional skill and for exceptional customer care, which I strive to achieve in every task I perform. Enterprise Sales Assistant IBM July 2015  – Present (2 months) London, United Kingdom Enterprise Sales Assistant IBM July 2015  – Present (2 months) London, United Kingdom Student Nottingham Trent University September 2013  – Present (2 years) Nottingham, United Kingdom I am a BA Honours Accounting and Finance Student, currently in my second year of study. I have covered modules in: Economics, Applied Business Skills; in which I learnt advanced Excel and Sage and gained a high First; Statistics; Business Law; Managerial and Financial Accounting; Financial Reporting and Financial Management. Later this year I will go onto study Taxation, Accounting and Assurance and International Business and Communications. Student Nottingham Trent University September 2013  – Present (2 years) Nottingham, United Kingdom I am a BA Honours Accounting and Finance Student, currently in my second year of study. I have covered modules in: Economics, Applied Business Skills; in which I learnt advanced Excel and Sage and gained a high First; Statistics; Business Law; Managerial and Financial Accounting; Financial Reporting and Financial Management. Later this year I will go onto study Taxation, Accounting and Assurance and International Business and Communications. Barman/ Waiter White Horse pub June 2014  – Present (1 year 3 months) Welham green I work as a barman and a waiter at a busy local pub. Working within the team to ensure efficiency so the customer experience was excellent. I enjoy working as part of a team and interacting with customers. Barman/ Waiter White Horse pub June 2014  – Present (1 year 3 months) Welham green I work as a barman and a waiter at a busy local pub. Working within the team to ensure efficiency so the customer experience was excellent. I enjoy working as part of a team and interacting with customers. Barista Costa Coffee 2010  –  2014  (4 years) Stevenage, United Kingdom During this time I was given the responsibility of closing and cashing up which involves handling the keys and the safe. I have received awards for both exceptional skill and for exceptional customer care, which I strive to achieve in every task I perform. Barista Costa Coffee 2010  –  2014  (4 years) Stevenage, United Kingdom During this time I was given the responsibility of closing and cashing up which involves handling the keys and the safe. I have received awards for both exceptional skill and for exceptional customer care, which I strive to achieve in every task I perform. Skills Financial Reporting Financial Accounting International Business... Taxations Assurance International Business... Sage Accounts Microsoft Excel Accounting Communication Leadership Managerial Finance Microsoft Office Microsoft Word Public Speaking PowerPoint Research Sales See 3+     See less Skills  Financial Reporting Financial Accounting International Business... Taxations Assurance International Business... Sage Accounts Microsoft Excel Accounting Communication Leadership Managerial Finance Microsoft Office Microsoft Word Public Speaking PowerPoint Research Sales See 3+     See less Financial Reporting Financial Accounting International Business... Taxations Assurance International Business... Sage Accounts Microsoft Excel Accounting Communication Leadership Managerial Finance Microsoft Office Microsoft Word Public Speaking PowerPoint Research Sales See 3+     See less Financial Reporting Financial Accounting International Business... Taxations Assurance International Business... Sage Accounts Microsoft Excel Accounting Communication Leadership Managerial Finance Microsoft Office Microsoft Word Public Speaking PowerPoint Research Sales See 3+     See less Education St Columba's college GCSE , B English, B Maths, Science B 2008  – 2011 Verulam A-level,  business studies , financial studies, sociology and media studies , A* B B C 2011  – 2013 St Columba's college GCSE , B English, B Maths, Science B 2008  – 2011 St Columba's college GCSE , B English, B Maths, Science B 2008  – 2011 St Columba's college GCSE , B English, B Maths, Science B 2008  – 2011 Verulam A-level,  business studies , financial studies, sociology and media studies , A* B B C 2011  – 2013 Verulam A-level,  business studies , financial studies, sociology and media studies , A* B B C 2011  – 2013 Verulam A-level,  business studies , financial studies, sociology and media studies , A* B B C 2011  – 2013 ", "Summary A bi-lingual, motivated, highly analytical individual with strong teamwork, leadership and communication skills and a strive for excellence. Summary A bi-lingual, motivated, highly analytical individual with strong teamwork, leadership and communication skills and a strive for excellence. A bi-lingual, motivated, highly analytical individual with strong teamwork, leadership and communication skills and a strive for excellence. A bi-lingual, motivated, highly analytical individual with strong teamwork, leadership and communication skills and a strive for excellence. Experience Incoming Summer Analyst 2016 Goldman Sachs May 2015  – Present (4 months) London, United Kingdom Summer Intern Erste Group July 2015  – Present (2 months) Vienna, Austria Spring Intern Goldman Sachs April 2015  –  April 2015  (1 month) London, United Kingdom Account Portfolio Management Support IBM April 2014  –  September 2014  (6 months) Vienna Paramedic Austrian Red Cross July 2013  –  March 2014  (9 months) Neusiedl/See, Burgenland, Austria Compulsory Community Service Year \n \n Mid-Market & Business Partner Sales Assistant IBM August 2012  –  August 2012  (1 month) Vienna Mid-Market & Business Partner Sales Assistant IBM August 2011  –  August 2011  (1 month) Vienna Mid-Market & Business Partner Sales Assistant IBM July 2010  –  August 2010  (2 months) Vienna Incoming Summer Analyst 2016 Goldman Sachs May 2015  – Present (4 months) London, United Kingdom Incoming Summer Analyst 2016 Goldman Sachs May 2015  – Present (4 months) London, United Kingdom Summer Intern Erste Group July 2015  – Present (2 months) Vienna, Austria Summer Intern Erste Group July 2015  – Present (2 months) Vienna, Austria Spring Intern Goldman Sachs April 2015  –  April 2015  (1 month) London, United Kingdom Spring Intern Goldman Sachs April 2015  –  April 2015  (1 month) London, United Kingdom Account Portfolio Management Support IBM April 2014  –  September 2014  (6 months) Vienna Account Portfolio Management Support IBM April 2014  –  September 2014  (6 months) Vienna Paramedic Austrian Red Cross July 2013  –  March 2014  (9 months) Neusiedl/See, Burgenland, Austria Compulsory Community Service Year \n \n Paramedic Austrian Red Cross July 2013  –  March 2014  (9 months) Neusiedl/See, Burgenland, Austria Compulsory Community Service Year \n \n Mid-Market & Business Partner Sales Assistant IBM August 2012  –  August 2012  (1 month) Vienna Mid-Market & Business Partner Sales Assistant IBM August 2012  –  August 2012  (1 month) Vienna Mid-Market & Business Partner Sales Assistant IBM August 2011  –  August 2011  (1 month) Vienna Mid-Market & Business Partner Sales Assistant IBM August 2011  –  August 2011  (1 month) Vienna Mid-Market & Business Partner Sales Assistant IBM July 2010  –  August 2010  (2 months) Vienna Mid-Market & Business Partner Sales Assistant IBM July 2010  –  August 2010  (2 months) Vienna Languages German Native or bilingual proficiency English Native or bilingual proficiency French Elementary proficiency German Native or bilingual proficiency English Native or bilingual proficiency French Elementary proficiency German Native or bilingual proficiency English Native or bilingual proficiency French Elementary proficiency Native or bilingual proficiency Native or bilingual proficiency Elementary proficiency Skills Economics Finance Leadership ECDL Certification Microsoft Office Microsoft Excel Project Management Project Portfolio... Music Trumpet Orchestral Music Emergency Medicine Emergency Services Management Research Teamwork Microsoft Word PowerPoint Financial Risk... Teaching Public Speaking Team Leadership Cross-functional... Cross-cultural... See 9+     See less Skills  Economics Finance Leadership ECDL Certification Microsoft Office Microsoft Excel Project Management Project Portfolio... Music Trumpet Orchestral Music Emergency Medicine Emergency Services Management Research Teamwork Microsoft Word PowerPoint Financial Risk... Teaching Public Speaking Team Leadership Cross-functional... Cross-cultural... See 9+     See less Economics Finance Leadership ECDL Certification Microsoft Office Microsoft Excel Project Management Project Portfolio... Music Trumpet Orchestral Music Emergency Medicine Emergency Services Management Research Teamwork Microsoft Word PowerPoint Financial Risk... Teaching Public Speaking Team Leadership Cross-functional... Cross-cultural... See 9+     See less Economics Finance Leadership ECDL Certification Microsoft Office Microsoft Excel Project Management Project Portfolio... Music Trumpet Orchestral Music Emergency Medicine Emergency Services Management Research Teamwork Microsoft Word PowerPoint Financial Risk... Teaching Public Speaking Team Leadership Cross-functional... Cross-cultural... See 9+     See less Education University of Surrey Bachelor of Science (BSc),  Economics and Finance 2014  – 2017 Activities and Societies:  Economics and Finance Society (Head of Finance ,  First Year Representative ,  Research Team) ,  Sailing The Cambridge Institute Vienna Cambridge English: Advanced,  English (CEFR C2) , A 2012  – 2013 Upper-Secondary Academic School for Students of Music Reifeprüfungszeugnis/Matura,  Trumpet , Passed with Distinction 2010  – 2013 Activities and Societies:  Elected Class Representative 2013 and 2012 ,  Head of Finance (Prom) 2010\nYPD-Challenge Finalist & Team Captain 2012 ,  Prom Committee 2010 and 2012 University of Surrey Bachelor of Science (BSc),  Economics and Finance 2014  – 2017 Activities and Societies:  Economics and Finance Society (Head of Finance ,  First Year Representative ,  Research Team) ,  Sailing University of Surrey Bachelor of Science (BSc),  Economics and Finance 2014  – 2017 Activities and Societies:  Economics and Finance Society (Head of Finance ,  First Year Representative ,  Research Team) ,  Sailing University of Surrey Bachelor of Science (BSc),  Economics and Finance 2014  – 2017 Activities and Societies:  Economics and Finance Society (Head of Finance ,  First Year Representative ,  Research Team) ,  Sailing The Cambridge Institute Vienna Cambridge English: Advanced,  English (CEFR C2) , A 2012  – 2013 The Cambridge Institute Vienna Cambridge English: Advanced,  English (CEFR C2) , A 2012  – 2013 The Cambridge Institute Vienna Cambridge English: Advanced,  English (CEFR C2) , A 2012  – 2013 Upper-Secondary Academic School for Students of Music Reifeprüfungszeugnis/Matura,  Trumpet , Passed with Distinction 2010  – 2013 Activities and Societies:  Elected Class Representative 2013 and 2012 ,  Head of Finance (Prom) 2010\nYPD-Challenge Finalist & Team Captain 2012 ,  Prom Committee 2010 and 2012 Upper-Secondary Academic School for Students of Music Reifeprüfungszeugnis/Matura,  Trumpet , Passed with Distinction 2010  – 2013 Activities and Societies:  Elected Class Representative 2013 and 2012 ,  Head of Finance (Prom) 2010\nYPD-Challenge Finalist & Team Captain 2012 ,  Prom Committee 2010 and 2012 Upper-Secondary Academic School for Students of Music Reifeprüfungszeugnis/Matura,  Trumpet , Passed with Distinction 2010  – 2013 Activities and Societies:  Elected Class Representative 2013 and 2012 ,  Head of Finance (Prom) 2010\nYPD-Challenge Finalist & Team Captain 2012 ,  Prom Committee 2010 and 2012 Honors & Awards Dr. Hans-Riegel-Fachpreis 2013 Kaiserschild-Stiftung September 2013 2nd place for: \"The Phenomenon of Speculative Bubbles - Development and Consequences\" \nAward for Outstanding Science Papers \n Dr. Hans-Riegel-Fachpreis 2013 Kaiserschild-Stiftung September 2013 2nd place for: \"The Phenomenon of Speculative Bubbles - Development and Consequences\" \nAward for Outstanding Science Papers \n Dr. Hans-Riegel-Fachpreis 2013 Kaiserschild-Stiftung September 2013 2nd place for: \"The Phenomenon of Speculative Bubbles - Development and Consequences\" \nAward for Outstanding Science Papers \n Dr. Hans-Riegel-Fachpreis 2013 Kaiserschild-Stiftung September 2013 2nd place for: \"The Phenomenon of Speculative Bubbles - Development and Consequences\" \nAward for Outstanding Science Papers \n ", "Experience Sales Assistant IBM Deutschland GmbH November 2012  – Present (2 years 10 months) Sales Assistant IBM Deutschland GmbH November 2012  – Present (2 years 10 months) Sales Assistant IBM Deutschland GmbH November 2012  – Present (2 years 10 months) Education „Transilvania” University, Brasov, Romania, Faculty of Economics Master’s Degree,  International Business 2008  – 2010 „Transilvania” University, Brasov, Romania, Faculty of Economics Master’s Degree,  International Business 2008  – 2010 „Transilvania” University, Brasov, Romania, Faculty of Economics Master’s Degree,  International Business 2008  – 2010 „Transilvania” University, Brasov, Romania, Faculty of Economics Master’s Degree,  International Business 2008  – 2010 "]}