{"position": "Sales Enablement", "company": "IBM", "profiles": ["Experience Cloud Sales Enablement IBM June 1979  – Present (36 years 3 months) Field Sales Enablement IBM Corporation January 1999  –  December 2013  (15 years) Raleigh-Durham, North Carolina Area Cloud Sales Enablement IBM June 1979  – Present (36 years 3 months) Cloud Sales Enablement IBM June 1979  – Present (36 years 3 months) Field Sales Enablement IBM Corporation January 1999  –  December 2013  (15 years) Raleigh-Durham, North Carolina Area Field Sales Enablement IBM Corporation January 1999  –  December 2013  (15 years) Raleigh-Durham, North Carolina Area Skills Cloud Computing Business Development Program Management Virtualization Solution Selling SaaS Enterprise Architecture Enterprise Software Change Management Process Improvement Sales Enablement Analysis Integration Disaster Recovery Business Intelligence Strategy Security IT Strategy Business Analysis Solution Architecture See 5+     See less Skills  Cloud Computing Business Development Program Management Virtualization Solution Selling SaaS Enterprise Architecture Enterprise Software Change Management Process Improvement Sales Enablement Analysis Integration Disaster Recovery Business Intelligence Strategy Security IT Strategy Business Analysis Solution Architecture See 5+     See less Cloud Computing Business Development Program Management Virtualization Solution Selling SaaS Enterprise Architecture Enterprise Software Change Management Process Improvement Sales Enablement Analysis Integration Disaster Recovery Business Intelligence Strategy Security IT Strategy Business Analysis Solution Architecture See 5+     See less Cloud Computing Business Development Program Management Virtualization Solution Selling SaaS Enterprise Architecture Enterprise Software Change Management Process Improvement Sales Enablement Analysis Integration Disaster Recovery Business Intelligence Strategy Security IT Strategy Business Analysis Solution Architecture See 5+     See less Education North Carolina State University Computer Science North Carolina State University Computer Science North Carolina State University Computer Science North Carolina State University Computer Science ", "Languages French French French Skills Instructional Design Project Management Instructor-led Training Captivate E-Learning Requirements Analysis UML Technical Writing Testing Software Documentation Software Development SysML Management Leadership CRM Systems Engineering Employee Training Team Leadership Dreamweaver Rhapsody Agile Methodologies Strategy Technical Training Camtasia System Architecture SaaS Blended Learning Start-ups Project Planning Technical Documentation MPLS Product Management Networking E-commerce DNS OSPF Business Process Design Web Analytics Sendmail Internet Services DHCPv6 Distance Learning Professional Audio Hybrid Cloud Cloud management Cloud Computing See 31+     See less Skills  Instructional Design Project Management Instructor-led Training Captivate E-Learning Requirements Analysis UML Technical Writing Testing Software Documentation Software Development SysML Management Leadership CRM Systems Engineering Employee Training Team Leadership Dreamweaver Rhapsody Agile Methodologies Strategy Technical Training Camtasia System Architecture SaaS Blended Learning Start-ups Project Planning Technical Documentation MPLS Product Management Networking E-commerce DNS OSPF Business Process Design Web Analytics Sendmail Internet Services DHCPv6 Distance Learning Professional Audio Hybrid Cloud Cloud management Cloud Computing See 31+     See less Instructional Design Project Management Instructor-led Training Captivate E-Learning Requirements Analysis UML Technical Writing Testing Software Documentation Software Development SysML Management Leadership CRM Systems Engineering Employee Training Team Leadership Dreamweaver Rhapsody Agile Methodologies Strategy Technical Training Camtasia System Architecture SaaS Blended Learning Start-ups Project Planning Technical Documentation MPLS Product Management Networking E-commerce DNS OSPF Business Process Design Web Analytics Sendmail Internet Services DHCPv6 Distance Learning Professional Audio Hybrid Cloud Cloud management Cloud Computing See 31+     See less Instructional Design Project Management Instructor-led Training Captivate E-Learning Requirements Analysis UML Technical Writing Testing Software Documentation Software Development SysML Management Leadership CRM Systems Engineering Employee Training Team Leadership Dreamweaver Rhapsody Agile Methodologies Strategy Technical Training Camtasia System Architecture SaaS Blended Learning Start-ups Project Planning Technical Documentation MPLS Product Management Networking E-commerce DNS OSPF Business Process Design Web Analytics Sendmail Internet Services DHCPv6 Distance Learning Professional Audio Hybrid Cloud Cloud management Cloud Computing See 31+     See less Honors & Awards ", "Summary Working at IBM for more than 20 years has provided me an incredible opportunity to learn the ins and outs of the enterprise software business. I am most proud of my skills in Channel development and Sales Enablement. \n \nMy work experience with Business Partners has included licensing, Inside and Outside Channel Sales, OEM Software Sales, Strategic Alliance Management and in depth expertise working in partnership with Value Added Distributors. Software enablement skills include classroom event development and execution, development of online learning communities, and development of portable learning assets. Throughout my career, I have worked with sellers around the globe. \n \nSpecialties: Software Routes to Market, Channel Process & Strategy,International business Software enablement best practices, Social Media, Summary Working at IBM for more than 20 years has provided me an incredible opportunity to learn the ins and outs of the enterprise software business. I am most proud of my skills in Channel development and Sales Enablement. \n \nMy work experience with Business Partners has included licensing, Inside and Outside Channel Sales, OEM Software Sales, Strategic Alliance Management and in depth expertise working in partnership with Value Added Distributors. Software enablement skills include classroom event development and execution, development of online learning communities, and development of portable learning assets. Throughout my career, I have worked with sellers around the globe. \n \nSpecialties: Software Routes to Market, Channel Process & Strategy,International business Software enablement best practices, Social Media, Working at IBM for more than 20 years has provided me an incredible opportunity to learn the ins and outs of the enterprise software business. I am most proud of my skills in Channel development and Sales Enablement. \n \nMy work experience with Business Partners has included licensing, Inside and Outside Channel Sales, OEM Software Sales, Strategic Alliance Management and in depth expertise working in partnership with Value Added Distributors. Software enablement skills include classroom event development and execution, development of online learning communities, and development of portable learning assets. Throughout my career, I have worked with sellers around the globe. \n \nSpecialties: Software Routes to Market, Channel Process & Strategy,International business Software enablement best practices, Social Media, Working at IBM for more than 20 years has provided me an incredible opportunity to learn the ins and outs of the enterprise software business. I am most proud of my skills in Channel development and Sales Enablement. \n \nMy work experience with Business Partners has included licensing, Inside and Outside Channel Sales, OEM Software Sales, Strategic Alliance Management and in depth expertise working in partnership with Value Added Distributors. Software enablement skills include classroom event development and execution, development of online learning communities, and development of portable learning assets. Throughout my career, I have worked with sellers around the globe. \n \nSpecialties: Software Routes to Market, Channel Process & Strategy,International business Software enablement best practices, Social Media, Skills Sales Enablement Software Sales Channel Channel Marketing OEM Strategy Development Solution Selling Channel Partners Alliances Product Launch SMB Channel Management Product Marketing Go-to-market Strategy Consultative Selling Sales Process Enterprise Software Strategic Partnerships Demand Generation Business Alliances Multi-channel Marketing Software Industry Strategy Selling Oracle Enterprise... Cloud Computing Management Leadership SaaS Business Development Partner Management Program Management Strategic Alliances CRM Sales Channel Sales Lead Generation Professional Services Pre-sales Competitive Analysis Marketing See 26+     See less Skills  Sales Enablement Software Sales Channel Channel Marketing OEM Strategy Development Solution Selling Channel Partners Alliances Product Launch SMB Channel Management Product Marketing Go-to-market Strategy Consultative Selling Sales Process Enterprise Software Strategic Partnerships Demand Generation Business Alliances Multi-channel Marketing Software Industry Strategy Selling Oracle Enterprise... Cloud Computing Management Leadership SaaS Business Development Partner Management Program Management Strategic Alliances CRM Sales Channel Sales Lead Generation Professional Services Pre-sales Competitive Analysis Marketing See 26+     See less Sales Enablement Software Sales Channel Channel Marketing OEM Strategy Development Solution Selling Channel Partners Alliances Product Launch SMB Channel Management Product Marketing Go-to-market Strategy Consultative Selling Sales Process Enterprise Software Strategic Partnerships Demand Generation Business Alliances Multi-channel Marketing Software Industry Strategy Selling Oracle Enterprise... Cloud Computing Management Leadership SaaS Business Development Partner Management Program Management Strategic Alliances CRM Sales Channel Sales Lead Generation Professional Services Pre-sales Competitive Analysis Marketing See 26+     See less Sales Enablement Software Sales Channel Channel Marketing OEM Strategy Development Solution Selling Channel Partners Alliances Product Launch SMB Channel Management Product Marketing Go-to-market Strategy Consultative Selling Sales Process Enterprise Software Strategic Partnerships Demand Generation Business Alliances Multi-channel Marketing Software Industry Strategy Selling Oracle Enterprise... Cloud Computing Management Leadership SaaS Business Development Partner Management Program Management Strategic Alliances CRM Sales Channel Sales Lead Generation Professional Services Pre-sales Competitive Analysis Marketing See 26+     See less ", "Summary Performance-focused Sales executive with 13 years of experience in the technology industry working with clients ranging in size from small enterprise to the Fortune 100. Recognized for being a thought leader with strong decision making abilities, excellent communications skills, and the talent to consistently apply innovative solutions to client requirements and client value proposition development. \n \nExtensive background in sales execution, negotiating multi-million dollar deals, leading cross functional teams, and delivering high client satisfaction. \n \nSummary of Qualifications: \n♦ Sales Leadership & Team Building \n♦ Driving Revenue & Profit Growth in white space territories \n♦ Complex Deal Making with Large Enterprise / Fortune 100 customers \n♦ P&L Responsibility for $MM annual business for IBM \n♦ Multi-level Client Relationship Development \n♦ Experience with Cloud, Business Analytics & Big Data Summary Performance-focused Sales executive with 13 years of experience in the technology industry working with clients ranging in size from small enterprise to the Fortune 100. Recognized for being a thought leader with strong decision making abilities, excellent communications skills, and the talent to consistently apply innovative solutions to client requirements and client value proposition development. \n \nExtensive background in sales execution, negotiating multi-million dollar deals, leading cross functional teams, and delivering high client satisfaction. \n \nSummary of Qualifications: \n♦ Sales Leadership & Team Building \n♦ Driving Revenue & Profit Growth in white space territories \n♦ Complex Deal Making with Large Enterprise / Fortune 100 customers \n♦ P&L Responsibility for $MM annual business for IBM \n♦ Multi-level Client Relationship Development \n♦ Experience with Cloud, Business Analytics & Big Data Performance-focused Sales executive with 13 years of experience in the technology industry working with clients ranging in size from small enterprise to the Fortune 100. Recognized for being a thought leader with strong decision making abilities, excellent communications skills, and the talent to consistently apply innovative solutions to client requirements and client value proposition development. \n \nExtensive background in sales execution, negotiating multi-million dollar deals, leading cross functional teams, and delivering high client satisfaction. \n \nSummary of Qualifications: \n♦ Sales Leadership & Team Building \n♦ Driving Revenue & Profit Growth in white space territories \n♦ Complex Deal Making with Large Enterprise / Fortune 100 customers \n♦ P&L Responsibility for $MM annual business for IBM \n♦ Multi-level Client Relationship Development \n♦ Experience with Cloud, Business Analytics & Big Data Performance-focused Sales executive with 13 years of experience in the technology industry working with clients ranging in size from small enterprise to the Fortune 100. Recognized for being a thought leader with strong decision making abilities, excellent communications skills, and the talent to consistently apply innovative solutions to client requirements and client value proposition development. \n \nExtensive background in sales execution, negotiating multi-million dollar deals, leading cross functional teams, and delivering high client satisfaction. \n \nSummary of Qualifications: \n♦ Sales Leadership & Team Building \n♦ Driving Revenue & Profit Growth in white space territories \n♦ Complex Deal Making with Large Enterprise / Fortune 100 customers \n♦ P&L Responsibility for $MM annual business for IBM \n♦ Multi-level Client Relationship Development \n♦ Experience with Cloud, Business Analytics & Big Data Experience Southeast District Sales Manager - Data Storage Solutions IBM July 2012  – Present (3 years 2 months) Greater Atlanta Area Given responsibility for a historically underperforming Southeast territory in July 2012. Implemented immediate sales and technical resource team changes, business process improvements, aggressive sales campaigns with a focus on driving efficiency for clients, resulting in consistent revenue and profit growth over a 24 month period. Received IBM Top Contributor rating for 2012 & 2013. \n \n• Currently manage a team of 8 experienced Sales Professionals supporting 18 of IBM's top 100 accounts across North America. \n• Accountable for delivering business results to the IBM company with revenue objectives in 2012 and 2013 of approximately $70M each year. \n• Personally engages with clients on multiple levels with a focus on strategic initiatives such as Big Data, Business Analytics, Cloud Computing, Data Cost Efficiency, and Next Generation Technologies \n• Oversee responsibility for hiring and recruiting experienced professionals and college graduates with a passion for sales and delivering strong results in a continuously evolving and competitive IT industry. \n• Effectively manage forecasting, budget, P&L and investment decisions within my geography Systems Software Sales Executive - Southeast and Mid-Atlantic U.S. IBM January 2011  –  July 2012  (1 year 7 months) Responsible for regional sales of IBM Virtualization, Management, and Availability software solutions to large enterprise and general business customers in the eastern United States. Provide thought leadership and sales enablement to IBM and Business Partner sellers to improve sales execution across lines of business and bundling of IBM Systems Software with enterprise server and storage systems. Focus solutions areas include Storage Optimization, Systems Management, Cross Platform Virtualization, and Cloud Computing. North America Midrange Disk Sales Manager IBM October 2008  –  December 2010  (2 years 3 months) Responsible for sales, management, and growth of IBM’s midrange disk storage systems in North America. Manage IBM DS3000 and DS5000 product families to exceed revenue and profit targets by providing product strategy, education, and sales enablement to IBM and Business Partner sellers. Responsibilities include cost management to maximize product profitability, development of short-term and long-term channel strategy and incentives, and ensuring appropriate product skill mix is maintained for IBM Resellers Channel Sales & Enablement Manager IBM January 2008  –  October 2008  (10 months) Responsible for the development, management, and growth of IBM’s value and high volume channels in support of the overall Storage systems business plan and solution portfolio. Managed a specialized Business Partner program designed to drive incremental revenue and SMB market expansion through extensive partner training, resource enablement, and demand generating events for profiled resellers. Provided sales strategy, roadmaps, and guidance to the ibm.com website design team to ensure internet content and messaging aligned with the overall brand’s business goals, current market dynamics, and focus on SMB growth. Account Executive IBM May 2003  –  December 2007  (4 years 8 months) Managed client relationships and presented IBM Systems sales and technology initiatives to management & executives of strategic Healthcare partners and clients such as McKesson, GE Healthcare, Siemens, and FUJIFilm Medical. Developed and executed business plans that included ISV growth, industry certifications, and revenue generating seminars to drive opportunities throughout a national territory. Negotiated, structured, and closed multiple enterprise deals ($1+ million) focused on business continuity and information lifecycle management to large metropolitan hospitals. Storage Sales Representative IBM August 2001  –  April 2003  (1 year 9 months) Engaged in field sales to build customer relationships, propose solutions, and close opportunities to grow IBM Storage revenue within the East region. Presented enterprise solutions involving SAN, NAS, and Tape technology to IT management and “C” level executives. Southeast District Sales Manager - Data Storage Solutions IBM July 2012  – Present (3 years 2 months) Greater Atlanta Area Given responsibility for a historically underperforming Southeast territory in July 2012. Implemented immediate sales and technical resource team changes, business process improvements, aggressive sales campaigns with a focus on driving efficiency for clients, resulting in consistent revenue and profit growth over a 24 month period. Received IBM Top Contributor rating for 2012 & 2013. \n \n• Currently manage a team of 8 experienced Sales Professionals supporting 18 of IBM's top 100 accounts across North America. \n• Accountable for delivering business results to the IBM company with revenue objectives in 2012 and 2013 of approximately $70M each year. \n• Personally engages with clients on multiple levels with a focus on strategic initiatives such as Big Data, Business Analytics, Cloud Computing, Data Cost Efficiency, and Next Generation Technologies \n• Oversee responsibility for hiring and recruiting experienced professionals and college graduates with a passion for sales and delivering strong results in a continuously evolving and competitive IT industry. \n• Effectively manage forecasting, budget, P&L and investment decisions within my geography Southeast District Sales Manager - Data Storage Solutions IBM July 2012  – Present (3 years 2 months) Greater Atlanta Area Given responsibility for a historically underperforming Southeast territory in July 2012. Implemented immediate sales and technical resource team changes, business process improvements, aggressive sales campaigns with a focus on driving efficiency for clients, resulting in consistent revenue and profit growth over a 24 month period. Received IBM Top Contributor rating for 2012 & 2013. \n \n• Currently manage a team of 8 experienced Sales Professionals supporting 18 of IBM's top 100 accounts across North America. \n• Accountable for delivering business results to the IBM company with revenue objectives in 2012 and 2013 of approximately $70M each year. \n• Personally engages with clients on multiple levels with a focus on strategic initiatives such as Big Data, Business Analytics, Cloud Computing, Data Cost Efficiency, and Next Generation Technologies \n• Oversee responsibility for hiring and recruiting experienced professionals and college graduates with a passion for sales and delivering strong results in a continuously evolving and competitive IT industry. \n• Effectively manage forecasting, budget, P&L and investment decisions within my geography Systems Software Sales Executive - Southeast and Mid-Atlantic U.S. IBM January 2011  –  July 2012  (1 year 7 months) Responsible for regional sales of IBM Virtualization, Management, and Availability software solutions to large enterprise and general business customers in the eastern United States. Provide thought leadership and sales enablement to IBM and Business Partner sellers to improve sales execution across lines of business and bundling of IBM Systems Software with enterprise server and storage systems. Focus solutions areas include Storage Optimization, Systems Management, Cross Platform Virtualization, and Cloud Computing. Systems Software Sales Executive - Southeast and Mid-Atlantic U.S. IBM January 2011  –  July 2012  (1 year 7 months) Responsible for regional sales of IBM Virtualization, Management, and Availability software solutions to large enterprise and general business customers in the eastern United States. Provide thought leadership and sales enablement to IBM and Business Partner sellers to improve sales execution across lines of business and bundling of IBM Systems Software with enterprise server and storage systems. Focus solutions areas include Storage Optimization, Systems Management, Cross Platform Virtualization, and Cloud Computing. North America Midrange Disk Sales Manager IBM October 2008  –  December 2010  (2 years 3 months) Responsible for sales, management, and growth of IBM’s midrange disk storage systems in North America. Manage IBM DS3000 and DS5000 product families to exceed revenue and profit targets by providing product strategy, education, and sales enablement to IBM and Business Partner sellers. Responsibilities include cost management to maximize product profitability, development of short-term and long-term channel strategy and incentives, and ensuring appropriate product skill mix is maintained for IBM Resellers North America Midrange Disk Sales Manager IBM October 2008  –  December 2010  (2 years 3 months) Responsible for sales, management, and growth of IBM’s midrange disk storage systems in North America. Manage IBM DS3000 and DS5000 product families to exceed revenue and profit targets by providing product strategy, education, and sales enablement to IBM and Business Partner sellers. Responsibilities include cost management to maximize product profitability, development of short-term and long-term channel strategy and incentives, and ensuring appropriate product skill mix is maintained for IBM Resellers Channel Sales & Enablement Manager IBM January 2008  –  October 2008  (10 months) Responsible for the development, management, and growth of IBM’s value and high volume channels in support of the overall Storage systems business plan and solution portfolio. Managed a specialized Business Partner program designed to drive incremental revenue and SMB market expansion through extensive partner training, resource enablement, and demand generating events for profiled resellers. Provided sales strategy, roadmaps, and guidance to the ibm.com website design team to ensure internet content and messaging aligned with the overall brand’s business goals, current market dynamics, and focus on SMB growth. Channel Sales & Enablement Manager IBM January 2008  –  October 2008  (10 months) Responsible for the development, management, and growth of IBM’s value and high volume channels in support of the overall Storage systems business plan and solution portfolio. Managed a specialized Business Partner program designed to drive incremental revenue and SMB market expansion through extensive partner training, resource enablement, and demand generating events for profiled resellers. Provided sales strategy, roadmaps, and guidance to the ibm.com website design team to ensure internet content and messaging aligned with the overall brand’s business goals, current market dynamics, and focus on SMB growth. Account Executive IBM May 2003  –  December 2007  (4 years 8 months) Managed client relationships and presented IBM Systems sales and technology initiatives to management & executives of strategic Healthcare partners and clients such as McKesson, GE Healthcare, Siemens, and FUJIFilm Medical. Developed and executed business plans that included ISV growth, industry certifications, and revenue generating seminars to drive opportunities throughout a national territory. Negotiated, structured, and closed multiple enterprise deals ($1+ million) focused on business continuity and information lifecycle management to large metropolitan hospitals. Account Executive IBM May 2003  –  December 2007  (4 years 8 months) Managed client relationships and presented IBM Systems sales and technology initiatives to management & executives of strategic Healthcare partners and clients such as McKesson, GE Healthcare, Siemens, and FUJIFilm Medical. Developed and executed business plans that included ISV growth, industry certifications, and revenue generating seminars to drive opportunities throughout a national territory. Negotiated, structured, and closed multiple enterprise deals ($1+ million) focused on business continuity and information lifecycle management to large metropolitan hospitals. Storage Sales Representative IBM August 2001  –  April 2003  (1 year 9 months) Engaged in field sales to build customer relationships, propose solutions, and close opportunities to grow IBM Storage revenue within the East region. Presented enterprise solutions involving SAN, NAS, and Tape technology to IT management and “C” level executives. Storage Sales Representative IBM August 2001  –  April 2003  (1 year 9 months) Engaged in field sales to build customer relationships, propose solutions, and close opportunities to grow IBM Storage revenue within the East region. Presented enterprise solutions involving SAN, NAS, and Tape technology to IT management and “C” level executives. Languages   Skills CRM Selling Cloud Computing Solution Selling Enterprise Software Storage Channel Storage Solutions Storage Virtualization Virtualization Data Center NAS Strategy Solution Architecture Product Management Sales Enablement SAN Sales Operations Account Management Servers See 5+     See less Skills  CRM Selling Cloud Computing Solution Selling Enterprise Software Storage Channel Storage Solutions Storage Virtualization Virtualization Data Center NAS Strategy Solution Architecture Product Management Sales Enablement SAN Sales Operations Account Management Servers See 5+     See less CRM Selling Cloud Computing Solution Selling Enterprise Software Storage Channel Storage Solutions Storage Virtualization Virtualization Data Center NAS Strategy Solution Architecture Product Management Sales Enablement SAN Sales Operations Account Management Servers See 5+     See less CRM Selling Cloud Computing Solution Selling Enterprise Software Storage Channel Storage Solutions Storage Virtualization Virtualization Data Center NAS Strategy Solution Architecture Product Management Sales Enablement SAN Sales Operations Account Management Servers See 5+     See less Education Clemson University Bachelors of Science,  Computer Engineering 1997  – 2001 Activities and Societies:  Calhoun Honors College Clemson University Bachelors of Science,  Computer Engineering 1997  – 2001 Activities and Societies:  Calhoun Honors College Clemson University Bachelors of Science,  Computer Engineering 1997  – 2001 Activities and Societies:  Calhoun Honors College Clemson University Bachelors of Science,  Computer Engineering 1997  – 2001 Activities and Societies:  Calhoun Honors College Honors & Awards ", "Languages English Native or bilingual proficiency French Native or bilingual proficiency English Native or bilingual proficiency French Native or bilingual proficiency English Native or bilingual proficiency French Native or bilingual proficiency Native or bilingual proficiency Native or bilingual proficiency Skills Product Management Business Rules Program Management Project Management Strategy Management Training Sales Sales Enablement Websphere Public Speaking Solution Selling Integration Product Marketing Business Intelligence Business Development Cross-functional Team... Software Project... User Experience Research Enterprise Software Start-ups BRMS Business Analysis ILOG Software Development Sales Operations Business Process Design Leadership SaaS Enterprise Architecture WebSphere See 17+     See less Skills  Product Management Business Rules Program Management Project Management Strategy Management Training Sales Sales Enablement Websphere Public Speaking Solution Selling Integration Product Marketing Business Intelligence Business Development Cross-functional Team... Software Project... User Experience Research Enterprise Software Start-ups BRMS Business Analysis ILOG Software Development Sales Operations Business Process Design Leadership SaaS Enterprise Architecture WebSphere See 17+     See less Product Management Business Rules Program Management Project Management Strategy Management Training Sales Sales Enablement Websphere Public Speaking Solution Selling Integration Product Marketing Business Intelligence Business Development Cross-functional Team... Software Project... User Experience Research Enterprise Software Start-ups BRMS Business Analysis ILOG Software Development Sales Operations Business Process Design Leadership SaaS Enterprise Architecture WebSphere See 17+     See less Product Management Business Rules Program Management Project Management Strategy Management Training Sales Sales Enablement Websphere Public Speaking Solution Selling Integration Product Marketing Business Intelligence Business Development Cross-functional Team... Software Project... User Experience Research Enterprise Software Start-ups BRMS Business Analysis ILOG Software Development Sales Operations Business Process Design Leadership SaaS Enterprise Architecture WebSphere See 17+     See less ", "Skills Rational Team Concert Agile Methodologies RUP Rational ClearQuest Sales Enablement Requirements Management Technical Leadership Solution Architecture SDLC SOA Software Engineering Integration Enterprise Architecture Skills  Rational Team Concert Agile Methodologies RUP Rational ClearQuest Sales Enablement Requirements Management Technical Leadership Solution Architecture SDLC SOA Software Engineering Integration Enterprise Architecture Rational Team Concert Agile Methodologies RUP Rational ClearQuest Sales Enablement Requirements Management Technical Leadership Solution Architecture SDLC SOA Software Engineering Integration Enterprise Architecture Rational Team Concert Agile Methodologies RUP Rational ClearQuest Sales Enablement Requirements Management Technical Leadership Solution Architecture SDLC SOA Software Engineering Integration Enterprise Architecture ", "Languages English Native or bilingual proficiency French Native or bilingual proficiency English Native or bilingual proficiency French Native or bilingual proficiency English Native or bilingual proficiency French Native or bilingual proficiency Native or bilingual proficiency Native or bilingual proficiency Skills Analytics Campaign Management Marketing Automation Pre-sales Database Marketing Product Management Unica Business Intelligence Data Warehousing Salesforce.com Sales Enablement SaaS Software Sales Solution Selling Enterprise Software Web Analytics Online Marketing Team Management People Management Sales Support Data Mining Direct Marketing Email Marketing Marketing Strategy Business Strategy Product Marketing Multi-channel Marketing B2B Software Industry Demand Generation Sales Operations E-commerce Management Strategy CRM Professional Services Cloud Computing Go-to-market Strategy Segmentation Presales See 25+     See less Skills  Analytics Campaign Management Marketing Automation Pre-sales Database Marketing Product Management Unica Business Intelligence Data Warehousing Salesforce.com Sales Enablement SaaS Software Sales Solution Selling Enterprise Software Web Analytics Online Marketing Team Management People Management Sales Support Data Mining Direct Marketing Email Marketing Marketing Strategy Business Strategy Product Marketing Multi-channel Marketing B2B Software Industry Demand Generation Sales Operations E-commerce Management Strategy CRM Professional Services Cloud Computing Go-to-market Strategy Segmentation Presales See 25+     See less Analytics Campaign Management Marketing Automation Pre-sales Database Marketing Product Management Unica Business Intelligence Data Warehousing Salesforce.com Sales Enablement SaaS Software Sales Solution Selling Enterprise Software Web Analytics Online Marketing Team Management People Management Sales Support Data Mining Direct Marketing Email Marketing Marketing Strategy Business Strategy Product Marketing Multi-channel Marketing B2B Software Industry Demand Generation Sales Operations E-commerce Management Strategy CRM Professional Services Cloud Computing Go-to-market Strategy Segmentation Presales See 25+     See less Analytics Campaign Management Marketing Automation Pre-sales Database Marketing Product Management Unica Business Intelligence Data Warehousing Salesforce.com Sales Enablement SaaS Software Sales Solution Selling Enterprise Software Web Analytics Online Marketing Team Management People Management Sales Support Data Mining Direct Marketing Email Marketing Marketing Strategy Business Strategy Product Marketing Multi-channel Marketing B2B Software Industry Demand Generation Sales Operations E-commerce Management Strategy CRM Professional Services Cloud Computing Go-to-market Strategy Segmentation Presales See 25+     See less ", "Skills Skills     Honors & Awards ", "Skills Team Building Multi-channel Marketing Integration Business Development Go-to-market Strategy VDI Cloud Computing Citrix Solution Selling Sales Enterprise Software Channel Sales Enablement SaaS Analytics IT Strategy Demand Generation Software Development Security Business Alliances IBM System X 2nd line... CRM Solution Architecture Partner Management Channel Partners Cross-functional Team... Pre-sales Software Industry Enterprise Architecture Professional Services Business Intelligence Consulting Outsourcing Managed Services Strategy Product Management See 21+     See less Skills  Team Building Multi-channel Marketing Integration Business Development Go-to-market Strategy VDI Cloud Computing Citrix Solution Selling Sales Enterprise Software Channel Sales Enablement SaaS Analytics IT Strategy Demand Generation Software Development Security Business Alliances IBM System X 2nd line... CRM Solution Architecture Partner Management Channel Partners Cross-functional Team... Pre-sales Software Industry Enterprise Architecture Professional Services Business Intelligence Consulting Outsourcing Managed Services Strategy Product Management See 21+     See less Team Building Multi-channel Marketing Integration Business Development Go-to-market Strategy VDI Cloud Computing Citrix Solution Selling Sales Enterprise Software Channel Sales Enablement SaaS Analytics IT Strategy Demand Generation Software Development Security Business Alliances IBM System X 2nd line... CRM Solution Architecture Partner Management Channel Partners Cross-functional Team... Pre-sales Software Industry Enterprise Architecture Professional Services Business Intelligence Consulting Outsourcing Managed Services Strategy Product Management See 21+     See less Team Building Multi-channel Marketing Integration Business Development Go-to-market Strategy VDI Cloud Computing Citrix Solution Selling Sales Enterprise Software Channel Sales Enablement SaaS Analytics IT Strategy Demand Generation Software Development Security Business Alliances IBM System X 2nd line... CRM Solution Architecture Partner Management Channel Partners Cross-functional Team... Pre-sales Software Industry Enterprise Architecture Professional Services Business Intelligence Consulting Outsourcing Managed Services Strategy Product Management See 21+     See less ", "Skills Web and Digital Strategy Understanding Customer... User Experience Design Content Strategy Editorial Policy and... Collaboration Tools Global E-commerce Business Architecture Business Transformation Requirements Management Leadership Demand Generation Cloud Computing Information Technology Sales Enablement IT Strategy Software Project... Information Architecture User Experience Digital Marketing SaaS Enterprise Software Cross-functional Team... Thought Leadership Strategy CRM Business Development Solution Architecture Enterprise Architecture Digital Strategy Go-to-market Strategy E-commerce Usability Testing Lead Generation Analytics User-centered Design Marketing Governance See 23+     See less Skills  Web and Digital Strategy Understanding Customer... User Experience Design Content Strategy Editorial Policy and... Collaboration Tools Global E-commerce Business Architecture Business Transformation Requirements Management Leadership Demand Generation Cloud Computing Information Technology Sales Enablement IT Strategy Software Project... Information Architecture User Experience Digital Marketing SaaS Enterprise Software Cross-functional Team... Thought Leadership Strategy CRM Business Development Solution Architecture Enterprise Architecture Digital Strategy Go-to-market Strategy E-commerce Usability Testing Lead Generation Analytics User-centered Design Marketing Governance See 23+     See less Web and Digital Strategy Understanding Customer... User Experience Design Content Strategy Editorial Policy and... Collaboration Tools Global E-commerce Business Architecture Business Transformation Requirements Management Leadership Demand Generation Cloud Computing Information Technology Sales Enablement IT Strategy Software Project... Information Architecture User Experience Digital Marketing SaaS Enterprise Software Cross-functional Team... Thought Leadership Strategy CRM Business Development Solution Architecture Enterprise Architecture Digital Strategy Go-to-market Strategy E-commerce Usability Testing Lead Generation Analytics User-centered Design Marketing Governance See 23+     See less Web and Digital Strategy Understanding Customer... User Experience Design Content Strategy Editorial Policy and... Collaboration Tools Global E-commerce Business Architecture Business Transformation Requirements Management Leadership Demand Generation Cloud Computing Information Technology Sales Enablement IT Strategy Software Project... Information Architecture User Experience Digital Marketing SaaS Enterprise Software Cross-functional Team... Thought Leadership Strategy CRM Business Development Solution Architecture Enterprise Architecture Digital Strategy Go-to-market Strategy E-commerce Usability Testing Lead Generation Analytics User-centered Design Marketing Governance See 23+     See less ", "Skills Social Media Marketing Integrated Marketing Sales Enablement Interactive Marketing Channel Internal & External... Demand Generation Digital Marketing Lead Generation Multi-channel Marketing Marketing Communications B2B Marketing Online Advertising Web Analytics Social Media Thought Leadership Digital Strategy Marketing Strategy Web Content Management Content Management Facebook Strategy Email Marketing Blogging Strategic Communications Go-to-market Strategy PPC SEO Public Relations Marketing Management Management Enterprise Software Web Marketing Brand Management Corporate Communications Content Strategy Advertising Product Marketing Online Marketing Newsletters Business Development Start-ups Mobile Marketing Entrepreneurship SEM Content Development Leadership Web Content Direct Marketing Marketing See 35+     See less Skills  Social Media Marketing Integrated Marketing Sales Enablement Interactive Marketing Channel Internal & External... Demand Generation Digital Marketing Lead Generation Multi-channel Marketing Marketing Communications B2B Marketing Online Advertising Web Analytics Social Media Thought Leadership Digital Strategy Marketing Strategy Web Content Management Content Management Facebook Strategy Email Marketing Blogging Strategic Communications Go-to-market Strategy PPC SEO Public Relations Marketing Management Management Enterprise Software Web Marketing Brand Management Corporate Communications Content Strategy Advertising Product Marketing Online Marketing Newsletters Business Development Start-ups Mobile Marketing Entrepreneurship SEM Content Development Leadership Web Content Direct Marketing Marketing See 35+     See less Social Media Marketing Integrated Marketing Sales Enablement Interactive Marketing Channel Internal & External... Demand Generation Digital Marketing Lead Generation Multi-channel Marketing Marketing Communications B2B Marketing Online Advertising Web Analytics Social Media Thought Leadership Digital Strategy Marketing Strategy Web Content Management Content Management Facebook Strategy Email Marketing Blogging Strategic Communications Go-to-market Strategy PPC SEO Public Relations Marketing Management Management Enterprise Software Web Marketing Brand Management Corporate Communications Content Strategy Advertising Product Marketing Online Marketing Newsletters Business Development Start-ups Mobile Marketing Entrepreneurship SEM Content Development Leadership Web Content Direct Marketing Marketing See 35+     See less Social Media Marketing Integrated Marketing Sales Enablement Interactive Marketing Channel Internal & External... Demand Generation Digital Marketing Lead Generation Multi-channel Marketing Marketing Communications B2B Marketing Online Advertising Web Analytics Social Media Thought Leadership Digital Strategy Marketing Strategy Web Content Management Content Management Facebook Strategy Email Marketing Blogging Strategic Communications Go-to-market Strategy PPC SEO Public Relations Marketing Management Management Enterprise Software Web Marketing Brand Management Corporate Communications Content Strategy Advertising Product Marketing Online Marketing Newsletters Business Development Start-ups Mobile Marketing Entrepreneurship SEM Content Development Leadership Web Content Direct Marketing Marketing See 35+     See less ", "Skills Outsourcing IT Strategy Program Management Integration Management Business Analysis Project Management Cloud Computing Vendor Management Requirements Analysis Business Intelligence Business Process... SDLC Enterprise Architecture Enterprise Software Business Process Project Portfolio... Solution Architecture PMP Software Project... Pre-sales SaaS See 7+     See less Skills  Outsourcing IT Strategy Program Management Integration Management Business Analysis Project Management Cloud Computing Vendor Management Requirements Analysis Business Intelligence Business Process... SDLC Enterprise Architecture Enterprise Software Business Process Project Portfolio... Solution Architecture PMP Software Project... Pre-sales SaaS See 7+     See less Outsourcing IT Strategy Program Management Integration Management Business Analysis Project Management Cloud Computing Vendor Management Requirements Analysis Business Intelligence Business Process... SDLC Enterprise Architecture Enterprise Software Business Process Project Portfolio... Solution Architecture PMP Software Project... Pre-sales SaaS See 7+     See less Outsourcing IT Strategy Program Management Integration Management Business Analysis Project Management Cloud Computing Vendor Management Requirements Analysis Business Intelligence Business Process... SDLC Enterprise Architecture Enterprise Software Business Process Project Portfolio... Solution Architecture PMP Software Project... Pre-sales SaaS See 7+     See less ", "Experience WW IBM System Storage Sales Enablement IBM November 1997  – Present (17 years 10 months) Austin, Texas 1997-1999 - Product Evangelist for Swr Dist, Invt \n1999-2001 - WW Evangelist for all Tivoli Software \n2001-2003 - Technical Mktg Mgr Tivoli Software Americas \n2003-2007 - WW Software Evangelist for all IBM Software with IBM Software LIVE! \n2007-2012 - WW Software Evangelist Tivoli Storage Software \n2012-Now - WW IBM System Storage Software Sales Enablement WW IBM System Storage Sales Enablement IBM November 1997  – Present (17 years 10 months) Austin, Texas 1997-1999 - Product Evangelist for Swr Dist, Invt \n1999-2001 - WW Evangelist for all Tivoli Software \n2001-2003 - Technical Mktg Mgr Tivoli Software Americas \n2003-2007 - WW Software Evangelist for all IBM Software with IBM Software LIVE! \n2007-2012 - WW Software Evangelist Tivoli Storage Software \n2012-Now - WW IBM System Storage Software Sales Enablement WW IBM System Storage Sales Enablement IBM November 1997  – Present (17 years 10 months) Austin, Texas 1997-1999 - Product Evangelist for Swr Dist, Invt \n1999-2001 - WW Evangelist for all Tivoli Software \n2001-2003 - Technical Mktg Mgr Tivoli Software Americas \n2003-2007 - WW Software Evangelist for all IBM Software with IBM Software LIVE! \n2007-2012 - WW Software Evangelist Tivoli Storage Software \n2012-Now - WW IBM System Storage Software Sales Enablement Languages Spanish Spanish Spanish Skills Pre-sales Sales Sales Enablement Sales Training Selling Skills Sales Process Solution Selling Storage Enterprise Software Public Speaking Motivational Speaking Cloud Computing Strategic Partnerships Servers Virtualization Management Go-to-market Strategy Delivering Technical... See 3+     See less Skills  Pre-sales Sales Sales Enablement Sales Training Selling Skills Sales Process Solution Selling Storage Enterprise Software Public Speaking Motivational Speaking Cloud Computing Strategic Partnerships Servers Virtualization Management Go-to-market Strategy Delivering Technical... See 3+     See less Pre-sales Sales Sales Enablement Sales Training Selling Skills Sales Process Solution Selling Storage Enterprise Software Public Speaking Motivational Speaking Cloud Computing Strategic Partnerships Servers Virtualization Management Go-to-market Strategy Delivering Technical... See 3+     See less Pre-sales Sales Sales Enablement Sales Training Selling Skills Sales Process Solution Selling Storage Enterprise Software Public Speaking Motivational Speaking Cloud Computing Strategic Partnerships Servers Virtualization Management Go-to-market Strategy Delivering Technical... See 3+     See less ", "Experience Manager, Executive Briefing Center and Technical Sales Enablement IBM March 2014  – Present (1 year 6 months) Poughkeepsie, NY Manage Executive Briefing Center program, hosting worldwide clients interested in learning about IBM's emerging technologies, strategic direction and point of view. Provide technical sales teams with enablement assets to deliver client value. Manager - Technical Sales Enablement IBM January 2012  – Present (3 years 8 months) Poughkeepsie, NY Provide sales and technical sales teams with deep Lab-Development skills to solve the most difficult technical challenges while advancing the client's business requirements and overall agenda. Sales and Marketing Specialist IBM September 2010  – Present (5 years) Systems and Technology Group - Client Centers / Technical Sales Support Principal, Managed Network Services IBM Global Services June 2008  –  September 2010  (2 years 4 months) IT Svcs Manager IBM July 2006  –  May 2008  (1 year 11 months) Operations Director Frontier Communications 1991  –  2006  (15 years) Manager, Executive Briefing Center and Technical Sales Enablement IBM March 2014  – Present (1 year 6 months) Poughkeepsie, NY Manage Executive Briefing Center program, hosting worldwide clients interested in learning about IBM's emerging technologies, strategic direction and point of view. Provide technical sales teams with enablement assets to deliver client value. Manager, Executive Briefing Center and Technical Sales Enablement IBM March 2014  – Present (1 year 6 months) Poughkeepsie, NY Manage Executive Briefing Center program, hosting worldwide clients interested in learning about IBM's emerging technologies, strategic direction and point of view. Provide technical sales teams with enablement assets to deliver client value. Manager - Technical Sales Enablement IBM January 2012  – Present (3 years 8 months) Poughkeepsie, NY Provide sales and technical sales teams with deep Lab-Development skills to solve the most difficult technical challenges while advancing the client's business requirements and overall agenda. Manager - Technical Sales Enablement IBM January 2012  – Present (3 years 8 months) Poughkeepsie, NY Provide sales and technical sales teams with deep Lab-Development skills to solve the most difficult technical challenges while advancing the client's business requirements and overall agenda. Sales and Marketing Specialist IBM September 2010  – Present (5 years) Systems and Technology Group - Client Centers / Technical Sales Support Sales and Marketing Specialist IBM September 2010  – Present (5 years) Systems and Technology Group - Client Centers / Technical Sales Support Principal, Managed Network Services IBM Global Services June 2008  –  September 2010  (2 years 4 months) Principal, Managed Network Services IBM Global Services June 2008  –  September 2010  (2 years 4 months) IT Svcs Manager IBM July 2006  –  May 2008  (1 year 11 months) IT Svcs Manager IBM July 2006  –  May 2008  (1 year 11 months) Operations Director Frontier Communications 1991  –  2006  (15 years) Operations Director Frontier Communications 1991  –  2006  (15 years) Skills Managed Services Vendor Management Account Management Networking Solution Selling Enterprise Software Business Intelligence Program Management Pre-sales CRM Integration Sales Operations Business Development IT Strategy Cloud Computing Selling Go-to-market Strategy Telecommunications Direct Sales SaaS Sales Management Sales Enablement Sales Process Professional Services Outsourcing Strategic Partnerships Data Center Strategy Management Sales See 15+     See less Skills  Managed Services Vendor Management Account Management Networking Solution Selling Enterprise Software Business Intelligence Program Management Pre-sales CRM Integration Sales Operations Business Development IT Strategy Cloud Computing Selling Go-to-market Strategy Telecommunications Direct Sales SaaS Sales Management Sales Enablement Sales Process Professional Services Outsourcing Strategic Partnerships Data Center Strategy Management Sales See 15+     See less Managed Services Vendor Management Account Management Networking Solution Selling Enterprise Software Business Intelligence Program Management Pre-sales CRM Integration Sales Operations Business Development IT Strategy Cloud Computing Selling Go-to-market Strategy Telecommunications Direct Sales SaaS Sales Management Sales Enablement Sales Process Professional Services Outsourcing Strategic Partnerships Data Center Strategy Management Sales See 15+     See less Managed Services Vendor Management Account Management Networking Solution Selling Enterprise Software Business Intelligence Program Management Pre-sales CRM Integration Sales Operations Business Development IT Strategy Cloud Computing Selling Go-to-market Strategy Telecommunications Direct Sales SaaS Sales Management Sales Enablement Sales Process Professional Services Outsourcing Strategic Partnerships Data Center Strategy Management Sales See 15+     See less Education SUNY Polytechnic Institute BS,  Engineering - Telecommunications , 3.89 Summa Cum Laude 1989 SUNY Polytechnic Institute BS,  Engineering - Telecommunications , 3.89 Summa Cum Laude 1989 SUNY Polytechnic Institute BS,  Engineering - Telecommunications , 3.89 Summa Cum Laude 1989 SUNY Polytechnic Institute BS,  Engineering - Telecommunications , 3.89 Summa Cum Laude 1989 ", "Experience Director - Tivoli Sales Enablement IBM Director - Tivoli Sales Enablement IBM Director - Tivoli Sales Enablement IBM ", "Experience IBM Sales Enablement IBM Europe May 2011  – Present (4 years 4 months) Rennes Area, France IBM Sales Enablement IBM Europe May 2011  – Present (4 years 4 months) Rennes Area, France IBM Sales Enablement IBM Europe May 2011  – Present (4 years 4 months) Rennes Area, France Skills Digital Marketing Demand Generation Sales Enablement Multi-channel Marketing Lead Generation Online Advertising Marketing Strategy SEM Web Analytics Digital Strategy Web 2.0 Marketing Management B2B Marketing B2B Internal Communications Account Management Public Relations Email Marketing Content Management Strategy Social Media Management Integrated Marketing Leadership Advertising Interactive Marketing Project Management Online Marketing See 13+     See less Skills  Digital Marketing Demand Generation Sales Enablement Multi-channel Marketing Lead Generation Online Advertising Marketing Strategy SEM Web Analytics Digital Strategy Web 2.0 Marketing Management B2B Marketing B2B Internal Communications Account Management Public Relations Email Marketing Content Management Strategy Social Media Management Integrated Marketing Leadership Advertising Interactive Marketing Project Management Online Marketing See 13+     See less Digital Marketing Demand Generation Sales Enablement Multi-channel Marketing Lead Generation Online Advertising Marketing Strategy SEM Web Analytics Digital Strategy Web 2.0 Marketing Management B2B Marketing B2B Internal Communications Account Management Public Relations Email Marketing Content Management Strategy Social Media Management Integrated Marketing Leadership Advertising Interactive Marketing Project Management Online Marketing See 13+     See less Digital Marketing Demand Generation Sales Enablement Multi-channel Marketing Lead Generation Online Advertising Marketing Strategy SEM Web Analytics Digital Strategy Web 2.0 Marketing Management B2B Marketing B2B Internal Communications Account Management Public Relations Email Marketing Content Management Strategy Social Media Management Integrated Marketing Leadership Advertising Interactive Marketing Project Management Online Marketing See 13+     See less Honors & Awards ", "Summary Luke has over twenty years of graphic design experience that includes art and creative direction, production, budget and vendor management, and procurement. He has worked in many different settings for a variety of clients, which has given him a comprehensive view of marketing and branding. He has worked in agencies, coporate retail, and not-for-profit settings, and has also run a successful freelance studio. In all his ventures, he has always aimed to deliver innovative, relevant and intriguing solutions for his clients, their customers and the brand. \n \nClients include: AthenaHealth, Boston Idea Group, Brookstone, Cambridge Dept. of Public Health, CDW, Covidien , Dunkin’ Donuts, IBM, Impact on Education, Massachusetts Audubon Society, McKesson Health Solutions, Miracles for Mito, nSource IT, SAP, SmartWatt Energy, TEC, The Cambridge Health Alliance, Thomson Reuters, TOGO’s, and more... \n \nSpecialties: Art Direction, creative direction, graphic design and production. Adobe Creative Suite 4.0, Microsoft Office, Accessibility Compliance. Summary Luke has over twenty years of graphic design experience that includes art and creative direction, production, budget and vendor management, and procurement. He has worked in many different settings for a variety of clients, which has given him a comprehensive view of marketing and branding. He has worked in agencies, coporate retail, and not-for-profit settings, and has also run a successful freelance studio. In all his ventures, he has always aimed to deliver innovative, relevant and intriguing solutions for his clients, their customers and the brand. \n \nClients include: AthenaHealth, Boston Idea Group, Brookstone, Cambridge Dept. of Public Health, CDW, Covidien , Dunkin’ Donuts, IBM, Impact on Education, Massachusetts Audubon Society, McKesson Health Solutions, Miracles for Mito, nSource IT, SAP, SmartWatt Energy, TEC, The Cambridge Health Alliance, Thomson Reuters, TOGO’s, and more... \n \nSpecialties: Art Direction, creative direction, graphic design and production. Adobe Creative Suite 4.0, Microsoft Office, Accessibility Compliance. Luke has over twenty years of graphic design experience that includes art and creative direction, production, budget and vendor management, and procurement. He has worked in many different settings for a variety of clients, which has given him a comprehensive view of marketing and branding. He has worked in agencies, coporate retail, and not-for-profit settings, and has also run a successful freelance studio. In all his ventures, he has always aimed to deliver innovative, relevant and intriguing solutions for his clients, their customers and the brand. \n \nClients include: AthenaHealth, Boston Idea Group, Brookstone, Cambridge Dept. of Public Health, CDW, Covidien , Dunkin’ Donuts, IBM, Impact on Education, Massachusetts Audubon Society, McKesson Health Solutions, Miracles for Mito, nSource IT, SAP, SmartWatt Energy, TEC, The Cambridge Health Alliance, Thomson Reuters, TOGO’s, and more... \n \nSpecialties: Art Direction, creative direction, graphic design and production. Adobe Creative Suite 4.0, Microsoft Office, Accessibility Compliance. Luke has over twenty years of graphic design experience that includes art and creative direction, production, budget and vendor management, and procurement. He has worked in many different settings for a variety of clients, which has given him a comprehensive view of marketing and branding. He has worked in agencies, coporate retail, and not-for-profit settings, and has also run a successful freelance studio. In all his ventures, he has always aimed to deliver innovative, relevant and intriguing solutions for his clients, their customers and the brand. \n \nClients include: AthenaHealth, Boston Idea Group, Brookstone, Cambridge Dept. of Public Health, CDW, Covidien , Dunkin’ Donuts, IBM, Impact on Education, Massachusetts Audubon Society, McKesson Health Solutions, Miracles for Mito, nSource IT, SAP, SmartWatt Energy, TEC, The Cambridge Health Alliance, Thomson Reuters, TOGO’s, and more... \n \nSpecialties: Art Direction, creative direction, graphic design and production. Adobe Creative Suite 4.0, Microsoft Office, Accessibility Compliance. Experience Marketing Manager Umpqua Feather Merchants October 2014  – Present (11 months) Louisville, Colorado Board Member Miracles for Mito February 2011  – Present (4 years 7 months) Denver, CO Serving on the board for this non profit which provides resources and outreach for families affected by Mitochondrial Disease. Creative/Art Director and Designer LJW Design April 2009  – Present (6 years 5 months) Broomfield, CO Running a freelance creative studio offering, creative/art direction, production, and copy writing for both Web and print projects. Presently working with a variety of clients in the energy, IT, healthcare, financial and nonprofit industries. Creative Marketing Manager Umpqua Feather Merchants November 2011  –  October 2014  (3 years) Louisville, Colorado Managing multiple creative projects including catalog and collateral design, social media, advertising, retail and merchandising. Art Director Leopard Communications September 2005  –  April 2009  (3 years 8 months) Broomfield, CO Managing Art Director for a multi-million dollar B2B communications agency. Primary focus was on sales enablement for IBM Global Technology Services and Covidien. Projects included collateral, interactive presentations, advertising, Web and e-mail projects, creative platforms, sales kits and more. Art Director Leopard Communications, an Ogilvy Company September 2005  –  April 2009  (3 years 8 months) Broomfield, CO Managing Art Director for a multi-million dollar B2B communications agency. Primary focus was on sales enablement for IBM Global Technology Services and Covidien. Projects included collateral, interactive presentations, advertising, Web and e-mail projects, creative platforms, sales kits and more. Art Director/Senior Graphic Designer Brookstone January 2002  –  August 2005  (3 years 8 months) Merrimack, NH Responsible for designing multiple retail components for this nationally recognized retail organization. Projects included in-store promotions and graphics, packaging, direct mail, navigation design, and advertising. Concepted the design and direction of multiple corporate annual reports and other corporate collateral. Directly supervised and served as art director over junior designers and freelance personnel. Closely collaborated with the direct marketing and Internet teams on catalog design, e-mail campaigns, Web development, and direct-mail projects. Designer Coolhand Design 1995  –  2005  (10 years) Andover, MA Worked on several freelance projects for a variety of clients, such as a medical industry company, a national retail food company, and the Massachusetts Audubon Society. Projects included in-store collateral materials, packaging, logo and identity designs, brochures, direct mail, and Web design. Marketing Manager Umpqua Feather Merchants October 2014  – Present (11 months) Louisville, Colorado Marketing Manager Umpqua Feather Merchants October 2014  – Present (11 months) Louisville, Colorado Board Member Miracles for Mito February 2011  – Present (4 years 7 months) Denver, CO Serving on the board for this non profit which provides resources and outreach for families affected by Mitochondrial Disease. Board Member Miracles for Mito February 2011  – Present (4 years 7 months) Denver, CO Serving on the board for this non profit which provides resources and outreach for families affected by Mitochondrial Disease. Creative/Art Director and Designer LJW Design April 2009  – Present (6 years 5 months) Broomfield, CO Running a freelance creative studio offering, creative/art direction, production, and copy writing for both Web and print projects. Presently working with a variety of clients in the energy, IT, healthcare, financial and nonprofit industries. Creative/Art Director and Designer LJW Design April 2009  – Present (6 years 5 months) Broomfield, CO Running a freelance creative studio offering, creative/art direction, production, and copy writing for both Web and print projects. Presently working with a variety of clients in the energy, IT, healthcare, financial and nonprofit industries. Creative Marketing Manager Umpqua Feather Merchants November 2011  –  October 2014  (3 years) Louisville, Colorado Managing multiple creative projects including catalog and collateral design, social media, advertising, retail and merchandising. Creative Marketing Manager Umpqua Feather Merchants November 2011  –  October 2014  (3 years) Louisville, Colorado Managing multiple creative projects including catalog and collateral design, social media, advertising, retail and merchandising. Art Director Leopard Communications September 2005  –  April 2009  (3 years 8 months) Broomfield, CO Managing Art Director for a multi-million dollar B2B communications agency. Primary focus was on sales enablement for IBM Global Technology Services and Covidien. Projects included collateral, interactive presentations, advertising, Web and e-mail projects, creative platforms, sales kits and more. Art Director Leopard Communications September 2005  –  April 2009  (3 years 8 months) Broomfield, CO Managing Art Director for a multi-million dollar B2B communications agency. Primary focus was on sales enablement for IBM Global Technology Services and Covidien. Projects included collateral, interactive presentations, advertising, Web and e-mail projects, creative platforms, sales kits and more. Art Director Leopard Communications, an Ogilvy Company September 2005  –  April 2009  (3 years 8 months) Broomfield, CO Managing Art Director for a multi-million dollar B2B communications agency. Primary focus was on sales enablement for IBM Global Technology Services and Covidien. Projects included collateral, interactive presentations, advertising, Web and e-mail projects, creative platforms, sales kits and more. Art Director Leopard Communications, an Ogilvy Company September 2005  –  April 2009  (3 years 8 months) Broomfield, CO Managing Art Director for a multi-million dollar B2B communications agency. Primary focus was on sales enablement for IBM Global Technology Services and Covidien. Projects included collateral, interactive presentations, advertising, Web and e-mail projects, creative platforms, sales kits and more. Art Director/Senior Graphic Designer Brookstone January 2002  –  August 2005  (3 years 8 months) Merrimack, NH Responsible for designing multiple retail components for this nationally recognized retail organization. Projects included in-store promotions and graphics, packaging, direct mail, navigation design, and advertising. Concepted the design and direction of multiple corporate annual reports and other corporate collateral. Directly supervised and served as art director over junior designers and freelance personnel. Closely collaborated with the direct marketing and Internet teams on catalog design, e-mail campaigns, Web development, and direct-mail projects. Art Director/Senior Graphic Designer Brookstone January 2002  –  August 2005  (3 years 8 months) Merrimack, NH Responsible for designing multiple retail components for this nationally recognized retail organization. Projects included in-store promotions and graphics, packaging, direct mail, navigation design, and advertising. Concepted the design and direction of multiple corporate annual reports and other corporate collateral. Directly supervised and served as art director over junior designers and freelance personnel. Closely collaborated with the direct marketing and Internet teams on catalog design, e-mail campaigns, Web development, and direct-mail projects. Designer Coolhand Design 1995  –  2005  (10 years) Andover, MA Worked on several freelance projects for a variety of clients, such as a medical industry company, a national retail food company, and the Massachusetts Audubon Society. Projects included in-store collateral materials, packaging, logo and identity designs, brochures, direct mail, and Web design. Designer Coolhand Design 1995  –  2005  (10 years) Andover, MA Worked on several freelance projects for a variety of clients, such as a medical industry company, a national retail food company, and the Massachusetts Audubon Society. Projects included in-store collateral materials, packaging, logo and identity designs, brochures, direct mail, and Web design. Skills Creative Direction Art Direction Graphic Design Brochures Direct Marketing Web Design Adobe Creative Suite Advertising Online Advertising Copywriting Digital Media Marketing Layout Graphics Illustrator Brand Development Logo Design InDesign Packaging Marketing Communications Photoshop Digital Marketing Newsletters Integrated Marketing Illustration B2B Adobe Acrobat Social Media Flash Marketing Strategy Social Media Marketing Strategy Direct Mail Email Marketing Interactive Advertising Management See 21+     See less Skills  Creative Direction Art Direction Graphic Design Brochures Direct Marketing Web Design Adobe Creative Suite Advertising Online Advertising Copywriting Digital Media Marketing Layout Graphics Illustrator Brand Development Logo Design InDesign Packaging Marketing Communications Photoshop Digital Marketing Newsletters Integrated Marketing Illustration B2B Adobe Acrobat Social Media Flash Marketing Strategy Social Media Marketing Strategy Direct Mail Email Marketing Interactive Advertising Management See 21+     See less Creative Direction Art Direction Graphic Design Brochures Direct Marketing Web Design Adobe Creative Suite Advertising Online Advertising Copywriting Digital Media Marketing Layout Graphics Illustrator Brand Development Logo Design InDesign Packaging Marketing Communications Photoshop Digital Marketing Newsletters Integrated Marketing Illustration B2B Adobe Acrobat Social Media Flash Marketing Strategy Social Media Marketing Strategy Direct Mail Email Marketing Interactive Advertising Management See 21+     See less Creative Direction Art Direction Graphic Design Brochures Direct Marketing Web Design Adobe Creative Suite Advertising Online Advertising Copywriting Digital Media Marketing Layout Graphics Illustrator Brand Development Logo Design InDesign Packaging Marketing Communications Photoshop Digital Marketing Newsletters Integrated Marketing Illustration B2B Adobe Acrobat Social Media Flash Marketing Strategy Social Media Marketing Strategy Direct Mail Email Marketing Interactive Advertising Management See 21+     See less Education Massachusetts College of Art and Design Certification,  Graphic Design 1999  – 2002 Middlebury College Bachelor of Arts,  Geography and Northern Studies 1989  – 1993 Activities and Societies:  Kappa Delta Rho Fraternity Hurricaine Island Outward Bound School East Coast Island Explorer 1988  – 1988 Completed a semester course exploring the east coast. Skills focused on were group dynamics, individual leadership, sailing, white water canoeing, mountain and rock climbing, and basic survival. Phillips Andover Academy High School,  All 1985  – 1988 Massachusetts College of Art and Design Certification,  Graphic Design 1999  – 2002 Massachusetts College of Art and Design Certification,  Graphic Design 1999  – 2002 Massachusetts College of Art and Design Certification,  Graphic Design 1999  – 2002 Middlebury College Bachelor of Arts,  Geography and Northern Studies 1989  – 1993 Activities and Societies:  Kappa Delta Rho Fraternity Middlebury College Bachelor of Arts,  Geography and Northern Studies 1989  – 1993 Activities and Societies:  Kappa Delta Rho Fraternity Middlebury College Bachelor of Arts,  Geography and Northern Studies 1989  – 1993 Activities and Societies:  Kappa Delta Rho Fraternity Hurricaine Island Outward Bound School East Coast Island Explorer 1988  – 1988 Completed a semester course exploring the east coast. Skills focused on were group dynamics, individual leadership, sailing, white water canoeing, mountain and rock climbing, and basic survival. Hurricaine Island Outward Bound School East Coast Island Explorer 1988  – 1988 Completed a semester course exploring the east coast. Skills focused on were group dynamics, individual leadership, sailing, white water canoeing, mountain and rock climbing, and basic survival. Hurricaine Island Outward Bound School East Coast Island Explorer 1988  – 1988 Completed a semester course exploring the east coast. Skills focused on were group dynamics, individual leadership, sailing, white water canoeing, mountain and rock climbing, and basic survival. Phillips Andover Academy High School,  All 1985  – 1988 Phillips Andover Academy High School,  All 1985  – 1988 Phillips Andover Academy High School,  All 1985  – 1988 Honors & Awards Additional Honors & Awards Employee of the Month, Cambridge Health Alliance \nMerit Award, Leopard Communications \nBMA Gold, Art Direction Additional Honors & Awards Employee of the Month, Cambridge Health Alliance \nMerit Award, Leopard Communications \nBMA Gold, Art Direction Additional Honors & Awards Employee of the Month, Cambridge Health Alliance \nMerit Award, Leopard Communications \nBMA Gold, Art Direction Additional Honors & Awards Employee of the Month, Cambridge Health Alliance \nMerit Award, Leopard Communications \nBMA Gold, Art Direction ", "Skills SaaS Solution Selling Cloud Computing Sales Enablement Product Marketing Enterprise Software Instructional Design Sales Training Onboarding Product Management Customer Service Customer Service... B2B IBM Websphere Commerce Sterling Commerce Direct Sales Salesforce.com Selling Skills Go-to-market Strategy Sales Process Selling CRM Start-ups Professional Services Business Alliances Account Management Demand Generation Pre-sales Program Management Integration Training Management Software Industry Channel Partners Partner Management Strategic Partnerships Lead Generation Managed Services Cross-functional Team... Strategy E-commerce Business Intelligence Sales Competitive Analysis Sales Operations Business Development Vendor Management Consulting Outsourcing Mobile Devices See 35+     See less Skills  SaaS Solution Selling Cloud Computing Sales Enablement Product Marketing Enterprise Software Instructional Design Sales Training Onboarding Product Management Customer Service Customer Service... B2B IBM Websphere Commerce Sterling Commerce Direct Sales Salesforce.com Selling Skills Go-to-market Strategy Sales Process Selling CRM Start-ups Professional Services Business Alliances Account Management Demand Generation Pre-sales Program Management Integration Training Management Software Industry Channel Partners Partner Management Strategic Partnerships Lead Generation Managed Services Cross-functional Team... Strategy E-commerce Business Intelligence Sales Competitive Analysis Sales Operations Business Development Vendor Management Consulting Outsourcing Mobile Devices See 35+     See less SaaS Solution Selling Cloud Computing Sales Enablement Product Marketing Enterprise Software Instructional Design Sales Training Onboarding Product Management Customer Service Customer Service... B2B IBM Websphere Commerce Sterling Commerce Direct Sales Salesforce.com Selling Skills Go-to-market Strategy Sales Process Selling CRM Start-ups Professional Services Business Alliances Account Management Demand Generation Pre-sales Program Management Integration Training Management Software Industry Channel Partners Partner Management Strategic Partnerships Lead Generation Managed Services Cross-functional Team... Strategy E-commerce Business Intelligence Sales Competitive Analysis Sales Operations Business Development Vendor Management Consulting Outsourcing Mobile Devices See 35+     See less SaaS Solution Selling Cloud Computing Sales Enablement Product Marketing Enterprise Software Instructional Design Sales Training Onboarding Product Management Customer Service Customer Service... B2B IBM Websphere Commerce Sterling Commerce Direct Sales Salesforce.com Selling Skills Go-to-market Strategy Sales Process Selling CRM Start-ups Professional Services Business Alliances Account Management Demand Generation Pre-sales Program Management Integration Training Management Software Industry Channel Partners Partner Management Strategic Partnerships Lead Generation Managed Services Cross-functional Team... Strategy E-commerce Business Intelligence Sales Competitive Analysis Sales Operations Business Development Vendor Management Consulting Outsourcing Mobile Devices See 35+     See less "]}