{"position": "SAP ABAP Senior Developer", "company": "IBM", "profiles": ["Summary Senior SAP-ABAP Consultant having experience of full cycle SAP implementation, support and migration projects. Extensive knowledge in SAP-ABAP WRICEF area with more than 8 years of working experience in IBM Global Business Services. Experienced in Automotive, Telecommunication, Pharmaceutical, Agribusiness and Diversified Machinery industries. \n \nSkillset - \n \n* Report - Classical, ALV (Grid/ List/ Object Oriented), Interactive \n* Interface - ALE IDoc/EDI (Inbound/Outbound Enhancements and Configuration), RFC and Application/Presentation Server File transfer.  \n* Conversion - LSMW, BDC and BAPI \n* Enhancement - User Exit, Badi, Enhancement Spot, BTE and Substitution Exit \n* Forms - SAP Script, Smart forms and Adobe Print Forms \n* Module Pool Programming – RF Technique and HTML template designing for MX9 device \n* Workflow \n* ABAP Web Services  \n* Advanced debugging \n* Performance Tuning Summary Senior SAP-ABAP Consultant having experience of full cycle SAP implementation, support and migration projects. Extensive knowledge in SAP-ABAP WRICEF area with more than 8 years of working experience in IBM Global Business Services. Experienced in Automotive, Telecommunication, Pharmaceutical, Agribusiness and Diversified Machinery industries. \n \nSkillset - \n \n* Report - Classical, ALV (Grid/ List/ Object Oriented), Interactive \n* Interface - ALE IDoc/EDI (Inbound/Outbound Enhancements and Configuration), RFC and Application/Presentation Server File transfer.  \n* Conversion - LSMW, BDC and BAPI \n* Enhancement - User Exit, Badi, Enhancement Spot, BTE and Substitution Exit \n* Forms - SAP Script, Smart forms and Adobe Print Forms \n* Module Pool Programming – RF Technique and HTML template designing for MX9 device \n* Workflow \n* ABAP Web Services  \n* Advanced debugging \n* Performance Tuning Senior SAP-ABAP Consultant having experience of full cycle SAP implementation, support and migration projects. Extensive knowledge in SAP-ABAP WRICEF area with more than 8 years of working experience in IBM Global Business Services. Experienced in Automotive, Telecommunication, Pharmaceutical, Agribusiness and Diversified Machinery industries. \n \nSkillset - \n \n* Report - Classical, ALV (Grid/ List/ Object Oriented), Interactive \n* Interface - ALE IDoc/EDI (Inbound/Outbound Enhancements and Configuration), RFC and Application/Presentation Server File transfer.  \n* Conversion - LSMW, BDC and BAPI \n* Enhancement - User Exit, Badi, Enhancement Spot, BTE and Substitution Exit \n* Forms - SAP Script, Smart forms and Adobe Print Forms \n* Module Pool Programming – RF Technique and HTML template designing for MX9 device \n* Workflow \n* ABAP Web Services  \n* Advanced debugging \n* Performance Tuning Senior SAP-ABAP Consultant having experience of full cycle SAP implementation, support and migration projects. Extensive knowledge in SAP-ABAP WRICEF area with more than 8 years of working experience in IBM Global Business Services. Experienced in Automotive, Telecommunication, Pharmaceutical, Agribusiness and Diversified Machinery industries. \n \nSkillset - \n \n* Report - Classical, ALV (Grid/ List/ Object Oriented), Interactive \n* Interface - ALE IDoc/EDI (Inbound/Outbound Enhancements and Configuration), RFC and Application/Presentation Server File transfer.  \n* Conversion - LSMW, BDC and BAPI \n* Enhancement - User Exit, Badi, Enhancement Spot, BTE and Substitution Exit \n* Forms - SAP Script, Smart forms and Adobe Print Forms \n* Module Pool Programming – RF Technique and HTML template designing for MX9 device \n* Workflow \n* ABAP Web Services  \n* Advanced debugging \n* Performance Tuning Experience SAP ABAP Onsite Lead Developer IBM Global Business Services November 2011  – Present (3 years 10 months) Peoria, Illinois Area Consult and coordinate with Business to gather the requirements. Assist Functional Team in preparing Functional Specification with Technical inputs in various modules like SD, IM, WM, MM, PP, FI, CO, QM etc. Provide estimation and complexity of the ABAP developments. Coordinate with offshore India and Mexico team. Design and develop high complexity objects from onsite. Review ABAP code, Technical Specification and Unit Testing Document. Assist Functional Team in Unit Testing. Validate and apply OSS notes. Work on priority production tickets (incident as well as change management) from onsite in complex SAP Landscape containing ECC, SCM and GTS. Work as a transport co-ordinator for over all project and perform cutover activities prior to major and interim releases. SAP ABAP Technical Team Lead IBM Global Business Services July 2010  –  October 2011  (1 year 4 months) Kolkata Experienced as Technical Team Lead handling multiple projects. Assist team members in technical issues. Performed as Subject Matter Expert for quality review and performance improvement of ABAP programs. Experienced in working in Functional areas like Sales and Distribution, Inventory Management, Warehouse Management, Material Management, Production Panning, Finance and Costing. Worked on complex RICEF as a senior ABAP developer from offshore. Attended blue printing sessions for 3 months in client location Portsmouth, UK and provided best possible technical solution for client requirements. SAP ABAP Senior Developer IBM Global Business Services April 2009  –  June 2010  (1 year 3 months) Kolkata Worked on ABAP WRICEF, IDOC, RF Programming as a Senior Developer and guide junior team members. Perform quality review of programs. SAP ABAP Developer IBM Global Business Services August 2007  –  March 2009  (1 year 8 months) Kolkata Worked on ABAP WRICEF and Module Pool programming. Prepare Technical Specification an Unit Testing Document. SAP ABAP Onsite Lead Developer IBM Global Business Services November 2011  – Present (3 years 10 months) Peoria, Illinois Area Consult and coordinate with Business to gather the requirements. Assist Functional Team in preparing Functional Specification with Technical inputs in various modules like SD, IM, WM, MM, PP, FI, CO, QM etc. Provide estimation and complexity of the ABAP developments. Coordinate with offshore India and Mexico team. Design and develop high complexity objects from onsite. Review ABAP code, Technical Specification and Unit Testing Document. Assist Functional Team in Unit Testing. Validate and apply OSS notes. Work on priority production tickets (incident as well as change management) from onsite in complex SAP Landscape containing ECC, SCM and GTS. Work as a transport co-ordinator for over all project and perform cutover activities prior to major and interim releases. SAP ABAP Onsite Lead Developer IBM Global Business Services November 2011  – Present (3 years 10 months) Peoria, Illinois Area Consult and coordinate with Business to gather the requirements. Assist Functional Team in preparing Functional Specification with Technical inputs in various modules like SD, IM, WM, MM, PP, FI, CO, QM etc. Provide estimation and complexity of the ABAP developments. Coordinate with offshore India and Mexico team. Design and develop high complexity objects from onsite. Review ABAP code, Technical Specification and Unit Testing Document. Assist Functional Team in Unit Testing. Validate and apply OSS notes. Work on priority production tickets (incident as well as change management) from onsite in complex SAP Landscape containing ECC, SCM and GTS. Work as a transport co-ordinator for over all project and perform cutover activities prior to major and interim releases. SAP ABAP Technical Team Lead IBM Global Business Services July 2010  –  October 2011  (1 year 4 months) Kolkata Experienced as Technical Team Lead handling multiple projects. Assist team members in technical issues. Performed as Subject Matter Expert for quality review and performance improvement of ABAP programs. Experienced in working in Functional areas like Sales and Distribution, Inventory Management, Warehouse Management, Material Management, Production Panning, Finance and Costing. Worked on complex RICEF as a senior ABAP developer from offshore. Attended blue printing sessions for 3 months in client location Portsmouth, UK and provided best possible technical solution for client requirements. SAP ABAP Technical Team Lead IBM Global Business Services July 2010  –  October 2011  (1 year 4 months) Kolkata Experienced as Technical Team Lead handling multiple projects. Assist team members in technical issues. Performed as Subject Matter Expert for quality review and performance improvement of ABAP programs. Experienced in working in Functional areas like Sales and Distribution, Inventory Management, Warehouse Management, Material Management, Production Panning, Finance and Costing. Worked on complex RICEF as a senior ABAP developer from offshore. Attended blue printing sessions for 3 months in client location Portsmouth, UK and provided best possible technical solution for client requirements. SAP ABAP Senior Developer IBM Global Business Services April 2009  –  June 2010  (1 year 3 months) Kolkata Worked on ABAP WRICEF, IDOC, RF Programming as a Senior Developer and guide junior team members. Perform quality review of programs. SAP ABAP Senior Developer IBM Global Business Services April 2009  –  June 2010  (1 year 3 months) Kolkata Worked on ABAP WRICEF, IDOC, RF Programming as a Senior Developer and guide junior team members. Perform quality review of programs. SAP ABAP Developer IBM Global Business Services August 2007  –  March 2009  (1 year 8 months) Kolkata Worked on ABAP WRICEF and Module Pool programming. Prepare Technical Specification an Unit Testing Document. SAP ABAP Developer IBM Global Business Services August 2007  –  March 2009  (1 year 8 months) Kolkata Worked on ABAP WRICEF and Module Pool programming. Prepare Technical Specification an Unit Testing Document. Languages English Hindi Bengali English Hindi Bengali English Hindi Bengali Skills ABAP SAP Performance Tuning SAP ERP SAP R/3 IDOC Advanced debugging Requirements Analysis ABAP WRICEF Adobe Forms RF Programming Data Migration PL/SQL RFC SAP Netweaver BDC Technical Support Cross-functional... Client Relations SAP Workflow WebDynpro IDoc See 7+     See less Skills  ABAP SAP Performance Tuning SAP ERP SAP R/3 IDOC Advanced debugging Requirements Analysis ABAP WRICEF Adobe Forms RF Programming Data Migration PL/SQL RFC SAP Netweaver BDC Technical Support Cross-functional... Client Relations SAP Workflow WebDynpro IDoc See 7+     See less ABAP SAP Performance Tuning SAP ERP SAP R/3 IDOC Advanced debugging Requirements Analysis ABAP WRICEF Adobe Forms RF Programming Data Migration PL/SQL RFC SAP Netweaver BDC Technical Support Cross-functional... Client Relations SAP Workflow WebDynpro IDoc See 7+     See less ABAP SAP Performance Tuning SAP ERP SAP R/3 IDOC Advanced debugging Requirements Analysis ABAP WRICEF Adobe Forms RF Programming Data Migration PL/SQL RFC SAP Netweaver BDC Technical Support Cross-functional... Client Relations SAP Workflow WebDynpro IDoc See 7+     See less Education Bengal Engineering and Science University, Shibpur Master of Engineering,  Fluid Mechanics 2005  – 2007 Master of Engineering Kalyani Government Engineering College Bachelor of Technology,  Mechanical Engineering 2001  – 2005 Bachelor of Technology Bengal Engineering and Science University, Shibpur Master of Engineering,  Fluid Mechanics 2005  – 2007 Master of Engineering Bengal Engineering and Science University, Shibpur Master of Engineering,  Fluid Mechanics 2005  – 2007 Master of Engineering Bengal Engineering and Science University, Shibpur Master of Engineering,  Fluid Mechanics 2005  – 2007 Master of Engineering Kalyani Government Engineering College Bachelor of Technology,  Mechanical Engineering 2001  – 2005 Bachelor of Technology Kalyani Government Engineering College Bachelor of Technology,  Mechanical Engineering 2001  – 2005 Bachelor of Technology Kalyani Government Engineering College Bachelor of Technology,  Mechanical Engineering 2001  – 2005 Bachelor of Technology Honors & Awards Best developer of the month IBM Global Business Services ~ Client Caterpillar Inc. November 2008 Received 'Best developer of the month' recognition from client Caterpillar for delivering solution for complex RICEF in limited time frame IBM Blue Thanks Award IBM Global Business Services ~ Client Avaya Inc. September 2009 Received 'IBM Blue Thanks Award' from IBM USA Delivery Project Executive for extraordinary effort to achieve project success IBM Think Connect Recognition Award IBM Global Business Services ~ Client Pall Corporation December 2010 Received 'IBM Think Connect Recognition Award' from IBM Global Business Services for excellence in leadership and guiding capability Certificate of Excellence IBM Global Business Services ~ Client Caterpillar Inc. February 2014 Received 'Certificate of Excellence' from IBM USA Delivery Project Executive for excellent effort as Onsite Coordinator  Manager's Choice Award IBM Global Business Services ~ Client Caterpillar Inc. July 2014 Received 'Manager's Choice Award' from IBM India SAP Service Delivery Leader for Client Delight in Onsite Onsite Assignee Top Contributor Award IBM Global Business Services ~ Client Caterpillar Inc. July 2014 Received 'Onsite Assignee Top Contributor Award' from IBM Global Business Services for excellent performance in Onsite Best developer of the month IBM Global Business Services ~ Client Caterpillar Inc. November 2008 Received 'Best developer of the month' recognition from client Caterpillar for delivering solution for complex RICEF in limited time frame Best developer of the month IBM Global Business Services ~ Client Caterpillar Inc. November 2008 Received 'Best developer of the month' recognition from client Caterpillar for delivering solution for complex RICEF in limited time frame Best developer of the month IBM Global Business Services ~ Client Caterpillar Inc. November 2008 Received 'Best developer of the month' recognition from client Caterpillar for delivering solution for complex RICEF in limited time frame IBM Blue Thanks Award IBM Global Business Services ~ Client Avaya Inc. September 2009 Received 'IBM Blue Thanks Award' from IBM USA Delivery Project Executive for extraordinary effort to achieve project success IBM Blue Thanks Award IBM Global Business Services ~ Client Avaya Inc. September 2009 Received 'IBM Blue Thanks Award' from IBM USA Delivery Project Executive for extraordinary effort to achieve project success IBM Blue Thanks Award IBM Global Business Services ~ Client Avaya Inc. September 2009 Received 'IBM Blue Thanks Award' from IBM USA Delivery Project Executive for extraordinary effort to achieve project success IBM Think Connect Recognition Award IBM Global Business Services ~ Client Pall Corporation December 2010 Received 'IBM Think Connect Recognition Award' from IBM Global Business Services for excellence in leadership and guiding capability IBM Think Connect Recognition Award IBM Global Business Services ~ Client Pall Corporation December 2010 Received 'IBM Think Connect Recognition Award' from IBM Global Business Services for excellence in leadership and guiding capability IBM Think Connect Recognition Award IBM Global Business Services ~ Client Pall Corporation December 2010 Received 'IBM Think Connect Recognition Award' from IBM Global Business Services for excellence in leadership and guiding capability Certificate of Excellence IBM Global Business Services ~ Client Caterpillar Inc. February 2014 Received 'Certificate of Excellence' from IBM USA Delivery Project Executive for excellent effort as Onsite Coordinator  Certificate of Excellence IBM Global Business Services ~ Client Caterpillar Inc. February 2014 Received 'Certificate of Excellence' from IBM USA Delivery Project Executive for excellent effort as Onsite Coordinator  Certificate of Excellence IBM Global Business Services ~ Client Caterpillar Inc. February 2014 Received 'Certificate of Excellence' from IBM USA Delivery Project Executive for excellent effort as Onsite Coordinator  Manager's Choice Award IBM Global Business Services ~ Client Caterpillar Inc. July 2014 Received 'Manager's Choice Award' from IBM India SAP Service Delivery Leader for Client Delight in Onsite Manager's Choice Award IBM Global Business Services ~ Client Caterpillar Inc. July 2014 Received 'Manager's Choice Award' from IBM India SAP Service Delivery Leader for Client Delight in Onsite Manager's Choice Award IBM Global Business Services ~ Client Caterpillar Inc. July 2014 Received 'Manager's Choice Award' from IBM India SAP Service Delivery Leader for Client Delight in Onsite Onsite Assignee Top Contributor Award IBM Global Business Services ~ Client Caterpillar Inc. July 2014 Received 'Onsite Assignee Top Contributor Award' from IBM Global Business Services for excellent performance in Onsite Onsite Assignee Top Contributor Award IBM Global Business Services ~ Client Caterpillar Inc. July 2014 Received 'Onsite Assignee Top Contributor Award' from IBM Global Business Services for excellent performance in Onsite Onsite Assignee Top Contributor Award IBM Global Business Services ~ Client Caterpillar Inc. July 2014 Received 'Onsite Assignee Top Contributor Award' from IBM Global Business Services for excellent performance in Onsite ", "Experience SAP ABAP Senior Developer IBM March 2012  – Present (3 years 6 months) Gurgaon SAP ABAP Senior Engg Sopra Group April 2011  –  February 2012  (11 months) Noida Area, India System Engg Infosys December 2007  –  March 2011  (3 years 4 months) Chandigarh SAP ABAP Senior Developer IBM March 2012  – Present (3 years 6 months) Gurgaon SAP ABAP Senior Developer IBM March 2012  – Present (3 years 6 months) Gurgaon SAP ABAP Senior Engg Sopra Group April 2011  –  February 2012  (11 months) Noida Area, India SAP ABAP Senior Engg Sopra Group April 2011  –  February 2012  (11 months) Noida Area, India System Engg Infosys December 2007  –  March 2011  (3 years 4 months) Chandigarh System Engg Infosys December 2007  –  March 2011  (3 years 4 months) Chandigarh Skills BDC ABAP SAPScript Requirements Analysis SAP R/3 Linux Smartforms SAP ERP Skills  BDC ABAP SAPScript Requirements Analysis SAP R/3 Linux Smartforms SAP ERP BDC ABAP SAPScript Requirements Analysis SAP R/3 Linux Smartforms SAP ERP BDC ABAP SAPScript Requirements Analysis SAP R/3 Linux Smartforms SAP ERP Education Guru Jambeshwar University B. Tech,  ECE 2004  – 2007 Guru Jambeshwar University B. Tech,  ECE 2004  – 2007 Guru Jambeshwar University B. Tech,  ECE 2004  – 2007 Guru Jambeshwar University B. Tech,  ECE 2004  – 2007 ", "Summary I am a SAP Technical Consultant with more than eight years of work experience in SAP ABAP across all modules including R3 and APO as well as BW of APO. Have worked with some of the leading global clients in the Manufacturing Retail and the Consumer Product Goods sectors including Nestle, Marks & Spencer (M&S), General Motors (Chevrolet), PepsiCo, Philippe Morris International and the current one being British American Tobacco (BAT). Summary I am a SAP Technical Consultant with more than eight years of work experience in SAP ABAP across all modules including R3 and APO as well as BW of APO. Have worked with some of the leading global clients in the Manufacturing Retail and the Consumer Product Goods sectors including Nestle, Marks & Spencer (M&S), General Motors (Chevrolet), PepsiCo, Philippe Morris International and the current one being British American Tobacco (BAT). I am a SAP Technical Consultant with more than eight years of work experience in SAP ABAP across all modules including R3 and APO as well as BW of APO. Have worked with some of the leading global clients in the Manufacturing Retail and the Consumer Product Goods sectors including Nestle, Marks & Spencer (M&S), General Motors (Chevrolet), PepsiCo, Philippe Morris International and the current one being British American Tobacco (BAT). I am a SAP Technical Consultant with more than eight years of work experience in SAP ABAP across all modules including R3 and APO as well as BW of APO. Have worked with some of the leading global clients in the Manufacturing Retail and the Consumer Product Goods sectors including Nestle, Marks & Spencer (M&S), General Motors (Chevrolet), PepsiCo, Philippe Morris International and the current one being British American Tobacco (BAT). Experience SAP Technical Consultant IBM Global Services July 2006  – Present (9 years 2 months) London, United Kingdom SAP ABAP(ECC) , SAP APO technical consultant (ABAP +BW) \n \nExperience in the areas of Interfaces, ALV Reports, User Exits, ALE/IDOC, Module Pools and Smart Forms, Adobe Forms, APO BW, APO ABAP. \n \nWhile working closely at client site gained functional knowledge in APO(DC & SNP) and ECC-SAP Material Management (SAP MM), SAP Warehouse Management (SAP WM), SAP Sales & Distribution (SAP SD), IS-Retail,  \n \nOver the years built good knowledge on the end-to-end lifecycle of implementation projects in both ECC and APO system. SAP Abap Senior Developer IBM 2007  –  2008  (1 year) SAP Abap Developer IBM Global Services 2006  –  2007  (1 year) SAP Technical Consultant IBM Global Services July 2006  – Present (9 years 2 months) London, United Kingdom SAP ABAP(ECC) , SAP APO technical consultant (ABAP +BW) \n \nExperience in the areas of Interfaces, ALV Reports, User Exits, ALE/IDOC, Module Pools and Smart Forms, Adobe Forms, APO BW, APO ABAP. \n \nWhile working closely at client site gained functional knowledge in APO(DC & SNP) and ECC-SAP Material Management (SAP MM), SAP Warehouse Management (SAP WM), SAP Sales & Distribution (SAP SD), IS-Retail,  \n \nOver the years built good knowledge on the end-to-end lifecycle of implementation projects in both ECC and APO system. SAP Technical Consultant IBM Global Services July 2006  – Present (9 years 2 months) London, United Kingdom SAP ABAP(ECC) , SAP APO technical consultant (ABAP +BW) \n \nExperience in the areas of Interfaces, ALV Reports, User Exits, ALE/IDOC, Module Pools and Smart Forms, Adobe Forms, APO BW, APO ABAP. \n \nWhile working closely at client site gained functional knowledge in APO(DC & SNP) and ECC-SAP Material Management (SAP MM), SAP Warehouse Management (SAP WM), SAP Sales & Distribution (SAP SD), IS-Retail,  \n \nOver the years built good knowledge on the end-to-end lifecycle of implementation projects in both ECC and APO system. SAP Abap Senior Developer IBM 2007  –  2008  (1 year) SAP Abap Senior Developer IBM 2007  –  2008  (1 year) SAP Abap Developer IBM Global Services 2006  –  2007  (1 year) SAP Abap Developer IBM Global Services 2006  –  2007  (1 year) Skills ABAP SAP SAP R/3 SAP XI SAP Implementation IDOC Materials Management BDC Smartforms SAP SD BAPI SAPScript SAP MM ERP RFC ECC Business Analysis SAP ERP SAP HR Data Migration SAP Netweaver SD WebDynpro SAP CRM SAP Warehouse Management ALV See 11+     See less Skills  ABAP SAP SAP R/3 SAP XI SAP Implementation IDOC Materials Management BDC Smartforms SAP SD BAPI SAPScript SAP MM ERP RFC ECC Business Analysis SAP ERP SAP HR Data Migration SAP Netweaver SD WebDynpro SAP CRM SAP Warehouse Management ALV See 11+     See less ABAP SAP SAP R/3 SAP XI SAP Implementation IDOC Materials Management BDC Smartforms SAP SD BAPI SAPScript SAP MM ERP RFC ECC Business Analysis SAP ERP SAP HR Data Migration SAP Netweaver SD WebDynpro SAP CRM SAP Warehouse Management ALV See 11+     See less ABAP SAP SAP R/3 SAP XI SAP Implementation IDOC Materials Management BDC Smartforms SAP SD BAPI SAPScript SAP MM ERP RFC ECC Business Analysis SAP ERP SAP HR Data Migration SAP Netweaver SD WebDynpro SAP CRM SAP Warehouse Management ALV See 11+     See less Education Techno India MCA Techno India MCA Techno India MCA Techno India MCA ", "Experience ABAP WebUI Consultant IBM SAP ABAP Senior Developer IBM India Pvt. Ltd. September 2010  – Present (5 years) ABAP WebUI Consultant IBM ABAP WebUI Consultant IBM SAP ABAP Senior Developer IBM India Pvt. Ltd. September 2010  – Present (5 years) SAP ABAP Senior Developer IBM India Pvt. Ltd. September 2010  – Present (5 years) Languages Hindi Bengali Hindi Bengali Hindi Bengali Skills SAP ABAP ABAP Web Dynpro SAP Workflow Requirements Analysis Integration SAP ERP ERP Business Intelligence Business Process Business Analysis SQL Solution Architecture Java Skills  SAP ABAP ABAP Web Dynpro SAP Workflow Requirements Analysis Integration SAP ERP ERP Business Intelligence Business Process Business Analysis SQL Solution Architecture Java SAP ABAP ABAP Web Dynpro SAP Workflow Requirements Analysis Integration SAP ERP ERP Business Intelligence Business Process Business Analysis SQL Solution Architecture Java SAP ABAP ABAP Web Dynpro SAP Workflow Requirements Analysis Integration SAP ERP ERP Business Intelligence Business Process Business Analysis SQL Solution Architecture Java Education Techno India Bachelor's Degree,  Electronics and Communications Engineering 2006  – 2010 Vivekanada Institution, Howrah Higher Secondary,  Science 2004  – 2006 Techno India Bachelor's Degree,  Electronics and Communications Engineering 2006  – 2010 Techno India Bachelor's Degree,  Electronics and Communications Engineering 2006  – 2010 Techno India Bachelor's Degree,  Electronics and Communications Engineering 2006  – 2010 Vivekanada Institution, Howrah Higher Secondary,  Science 2004  – 2006 Vivekanada Institution, Howrah Higher Secondary,  Science 2004  – 2006 Vivekanada Institution, Howrah Higher Secondary,  Science 2004  – 2006 "]}