{"position": "Security Architect", "company": "Intel Corporation", "profiles": ["Skills Cloud Security Cloud Management Trust and Compliance in... Virtualization System Architecture Distributed Systems Scalability Enterprise Architecture Big Data Storage Architecture SaaS SOA Data Center Enterprise Software Product Management Security Go-to-market Strategy Linux Kernel Linux PaaS Device Drivers High Performance... See 8+     See less Skills  Cloud Security Cloud Management Trust and Compliance in... Virtualization System Architecture Distributed Systems Scalability Enterprise Architecture Big Data Storage Architecture SaaS SOA Data Center Enterprise Software Product Management Security Go-to-market Strategy Linux Kernel Linux PaaS Device Drivers High Performance... See 8+     See less Cloud Security Cloud Management Trust and Compliance in... Virtualization System Architecture Distributed Systems Scalability Enterprise Architecture Big Data Storage Architecture SaaS SOA Data Center Enterprise Software Product Management Security Go-to-market Strategy Linux Kernel Linux PaaS Device Drivers High Performance... See 8+     See less Cloud Security Cloud Management Trust and Compliance in... Virtualization System Architecture Distributed Systems Scalability Enterprise Architecture Big Data Storage Architecture SaaS SOA Data Center Enterprise Software Product Management Security Go-to-market Strategy Linux Kernel Linux PaaS Device Drivers High Performance... See 8+     See less ", "Experience SoC Security Architect Intel Corporation July 2012  – Present (3 years 2 months) Currently the Security Architect for Intel 2014/2015 Atom based phones and future wearables. I am responsible to deliver SoC security from cradle to grave. These include requirements gathering from internal and external customers, setting up the security and privacy objectives, defining design requirements in hardware, software and infrastructure to provide functionality and ensuring silicon achieves the desired security assurance levels. I also define the micro-architecture for several hardware components like Crypto, Fuses, Fabrics, horizontal areas like Design for Debug, Validation and Test, Access control and Content Protection schemes. I am also responsible for developing all secure flows like Secure Boot, Secure Debug Authentication and Digital Content Protection. Validation Architect - Post Silicon Validation Intel Corporation March 2010  –  August 2012  (2 years 6 months) Bangalore Was the Post Silicon Validation Architect (Security Architect) responsible for Security of all Atom based phone and tablet SoC’s like Medfield, Clovertrail (and their derivative products). Was responsible for creating security validation strategy for SoC use cases and was also responsible to provide security and privacy assurance for all Atom based SoC’s. I was also responsible to drive all execution and was also the representative for validation into several horizontal forums like Platform and SoC Architecture. Lead Silicon Validation Engineer Intel Corporation March 2006  –  March 2010  (4 years 1 month) Bangalore/Folsom Post Silicon System Validation Engineer Intel Corporation March 2004  –  March 2006  (2 years 1 month) Bangalore/Folsom SoC Security Architect Intel Corporation July 2012  – Present (3 years 2 months) Currently the Security Architect for Intel 2014/2015 Atom based phones and future wearables. I am responsible to deliver SoC security from cradle to grave. These include requirements gathering from internal and external customers, setting up the security and privacy objectives, defining design requirements in hardware, software and infrastructure to provide functionality and ensuring silicon achieves the desired security assurance levels. I also define the micro-architecture for several hardware components like Crypto, Fuses, Fabrics, horizontal areas like Design for Debug, Validation and Test, Access control and Content Protection schemes. I am also responsible for developing all secure flows like Secure Boot, Secure Debug Authentication and Digital Content Protection. SoC Security Architect Intel Corporation July 2012  – Present (3 years 2 months) Currently the Security Architect for Intel 2014/2015 Atom based phones and future wearables. I am responsible to deliver SoC security from cradle to grave. These include requirements gathering from internal and external customers, setting up the security and privacy objectives, defining design requirements in hardware, software and infrastructure to provide functionality and ensuring silicon achieves the desired security assurance levels. I also define the micro-architecture for several hardware components like Crypto, Fuses, Fabrics, horizontal areas like Design for Debug, Validation and Test, Access control and Content Protection schemes. I am also responsible for developing all secure flows like Secure Boot, Secure Debug Authentication and Digital Content Protection. Validation Architect - Post Silicon Validation Intel Corporation March 2010  –  August 2012  (2 years 6 months) Bangalore Was the Post Silicon Validation Architect (Security Architect) responsible for Security of all Atom based phone and tablet SoC’s like Medfield, Clovertrail (and their derivative products). Was responsible for creating security validation strategy for SoC use cases and was also responsible to provide security and privacy assurance for all Atom based SoC’s. I was also responsible to drive all execution and was also the representative for validation into several horizontal forums like Platform and SoC Architecture. Validation Architect - Post Silicon Validation Intel Corporation March 2010  –  August 2012  (2 years 6 months) Bangalore Was the Post Silicon Validation Architect (Security Architect) responsible for Security of all Atom based phone and tablet SoC’s like Medfield, Clovertrail (and their derivative products). Was responsible for creating security validation strategy for SoC use cases and was also responsible to provide security and privacy assurance for all Atom based SoC’s. I was also responsible to drive all execution and was also the representative for validation into several horizontal forums like Platform and SoC Architecture. Lead Silicon Validation Engineer Intel Corporation March 2006  –  March 2010  (4 years 1 month) Bangalore/Folsom Lead Silicon Validation Engineer Intel Corporation March 2006  –  March 2010  (4 years 1 month) Bangalore/Folsom Post Silicon System Validation Engineer Intel Corporation March 2004  –  March 2006  (2 years 1 month) Bangalore/Folsom Post Silicon System Validation Engineer Intel Corporation March 2004  –  March 2006  (2 years 1 month) Bangalore/Folsom Skills Computer Architecture Hardware Security Firmware Post SIlicon Validation Post SIlicon Debug Emulation Embedded Systems Firmware Security x86 Assembly Logic Design Security Architecture... C C++ Intel Computer System... Silicon Validation DFT Security ASIC SoC Debugging Processors VLSI Verilog Smartphones Tablets Chipsets RTL design X86 Functional Verification See 15+     See less Skills  Computer Architecture Hardware Security Firmware Post SIlicon Validation Post SIlicon Debug Emulation Embedded Systems Firmware Security x86 Assembly Logic Design Security Architecture... C C++ Intel Computer System... Silicon Validation DFT Security ASIC SoC Debugging Processors VLSI Verilog Smartphones Tablets Chipsets RTL design X86 Functional Verification See 15+     See less Computer Architecture Hardware Security Firmware Post SIlicon Validation Post SIlicon Debug Emulation Embedded Systems Firmware Security x86 Assembly Logic Design Security Architecture... C C++ Intel Computer System... Silicon Validation DFT Security ASIC SoC Debugging Processors VLSI Verilog Smartphones Tablets Chipsets RTL design X86 Functional Verification See 15+     See less Computer Architecture Hardware Security Firmware Post SIlicon Validation Post SIlicon Debug Emulation Embedded Systems Firmware Security x86 Assembly Logic Design Security Architecture... C C++ Intel Computer System... Silicon Validation DFT Security ASIC SoC Debugging Processors VLSI Verilog Smartphones Tablets Chipsets RTL design X86 Functional Verification See 15+     See less Education University of Missouri-Rolla MS,  Computer Engineering 2002  – 2003 Masters in Computer Engineering with focus on Computer Architecture University of Missouri-Rolla MS,  Computer Science 2000  – 2001 Masters in Computer Science with focus on Computer Architecture JNTU Bachelor of Technology (B.Tech.),  Computer Science and Engineering 1996  – 2000 Little Flower Junior College 1994  – 1996 University of Missouri-Rolla MS,  Computer Engineering 2002  – 2003 Masters in Computer Engineering with focus on Computer Architecture University of Missouri-Rolla MS,  Computer Engineering 2002  – 2003 Masters in Computer Engineering with focus on Computer Architecture University of Missouri-Rolla MS,  Computer Engineering 2002  – 2003 Masters in Computer Engineering with focus on Computer Architecture University of Missouri-Rolla MS,  Computer Science 2000  – 2001 Masters in Computer Science with focus on Computer Architecture University of Missouri-Rolla MS,  Computer Science 2000  – 2001 Masters in Computer Science with focus on Computer Architecture University of Missouri-Rolla MS,  Computer Science 2000  – 2001 Masters in Computer Science with focus on Computer Architecture JNTU Bachelor of Technology (B.Tech.),  Computer Science and Engineering 1996  – 2000 JNTU Bachelor of Technology (B.Tech.),  Computer Science and Engineering 1996  – 2000 JNTU Bachelor of Technology (B.Tech.),  Computer Science and Engineering 1996  – 2000 Little Flower Junior College 1994  – 1996 Little Flower Junior College 1994  – 1996 Little Flower Junior College 1994  – 1996 ", "Experience Security Architect Intel Corporation Security Architect Intel Corporation Security Architect Intel Corporation ", "Skills Information Security Security Strategy Computer Security Network Security Firewalls Information Security... PCI DSS Security Architecture... CISSP Encryption Application Security Penetration Testing Vulnerability Assessment Skills  Information Security Security Strategy Computer Security Network Security Firewalls Information Security... PCI DSS Security Architecture... CISSP Encryption Application Security Penetration Testing Vulnerability Assessment Information Security Security Strategy Computer Security Network Security Firewalls Information Security... PCI DSS Security Architecture... CISSP Encryption Application Security Penetration Testing Vulnerability Assessment Information Security Security Strategy Computer Security Network Security Firewalls Information Security... PCI DSS Security Architecture... CISSP Encryption Application Security Penetration Testing Vulnerability Assessment ", "Experience Wireless Security Architect Intel Corporation April 2003  – Present (12 years 5 months) Wireless Security Architect Intel Corporation April 2003  – Present (12 years 5 months) Wireless Security Architect Intel Corporation April 2003  – Present (12 years 5 months) Skills LTE Semiconductors ASIC 3GPP Embedded Systems System Architecture Device Drivers Wireless Embedded Software Electronics Debugging Verilog Digital Signal... IC Security Hardware Architecture SoC Cryptography Software Engineering WiFi WiMAX FPGA Bluetooth RTL design Firmware Mobile Devices See 11+     See less Skills  LTE Semiconductors ASIC 3GPP Embedded Systems System Architecture Device Drivers Wireless Embedded Software Electronics Debugging Verilog Digital Signal... IC Security Hardware Architecture SoC Cryptography Software Engineering WiFi WiMAX FPGA Bluetooth RTL design Firmware Mobile Devices See 11+     See less LTE Semiconductors ASIC 3GPP Embedded Systems System Architecture Device Drivers Wireless Embedded Software Electronics Debugging Verilog Digital Signal... IC Security Hardware Architecture SoC Cryptography Software Engineering WiFi WiMAX FPGA Bluetooth RTL design Firmware Mobile Devices See 11+     See less LTE Semiconductors ASIC 3GPP Embedded Systems System Architecture Device Drivers Wireless Embedded Software Electronics Debugging Verilog Digital Signal... IC Security Hardware Architecture SoC Cryptography Software Engineering WiFi WiMAX FPGA Bluetooth RTL design Firmware Mobile Devices See 11+     See less ", "Languages English Native or bilingual proficiency German Professional working proficiency English Native or bilingual proficiency German Professional working proficiency English Native or bilingual proficiency German Professional working proficiency Native or bilingual proficiency Professional working proficiency Skills ASIC Cryptography Hardware FPGA Linux Embedded Systems Information Security System Architecture C Hardware Architecture Embedded Linux Debugging Embedded Software Device Drivers VHDL SoC Security See 2+     See less Skills  ASIC Cryptography Hardware FPGA Linux Embedded Systems Information Security System Architecture C Hardware Architecture Embedded Linux Debugging Embedded Software Device Drivers VHDL SoC Security See 2+     See less ASIC Cryptography Hardware FPGA Linux Embedded Systems Information Security System Architecture C Hardware Architecture Embedded Linux Debugging Embedded Software Device Drivers VHDL SoC Security See 2+     See less ASIC Cryptography Hardware FPGA Linux Embedded Systems Information Security System Architecture C Hardware Architecture Embedded Linux Debugging Embedded Software Device Drivers VHDL SoC Security See 2+     See less ", "Skills Business Analysis X86 Processors Operating Systems Computer Security C Virtualization Verilog Algorithms Computer Architecture Systems Programming Parallel Programming GPU Perl Distributed Systems Skills  Business Analysis X86 Processors Operating Systems Computer Security C Virtualization Verilog Algorithms Computer Architecture Systems Programming Parallel Programming GPU Perl Distributed Systems Business Analysis X86 Processors Operating Systems Computer Security C Virtualization Verilog Algorithms Computer Architecture Systems Programming Parallel Programming GPU Perl Distributed Systems Business Analysis X86 Processors Operating Systems Computer Security C Virtualization Verilog Algorithms Computer Architecture Systems Programming Parallel Programming GPU Perl Distributed Systems ", "Summary My passion with security of system on chip architectures manifests in two directions: how and why. \n \nThe first interest is with the methods that can be used to achieve real-world security benefits in both the hardware and firmware for the delivered system. Much of my prior work was with information flow security analysis approaches. This afforded the benefit of being able to articulate and measure coverage goals against known access controls. This provides a great foundation for more advanced approaches of using formal modeling techniques to state and verify security properties in real-world architectures and designs. Much of my interest is in how to fundamentally change the rules of the \"game\". \n \nMy second interest is in the motivation people have for change. Often people and organizations are apathetic to threats until it has directly and demonstrably harmed them. Those harmed, however, aren't always those with the ability to prevent it. How do we motivate change in individual and organizational habits? For businesses, the motivation can come down to financial interests: return on investment. However, businesses are still made of people that make the final call and the decision is not just a net present value calculation. People need to be personally motivated to make the necessary changes for the benefit of others. \n \nAlthough I'm a bit of an idealist and an optimist, I always have to come back around and address reality. The end product must live up to real-world challenges. We have to provide both the methods and the motivation to achieve it. Summary My passion with security of system on chip architectures manifests in two directions: how and why. \n \nThe first interest is with the methods that can be used to achieve real-world security benefits in both the hardware and firmware for the delivered system. Much of my prior work was with information flow security analysis approaches. This afforded the benefit of being able to articulate and measure coverage goals against known access controls. This provides a great foundation for more advanced approaches of using formal modeling techniques to state and verify security properties in real-world architectures and designs. Much of my interest is in how to fundamentally change the rules of the \"game\". \n \nMy second interest is in the motivation people have for change. Often people and organizations are apathetic to threats until it has directly and demonstrably harmed them. Those harmed, however, aren't always those with the ability to prevent it. How do we motivate change in individual and organizational habits? For businesses, the motivation can come down to financial interests: return on investment. However, businesses are still made of people that make the final call and the decision is not just a net present value calculation. People need to be personally motivated to make the necessary changes for the benefit of others. \n \nAlthough I'm a bit of an idealist and an optimist, I always have to come back around and address reality. The end product must live up to real-world challenges. We have to provide both the methods and the motivation to achieve it. My passion with security of system on chip architectures manifests in two directions: how and why. \n \nThe first interest is with the methods that can be used to achieve real-world security benefits in both the hardware and firmware for the delivered system. Much of my prior work was with information flow security analysis approaches. This afforded the benefit of being able to articulate and measure coverage goals against known access controls. This provides a great foundation for more advanced approaches of using formal modeling techniques to state and verify security properties in real-world architectures and designs. Much of my interest is in how to fundamentally change the rules of the \"game\". \n \nMy second interest is in the motivation people have for change. Often people and organizations are apathetic to threats until it has directly and demonstrably harmed them. Those harmed, however, aren't always those with the ability to prevent it. How do we motivate change in individual and organizational habits? For businesses, the motivation can come down to financial interests: return on investment. However, businesses are still made of people that make the final call and the decision is not just a net present value calculation. People need to be personally motivated to make the necessary changes for the benefit of others. \n \nAlthough I'm a bit of an idealist and an optimist, I always have to come back around and address reality. The end product must live up to real-world challenges. We have to provide both the methods and the motivation to achieve it. My passion with security of system on chip architectures manifests in two directions: how and why. \n \nThe first interest is with the methods that can be used to achieve real-world security benefits in both the hardware and firmware for the delivered system. Much of my prior work was with information flow security analysis approaches. This afforded the benefit of being able to articulate and measure coverage goals against known access controls. This provides a great foundation for more advanced approaches of using formal modeling techniques to state and verify security properties in real-world architectures and designs. Much of my interest is in how to fundamentally change the rules of the \"game\". \n \nMy second interest is in the motivation people have for change. Often people and organizations are apathetic to threats until it has directly and demonstrably harmed them. Those harmed, however, aren't always those with the ability to prevent it. How do we motivate change in individual and organizational habits? For businesses, the motivation can come down to financial interests: return on investment. However, businesses are still made of people that make the final call and the decision is not just a net present value calculation. People need to be personally motivated to make the necessary changes for the benefit of others. \n \nAlthough I'm a bit of an idealist and an optimist, I always have to come back around and address reality. The end product must live up to real-world challenges. We have to provide both the methods and the motivation to achieve it. Experience SoC Security Architect Intel Corporation April 2013  – Present (2 years 5 months) Security Researcher Intel Corporation July 2005  –  April 2013  (7 years 10 months) Portland, Oregon Area Investigated both tools and methodologies for discovering security defects in hardware designs. This culminated into a publication at HOST 2013 reviewing the information flow security approach used to review large, complex hardware designs. \n \nThe project was based on real-world interactions with IP teams, pre-si security validation experts, and hands-on work with finding security issues. Also created and gave internal training across the company in multiple countries on how to prepare pre-si security validation test plans to hit security coverage goals. Senior Software Engineer McAfee 2001  –  2003  (2 years) Investigated a new approach for anti-virus scanning for smartphones, such as Symbian and Pocket PC based platforms. Developed proof of concept demonstration and traveled internationally with the VP in customer visits. Stayed with the project to delivering a working product. SoC Security Architect Intel Corporation April 2013  – Present (2 years 5 months) SoC Security Architect Intel Corporation April 2013  – Present (2 years 5 months) Security Researcher Intel Corporation July 2005  –  April 2013  (7 years 10 months) Portland, Oregon Area Investigated both tools and methodologies for discovering security defects in hardware designs. This culminated into a publication at HOST 2013 reviewing the information flow security approach used to review large, complex hardware designs. \n \nThe project was based on real-world interactions with IP teams, pre-si security validation experts, and hands-on work with finding security issues. Also created and gave internal training across the company in multiple countries on how to prepare pre-si security validation test plans to hit security coverage goals. Security Researcher Intel Corporation July 2005  –  April 2013  (7 years 10 months) Portland, Oregon Area Investigated both tools and methodologies for discovering security defects in hardware designs. This culminated into a publication at HOST 2013 reviewing the information flow security approach used to review large, complex hardware designs. \n \nThe project was based on real-world interactions with IP teams, pre-si security validation experts, and hands-on work with finding security issues. Also created and gave internal training across the company in multiple countries on how to prepare pre-si security validation test plans to hit security coverage goals. Senior Software Engineer McAfee 2001  –  2003  (2 years) Investigated a new approach for anti-virus scanning for smartphones, such as Symbian and Pocket PC based platforms. Developed proof of concept demonstration and traveled internationally with the VP in customer visits. Stayed with the project to delivering a working product. Senior Software Engineer McAfee 2001  –  2003  (2 years) Investigated a new approach for anti-virus scanning for smartphones, such as Symbian and Pocket PC based platforms. Developed proof of concept demonstration and traveled internationally with the VP in customer visits. Stayed with the project to delivering a working product. Skills Security Embedded Systems Device Drivers Debugging Architectures SoC Firmware System Architecture Hardware Software Development Embedded Software Algorithms C C++ Skills  Security Embedded Systems Device Drivers Debugging Architectures SoC Firmware System Architecture Hardware Software Development Embedded Software Algorithms C C++ Security Embedded Systems Device Drivers Debugging Architectures SoC Firmware System Architecture Hardware Software Development Embedded Software Algorithms C C++ Security Embedded Systems Device Drivers Debugging Architectures SoC Firmware System Architecture Hardware Software Development Embedded Software Algorithms C C++ Education Washington State University Bachelor of Applied Science (B.A.Sc.),  Mathematics and Computer Science 1989  – 1994 Washington State University Bachelor of Applied Science (B.A.Sc.),  Mathematics and Computer Science 1989  – 1994 Washington State University Bachelor of Applied Science (B.A.Sc.),  Mathematics and Computer Science 1989  – 1994 Washington State University Bachelor of Applied Science (B.A.Sc.),  Mathematics and Computer Science 1989  – 1994 ", "Experience Security Architect Intel Corporation September 1975  – Present (40 years) Security Architecture \nRdRand/DRNG across the range of Intel silicon products Security Architect Intel Corporation September 1975  – Present (40 years) Security Architecture \nRdRand/DRNG across the range of Intel silicon products Security Architect Intel Corporation September 1975  – Present (40 years) Security Architecture \nRdRand/DRNG across the range of Intel silicon products Skills Microarchitecture SoC Timing Logic Design Processors ASIC Computer Architecture RTL design DFT Power Management VLSI Intel IC Semiconductors Microprocessors X86 Firmware Kernel Bluetooth Embedded Systems Embedded Software System Architecture Debugging Hardware Architecture Device Drivers Perl Security See 12+     See less Skills  Microarchitecture SoC Timing Logic Design Processors ASIC Computer Architecture RTL design DFT Power Management VLSI Intel IC Semiconductors Microprocessors X86 Firmware Kernel Bluetooth Embedded Systems Embedded Software System Architecture Debugging Hardware Architecture Device Drivers Perl Security See 12+     See less Microarchitecture SoC Timing Logic Design Processors ASIC Computer Architecture RTL design DFT Power Management VLSI Intel IC Semiconductors Microprocessors X86 Firmware Kernel Bluetooth Embedded Systems Embedded Software System Architecture Debugging Hardware Architecture Device Drivers Perl Security See 12+     See less Microarchitecture SoC Timing Logic Design Processors ASIC Computer Architecture RTL design DFT Power Management VLSI Intel IC Semiconductors Microprocessors X86 Firmware Kernel Bluetooth Embedded Systems Embedded Software System Architecture Debugging Hardware Architecture Device Drivers Perl Security See 12+     See less Education BA from University of Texas (Austin) in 1966 Math/Physics MS and PhD from Purdue University in 1975 Computer Science BA from University of Texas (Austin) in 1966 Math/Physics BA from University of Texas (Austin) in 1966 Math/Physics BA from University of Texas (Austin) in 1966 Math/Physics MS and PhD from Purdue University in 1975 Computer Science MS and PhD from Purdue University in 1975 Computer Science MS and PhD from Purdue University in 1975 Computer Science ", "Skills Security evaluation VHDL Verilog HW security Computer Security Security Architecture... Vulnerability Assessment DFT JTAG Cryptography BIST Boundary Scan tamper resistant tamper responsive Computer Architecture Microarchitecture Logic Design FIPS Hacking ASIC SoC Security FPGA System Architecture Debugging Hardware Architecture Testing Static Timing Analysis Firmware VLSI Linux Kernel Perl x86 Assembly Embedded Systems Microprocessors See 20+     See less Skills  Security evaluation VHDL Verilog HW security Computer Security Security Architecture... Vulnerability Assessment DFT JTAG Cryptography BIST Boundary Scan tamper resistant tamper responsive Computer Architecture Microarchitecture Logic Design FIPS Hacking ASIC SoC Security FPGA System Architecture Debugging Hardware Architecture Testing Static Timing Analysis Firmware VLSI Linux Kernel Perl x86 Assembly Embedded Systems Microprocessors See 20+     See less Security evaluation VHDL Verilog HW security Computer Security Security Architecture... Vulnerability Assessment DFT JTAG Cryptography BIST Boundary Scan tamper resistant tamper responsive Computer Architecture Microarchitecture Logic Design FIPS Hacking ASIC SoC Security FPGA System Architecture Debugging Hardware Architecture Testing Static Timing Analysis Firmware VLSI Linux Kernel Perl x86 Assembly Embedded Systems Microprocessors See 20+     See less Security evaluation VHDL Verilog HW security Computer Security Security Architecture... Vulnerability Assessment DFT JTAG Cryptography BIST Boundary Scan tamper resistant tamper responsive Computer Architecture Microarchitecture Logic Design FIPS Hacking ASIC SoC Security FPGA System Architecture Debugging Hardware Architecture Testing Static Timing Analysis Firmware VLSI Linux Kernel Perl x86 Assembly Embedded Systems Microprocessors See 20+     See less ", "Experience SoC Security Architect Intel Corporation May 2011  – Present (4 years 4 months) Design Engineer Intel September 2001  –  May 2011  (9 years 9 months) SoC Security Architect Intel Corporation May 2011  – Present (4 years 4 months) SoC Security Architect Intel Corporation May 2011  – Present (4 years 4 months) Design Engineer Intel September 2001  –  May 2011  (9 years 9 months) Design Engineer Intel September 2001  –  May 2011  (9 years 9 months) Skills Semiconductors Debugging Verilog ASIC SoC Security Architecture... Microprocessors Security Assurance Microarchitecture SystemVerilog Computer Architecture IC Analog Low-power Design Power Management CMOS Analog Circuit Design PCIe See 3+     See less Skills  Semiconductors Debugging Verilog ASIC SoC Security Architecture... Microprocessors Security Assurance Microarchitecture SystemVerilog Computer Architecture IC Analog Low-power Design Power Management CMOS Analog Circuit Design PCIe See 3+     See less Semiconductors Debugging Verilog ASIC SoC Security Architecture... Microprocessors Security Assurance Microarchitecture SystemVerilog Computer Architecture IC Analog Low-power Design Power Management CMOS Analog Circuit Design PCIe See 3+     See less Semiconductors Debugging Verilog ASIC SoC Security Architecture... Microprocessors Security Assurance Microarchitecture SystemVerilog Computer Architecture IC Analog Low-power Design Power Management CMOS Analog Circuit Design PCIe See 3+     See less Education Texas A&M University Master of Science (M.S.),  Electrical & Computer Engineering 1999  – 2001 College of Engineering Pune Bachelor of Engineering (B.E.),  Electrical Engineering 1995  – 1999 Fergusson College Higher Secondary Certificate (H. S. C.) 1993  – 1995 Texas A&M University Master of Science (M.S.),  Electrical & Computer Engineering 1999  – 2001 Texas A&M University Master of Science (M.S.),  Electrical & Computer Engineering 1999  – 2001 Texas A&M University Master of Science (M.S.),  Electrical & Computer Engineering 1999  – 2001 College of Engineering Pune Bachelor of Engineering (B.E.),  Electrical Engineering 1995  – 1999 College of Engineering Pune Bachelor of Engineering (B.E.),  Electrical Engineering 1995  – 1999 College of Engineering Pune Bachelor of Engineering (B.E.),  Electrical Engineering 1995  – 1999 Fergusson College Higher Secondary Certificate (H. S. C.) 1993  – 1995 Fergusson College Higher Secondary Certificate (H. S. C.) 1993  – 1995 Fergusson College Higher Secondary Certificate (H. S. C.) 1993  – 1995 ", "Summary x86 Server Platform architecture and optimization for high throughput server and network infrastructure applications: 1GbE/10GbE NICs, TOE, iSCSI , IO Virtualization, FCoE, Cluster Computing, Networking Infrastructure, Security and Media applications. \n \nTactical and strategic customer support to top OEMs in the computing/ communications industry.  \n \nPh.D. in Computer Science w. Parallel/ Multicore Processing as thesis area. Summary x86 Server Platform architecture and optimization for high throughput server and network infrastructure applications: 1GbE/10GbE NICs, TOE, iSCSI , IO Virtualization, FCoE, Cluster Computing, Networking Infrastructure, Security and Media applications. \n \nTactical and strategic customer support to top OEMs in the computing/ communications industry.  \n \nPh.D. in Computer Science w. Parallel/ Multicore Processing as thesis area. x86 Server Platform architecture and optimization for high throughput server and network infrastructure applications: 1GbE/10GbE NICs, TOE, iSCSI , IO Virtualization, FCoE, Cluster Computing, Networking Infrastructure, Security and Media applications. \n \nTactical and strategic customer support to top OEMs in the computing/ communications industry.  \n \nPh.D. in Computer Science w. Parallel/ Multicore Processing as thesis area. x86 Server Platform architecture and optimization for high throughput server and network infrastructure applications: 1GbE/10GbE NICs, TOE, iSCSI , IO Virtualization, FCoE, Cluster Computing, Networking Infrastructure, Security and Media applications. \n \nTactical and strategic customer support to top OEMs in the computing/ communications industry.  \n \nPh.D. in Computer Science w. Parallel/ Multicore Processing as thesis area. Experience System and Security Architect Intel Corporation January 2013  – Present (2 years 8 months) Phoenix, Arizona Area Product Architecture of Scalable x86 Platforms for IP Communications Infrastructure and HW acceleration products. Architecture and optimization of cryptographic processing for network and platform security. Platform trust architecture and secure key management. System Architect Intel June 2009  –  December 2012  (3 years 7 months) Principal System Architect Broadcom November 2008  –  May 2009  (7 months) Performance analysis of Broadcom 10GbE TCP Offload Network Controllers with Virtualization under VMWare ESX and Microsoft Hypervisor. Performance Architect Intel May 2003  –  October 2008  (5 years 6 months) Sr. Software Engineer Intel February 1996  –  May 2003  (7 years 4 months) System and Security Architect Intel Corporation January 2013  – Present (2 years 8 months) Phoenix, Arizona Area Product Architecture of Scalable x86 Platforms for IP Communications Infrastructure and HW acceleration products. Architecture and optimization of cryptographic processing for network and platform security. Platform trust architecture and secure key management. System and Security Architect Intel Corporation January 2013  – Present (2 years 8 months) Phoenix, Arizona Area Product Architecture of Scalable x86 Platforms for IP Communications Infrastructure and HW acceleration products. Architecture and optimization of cryptographic processing for network and platform security. Platform trust architecture and secure key management. System Architect Intel June 2009  –  December 2012  (3 years 7 months) System Architect Intel June 2009  –  December 2012  (3 years 7 months) Principal System Architect Broadcom November 2008  –  May 2009  (7 months) Performance analysis of Broadcom 10GbE TCP Offload Network Controllers with Virtualization under VMWare ESX and Microsoft Hypervisor. Principal System Architect Broadcom November 2008  –  May 2009  (7 months) Performance analysis of Broadcom 10GbE TCP Offload Network Controllers with Virtualization under VMWare ESX and Microsoft Hypervisor. Performance Architect Intel May 2003  –  October 2008  (5 years 6 months) Performance Architect Intel May 2003  –  October 2008  (5 years 6 months) Sr. Software Engineer Intel February 1996  –  May 2003  (7 years 4 months) Sr. Software Engineer Intel February 1996  –  May 2003  (7 years 4 months) Skills Security Firmware Virtualization C++ Embedded Systems Debugging Computer Architecture Linux Processors Strategy Wireless Product Management C Embedded Software Enterprise Software Device Drivers Semiconductors Multithreading See 3+     See less Skills  Security Firmware Virtualization C++ Embedded Systems Debugging Computer Architecture Linux Processors Strategy Wireless Product Management C Embedded Software Enterprise Software Device Drivers Semiconductors Multithreading See 3+     See less Security Firmware Virtualization C++ Embedded Systems Debugging Computer Architecture Linux Processors Strategy Wireless Product Management C Embedded Software Enterprise Software Device Drivers Semiconductors Multithreading See 3+     See less Security Firmware Virtualization C++ Embedded Systems Debugging Computer Architecture Linux Processors Strategy Wireless Product Management C Embedded Software Enterprise Software Device Drivers Semiconductors Multithreading See 3+     See less Education University of Delaware Ph.D.,  Computer and Information Sciences 1991  – 1995 Thesis Title: \"Algorithms for Static Scheduling in Network Parallel Computers\" Indian Institute of Technology, Madras B.Tech/M.Tech,  Mech Engg/ Comp. Sc. 1980  – 1987 University of Delaware Ph.D.,  Computer and Information Sciences 1991  – 1995 Thesis Title: \"Algorithms for Static Scheduling in Network Parallel Computers\" University of Delaware Ph.D.,  Computer and Information Sciences 1991  – 1995 Thesis Title: \"Algorithms for Static Scheduling in Network Parallel Computers\" University of Delaware Ph.D.,  Computer and Information Sciences 1991  – 1995 Thesis Title: \"Algorithms for Static Scheduling in Network Parallel Computers\" Indian Institute of Technology, Madras B.Tech/M.Tech,  Mech Engg/ Comp. Sc. 1980  – 1987 Indian Institute of Technology, Madras B.Tech/M.Tech,  Mech Engg/ Comp. Sc. 1980  – 1987 Indian Institute of Technology, Madras B.Tech/M.Tech,  Mech Engg/ Comp. Sc. 1980  – 1987 ", "Summary Strong technical background from a year of co-op experience and a year of research experience split between digital device design and security vulnerability research and countermeasures development.  \n \nExperienced in research teams and product development team. Summary Strong technical background from a year of co-op experience and a year of research experience split between digital device design and security vulnerability research and countermeasures development.  \n \nExperienced in research teams and product development team. Strong technical background from a year of co-op experience and a year of research experience split between digital device design and security vulnerability research and countermeasures development.  \n \nExperienced in research teams and product development team. Strong technical background from a year of co-op experience and a year of research experience split between digital device design and security vulnerability research and countermeasures development.  \n \nExperienced in research teams and product development team. Experience SoC Security Architect Intel Corporation July 2015  – Present (2 months) Hudson, MA Working on secure architecture/standard for Intel's next generation products (server, mobile, client, etc).  Research Assistant in Prof. David Kaeli and Prof. Yunsi Fei's Lab Northeastern University June 2013  – Present (2 years 3 months) Greater Boston Area •\tAnalyze Side-Channel Attacks (SCAs) to discover vulnerabilities in computer hardware using power trace method  \n•\tCalculate and analyze the correlation between power traces and sensitive data, such as cipher-text and plain-text, using Pearson’s product-moment correlation coefficient and Hamming distance \n•\tDevelop parallel framework of correlation analysis in OpenCL and CUDA which significantly improved performance  \n•\tInvestigate countermeasures, such as addition of a random number (noise), against SCAs and evaluate their responses Digital and MIcro Hardware Engineer MITRE December 2012  –  June 2013  (7 months) Bedford, MA • Analyzed Differential Electromagnetic Analysis (DEMA) technique to prevent side channel attacks on cryptographic devices \n• Evaluated power leakage and EM radiation of electronic devices using DPA and DEMA \n• Composed Python script to collect electromagnetic field data using EM probe on different locations of the device  \n• Wrote signal and data processing code to compute FFT, filtering, and spectrogram in Python  \n• Constructed code to extract and verify an AES encryption key using AES S-box selector and Difference of Mean  \n• Designed drop buffer RTL component for bi-static radar using VHDL and SystemVerilog  \n• Performed verification using Universal Verification Methodology on Altera Stratix V FPGA \n• Utilized GIT, a distributed version control system, to maintain updates for projects involving 10 engineers Research Assistant Northeastern University January 2011  –  December 2012  (2 years) Northeastern University Computer Architecture Lab (NUCAR) • Developed object detection and face recognition applications for Defense and Security purposes \n• Utilized OpenCL and C++ to program heterogeneous platforms such as GPUs and CPUs \n• Compared interest points using Computer Vision algorithm called Speeded Up Robust Features  \n• Added a feature to algorithm designed to generate a list of similar comparison interest points between two images/videos \n• Analyzed performance for 9 kernels of data between GPU and CPU, resulting in a change in 2 kernels to enhance run-time performance Design Engineering co-op AMD January 2012  –  June 2012  (6 months) Boxborough, MA • Collaborated with the design engineering team to develop state-of-the-art next generation x86 AMD CPU core, specifically designing and optimizing Instruction Cache Unit (ICU)  \n• Utilized commercial CAD tools for synthesis, timing analysis, and circuits analysis \n• Debugged and improved the hardware design to meet strict design specifications such as timing, power, and reliability \n• Designed and gained approval for the ICU, which is now taped-out for prototype production IT Helpdesk Specialist Northeastern University August 2010  –  December 2011  (1 year 5 months) Greater Boston Area • Provided in-person and phone application support to students and faculty \n• Upgraded and serviced lab computers and software to maintain performance and application integrity Intern EveryScape Inc. 2010  –  2010  (less than a year) SoC Security Architect Intel Corporation July 2015  – Present (2 months) Hudson, MA Working on secure architecture/standard for Intel's next generation products (server, mobile, client, etc).  SoC Security Architect Intel Corporation July 2015  – Present (2 months) Hudson, MA Working on secure architecture/standard for Intel's next generation products (server, mobile, client, etc).  Research Assistant in Prof. David Kaeli and Prof. Yunsi Fei's Lab Northeastern University June 2013  – Present (2 years 3 months) Greater Boston Area •\tAnalyze Side-Channel Attacks (SCAs) to discover vulnerabilities in computer hardware using power trace method  \n•\tCalculate and analyze the correlation between power traces and sensitive data, such as cipher-text and plain-text, using Pearson’s product-moment correlation coefficient and Hamming distance \n•\tDevelop parallel framework of correlation analysis in OpenCL and CUDA which significantly improved performance  \n•\tInvestigate countermeasures, such as addition of a random number (noise), against SCAs and evaluate their responses Research Assistant in Prof. David Kaeli and Prof. Yunsi Fei's Lab Northeastern University June 2013  – Present (2 years 3 months) Greater Boston Area •\tAnalyze Side-Channel Attacks (SCAs) to discover vulnerabilities in computer hardware using power trace method  \n•\tCalculate and analyze the correlation between power traces and sensitive data, such as cipher-text and plain-text, using Pearson’s product-moment correlation coefficient and Hamming distance \n•\tDevelop parallel framework of correlation analysis in OpenCL and CUDA which significantly improved performance  \n•\tInvestigate countermeasures, such as addition of a random number (noise), against SCAs and evaluate their responses Digital and MIcro Hardware Engineer MITRE December 2012  –  June 2013  (7 months) Bedford, MA • Analyzed Differential Electromagnetic Analysis (DEMA) technique to prevent side channel attacks on cryptographic devices \n• Evaluated power leakage and EM radiation of electronic devices using DPA and DEMA \n• Composed Python script to collect electromagnetic field data using EM probe on different locations of the device  \n• Wrote signal and data processing code to compute FFT, filtering, and spectrogram in Python  \n• Constructed code to extract and verify an AES encryption key using AES S-box selector and Difference of Mean  \n• Designed drop buffer RTL component for bi-static radar using VHDL and SystemVerilog  \n• Performed verification using Universal Verification Methodology on Altera Stratix V FPGA \n• Utilized GIT, a distributed version control system, to maintain updates for projects involving 10 engineers Digital and MIcro Hardware Engineer MITRE December 2012  –  June 2013  (7 months) Bedford, MA • Analyzed Differential Electromagnetic Analysis (DEMA) technique to prevent side channel attacks on cryptographic devices \n• Evaluated power leakage and EM radiation of electronic devices using DPA and DEMA \n• Composed Python script to collect electromagnetic field data using EM probe on different locations of the device  \n• Wrote signal and data processing code to compute FFT, filtering, and spectrogram in Python  \n• Constructed code to extract and verify an AES encryption key using AES S-box selector and Difference of Mean  \n• Designed drop buffer RTL component for bi-static radar using VHDL and SystemVerilog  \n• Performed verification using Universal Verification Methodology on Altera Stratix V FPGA \n• Utilized GIT, a distributed version control system, to maintain updates for projects involving 10 engineers Research Assistant Northeastern University January 2011  –  December 2012  (2 years) Northeastern University Computer Architecture Lab (NUCAR) • Developed object detection and face recognition applications for Defense and Security purposes \n• Utilized OpenCL and C++ to program heterogeneous platforms such as GPUs and CPUs \n• Compared interest points using Computer Vision algorithm called Speeded Up Robust Features  \n• Added a feature to algorithm designed to generate a list of similar comparison interest points between two images/videos \n• Analyzed performance for 9 kernels of data between GPU and CPU, resulting in a change in 2 kernels to enhance run-time performance Research Assistant Northeastern University January 2011  –  December 2012  (2 years) Northeastern University Computer Architecture Lab (NUCAR) • Developed object detection and face recognition applications for Defense and Security purposes \n• Utilized OpenCL and C++ to program heterogeneous platforms such as GPUs and CPUs \n• Compared interest points using Computer Vision algorithm called Speeded Up Robust Features  \n• Added a feature to algorithm designed to generate a list of similar comparison interest points between two images/videos \n• Analyzed performance for 9 kernels of data between GPU and CPU, resulting in a change in 2 kernels to enhance run-time performance Design Engineering co-op AMD January 2012  –  June 2012  (6 months) Boxborough, MA • Collaborated with the design engineering team to develop state-of-the-art next generation x86 AMD CPU core, specifically designing and optimizing Instruction Cache Unit (ICU)  \n• Utilized commercial CAD tools for synthesis, timing analysis, and circuits analysis \n• Debugged and improved the hardware design to meet strict design specifications such as timing, power, and reliability \n• Designed and gained approval for the ICU, which is now taped-out for prototype production Design Engineering co-op AMD January 2012  –  June 2012  (6 months) Boxborough, MA • Collaborated with the design engineering team to develop state-of-the-art next generation x86 AMD CPU core, specifically designing and optimizing Instruction Cache Unit (ICU)  \n• Utilized commercial CAD tools for synthesis, timing analysis, and circuits analysis \n• Debugged and improved the hardware design to meet strict design specifications such as timing, power, and reliability \n• Designed and gained approval for the ICU, which is now taped-out for prototype production IT Helpdesk Specialist Northeastern University August 2010  –  December 2011  (1 year 5 months) Greater Boston Area • Provided in-person and phone application support to students and faculty \n• Upgraded and serviced lab computers and software to maintain performance and application integrity IT Helpdesk Specialist Northeastern University August 2010  –  December 2011  (1 year 5 months) Greater Boston Area • Provided in-person and phone application support to students and faculty \n• Upgraded and serviced lab computers and software to maintain performance and application integrity Intern EveryScape Inc. 2010  –  2010  (less than a year) Intern EveryScape Inc. 2010  –  2010  (less than a year) Languages   Skills C++ Matlab OpenCL Algorithms Computer Architecture Hardware Architecture VHDL Linux Git Verilog Pspice Python Altera Quartus Skills  C++ Matlab OpenCL Algorithms Computer Architecture Hardware Architecture VHDL Linux Git Verilog Pspice Python Altera Quartus C++ Matlab OpenCL Algorithms Computer Architecture Hardware Architecture VHDL Linux Git Verilog Pspice Python Altera Quartus C++ Matlab OpenCL Algorithms Computer Architecture Hardware Architecture VHDL Linux Git Verilog Pspice Python Altera Quartus Education Northeastern University Electrical and Computer Engineering,  Engineering 2010  – 2015 Activities and Societies:  President of IEEE ,  Board member and vice-chair of Student Research Engagement Committee (SREC) ,  Peer Mentor ,  NSBE Member ,  Tau Beta Pi Engineering Honor Society Member ,  Summer Bridge 2010 Participant ,  National Urban League Youth Summit 2011 with Governor Deval Patrick Northeastern University Master's Degree,  Electrical and Computer Engineering , Summa Cum Laude, expected 2010  – 2015 Northeastern University Electrical and Computer Engineering,  Engineering 2010  – 2015 Activities and Societies:  President of IEEE ,  Board member and vice-chair of Student Research Engagement Committee (SREC) ,  Peer Mentor ,  NSBE Member ,  Tau Beta Pi Engineering Honor Society Member ,  Summer Bridge 2010 Participant ,  National Urban League Youth Summit 2011 with Governor Deval Patrick Northeastern University Electrical and Computer Engineering,  Engineering 2010  – 2015 Activities and Societies:  President of IEEE ,  Board member and vice-chair of Student Research Engagement Committee (SREC) ,  Peer Mentor ,  NSBE Member ,  Tau Beta Pi Engineering Honor Society Member ,  Summer Bridge 2010 Participant ,  National Urban League Youth Summit 2011 with Governor Deval Patrick Northeastern University Electrical and Computer Engineering,  Engineering 2010  – 2015 Activities and Societies:  President of IEEE ,  Board member and vice-chair of Student Research Engagement Committee (SREC) ,  Peer Mentor ,  NSBE Member ,  Tau Beta Pi Engineering Honor Society Member ,  Summer Bridge 2010 Participant ,  National Urban League Youth Summit 2011 with Governor Deval Patrick Northeastern University Master's Degree,  Electrical and Computer Engineering , Summa Cum Laude, expected 2010  – 2015 Northeastern University Master's Degree,  Electrical and Computer Engineering , Summa Cum Laude, expected 2010  – 2015 Northeastern University Master's Degree,  Electrical and Computer Engineering , Summa Cum Laude, expected 2010  – 2015 Honors & Awards Additional Honors & Awards Google Scholar \nOutstanding Cooperative Education Award 2014 \nBarry M. Goldwater Scholar: Earned most prestigious merit-based award for U.S. undergraduates with a “demonstrated commitment and potential to make a significant contribution” in STEM fields \nBest Research Poster Award at RICC (Research & Industrial Collaboration Conference) \nIEEE Computer Society Scholar and Richard Merwin Student Ambassador \nAFCEA Cyber Security and Intelligence Scholar \nIEEE Power and Energy Society Scholar Additional Honors & Awards Google Scholar \nOutstanding Cooperative Education Award 2014 \nBarry M. Goldwater Scholar: Earned most prestigious merit-based award for U.S. undergraduates with a “demonstrated commitment and potential to make a significant contribution” in STEM fields \nBest Research Poster Award at RICC (Research & Industrial Collaboration Conference) \nIEEE Computer Society Scholar and Richard Merwin Student Ambassador \nAFCEA Cyber Security and Intelligence Scholar \nIEEE Power and Energy Society Scholar Additional Honors & Awards Google Scholar \nOutstanding Cooperative Education Award 2014 \nBarry M. Goldwater Scholar: Earned most prestigious merit-based award for U.S. undergraduates with a “demonstrated commitment and potential to make a significant contribution” in STEM fields \nBest Research Poster Award at RICC (Research & Industrial Collaboration Conference) \nIEEE Computer Society Scholar and Richard Merwin Student Ambassador \nAFCEA Cyber Security and Intelligence Scholar \nIEEE Power and Energy Society Scholar Additional Honors & Awards Google Scholar \nOutstanding Cooperative Education Award 2014 \nBarry M. Goldwater Scholar: Earned most prestigious merit-based award for U.S. undergraduates with a “demonstrated commitment and potential to make a significant contribution” in STEM fields \nBest Research Poster Award at RICC (Research & Industrial Collaboration Conference) \nIEEE Computer Society Scholar and Richard Merwin Student Ambassador \nAFCEA Cyber Security and Intelligence Scholar \nIEEE Power and Energy Society Scholar ", "Experience Storage Security Architect Intel Corporation May 2014  – Present (1 year 4 months) Software Engineer Intel Corporation June 2008  –  May 2014  (6 years) Storage Security Architect Intel Corporation May 2014  – Present (1 year 4 months) Storage Security Architect Intel Corporation May 2014  – Present (1 year 4 months) Software Engineer Intel Corporation June 2008  –  May 2014  (6 years) Software Engineer Intel Corporation June 2008  –  May 2014  (6 years) Skills Java C C++ .NET Network Security Computer Security Middleware CISSP Testing Algorithms Skills  Java C C++ .NET Network Security Computer Security Middleware CISSP Testing Algorithms Java C C++ .NET Network Security Computer Security Middleware CISSP Testing Algorithms Java C C++ .NET Network Security Computer Security Middleware CISSP Testing Algorithms Education New Mexico Institute of Mining and Technology Bachelor of Science,  Computer Science 2005  – 2009 New Mexico Institute of Mining and Technology Bachelor of Science,  Computer Science 2005  – 2009 New Mexico Institute of Mining and Technology Bachelor of Science,  Computer Science 2005  – 2009 New Mexico Institute of Mining and Technology Bachelor of Science,  Computer Science 2005  – 2009 ", "Experience Hardware Security Architect Intel Corporation September 2014  – Present (1 year) Hillsboro, Oregon Hardware Security Architect Intel Corporation September 2014  – Present (1 year) Hillsboro, Oregon Hardware Security Architect Intel Corporation September 2014  – Present (1 year) Hillsboro, Oregon Languages English Native or bilingual proficiency Chinese Native or bilingual proficiency Cantonese Professional working proficiency English Native or bilingual proficiency Chinese Native or bilingual proficiency Cantonese Professional working proficiency English Native or bilingual proficiency Chinese Native or bilingual proficiency Cantonese Professional working proficiency Native or bilingual proficiency Native or bilingual proficiency Professional working proficiency Skills Computer Architecture Computer Security Computer Hardware Hardware Security Parallel Computing Reliability Data Integrity System Simulation Systems Modeling C++ C Instrumentation Computer Proficiency MySQL PHP JavaScript Java Web Development Algorithms Verilog Matlab Software Engineering Embedded Systems Python Software Development Perl SoC Debugging Linux See 14+     See less Skills  Computer Architecture Computer Security Computer Hardware Hardware Security Parallel Computing Reliability Data Integrity System Simulation Systems Modeling C++ C Instrumentation Computer Proficiency MySQL PHP JavaScript Java Web Development Algorithms Verilog Matlab Software Engineering Embedded Systems Python Software Development Perl SoC Debugging Linux See 14+     See less Computer Architecture Computer Security Computer Hardware Hardware Security Parallel Computing Reliability Data Integrity System Simulation Systems Modeling C++ C Instrumentation Computer Proficiency MySQL PHP JavaScript Java Web Development Algorithms Verilog Matlab Software Engineering Embedded Systems Python Software Development Perl SoC Debugging Linux See 14+     See less Computer Architecture Computer Security Computer Hardware Hardware Security Parallel Computing Reliability Data Integrity System Simulation Systems Modeling C++ C Instrumentation Computer Proficiency MySQL PHP JavaScript Java Web Development Algorithms Verilog Matlab Software Engineering Embedded Systems Python Software Development Perl SoC Debugging Linux See 14+     See less Education Cornell University PhD 2007  – 2013 University of Waterloo B.S. 2002  – 2007 Cornell University PhD 2007  – 2013 Cornell University PhD 2007  – 2013 Cornell University PhD 2007  – 2013 University of Waterloo B.S. 2002  – 2007 University of Waterloo B.S. 2002  – 2007 University of Waterloo B.S. 2002  – 2007 Honors & Awards ", "Summary Security researcher with over ten years of experience in security architecture, validation and product security analysis in the United States, Canada and France. Summary Security researcher with over ten years of experience in security architecture, validation and product security analysis in the United States, Canada and France. Security researcher with over ten years of experience in security architecture, validation and product security analysis in the United States, Canada and France. Security researcher with over ten years of experience in security architecture, validation and product security analysis in the United States, Canada and France. Experience Security Architect Intel Corporation September 2013  – Present (2 years) Portland, Oregon Area Technical Lead Intel Corporation February 2013  – Present (2 years 7 months) Portland, Oregon Area Security Researcher - Team Lead Intel Corporation July 2011  –  August 2013  (2 years 2 months) Portland, Oregon Area Member of the Security Center of Excellence (SeCoE). \nLed security evaluation for the SoCs that power Intel’s first Atom-based Smartphones and Tablets.  \nAssisted product teams to identify, analyze and mitigate threats applying to Mobile platforms through architecture, design and implementation analysis. \nIdentified tools and methodology to identify vulnerabilities earlier in the Product Development Lifecycle (e.g.; through the use of Emulation). \nDeveloped and delivered classes on security architecture and hardware and firmware security. Security Researcher Intel Corporation February 2010  –  July 2011  (1 year 6 months) Portland, Oregon Area Member of the Security Center of Excellence (SeCoE). \nWorked on the security evaluation of server and client CPUs.  \nLooked for vulnerabilities in new features and in their integration in the final platform in order to fix them prior to product ship. Research Associate University of Waterloo August 2008  –  February 2010  (1 year 7 months) Carried out research on Trusted Computing and Security for Reconfigurable Platforms Research Associate Princeton University January 2007  –  June 2008  (1 year 6 months) Research Assistant STMicroelectronics October 2003  –  November 2006  (3 years 2 months) Intern Texas Instruments February 2003  –  August 2003  (7 months) Security Architect Intel Corporation September 2013  – Present (2 years) Portland, Oregon Area Security Architect Intel Corporation September 2013  – Present (2 years) Portland, Oregon Area Technical Lead Intel Corporation February 2013  – Present (2 years 7 months) Portland, Oregon Area Technical Lead Intel Corporation February 2013  – Present (2 years 7 months) Portland, Oregon Area Security Researcher - Team Lead Intel Corporation July 2011  –  August 2013  (2 years 2 months) Portland, Oregon Area Member of the Security Center of Excellence (SeCoE). \nLed security evaluation for the SoCs that power Intel’s first Atom-based Smartphones and Tablets.  \nAssisted product teams to identify, analyze and mitigate threats applying to Mobile platforms through architecture, design and implementation analysis. \nIdentified tools and methodology to identify vulnerabilities earlier in the Product Development Lifecycle (e.g.; through the use of Emulation). \nDeveloped and delivered classes on security architecture and hardware and firmware security. Security Researcher - Team Lead Intel Corporation July 2011  –  August 2013  (2 years 2 months) Portland, Oregon Area Member of the Security Center of Excellence (SeCoE). \nLed security evaluation for the SoCs that power Intel’s first Atom-based Smartphones and Tablets.  \nAssisted product teams to identify, analyze and mitigate threats applying to Mobile platforms through architecture, design and implementation analysis. \nIdentified tools and methodology to identify vulnerabilities earlier in the Product Development Lifecycle (e.g.; through the use of Emulation). \nDeveloped and delivered classes on security architecture and hardware and firmware security. Security Researcher Intel Corporation February 2010  –  July 2011  (1 year 6 months) Portland, Oregon Area Member of the Security Center of Excellence (SeCoE). \nWorked on the security evaluation of server and client CPUs.  \nLooked for vulnerabilities in new features and in their integration in the final platform in order to fix them prior to product ship. Security Researcher Intel Corporation February 2010  –  July 2011  (1 year 6 months) Portland, Oregon Area Member of the Security Center of Excellence (SeCoE). \nWorked on the security evaluation of server and client CPUs.  \nLooked for vulnerabilities in new features and in their integration in the final platform in order to fix them prior to product ship. Research Associate University of Waterloo August 2008  –  February 2010  (1 year 7 months) Carried out research on Trusted Computing and Security for Reconfigurable Platforms Research Associate University of Waterloo August 2008  –  February 2010  (1 year 7 months) Carried out research on Trusted Computing and Security for Reconfigurable Platforms Research Associate Princeton University January 2007  –  June 2008  (1 year 6 months) Research Associate Princeton University January 2007  –  June 2008  (1 year 6 months) Research Assistant STMicroelectronics October 2003  –  November 2006  (3 years 2 months) Research Assistant STMicroelectronics October 2003  –  November 2006  (3 years 2 months) Intern Texas Instruments February 2003  –  August 2003  (7 months) Intern Texas Instruments February 2003  –  August 2003  (7 months) Languages English Full professional proficiency French Native or bilingual proficiency English Full professional proficiency French Native or bilingual proficiency English Full professional proficiency French Native or bilingual proficiency Full professional proficiency Native or bilingual proficiency Skills Electrical Engineering Computer Engineering Computer Architecture VLSI Verilog Security Evaluations Computer Security Security ASIC Firmware SoC Threat Analysis Vulnerability Assessment Vulnerability Research Security Development... FPGA Hardware Architecture Security Architecture... Debugging VHDL See 5+     See less Skills  Electrical Engineering Computer Engineering Computer Architecture VLSI Verilog Security Evaluations Computer Security Security ASIC Firmware SoC Threat Analysis Vulnerability Assessment Vulnerability Research Security Development... FPGA Hardware Architecture Security Architecture... Debugging VHDL See 5+     See less Electrical Engineering Computer Engineering Computer Architecture VLSI Verilog Security Evaluations Computer Security Security ASIC Firmware SoC Threat Analysis Vulnerability Assessment Vulnerability Research Security Development... FPGA Hardware Architecture Security Architecture... Debugging VHDL See 5+     See less Electrical Engineering Computer Engineering Computer Architecture VLSI Verilog Security Evaluations Computer Security Security ASIC Firmware SoC Threat Analysis Vulnerability Assessment Vulnerability Research Security Development... FPGA Hardware Architecture Security Architecture... Debugging VHDL See 5+     See less Education Université de Montpellier PhD,  Computer Engineering 2003  – 2006 Université de Montpellier Master (DEA - Research),  Electrical Engineering 2002  – 2003 Polytech Montpellier Master (Engineer),  Electrical Engineering 1999  – 2003 Université Paul Sabatier (Toulouse III) DEUG,  Science de la matière 1997  – 1999 Université de Montpellier PhD,  Computer Engineering 2003  – 2006 Université de Montpellier PhD,  Computer Engineering 2003  – 2006 Université de Montpellier PhD,  Computer Engineering 2003  – 2006 Université de Montpellier Master (DEA - Research),  Electrical Engineering 2002  – 2003 Université de Montpellier Master (DEA - Research),  Electrical Engineering 2002  – 2003 Université de Montpellier Master (DEA - Research),  Electrical Engineering 2002  – 2003 Polytech Montpellier Master (Engineer),  Electrical Engineering 1999  – 2003 Polytech Montpellier Master (Engineer),  Electrical Engineering 1999  – 2003 Polytech Montpellier Master (Engineer),  Electrical Engineering 1999  – 2003 Université Paul Sabatier (Toulouse III) DEUG,  Science de la matière 1997  – 1999 Université Paul Sabatier (Toulouse III) DEUG,  Science de la matière 1997  – 1999 Université Paul Sabatier (Toulouse III) DEUG,  Science de la matière 1997  – 1999 ", "Skills Security Debugging Computer Security Embedded Systems Computer Architecture Software Engineering C System Architecture Software Development Device Drivers SoC Cloud Computing System Security &... Threat Analysis Information Security Trusted Computing Authentication and... Embedded and HW security Key Management Distributed Systems C/C++ Java Python Linux Cloud Security Big Data TLS/SSL Kerberos OpenStack Hadoop See 15+     See less Skills  Security Debugging Computer Security Embedded Systems Computer Architecture Software Engineering C System Architecture Software Development Device Drivers SoC Cloud Computing System Security &... Threat Analysis Information Security Trusted Computing Authentication and... Embedded and HW security Key Management Distributed Systems C/C++ Java Python Linux Cloud Security Big Data TLS/SSL Kerberos OpenStack Hadoop See 15+     See less Security Debugging Computer Security Embedded Systems Computer Architecture Software Engineering C System Architecture Software Development Device Drivers SoC Cloud Computing System Security &... Threat Analysis Information Security Trusted Computing Authentication and... Embedded and HW security Key Management Distributed Systems C/C++ Java Python Linux Cloud Security Big Data TLS/SSL Kerberos OpenStack Hadoop See 15+     See less Security Debugging Computer Security Embedded Systems Computer Architecture Software Engineering C System Architecture Software Development Device Drivers SoC Cloud Computing System Security &... Threat Analysis Information Security Trusted Computing Authentication and... Embedded and HW security Key Management Distributed Systems C/C++ Java Python Linux Cloud Security Big Data TLS/SSL Kerberos OpenStack Hadoop See 15+     See less ", "Experience Security Architect Intel Corporation February 2012  – Present (3 years 7 months) Security Architect Intel Corporation February 2012  – Present (3 years 7 months) Security Architect Intel Corporation February 2012  – Present (3 years 7 months) Languages   Skills Security System Architecture Software Development Systems Engineering Network Security CISSP Architecture SQL Virtualization Business Intelligence PKI Object Oriented Design Vendor Management VPN Enterprise Software Business Analysis Information Security Computer Security Cloud Computing Identity Management Encryption Application Security Information Security... Cryptography Security Architecture... Penetration Testing PCI DSS Vulnerability Assessment Enterprise Architecture Disaster Recovery Firewalls Computer Forensics Security Audits See 18+     See less Skills  Security System Architecture Software Development Systems Engineering Network Security CISSP Architecture SQL Virtualization Business Intelligence PKI Object Oriented Design Vendor Management VPN Enterprise Software Business Analysis Information Security Computer Security Cloud Computing Identity Management Encryption Application Security Information Security... Cryptography Security Architecture... Penetration Testing PCI DSS Vulnerability Assessment Enterprise Architecture Disaster Recovery Firewalls Computer Forensics Security Audits See 18+     See less Security System Architecture Software Development Systems Engineering Network Security CISSP Architecture SQL Virtualization Business Intelligence PKI Object Oriented Design Vendor Management VPN Enterprise Software Business Analysis Information Security Computer Security Cloud Computing Identity Management Encryption Application Security Information Security... Cryptography Security Architecture... Penetration Testing PCI DSS Vulnerability Assessment Enterprise Architecture Disaster Recovery Firewalls Computer Forensics Security Audits See 18+     See less Security System Architecture Software Development Systems Engineering Network Security CISSP Architecture SQL Virtualization Business Intelligence PKI Object Oriented Design Vendor Management VPN Enterprise Software Business Analysis Information Security Computer Security Cloud Computing Identity Management Encryption Application Security Information Security... Cryptography Security Architecture... Penetration Testing PCI DSS Vulnerability Assessment Enterprise Architecture Disaster Recovery Firewalls Computer Forensics Security Audits See 18+     See less Education Ben Gurion University of Negev Bsc 1999  – 2003 Ben Gurion University of Negev Bsc 1999  – 2003 Ben Gurion University of Negev Bsc 1999  – 2003 Ben Gurion University of Negev Bsc 1999  – 2003 Honors & Awards ", "Experience Contract Software Engineer / Security Architect Intel Corporation August 2012  – Present (3 years 1 month) Hillsboro, OR Ruby on Rails, Node.js, Linux, TDD & Agile. Founder InscoreInc.com December 1987  – Present (27 years 9 months) Boulder, Colorado Ruby on Rails Developer Saveology.com ™ September 2011  –  January 2012  (5 months) Fort Lauderdale, Florida Handler of Biznitos W3matter LLC April 2011  –  September 2011  (6 months) Ruby on Rails \njQuery Web Designer Wisconsin Center for Information Technololgy Services 2008  –  2008  (less than a year) University of Wisconsin Whitewater For a semester I worked as a Student Web Developer at Web Development company created by two UWW professors, that served local small businesses. Contract Software Engineer / Security Architect Intel Corporation August 2012  – Present (3 years 1 month) Hillsboro, OR Ruby on Rails, Node.js, Linux, TDD & Agile. Contract Software Engineer / Security Architect Intel Corporation August 2012  – Present (3 years 1 month) Hillsboro, OR Ruby on Rails, Node.js, Linux, TDD & Agile. Founder InscoreInc.com December 1987  – Present (27 years 9 months) Boulder, Colorado Founder InscoreInc.com December 1987  – Present (27 years 9 months) Boulder, Colorado Ruby on Rails Developer Saveology.com ™ September 2011  –  January 2012  (5 months) Fort Lauderdale, Florida Ruby on Rails Developer Saveology.com ™ September 2011  –  January 2012  (5 months) Fort Lauderdale, Florida Handler of Biznitos W3matter LLC April 2011  –  September 2011  (6 months) Ruby on Rails \njQuery Handler of Biznitos W3matter LLC April 2011  –  September 2011  (6 months) Ruby on Rails \njQuery Web Designer Wisconsin Center for Information Technololgy Services 2008  –  2008  (less than a year) University of Wisconsin Whitewater For a semester I worked as a Student Web Developer at Web Development company created by two UWW professors, that served local small businesses. Web Designer Wisconsin Center for Information Technololgy Services 2008  –  2008  (less than a year) University of Wisconsin Whitewater For a semester I worked as a Student Web Developer at Web Development company created by two UWW professors, that served local small businesses. Skills jQuery JavaScript CSS HTML Ruby Ruby on Rails Node.js Heroku Agile Project Management Database Administration Database Design HAML SASS PostgreSQL Redis Rescue Devise Blender3d ActionScript Git Pivotal REST APIs Web Development Test Driven Development Agile Methodologies Linux HTML 5 See 12+     See less Skills  jQuery JavaScript CSS HTML Ruby Ruby on Rails Node.js Heroku Agile Project Management Database Administration Database Design HAML SASS PostgreSQL Redis Rescue Devise Blender3d ActionScript Git Pivotal REST APIs Web Development Test Driven Development Agile Methodologies Linux HTML 5 See 12+     See less jQuery JavaScript CSS HTML Ruby Ruby on Rails Node.js Heroku Agile Project Management Database Administration Database Design HAML SASS PostgreSQL Redis Rescue Devise Blender3d ActionScript Git Pivotal REST APIs Web Development Test Driven Development Agile Methodologies Linux HTML 5 See 12+     See less jQuery JavaScript CSS HTML Ruby Ruby on Rails Node.js Heroku Agile Project Management Database Administration Database Design HAML SASS PostgreSQL Redis Rescue Devise Blender3d ActionScript Git Pivotal REST APIs Web Development Test Driven Development Agile Methodologies Linux HTML 5 See 12+     See less Education Hogeschool van Arnhem en Nijmegen 1 year Study Abroad,  International Buiness 2009  – 2010 University of Wisconsin-Whitewater Bachelor of Business Administration,  Management Computer Systems 2004  – 2010 Hogeschool van Arnhem en Nijmegen 1 year Study Abroad,  International Buiness 2009  – 2010 Hogeschool van Arnhem en Nijmegen 1 year Study Abroad,  International Buiness 2009  – 2010 Hogeschool van Arnhem en Nijmegen 1 year Study Abroad,  International Buiness 2009  – 2010 University of Wisconsin-Whitewater Bachelor of Business Administration,  Management Computer Systems 2004  – 2010 University of Wisconsin-Whitewater Bachelor of Business Administration,  Management Computer Systems 2004  – 2010 University of Wisconsin-Whitewater Bachelor of Business Administration,  Management Computer Systems 2004  – 2010 ", "Skills Security Technologies Application Security PKI Access Management Security Architecture... Security Policy Key Management Skills  Security Technologies Application Security PKI Access Management Security Architecture... Security Policy Key Management Security Technologies Application Security PKI Access Management Security Architecture... Security Policy Key Management Security Technologies Application Security PKI Access Management Security Architecture... Security Policy Key Management ", "Languages English Native or bilingual proficiency Spanish Native or bilingual proficiency French Professional working proficiency English Native or bilingual proficiency Spanish Native or bilingual proficiency French Professional working proficiency English Native or bilingual proficiency Spanish Native or bilingual proficiency French Professional working proficiency Native or bilingual proficiency Native or bilingual proficiency Professional working proficiency Skills Security Architecture... Cloud Computing IT Service Management Solution Architecture CRM Project Management Information Security Network Security Data Center IT Operations Checkpoint Computer Security Security Business Intelligence Windows Server Cisco Technologies Disaster Recovery Active Directory Firewalls PMP CISSP Information Security... ITIL Enterprise Architecture Network Architecture IT Management Business Continuity IT Strategy VPN Virtualization Servers Integration Information Technology Consulting Leadership Networking Vendor Management See 22+     See less Skills  Security Architecture... Cloud Computing IT Service Management Solution Architecture CRM Project Management Information Security Network Security Data Center IT Operations Checkpoint Computer Security Security Business Intelligence Windows Server Cisco Technologies Disaster Recovery Active Directory Firewalls PMP CISSP Information Security... ITIL Enterprise Architecture Network Architecture IT Management Business Continuity IT Strategy VPN Virtualization Servers Integration Information Technology Consulting Leadership Networking Vendor Management See 22+     See less Security Architecture... Cloud Computing IT Service Management Solution Architecture CRM Project Management Information Security Network Security Data Center IT Operations Checkpoint Computer Security Security Business Intelligence Windows Server Cisco Technologies Disaster Recovery Active Directory Firewalls PMP CISSP Information Security... ITIL Enterprise Architecture Network Architecture IT Management Business Continuity IT Strategy VPN Virtualization Servers Integration Information Technology Consulting Leadership Networking Vendor Management See 22+     See less Security Architecture... Cloud Computing IT Service Management Solution Architecture CRM Project Management Information Security Network Security Data Center IT Operations Checkpoint Computer Security Security Business Intelligence Windows Server Cisco Technologies Disaster Recovery Active Directory Firewalls PMP CISSP Information Security... ITIL Enterprise Architecture Network Architecture IT Management Business Continuity IT Strategy VPN Virtualization Servers Integration Information Technology Consulting Leadership Networking Vendor Management See 22+     See less ", "Experience Design Engineering Lead Micron Technology May 2013  – Present (2 years 4 months) Folsom, Ca Platform Security Architect Intel Corporation April 2012  –  May 2013  (1 year 2 months) Folsom CA Security Architect Intel Corporation October 2010  –  April 2012  (1 year 7 months) Folsom CA Firmware Engineering Manager Intel Corporation August 2009  –  October 2010  (1 year 3 months) Folsom CA Firmware Micro-Architecture Lead Intel Corporation August 2004  –  August 2009  (5 years 1 month) Folsom CA Software Engineer Intel Corporation August 2000  –  August 2004  (4 years 1 month) Folsom, CA Design Engineering Lead Micron Technology May 2013  – Present (2 years 4 months) Folsom, Ca Design Engineering Lead Micron Technology May 2013  – Present (2 years 4 months) Folsom, Ca Platform Security Architect Intel Corporation April 2012  –  May 2013  (1 year 2 months) Folsom CA Platform Security Architect Intel Corporation April 2012  –  May 2013  (1 year 2 months) Folsom CA Security Architect Intel Corporation October 2010  –  April 2012  (1 year 7 months) Folsom CA Security Architect Intel Corporation October 2010  –  April 2012  (1 year 7 months) Folsom CA Firmware Engineering Manager Intel Corporation August 2009  –  October 2010  (1 year 3 months) Folsom CA Firmware Engineering Manager Intel Corporation August 2009  –  October 2010  (1 year 3 months) Folsom CA Firmware Micro-Architecture Lead Intel Corporation August 2004  –  August 2009  (5 years 1 month) Folsom CA Firmware Micro-Architecture Lead Intel Corporation August 2004  –  August 2009  (5 years 1 month) Folsom CA Software Engineer Intel Corporation August 2000  –  August 2004  (4 years 1 month) Folsom, CA Software Engineer Intel Corporation August 2000  –  August 2004  (4 years 1 month) Folsom, CA Skills Debugging Semiconductors SoC Embedded Systems Embedded Software Firmware ASIC Device Drivers Skills  Debugging Semiconductors SoC Embedded Systems Embedded Software Firmware ASIC Device Drivers Debugging Semiconductors SoC Embedded Systems Embedded Software Firmware ASIC Device Drivers Debugging Semiconductors SoC Embedded Systems Embedded Software Firmware ASIC Device Drivers Education Western Michigan University Master's degree,  Computer Science 1998  – 2000 Bangalore University Bachelor's degree,  Electrical and Electronics Engineering 1993  – 1997 Western Michigan University Master's degree,  Computer Science 1998  – 2000 Western Michigan University Master's degree,  Computer Science 1998  – 2000 Western Michigan University Master's degree,  Computer Science 1998  – 2000 Bangalore University Bachelor's degree,  Electrical and Electronics Engineering 1993  – 1997 Bangalore University Bachelor's degree,  Electrical and Electronics Engineering 1993  – 1997 Bangalore University Bachelor's degree,  Electrical and Electronics Engineering 1993  – 1997 "]}