{"position": "Senior Programmer", "company": "IBM", "profiles": ["Experience Senior Programmer IBM June 1978  – Present (37 years 3 months) Senior Programmer IBM June 1978  – Present (37 years 3 months) Senior Programmer IBM June 1978  – Present (37 years 3 months) Education Milwaukee School of Engineering BS EE,  Electrical Engineering 1974  – 1978 Activities and Societies:  Secretary of TOM honor fraternity Milwaukee School of Engineering BS EE,  Electrical Engineering 1974  – 1978 Activities and Societies:  Secretary of TOM honor fraternity Milwaukee School of Engineering BS EE,  Electrical Engineering 1974  – 1978 Activities and Societies:  Secretary of TOM honor fraternity Milwaukee School of Engineering BS EE,  Electrical Engineering 1974  – 1978 Activities and Societies:  Secretary of TOM honor fraternity ", "", "Skills Cable Television Microcontrollers Video Embedded Systems Electronics Product Design Product Marketing Rapid Prototyping Software Engineering Robotics Telecommunications Manufacturing Design for Manufacturing Start-ups Product Management CAD Engineering Product Development System Architecture Inventor Engineering Management FPGA See 7+     See less Skills  Cable Television Microcontrollers Video Embedded Systems Electronics Product Design Product Marketing Rapid Prototyping Software Engineering Robotics Telecommunications Manufacturing Design for Manufacturing Start-ups Product Management CAD Engineering Product Development System Architecture Inventor Engineering Management FPGA See 7+     See less Cable Television Microcontrollers Video Embedded Systems Electronics Product Design Product Marketing Rapid Prototyping Software Engineering Robotics Telecommunications Manufacturing Design for Manufacturing Start-ups Product Management CAD Engineering Product Development System Architecture Inventor Engineering Management FPGA See 7+     See less Cable Television Microcontrollers Video Embedded Systems Electronics Product Design Product Marketing Rapid Prototyping Software Engineering Robotics Telecommunications Manufacturing Design for Manufacturing Start-ups Product Management CAD Engineering Product Development System Architecture Inventor Engineering Management FPGA See 7+     See less Honors & Awards ", "Skills Unix XML Oracle SQL DB2 Java Enterprise Edition Shell Scripting C Linux Skills  Unix XML Oracle SQL DB2 Java Enterprise Edition Shell Scripting C Linux Unix XML Oracle SQL DB2 Java Enterprise Edition Shell Scripting C Linux Unix XML Oracle SQL DB2 Java Enterprise Edition Shell Scripting C Linux ", "Experience Senior Programmer IBM Senior Programmer IBM Senior Programmer IBM Education St. Edward's University 2003  – 2007 St. Edward's University 2003  – 2007 St. Edward's University 2003  – 2007 St. Edward's University 2003  – 2007 ", "Experience Senior Programmer IBM Senior Programmer IBM Senior Programmer IBM Education City University of New York City College 1974  – 1978 City University of New York City College 1974  – 1978 City University of New York City College 1974  – 1978 City University of New York City College 1974  – 1978 ", "", "Experience Senior Programmer IBM Senior Programmer IBM Senior Programmer IBM Education University of Massachusetts, Amherst MA,  Math 1967  – 1969 Clarkson University 1964  – 1967 Phillips Exeter Academy HS,  Math 1962  – 1964 University of Massachusetts, Amherst MA,  Math 1967  – 1969 University of Massachusetts, Amherst MA,  Math 1967  – 1969 University of Massachusetts, Amherst MA,  Math 1967  – 1969 Clarkson University 1964  – 1967 Clarkson University 1964  – 1967 Clarkson University 1964  – 1967 Phillips Exeter Academy HS,  Math 1962  – 1964 Phillips Exeter Academy HS,  Math 1962  – 1964 Phillips Exeter Academy HS,  Math 1962  – 1964 ", "Skills TSO OS/390 z/OS PL/1 Mainframe ISPF BAL MVS IBM Utilities DB2 REXX JCL IBM Mainframe Testing Debugging SQL Middleware Unix XML zSeries Operating Systems Software Development AIX COBOL Websphere Enterprise Architecture Software Engineering See 12+     See less Skills  TSO OS/390 z/OS PL/1 Mainframe ISPF BAL MVS IBM Utilities DB2 REXX JCL IBM Mainframe Testing Debugging SQL Middleware Unix XML zSeries Operating Systems Software Development AIX COBOL Websphere Enterprise Architecture Software Engineering See 12+     See less TSO OS/390 z/OS PL/1 Mainframe ISPF BAL MVS IBM Utilities DB2 REXX JCL IBM Mainframe Testing Debugging SQL Middleware Unix XML zSeries Operating Systems Software Development AIX COBOL Websphere Enterprise Architecture Software Engineering See 12+     See less TSO OS/390 z/OS PL/1 Mainframe ISPF BAL MVS IBM Utilities DB2 REXX JCL IBM Mainframe Testing Debugging SQL Middleware Unix XML zSeries Operating Systems Software Development AIX COBOL Websphere Enterprise Architecture Software Engineering See 12+     See less ", "Experience Senior Programmer IBM - Retired Senior Programmer IBM 1961  –  1992  (31 years) Senior Programmer IBM - Retired Senior Programmer IBM - Retired Senior Programmer IBM 1961  –  1992  (31 years) Senior Programmer IBM 1961  –  1992  (31 years) Skills Perl Script PLAS C Linux Shell Scripting Unix Perl Skills  Perl Script PLAS C Linux Shell Scripting Unix Perl Perl Script PLAS C Linux Shell Scripting Unix Perl Perl Script PLAS C Linux Shell Scripting Unix Perl Education Case Institue of Technology BSEE,  Electrical and Electronics Engineering 1957  – 1961 Case Institute of Technology Bachelor's degree BSEE,  Electrical and Electronics Engineering 1957  – 1961 Case Institue of Technology BSEE,  Electrical and Electronics Engineering 1957  – 1961 Case Institue of Technology BSEE,  Electrical and Electronics Engineering 1957  – 1961 Case Institue of Technology BSEE,  Electrical and Electronics Engineering 1957  – 1961 Case Institute of Technology Bachelor's degree BSEE,  Electrical and Electronics Engineering 1957  – 1961 Case Institute of Technology Bachelor's degree BSEE,  Electrical and Electronics Engineering 1957  – 1961 Case Institute of Technology Bachelor's degree BSEE,  Electrical and Electronics Engineering 1957  – 1961 ", "Skills Cloud Computing IT Service Management Systems Management ITIL Certified Enterprise Architecture Standardization Distributed Systems Java Solution Architecture Virtualization XML Software Design Software Development SOA ITIL System Architecture IT Strategy Integration Enterprise Software See 4+     See less Skills  Cloud Computing IT Service Management Systems Management ITIL Certified Enterprise Architecture Standardization Distributed Systems Java Solution Architecture Virtualization XML Software Design Software Development SOA ITIL System Architecture IT Strategy Integration Enterprise Software See 4+     See less Cloud Computing IT Service Management Systems Management ITIL Certified Enterprise Architecture Standardization Distributed Systems Java Solution Architecture Virtualization XML Software Design Software Development SOA ITIL System Architecture IT Strategy Integration Enterprise Software See 4+     See less Cloud Computing IT Service Management Systems Management ITIL Certified Enterprise Architecture Standardization Distributed Systems Java Solution Architecture Virtualization XML Software Design Software Development SOA ITIL System Architecture IT Strategy Integration Enterprise Software See 4+     See less ", "Summary Software developer and project lead/manager with proven broad experience in creating program products, gathering and analyzing requirements, designing solutions to complex problems, producing superior documentation, and organizing and building effective teams across a wide range of computing and cultural environments. Specialties:Software Summary Software developer and project lead/manager with proven broad experience in creating program products, gathering and analyzing requirements, designing solutions to complex problems, producing superior documentation, and organizing and building effective teams across a wide range of computing and cultural environments. Specialties:Software Software developer and project lead/manager with proven broad experience in creating program products, gathering and analyzing requirements, designing solutions to complex problems, producing superior documentation, and organizing and building effective teams across a wide range of computing and cultural environments. Specialties:Software Software developer and project lead/manager with proven broad experience in creating program products, gathering and analyzing requirements, designing solutions to complex problems, producing superior documentation, and organizing and building effective teams across a wide range of computing and cultural environments. Specialties:Software Experience Clinical Applications Analyst VCUHS February 2011  – Present (4 years 7 months) Richmond, Virginia Computer Programmer, Equipment Integration QIMONDA March 2007  –  February 2009  (2 years) Consultant Private Consulting June 2002  –  March 2007  (4 years 10 months) Programmer/Team Lead MCI June 1996  –  June 2002  (6 years 1 month) Contract Programmer ICR, Inc. August 1995  –  December 1995  (5 months) Development Manager ENS (Eterprise Network Services) June 1994  –  June 1995  (1 year 1 month) Junior Programmer--Senior Programmer IBM June 1970  –  June 1994  (24 years 1 month) Senior Programmer IBM 1970  –  1994  (24 years) Clinical Applications Analyst VCUHS February 2011  – Present (4 years 7 months) Richmond, Virginia Clinical Applications Analyst VCUHS February 2011  – Present (4 years 7 months) Richmond, Virginia Computer Programmer, Equipment Integration QIMONDA March 2007  –  February 2009  (2 years) Computer Programmer, Equipment Integration QIMONDA March 2007  –  February 2009  (2 years) Consultant Private Consulting June 2002  –  March 2007  (4 years 10 months) Consultant Private Consulting June 2002  –  March 2007  (4 years 10 months) Programmer/Team Lead MCI June 1996  –  June 2002  (6 years 1 month) Programmer/Team Lead MCI June 1996  –  June 2002  (6 years 1 month) Contract Programmer ICR, Inc. August 1995  –  December 1995  (5 months) Contract Programmer ICR, Inc. August 1995  –  December 1995  (5 months) Development Manager ENS (Eterprise Network Services) June 1994  –  June 1995  (1 year 1 month) Development Manager ENS (Eterprise Network Services) June 1994  –  June 1995  (1 year 1 month) Junior Programmer--Senior Programmer IBM June 1970  –  June 1994  (24 years 1 month) Junior Programmer--Senior Programmer IBM June 1970  –  June 1994  (24 years 1 month) Senior Programmer IBM 1970  –  1994  (24 years) Senior Programmer IBM 1970  –  1994  (24 years) Skills Unix Java Perl Windows Software Documentation Requirements Analysis Software Project... Software Development Oracle Microsoft SQL Server Requirements Gathering Visual Basic Skills  Unix Java Perl Windows Software Documentation Requirements Analysis Software Project... Software Development Oracle Microsoft SQL Server Requirements Gathering Visual Basic Unix Java Perl Windows Software Documentation Requirements Analysis Software Project... Software Development Oracle Microsoft SQL Server Requirements Gathering Visual Basic Unix Java Perl Windows Software Documentation Requirements Analysis Software Project... Software Development Oracle Microsoft SQL Server Requirements Gathering Visual Basic Education Oklahoma State University BS 1967  – 1970 NEO A&M Jr. College 1966  – 1967 Oklahoma State University BS 1967  – 1970 Oklahoma State University BS 1967  – 1970 Oklahoma State University BS 1967  – 1970 NEO A&M Jr. College 1966  – 1967 NEO A&M Jr. College 1966  – 1967 NEO A&M Jr. College 1966  – 1967 Honors & Awards ", "Experience Senior Programmer IBM Webmaster Home-Barista.com 2005  –  2010  (5 years) Senior Programmer IBM Senior Programmer IBM Webmaster Home-Barista.com 2005  –  2010  (5 years) Webmaster Home-Barista.com 2005  –  2010  (5 years) Skills Java Websphere Integration Software Development WebSphere Application... REST Scrum Management Software Documentation Software Engineering Java Enterprise Edition Agile Methodologies SOA XML Enterprise Architecture Skills  Java Websphere Integration Software Development WebSphere Application... REST Scrum Management Software Documentation Software Engineering Java Enterprise Edition Agile Methodologies SOA XML Enterprise Architecture Java Websphere Integration Software Development WebSphere Application... REST Scrum Management Software Documentation Software Engineering Java Enterprise Edition Agile Methodologies SOA XML Enterprise Architecture Java Websphere Integration Software Development WebSphere Application... REST Scrum Management Software Documentation Software Engineering Java Enterprise Edition Agile Methodologies SOA XML Enterprise Architecture ", "Skills Unix Integration Operating Systems Security Software Development Skills  Unix Integration Operating Systems Security Software Development Unix Integration Operating Systems Security Software Development Unix Integration Operating Systems Security Software Development ", "Experience Programmer (IBM iSeries AS/400) Prima banka Slovensko, a.s. January 2012  – Present (3 years 8 months) Žilina, Slovakia Bank application development on IBM iSeries system AS/400. Senior Programmer (IBM iSeries AS/400) Datateam, s.r.o. October 2003  –  November 2007  (4 years 2 months) Žilina, Slovakia Bank application development on IBM iSeries system AS/400. Senior Programmer (IBM iSeries AS/400) Dexia September 2003  –  August 2007  (4 years) Žilina, Slovakia Bank application development on IBM iSeries system AS/400. Senior Programmer (IBM iSeries AS/400) Prvá komunálna banka September 1995  –  September 2003  (8 years 1 month) Žilina, Slovakia Bank application development on IBM iSeries system AS/400. Customer Service Representative MADO, s.r.o. January 1995  –  September 1995  (9 months) Žilina, SLovakia Programming Analyst IPEA, s.r.o. April 1992  –  December 1994  (2 years 9 months) Žilina, Slovakia Programming of enterprise applications. Programmer Severoslovenské lesy January 1990  –  March 1992  (2 years 3 months) Žilina, Slovakia Software Developer Ústav racionalizácie priemyslu July 1987  –  December 1989  (2 years 6 months) Žilina, Slovakia Development of software for control technologies in real time. Programmer (IBM iSeries AS/400) Prima banka Slovensko, a.s. January 2012  – Present (3 years 8 months) Žilina, Slovakia Bank application development on IBM iSeries system AS/400. Programmer (IBM iSeries AS/400) Prima banka Slovensko, a.s. January 2012  – Present (3 years 8 months) Žilina, Slovakia Bank application development on IBM iSeries system AS/400. Senior Programmer (IBM iSeries AS/400) Datateam, s.r.o. October 2003  –  November 2007  (4 years 2 months) Žilina, Slovakia Bank application development on IBM iSeries system AS/400. Senior Programmer (IBM iSeries AS/400) Datateam, s.r.o. October 2003  –  November 2007  (4 years 2 months) Žilina, Slovakia Bank application development on IBM iSeries system AS/400. Senior Programmer (IBM iSeries AS/400) Dexia September 2003  –  August 2007  (4 years) Žilina, Slovakia Bank application development on IBM iSeries system AS/400. Senior Programmer (IBM iSeries AS/400) Dexia September 2003  –  August 2007  (4 years) Žilina, Slovakia Bank application development on IBM iSeries system AS/400. Senior Programmer (IBM iSeries AS/400) Prvá komunálna banka September 1995  –  September 2003  (8 years 1 month) Žilina, Slovakia Bank application development on IBM iSeries system AS/400. Senior Programmer (IBM iSeries AS/400) Prvá komunálna banka September 1995  –  September 2003  (8 years 1 month) Žilina, Slovakia Bank application development on IBM iSeries system AS/400. Customer Service Representative MADO, s.r.o. January 1995  –  September 1995  (9 months) Žilina, SLovakia Customer Service Representative MADO, s.r.o. January 1995  –  September 1995  (9 months) Žilina, SLovakia Programming Analyst IPEA, s.r.o. April 1992  –  December 1994  (2 years 9 months) Žilina, Slovakia Programming of enterprise applications. Programming Analyst IPEA, s.r.o. April 1992  –  December 1994  (2 years 9 months) Žilina, Slovakia Programming of enterprise applications. Programmer Severoslovenské lesy January 1990  –  March 1992  (2 years 3 months) Žilina, Slovakia Programmer Severoslovenské lesy January 1990  –  March 1992  (2 years 3 months) Žilina, Slovakia Software Developer Ústav racionalizácie priemyslu July 1987  –  December 1989  (2 years 6 months) Žilina, Slovakia Development of software for control technologies in real time. Software Developer Ústav racionalizácie priemyslu July 1987  –  December 1989  (2 years 6 months) Žilina, Slovakia Development of software for control technologies in real time. Skills IBM AS/400 IBM iSeries Core Banking Program Development MIDAS Retail Banking Banking Financial Risk Software Development Skills  IBM AS/400 IBM iSeries Core Banking Program Development MIDAS Retail Banking Banking Financial Risk Software Development IBM AS/400 IBM iSeries Core Banking Program Development MIDAS Retail Banking Banking Financial Risk Software Development IBM AS/400 IBM iSeries Core Banking Program Development MIDAS Retail Banking Banking Financial Risk Software Development Education Žilinská univerzita Master of Engineering (M.Eng.),  kybernetika 1982  – 1987 Žilinská univerzita Master of Engineering (M.Eng.),  kybernetika 1982  – 1987 Žilinská univerzita Master of Engineering (M.Eng.),  kybernetika 1982  – 1987 Žilinská univerzita Master of Engineering (M.Eng.),  kybernetika 1982  – 1987 ", "Summary Highlights of a career of accomplishments in diverse Software Engineering Leadership:  \n \nI have managed people and projects for over 10 years. I have worked very successfully from my home office, at customer sites, or in a corporate office setting.  \nBefore working as a department and project manager, I was a Senior Programmer at IBM and creator of multiple test automation tools. I also was a key contributor to the contract Proposal Manager used at the time by IBM Professional Services.  \nI garnered multiple OA's (Outstanding Achievement) awards during my IBM career  \nAs a manager at IBM, I was picked as the top manager in my group on 3 out of 4 employee opinion surveys.  \nAs a college student, I graduated Cum Laude despite working an average of well over 40 hours a week as a test technician at IBM.  \nI have a strong understanding of materials and do well with mechanical and construction projects. \n \nMy goal is to connect with a company where I can utilize my project management and people skills. Summary Highlights of a career of accomplishments in diverse Software Engineering Leadership:  \n \nI have managed people and projects for over 10 years. I have worked very successfully from my home office, at customer sites, or in a corporate office setting.  \nBefore working as a department and project manager, I was a Senior Programmer at IBM and creator of multiple test automation tools. I also was a key contributor to the contract Proposal Manager used at the time by IBM Professional Services.  \nI garnered multiple OA's (Outstanding Achievement) awards during my IBM career  \nAs a manager at IBM, I was picked as the top manager in my group on 3 out of 4 employee opinion surveys.  \nAs a college student, I graduated Cum Laude despite working an average of well over 40 hours a week as a test technician at IBM.  \nI have a strong understanding of materials and do well with mechanical and construction projects. \n \nMy goal is to connect with a company where I can utilize my project management and people skills. Highlights of a career of accomplishments in diverse Software Engineering Leadership:  \n \nI have managed people and projects for over 10 years. I have worked very successfully from my home office, at customer sites, or in a corporate office setting.  \nBefore working as a department and project manager, I was a Senior Programmer at IBM and creator of multiple test automation tools. I also was a key contributor to the contract Proposal Manager used at the time by IBM Professional Services.  \nI garnered multiple OA's (Outstanding Achievement) awards during my IBM career  \nAs a manager at IBM, I was picked as the top manager in my group on 3 out of 4 employee opinion surveys.  \nAs a college student, I graduated Cum Laude despite working an average of well over 40 hours a week as a test technician at IBM.  \nI have a strong understanding of materials and do well with mechanical and construction projects. \n \nMy goal is to connect with a company where I can utilize my project management and people skills. Highlights of a career of accomplishments in diverse Software Engineering Leadership:  \n \nI have managed people and projects for over 10 years. I have worked very successfully from my home office, at customer sites, or in a corporate office setting.  \nBefore working as a department and project manager, I was a Senior Programmer at IBM and creator of multiple test automation tools. I also was a key contributor to the contract Proposal Manager used at the time by IBM Professional Services.  \nI garnered multiple OA's (Outstanding Achievement) awards during my IBM career  \nAs a manager at IBM, I was picked as the top manager in my group on 3 out of 4 employee opinion surveys.  \nAs a college student, I graduated Cum Laude despite working an average of well over 40 hours a week as a test technician at IBM.  \nI have a strong understanding of materials and do well with mechanical and construction projects. \n \nMy goal is to connect with a company where I can utilize my project management and people skills. Experience Project manager and software consultant CONSULTANT INDEPENDANT April 2014  – Present (1 year 5 months) Greater Portland area Senior QA Engineer CA Technologies January 2006  –  March 2014  (8 years 3 months) Software consultant at HP, Cypress Semiconductors, Sutmyn Consultant September 1993  –  June 2005  (11 years 10 months) Senior Programmer IBM May 1989  –  June 1993  (4 years 2 months) Project manager and software consultant CONSULTANT INDEPENDANT April 2014  – Present (1 year 5 months) Greater Portland area Project manager and software consultant CONSULTANT INDEPENDANT April 2014  – Present (1 year 5 months) Greater Portland area Senior QA Engineer CA Technologies January 2006  –  March 2014  (8 years 3 months) Senior QA Engineer CA Technologies January 2006  –  March 2014  (8 years 3 months) Software consultant at HP, Cypress Semiconductors, Sutmyn Consultant September 1993  –  June 2005  (11 years 10 months) Software consultant at HP, Cypress Semiconductors, Sutmyn Consultant September 1993  –  June 2005  (11 years 10 months) Senior Programmer IBM May 1989  –  June 1993  (4 years 2 months) Senior Programmer IBM May 1989  –  June 1993  (4 years 2 months) Skills Enterprise Software Software Design Test Automation Software Project... Skills  Enterprise Software Software Design Test Automation Software Project... Enterprise Software Software Design Test Automation Software Project... Enterprise Software Software Design Test Automation Software Project... Education San Jose State University BS in Business Administration , Management and Operations San Jose State University BS in Business Administration , Management and Operations San Jose State University BS in Business Administration , Management and Operations San Jose State University BS in Business Administration , Management and Operations "]}