{"position": "Senior Layout Engineer", "company": "Intel Corporation", "profiles": ["Experience Sr. Layout Engineer Sony Electronics Inc. September 2012  – Present (3 years) Raanana Israel Worked As a Senior Layout Engineer ~20 years at Intel corp. Than Pixim company and now At Sony. Sr. Layout Engineer Pixim Inc. June 2011  –  August 2012  (1 year 3 months) Ra'anana Analog Layout Engineer Advasense May 2005  –  May 2011  (6 years 1 month) Ra'anana Sr. Layout engineer Worked at several Companies as a freelance. August 2003  –  May 2005  (1 year 10 months) Senior Layout Engineer Intel Corporation April 1984  –  August 2003  (19 years 5 months) Haifa ISRAEL Sr. Layout Engineer Sony Electronics Inc. September 2012  – Present (3 years) Raanana Israel Worked As a Senior Layout Engineer ~20 years at Intel corp. Than Pixim company and now At Sony. Sr. Layout Engineer Sony Electronics Inc. September 2012  – Present (3 years) Raanana Israel Worked As a Senior Layout Engineer ~20 years at Intel corp. Than Pixim company and now At Sony. Sr. Layout Engineer Pixim Inc. June 2011  –  August 2012  (1 year 3 months) Ra'anana Sr. Layout Engineer Pixim Inc. June 2011  –  August 2012  (1 year 3 months) Ra'anana Analog Layout Engineer Advasense May 2005  –  May 2011  (6 years 1 month) Ra'anana Analog Layout Engineer Advasense May 2005  –  May 2011  (6 years 1 month) Ra'anana Sr. Layout engineer Worked at several Companies as a freelance. August 2003  –  May 2005  (1 year 10 months) Sr. Layout engineer Worked at several Companies as a freelance. August 2003  –  May 2005  (1 year 10 months) Senior Layout Engineer Intel Corporation April 1984  –  August 2003  (19 years 5 months) Haifa ISRAEL Senior Layout Engineer Intel Corporation April 1984  –  August 2003  (19 years 5 months) Haifa ISRAEL Skills Very Experienced... Skills  Very Experienced... Very Experienced... Very Experienced... ", "Experience CAD Manager Lattice Semiconductor Hardware Engineer Canon Information Technology Inc January 2010  –  February 2012  (2 years 2 months) Senior Layout Engineer Numonyx May 2008  –  June 2009  (1 year 2 months) Senior Layout Engineer Intel Corporation November 2003  –  April 2008  (4 years 6 months) CAD Manager Lattice Semiconductor CAD Manager Lattice Semiconductor Hardware Engineer Canon Information Technology Inc January 2010  –  February 2012  (2 years 2 months) Hardware Engineer Canon Information Technology Inc January 2010  –  February 2012  (2 years 2 months) Senior Layout Engineer Numonyx May 2008  –  June 2009  (1 year 2 months) Senior Layout Engineer Numonyx May 2008  –  June 2009  (1 year 2 months) Senior Layout Engineer Intel Corporation November 2003  –  April 2008  (4 years 6 months) Senior Layout Engineer Intel Corporation November 2003  –  April 2008  (4 years 6 months) Skills EDA Perl Skills  EDA Perl EDA Perl EDA Perl Education University of Santo Tomas Bachelor of Science in Electronics and Communications Engineering,  Electrical , Electronics and Communications Engineering 1998  – 2003 University of Santo Tomas Bachelor of Science in Electronics and Communications Engineering,  Electrical , Electronics and Communications Engineering 1998  – 2003 University of Santo Tomas Bachelor of Science in Electronics and Communications Engineering,  Electrical , Electronics and Communications Engineering 1998  – 2003 University of Santo Tomas Bachelor of Science in Electronics and Communications Engineering,  Electrical , Electronics and Communications Engineering 1998  – 2003 ", "Summary OBJECTIVE \nSeeking for challenging position in the field of electrical RF/analog and Mixed signal layout engineer or Physical design. \n \nSpecialties: Cadence virtuoso XL, art, LVS & DRC calibre debug, Power management, Memory, SERDES, ADC, PLL layout. EM/ IR drop analysis and calculation, cadence tool, RF/ Analog layout. Summary OBJECTIVE \nSeeking for challenging position in the field of electrical RF/analog and Mixed signal layout engineer or Physical design. \n \nSpecialties: Cadence virtuoso XL, art, LVS & DRC calibre debug, Power management, Memory, SERDES, ADC, PLL layout. EM/ IR drop analysis and calculation, cadence tool, RF/ Analog layout. OBJECTIVE \nSeeking for challenging position in the field of electrical RF/analog and Mixed signal layout engineer or Physical design. \n \nSpecialties: Cadence virtuoso XL, art, LVS & DRC calibre debug, Power management, Memory, SERDES, ADC, PLL layout. EM/ IR drop analysis and calculation, cadence tool, RF/ Analog layout. OBJECTIVE \nSeeking for challenging position in the field of electrical RF/analog and Mixed signal layout engineer or Physical design. \n \nSpecialties: Cadence virtuoso XL, art, LVS & DRC calibre debug, Power management, Memory, SERDES, ADC, PLL layout. EM/ IR drop analysis and calculation, cadence tool, RF/ Analog layout. Experience Sr Layout design. Keyssa October 2014  – Present (11 months) Portland, Oregon Area \tSimilar use Virtuoso_XL, GXL. Layout analog RF in TSMC process. \n\tApply all skill and knowledge of RF analog to layout the best block circuits for the team \no\tCalculate metal resistance and current density \no\tCheck LVS, DRC, antenna, latchup, XOR comparision, EM extracted annotate. \n\tLayout RF/analog circuits in TSMC as DIV, linear amplifier, LDO, LNA, Mixers, ESD, diferential amplifier, regulator, reference voltage, Logic decoders in wireless modem research design group. \n\tLaid out all blocks until all layout pass post layout simulation.. \n\tCheck and fix EM issues: check EM current goes through each node and IR drop in metal routing. \n\tRun, check and fix metal fill. Check density of metals, poly and RX.  \n\tOur chip layout will put in our company RF product as wireless interface connectivity from cell phone to laptop or cell phone to HD television. Sr RF/analog layout design Samsung Electronics January 2014  –  October 2014  (10 months) San Jose, CA Senior RF/analog lead layout Engineer \n\tSimilar use Virtuoso_XL, GXL. Layout analog RF in 28nm Samsung process. \n\tApply all skill and knowledge of RF analog to layout the best block circuits for the team \no\tCalculate metal resistance and current density \no\tCheck LVS, DRC, antenna, latchup, XOR comparision, EM extracted annotate. \n\tFamiliar with multiple CMOS technologies: TSMC 28, 45, 65, 90nm; Global Foundrier 28nm; UMC 0.18; Intel 14nm, 20nm; Samsung 28nm; IBM BiCMOS 40nm. \n\tLayout RF/analog circuits in 28nm Samsung as LDO, LNA, Mixers, ESD, diferential amplifier, regulator, reference voltage, Logic decoders in wireless modem research design group. \n\tWorking in RF research group. Using VCP and VCR placed and route tool to layout quickly hug digital block as decoders, slave signal control. \n\tCheck and fix EM issues: check EM current goes through each node and IR drop in metal routing. \n\tRun, check and fix metal fill. Check density of metals, poly and RX. Take care Low band, Midband, High band and top level chip. Senior mask layout design Kool Chip Inc April 2013  –  June 2014  (1 year 3 months) San Jose, CA _Layout analog macro DDR and SerDes in 28nm TSMC and Global Foundry. \n_Design layout inductors for new process 28nm Global Foundry. \n_Analysic IR drop in circuits and fix. \n_Check DRC, lvs, antenna, latchup for analog block circuits. \n_Build layout standard cells in 28nm TSMC and Global Foundry. \n_Build manual inductor and Fix density. \n_EM analysis and fix EM issues. Senior layout engineer Intel Corporation November 2011  –  March 2013  (1 year 5 months) Hillsboro, OR -\tSimilar use Virtuoso_XL, VCR (Virtuoso assembly chip router) play and route tools \n-\tApply all skill and knowledge of analog and digital IC design to layout the best block circuit for the team \no\tCalculate metal resistance and current density \no\tCheck LVS, DRC, Soft check, antenna, latchup, XOR comparision, RC extracted annotate. \n-\tFamiliar with multiple CMOS technologies: Intel 22nm, 14nm; TSMC 28, 45, 65, 90nm, 0.13um, 0.15um & 90nm; UMC 0.18 and 0.15 um, IBM BiCMOS 45nm. \n-\tLayout RF/analog circuits in 28nmTSMC as LNA, PLL, bandgap, charge pump, diferential amplifier, regulator, reference voltage, ADC, and power amplifier 2.4Ghz in wireless design group. Analyse RVE drop, calculate current density and resistance for circuits. \n-\tWorking in foundry group. Layout analog circuits using 14nm and 22nm Intel process: IO, DDL, DDR, bandgap, VCO... Layout design engineer, senior. Semtech April 2011  –  February 2012  (11 months) Irvine, CA. •\tUsing BiCMOS Sige IBM process 45nm to layout chip from 20-60Ghz SERDES, TX/RX Mux Demux. \n•\tSimilar use Virtuoso_XL, VCR (Virtuoso assembly chip router) and CSR play and route tools. \n•\tApply all skill and knowledge of analog and digital IC design to layout the best block circuit for the team. Calculate metal resistance for power supply in 65nm. Layout RF LNA (Low noise amplifier)  \n•\tFamiliar with multiple CMOS technologies: TSMC 28, 45, 65, 90nm, 0.13um, 0.15um & 90nm; UMC 0.18 and 0.15 um, Bipolar sige.  \n•\tLayout RF/analog circuits in 65nm TSMC as LNA, PLL, bandgap, charge pump, diferential amplifier, regulator, reference voltage. \n•\tCheck and debug Lvs, Drc, ERC, latchup, antenna, soft check, and tapout checklist. Understand Design for manufature rule (DFM). Check and run density metal and dummy metal fill, MRAM dummy fill, via insertion, redundant genration. Using probe tool to probe and check signals and power improvement. Senior Layout design engineer Qualcomm January 2010  –  December 2010  (1 year) \tLead layout of high-speed MRAM chips with digtal and Analog circuits. Using TSMC 28nm, 45nm and 65nm process to layout the MRAM test chips. \n\tWork in processing group to make test chip for 28nm TSMC \no\tMake modules test cases in schematic and layout for all perform and reliability in 28nm process \n\tSimilar use Virtuoso_XL, VCR (Virtuoso assembly chip router) and CSR play and route tools \n\tApply all skill and knowledge of analog and digital IC design to layout the best block circuit for the team \no\tCalculate metal resistance for power supply in ring Oscilator in 45nm \no\tLayout high band RF LNA (Low noise amplifier)  \n\tFamiliar with multiple CMOS technologies: TSMC 28, 45, 65, 90nm, 0.13um, 0.15um & 90nm; UMC 0.18 and 0.15 um, Bipolar sige \n\tLayout RF/analog circuits in 65nmTSMC as LNA, PLL, bandgap, charge pump, diferential amplifier, regulator, reference voltage, bitcell array. \n\tLead tapout memory test chip MRAM 45nm TSMC 4mmx4mm \no\tCheck and debug Lvs, Drc, ERC, latchup, antenna, soft check, and tapout checklist \no\tUnderstand Design for manufature rule (DFM) \no\tCheck and run density metal and dummy metal fill, MRAM dummy fill, via insertion, redundant generation \no\tUsing probe tool to probe and check signals and power improvement Layout/Design engineer National Semiconductor September 2007  –  November 2009  (2 years 3 months) Working in IC Power management group in National Semiconductor Corp. Layout of high speed chips with digtal and Analog circuits. Using 0.5 um CMOS7P technology to fab the IC chips. Working in portable power management DC/DC converter Buck Boost, LDO. Involve layout and tape out many product chips. These producs have huge budget to customer as Nokia, Rim, Apple, and Fujitsu. \nHelp package group in Santa Clara of NSC design many new test chips as Cu RDL package. Check and design top die following assembly rule as Seal ring, Draw street, Bump pads, Prob pads, Shield ring. \nApply all skill and knowledge of analog and digital IC design to layout the best block circuit for the team. High performer, high current density and low resistance. Calculate metal resistance in Buck boost DCDC converter chips. Run extracted R, C and RC to simulate directory on Back annotate on spectre simulation tool. \nHelp the design engineer research and develop snake bent transistor which save area and meet transistor size for big current desire in PowerMos Buck boost switchers. Using Spice and MathCAD to simulate worst case of power transistor resistance. \nFamiliar with multiple CMOS technologies: TSMC 90nm, 0.13um, 0.15um & 90nm; UMC 0.18 and 0.15 um, Bipolar sige, CMC 0.18um. BiCMOS 0.5um (CMOS7P in NSC) \nBuild up library and layout custom cells for IO and Analog Circuit as: PWL, Comparator, power switches, DAC, Opamp, Voltage reference, Bias current, Error_amp, Bandgap, Oscilator and complete whole chips. \nUsing Assura tools to run and debug LVS, DRC, Softcheck, Antenna, and LVL compare. \nWork in the lab to test for DC-DC converter. Check functions of the chip. Test efficiency of Buck boost DCDC converters as load and linear efficiency. \nAutomated play and route all big digital circuits with save time. Use layout Virtuoso_XL tool to modify and identify all block of circuits. Layout/design engineer Spectra Linear June 2006  –  September 2007  (1 year 4 months) San Jose (Sold to Silicon Lab) Layout of high speed chips with digtal and Analog circuits. Using Chartered Manufacturing technology to fab the IC chips. \nApply all skill and knowledge of analog and digital IC design to layout the best block circuit for the team. \nHelp the design engineer debug errors or problem in Pcell or transistor model to clean DRC and LVS for the chip. Familiar with multiple CMOS technologies: TSMC 90nm, 0.13um, 0.15um & 90nm; UMC 0.18 and 0.15 um, Bipolar sige, CMC 0.18um.  \nBuild up library and layout custom cells for IO and Analog Circuit as: D-flipflops, Mux, Dmux, And, NAND, OR, XOR, XNOR, INV, buffer 2,4,6,8. Regulator, VCO, Bandgap, XCristal circuit, VSS /VDD IO, programable 1 to 10 divider; Using Assura tools to run LVS and DRC.  \nHelp the team tapout PC clock. Check and debug latchup, antenna, soft check, DRC for the chips. Layout/design engineer Kawasaki Microelectronics June 2004  –  May 2006  (2 years) San Jose, CA Layout of high speed chips with minimum area and symmetry, Power line and Guard ring layout to take care of latch up, performed DRC, LVS, stream in/out of all custom cells. Familiar with multiple CMOS technologies: TSMC 90nm, 0.13um, 0.15um & 90nm; UMC 0.18 and 0.15 um, Bipolar sige.  \nBuild up library and layout custom cells for Data Recovery Circuit as: D-flipflops, Mux, Dmux, And, NAND, OR, XOR, XNOR, INV, buffer 2,4,6,8... Using Calibre and Columbus tools to run netlist and simulate layout RF extracted circuits.  \nLayout analog circuits as Differential Amplifier Receiver, HDMI, VCO and PLL. Guarantee all circuits are symmetrical, compact size as expect and meet schematic specification. Also performed DRC and LVS in Calibre. \nLayout of Divide by 3, 4, 5, 6, 7, 8, 9 and 10 with 50% duty circle @ 1.25Ghz NSPS, 125C, 0.18um CMOS \nLayout Bus reference Clock which drives Data recovery clock. The bus can speed 1.25 Ghz in worstcase NSPS 125C, 0.13um CMOS. The bus diliver clock to many DRCs at diferrent location but still keep the same rise and falling time for all DRCs. \nLayout SDMUX. The SDMUX speeds 2.5 Ghz in worst case NSPS 0.13um CMOS technology. The slew rate is smaller 10ps. This chip is used to driver differential state of I/O.  \nConvert whole circuits of chip from other technology to dfII Cadence design environtment. Convert complete SerDes 100nm TSMC. \nMake lef files for all layout cells and module test chips. Lef file helps protect the layout reducing DRC and LVS errors in place and routing automatically.  \nResearch the LOD effect in mutiple fingers transistor in 90nm CMOS. LOD effect will reduce mismatch between schematic and actual layout transistors. \nLayout CEI_LD IO driver 6Ghz in 90nm TSMC. Pay attention on marching, LOD effect and noise issues Mask Layout/verification engineer Free Electron Technology Inc December 2000  –  December 2003  (3 years 1 month) Brewster, NY Layout high speed analog 10Gb speed chips with minimum in area and power consumption, performed DRC, LVS, stream in/out - familiar with multiple technologies: CMOS, BiCMOS, Bipolar Sige. Perform the circuit checking device evaluation and characterization of process design kits. Ability to read schematic and signal to test and trouble shoot.  \nTransceiver: XL_layout to layout 10Ghz transceiver chip. Help design engineers layout and design some parts of lock detect, D_flip flop, counters, latch master/slave, VCO, PLL, oscillator, Clock & Data Recovery (CDR), MUX 16:1 and DMUX 1:16. \nLimiting amplifier: Layout of 10GHz chip, help design team stream in/out and tape out this chip. I also laid out differential current pair, emitter follower with different required current. \nLaser dirver: using layout a 10GHz and 40 GHz chip, help design team stream in/out and tape out this chip. Laid out all standard cells such as predriver, input buffer, output buffer, Imod, bandgap reference, Transconductor and latch master/slave. \nQuad laser driver. using Bipolar sige technology to layout 10 Ghz. Each single channel drives 5mA to 30mA with supply voltage 3-5.2V. Laid out cell as Master/slave latch 16 bits, aperture control, Ibias control, Imod, predriver, input buffer, out put buffer and counter. Electrical Engineer internship Cadence Design Systems June 2000  –  September 2000  (4 months) San Jose, CA Test and simulate all mixed signal circuits in Reaseach and Development group. Tested netlist and simulated the circuit in Cadence layout tool 4.4.6 versions. Worked with group of beta testers at Berkeley to validate tools. Convert designed circuits to Cadence design tools. Electronic Technician Mackie design System Inc June 1997  –  September 1997  (4 months) Test and troubleshoot Mixer 16:4 and 12:2 and amplifier. Ability reading schematic and  \nsignal. Understand testing manual and using oscilloscope to check output signal. Repair  \nboard, replace bad components and complete products. Sr Layout design. Keyssa October 2014  – Present (11 months) Portland, Oregon Area \tSimilar use Virtuoso_XL, GXL. Layout analog RF in TSMC process. \n\tApply all skill and knowledge of RF analog to layout the best block circuits for the team \no\tCalculate metal resistance and current density \no\tCheck LVS, DRC, antenna, latchup, XOR comparision, EM extracted annotate. \n\tLayout RF/analog circuits in TSMC as DIV, linear amplifier, LDO, LNA, Mixers, ESD, diferential amplifier, regulator, reference voltage, Logic decoders in wireless modem research design group. \n\tLaid out all blocks until all layout pass post layout simulation.. \n\tCheck and fix EM issues: check EM current goes through each node and IR drop in metal routing. \n\tRun, check and fix metal fill. Check density of metals, poly and RX.  \n\tOur chip layout will put in our company RF product as wireless interface connectivity from cell phone to laptop or cell phone to HD television. Sr Layout design. Keyssa October 2014  – Present (11 months) Portland, Oregon Area \tSimilar use Virtuoso_XL, GXL. Layout analog RF in TSMC process. \n\tApply all skill and knowledge of RF analog to layout the best block circuits for the team \no\tCalculate metal resistance and current density \no\tCheck LVS, DRC, antenna, latchup, XOR comparision, EM extracted annotate. \n\tLayout RF/analog circuits in TSMC as DIV, linear amplifier, LDO, LNA, Mixers, ESD, diferential amplifier, regulator, reference voltage, Logic decoders in wireless modem research design group. \n\tLaid out all blocks until all layout pass post layout simulation.. \n\tCheck and fix EM issues: check EM current goes through each node and IR drop in metal routing. \n\tRun, check and fix metal fill. Check density of metals, poly and RX.  \n\tOur chip layout will put in our company RF product as wireless interface connectivity from cell phone to laptop or cell phone to HD television. Sr RF/analog layout design Samsung Electronics January 2014  –  October 2014  (10 months) San Jose, CA Senior RF/analog lead layout Engineer \n\tSimilar use Virtuoso_XL, GXL. Layout analog RF in 28nm Samsung process. \n\tApply all skill and knowledge of RF analog to layout the best block circuits for the team \no\tCalculate metal resistance and current density \no\tCheck LVS, DRC, antenna, latchup, XOR comparision, EM extracted annotate. \n\tFamiliar with multiple CMOS technologies: TSMC 28, 45, 65, 90nm; Global Foundrier 28nm; UMC 0.18; Intel 14nm, 20nm; Samsung 28nm; IBM BiCMOS 40nm. \n\tLayout RF/analog circuits in 28nm Samsung as LDO, LNA, Mixers, ESD, diferential amplifier, regulator, reference voltage, Logic decoders in wireless modem research design group. \n\tWorking in RF research group. Using VCP and VCR placed and route tool to layout quickly hug digital block as decoders, slave signal control. \n\tCheck and fix EM issues: check EM current goes through each node and IR drop in metal routing. \n\tRun, check and fix metal fill. Check density of metals, poly and RX. Take care Low band, Midband, High band and top level chip. Sr RF/analog layout design Samsung Electronics January 2014  –  October 2014  (10 months) San Jose, CA Senior RF/analog lead layout Engineer \n\tSimilar use Virtuoso_XL, GXL. Layout analog RF in 28nm Samsung process. \n\tApply all skill and knowledge of RF analog to layout the best block circuits for the team \no\tCalculate metal resistance and current density \no\tCheck LVS, DRC, antenna, latchup, XOR comparision, EM extracted annotate. \n\tFamiliar with multiple CMOS technologies: TSMC 28, 45, 65, 90nm; Global Foundrier 28nm; UMC 0.18; Intel 14nm, 20nm; Samsung 28nm; IBM BiCMOS 40nm. \n\tLayout RF/analog circuits in 28nm Samsung as LDO, LNA, Mixers, ESD, diferential amplifier, regulator, reference voltage, Logic decoders in wireless modem research design group. \n\tWorking in RF research group. Using VCP and VCR placed and route tool to layout quickly hug digital block as decoders, slave signal control. \n\tCheck and fix EM issues: check EM current goes through each node and IR drop in metal routing. \n\tRun, check and fix metal fill. Check density of metals, poly and RX. Take care Low band, Midband, High band and top level chip. Senior mask layout design Kool Chip Inc April 2013  –  June 2014  (1 year 3 months) San Jose, CA _Layout analog macro DDR and SerDes in 28nm TSMC and Global Foundry. \n_Design layout inductors for new process 28nm Global Foundry. \n_Analysic IR drop in circuits and fix. \n_Check DRC, lvs, antenna, latchup for analog block circuits. \n_Build layout standard cells in 28nm TSMC and Global Foundry. \n_Build manual inductor and Fix density. \n_EM analysis and fix EM issues. Senior mask layout design Kool Chip Inc April 2013  –  June 2014  (1 year 3 months) San Jose, CA _Layout analog macro DDR and SerDes in 28nm TSMC and Global Foundry. \n_Design layout inductors for new process 28nm Global Foundry. \n_Analysic IR drop in circuits and fix. \n_Check DRC, lvs, antenna, latchup for analog block circuits. \n_Build layout standard cells in 28nm TSMC and Global Foundry. \n_Build manual inductor and Fix density. \n_EM analysis and fix EM issues. Senior layout engineer Intel Corporation November 2011  –  March 2013  (1 year 5 months) Hillsboro, OR -\tSimilar use Virtuoso_XL, VCR (Virtuoso assembly chip router) play and route tools \n-\tApply all skill and knowledge of analog and digital IC design to layout the best block circuit for the team \no\tCalculate metal resistance and current density \no\tCheck LVS, DRC, Soft check, antenna, latchup, XOR comparision, RC extracted annotate. \n-\tFamiliar with multiple CMOS technologies: Intel 22nm, 14nm; TSMC 28, 45, 65, 90nm, 0.13um, 0.15um & 90nm; UMC 0.18 and 0.15 um, IBM BiCMOS 45nm. \n-\tLayout RF/analog circuits in 28nmTSMC as LNA, PLL, bandgap, charge pump, diferential amplifier, regulator, reference voltage, ADC, and power amplifier 2.4Ghz in wireless design group. Analyse RVE drop, calculate current density and resistance for circuits. \n-\tWorking in foundry group. Layout analog circuits using 14nm and 22nm Intel process: IO, DDL, DDR, bandgap, VCO... Senior layout engineer Intel Corporation November 2011  –  March 2013  (1 year 5 months) Hillsboro, OR -\tSimilar use Virtuoso_XL, VCR (Virtuoso assembly chip router) play and route tools \n-\tApply all skill and knowledge of analog and digital IC design to layout the best block circuit for the team \no\tCalculate metal resistance and current density \no\tCheck LVS, DRC, Soft check, antenna, latchup, XOR comparision, RC extracted annotate. \n-\tFamiliar with multiple CMOS technologies: Intel 22nm, 14nm; TSMC 28, 45, 65, 90nm, 0.13um, 0.15um & 90nm; UMC 0.18 and 0.15 um, IBM BiCMOS 45nm. \n-\tLayout RF/analog circuits in 28nmTSMC as LNA, PLL, bandgap, charge pump, diferential amplifier, regulator, reference voltage, ADC, and power amplifier 2.4Ghz in wireless design group. Analyse RVE drop, calculate current density and resistance for circuits. \n-\tWorking in foundry group. Layout analog circuits using 14nm and 22nm Intel process: IO, DDL, DDR, bandgap, VCO... Layout design engineer, senior. Semtech April 2011  –  February 2012  (11 months) Irvine, CA. •\tUsing BiCMOS Sige IBM process 45nm to layout chip from 20-60Ghz SERDES, TX/RX Mux Demux. \n•\tSimilar use Virtuoso_XL, VCR (Virtuoso assembly chip router) and CSR play and route tools. \n•\tApply all skill and knowledge of analog and digital IC design to layout the best block circuit for the team. Calculate metal resistance for power supply in 65nm. Layout RF LNA (Low noise amplifier)  \n•\tFamiliar with multiple CMOS technologies: TSMC 28, 45, 65, 90nm, 0.13um, 0.15um & 90nm; UMC 0.18 and 0.15 um, Bipolar sige.  \n•\tLayout RF/analog circuits in 65nm TSMC as LNA, PLL, bandgap, charge pump, diferential amplifier, regulator, reference voltage. \n•\tCheck and debug Lvs, Drc, ERC, latchup, antenna, soft check, and tapout checklist. Understand Design for manufature rule (DFM). Check and run density metal and dummy metal fill, MRAM dummy fill, via insertion, redundant genration. Using probe tool to probe and check signals and power improvement. Layout design engineer, senior. Semtech April 2011  –  February 2012  (11 months) Irvine, CA. •\tUsing BiCMOS Sige IBM process 45nm to layout chip from 20-60Ghz SERDES, TX/RX Mux Demux. \n•\tSimilar use Virtuoso_XL, VCR (Virtuoso assembly chip router) and CSR play and route tools. \n•\tApply all skill and knowledge of analog and digital IC design to layout the best block circuit for the team. Calculate metal resistance for power supply in 65nm. Layout RF LNA (Low noise amplifier)  \n•\tFamiliar with multiple CMOS technologies: TSMC 28, 45, 65, 90nm, 0.13um, 0.15um & 90nm; UMC 0.18 and 0.15 um, Bipolar sige.  \n•\tLayout RF/analog circuits in 65nm TSMC as LNA, PLL, bandgap, charge pump, diferential amplifier, regulator, reference voltage. \n•\tCheck and debug Lvs, Drc, ERC, latchup, antenna, soft check, and tapout checklist. Understand Design for manufature rule (DFM). Check and run density metal and dummy metal fill, MRAM dummy fill, via insertion, redundant genration. Using probe tool to probe and check signals and power improvement. Senior Layout design engineer Qualcomm January 2010  –  December 2010  (1 year) \tLead layout of high-speed MRAM chips with digtal and Analog circuits. Using TSMC 28nm, 45nm and 65nm process to layout the MRAM test chips. \n\tWork in processing group to make test chip for 28nm TSMC \no\tMake modules test cases in schematic and layout for all perform and reliability in 28nm process \n\tSimilar use Virtuoso_XL, VCR (Virtuoso assembly chip router) and CSR play and route tools \n\tApply all skill and knowledge of analog and digital IC design to layout the best block circuit for the team \no\tCalculate metal resistance for power supply in ring Oscilator in 45nm \no\tLayout high band RF LNA (Low noise amplifier)  \n\tFamiliar with multiple CMOS technologies: TSMC 28, 45, 65, 90nm, 0.13um, 0.15um & 90nm; UMC 0.18 and 0.15 um, Bipolar sige \n\tLayout RF/analog circuits in 65nmTSMC as LNA, PLL, bandgap, charge pump, diferential amplifier, regulator, reference voltage, bitcell array. \n\tLead tapout memory test chip MRAM 45nm TSMC 4mmx4mm \no\tCheck and debug Lvs, Drc, ERC, latchup, antenna, soft check, and tapout checklist \no\tUnderstand Design for manufature rule (DFM) \no\tCheck and run density metal and dummy metal fill, MRAM dummy fill, via insertion, redundant generation \no\tUsing probe tool to probe and check signals and power improvement Senior Layout design engineer Qualcomm January 2010  –  December 2010  (1 year) \tLead layout of high-speed MRAM chips with digtal and Analog circuits. Using TSMC 28nm, 45nm and 65nm process to layout the MRAM test chips. \n\tWork in processing group to make test chip for 28nm TSMC \no\tMake modules test cases in schematic and layout for all perform and reliability in 28nm process \n\tSimilar use Virtuoso_XL, VCR (Virtuoso assembly chip router) and CSR play and route tools \n\tApply all skill and knowledge of analog and digital IC design to layout the best block circuit for the team \no\tCalculate metal resistance for power supply in ring Oscilator in 45nm \no\tLayout high band RF LNA (Low noise amplifier)  \n\tFamiliar with multiple CMOS technologies: TSMC 28, 45, 65, 90nm, 0.13um, 0.15um & 90nm; UMC 0.18 and 0.15 um, Bipolar sige \n\tLayout RF/analog circuits in 65nmTSMC as LNA, PLL, bandgap, charge pump, diferential amplifier, regulator, reference voltage, bitcell array. \n\tLead tapout memory test chip MRAM 45nm TSMC 4mmx4mm \no\tCheck and debug Lvs, Drc, ERC, latchup, antenna, soft check, and tapout checklist \no\tUnderstand Design for manufature rule (DFM) \no\tCheck and run density metal and dummy metal fill, MRAM dummy fill, via insertion, redundant generation \no\tUsing probe tool to probe and check signals and power improvement Layout/Design engineer National Semiconductor September 2007  –  November 2009  (2 years 3 months) Working in IC Power management group in National Semiconductor Corp. Layout of high speed chips with digtal and Analog circuits. Using 0.5 um CMOS7P technology to fab the IC chips. Working in portable power management DC/DC converter Buck Boost, LDO. Involve layout and tape out many product chips. These producs have huge budget to customer as Nokia, Rim, Apple, and Fujitsu. \nHelp package group in Santa Clara of NSC design many new test chips as Cu RDL package. Check and design top die following assembly rule as Seal ring, Draw street, Bump pads, Prob pads, Shield ring. \nApply all skill and knowledge of analog and digital IC design to layout the best block circuit for the team. High performer, high current density and low resistance. Calculate metal resistance in Buck boost DCDC converter chips. Run extracted R, C and RC to simulate directory on Back annotate on spectre simulation tool. \nHelp the design engineer research and develop snake bent transistor which save area and meet transistor size for big current desire in PowerMos Buck boost switchers. Using Spice and MathCAD to simulate worst case of power transistor resistance. \nFamiliar with multiple CMOS technologies: TSMC 90nm, 0.13um, 0.15um & 90nm; UMC 0.18 and 0.15 um, Bipolar sige, CMC 0.18um. BiCMOS 0.5um (CMOS7P in NSC) \nBuild up library and layout custom cells for IO and Analog Circuit as: PWL, Comparator, power switches, DAC, Opamp, Voltage reference, Bias current, Error_amp, Bandgap, Oscilator and complete whole chips. \nUsing Assura tools to run and debug LVS, DRC, Softcheck, Antenna, and LVL compare. \nWork in the lab to test for DC-DC converter. Check functions of the chip. Test efficiency of Buck boost DCDC converters as load and linear efficiency. \nAutomated play and route all big digital circuits with save time. Use layout Virtuoso_XL tool to modify and identify all block of circuits. Layout/Design engineer National Semiconductor September 2007  –  November 2009  (2 years 3 months) Working in IC Power management group in National Semiconductor Corp. Layout of high speed chips with digtal and Analog circuits. Using 0.5 um CMOS7P technology to fab the IC chips. Working in portable power management DC/DC converter Buck Boost, LDO. Involve layout and tape out many product chips. These producs have huge budget to customer as Nokia, Rim, Apple, and Fujitsu. \nHelp package group in Santa Clara of NSC design many new test chips as Cu RDL package. Check and design top die following assembly rule as Seal ring, Draw street, Bump pads, Prob pads, Shield ring. \nApply all skill and knowledge of analog and digital IC design to layout the best block circuit for the team. High performer, high current density and low resistance. Calculate metal resistance in Buck boost DCDC converter chips. Run extracted R, C and RC to simulate directory on Back annotate on spectre simulation tool. \nHelp the design engineer research and develop snake bent transistor which save area and meet transistor size for big current desire in PowerMos Buck boost switchers. Using Spice and MathCAD to simulate worst case of power transistor resistance. \nFamiliar with multiple CMOS technologies: TSMC 90nm, 0.13um, 0.15um & 90nm; UMC 0.18 and 0.15 um, Bipolar sige, CMC 0.18um. BiCMOS 0.5um (CMOS7P in NSC) \nBuild up library and layout custom cells for IO and Analog Circuit as: PWL, Comparator, power switches, DAC, Opamp, Voltage reference, Bias current, Error_amp, Bandgap, Oscilator and complete whole chips. \nUsing Assura tools to run and debug LVS, DRC, Softcheck, Antenna, and LVL compare. \nWork in the lab to test for DC-DC converter. Check functions of the chip. Test efficiency of Buck boost DCDC converters as load and linear efficiency. \nAutomated play and route all big digital circuits with save time. Use layout Virtuoso_XL tool to modify and identify all block of circuits. Layout/design engineer Spectra Linear June 2006  –  September 2007  (1 year 4 months) San Jose (Sold to Silicon Lab) Layout of high speed chips with digtal and Analog circuits. Using Chartered Manufacturing technology to fab the IC chips. \nApply all skill and knowledge of analog and digital IC design to layout the best block circuit for the team. \nHelp the design engineer debug errors or problem in Pcell or transistor model to clean DRC and LVS for the chip. Familiar with multiple CMOS technologies: TSMC 90nm, 0.13um, 0.15um & 90nm; UMC 0.18 and 0.15 um, Bipolar sige, CMC 0.18um.  \nBuild up library and layout custom cells for IO and Analog Circuit as: D-flipflops, Mux, Dmux, And, NAND, OR, XOR, XNOR, INV, buffer 2,4,6,8. Regulator, VCO, Bandgap, XCristal circuit, VSS /VDD IO, programable 1 to 10 divider; Using Assura tools to run LVS and DRC.  \nHelp the team tapout PC clock. Check and debug latchup, antenna, soft check, DRC for the chips. Layout/design engineer Spectra Linear June 2006  –  September 2007  (1 year 4 months) San Jose (Sold to Silicon Lab) Layout of high speed chips with digtal and Analog circuits. Using Chartered Manufacturing technology to fab the IC chips. \nApply all skill and knowledge of analog and digital IC design to layout the best block circuit for the team. \nHelp the design engineer debug errors or problem in Pcell or transistor model to clean DRC and LVS for the chip. Familiar with multiple CMOS technologies: TSMC 90nm, 0.13um, 0.15um & 90nm; UMC 0.18 and 0.15 um, Bipolar sige, CMC 0.18um.  \nBuild up library and layout custom cells for IO and Analog Circuit as: D-flipflops, Mux, Dmux, And, NAND, OR, XOR, XNOR, INV, buffer 2,4,6,8. Regulator, VCO, Bandgap, XCristal circuit, VSS /VDD IO, programable 1 to 10 divider; Using Assura tools to run LVS and DRC.  \nHelp the team tapout PC clock. Check and debug latchup, antenna, soft check, DRC for the chips. Layout/design engineer Kawasaki Microelectronics June 2004  –  May 2006  (2 years) San Jose, CA Layout of high speed chips with minimum area and symmetry, Power line and Guard ring layout to take care of latch up, performed DRC, LVS, stream in/out of all custom cells. Familiar with multiple CMOS technologies: TSMC 90nm, 0.13um, 0.15um & 90nm; UMC 0.18 and 0.15 um, Bipolar sige.  \nBuild up library and layout custom cells for Data Recovery Circuit as: D-flipflops, Mux, Dmux, And, NAND, OR, XOR, XNOR, INV, buffer 2,4,6,8... Using Calibre and Columbus tools to run netlist and simulate layout RF extracted circuits.  \nLayout analog circuits as Differential Amplifier Receiver, HDMI, VCO and PLL. Guarantee all circuits are symmetrical, compact size as expect and meet schematic specification. Also performed DRC and LVS in Calibre. \nLayout of Divide by 3, 4, 5, 6, 7, 8, 9 and 10 with 50% duty circle @ 1.25Ghz NSPS, 125C, 0.18um CMOS \nLayout Bus reference Clock which drives Data recovery clock. The bus can speed 1.25 Ghz in worstcase NSPS 125C, 0.13um CMOS. The bus diliver clock to many DRCs at diferrent location but still keep the same rise and falling time for all DRCs. \nLayout SDMUX. The SDMUX speeds 2.5 Ghz in worst case NSPS 0.13um CMOS technology. The slew rate is smaller 10ps. This chip is used to driver differential state of I/O.  \nConvert whole circuits of chip from other technology to dfII Cadence design environtment. Convert complete SerDes 100nm TSMC. \nMake lef files for all layout cells and module test chips. Lef file helps protect the layout reducing DRC and LVS errors in place and routing automatically.  \nResearch the LOD effect in mutiple fingers transistor in 90nm CMOS. LOD effect will reduce mismatch between schematic and actual layout transistors. \nLayout CEI_LD IO driver 6Ghz in 90nm TSMC. Pay attention on marching, LOD effect and noise issues Layout/design engineer Kawasaki Microelectronics June 2004  –  May 2006  (2 years) San Jose, CA Layout of high speed chips with minimum area and symmetry, Power line and Guard ring layout to take care of latch up, performed DRC, LVS, stream in/out of all custom cells. Familiar with multiple CMOS technologies: TSMC 90nm, 0.13um, 0.15um & 90nm; UMC 0.18 and 0.15 um, Bipolar sige.  \nBuild up library and layout custom cells for Data Recovery Circuit as: D-flipflops, Mux, Dmux, And, NAND, OR, XOR, XNOR, INV, buffer 2,4,6,8... Using Calibre and Columbus tools to run netlist and simulate layout RF extracted circuits.  \nLayout analog circuits as Differential Amplifier Receiver, HDMI, VCO and PLL. Guarantee all circuits are symmetrical, compact size as expect and meet schematic specification. Also performed DRC and LVS in Calibre. \nLayout of Divide by 3, 4, 5, 6, 7, 8, 9 and 10 with 50% duty circle @ 1.25Ghz NSPS, 125C, 0.18um CMOS \nLayout Bus reference Clock which drives Data recovery clock. The bus can speed 1.25 Ghz in worstcase NSPS 125C, 0.13um CMOS. The bus diliver clock to many DRCs at diferrent location but still keep the same rise and falling time for all DRCs. \nLayout SDMUX. The SDMUX speeds 2.5 Ghz in worst case NSPS 0.13um CMOS technology. The slew rate is smaller 10ps. This chip is used to driver differential state of I/O.  \nConvert whole circuits of chip from other technology to dfII Cadence design environtment. Convert complete SerDes 100nm TSMC. \nMake lef files for all layout cells and module test chips. Lef file helps protect the layout reducing DRC and LVS errors in place and routing automatically.  \nResearch the LOD effect in mutiple fingers transistor in 90nm CMOS. LOD effect will reduce mismatch between schematic and actual layout transistors. \nLayout CEI_LD IO driver 6Ghz in 90nm TSMC. Pay attention on marching, LOD effect and noise issues Mask Layout/verification engineer Free Electron Technology Inc December 2000  –  December 2003  (3 years 1 month) Brewster, NY Layout high speed analog 10Gb speed chips with minimum in area and power consumption, performed DRC, LVS, stream in/out - familiar with multiple technologies: CMOS, BiCMOS, Bipolar Sige. Perform the circuit checking device evaluation and characterization of process design kits. Ability to read schematic and signal to test and trouble shoot.  \nTransceiver: XL_layout to layout 10Ghz transceiver chip. Help design engineers layout and design some parts of lock detect, D_flip flop, counters, latch master/slave, VCO, PLL, oscillator, Clock & Data Recovery (CDR), MUX 16:1 and DMUX 1:16. \nLimiting amplifier: Layout of 10GHz chip, help design team stream in/out and tape out this chip. I also laid out differential current pair, emitter follower with different required current. \nLaser dirver: using layout a 10GHz and 40 GHz chip, help design team stream in/out and tape out this chip. Laid out all standard cells such as predriver, input buffer, output buffer, Imod, bandgap reference, Transconductor and latch master/slave. \nQuad laser driver. using Bipolar sige technology to layout 10 Ghz. Each single channel drives 5mA to 30mA with supply voltage 3-5.2V. Laid out cell as Master/slave latch 16 bits, aperture control, Ibias control, Imod, predriver, input buffer, out put buffer and counter. Mask Layout/verification engineer Free Electron Technology Inc December 2000  –  December 2003  (3 years 1 month) Brewster, NY Layout high speed analog 10Gb speed chips with minimum in area and power consumption, performed DRC, LVS, stream in/out - familiar with multiple technologies: CMOS, BiCMOS, Bipolar Sige. Perform the circuit checking device evaluation and characterization of process design kits. Ability to read schematic and signal to test and trouble shoot.  \nTransceiver: XL_layout to layout 10Ghz transceiver chip. Help design engineers layout and design some parts of lock detect, D_flip flop, counters, latch master/slave, VCO, PLL, oscillator, Clock & Data Recovery (CDR), MUX 16:1 and DMUX 1:16. \nLimiting amplifier: Layout of 10GHz chip, help design team stream in/out and tape out this chip. I also laid out differential current pair, emitter follower with different required current. \nLaser dirver: using layout a 10GHz and 40 GHz chip, help design team stream in/out and tape out this chip. Laid out all standard cells such as predriver, input buffer, output buffer, Imod, bandgap reference, Transconductor and latch master/slave. \nQuad laser driver. using Bipolar sige technology to layout 10 Ghz. Each single channel drives 5mA to 30mA with supply voltage 3-5.2V. Laid out cell as Master/slave latch 16 bits, aperture control, Ibias control, Imod, predriver, input buffer, out put buffer and counter. Electrical Engineer internship Cadence Design Systems June 2000  –  September 2000  (4 months) San Jose, CA Test and simulate all mixed signal circuits in Reaseach and Development group. Tested netlist and simulated the circuit in Cadence layout tool 4.4.6 versions. Worked with group of beta testers at Berkeley to validate tools. Convert designed circuits to Cadence design tools. Electrical Engineer internship Cadence Design Systems June 2000  –  September 2000  (4 months) San Jose, CA Test and simulate all mixed signal circuits in Reaseach and Development group. Tested netlist and simulated the circuit in Cadence layout tool 4.4.6 versions. Worked with group of beta testers at Berkeley to validate tools. Convert designed circuits to Cadence design tools. Electronic Technician Mackie design System Inc June 1997  –  September 1997  (4 months) Test and troubleshoot Mixer 16:4 and 12:2 and amplifier. Ability reading schematic and  \nsignal. Understand testing manual and using oscilloscope to check output signal. Repair  \nboard, replace bad components and complete products. Electronic Technician Mackie design System Inc June 1997  –  September 1997  (4 months) Test and troubleshoot Mixer 16:4 and 12:2 and amplifier. Ability reading schematic and  \nsignal. Understand testing manual and using oscilloscope to check output signal. Repair  \nboard, replace bad components and complete products. Languages Vietnamese Vietnamese Vietnamese Skills Cadence Simulations Verilog Oscilloscope Pspice Assembly Language Matlab C Unix C++ Linux Engineering Dc Windows MathCAD Analog Layout Logic design Mixed signal layout Placed and Route MRAM layout SerDes layout Power management DCDC... Standard cells layout Mixed Signal DRC Analog Circuit Logic Design See 12+     See less Skills  Cadence Simulations Verilog Oscilloscope Pspice Assembly Language Matlab C Unix C++ Linux Engineering Dc Windows MathCAD Analog Layout Logic design Mixed signal layout Placed and Route MRAM layout SerDes layout Power management DCDC... Standard cells layout Mixed Signal DRC Analog Circuit Logic Design See 12+     See less Cadence Simulations Verilog Oscilloscope Pspice Assembly Language Matlab C Unix C++ Linux Engineering Dc Windows MathCAD Analog Layout Logic design Mixed signal layout Placed and Route MRAM layout SerDes layout Power management DCDC... Standard cells layout Mixed Signal DRC Analog Circuit Logic Design See 12+     See less Cadence Simulations Verilog Oscilloscope Pspice Assembly Language Matlab C Unix C++ Linux Engineering Dc Windows MathCAD Analog Layout Logic design Mixed signal layout Placed and Route MRAM layout SerDes layout Power management DCDC... Standard cells layout Mixed Signal DRC Analog Circuit Logic Design See 12+     See less Education University of Washington BSEE,  Electrical engineer 1997  – 2000 Shoreline Community College AAS,  Science and Art 1994  – 1997 University of Washington BSEE,  Electrical engineer 1997  – 2000 University of Washington BSEE,  Electrical engineer 1997  – 2000 University of Washington BSEE,  Electrical engineer 1997  – 2000 Shoreline Community College AAS,  Science and Art 1994  – 1997 Shoreline Community College AAS,  Science and Art 1994  – 1997 Shoreline Community College AAS,  Science and Art 1994  – 1997 "]}