{"position": "Senior Manager", "company": "Intel Corporation", "profiles": ["Experience Senior Manager Public Sector Transformation June 2014  – Present (1 year 3 months) Technical Advisor responsible for Agriculture and Regional Public Sector Performance Management and Delivery system. Senior Manager Consultant January 2014  –  May 2014  (5 months) Technical Advisor responsible for installing performance management and delivery methodologies and capacitating the Public Sector. Span of responsibility covers Regional Administration and Social Sector (Education, Water) Owner/Operator Ikobayu Farms July 2009  –  2013  (4 years) Agriculture and aquaculture production, sales and trading. Designed gravity flow water delivery system, temperature equalization cachement and earth pond. Eco friendly operations using green manure and natural insecticide. Senior Manager Intel Corporation December 2001  –  May 2009  (7 years 6 months) Senior Manager Intel Corporation 1998  –  November 2001  (3 years) Senior Manager Intel Corporation April 1989  –  1998  (9 years) Senior Manager Public Sector Transformation June 2014  – Present (1 year 3 months) Technical Advisor responsible for Agriculture and Regional Public Sector Performance Management and Delivery system. Senior Manager Public Sector Transformation June 2014  – Present (1 year 3 months) Technical Advisor responsible for Agriculture and Regional Public Sector Performance Management and Delivery system. Senior Manager Consultant January 2014  –  May 2014  (5 months) Technical Advisor responsible for installing performance management and delivery methodologies and capacitating the Public Sector. Span of responsibility covers Regional Administration and Social Sector (Education, Water) Senior Manager Consultant January 2014  –  May 2014  (5 months) Technical Advisor responsible for installing performance management and delivery methodologies and capacitating the Public Sector. Span of responsibility covers Regional Administration and Social Sector (Education, Water) Owner/Operator Ikobayu Farms July 2009  –  2013  (4 years) Agriculture and aquaculture production, sales and trading. Designed gravity flow water delivery system, temperature equalization cachement and earth pond. Eco friendly operations using green manure and natural insecticide. Owner/Operator Ikobayu Farms July 2009  –  2013  (4 years) Agriculture and aquaculture production, sales and trading. Designed gravity flow water delivery system, temperature equalization cachement and earth pond. Eco friendly operations using green manure and natural insecticide. Senior Manager Intel Corporation December 2001  –  May 2009  (7 years 6 months) Senior Manager Intel Corporation December 2001  –  May 2009  (7 years 6 months) Senior Manager Intel Corporation 1998  –  November 2001  (3 years) Senior Manager Intel Corporation 1998  –  November 2001  (3 years) Senior Manager Intel Corporation April 1989  –  1998  (9 years) Senior Manager Intel Corporation April 1989  –  1998  (9 years) Skills Strategic Planning Performance Management Program Management Project Management Sales Process Improvement Strategy Start-ups Vendor Management Management Consulting Change Management Cross-functional Team... Supply Chain Management Management Project Planning Skills  Strategic Planning Performance Management Program Management Project Management Sales Process Improvement Strategy Start-ups Vendor Management Management Consulting Change Management Cross-functional Team... Supply Chain Management Management Project Planning Strategic Planning Performance Management Program Management Project Management Sales Process Improvement Strategy Start-ups Vendor Management Management Consulting Change Management Cross-functional Team... Supply Chain Management Management Project Planning Strategic Planning Performance Management Program Management Project Management Sales Process Improvement Strategy Start-ups Vendor Management Management Consulting Change Management Cross-functional Team... Supply Chain Management Management Project Planning Education University of Nebraska-Lincoln Bachelor of Science (BSc),  Mathematics and Computer Science 1988 University of Nebraska-Lincoln Bachelor of Science (BSc),  Mathematics and Computer Science 1988 University of Nebraska-Lincoln Bachelor of Science (BSc),  Mathematics and Computer Science 1988 University of Nebraska-Lincoln Bachelor of Science (BSc),  Mathematics and Computer Science 1988 ", "Experience Senior Manager Intel Corporation Senior Manager Intel Corporation Senior Manager Intel Corporation ", "Experience Senior Manager Intel Corporation August 2014  – Present (1 year 1 month) San Francisco Bay Area Manager Broadcom June 2007  –  August 2014  (7 years 3 months) Manager Fortemedia 2006  –  2007  (1 year) Software Engineer Intrinsyc Software 2004  –  2005  (1 year) CTO Ivt corporation 1999  –  2004  (5 years) Senior Manager Intel Corporation August 2014  – Present (1 year 1 month) San Francisco Bay Area Senior Manager Intel Corporation August 2014  – Present (1 year 1 month) San Francisco Bay Area Manager Broadcom June 2007  –  August 2014  (7 years 3 months) Manager Broadcom June 2007  –  August 2014  (7 years 3 months) Manager Fortemedia 2006  –  2007  (1 year) Manager Fortemedia 2006  –  2007  (1 year) Software Engineer Intrinsyc Software 2004  –  2005  (1 year) Software Engineer Intrinsyc Software 2004  –  2005  (1 year) CTO Ivt corporation 1999  –  2004  (5 years) CTO Ivt corporation 1999  –  2004  (5 years) Skills Semiconductors Embedded Systems Wireless Device Drivers C Perl C++ Linux Product Management Cross-functional Team... Software Engineering Software Development System Architecture SoC Skills  Semiconductors Embedded Systems Wireless Device Drivers C Perl C++ Linux Product Management Cross-functional Team... Software Engineering Software Development System Architecture SoC Semiconductors Embedded Systems Wireless Device Drivers C Perl C++ Linux Product Management Cross-functional Team... Software Engineering Software Development System Architecture SoC Semiconductors Embedded Systems Wireless Device Drivers C Perl C++ Linux Product Management Cross-functional Team... Software Engineering Software Development System Architecture SoC Education Institute of software, Chinese academy of sciences Doctor of Philosophy (Ph.D.),  Communication and Media Studies 1994  – 1999 University of Science and Technology of China Bachelor of Engineering (BEng),  Computer Science 1989  – 1994 Institute of software, Chinese academy of sciences Doctor of Philosophy (Ph.D.),  Communication and Media Studies 1994  – 1999 Institute of software, Chinese academy of sciences Doctor of Philosophy (Ph.D.),  Communication and Media Studies 1994  – 1999 Institute of software, Chinese academy of sciences Doctor of Philosophy (Ph.D.),  Communication and Media Studies 1994  – 1999 University of Science and Technology of China Bachelor of Engineering (BEng),  Computer Science 1989  – 1994 University of Science and Technology of China Bachelor of Engineering (BEng),  Computer Science 1989  – 1994 University of Science and Technology of China Bachelor of Engineering (BEng),  Computer Science 1989  – 1994 ", "Summary 15.5 years of experience in digital hardware design with proven track record of managing development and execution on-time with first-pass functional silicon. Recognized for excellent project management skills, identifying process improvements for enhancing efficiency and quality, and good people management. In depth knowledge across domains in IC design with expertise in front-end. Worked across multiple sites, and in multi-cultural environments. Experienced in handling interactions with customers, EDA and Third Party vendors. \n \nSpecialties: Project Management, ASIC, IP, SOC, Front-end Design Summary 15.5 years of experience in digital hardware design with proven track record of managing development and execution on-time with first-pass functional silicon. Recognized for excellent project management skills, identifying process improvements for enhancing efficiency and quality, and good people management. In depth knowledge across domains in IC design with expertise in front-end. Worked across multiple sites, and in multi-cultural environments. Experienced in handling interactions with customers, EDA and Third Party vendors. \n \nSpecialties: Project Management, ASIC, IP, SOC, Front-end Design 15.5 years of experience in digital hardware design with proven track record of managing development and execution on-time with first-pass functional silicon. Recognized for excellent project management skills, identifying process improvements for enhancing efficiency and quality, and good people management. In depth knowledge across domains in IC design with expertise in front-end. Worked across multiple sites, and in multi-cultural environments. Experienced in handling interactions with customers, EDA and Third Party vendors. \n \nSpecialties: Project Management, ASIC, IP, SOC, Front-end Design 15.5 years of experience in digital hardware design with proven track record of managing development and execution on-time with first-pass functional silicon. Recognized for excellent project management skills, identifying process improvements for enhancing efficiency and quality, and good people management. In depth knowledge across domains in IC design with expertise in front-end. Worked across multiple sites, and in multi-cultural environments. Experienced in handling interactions with customers, EDA and Third Party vendors. \n \nSpecialties: Project Management, ASIC, IP, SOC, Front-end Design Experience Senior Manager Intel Corporation November 2014  – Present (10 months) Senior Manager Ericsson June 2014  –  November 2014  (6 months) Managing front-end team for modem SOC execution in a horizontal role; activities include SOC RTL integration, IP development, SOC synthesis, STA and DFT - also, responsible for flows and methodology pertaining to the domains. Program Manager Texas Instruments January 2013  –  June 2014  (1 year 6 months) Responsible for getting clear scope aligned for IP development across the SOC programs and work with IP managers for tracking progress and deliverables to SOC. Developed IP commissioning process to improve efficiency and effectiveness in IP development. Member, Group Technical Staff Texas Instruments January 2006  –  June 2014  (8 years 6 months) External publications (see below) and multiple internal technical conference publications (>10) \n \nExternal Talks \n- \"DSP Architectures\" to VEDAS Seminar, Jadavpur University 2005, & ADE 2002 \n- \"TI Code Composer Studio\" to Jadavpur University, 2005 Design Manager Texas Instruments March 2008  –  December 2012  (4 years 10 months) OMAP5 design management, including transitioning the design activities and supporting ramp to production (Apr '13 to present). \n \nManager for the mixed signal IP group in Wireless Business Unit along with responsibility of it's digital team (Jun '12 to Jan '13). \n \nBuilt the imaging IP team over the years. Responsible for the development and delivery of Imaging IP serving TI business requirements as part of the Digital IP group in Wireless Business Unit (Mar '07 to Sep '12). \n \nHave co-led a TI worldwide team to investigate ESL methodologies for front-end development (Jul '08 - Jan '10). Lead Engineer Texas Instruments February 2003  –  February 2008  (5 years 1 month) Worked on multiple roles; led the imaging IP development as part of the Digital IP Group in Wireless Business Unit, front-end leadership roles on SOC designs in DSP group; direct customer interaction with Bosch on behalf of the SOC team. Design Engineer Texas Instruments March 1999  –  January 2003  (3 years 11 months) Started in the DSP group with front-end activities, developed expertise in RTL, synthesis, STA and good breadth in verification, physical design domains. Senior Manager Intel Corporation November 2014  – Present (10 months) Senior Manager Intel Corporation November 2014  – Present (10 months) Senior Manager Ericsson June 2014  –  November 2014  (6 months) Managing front-end team for modem SOC execution in a horizontal role; activities include SOC RTL integration, IP development, SOC synthesis, STA and DFT - also, responsible for flows and methodology pertaining to the domains. Senior Manager Ericsson June 2014  –  November 2014  (6 months) Managing front-end team for modem SOC execution in a horizontal role; activities include SOC RTL integration, IP development, SOC synthesis, STA and DFT - also, responsible for flows and methodology pertaining to the domains. Program Manager Texas Instruments January 2013  –  June 2014  (1 year 6 months) Responsible for getting clear scope aligned for IP development across the SOC programs and work with IP managers for tracking progress and deliverables to SOC. Developed IP commissioning process to improve efficiency and effectiveness in IP development. Program Manager Texas Instruments January 2013  –  June 2014  (1 year 6 months) Responsible for getting clear scope aligned for IP development across the SOC programs and work with IP managers for tracking progress and deliverables to SOC. Developed IP commissioning process to improve efficiency and effectiveness in IP development. Member, Group Technical Staff Texas Instruments January 2006  –  June 2014  (8 years 6 months) External publications (see below) and multiple internal technical conference publications (>10) \n \nExternal Talks \n- \"DSP Architectures\" to VEDAS Seminar, Jadavpur University 2005, & ADE 2002 \n- \"TI Code Composer Studio\" to Jadavpur University, 2005 Member, Group Technical Staff Texas Instruments January 2006  –  June 2014  (8 years 6 months) External publications (see below) and multiple internal technical conference publications (>10) \n \nExternal Talks \n- \"DSP Architectures\" to VEDAS Seminar, Jadavpur University 2005, & ADE 2002 \n- \"TI Code Composer Studio\" to Jadavpur University, 2005 Design Manager Texas Instruments March 2008  –  December 2012  (4 years 10 months) OMAP5 design management, including transitioning the design activities and supporting ramp to production (Apr '13 to present). \n \nManager for the mixed signal IP group in Wireless Business Unit along with responsibility of it's digital team (Jun '12 to Jan '13). \n \nBuilt the imaging IP team over the years. Responsible for the development and delivery of Imaging IP serving TI business requirements as part of the Digital IP group in Wireless Business Unit (Mar '07 to Sep '12). \n \nHave co-led a TI worldwide team to investigate ESL methodologies for front-end development (Jul '08 - Jan '10). Design Manager Texas Instruments March 2008  –  December 2012  (4 years 10 months) OMAP5 design management, including transitioning the design activities and supporting ramp to production (Apr '13 to present). \n \nManager for the mixed signal IP group in Wireless Business Unit along with responsibility of it's digital team (Jun '12 to Jan '13). \n \nBuilt the imaging IP team over the years. Responsible for the development and delivery of Imaging IP serving TI business requirements as part of the Digital IP group in Wireless Business Unit (Mar '07 to Sep '12). \n \nHave co-led a TI worldwide team to investigate ESL methodologies for front-end development (Jul '08 - Jan '10). Lead Engineer Texas Instruments February 2003  –  February 2008  (5 years 1 month) Worked on multiple roles; led the imaging IP development as part of the Digital IP Group in Wireless Business Unit, front-end leadership roles on SOC designs in DSP group; direct customer interaction with Bosch on behalf of the SOC team. Lead Engineer Texas Instruments February 2003  –  February 2008  (5 years 1 month) Worked on multiple roles; led the imaging IP development as part of the Digital IP Group in Wireless Business Unit, front-end leadership roles on SOC designs in DSP group; direct customer interaction with Bosch on behalf of the SOC team. Design Engineer Texas Instruments March 1999  –  January 2003  (3 years 11 months) Started in the DSP group with front-end activities, developed expertise in RTL, synthesis, STA and good breadth in verification, physical design domains. Design Engineer Texas Instruments March 1999  –  January 2003  (3 years 11 months) Started in the DSP group with front-end activities, developed expertise in RTL, synthesis, STA and good breadth in verification, physical design domains. Languages English Full professional proficiency Hindi Professional working proficiency Bengali Native or bilingual proficiency English Full professional proficiency Hindi Professional working proficiency Bengali Native or bilingual proficiency English Full professional proficiency Hindi Professional working proficiency Bengali Native or bilingual proficiency Full professional proficiency Professional working proficiency Native or bilingual proficiency Skills Front-end Design ASIC SoC ESL RTL design Logic Synthesis Timing Closure Static Timing Analysis Low-power Design Project Management Operational Execution Team Building Leadership Teamwork Flawless Execution Communication VLSI IC Processors Functional Verification ARM Hardware Architecture CMOS Mixed Signal Analog Digital Signal... Semiconductors SystemVerilog See 13+     See less Skills  Front-end Design ASIC SoC ESL RTL design Logic Synthesis Timing Closure Static Timing Analysis Low-power Design Project Management Operational Execution Team Building Leadership Teamwork Flawless Execution Communication VLSI IC Processors Functional Verification ARM Hardware Architecture CMOS Mixed Signal Analog Digital Signal... Semiconductors SystemVerilog See 13+     See less Front-end Design ASIC SoC ESL RTL design Logic Synthesis Timing Closure Static Timing Analysis Low-power Design Project Management Operational Execution Team Building Leadership Teamwork Flawless Execution Communication VLSI IC Processors Functional Verification ARM Hardware Architecture CMOS Mixed Signal Analog Digital Signal... Semiconductors SystemVerilog See 13+     See less Front-end Design ASIC SoC ESL RTL design Logic Synthesis Timing Closure Static Timing Analysis Low-power Design Project Management Operational Execution Team Building Leadership Teamwork Flawless Execution Communication VLSI IC Processors Functional Verification ARM Hardware Architecture CMOS Mixed Signal Analog Digital Signal... Semiconductors SystemVerilog See 13+     See less Education Indian Institute of Science Master of Technology (M.Tech.) 1997  – 1999 Jadavpur University Bachelor of Engineering (B.E.) 1993  – 1997 Indian Institute of Science Master of Technology (M.Tech.) 1997  – 1999 Indian Institute of Science Master of Technology (M.Tech.) 1997  – 1999 Indian Institute of Science Master of Technology (M.Tech.) 1997  – 1999 Jadavpur University Bachelor of Engineering (B.E.) 1993  – 1997 Jadavpur University Bachelor of Engineering (B.E.) 1993  – 1997 Jadavpur University Bachelor of Engineering (B.E.) 1993  – 1997 Honors & Awards Additional Honors & Awards Marquis Who's Who in Science and Engineering, 2008-09 Additional Honors & Awards Marquis Who's Who in Science and Engineering, 2008-09 Additional Honors & Awards Marquis Who's Who in Science and Engineering, 2008-09 Additional Honors & Awards Marquis Who's Who in Science and Engineering, 2008-09 ", "Summary 13 years of relevant experiences in Supply chain. Lead, manage and develop different teams across the Supply chain spanning from Customer management, Product/Inventory management to Capacity/Supplier management. Summary 13 years of relevant experiences in Supply chain. Lead, manage and develop different teams across the Supply chain spanning from Customer management, Product/Inventory management to Capacity/Supplier management. 13 years of relevant experiences in Supply chain. Lead, manage and develop different teams across the Supply chain spanning from Customer management, Product/Inventory management to Capacity/Supplier management. 13 years of relevant experiences in Supply chain. Lead, manage and develop different teams across the Supply chain spanning from Customer management, Product/Inventory management to Capacity/Supplier management. Experience Senior Manager Intel Corporation February 2005  – Present (10 years 7 months) Singapore Head the Demand to Capacity Planning function for Mobile and Communication Group Senior Manager Intel Corporation February 2005  – Present (10 years 7 months) Singapore Head the Demand to Capacity Planning function for Mobile and Communication Group Senior Manager Intel Corporation February 2005  – Present (10 years 7 months) Singapore Head the Demand to Capacity Planning function for Mobile and Communication Group Languages English Chinese German Limited working proficiency English Chinese German Limited working proficiency English Chinese German Limited working proficiency Limited working proficiency Education Nanyang Technological University Master of Engineering (M.Eng.),  Logistics , Materials, and Supply Chain Management 1999  – 2001 Nanyang Technological University Bachelor of Engineering (B.Eng.),  Mechanical and Production Engineering , 2nd Class Honours, Upper division 1996  – 1999 Nanyang Technological University Master of Engineering (M.Eng.),  Logistics , Materials, and Supply Chain Management 1999  – 2001 Nanyang Technological University Master of Engineering (M.Eng.),  Logistics , Materials, and Supply Chain Management 1999  – 2001 Nanyang Technological University Master of Engineering (M.Eng.),  Logistics , Materials, and Supply Chain Management 1999  – 2001 Nanyang Technological University Bachelor of Engineering (B.Eng.),  Mechanical and Production Engineering , 2nd Class Honours, Upper division 1996  – 1999 Nanyang Technological University Bachelor of Engineering (B.Eng.),  Mechanical and Production Engineering , 2nd Class Honours, Upper division 1996  – 1999 Nanyang Technological University Bachelor of Engineering (B.Eng.),  Mechanical and Production Engineering , 2nd Class Honours, Upper division 1996  – 1999 ", "Experience senior manager Intel Corporation senior manager Intel Corporation senior manager Intel Corporation ", "Summary Rich experince in various areas of semiconductor industry, including IP Design, FW development, Software development , SOC integration & implementation , starting from architectural definition, through implementation to silicon validation & support. \n•Seeded and grown from scratch, small to midsize technical teams . \n. Deeply involved in strategy planning, working out team n IP roadmaps and grooming next level leaderships . Summary Rich experince in various areas of semiconductor industry, including IP Design, FW development, Software development , SOC integration & implementation , starting from architectural definition, through implementation to silicon validation & support. \n•Seeded and grown from scratch, small to midsize technical teams . \n. Deeply involved in strategy planning, working out team n IP roadmaps and grooming next level leaderships . Rich experince in various areas of semiconductor industry, including IP Design, FW development, Software development , SOC integration & implementation , starting from architectural definition, through implementation to silicon validation & support. \n•Seeded and grown from scratch, small to midsize technical teams . \n. Deeply involved in strategy planning, working out team n IP roadmaps and grooming next level leaderships . Rich experince in various areas of semiconductor industry, including IP Design, FW development, Software development , SOC integration & implementation , starting from architectural definition, through implementation to silicon validation & support. \n•Seeded and grown from scratch, small to midsize technical teams . \n. Deeply involved in strategy planning, working out team n IP roadmaps and grooming next level leaderships . Experience Senior Manager Intel Corporation September 2014  – Present (1 year) Senior Manager Broadcom July 2013  –  August 2014  (1 year 2 months) Bangalore Group Manager (IP Design - Multimedia Convergence Platform Group) ST Microelectronics June 2011  –  June 2013  (2 years 1 month) Greater NOIDA Senior Manager (IP Design, Home Entertainment Division) STMicroelectronics January 2005  –  June 2011  (6 years 6 months) Noida Area, India Project Manager (IP Design) ST Microelectronics June 2001  –  January 2005  (3 years 8 months) NOIDA PL Motorola 1999  –  2001  (2 years) PL Motorola Semiconductor 1999  –  2001  (2 years) SMTS Duet Technologies 1997  –  1999  (2 years) E1 Larsen & Toubro Limited 1994  –  1997  (3 years) Senior Manager Intel Corporation September 2014  – Present (1 year) Senior Manager Intel Corporation September 2014  – Present (1 year) Senior Manager Broadcom July 2013  –  August 2014  (1 year 2 months) Bangalore Senior Manager Broadcom July 2013  –  August 2014  (1 year 2 months) Bangalore Group Manager (IP Design - Multimedia Convergence Platform Group) ST Microelectronics June 2011  –  June 2013  (2 years 1 month) Greater NOIDA Group Manager (IP Design - Multimedia Convergence Platform Group) ST Microelectronics June 2011  –  June 2013  (2 years 1 month) Greater NOIDA Senior Manager (IP Design, Home Entertainment Division) STMicroelectronics January 2005  –  June 2011  (6 years 6 months) Noida Area, India Senior Manager (IP Design, Home Entertainment Division) STMicroelectronics January 2005  –  June 2011  (6 years 6 months) Noida Area, India Project Manager (IP Design) ST Microelectronics June 2001  –  January 2005  (3 years 8 months) NOIDA Project Manager (IP Design) ST Microelectronics June 2001  –  January 2005  (3 years 8 months) NOIDA PL Motorola 1999  –  2001  (2 years) PL Motorola 1999  –  2001  (2 years) PL Motorola Semiconductor 1999  –  2001  (2 years) PL Motorola Semiconductor 1999  –  2001  (2 years) SMTS Duet Technologies 1997  –  1999  (2 years) SMTS Duet Technologies 1997  –  1999  (2 years) E1 Larsen & Toubro Limited 1994  –  1997  (3 years) E1 Larsen & Toubro Limited 1994  –  1997  (3 years) Languages English Hindi English Hindi English Hindi Skills Electronics Semiconductors ASIC HDMI Low-power Design Microelectronics SoC Verilog ARM RTL coding RTL design IC Integrated Circuit... VLSI Firmware Processors DDR3 Controllers Flash Memory Host... eMMC, Nand , Serial... IP Design Memory Controllers Device Drivers Static Timing Analysis Semiconductor Industry EDA Debugging IP Digital Signal... TCL CMOS Set Top Box Microprocessors Analog Hardware Architecture RTL Design See 20+     See less Skills  Electronics Semiconductors ASIC HDMI Low-power Design Microelectronics SoC Verilog ARM RTL coding RTL design IC Integrated Circuit... VLSI Firmware Processors DDR3 Controllers Flash Memory Host... eMMC, Nand , Serial... IP Design Memory Controllers Device Drivers Static Timing Analysis Semiconductor Industry EDA Debugging IP Digital Signal... TCL CMOS Set Top Box Microprocessors Analog Hardware Architecture RTL Design See 20+     See less Electronics Semiconductors ASIC HDMI Low-power Design Microelectronics SoC Verilog ARM RTL coding RTL design IC Integrated Circuit... VLSI Firmware Processors DDR3 Controllers Flash Memory Host... eMMC, Nand , Serial... IP Design Memory Controllers Device Drivers Static Timing Analysis Semiconductor Industry EDA Debugging IP Digital Signal... TCL CMOS Set Top Box Microprocessors Analog Hardware Architecture RTL Design See 20+     See less Electronics Semiconductors ASIC HDMI Low-power Design Microelectronics SoC Verilog ARM RTL coding RTL design IC Integrated Circuit... VLSI Firmware Processors DDR3 Controllers Flash Memory Host... eMMC, Nand , Serial... IP Design Memory Controllers Device Drivers Static Timing Analysis Semiconductor Industry EDA Debugging IP Digital Signal... TCL CMOS Set Top Box Microprocessors Analog Hardware Architecture RTL Design See 20+     See less Education HBTI Bachelor of Technology (B.Tech.) 1990  – 1994 Harcourt Butler Technological Institute B. Tech 1990  – 1994 HBTI Bachelor of Technology (B.Tech.) 1990  – 1994 HBTI Bachelor of Technology (B.Tech.) 1990  – 1994 HBTI Bachelor of Technology (B.Tech.) 1990  – 1994 Harcourt Butler Technological Institute B. Tech 1990  – 1994 Harcourt Butler Technological Institute B. Tech 1990  – 1994 Harcourt Butler Technological Institute B. Tech 1990  – 1994 ", "Experience Senior Manager Intel Corporation January 2012  – Present (3 years 8 months) Senior Manager Intel Corporation January 2012  – Present (3 years 8 months) Senior Manager Intel Corporation January 2012  – Present (3 years 8 months) Skills Microsoft Office Microsoft Excel Microsoft Word PowerPoint Customer Service English Windows Research Outlook Photoshop Teaching HTML Public Speaking Budgets C++ Editing C Strategic Planning Negotiation Java See 5+     See less Skills  Microsoft Office Microsoft Excel Microsoft Word PowerPoint Customer Service English Windows Research Outlook Photoshop Teaching HTML Public Speaking Budgets C++ Editing C Strategic Planning Negotiation Java See 5+     See less Microsoft Office Microsoft Excel Microsoft Word PowerPoint Customer Service English Windows Research Outlook Photoshop Teaching HTML Public Speaking Budgets C++ Editing C Strategic Planning Negotiation Java See 5+     See less Microsoft Office Microsoft Excel Microsoft Word PowerPoint Customer Service English Windows Research Outlook Photoshop Teaching HTML Public Speaking Budgets C++ Editing C Strategic Planning Negotiation Java See 5+     See less ", "Experience Senior Manager Intel Corporation February 2001  – Present (14 years 7 months) Senior Manager Intel Corporation February 2001  – Present (14 years 7 months) Senior Manager Intel Corporation February 2001  – Present (14 years 7 months) ", "Skills CMMI Quality Assurance Testing Program Management Semiconductors Software Development Six Sigma Embedded Systems Software Project... Agile Methodologies Embedded Software Software Engineering Scrum Skills  CMMI Quality Assurance Testing Program Management Semiconductors Software Development Six Sigma Embedded Systems Software Project... Agile Methodologies Embedded Software Software Engineering Scrum CMMI Quality Assurance Testing Program Management Semiconductors Software Development Six Sigma Embedded Systems Software Project... Agile Methodologies Embedded Software Software Engineering Scrum CMMI Quality Assurance Testing Program Management Semiconductors Software Development Six Sigma Embedded Systems Software Project... Agile Methodologies Embedded Software Software Engineering Scrum ", "Experience Senior Manager Intel Corporation May 2001  – Present (14 years 4 months) Intel Penang Design Center Working at Intel Penang Design Center, currently leading a R&D team of 50+ engineers across 3 Intel sites (US-Oregon, Malaysia-Penang and India-Bangalore), with 30 solid line reporting (Penang) and 20+ dotted line reporting (Oregon and Bangalore). This team consists of First Line Managers, SW Architects, Validation Platform Architect, System Debug Leads and SW/FW/HW Engineers. Senior Manager Intel Corporation May 2001  – Present (14 years 4 months) Intel Penang Design Center Working at Intel Penang Design Center, currently leading a R&D team of 50+ engineers across 3 Intel sites (US-Oregon, Malaysia-Penang and India-Bangalore), with 30 solid line reporting (Penang) and 20+ dotted line reporting (Oregon and Bangalore). This team consists of First Line Managers, SW Architects, Validation Platform Architect, System Debug Leads and SW/FW/HW Engineers. Senior Manager Intel Corporation May 2001  – Present (14 years 4 months) Intel Penang Design Center Working at Intel Penang Design Center, currently leading a R&D team of 50+ engineers across 3 Intel sites (US-Oregon, Malaysia-Penang and India-Bangalore), with 30 solid line reporting (Penang) and 20+ dotted line reporting (Oregon and Bangalore). This team consists of First Line Managers, SW Architects, Validation Platform Architect, System Debug Leads and SW/FW/HW Engineers. Education Chung Ling High School, Butterworth Universiti Tecknologi Malaysia Chung Ling High School, Butterworth Chung Ling High School, Butterworth Chung Ling High School, Butterworth Universiti Tecknologi Malaysia Universiti Tecknologi Malaysia Universiti Tecknologi Malaysia Honors & Awards Additional Honors & Awards Patent No: 2007/0073,709, \"Centralized Server-Directed Power Management in a Distributed Computing System\". Additional Honors & Awards Patent No: 2007/0073,709, \"Centralized Server-Directed Power Management in a Distributed Computing System\". Additional Honors & Awards Patent No: 2007/0073,709, \"Centralized Server-Directed Power Management in a Distributed Computing System\". Additional Honors & Awards Patent No: 2007/0073,709, \"Centralized Server-Directed Power Management in a Distributed Computing System\". ", "Experience Senior Manager Intel Corporation 2011  – Present (4 years) RF Engine development for 2G, 3G and 4G mobile applications, 3rd party component definition & integration Senior Manager Infineon Technologies 2006  –  2010  (4 years) RF engine development for 2G and 3G mobile applications, 3rd party component definition & integration Project Manager Infineon Technologies 2000  –  2006  (6 years) Development Power Amplifier for DECT, Bluetooth, WLAN 811.a/b/g and GSM/EDGE in SiGe, RF Bluetooth module integration based on LTCC Head RF Cordless Application for DECT products Siemens Semicunductor 1998  –  2000  (2 years) Reference design & worldwide support for key customers Application Engineer Siemens Semiconductor 1997  –  1998  (1 year) RF application engineering for short range systems, customer design-in support Development Engineer Rohde & Schwarz 1993  –  1997  (4 years) RF location systems 0 - 3GHz and signal processing, Thesis EADS (DASA Aerospace) 1992  –  1993  (1 year) Satellite antenna design & simulation, measurement technique, standard gain horn antenna, Compensated Compact Range Senior Manager Intel Corporation 2011  – Present (4 years) RF Engine development for 2G, 3G and 4G mobile applications, 3rd party component definition & integration Senior Manager Intel Corporation 2011  – Present (4 years) RF Engine development for 2G, 3G and 4G mobile applications, 3rd party component definition & integration Senior Manager Infineon Technologies 2006  –  2010  (4 years) RF engine development for 2G and 3G mobile applications, 3rd party component definition & integration Senior Manager Infineon Technologies 2006  –  2010  (4 years) RF engine development for 2G and 3G mobile applications, 3rd party component definition & integration Project Manager Infineon Technologies 2000  –  2006  (6 years) Development Power Amplifier for DECT, Bluetooth, WLAN 811.a/b/g and GSM/EDGE in SiGe, RF Bluetooth module integration based on LTCC Project Manager Infineon Technologies 2000  –  2006  (6 years) Development Power Amplifier for DECT, Bluetooth, WLAN 811.a/b/g and GSM/EDGE in SiGe, RF Bluetooth module integration based on LTCC Head RF Cordless Application for DECT products Siemens Semicunductor 1998  –  2000  (2 years) Reference design & worldwide support for key customers Head RF Cordless Application for DECT products Siemens Semicunductor 1998  –  2000  (2 years) Reference design & worldwide support for key customers Application Engineer Siemens Semiconductor 1997  –  1998  (1 year) RF application engineering for short range systems, customer design-in support Application Engineer Siemens Semiconductor 1997  –  1998  (1 year) RF application engineering for short range systems, customer design-in support Development Engineer Rohde & Schwarz 1993  –  1997  (4 years) RF location systems 0 - 3GHz and signal processing, Development Engineer Rohde & Schwarz 1993  –  1997  (4 years) RF location systems 0 - 3GHz and signal processing, Thesis EADS (DASA Aerospace) 1992  –  1993  (1 year) Satellite antenna design & simulation, measurement technique, standard gain horn antenna, Compensated Compact Range Thesis EADS (DASA Aerospace) 1992  –  1993  (1 year) Satellite antenna design & simulation, measurement technique, standard gain horn antenna, Compensated Compact Range Skills RF 3G Semiconductors Bluetooth WLAN Wireless Antennas Analog IC Signal Processing Simulations 4G 2G SoC Skills  RF 3G Semiconductors Bluetooth WLAN Wireless Antennas Analog IC Signal Processing Simulations 4G 2G SoC RF 3G Semiconductors Bluetooth WLAN Wireless Antennas Analog IC Signal Processing Simulations 4G 2G SoC RF 3G Semiconductors Bluetooth WLAN Wireless Antennas Analog IC Signal Processing Simulations 4G 2G SoC ", "Summary I am a MBA with 10 years of management experience in running large technology programs . I am \n \n- Experienced in managing complex large scale programs spanning across multiple geographies \n- Engaged in client facing roles and won multiple customer excellence awards  \n- Adept in creating business cases, transforming business requirements into solutions \n \nSpecialties: Program/Project Management, Vendor Management, Business Development,Account Management,Effort estimation, Consultative Selling, Client Relationship Management and PMO. \n \nDomain experience in Technology, Insurance and Banking industry Summary I am a MBA with 10 years of management experience in running large technology programs . I am \n \n- Experienced in managing complex large scale programs spanning across multiple geographies \n- Engaged in client facing roles and won multiple customer excellence awards  \n- Adept in creating business cases, transforming business requirements into solutions \n \nSpecialties: Program/Project Management, Vendor Management, Business Development,Account Management,Effort estimation, Consultative Selling, Client Relationship Management and PMO. \n \nDomain experience in Technology, Insurance and Banking industry I am a MBA with 10 years of management experience in running large technology programs . I am \n \n- Experienced in managing complex large scale programs spanning across multiple geographies \n- Engaged in client facing roles and won multiple customer excellence awards  \n- Adept in creating business cases, transforming business requirements into solutions \n \nSpecialties: Program/Project Management, Vendor Management, Business Development,Account Management,Effort estimation, Consultative Selling, Client Relationship Management and PMO. \n \nDomain experience in Technology, Insurance and Banking industry I am a MBA with 10 years of management experience in running large technology programs . I am \n \n- Experienced in managing complex large scale programs spanning across multiple geographies \n- Engaged in client facing roles and won multiple customer excellence awards  \n- Adept in creating business cases, transforming business requirements into solutions \n \nSpecialties: Program/Project Management, Vendor Management, Business Development,Account Management,Effort estimation, Consultative Selling, Client Relationship Management and PMO. \n \nDomain experience in Technology, Insurance and Banking industry Experience Senior Manager Intel Corporation May 2015  – Present (4 months) San Francisco Bay Area Chrome Hardware Engg. Operations Senior Manager Cognizant Technology Solutions August 2012  –  May 2015  (2 years 10 months) San Francisco Bay Area - Managed a $25MM global portfolio (250+ associates in 5 countries) for industry leading clients \n- Managed customer relationships & achieved highest customer satisfaction scores for 3 years in a row \n- Led new business development and PM activities with top technology sector clients \n- Built an analyst team from scratch. Handled recruitment, mentoring and team building activities \n- Developed a revenue forecasting model to reduce monthly forecast deviation to less than 1% Program Manager Cognizant Technology Solutions November 2011  –  May 2013  (1 year 7 months) Raleigh-Durham, North Carolina Area - Managed $30MM programs across lending and payments portfolios for a leading US Bank \n- Supervised program planning activities of a $40MM global portfolio for a top US based Insurance firm \n- Achieved 30% y-o-y portfolio growth and exceeded the top-line and bottom-line targets thrice in a row \n- Negotiated and successfully executed 20+ contracts that resulted in 20% higher profit margins Senior Business Consultant Cognizant Technology Solutions May 2007  –  October 2011  (4 years 6 months) Hartford, Connecticut Area - Led program planning activities of a $40 MM engagement for a top US based Insurance client \n- Consulted for Top 10 insurance organizations on Business Process Re-design, Application Portfolio Rationalization, Strategy Roadmap and Vendor Evaluation resulting in $1MM+ annual savings \n- Successfully led a 10 member business process re-engineering and analyst team in a $40 MM business transformation program for the largest P&C Insurer (using Agile methodology) \n- Specialized in Requirements Elicitation techniques and end-end Requirements Analysis/Management Management Trainee Oracle August 2006  –  January 2007  (6 months) Bangalore - Evaluated through risk assessment techniques to select a new offshore captive center in EMEA \n- Authored a research report - “The paradigm shift in ERP (Enterprise Resource Planning) markets & consulting model” – highlighting several strategies to improve Oracle’s ERP and consulting business Applications Developer Oracle Corporation January 2005  –  April 2006  (1 year 4 months) Hyderabad Area, India - Functional design & development of Release12 modules for Account Payables \n- Worked with high profile customers like GE, Best Buy, Asian Bank, ALCOA, Emirates, Dubai government. Assistant Systems Engineer Tata Consultancy Services June 2004  –  December 2004  (7 months) Chennai Area, India - Successfully completed the 3 months rigorous training program with the “Best trainee award”  \n- Developed and implemented plug-ins for ERP system used by Hewlett Packard Senior Manager Intel Corporation May 2015  – Present (4 months) San Francisco Bay Area Chrome Hardware Engg. Operations Senior Manager Intel Corporation May 2015  – Present (4 months) San Francisco Bay Area Chrome Hardware Engg. Operations Senior Manager Cognizant Technology Solutions August 2012  –  May 2015  (2 years 10 months) San Francisco Bay Area - Managed a $25MM global portfolio (250+ associates in 5 countries) for industry leading clients \n- Managed customer relationships & achieved highest customer satisfaction scores for 3 years in a row \n- Led new business development and PM activities with top technology sector clients \n- Built an analyst team from scratch. Handled recruitment, mentoring and team building activities \n- Developed a revenue forecasting model to reduce monthly forecast deviation to less than 1% Senior Manager Cognizant Technology Solutions August 2012  –  May 2015  (2 years 10 months) San Francisco Bay Area - Managed a $25MM global portfolio (250+ associates in 5 countries) for industry leading clients \n- Managed customer relationships & achieved highest customer satisfaction scores for 3 years in a row \n- Led new business development and PM activities with top technology sector clients \n- Built an analyst team from scratch. Handled recruitment, mentoring and team building activities \n- Developed a revenue forecasting model to reduce monthly forecast deviation to less than 1% Program Manager Cognizant Technology Solutions November 2011  –  May 2013  (1 year 7 months) Raleigh-Durham, North Carolina Area - Managed $30MM programs across lending and payments portfolios for a leading US Bank \n- Supervised program planning activities of a $40MM global portfolio for a top US based Insurance firm \n- Achieved 30% y-o-y portfolio growth and exceeded the top-line and bottom-line targets thrice in a row \n- Negotiated and successfully executed 20+ contracts that resulted in 20% higher profit margins Program Manager Cognizant Technology Solutions November 2011  –  May 2013  (1 year 7 months) Raleigh-Durham, North Carolina Area - Managed $30MM programs across lending and payments portfolios for a leading US Bank \n- Supervised program planning activities of a $40MM global portfolio for a top US based Insurance firm \n- Achieved 30% y-o-y portfolio growth and exceeded the top-line and bottom-line targets thrice in a row \n- Negotiated and successfully executed 20+ contracts that resulted in 20% higher profit margins Senior Business Consultant Cognizant Technology Solutions May 2007  –  October 2011  (4 years 6 months) Hartford, Connecticut Area - Led program planning activities of a $40 MM engagement for a top US based Insurance client \n- Consulted for Top 10 insurance organizations on Business Process Re-design, Application Portfolio Rationalization, Strategy Roadmap and Vendor Evaluation resulting in $1MM+ annual savings \n- Successfully led a 10 member business process re-engineering and analyst team in a $40 MM business transformation program for the largest P&C Insurer (using Agile methodology) \n- Specialized in Requirements Elicitation techniques and end-end Requirements Analysis/Management Senior Business Consultant Cognizant Technology Solutions May 2007  –  October 2011  (4 years 6 months) Hartford, Connecticut Area - Led program planning activities of a $40 MM engagement for a top US based Insurance client \n- Consulted for Top 10 insurance organizations on Business Process Re-design, Application Portfolio Rationalization, Strategy Roadmap and Vendor Evaluation resulting in $1MM+ annual savings \n- Successfully led a 10 member business process re-engineering and analyst team in a $40 MM business transformation program for the largest P&C Insurer (using Agile methodology) \n- Specialized in Requirements Elicitation techniques and end-end Requirements Analysis/Management Management Trainee Oracle August 2006  –  January 2007  (6 months) Bangalore - Evaluated through risk assessment techniques to select a new offshore captive center in EMEA \n- Authored a research report - “The paradigm shift in ERP (Enterprise Resource Planning) markets & consulting model” – highlighting several strategies to improve Oracle’s ERP and consulting business Management Trainee Oracle August 2006  –  January 2007  (6 months) Bangalore - Evaluated through risk assessment techniques to select a new offshore captive center in EMEA \n- Authored a research report - “The paradigm shift in ERP (Enterprise Resource Planning) markets & consulting model” – highlighting several strategies to improve Oracle’s ERP and consulting business Applications Developer Oracle Corporation January 2005  –  April 2006  (1 year 4 months) Hyderabad Area, India - Functional design & development of Release12 modules for Account Payables \n- Worked with high profile customers like GE, Best Buy, Asian Bank, ALCOA, Emirates, Dubai government. Applications Developer Oracle Corporation January 2005  –  April 2006  (1 year 4 months) Hyderabad Area, India - Functional design & development of Release12 modules for Account Payables \n- Worked with high profile customers like GE, Best Buy, Asian Bank, ALCOA, Emirates, Dubai government. Assistant Systems Engineer Tata Consultancy Services June 2004  –  December 2004  (7 months) Chennai Area, India - Successfully completed the 3 months rigorous training program with the “Best trainee award”  \n- Developed and implemented plug-ins for ERP system used by Hewlett Packard Assistant Systems Engineer Tata Consultancy Services June 2004  –  December 2004  (7 months) Chennai Area, India - Successfully completed the 3 months rigorous training program with the “Best trainee award”  \n- Developed and implemented plug-ins for ERP system used by Hewlett Packard Languages English English English Skills Account Management Management Consulting Program Management Global Business... Business Analysis Business Process Financial Services CRM Requirements Analysis Vendor Management Strategy Management Cross-functional Team... Business Development Product Management Enterprise Software ERP Cloud Computing Team Management Leadership Business Transformation Requirements Gathering Pre-sales Agile Methodologies IT Strategy Global Delivery Oracle Business Intelligence SDLC Software Project... Business Process... Business Process Design Consulting Solution Architecture New Business Development Project Management Business Process... Team Leadership Outsourcing Project Portfolio... PMO Resource Management Business Requirements See 28+     See less Skills  Account Management Management Consulting Program Management Global Business... Business Analysis Business Process Financial Services CRM Requirements Analysis Vendor Management Strategy Management Cross-functional Team... Business Development Product Management Enterprise Software ERP Cloud Computing Team Management Leadership Business Transformation Requirements Gathering Pre-sales Agile Methodologies IT Strategy Global Delivery Oracle Business Intelligence SDLC Software Project... Business Process... Business Process Design Consulting Solution Architecture New Business Development Project Management Business Process... Team Leadership Outsourcing Project Portfolio... PMO Resource Management Business Requirements See 28+     See less Account Management Management Consulting Program Management Global Business... Business Analysis Business Process Financial Services CRM Requirements Analysis Vendor Management Strategy Management Cross-functional Team... Business Development Product Management Enterprise Software ERP Cloud Computing Team Management Leadership Business Transformation Requirements Gathering Pre-sales Agile Methodologies IT Strategy Global Delivery Oracle Business Intelligence SDLC Software Project... Business Process... Business Process Design Consulting Solution Architecture New Business Development Project Management Business Process... Team Leadership Outsourcing Project Portfolio... PMO Resource Management Business Requirements See 28+     See less Account Management Management Consulting Program Management Global Business... Business Analysis Business Process Financial Services CRM Requirements Analysis Vendor Management Strategy Management Cross-functional Team... Business Development Product Management Enterprise Software ERP Cloud Computing Team Management Leadership Business Transformation Requirements Gathering Pre-sales Agile Methodologies IT Strategy Global Delivery Oracle Business Intelligence SDLC Software Project... Business Process... Business Process Design Consulting Solution Architecture New Business Development Project Management Business Process... Team Leadership Outsourcing Project Portfolio... PMO Resource Management Business Requirements See 28+     See less Education Stanford University Executing Complex Programs,  Program Management 2014  – 2014 Great Lakes Institute of Management Master of Business Administration (MBA),  Finance ,  Strategic Marketing , 3.7 2006  – 2007 - Cabinet member of financial study group and placement committee PSG College of Technology Bachelors in Engineering,  Electronics and Communication , 3.5 2000  – 2004 - Three times “Gold Medal” winner in Badminton at TIES (Tamil Nadu Inter Engineering Sports Meet) \n- Won multiple Gold medals in track and field events at district and university level \n- Gold-Medalist in Volley ball, Badminton, kho-kho championship games in state level \n- Placement coordinator and class representative \n- College Sports secretary and captain of the Badminton team \n- YRC (Youth Red Cross) camps coordinator and ECE association member DAV MHSS 1998  – 2000 Activities and Societies:  - Best Outgoing Student Stanford University Executing Complex Programs,  Program Management 2014  – 2014 Stanford University Executing Complex Programs,  Program Management 2014  – 2014 Stanford University Executing Complex Programs,  Program Management 2014  – 2014 Great Lakes Institute of Management Master of Business Administration (MBA),  Finance ,  Strategic Marketing , 3.7 2006  – 2007 - Cabinet member of financial study group and placement committee Great Lakes Institute of Management Master of Business Administration (MBA),  Finance ,  Strategic Marketing , 3.7 2006  – 2007 - Cabinet member of financial study group and placement committee Great Lakes Institute of Management Master of Business Administration (MBA),  Finance ,  Strategic Marketing , 3.7 2006  – 2007 - Cabinet member of financial study group and placement committee PSG College of Technology Bachelors in Engineering,  Electronics and Communication , 3.5 2000  – 2004 - Three times “Gold Medal” winner in Badminton at TIES (Tamil Nadu Inter Engineering Sports Meet) \n- Won multiple Gold medals in track and field events at district and university level \n- Gold-Medalist in Volley ball, Badminton, kho-kho championship games in state level \n- Placement coordinator and class representative \n- College Sports secretary and captain of the Badminton team \n- YRC (Youth Red Cross) camps coordinator and ECE association member PSG College of Technology Bachelors in Engineering,  Electronics and Communication , 3.5 2000  – 2004 - Three times “Gold Medal” winner in Badminton at TIES (Tamil Nadu Inter Engineering Sports Meet) \n- Won multiple Gold medals in track and field events at district and university level \n- Gold-Medalist in Volley ball, Badminton, kho-kho championship games in state level \n- Placement coordinator and class representative \n- College Sports secretary and captain of the Badminton team \n- YRC (Youth Red Cross) camps coordinator and ECE association member PSG College of Technology Bachelors in Engineering,  Electronics and Communication , 3.5 2000  – 2004 - Three times “Gold Medal” winner in Badminton at TIES (Tamil Nadu Inter Engineering Sports Meet) \n- Won multiple Gold medals in track and field events at district and university level \n- Gold-Medalist in Volley ball, Badminton, kho-kho championship games in state level \n- Placement coordinator and class representative \n- College Sports secretary and captain of the Badminton team \n- YRC (Youth Red Cross) camps coordinator and ECE association member DAV MHSS 1998  – 2000 Activities and Societies:  - Best Outgoing Student DAV MHSS 1998  – 2000 Activities and Societies:  - Best Outgoing Student DAV MHSS 1998  – 2000 Activities and Societies:  - Best Outgoing Student ", "Summary One of the most experienced problem solvers in Intel with 22-year well recognized managerial and technical skills. 17 years of packaging technology development experience. Had been instrumental in the development of numerous advanced high density interconnection assembly packaging technologies for Intel CPU, Chipset and SOC products, i.e. Wire Bonding Ceramic PGA and Plastic LGA; Flip Chip PGA, Flip Chip BGA, Flip Chip Molded Matrix BGA (with mold or interposer) and the most recent Thermal Compression Bonding FCBGA.  \n \n8 years of senior manager position in assembly process engineering, statistician, industrial engineering, assembly technology pathfinding, materials, thermal and mechanical core competency groups. Well recognized for his passion in people and organization development in conducting many self-developed courses. Five years ago, after completed managing the most complex packaging technology pathfinding then in Intel and handed it over to the development phase, stepped up to be the technical lead in the entire technology development to ensure its success. Established a new problem solving methodology named as Fundamentals Based Investigation with significant time reduction in problem solving. Continued technical career path in the largest Intel factory in Malaysia to resolve and avoid various complex issues. Master mind of the worldwide Intel manufacturing sites on the Marginal Tool Policy and established an automated tool performance triggering system. \n \nA Master of Science in Materials Engineering. Hold five US patents and five trade secrets and published numerous papers (mostly internal for intellectual properties control). Chaired the iNEMI Asia Packaging Technical Group to identify projects for industry collaboration for 1.5 years.  Summary One of the most experienced problem solvers in Intel with 22-year well recognized managerial and technical skills. 17 years of packaging technology development experience. Had been instrumental in the development of numerous advanced high density interconnection assembly packaging technologies for Intel CPU, Chipset and SOC products, i.e. Wire Bonding Ceramic PGA and Plastic LGA; Flip Chip PGA, Flip Chip BGA, Flip Chip Molded Matrix BGA (with mold or interposer) and the most recent Thermal Compression Bonding FCBGA.  \n \n8 years of senior manager position in assembly process engineering, statistician, industrial engineering, assembly technology pathfinding, materials, thermal and mechanical core competency groups. Well recognized for his passion in people and organization development in conducting many self-developed courses. Five years ago, after completed managing the most complex packaging technology pathfinding then in Intel and handed it over to the development phase, stepped up to be the technical lead in the entire technology development to ensure its success. Established a new problem solving methodology named as Fundamentals Based Investigation with significant time reduction in problem solving. Continued technical career path in the largest Intel factory in Malaysia to resolve and avoid various complex issues. Master mind of the worldwide Intel manufacturing sites on the Marginal Tool Policy and established an automated tool performance triggering system. \n \nA Master of Science in Materials Engineering. Hold five US patents and five trade secrets and published numerous papers (mostly internal for intellectual properties control). Chaired the iNEMI Asia Packaging Technical Group to identify projects for industry collaboration for 1.5 years.  One of the most experienced problem solvers in Intel with 22-year well recognized managerial and technical skills. 17 years of packaging technology development experience. Had been instrumental in the development of numerous advanced high density interconnection assembly packaging technologies for Intel CPU, Chipset and SOC products, i.e. Wire Bonding Ceramic PGA and Plastic LGA; Flip Chip PGA, Flip Chip BGA, Flip Chip Molded Matrix BGA (with mold or interposer) and the most recent Thermal Compression Bonding FCBGA.  \n \n8 years of senior manager position in assembly process engineering, statistician, industrial engineering, assembly technology pathfinding, materials, thermal and mechanical core competency groups. Well recognized for his passion in people and organization development in conducting many self-developed courses. Five years ago, after completed managing the most complex packaging technology pathfinding then in Intel and handed it over to the development phase, stepped up to be the technical lead in the entire technology development to ensure its success. Established a new problem solving methodology named as Fundamentals Based Investigation with significant time reduction in problem solving. Continued technical career path in the largest Intel factory in Malaysia to resolve and avoid various complex issues. Master mind of the worldwide Intel manufacturing sites on the Marginal Tool Policy and established an automated tool performance triggering system. \n \nA Master of Science in Materials Engineering. Hold five US patents and five trade secrets and published numerous papers (mostly internal for intellectual properties control). Chaired the iNEMI Asia Packaging Technical Group to identify projects for industry collaboration for 1.5 years.  One of the most experienced problem solvers in Intel with 22-year well recognized managerial and technical skills. 17 years of packaging technology development experience. Had been instrumental in the development of numerous advanced high density interconnection assembly packaging technologies for Intel CPU, Chipset and SOC products, i.e. Wire Bonding Ceramic PGA and Plastic LGA; Flip Chip PGA, Flip Chip BGA, Flip Chip Molded Matrix BGA (with mold or interposer) and the most recent Thermal Compression Bonding FCBGA.  \n \n8 years of senior manager position in assembly process engineering, statistician, industrial engineering, assembly technology pathfinding, materials, thermal and mechanical core competency groups. Well recognized for his passion in people and organization development in conducting many self-developed courses. Five years ago, after completed managing the most complex packaging technology pathfinding then in Intel and handed it over to the development phase, stepped up to be the technical lead in the entire technology development to ensure its success. Established a new problem solving methodology named as Fundamentals Based Investigation with significant time reduction in problem solving. Continued technical career path in the largest Intel factory in Malaysia to resolve and avoid various complex issues. Master mind of the worldwide Intel manufacturing sites on the Marginal Tool Policy and established an automated tool performance triggering system. \n \nA Master of Science in Materials Engineering. Hold five US patents and five trade secrets and published numerous papers (mostly internal for intellectual properties control). Chaired the iNEMI Asia Packaging Technical Group to identify projects for industry collaboration for 1.5 years.  Experience Staff Manufacturing Technologist Intel Corporation June 2009  – Present (6 years 3 months) A content expert in the advanced assembly technology and the packaging assembly processes focusing on resolving complex technical issues. Lead in a equipment improvement policy. Conduct classes, sharing and coaching on technical problem solving methods and people soft skills. Senior Manager Intel Corporation January 2002  –  September 2009  (7 years 9 months) Kulim, Malaysia Assembly Modules, Statisticians, Industrial Engineering Manager (Manager/Sr. Manager) [Jan 2002 to Sept 2006] \n \nAssembly Technology Pathfinding and Core Competency (Materials, Thermal/Mechanical/Fluid) Sr. Manager [Sept 2006 to June 2009] \n \nSr. Assembly/Materials Technologist (Sr. Staff Engineer) [June 2009 to Dec 2010] \n- Lead engineer on an advanced Package-On-Package (POP) packaging technology \n \nSr. Assembly/Materials Technologist (Sr. Staff Engineer) [Dec 2010 to April 2015] \n- Assembly technical expert and leader to drive for defect free manufacturing. Worldwide factory lead in problem solving and marginal equipment policy and triggering system.  Senior Manager Intel Corporation April 2004  –  June 2009  (5 years 3 months) Managed and led ATD-M Module Engineering team to develop several packaging technologies. Successfully certified a few flip chip and wire bond technologies (FCBGA1 1mm, FCBGA1b.Cy, FCBGA2 ext and PBGA (ICH4-CR)) in 2002. Developed and certified FCBGA3 (Ph 1a & 1b) and PBGA (ICH5, ICH6) in 2003. Delivered PBGA3, lead free FCBGA3 (Ph 1, 2 & 3), lead free FCBGA1 & FCBGA2 and 1265 Pathfinding technologies in 2004. In 2005, orchestrated an organization restructure and managed the Industrial Engineers and the Statistician Groups to complement Module Engineering. Delivered technology certification of FCBGA7 (Ph1 & 2) and FCMMAP (2L) in 2006.  \nManaged the FCBGA9 (Ph1 & 2) Pathfinding programs. Later also managed the ATD-M Materials Core Competency Group, the Thermal Mechanical Tool and Analysis (TMTA) Core Competency Group and the Pathfinding organization in Q4 2006 to develop the FCBGA9.E2 and two other emerging flip chip technology programs. Managed the pathfinding team to successfully deliver the most complex packaging technology for the smallest and the thinnest chip for smartphone and tablet application. Staff Manufacturing Technologist Intel Corporation June 2009  – Present (6 years 3 months) A content expert in the advanced assembly technology and the packaging assembly processes focusing on resolving complex technical issues. Lead in a equipment improvement policy. Conduct classes, sharing and coaching on technical problem solving methods and people soft skills. Staff Manufacturing Technologist Intel Corporation June 2009  – Present (6 years 3 months) A content expert in the advanced assembly technology and the packaging assembly processes focusing on resolving complex technical issues. Lead in a equipment improvement policy. Conduct classes, sharing and coaching on technical problem solving methods and people soft skills. Senior Manager Intel Corporation January 2002  –  September 2009  (7 years 9 months) Kulim, Malaysia Assembly Modules, Statisticians, Industrial Engineering Manager (Manager/Sr. Manager) [Jan 2002 to Sept 2006] \n \nAssembly Technology Pathfinding and Core Competency (Materials, Thermal/Mechanical/Fluid) Sr. Manager [Sept 2006 to June 2009] \n \nSr. Assembly/Materials Technologist (Sr. Staff Engineer) [June 2009 to Dec 2010] \n- Lead engineer on an advanced Package-On-Package (POP) packaging technology \n \nSr. Assembly/Materials Technologist (Sr. Staff Engineer) [Dec 2010 to April 2015] \n- Assembly technical expert and leader to drive for defect free manufacturing. Worldwide factory lead in problem solving and marginal equipment policy and triggering system.  Senior Manager Intel Corporation January 2002  –  September 2009  (7 years 9 months) Kulim, Malaysia Assembly Modules, Statisticians, Industrial Engineering Manager (Manager/Sr. Manager) [Jan 2002 to Sept 2006] \n \nAssembly Technology Pathfinding and Core Competency (Materials, Thermal/Mechanical/Fluid) Sr. Manager [Sept 2006 to June 2009] \n \nSr. Assembly/Materials Technologist (Sr. Staff Engineer) [June 2009 to Dec 2010] \n- Lead engineer on an advanced Package-On-Package (POP) packaging technology \n \nSr. Assembly/Materials Technologist (Sr. Staff Engineer) [Dec 2010 to April 2015] \n- Assembly technical expert and leader to drive for defect free manufacturing. Worldwide factory lead in problem solving and marginal equipment policy and triggering system.  Senior Manager Intel Corporation April 2004  –  June 2009  (5 years 3 months) Managed and led ATD-M Module Engineering team to develop several packaging technologies. Successfully certified a few flip chip and wire bond technologies (FCBGA1 1mm, FCBGA1b.Cy, FCBGA2 ext and PBGA (ICH4-CR)) in 2002. Developed and certified FCBGA3 (Ph 1a & 1b) and PBGA (ICH5, ICH6) in 2003. Delivered PBGA3, lead free FCBGA3 (Ph 1, 2 & 3), lead free FCBGA1 & FCBGA2 and 1265 Pathfinding technologies in 2004. In 2005, orchestrated an organization restructure and managed the Industrial Engineers and the Statistician Groups to complement Module Engineering. Delivered technology certification of FCBGA7 (Ph1 & 2) and FCMMAP (2L) in 2006.  \nManaged the FCBGA9 (Ph1 & 2) Pathfinding programs. Later also managed the ATD-M Materials Core Competency Group, the Thermal Mechanical Tool and Analysis (TMTA) Core Competency Group and the Pathfinding organization in Q4 2006 to develop the FCBGA9.E2 and two other emerging flip chip technology programs. Managed the pathfinding team to successfully deliver the most complex packaging technology for the smallest and the thinnest chip for smartphone and tablet application. Senior Manager Intel Corporation April 2004  –  June 2009  (5 years 3 months) Managed and led ATD-M Module Engineering team to develop several packaging technologies. Successfully certified a few flip chip and wire bond technologies (FCBGA1 1mm, FCBGA1b.Cy, FCBGA2 ext and PBGA (ICH4-CR)) in 2002. Developed and certified FCBGA3 (Ph 1a & 1b) and PBGA (ICH5, ICH6) in 2003. Delivered PBGA3, lead free FCBGA3 (Ph 1, 2 & 3), lead free FCBGA1 & FCBGA2 and 1265 Pathfinding technologies in 2004. In 2005, orchestrated an organization restructure and managed the Industrial Engineers and the Statistician Groups to complement Module Engineering. Delivered technology certification of FCBGA7 (Ph1 & 2) and FCMMAP (2L) in 2006.  \nManaged the FCBGA9 (Ph1 & 2) Pathfinding programs. Later also managed the ATD-M Materials Core Competency Group, the Thermal Mechanical Tool and Analysis (TMTA) Core Competency Group and the Pathfinding organization in Q4 2006 to develop the FCBGA9.E2 and two other emerging flip chip technology programs. Managed the pathfinding team to successfully deliver the most complex packaging technology for the smallest and the thinnest chip for smartphone and tablet application. Languages Chinese Malay English Chinese Malay English Chinese Malay English Skills Manufacturing Semiconductors Process Engineering Materials Science Engineering SPC R&D Management Cross-functional Team... Engineering Management Materials Lean Manufacturing FMEA Electronics Continuous Improvement Packaging Processors Problem Solving Training Failure Analysis See 5+     See less Skills  Manufacturing Semiconductors Process Engineering Materials Science Engineering SPC R&D Management Cross-functional Team... Engineering Management Materials Lean Manufacturing FMEA Electronics Continuous Improvement Packaging Processors Problem Solving Training Failure Analysis See 5+     See less Manufacturing Semiconductors Process Engineering Materials Science Engineering SPC R&D Management Cross-functional Team... Engineering Management Materials Lean Manufacturing FMEA Electronics Continuous Improvement Packaging Processors Problem Solving Training Failure Analysis See 5+     See less Manufacturing Semiconductors Process Engineering Materials Science Engineering SPC R&D Management Cross-functional Team... Engineering Management Materials Lean Manufacturing FMEA Electronics Continuous Improvement Packaging Processors Problem Solving Training Failure Analysis See 5+     See less Education University Science Malaysia Master of Science,  Materials Engineering 1989  – 1993 Vice President of Materials and Mineral Resources Engineering Society (1992/1993) SMJK Sam Tet Form 6 1981  – 1988 1)\tSchool Prefect (1985-1988) \n2)\tPresident of Malaysia Red Crescent Society (MRCS), Youth 7 (1985) \n3)\tVice President of Art Club (1985) \n4)\tVice President of MRCS, Voluntary Aid Detachment (VAD) 7 (1987) \n5)\tAward: Best Leader of Perak District of Malaysia Red Crescent Society in the state competition (1987) \n Sam Tet, USM, University Science of Malaysia University Science Malaysia Master of Science,  Materials Engineering 1989  – 1993 Vice President of Materials and Mineral Resources Engineering Society (1992/1993) University Science Malaysia Master of Science,  Materials Engineering 1989  – 1993 Vice President of Materials and Mineral Resources Engineering Society (1992/1993) University Science Malaysia Master of Science,  Materials Engineering 1989  – 1993 Vice President of Materials and Mineral Resources Engineering Society (1992/1993) SMJK Sam Tet Form 6 1981  – 1988 1)\tSchool Prefect (1985-1988) \n2)\tPresident of Malaysia Red Crescent Society (MRCS), Youth 7 (1985) \n3)\tVice President of Art Club (1985) \n4)\tVice President of MRCS, Voluntary Aid Detachment (VAD) 7 (1987) \n5)\tAward: Best Leader of Perak District of Malaysia Red Crescent Society in the state competition (1987) \n SMJK Sam Tet Form 6 1981  – 1988 1)\tSchool Prefect (1985-1988) \n2)\tPresident of Malaysia Red Crescent Society (MRCS), Youth 7 (1985) \n3)\tVice President of Art Club (1985) \n4)\tVice President of MRCS, Voluntary Aid Detachment (VAD) 7 (1987) \n5)\tAward: Best Leader of Perak District of Malaysia Red Crescent Society in the state competition (1987) \n SMJK Sam Tet Form 6 1981  – 1988 1)\tSchool Prefect (1985-1988) \n2)\tPresident of Malaysia Red Crescent Society (MRCS), Youth 7 (1985) \n3)\tVice President of Art Club (1985) \n4)\tVice President of MRCS, Voluntary Aid Detachment (VAD) 7 (1987) \n5)\tAward: Best Leader of Perak District of Malaysia Red Crescent Society in the state competition (1987) \n Sam Tet, USM, University Science of Malaysia Sam Tet, USM, University Science of Malaysia Sam Tet, USM, University Science of Malaysia ", "Skills Finance Vulnerability Assessment Analysis Software Documentation Training Information Security Healthcare Information... Identity Management Identity Federation Encryption Information Security... Information Security... Public Speaking Educational Technology Internet Banking Risk Assessment Disaster Recovery Data Security Data Privacy Business Analysis Strategic Technology... Information Governance Team Building Project Management Cloud Security Enterprise Software Leadership Program Management Enterprise Architecture Data Center Strategy Security Risk Management Start-ups CRM See 20+     See less Skills  Finance Vulnerability Assessment Analysis Software Documentation Training Information Security Healthcare Information... Identity Management Identity Federation Encryption Information Security... Information Security... Public Speaking Educational Technology Internet Banking Risk Assessment Disaster Recovery Data Security Data Privacy Business Analysis Strategic Technology... Information Governance Team Building Project Management Cloud Security Enterprise Software Leadership Program Management Enterprise Architecture Data Center Strategy Security Risk Management Start-ups CRM See 20+     See less Finance Vulnerability Assessment Analysis Software Documentation Training Information Security Healthcare Information... Identity Management Identity Federation Encryption Information Security... Information Security... Public Speaking Educational Technology Internet Banking Risk Assessment Disaster Recovery Data Security Data Privacy Business Analysis Strategic Technology... Information Governance Team Building Project Management Cloud Security Enterprise Software Leadership Program Management Enterprise Architecture Data Center Strategy Security Risk Management Start-ups CRM See 20+     See less Finance Vulnerability Assessment Analysis Software Documentation Training Information Security Healthcare Information... Identity Management Identity Federation Encryption Information Security... Information Security... Public Speaking Educational Technology Internet Banking Risk Assessment Disaster Recovery Data Security Data Privacy Business Analysis Strategic Technology... Information Governance Team Building Project Management Cloud Security Enterprise Software Leadership Program Management Enterprise Architecture Data Center Strategy Security Risk Management Start-ups CRM See 20+     See less Honors & Awards ", "Experience Senior Manager Intel Corporation Senior Manager Intel Corporation Senior Manager Intel Corporation ", "Experience senior manager Intel Corporation senior manager Intel Corporation senior manager Intel Corporation ", "Summary Having careers with well-established Japanese and US corporations as Multinational Sales and Marketing, New business development activities in Hong Kong/China and Japan with Trilingual capabilities (English/Japanese/Chinese). Received over 8 recognitions for design wins and sales achievements, two times of “Exceeds Expectations” which is the second highest and received the highest “Outstanding” rating on 2013 on the annual focal in Intel. \n \n- 1st Tier Large Japanese and US corporation working experiences. \n- MNC sales and marketing, engineering design-win and design-in activities on electronics devices, semiconductor strategic planning. \n- Technical knowledge on hardware, software supports.  \n- Full skill sets on new business development in APAC and Japan regions. \n- Initiate and build strategies to drive the new projects from ground up to execution. \n- Succesfully closed a large first ever fuondry deal with public annoucement in July 2014. \n- Good at out-of-box thinking, foreseen the new coming trend for new business development.  \n- GPTW (Great Place To Work) core member to improve working environment. \n- Good sense of humor (I guess..) \n \nSkills: Trilingual skills (English, Japanese and Chinese) and understand the cultures very well. \n15y+ working experienced in US, APAC and Japanese. Summary Having careers with well-established Japanese and US corporations as Multinational Sales and Marketing, New business development activities in Hong Kong/China and Japan with Trilingual capabilities (English/Japanese/Chinese). Received over 8 recognitions for design wins and sales achievements, two times of “Exceeds Expectations” which is the second highest and received the highest “Outstanding” rating on 2013 on the annual focal in Intel. \n \n- 1st Tier Large Japanese and US corporation working experiences. \n- MNC sales and marketing, engineering design-win and design-in activities on electronics devices, semiconductor strategic planning. \n- Technical knowledge on hardware, software supports.  \n- Full skill sets on new business development in APAC and Japan regions. \n- Initiate and build strategies to drive the new projects from ground up to execution. \n- Succesfully closed a large first ever fuondry deal with public annoucement in July 2014. \n- Good at out-of-box thinking, foreseen the new coming trend for new business development.  \n- GPTW (Great Place To Work) core member to improve working environment. \n- Good sense of humor (I guess..) \n \nSkills: Trilingual skills (English, Japanese and Chinese) and understand the cultures very well. \n15y+ working experienced in US, APAC and Japanese. Having careers with well-established Japanese and US corporations as Multinational Sales and Marketing, New business development activities in Hong Kong/China and Japan with Trilingual capabilities (English/Japanese/Chinese). Received over 8 recognitions for design wins and sales achievements, two times of “Exceeds Expectations” which is the second highest and received the highest “Outstanding” rating on 2013 on the annual focal in Intel. \n \n- 1st Tier Large Japanese and US corporation working experiences. \n- MNC sales and marketing, engineering design-win and design-in activities on electronics devices, semiconductor strategic planning. \n- Technical knowledge on hardware, software supports.  \n- Full skill sets on new business development in APAC and Japan regions. \n- Initiate and build strategies to drive the new projects from ground up to execution. \n- Succesfully closed a large first ever fuondry deal with public annoucement in July 2014. \n- Good at out-of-box thinking, foreseen the new coming trend for new business development.  \n- GPTW (Great Place To Work) core member to improve working environment. \n- Good sense of humor (I guess..) \n \nSkills: Trilingual skills (English, Japanese and Chinese) and understand the cultures very well. \n15y+ working experienced in US, APAC and Japanese. Having careers with well-established Japanese and US corporations as Multinational Sales and Marketing, New business development activities in Hong Kong/China and Japan with Trilingual capabilities (English/Japanese/Chinese). Received over 8 recognitions for design wins and sales achievements, two times of “Exceeds Expectations” which is the second highest and received the highest “Outstanding” rating on 2013 on the annual focal in Intel. \n \n- 1st Tier Large Japanese and US corporation working experiences. \n- MNC sales and marketing, engineering design-win and design-in activities on electronics devices, semiconductor strategic planning. \n- Technical knowledge on hardware, software supports.  \n- Full skill sets on new business development in APAC and Japan regions. \n- Initiate and build strategies to drive the new projects from ground up to execution. \n- Succesfully closed a large first ever fuondry deal with public annoucement in July 2014. \n- Good at out-of-box thinking, foreseen the new coming trend for new business development.  \n- GPTW (Great Place To Work) core member to improve working environment. \n- Good sense of humor (I guess..) \n \nSkills: Trilingual skills (English, Japanese and Chinese) and understand the cultures very well. \n15y+ working experienced in US, APAC and Japanese. Experience Senior Manager Intel Corporation January 2014  – Present (1 year 8 months) Osaka, Japan Strategic initiative on new business such as Foundry, New device and anything is possible to increase company's value and revenue beyond traditional businesses. \n \nJust closed a big deal with one of the biggest Japanese brand company wtih public annoucement on July 2014. Sales Manager Intel Corporation April 2010  – Present (5 years 5 months) Senior Field Sales Engineer Intel Japan 2005  – Present (10 years) MNC account Manager Rohm Semiconductor 2000  –  2004  (4 years) Manage MNC Account teams for semiconductor design-win activities in HongKong China. Senior Manager Intel Corporation January 2014  – Present (1 year 8 months) Osaka, Japan Strategic initiative on new business such as Foundry, New device and anything is possible to increase company's value and revenue beyond traditional businesses. \n \nJust closed a big deal with one of the biggest Japanese brand company wtih public annoucement on July 2014. Senior Manager Intel Corporation January 2014  – Present (1 year 8 months) Osaka, Japan Strategic initiative on new business such as Foundry, New device and anything is possible to increase company's value and revenue beyond traditional businesses. \n \nJust closed a big deal with one of the biggest Japanese brand company wtih public annoucement on July 2014. Sales Manager Intel Corporation April 2010  – Present (5 years 5 months) Sales Manager Intel Corporation April 2010  – Present (5 years 5 months) Senior Field Sales Engineer Intel Japan 2005  – Present (10 years) Senior Field Sales Engineer Intel Japan 2005  – Present (10 years) MNC account Manager Rohm Semiconductor 2000  –  2004  (4 years) Manage MNC Account teams for semiconductor design-win activities in HongKong China. MNC account Manager Rohm Semiconductor 2000  –  2004  (4 years) Manage MNC Account teams for semiconductor design-win activities in HongKong China. Skills Semiconductors Electronics New Business Development Consumer Electronics Hardware Strategy Product Marketing Start-ups Management Semiconductor Industry Sales IC SoC Skills  Semiconductors Electronics New Business Development Consumer Electronics Hardware Strategy Product Marketing Start-ups Management Semiconductor Industry Sales IC SoC Semiconductors Electronics New Business Development Consumer Electronics Hardware Strategy Product Marketing Start-ups Management Semiconductor Industry Sales IC SoC Semiconductors Electronics New Business Development Consumer Electronics Hardware Strategy Product Marketing Start-ups Management Semiconductor Industry Sales IC SoC Education Oregon State University BS,  Chenical Engineering 1988  – 1993 Oregon State University BS,  Chenical Engineering 1988  – 1993 Oregon State University BS,  Chenical Engineering 1988  – 1993 Oregon State University BS,  Chenical Engineering 1988  – 1993 "]}