{"position": "Senior Technical Writer", "company": "IBM", "profiles": ["Skills FrameMaker Semiconductors Technical Documentation Single Sourcing Semiconductor Industry Microcontrollers Technical Writing Online Help XML Technical Communication Manuals Project Management Content Management Software Documentation Adobe Acrobat Technical Marketing Release Notes IC Digital Signal... Information Mapping Testing Program Management See 7+     See less Skills  FrameMaker Semiconductors Technical Documentation Single Sourcing Semiconductor Industry Microcontrollers Technical Writing Online Help XML Technical Communication Manuals Project Management Content Management Software Documentation Adobe Acrobat Technical Marketing Release Notes IC Digital Signal... Information Mapping Testing Program Management See 7+     See less FrameMaker Semiconductors Technical Documentation Single Sourcing Semiconductor Industry Microcontrollers Technical Writing Online Help XML Technical Communication Manuals Project Management Content Management Software Documentation Adobe Acrobat Technical Marketing Release Notes IC Digital Signal... Information Mapping Testing Program Management See 7+     See less FrameMaker Semiconductors Technical Documentation Single Sourcing Semiconductor Industry Microcontrollers Technical Writing Online Help XML Technical Communication Manuals Project Management Content Management Software Documentation Adobe Acrobat Technical Marketing Release Notes IC Digital Signal... Information Mapping Testing Program Management See 7+     See less ", "Skills Web Analytics Web Development Project Management Software Documentation Dreamweaver Email Marketing SEM Online Marketing CSS JavaScript Windows Agile Methodologies Management Cloud Computing Business Analysis Content Management Blogging WordPress Facebook Web Design E-commerce Digital Media Podcasting Social Media Marketing See 9+     See less Skills  Web Analytics Web Development Project Management Software Documentation Dreamweaver Email Marketing SEM Online Marketing CSS JavaScript Windows Agile Methodologies Management Cloud Computing Business Analysis Content Management Blogging WordPress Facebook Web Design E-commerce Digital Media Podcasting Social Media Marketing See 9+     See less Web Analytics Web Development Project Management Software Documentation Dreamweaver Email Marketing SEM Online Marketing CSS JavaScript Windows Agile Methodologies Management Cloud Computing Business Analysis Content Management Blogging WordPress Facebook Web Design E-commerce Digital Media Podcasting Social Media Marketing See 9+     See less Web Analytics Web Development Project Management Software Documentation Dreamweaver Email Marketing SEM Online Marketing CSS JavaScript Windows Agile Methodologies Management Cloud Computing Business Analysis Content Management Blogging WordPress Facebook Web Design E-commerce Digital Media Podcasting Social Media Marketing See 9+     See less ", "Summary Versatile, detail-oriented person with more than 14 years of experience writing highly technical software documentation, delivered in various content formats, for a wide range of users. Proficient using DITA and related tools to develop topic-based information and user interface help in an Agile software development environment. Energetic self-starter, with a real aptitude for building effective and productive working relationships with colleagues and customers. Summary Versatile, detail-oriented person with more than 14 years of experience writing highly technical software documentation, delivered in various content formats, for a wide range of users. Proficient using DITA and related tools to develop topic-based information and user interface help in an Agile software development environment. Energetic self-starter, with a real aptitude for building effective and productive working relationships with colleagues and customers. Versatile, detail-oriented person with more than 14 years of experience writing highly technical software documentation, delivered in various content formats, for a wide range of users. Proficient using DITA and related tools to develop topic-based information and user interface help in an Agile software development environment. Energetic self-starter, with a real aptitude for building effective and productive working relationships with colleagues and customers. Versatile, detail-oriented person with more than 14 years of experience writing highly technical software documentation, delivered in various content formats, for a wide range of users. Proficient using DITA and related tools to develop topic-based information and user interface help in an Agile software development environment. Energetic self-starter, with a real aptitude for building effective and productive working relationships with colleagues and customers. Experience Senior Technical Writer Splunk May 2015  – Present (4 months) San Francisco Bay Area Working on the Splunk Search language documentation. Senior Technical Writer IBM 2011  –  March 2015  (4 years) San Francisco Bay Area IBM Master Data Management Team \n \nExtensive experience developing different types of information including install and user guides, API (REST, Java, C++) and SQL references, online help, and developer guides by using ArborText and oXygen to create and deliver user content for system and database administrators, application developers, business analysts, and line of business users. \n \nDrove significant improvements to the user experience for a key product. Pushed for a cleaner, simpler look and feel for the UI for mobile environments. This improved UI was a key in securing a large sales win ($30+M) over a competitor.  \n \nCreated a detailed, cross product tutorial to help customers get up and running quickly. The tutorial was touted by the software architect as \"a key component of technical sales enablement.\" Singled out for recognition and an award by my development team for my work.  \n \nKey Technologies: \n- Application Development (REST API, SDK, online and in product help) \n- Data Governance (dashboards, stewardship UIs) Senior Technical Writer IBM 2008  –  2011  (3 years) San Francisco Bay Area IBM Informix Team \n \nWrote a comprehensive guide for the Informix Warehouse Accelerator, a product that exponentially accelerates even the most complex warehouse queries, without changing the business applications. The guide consisted of Overview, Installation, Configuration, Usage, Java class syntax, and Troubleshooting information.  \n \nWrote, recorded, and posted 2 demos on IBM developerWorks, which were \nviewed more than 450 times in the first week of being posted online. \n \nKey Technologies: \n- Informix Warehouse Accelerator (data warehousing / data marts/Java classes) \n \nVideo demos: \nhttp://www.ibm.com/developerworks/offers/lp/demos/summary/im-iwaexploreinterface.html \nhttp://www.ibm.com/developerworks/offers/lp/demos/summary/im-iwacreatedatamart.html Senior Technical Writer IBM 2003  –  2008  (5 years) San Francisco Bay Area IBM Mashup Hub / Apache Derby \n \nBecame the first IBM documentation committer for Apache Derby. Developed standards and guidelines for writing Derby documentation, spearheaded an index blitz, and initiated a process to identify more troubleshooting information.  \n \nKey Technologies \n- IBM Cloudscape (Apache Derby) \n- IBM InfoSphere MashupHub (enterprise content management) Team Lead and Technical Writer IBM 2000  –  2003  (3 years) San Jose, Silicon Valley Lab IBM Information Integration / Federation / DataJoiner \n \nLed a team of 4 technical writers in developing information consisting of hardcopy and softcopy manuals, topic/article-based online information, and online help associated with a UI. \n \nPiloted the rollout of a new contextual help format for IBM DB2, making substantive recommendations to the editors for improving and clarifying the template for the new format. \n \nKey Technologies \n- Middleware (Java API, C++ API) Software Instructor and Lead Instructor Productivity Point International 1993  –  1999  (6 years) San Antonio, Texas Extensive experience in formal classroom, instructor-led training on popular software applications.  \nCoordinated the day-to-day activities of 10 full-time and part-time instructors. Employee Defense Intelligence Agency 1984  –  1992  (8 years) Washington D.C. Metro Area Worked in several positions, advancing to GS-13. Senior representative for users at system and software design meetings, critical design reviews, and beta testing. Organized and chaired several long-standing user groups. Senior Technical Writer Splunk May 2015  – Present (4 months) San Francisco Bay Area Working on the Splunk Search language documentation. Senior Technical Writer Splunk May 2015  – Present (4 months) San Francisco Bay Area Working on the Splunk Search language documentation. Senior Technical Writer IBM 2011  –  March 2015  (4 years) San Francisco Bay Area IBM Master Data Management Team \n \nExtensive experience developing different types of information including install and user guides, API (REST, Java, C++) and SQL references, online help, and developer guides by using ArborText and oXygen to create and deliver user content for system and database administrators, application developers, business analysts, and line of business users. \n \nDrove significant improvements to the user experience for a key product. Pushed for a cleaner, simpler look and feel for the UI for mobile environments. This improved UI was a key in securing a large sales win ($30+M) over a competitor.  \n \nCreated a detailed, cross product tutorial to help customers get up and running quickly. The tutorial was touted by the software architect as \"a key component of technical sales enablement.\" Singled out for recognition and an award by my development team for my work.  \n \nKey Technologies: \n- Application Development (REST API, SDK, online and in product help) \n- Data Governance (dashboards, stewardship UIs) Senior Technical Writer IBM 2011  –  March 2015  (4 years) San Francisco Bay Area IBM Master Data Management Team \n \nExtensive experience developing different types of information including install and user guides, API (REST, Java, C++) and SQL references, online help, and developer guides by using ArborText and oXygen to create and deliver user content for system and database administrators, application developers, business analysts, and line of business users. \n \nDrove significant improvements to the user experience for a key product. Pushed for a cleaner, simpler look and feel for the UI for mobile environments. This improved UI was a key in securing a large sales win ($30+M) over a competitor.  \n \nCreated a detailed, cross product tutorial to help customers get up and running quickly. The tutorial was touted by the software architect as \"a key component of technical sales enablement.\" Singled out for recognition and an award by my development team for my work.  \n \nKey Technologies: \n- Application Development (REST API, SDK, online and in product help) \n- Data Governance (dashboards, stewardship UIs) Senior Technical Writer IBM 2008  –  2011  (3 years) San Francisco Bay Area IBM Informix Team \n \nWrote a comprehensive guide for the Informix Warehouse Accelerator, a product that exponentially accelerates even the most complex warehouse queries, without changing the business applications. The guide consisted of Overview, Installation, Configuration, Usage, Java class syntax, and Troubleshooting information.  \n \nWrote, recorded, and posted 2 demos on IBM developerWorks, which were \nviewed more than 450 times in the first week of being posted online. \n \nKey Technologies: \n- Informix Warehouse Accelerator (data warehousing / data marts/Java classes) \n \nVideo demos: \nhttp://www.ibm.com/developerworks/offers/lp/demos/summary/im-iwaexploreinterface.html \nhttp://www.ibm.com/developerworks/offers/lp/demos/summary/im-iwacreatedatamart.html Senior Technical Writer IBM 2008  –  2011  (3 years) San Francisco Bay Area IBM Informix Team \n \nWrote a comprehensive guide for the Informix Warehouse Accelerator, a product that exponentially accelerates even the most complex warehouse queries, without changing the business applications. The guide consisted of Overview, Installation, Configuration, Usage, Java class syntax, and Troubleshooting information.  \n \nWrote, recorded, and posted 2 demos on IBM developerWorks, which were \nviewed more than 450 times in the first week of being posted online. \n \nKey Technologies: \n- Informix Warehouse Accelerator (data warehousing / data marts/Java classes) \n \nVideo demos: \nhttp://www.ibm.com/developerworks/offers/lp/demos/summary/im-iwaexploreinterface.html \nhttp://www.ibm.com/developerworks/offers/lp/demos/summary/im-iwacreatedatamart.html Senior Technical Writer IBM 2003  –  2008  (5 years) San Francisco Bay Area IBM Mashup Hub / Apache Derby \n \nBecame the first IBM documentation committer for Apache Derby. Developed standards and guidelines for writing Derby documentation, spearheaded an index blitz, and initiated a process to identify more troubleshooting information.  \n \nKey Technologies \n- IBM Cloudscape (Apache Derby) \n- IBM InfoSphere MashupHub (enterprise content management) Senior Technical Writer IBM 2003  –  2008  (5 years) San Francisco Bay Area IBM Mashup Hub / Apache Derby \n \nBecame the first IBM documentation committer for Apache Derby. Developed standards and guidelines for writing Derby documentation, spearheaded an index blitz, and initiated a process to identify more troubleshooting information.  \n \nKey Technologies \n- IBM Cloudscape (Apache Derby) \n- IBM InfoSphere MashupHub (enterprise content management) Team Lead and Technical Writer IBM 2000  –  2003  (3 years) San Jose, Silicon Valley Lab IBM Information Integration / Federation / DataJoiner \n \nLed a team of 4 technical writers in developing information consisting of hardcopy and softcopy manuals, topic/article-based online information, and online help associated with a UI. \n \nPiloted the rollout of a new contextual help format for IBM DB2, making substantive recommendations to the editors for improving and clarifying the template for the new format. \n \nKey Technologies \n- Middleware (Java API, C++ API) Team Lead and Technical Writer IBM 2000  –  2003  (3 years) San Jose, Silicon Valley Lab IBM Information Integration / Federation / DataJoiner \n \nLed a team of 4 technical writers in developing information consisting of hardcopy and softcopy manuals, topic/article-based online information, and online help associated with a UI. \n \nPiloted the rollout of a new contextual help format for IBM DB2, making substantive recommendations to the editors for improving and clarifying the template for the new format. \n \nKey Technologies \n- Middleware (Java API, C++ API) Software Instructor and Lead Instructor Productivity Point International 1993  –  1999  (6 years) San Antonio, Texas Extensive experience in formal classroom, instructor-led training on popular software applications.  \nCoordinated the day-to-day activities of 10 full-time and part-time instructors. Software Instructor and Lead Instructor Productivity Point International 1993  –  1999  (6 years) San Antonio, Texas Extensive experience in formal classroom, instructor-led training on popular software applications.  \nCoordinated the day-to-day activities of 10 full-time and part-time instructors. Employee Defense Intelligence Agency 1984  –  1992  (8 years) Washington D.C. Metro Area Worked in several positions, advancing to GS-13. Senior representative for users at system and software design meetings, critical design reviews, and beta testing. Organized and chaired several long-standing user groups. Employee Defense Intelligence Agency 1984  –  1992  (8 years) Washington D.C. Metro Area Worked in several positions, advancing to GS-13. Senior representative for users at system and software design meetings, critical design reviews, and beta testing. Organized and chaired several long-standing user groups. Languages Spanish Spanish Spanish Skills Agile Methodologies Software Documentation DITA XML Project Management User Interface Design Usability Testing Requirements Analysis Enterprise Software Oxygen XML Editor Arbortext Epic Editor Customer Feedback... Technical Writing Camtasia Visio Inkscape XML HTML Unix Microsoft Project Microsoft Excel Apache Derby Master Data Management Courseware Development Software Instruction Software Development Integration Source Control Systems Perforce SQL IBM DB2 APIs DB2 See 17+     See less Skills  Agile Methodologies Software Documentation DITA XML Project Management User Interface Design Usability Testing Requirements Analysis Enterprise Software Oxygen XML Editor Arbortext Epic Editor Customer Feedback... Technical Writing Camtasia Visio Inkscape XML HTML Unix Microsoft Project Microsoft Excel Apache Derby Master Data Management Courseware Development Software Instruction Software Development Integration Source Control Systems Perforce SQL IBM DB2 APIs DB2 See 17+     See less Agile Methodologies Software Documentation DITA XML Project Management User Interface Design Usability Testing Requirements Analysis Enterprise Software Oxygen XML Editor Arbortext Epic Editor Customer Feedback... Technical Writing Camtasia Visio Inkscape XML HTML Unix Microsoft Project Microsoft Excel Apache Derby Master Data Management Courseware Development Software Instruction Software Development Integration Source Control Systems Perforce SQL IBM DB2 APIs DB2 See 17+     See less Agile Methodologies Software Documentation DITA XML Project Management User Interface Design Usability Testing Requirements Analysis Enterprise Software Oxygen XML Editor Arbortext Epic Editor Customer Feedback... Technical Writing Camtasia Visio Inkscape XML HTML Unix Microsoft Project Microsoft Excel Apache Derby Master Data Management Courseware Development Software Instruction Software Development Integration Source Control Systems Perforce SQL IBM DB2 APIs DB2 See 17+     See less Education Sewanee-The University of the South Bachelor of Arts (B.A.), Economics,  Econmics / Computer Science Sewanee-The University of the South Bachelor of Arts (B.A.), Economics,  Econmics / Computer Science Sewanee-The University of the South Bachelor of Arts (B.A.), Economics,  Econmics / Computer Science Sewanee-The University of the South Bachelor of Arts (B.A.), Economics,  Econmics / Computer Science Honors & Awards Eminence and Excellence Award: Put the Client First IBM 2014: Instrumental in developing a user interface that generated 30+ million in revenue from a single client. The Senior Technical Staff Member (STSM) and Software Architect submitted me for this award.  \n \n Defense Intelligence Agency Director's Award DIA 1989: For my work at the Pentagon for Operation Just Cause, the incursion into Panama. Eminence and Excellence Award: Put the Client First IBM 2014: Instrumental in developing a user interface that generated 30+ million in revenue from a single client. The Senior Technical Staff Member (STSM) and Software Architect submitted me for this award.  \n \n Eminence and Excellence Award: Put the Client First IBM 2014: Instrumental in developing a user interface that generated 30+ million in revenue from a single client. The Senior Technical Staff Member (STSM) and Software Architect submitted me for this award.  \n \n Eminence and Excellence Award: Put the Client First IBM 2014: Instrumental in developing a user interface that generated 30+ million in revenue from a single client. The Senior Technical Staff Member (STSM) and Software Architect submitted me for this award.  \n \n Defense Intelligence Agency Director's Award DIA 1989: For my work at the Pentagon for Operation Just Cause, the incursion into Panama. Defense Intelligence Agency Director's Award DIA 1989: For my work at the Pentagon for Operation Just Cause, the incursion into Panama. Defense Intelligence Agency Director's Award DIA 1989: For my work at the Pentagon for Operation Just Cause, the incursion into Panama. ", "Summary PROFILE \n \nWell-rounded Informatics Specialist with fifteen years of solid experience providing a broad range of information technology and business solutions to a diverse group of private and public sectors clients. \nSecurity Clearance Information: Secret – Level II  \n \nSPECIAL SKILLS \n \n• Business Analysis and Project Administration \n• Proposal Development and Technical Documentation \n• IT Security Policy and Procedural Development \n \nSpecialties:  \n \n• Business Analysis and Project Administration \n• Proposal Development and Technical Documentation \n• IT Security Policy and Procedural Development Summary PROFILE \n \nWell-rounded Informatics Specialist with fifteen years of solid experience providing a broad range of information technology and business solutions to a diverse group of private and public sectors clients. \nSecurity Clearance Information: Secret – Level II  \n \nSPECIAL SKILLS \n \n• Business Analysis and Project Administration \n• Proposal Development and Technical Documentation \n• IT Security Policy and Procedural Development \n \nSpecialties:  \n \n• Business Analysis and Project Administration \n• Proposal Development and Technical Documentation \n• IT Security Policy and Procedural Development PROFILE \n \nWell-rounded Informatics Specialist with fifteen years of solid experience providing a broad range of information technology and business solutions to a diverse group of private and public sectors clients. \nSecurity Clearance Information: Secret – Level II  \n \nSPECIAL SKILLS \n \n• Business Analysis and Project Administration \n• Proposal Development and Technical Documentation \n• IT Security Policy and Procedural Development \n \nSpecialties:  \n \n• Business Analysis and Project Administration \n• Proposal Development and Technical Documentation \n• IT Security Policy and Procedural Development PROFILE \n \nWell-rounded Informatics Specialist with fifteen years of solid experience providing a broad range of information technology and business solutions to a diverse group of private and public sectors clients. \nSecurity Clearance Information: Secret – Level II  \n \nSPECIAL SKILLS \n \n• Business Analysis and Project Administration \n• Proposal Development and Technical Documentation \n• IT Security Policy and Procedural Development \n \nSpecialties:  \n \n• Business Analysis and Project Administration \n• Proposal Development and Technical Documentation \n• IT Security Policy and Procedural Development Experience Senior Technical Writer Industry Canada February 2013  – Present (2 years 7 months) Ottawa, Canada Area Senior Technical Writer at Industry Canada (IC). \n \nMember of the Chief Information Office and the Distributed Platform Management (DPM) Group. \n \nDesktop Software Renewal (DSR) Project involving Windows 7 Professional & Enterprise Prototypes. \n \nDeveloped the Installation Guide and User Manual for the Industry Canada (IC) Windows 7 Professional & Enterprise Prototypes. \n \nDrafted the DSR Technical Engineering technical configuration standards. \n \nDeveloped process maps and illustrations in preparation of the Technical Readiness Toolkit. \n \nCreated and maintained the Desktop Software Renewal Technical Readiness website within the Atlassian Confluence Enterprise Wiki. Senior Technical Writer Human Resources Skills Development Canada (HRSDC) January 2012  – Present (3 years 8 months) Senior Technical writer within the HRSDC Transformation Alignment Office (TAO) for the Enabling Services Renewal Program (ESRP). \n \nDeveloped Service Delivery & Integration (SDI) Project Charter and ESRP LEAD Enterprise Architectural training reference material. \n \nSenior Technical writer within the HRSDC IT development group for the Homeless Individuals and Family Information System (HIFIS) application. \n \nProvided Quality Assurance (QA) on various technical manuals (i.e. Front Desk, Administration, Reference manuals, Developer and Style guides). \n \nCreated an internal HIFIS knowledge website by converting the Front Desk reference manual, Administration manual, Reports manual and the Developer and Style guides into MS HTML Help, Flash Help, and WebHelp by using Adobe RoboHelp 7 authoring software. Senior Technical Writer Canadian Heritage June 2011  –  November 2011  (6 months) Hull, QC Senior Technical writer for Canadian Heritage – IT Client Services. \n \nDeveloped eSubmission user guide for the Movable Cultural Property (MCP) program. \n \nConverted eSubmission MCP user guide material into WebHelp format using Adobe RoboHelp 7. \n \nRevised various MCP Grants and Contributions guidelines and developed text for web pages. Business Analyst IBM Global Services September 2008  –  November 2010  (2 years 3 months) Business Analyst for IBM’s Revised Payment System for Reserves (RPSR) project. \n \nAnalyzed DND’s business requirements, business rules & RPSR migration details. \n \nDrafted Impact Assessments and requirements documentation for acceptance by DND. \n \nCommunicated functional requirements to the IBM CI test group and liased with the IBM Development team, Senior DBA and Technical Archtitect in understanding technical specifications. \n \nManaged business requirements and performed business rules traceability using IBM Rational Requisite Pro application. \n \nDeveloped IBM Data Privacy and Security policies, procedures and forms specific to RPSR military pay system project. \n \nMember of IBM's Software Engineering Process Group. Assisted with the Productivity & Process Quality Assurance (PPQA) area for Capability Maturity Model for IT (CMMi). Senior Technical Writer IBM Canada July 2007  –  September 2008  (1 year 3 months) Senior Technical writer for IBM’s Revised Payment System for Reserves (RPSR). \n \nMaintained the DND User Guide and IBM Technical Guides using RoboHelp X5. \n \nGenerated both user and technical guides into Flash and WebHelp formats. Senior Technical Writer ILS Canada May 2005  –  June 2007  (2 years 2 months) Senior Technical writer for Independent Learning Systems (ILS). \n \nDeveloped business specifications document for Nissan Canada Incorporated. \n \nResearched business processes pertaining to Added Security Plan application. \n \nDrafted functional design document for ILS – BOMT web application. Security Technical Documentation Bell Nexxia 2003  –  2003  (less than a year) IT Security Technical Documentation Technical Writer EDS / SHL System House 1999  –  1999  (less than a year) Senior Technical Writer Industry Canada February 2013  – Present (2 years 7 months) Ottawa, Canada Area Senior Technical Writer at Industry Canada (IC). \n \nMember of the Chief Information Office and the Distributed Platform Management (DPM) Group. \n \nDesktop Software Renewal (DSR) Project involving Windows 7 Professional & Enterprise Prototypes. \n \nDeveloped the Installation Guide and User Manual for the Industry Canada (IC) Windows 7 Professional & Enterprise Prototypes. \n \nDrafted the DSR Technical Engineering technical configuration standards. \n \nDeveloped process maps and illustrations in preparation of the Technical Readiness Toolkit. \n \nCreated and maintained the Desktop Software Renewal Technical Readiness website within the Atlassian Confluence Enterprise Wiki. Senior Technical Writer Industry Canada February 2013  – Present (2 years 7 months) Ottawa, Canada Area Senior Technical Writer at Industry Canada (IC). \n \nMember of the Chief Information Office and the Distributed Platform Management (DPM) Group. \n \nDesktop Software Renewal (DSR) Project involving Windows 7 Professional & Enterprise Prototypes. \n \nDeveloped the Installation Guide and User Manual for the Industry Canada (IC) Windows 7 Professional & Enterprise Prototypes. \n \nDrafted the DSR Technical Engineering technical configuration standards. \n \nDeveloped process maps and illustrations in preparation of the Technical Readiness Toolkit. \n \nCreated and maintained the Desktop Software Renewal Technical Readiness website within the Atlassian Confluence Enterprise Wiki. Senior Technical Writer Human Resources Skills Development Canada (HRSDC) January 2012  – Present (3 years 8 months) Senior Technical writer within the HRSDC Transformation Alignment Office (TAO) for the Enabling Services Renewal Program (ESRP). \n \nDeveloped Service Delivery & Integration (SDI) Project Charter and ESRP LEAD Enterprise Architectural training reference material. \n \nSenior Technical writer within the HRSDC IT development group for the Homeless Individuals and Family Information System (HIFIS) application. \n \nProvided Quality Assurance (QA) on various technical manuals (i.e. Front Desk, Administration, Reference manuals, Developer and Style guides). \n \nCreated an internal HIFIS knowledge website by converting the Front Desk reference manual, Administration manual, Reports manual and the Developer and Style guides into MS HTML Help, Flash Help, and WebHelp by using Adobe RoboHelp 7 authoring software. Senior Technical Writer Human Resources Skills Development Canada (HRSDC) January 2012  – Present (3 years 8 months) Senior Technical writer within the HRSDC Transformation Alignment Office (TAO) for the Enabling Services Renewal Program (ESRP). \n \nDeveloped Service Delivery & Integration (SDI) Project Charter and ESRP LEAD Enterprise Architectural training reference material. \n \nSenior Technical writer within the HRSDC IT development group for the Homeless Individuals and Family Information System (HIFIS) application. \n \nProvided Quality Assurance (QA) on various technical manuals (i.e. Front Desk, Administration, Reference manuals, Developer and Style guides). \n \nCreated an internal HIFIS knowledge website by converting the Front Desk reference manual, Administration manual, Reports manual and the Developer and Style guides into MS HTML Help, Flash Help, and WebHelp by using Adobe RoboHelp 7 authoring software. Senior Technical Writer Canadian Heritage June 2011  –  November 2011  (6 months) Hull, QC Senior Technical writer for Canadian Heritage – IT Client Services. \n \nDeveloped eSubmission user guide for the Movable Cultural Property (MCP) program. \n \nConverted eSubmission MCP user guide material into WebHelp format using Adobe RoboHelp 7. \n \nRevised various MCP Grants and Contributions guidelines and developed text for web pages. Senior Technical Writer Canadian Heritage June 2011  –  November 2011  (6 months) Hull, QC Senior Technical writer for Canadian Heritage – IT Client Services. \n \nDeveloped eSubmission user guide for the Movable Cultural Property (MCP) program. \n \nConverted eSubmission MCP user guide material into WebHelp format using Adobe RoboHelp 7. \n \nRevised various MCP Grants and Contributions guidelines and developed text for web pages. Business Analyst IBM Global Services September 2008  –  November 2010  (2 years 3 months) Business Analyst for IBM’s Revised Payment System for Reserves (RPSR) project. \n \nAnalyzed DND’s business requirements, business rules & RPSR migration details. \n \nDrafted Impact Assessments and requirements documentation for acceptance by DND. \n \nCommunicated functional requirements to the IBM CI test group and liased with the IBM Development team, Senior DBA and Technical Archtitect in understanding technical specifications. \n \nManaged business requirements and performed business rules traceability using IBM Rational Requisite Pro application. \n \nDeveloped IBM Data Privacy and Security policies, procedures and forms specific to RPSR military pay system project. \n \nMember of IBM's Software Engineering Process Group. Assisted with the Productivity & Process Quality Assurance (PPQA) area for Capability Maturity Model for IT (CMMi). Business Analyst IBM Global Services September 2008  –  November 2010  (2 years 3 months) Business Analyst for IBM’s Revised Payment System for Reserves (RPSR) project. \n \nAnalyzed DND’s business requirements, business rules & RPSR migration details. \n \nDrafted Impact Assessments and requirements documentation for acceptance by DND. \n \nCommunicated functional requirements to the IBM CI test group and liased with the IBM Development team, Senior DBA and Technical Archtitect in understanding technical specifications. \n \nManaged business requirements and performed business rules traceability using IBM Rational Requisite Pro application. \n \nDeveloped IBM Data Privacy and Security policies, procedures and forms specific to RPSR military pay system project. \n \nMember of IBM's Software Engineering Process Group. Assisted with the Productivity & Process Quality Assurance (PPQA) area for Capability Maturity Model for IT (CMMi). Senior Technical Writer IBM Canada July 2007  –  September 2008  (1 year 3 months) Senior Technical writer for IBM’s Revised Payment System for Reserves (RPSR). \n \nMaintained the DND User Guide and IBM Technical Guides using RoboHelp X5. \n \nGenerated both user and technical guides into Flash and WebHelp formats. Senior Technical Writer IBM Canada July 2007  –  September 2008  (1 year 3 months) Senior Technical writer for IBM’s Revised Payment System for Reserves (RPSR). \n \nMaintained the DND User Guide and IBM Technical Guides using RoboHelp X5. \n \nGenerated both user and technical guides into Flash and WebHelp formats. Senior Technical Writer ILS Canada May 2005  –  June 2007  (2 years 2 months) Senior Technical writer for Independent Learning Systems (ILS). \n \nDeveloped business specifications document for Nissan Canada Incorporated. \n \nResearched business processes pertaining to Added Security Plan application. \n \nDrafted functional design document for ILS – BOMT web application. Senior Technical Writer ILS Canada May 2005  –  June 2007  (2 years 2 months) Senior Technical writer for Independent Learning Systems (ILS). \n \nDeveloped business specifications document for Nissan Canada Incorporated. \n \nResearched business processes pertaining to Added Security Plan application. \n \nDrafted functional design document for ILS – BOMT web application. Security Technical Documentation Bell Nexxia 2003  –  2003  (less than a year) IT Security Technical Documentation Security Technical Documentation Bell Nexxia 2003  –  2003  (less than a year) IT Security Technical Documentation Technical Writer EDS / SHL System House 1999  –  1999  (less than a year) Technical Writer EDS / SHL System House 1999  –  1999  (less than a year) Skills Business Requirements Technical Writing Documentation Requirements Gathering Visio Requirements Analysis Analysis Business Analysis MS Project SharePoint Writing Microsoft Office Government Editing Research Requirements Management Software Documentation Business Process Technical Documentation Project Management See 5+     See less Skills  Business Requirements Technical Writing Documentation Requirements Gathering Visio Requirements Analysis Analysis Business Analysis MS Project SharePoint Writing Microsoft Office Government Editing Research Requirements Management Software Documentation Business Process Technical Documentation Project Management See 5+     See less Business Requirements Technical Writing Documentation Requirements Gathering Visio Requirements Analysis Analysis Business Analysis MS Project SharePoint Writing Microsoft Office Government Editing Research Requirements Management Software Documentation Business Process Technical Documentation Project Management See 5+     See less Business Requirements Technical Writing Documentation Requirements Gathering Visio Requirements Analysis Analysis Business Analysis MS Project SharePoint Writing Microsoft Office Government Editing Research Requirements Management Software Documentation Business Process Technical Documentation Project Management See 5+     See less Education Algonquin College of Applied Arts and Technology Diploma,  Information Systems Security Post Graduate Diploma - Algonquin College 1998  – 2000 University of Ottawa Business,  Business Administration 1986  – 1988 Business Administration Diploma - University of Ottawa, 1986 - 1988 York University Bachelor of Arts,  Psycology and Business Administration 1981  – 1984 IBM Rational RequisiteWeb (v7) and RequisitePro (v 2003, 7.1) - 2007 \n \nIBM Global Services - Capability Maturity Model (IT) – CMMi - 2007 \n \nIBM Global Services – Rational / UML - 2003 \n \nProject Management Book of Knowledge (PMBOK) - 2002 \n \nComputer Science Corporation (CSC) – Catalyst training (Project Management) - 2001 \n \nGraduate - Information Systems Security Program (I.S.S.) \nAlgonquin College, 1998 - 2000 \n \nMasters Certificate, Oracle Database Administration v7.5 - Learnix Training, 1998 \n \nLotus Notes v 4.5 Basic & Advanced Training - PBSC Training Centre, 1997 \n \nNovell v 3.12, Win NT v 3.51, Unix, HTML \nCertified Novell Administrator (C.N.A.) v 3.12 - Praxis Training Institute, 1995 \n \nNovell Netware v 3.12 - Algonquin College, 1991 – 1992 \n \nBusiness Management Studies Certificate - Algonquin College, 1991 - 1992 \n \nBusiness Administration Diploma - University of Ottawa, 1986 - 1988 \n \nBachelor of Arts (BA), Psychology & Business - York University, 1982 – 1984 Algonquin College of Applied Arts and Technology Diploma,  Information Systems Security Post Graduate Diploma - Algonquin College 1998  – 2000 Algonquin College of Applied Arts and Technology Diploma,  Information Systems Security Post Graduate Diploma - Algonquin College 1998  – 2000 Algonquin College of Applied Arts and Technology Diploma,  Information Systems Security Post Graduate Diploma - Algonquin College 1998  – 2000 University of Ottawa Business,  Business Administration 1986  – 1988 Business Administration Diploma - University of Ottawa, 1986 - 1988 University of Ottawa Business,  Business Administration 1986  – 1988 Business Administration Diploma - University of Ottawa, 1986 - 1988 University of Ottawa Business,  Business Administration 1986  – 1988 Business Administration Diploma - University of Ottawa, 1986 - 1988 York University Bachelor of Arts,  Psycology and Business Administration 1981  – 1984 IBM Rational RequisiteWeb (v7) and RequisitePro (v 2003, 7.1) - 2007 \n \nIBM Global Services - Capability Maturity Model (IT) – CMMi - 2007 \n \nIBM Global Services – Rational / UML - 2003 \n \nProject Management Book of Knowledge (PMBOK) - 2002 \n \nComputer Science Corporation (CSC) – Catalyst training (Project Management) - 2001 \n \nGraduate - Information Systems Security Program (I.S.S.) \nAlgonquin College, 1998 - 2000 \n \nMasters Certificate, Oracle Database Administration v7.5 - Learnix Training, 1998 \n \nLotus Notes v 4.5 Basic & Advanced Training - PBSC Training Centre, 1997 \n \nNovell v 3.12, Win NT v 3.51, Unix, HTML \nCertified Novell Administrator (C.N.A.) v 3.12 - Praxis Training Institute, 1995 \n \nNovell Netware v 3.12 - Algonquin College, 1991 – 1992 \n \nBusiness Management Studies Certificate - Algonquin College, 1991 - 1992 \n \nBusiness Administration Diploma - University of Ottawa, 1986 - 1988 \n \nBachelor of Arts (BA), Psychology & Business - York University, 1982 – 1984 York University Bachelor of Arts,  Psycology and Business Administration 1981  – 1984 IBM Rational RequisiteWeb (v7) and RequisitePro (v 2003, 7.1) - 2007 \n \nIBM Global Services - Capability Maturity Model (IT) – CMMi - 2007 \n \nIBM Global Services – Rational / UML - 2003 \n \nProject Management Book of Knowledge (PMBOK) - 2002 \n \nComputer Science Corporation (CSC) – Catalyst training (Project Management) - 2001 \n \nGraduate - Information Systems Security Program (I.S.S.) \nAlgonquin College, 1998 - 2000 \n \nMasters Certificate, Oracle Database Administration v7.5 - Learnix Training, 1998 \n \nLotus Notes v 4.5 Basic & Advanced Training - PBSC Training Centre, 1997 \n \nNovell v 3.12, Win NT v 3.51, Unix, HTML \nCertified Novell Administrator (C.N.A.) v 3.12 - Praxis Training Institute, 1995 \n \nNovell Netware v 3.12 - Algonquin College, 1991 – 1992 \n \nBusiness Management Studies Certificate - Algonquin College, 1991 - 1992 \n \nBusiness Administration Diploma - University of Ottawa, 1986 - 1988 \n \nBachelor of Arts (BA), Psychology & Business - York University, 1982 – 1984 York University Bachelor of Arts,  Psycology and Business Administration 1981  – 1984 IBM Rational RequisiteWeb (v7) and RequisitePro (v 2003, 7.1) - 2007 \n \nIBM Global Services - Capability Maturity Model (IT) – CMMi - 2007 \n \nIBM Global Services – Rational / UML - 2003 \n \nProject Management Book of Knowledge (PMBOK) - 2002 \n \nComputer Science Corporation (CSC) – Catalyst training (Project Management) - 2001 \n \nGraduate - Information Systems Security Program (I.S.S.) \nAlgonquin College, 1998 - 2000 \n \nMasters Certificate, Oracle Database Administration v7.5 - Learnix Training, 1998 \n \nLotus Notes v 4.5 Basic & Advanced Training - PBSC Training Centre, 1997 \n \nNovell v 3.12, Win NT v 3.51, Unix, HTML \nCertified Novell Administrator (C.N.A.) v 3.12 - Praxis Training Institute, 1995 \n \nNovell Netware v 3.12 - Algonquin College, 1991 – 1992 \n \nBusiness Management Studies Certificate - Algonquin College, 1991 - 1992 \n \nBusiness Administration Diploma - University of Ottawa, 1986 - 1988 \n \nBachelor of Arts (BA), Psychology & Business - York University, 1982 – 1984 ", "Experience Senior Technical Writer IBM September 2011  – Present (4 years) Denver, CO Owner Krona Communications, LLC October 2010  – Present (4 years 11 months) writing / editing / public relations / strategy \n \nwww.kronacommunications.com Corporate Communications Manager Quiznos March 2006  –  October 2010  (4 years 8 months) Federal Grants Management Training Course Developer Management Concepts July 2003  –  March 2006  (2 years 9 months) Counselor/Educator Community Systems, Inc. July 2002  –  July 2003  (1 year 1 month) Senior Technical Writer IBM September 2011  – Present (4 years) Denver, CO Senior Technical Writer IBM September 2011  – Present (4 years) Denver, CO Owner Krona Communications, LLC October 2010  – Present (4 years 11 months) writing / editing / public relations / strategy \n \nwww.kronacommunications.com Owner Krona Communications, LLC October 2010  – Present (4 years 11 months) writing / editing / public relations / strategy \n \nwww.kronacommunications.com Corporate Communications Manager Quiznos March 2006  –  October 2010  (4 years 8 months) Corporate Communications Manager Quiznos March 2006  –  October 2010  (4 years 8 months) Federal Grants Management Training Course Developer Management Concepts July 2003  –  March 2006  (2 years 9 months) Federal Grants Management Training Course Developer Management Concepts July 2003  –  March 2006  (2 years 9 months) Counselor/Educator Community Systems, Inc. July 2002  –  July 2003  (1 year 1 month) Counselor/Educator Community Systems, Inc. July 2002  –  July 2003  (1 year 1 month) Languages French (intermediate) French (intermediate) French (intermediate) Skills Editing Writing Social Media Social Media Marketing Marketing Communications Copy Editing Copywriting Training Blogging Creative Writing Proofreading Newsletters Content Management Media Relations Email Marketing Corporate Communications Press Releases Strategic Communications Public Relations Web Content Management Content Strategy See 6+     See less Skills  Editing Writing Social Media Social Media Marketing Marketing Communications Copy Editing Copywriting Training Blogging Creative Writing Proofreading Newsletters Content Management Media Relations Email Marketing Corporate Communications Press Releases Strategic Communications Public Relations Web Content Management Content Strategy See 6+     See less Editing Writing Social Media Social Media Marketing Marketing Communications Copy Editing Copywriting Training Blogging Creative Writing Proofreading Newsletters Content Management Media Relations Email Marketing Corporate Communications Press Releases Strategic Communications Public Relations Web Content Management Content Strategy See 6+     See less Editing Writing Social Media Social Media Marketing Marketing Communications Copy Editing Copywriting Training Blogging Creative Writing Proofreading Newsletters Content Management Media Relations Email Marketing Corporate Communications Press Releases Strategic Communications Public Relations Web Content Management Content Strategy See 6+     See less Education George Mason University MA,  English 2002  – 2004 James Madison University BA,  English , Communications 1997  – 2001 Activities and Societies:  Delta Delta Delta ,  Study abroad London ,  Omicron Delta Kappa ,  Sigma Tau Delta ,  Golden Key ,  National Society of Collegiate Scholars George Mason University MA,  English 2002  – 2004 George Mason University MA,  English 2002  – 2004 George Mason University MA,  English 2002  – 2004 James Madison University BA,  English , Communications 1997  – 2001 Activities and Societies:  Delta Delta Delta ,  Study abroad London ,  Omicron Delta Kappa ,  Sigma Tau Delta ,  Golden Key ,  National Society of Collegiate Scholars James Madison University BA,  English , Communications 1997  – 2001 Activities and Societies:  Delta Delta Delta ,  Study abroad London ,  Omicron Delta Kappa ,  Sigma Tau Delta ,  Golden Key ,  National Society of Collegiate Scholars James Madison University BA,  English , Communications 1997  – 2001 Activities and Societies:  Delta Delta Delta ,  Study abroad London ,  Omicron Delta Kappa ,  Sigma Tau Delta ,  Golden Key ,  National Society of Collegiate Scholars ", "Skills SharePoint Project Management Visio Manuals Technical Communication Software Documentation Technical Documentation FrameMaker Technical Writing Marketing RFP Graphics SnagIt Adobe Acrobat Vendor Management HTML Information Architecture Telecommunications Program Management Unix Cross-functional Team... RoboHelp DITA Leadership Strategy Management Training Content Management See 13+     See less Skills  SharePoint Project Management Visio Manuals Technical Communication Software Documentation Technical Documentation FrameMaker Technical Writing Marketing RFP Graphics SnagIt Adobe Acrobat Vendor Management HTML Information Architecture Telecommunications Program Management Unix Cross-functional Team... RoboHelp DITA Leadership Strategy Management Training Content Management See 13+     See less SharePoint Project Management Visio Manuals Technical Communication Software Documentation Technical Documentation FrameMaker Technical Writing Marketing RFP Graphics SnagIt Adobe Acrobat Vendor Management HTML Information Architecture Telecommunications Program Management Unix Cross-functional Team... RoboHelp DITA Leadership Strategy Management Training Content Management See 13+     See less SharePoint Project Management Visio Manuals Technical Communication Software Documentation Technical Documentation FrameMaker Technical Writing Marketing RFP Graphics SnagIt Adobe Acrobat Vendor Management HTML Information Architecture Telecommunications Program Management Unix Cross-functional Team... RoboHelp DITA Leadership Strategy Management Training Content Management See 13+     See less ", "Experience Senior Technical Writer IBM Senior Technical Writer IBM Senior Technical Writer IBM ", "Experience Vice President, Oracle Database Documentation Cloud Oracle USA 1993  – Present (22 years) San Francisco Bay Area Vice President, Oracle Database Documentation Cloud Oracle USA 1993  – Present (22 years) San Francisco Bay Area Vice President, Oracle Database Documentation Cloud Oracle USA 1993  – Present (22 years) San Francisco Bay Area Languages English Native or bilingual proficiency French Limited working proficiency Italian Limited working proficiency English Native or bilingual proficiency French Limited working proficiency Italian Limited working proficiency English Native or bilingual proficiency French Limited working proficiency Italian Limited working proficiency Native or bilingual proficiency Limited working proficiency Limited working proficiency Skills Software Documentation FrameMaker DITA Online Help Single Sourcing Technical Documentation Technical Writing Content Management Oracle Technical Communication Agile Methodologies Databases Information Architecture Structured Authoring Strategic Leadership XML SDL LiveContent... Capital Budgeting CCMS component content... Video SQL Arbortext Editor Camtasia Contract Negotiation Project Management Management Competitive Analysis Mobile Technology Arbortext See 15+     See less Skills  Software Documentation FrameMaker DITA Online Help Single Sourcing Technical Documentation Technical Writing Content Management Oracle Technical Communication Agile Methodologies Databases Information Architecture Structured Authoring Strategic Leadership XML SDL LiveContent... Capital Budgeting CCMS component content... Video SQL Arbortext Editor Camtasia Contract Negotiation Project Management Management Competitive Analysis Mobile Technology Arbortext See 15+     See less Software Documentation FrameMaker DITA Online Help Single Sourcing Technical Documentation Technical Writing Content Management Oracle Technical Communication Agile Methodologies Databases Information Architecture Structured Authoring Strategic Leadership XML SDL LiveContent... Capital Budgeting CCMS component content... Video SQL Arbortext Editor Camtasia Contract Negotiation Project Management Management Competitive Analysis Mobile Technology Arbortext See 15+     See less Software Documentation FrameMaker DITA Online Help Single Sourcing Technical Documentation Technical Writing Content Management Oracle Technical Communication Agile Methodologies Databases Information Architecture Structured Authoring Strategic Leadership XML SDL LiveContent... Capital Budgeting CCMS component content... Video SQL Arbortext Editor Camtasia Contract Negotiation Project Management Management Competitive Analysis Mobile Technology Arbortext See 15+     See less ", "Skills Online Help Technical Writing End User Training Knowledge Base FrameMaker Technical Documentation Manuals Technical Communication RoboHelp SnagIt Single Sourcing Software Documentation Visio Guides SharePoint Business Analysis SDLC Business Process XML Testing Databases See 6+     See less Skills  Online Help Technical Writing End User Training Knowledge Base FrameMaker Technical Documentation Manuals Technical Communication RoboHelp SnagIt Single Sourcing Software Documentation Visio Guides SharePoint Business Analysis SDLC Business Process XML Testing Databases See 6+     See less Online Help Technical Writing End User Training Knowledge Base FrameMaker Technical Documentation Manuals Technical Communication RoboHelp SnagIt Single Sourcing Software Documentation Visio Guides SharePoint Business Analysis SDLC Business Process XML Testing Databases See 6+     See less Online Help Technical Writing End User Training Knowledge Base FrameMaker Technical Documentation Manuals Technical Communication RoboHelp SnagIt Single Sourcing Software Documentation Visio Guides SharePoint Business Analysis SDLC Business Process XML Testing Databases See 6+     See less Honors & Awards ", "Skills Technical Documentation Technical Writing Software Documentation Technical Communication Online Help Technical Editing Manuals FrameMaker DITA Content Management Content Development Captivate Information Design Skills  Technical Documentation Technical Writing Software Documentation Technical Communication Online Help Technical Editing Manuals FrameMaker DITA Content Management Content Development Captivate Information Design Technical Documentation Technical Writing Software Documentation Technical Communication Online Help Technical Editing Manuals FrameMaker DITA Content Management Content Development Captivate Information Design Technical Documentation Technical Writing Software Documentation Technical Communication Online Help Technical Editing Manuals FrameMaker DITA Content Management Content Development Captivate Information Design ", "Experience Managing Editor/Senior Technical Writer IBM September 2010  – Present (5 years) Channel Marketing, Product Marketing IBM February 1997  –  April 2001  (4 years 3 months) Cambridge, MA Sales Operations, Channel Marketing, Product Marketing Lotus Development March 1990  –  February 1997  (7 years) Cambridge, MA Managing Editor/Senior Technical Writer IBM September 2010  – Present (5 years) Managing Editor/Senior Technical Writer IBM September 2010  – Present (5 years) Channel Marketing, Product Marketing IBM February 1997  –  April 2001  (4 years 3 months) Cambridge, MA Channel Marketing, Product Marketing IBM February 1997  –  April 2001  (4 years 3 months) Cambridge, MA Sales Operations, Channel Marketing, Product Marketing Lotus Development March 1990  –  February 1997  (7 years) Cambridge, MA Sales Operations, Channel Marketing, Product Marketing Lotus Development March 1990  –  February 1997  (7 years) Cambridge, MA Education University of Rhode Island - College of Business Administration Bachelor of Science (BS),  Marketing 1985  – 1989 University of Rhode Island - College of Business Administration Bachelor of Science (BS),  Marketing 1985  – 1989 University of Rhode Island - College of Business Administration Bachelor of Science (BS),  Marketing 1985  – 1989 University of Rhode Island - College of Business Administration Bachelor of Science (BS),  Marketing 1985  – 1989 ", "Summary As an experienced and innovative technical writer, I understand complex technologies and explain them using clear business logic. I am a flexible and innovative writer, with the ability to multi-task and work well under pressure, in order to create high-quality documentation in all environments. \n \nSpecialties:  \n• Extensive experience with single-sourcing technologies, including DITA \n \n• Extensive experience writing and editing task-based procedural and training material and writing documentation for translation \n \n• Unique combination of expertise in technical, marketing and content writing \n \n• Proven skills in project and client management, and communication \n \n• Highly proficient in DITA, FrameMaker, MS Word, and RoboHelp \n \n• Experienced creating online content, as well as audio and video editing Summary As an experienced and innovative technical writer, I understand complex technologies and explain them using clear business logic. I am a flexible and innovative writer, with the ability to multi-task and work well under pressure, in order to create high-quality documentation in all environments. \n \nSpecialties:  \n• Extensive experience with single-sourcing technologies, including DITA \n \n• Extensive experience writing and editing task-based procedural and training material and writing documentation for translation \n \n• Unique combination of expertise in technical, marketing and content writing \n \n• Proven skills in project and client management, and communication \n \n• Highly proficient in DITA, FrameMaker, MS Word, and RoboHelp \n \n• Experienced creating online content, as well as audio and video editing As an experienced and innovative technical writer, I understand complex technologies and explain them using clear business logic. I am a flexible and innovative writer, with the ability to multi-task and work well under pressure, in order to create high-quality documentation in all environments. \n \nSpecialties:  \n• Extensive experience with single-sourcing technologies, including DITA \n \n• Extensive experience writing and editing task-based procedural and training material and writing documentation for translation \n \n• Unique combination of expertise in technical, marketing and content writing \n \n• Proven skills in project and client management, and communication \n \n• Highly proficient in DITA, FrameMaker, MS Word, and RoboHelp \n \n• Experienced creating online content, as well as audio and video editing As an experienced and innovative technical writer, I understand complex technologies and explain them using clear business logic. I am a flexible and innovative writer, with the ability to multi-task and work well under pressure, in order to create high-quality documentation in all environments. \n \nSpecialties:  \n• Extensive experience with single-sourcing technologies, including DITA \n \n• Extensive experience writing and editing task-based procedural and training material and writing documentation for translation \n \n• Unique combination of expertise in technical, marketing and content writing \n \n• Proven skills in project and client management, and communication \n \n• Highly proficient in DITA, FrameMaker, MS Word, and RoboHelp \n \n• Experienced creating online content, as well as audio and video editing Experience Technical Writer Crawford Technologies January 2011  – Present (4 years 8 months) Toronto Wrote and edited the documentation set for Crawford’s extensive product line. I revised the industry-specific documentation to a task-based, and reusable modular format, working from internal development material, collaboration with the product support team, SME interviews and other sources. First Line Manager, Team Lead, Senior Technical Writer IBM September 2005  –  April 2010  (4 years 8 months) Lead a team of four writers, some working remotely, creating and maintaining the documentation set, leveraging single-sourcing and DITA to create documentation for two different products, which improved the consistency and quality of the documentation, and increased the speed of delivery. Mentored new writers who joined our group, and interlocked with other IBM groups to provide documentation support. improve team processes and to share our best practises. \n \n•\tImplemented the creation of a documentation database, which improved the processes for creating and revising documentation, traceability on changes, and tracking metrics \n•\tSpear-headed the automated generation of the data dictionaries, key documents for the product, which greatly increased the quality and consistency  \n•\tWorked with the software developers and business analysts to improve the usability and content for several product GUIs \n•\tRebranded the documentation, ensuring that only relevant and best of breed IBM corporate standards were applied \n•\tManaged the conversion of the documentation from MS Word to DITA. \n•\tParticipated in organizing several knowledge-sharing conferences for IBM technical writers \n•\tCreated and developed boot camps for cross training writers and sharing best practices Senior Technical Writer DWL June 2003  –  September 2005  (2 years 4 months) Wrote and edited the documentation set for DWL Customer. I revised this highly technical documentation to a task-based format, working from internal development material, SME interviews and other sources. \n \n•\tCreated a planning and implementation guide for the product that became a critical part of the documentation set \n•\tConverted to single-source documentation, and created an on-line version of the documentation \n•\tWorked with the Training department to improve the quality and consistency of their course material Technical Writer Algorithmics March 2002  –  June 2003  (1 year 4 months) Created task-based reference manuals for Algo’s database, and their XML-based language. I developed this documentation for a technical audience, working from internal development material, SME interviews and other sources. Edited Solution Guides, detailed product descriptions for qualified customers. \n \n•\tDeveloped a preliminary design for a company knowledge base \n•\tCreated sales sheets, a departmental style guide, and web-accessible list of client information Technical Writer Valadeo April 2000  –  September 2001  (1 year 6 months) Developed on-line and paper-based end-user documents for the Windows and Web edition of LiveSite Creator working from development material, product testing results, interview notes and other sources. \n \n•\tResearched, wrote and edited marketing collateral, white papers and other documents to communicate with potential customers \n•\tCreated and maintained departmental intranet sites to facilitate knowledge management within and between departments Technical Writer Crawford Technologies January 2011  – Present (4 years 8 months) Toronto Wrote and edited the documentation set for Crawford’s extensive product line. I revised the industry-specific documentation to a task-based, and reusable modular format, working from internal development material, collaboration with the product support team, SME interviews and other sources. Technical Writer Crawford Technologies January 2011  – Present (4 years 8 months) Toronto Wrote and edited the documentation set for Crawford’s extensive product line. I revised the industry-specific documentation to a task-based, and reusable modular format, working from internal development material, collaboration with the product support team, SME interviews and other sources. First Line Manager, Team Lead, Senior Technical Writer IBM September 2005  –  April 2010  (4 years 8 months) Lead a team of four writers, some working remotely, creating and maintaining the documentation set, leveraging single-sourcing and DITA to create documentation for two different products, which improved the consistency and quality of the documentation, and increased the speed of delivery. Mentored new writers who joined our group, and interlocked with other IBM groups to provide documentation support. improve team processes and to share our best practises. \n \n•\tImplemented the creation of a documentation database, which improved the processes for creating and revising documentation, traceability on changes, and tracking metrics \n•\tSpear-headed the automated generation of the data dictionaries, key documents for the product, which greatly increased the quality and consistency  \n•\tWorked with the software developers and business analysts to improve the usability and content for several product GUIs \n•\tRebranded the documentation, ensuring that only relevant and best of breed IBM corporate standards were applied \n•\tManaged the conversion of the documentation from MS Word to DITA. \n•\tParticipated in organizing several knowledge-sharing conferences for IBM technical writers \n•\tCreated and developed boot camps for cross training writers and sharing best practices First Line Manager, Team Lead, Senior Technical Writer IBM September 2005  –  April 2010  (4 years 8 months) Lead a team of four writers, some working remotely, creating and maintaining the documentation set, leveraging single-sourcing and DITA to create documentation for two different products, which improved the consistency and quality of the documentation, and increased the speed of delivery. Mentored new writers who joined our group, and interlocked with other IBM groups to provide documentation support. improve team processes and to share our best practises. \n \n•\tImplemented the creation of a documentation database, which improved the processes for creating and revising documentation, traceability on changes, and tracking metrics \n•\tSpear-headed the automated generation of the data dictionaries, key documents for the product, which greatly increased the quality and consistency  \n•\tWorked with the software developers and business analysts to improve the usability and content for several product GUIs \n•\tRebranded the documentation, ensuring that only relevant and best of breed IBM corporate standards were applied \n•\tManaged the conversion of the documentation from MS Word to DITA. \n•\tParticipated in organizing several knowledge-sharing conferences for IBM technical writers \n•\tCreated and developed boot camps for cross training writers and sharing best practices Senior Technical Writer DWL June 2003  –  September 2005  (2 years 4 months) Wrote and edited the documentation set for DWL Customer. I revised this highly technical documentation to a task-based format, working from internal development material, SME interviews and other sources. \n \n•\tCreated a planning and implementation guide for the product that became a critical part of the documentation set \n•\tConverted to single-source documentation, and created an on-line version of the documentation \n•\tWorked with the Training department to improve the quality and consistency of their course material Senior Technical Writer DWL June 2003  –  September 2005  (2 years 4 months) Wrote and edited the documentation set for DWL Customer. I revised this highly technical documentation to a task-based format, working from internal development material, SME interviews and other sources. \n \n•\tCreated a planning and implementation guide for the product that became a critical part of the documentation set \n•\tConverted to single-source documentation, and created an on-line version of the documentation \n•\tWorked with the Training department to improve the quality and consistency of their course material Technical Writer Algorithmics March 2002  –  June 2003  (1 year 4 months) Created task-based reference manuals for Algo’s database, and their XML-based language. I developed this documentation for a technical audience, working from internal development material, SME interviews and other sources. Edited Solution Guides, detailed product descriptions for qualified customers. \n \n•\tDeveloped a preliminary design for a company knowledge base \n•\tCreated sales sheets, a departmental style guide, and web-accessible list of client information Technical Writer Algorithmics March 2002  –  June 2003  (1 year 4 months) Created task-based reference manuals for Algo’s database, and their XML-based language. I developed this documentation for a technical audience, working from internal development material, SME interviews and other sources. Edited Solution Guides, detailed product descriptions for qualified customers. \n \n•\tDeveloped a preliminary design for a company knowledge base \n•\tCreated sales sheets, a departmental style guide, and web-accessible list of client information Technical Writer Valadeo April 2000  –  September 2001  (1 year 6 months) Developed on-line and paper-based end-user documents for the Windows and Web edition of LiveSite Creator working from development material, product testing results, interview notes and other sources. \n \n•\tResearched, wrote and edited marketing collateral, white papers and other documents to communicate with potential customers \n•\tCreated and maintained departmental intranet sites to facilitate knowledge management within and between departments Technical Writer Valadeo April 2000  –  September 2001  (1 year 6 months) Developed on-line and paper-based end-user documents for the Windows and Web edition of LiveSite Creator working from development material, product testing results, interview notes and other sources. \n \n•\tResearched, wrote and edited marketing collateral, white papers and other documents to communicate with potential customers \n•\tCreated and maintained departmental intranet sites to facilitate knowledge management within and between departments Skills Word FrameMaker RoboHelp DITA Technical Writing Documentation Writing Reference Manuals Technical Documentation Online Help Single Sourcing Software Documentation Technical Communication Release Notes Manuals Structured Authoring AuthorIT Guides User Assistance Adobe Acrobat See 5+     See less Skills  Word FrameMaker RoboHelp DITA Technical Writing Documentation Writing Reference Manuals Technical Documentation Online Help Single Sourcing Software Documentation Technical Communication Release Notes Manuals Structured Authoring AuthorIT Guides User Assistance Adobe Acrobat See 5+     See less Word FrameMaker RoboHelp DITA Technical Writing Documentation Writing Reference Manuals Technical Documentation Online Help Single Sourcing Software Documentation Technical Communication Release Notes Manuals Structured Authoring AuthorIT Guides User Assistance Adobe Acrobat See 5+     See less Word FrameMaker RoboHelp DITA Technical Writing Documentation Writing Reference Manuals Technical Documentation Online Help Single Sourcing Software Documentation Technical Communication Release Notes Manuals Structured Authoring AuthorIT Guides User Assistance Adobe Acrobat See 5+     See less Education Ryerson University Bachelor of Applied Arts degree; Bachelor of Arts,  Radio and Television Arts Trent University Bachelor of Arts,  English University of Toronto I have completed courses in Information Architecture, E-Learning and Technical Writing. Ryerson University Bachelor of Applied Arts degree; Bachelor of Arts,  Radio and Television Arts Ryerson University Bachelor of Applied Arts degree; Bachelor of Arts,  Radio and Television Arts Ryerson University Bachelor of Applied Arts degree; Bachelor of Arts,  Radio and Television Arts Trent University Bachelor of Arts,  English Trent University Bachelor of Arts,  English Trent University Bachelor of Arts,  English University of Toronto I have completed courses in Information Architecture, E-Learning and Technical Writing. University of Toronto I have completed courses in Information Architecture, E-Learning and Technical Writing. University of Toronto I have completed courses in Information Architecture, E-Learning and Technical Writing. ", "Languages Spanish Spanish Spanish Skills Documentation Writing Enterprise Software Online Help DITA Software Documentation Manuals HTML XML Agile Technical Documentation Single Sourcing Windows SnagIt Release Notes Technical Communication White Papers Technical Writing Guides Structured Authoring Online Help Development Blogging Adobe Acrobat Agile Methodologies XMetal FrameMaker Information Architecture Content Development Content Management APIs See 15+     See less Skills  Documentation Writing Enterprise Software Online Help DITA Software Documentation Manuals HTML XML Agile Technical Documentation Single Sourcing Windows SnagIt Release Notes Technical Communication White Papers Technical Writing Guides Structured Authoring Online Help Development Blogging Adobe Acrobat Agile Methodologies XMetal FrameMaker Information Architecture Content Development Content Management APIs See 15+     See less Documentation Writing Enterprise Software Online Help DITA Software Documentation Manuals HTML XML Agile Technical Documentation Single Sourcing Windows SnagIt Release Notes Technical Communication White Papers Technical Writing Guides Structured Authoring Online Help Development Blogging Adobe Acrobat Agile Methodologies XMetal FrameMaker Information Architecture Content Development Content Management APIs See 15+     See less Documentation Writing Enterprise Software Online Help DITA Software Documentation Manuals HTML XML Agile Technical Documentation Single Sourcing Windows SnagIt Release Notes Technical Communication White Papers Technical Writing Guides Structured Authoring Online Help Development Blogging Adobe Acrobat Agile Methodologies XMetal FrameMaker Information Architecture Content Development Content Management APIs See 15+     See less ", "Skills FrameMaker Online Help Technical Communication DITA Technical Documentation Technical Writing Content Management Cloud Computing Single Sourcing SnagIt SaaS Enterprise Software Information Architecture XMetal Product Management Agile Methodologies User Experience Linux Virtualization See 4+     See less Skills  FrameMaker Online Help Technical Communication DITA Technical Documentation Technical Writing Content Management Cloud Computing Single Sourcing SnagIt SaaS Enterprise Software Information Architecture XMetal Product Management Agile Methodologies User Experience Linux Virtualization See 4+     See less FrameMaker Online Help Technical Communication DITA Technical Documentation Technical Writing Content Management Cloud Computing Single Sourcing SnagIt SaaS Enterprise Software Information Architecture XMetal Product Management Agile Methodologies User Experience Linux Virtualization See 4+     See less FrameMaker Online Help Technical Communication DITA Technical Documentation Technical Writing Content Management Cloud Computing Single Sourcing SnagIt SaaS Enterprise Software Information Architecture XMetal Product Management Agile Methodologies User Experience Linux Virtualization See 4+     See less ", "Summary Technical writing. Information architecture. Content strategy for technical information. Software development models, methodologies, and tools. Successful remote working. Useful processes. Creating things from good ideas. Intersectional feminism. Summary Technical writing. Information architecture. Content strategy for technical information. Software development models, methodologies, and tools. Successful remote working. Useful processes. Creating things from good ideas. Intersectional feminism. Technical writing. Information architecture. Content strategy for technical information. Software development models, methodologies, and tools. Successful remote working. Useful processes. Creating things from good ideas. Intersectional feminism. Technical writing. Information architecture. Content strategy for technical information. Software development models, methodologies, and tools. Successful remote working. Useful processes. Creating things from good ideas. Intersectional feminism. Experience Senior Technical Writer Puppet Labs, Inc. June 2015  – Present (3 months) Saskatoon, SK Documentation release management and development editing for Puppet software. Senior Technical Writer IBM May 2011  –  2015  (4 years) Saskatoon, SK Senior technical writer for IBM Business Process Manager enterprise software. Write and maintain technical user documentation for installation, configuration, migration, and security. Work at home as part of a remote writing and product development team. Agile development process. DITA, HTML, CSS, JavaScript, Ant. Senior Information Architect IBM April 2008  –  December 2011  (3 years 9 months) Saskatoon, SK (Work at home) Provide strategy, guidelines, process, and implementation guidance for organization of technical writers for Rational software products. Senior Technical Writer IBM May 2004  –  May 2007  (3 years 1 month) Toronto, Canada Area Create and maintain technical documentation for various software projects. Invent new methods of creating context-sensitive documentation. Contribute to IBM corporate-level guidelines, information models, and processes. Course Instructor York University January 2005  –  April 2005  (4 months) Toronto, Canada Area Teach course at Glendon College on Technical and Business Communication. Prepare and deliver lectures based on existing curriculum, create assignments, evaluate student performance. Information Development Manager IBM September 2002  –  May 2003  (9 months) Toronto, Canada Area Manage team of technical writers, interview new candidates, provide coaching and professional guidance, troubleshoot and make writers' live easier, perform IBM HR processes.  Technical Writer IBM December 1995  –  August 2002  (6 years 9 months) Toronto, Canada Area Create and maintain technical user documentation for software, including VisualAge C++ and VisualAge for Java. Team leadership, translation coordinating, running the documentation build. Contribute to the design of the Eclipse help system, evangelize its adoption as the corporate user assistance delivery system. Direct Sales Representative IBM Canada November 1994  –  December 1995  (1 year 2 months) Calgary, Canada Area Provide pre-sales guidance to customers interested in purchasing IBM personal computers and printers. Place and manage customer orders. Monitor sales team performance. Research Associate National Research Council Canada May 1992  –  October 1994  (2 years 6 months) Ottawa, Canada Area Scholarship/work program for women in science and engineering programs to learn about careers in science research. Learn about optical thin films physics research. Operate and maintain vacuum chamber for depositing thin film coatings on substrates. Measure and analyze thin film optical properties. Write research paper about experiments with thin films. Write documentation about the software used to analyze optical properties of thin films. Senior Technical Writer Puppet Labs, Inc. June 2015  – Present (3 months) Saskatoon, SK Documentation release management and development editing for Puppet software. Senior Technical Writer Puppet Labs, Inc. June 2015  – Present (3 months) Saskatoon, SK Documentation release management and development editing for Puppet software. Senior Technical Writer IBM May 2011  –  2015  (4 years) Saskatoon, SK Senior technical writer for IBM Business Process Manager enterprise software. Write and maintain technical user documentation for installation, configuration, migration, and security. Work at home as part of a remote writing and product development team. Agile development process. DITA, HTML, CSS, JavaScript, Ant. Senior Technical Writer IBM May 2011  –  2015  (4 years) Saskatoon, SK Senior technical writer for IBM Business Process Manager enterprise software. Write and maintain technical user documentation for installation, configuration, migration, and security. Work at home as part of a remote writing and product development team. Agile development process. DITA, HTML, CSS, JavaScript, Ant. Senior Information Architect IBM April 2008  –  December 2011  (3 years 9 months) Saskatoon, SK (Work at home) Provide strategy, guidelines, process, and implementation guidance for organization of technical writers for Rational software products. Senior Information Architect IBM April 2008  –  December 2011  (3 years 9 months) Saskatoon, SK (Work at home) Provide strategy, guidelines, process, and implementation guidance for organization of technical writers for Rational software products. Senior Technical Writer IBM May 2004  –  May 2007  (3 years 1 month) Toronto, Canada Area Create and maintain technical documentation for various software projects. Invent new methods of creating context-sensitive documentation. Contribute to IBM corporate-level guidelines, information models, and processes. Senior Technical Writer IBM May 2004  –  May 2007  (3 years 1 month) Toronto, Canada Area Create and maintain technical documentation for various software projects. Invent new methods of creating context-sensitive documentation. Contribute to IBM corporate-level guidelines, information models, and processes. Course Instructor York University January 2005  –  April 2005  (4 months) Toronto, Canada Area Teach course at Glendon College on Technical and Business Communication. Prepare and deliver lectures based on existing curriculum, create assignments, evaluate student performance. Course Instructor York University January 2005  –  April 2005  (4 months) Toronto, Canada Area Teach course at Glendon College on Technical and Business Communication. Prepare and deliver lectures based on existing curriculum, create assignments, evaluate student performance. Information Development Manager IBM September 2002  –  May 2003  (9 months) Toronto, Canada Area Manage team of technical writers, interview new candidates, provide coaching and professional guidance, troubleshoot and make writers' live easier, perform IBM HR processes.  Information Development Manager IBM September 2002  –  May 2003  (9 months) Toronto, Canada Area Manage team of technical writers, interview new candidates, provide coaching and professional guidance, troubleshoot and make writers' live easier, perform IBM HR processes.  Technical Writer IBM December 1995  –  August 2002  (6 years 9 months) Toronto, Canada Area Create and maintain technical user documentation for software, including VisualAge C++ and VisualAge for Java. Team leadership, translation coordinating, running the documentation build. Contribute to the design of the Eclipse help system, evangelize its adoption as the corporate user assistance delivery system. Technical Writer IBM December 1995  –  August 2002  (6 years 9 months) Toronto, Canada Area Create and maintain technical user documentation for software, including VisualAge C++ and VisualAge for Java. Team leadership, translation coordinating, running the documentation build. Contribute to the design of the Eclipse help system, evangelize its adoption as the corporate user assistance delivery system. Direct Sales Representative IBM Canada November 1994  –  December 1995  (1 year 2 months) Calgary, Canada Area Provide pre-sales guidance to customers interested in purchasing IBM personal computers and printers. Place and manage customer orders. Monitor sales team performance. Direct Sales Representative IBM Canada November 1994  –  December 1995  (1 year 2 months) Calgary, Canada Area Provide pre-sales guidance to customers interested in purchasing IBM personal computers and printers. Place and manage customer orders. Monitor sales team performance. Research Associate National Research Council Canada May 1992  –  October 1994  (2 years 6 months) Ottawa, Canada Area Scholarship/work program for women in science and engineering programs to learn about careers in science research. Learn about optical thin films physics research. Operate and maintain vacuum chamber for depositing thin film coatings on substrates. Measure and analyze thin film optical properties. Write research paper about experiments with thin films. Write documentation about the software used to analyze optical properties of thin films. Research Associate National Research Council Canada May 1992  –  October 1994  (2 years 6 months) Ottawa, Canada Area Scholarship/work program for women in science and engineering programs to learn about careers in science research. Learn about optical thin films physics research. Operate and maintain vacuum chamber for depositing thin film coatings on substrates. Measure and analyze thin film optical properties. Write research paper about experiments with thin films. Write documentation about the software used to analyze optical properties of thin films. Languages English Native or bilingual proficiency English Native or bilingual proficiency English Native or bilingual proficiency Native or bilingual proficiency Skills Technical Writing Technical Editing Event Planning Teaching Software Documentation Software Development Information Architecture Content Strategy HTML CSS DITA Eclipse Rational Team Concert Technical Documentation Enterprise Software Agile Methodologies Social Media XML Scrum See 4+     See less Skills  Technical Writing Technical Editing Event Planning Teaching Software Documentation Software Development Information Architecture Content Strategy HTML CSS DITA Eclipse Rational Team Concert Technical Documentation Enterprise Software Agile Methodologies Social Media XML Scrum See 4+     See less Technical Writing Technical Editing Event Planning Teaching Software Documentation Software Development Information Architecture Content Strategy HTML CSS DITA Eclipse Rational Team Concert Technical Documentation Enterprise Software Agile Methodologies Social Media XML Scrum See 4+     See less Technical Writing Technical Editing Event Planning Teaching Software Documentation Software Development Information Architecture Content Strategy HTML CSS DITA Eclipse Rational Team Concert Technical Documentation Enterprise Software Agile Methodologies Social Media XML Scrum See 4+     See less Education Trinity Western University Bachelor’s Degree,  Mathematics 1990  – 1994 Liberal Arts: math, computer science, physics, English, history, art Activities and Societies:  Teaching assistant for math ,  computer science ,  and physics. Volunteer campus event service team. Trinity Western University Bachelor’s Degree,  Mathematics 1990  – 1994 Liberal Arts: math, computer science, physics, English, history, art Activities and Societies:  Teaching assistant for math ,  computer science ,  and physics. Volunteer campus event service team. Trinity Western University Bachelor’s Degree,  Mathematics 1990  – 1994 Liberal Arts: math, computer science, physics, English, history, art Activities and Societies:  Teaching assistant for math ,  computer science ,  and physics. Volunteer campus event service team. Trinity Western University Bachelor’s Degree,  Mathematics 1990  – 1994 Liberal Arts: math, computer science, physics, English, history, art Activities and Societies:  Teaching assistant for math ,  computer science ,  and physics. Volunteer campus event service team. Honors & Awards Governor General's Medal April 1994 Highest academic average in the university's undergrad graduating class Governor General's Medal April 1994 Highest academic average in the university's undergrad graduating class Governor General's Medal April 1994 Highest academic average in the university's undergrad graduating class Governor General's Medal April 1994 Highest academic average in the university's undergrad graduating class ", "Languages English English English Skills Writing Requirements Analysis Documentation Instructional Design Web 2.0 Software Documentation RoboHelp Technical Writing Editing Newsletters SDLC Research Team Leadership Software Project... Project Management Product Management Training Copy Editing See 3+     See less Skills  Writing Requirements Analysis Documentation Instructional Design Web 2.0 Software Documentation RoboHelp Technical Writing Editing Newsletters SDLC Research Team Leadership Software Project... Project Management Product Management Training Copy Editing See 3+     See less Writing Requirements Analysis Documentation Instructional Design Web 2.0 Software Documentation RoboHelp Technical Writing Editing Newsletters SDLC Research Team Leadership Software Project... Project Management Product Management Training Copy Editing See 3+     See less Writing Requirements Analysis Documentation Instructional Design Web 2.0 Software Documentation RoboHelp Technical Writing Editing Newsletters SDLC Research Team Leadership Software Project... Project Management Product Management Training Copy Editing See 3+     See less ", "Summary I work to explain technical concepts and tools as clearly and succinctly as possible. \n \nA professional communicator since 1995, I have worked in the fields of business intelligence (BI), business rules management systems (BRMS), mobile telecoms, and web content management, and I currently work as a Senior Technical Writer for a leading provider of open-source and enterprise-level data integration tools. \n \nI also co-authored the books BusinessObjects XI Release 2 for Dummies and The Unofficial Guide to Windows Vista, both published by Wiley. \n \nI'm Scottish, but I worked in Barcelona, Spain between 1995 and 2001 and have been based in Paris, France since 2001. Summary I work to explain technical concepts and tools as clearly and succinctly as possible. \n \nA professional communicator since 1995, I have worked in the fields of business intelligence (BI), business rules management systems (BRMS), mobile telecoms, and web content management, and I currently work as a Senior Technical Writer for a leading provider of open-source and enterprise-level data integration tools. \n \nI also co-authored the books BusinessObjects XI Release 2 for Dummies and The Unofficial Guide to Windows Vista, both published by Wiley. \n \nI'm Scottish, but I worked in Barcelona, Spain between 1995 and 2001 and have been based in Paris, France since 2001. I work to explain technical concepts and tools as clearly and succinctly as possible. \n \nA professional communicator since 1995, I have worked in the fields of business intelligence (BI), business rules management systems (BRMS), mobile telecoms, and web content management, and I currently work as a Senior Technical Writer for a leading provider of open-source and enterprise-level data integration tools. \n \nI also co-authored the books BusinessObjects XI Release 2 for Dummies and The Unofficial Guide to Windows Vista, both published by Wiley. \n \nI'm Scottish, but I worked in Barcelona, Spain between 1995 and 2001 and have been based in Paris, France since 2001. I work to explain technical concepts and tools as clearly and succinctly as possible. \n \nA professional communicator since 1995, I have worked in the fields of business intelligence (BI), business rules management systems (BRMS), mobile telecoms, and web content management, and I currently work as a Senior Technical Writer for a leading provider of open-source and enterprise-level data integration tools. \n \nI also co-authored the books BusinessObjects XI Release 2 for Dummies and The Unofficial Guide to Windows Vista, both published by Wiley. \n \nI'm Scottish, but I worked in Barcelona, Spain between 1995 and 2001 and have been based in Paris, France since 2001. Experience Senior Technical Writer Talend June 2011  – Present (4 years 3 months) Paris Area, France Senior Technical Writer Talend June 2011  – Present (4 years 3 months) Paris Area, France Senior Technical Writer Talend June 2011  – Present (4 years 3 months) Paris Area, France Languages   Skills Skills     ", "Summary I create books... and websites. International experience documenting telecommunications and networking hardware and software. I enjoy troubleshooting, whether in documentation or development. Currently developing skills in eBook (ePub, mobi/Kindle, iBook) creation and conversion. Specialties:Website design, book (print & eBook) design, web application development, LAMP, networking software and hardware. English mother tongue, Modern Greek, some Italian, some French. Summary I create books... and websites. International experience documenting telecommunications and networking hardware and software. I enjoy troubleshooting, whether in documentation or development. Currently developing skills in eBook (ePub, mobi/Kindle, iBook) creation and conversion. Specialties:Website design, book (print & eBook) design, web application development, LAMP, networking software and hardware. English mother tongue, Modern Greek, some Italian, some French. I create books... and websites. International experience documenting telecommunications and networking hardware and software. I enjoy troubleshooting, whether in documentation or development. Currently developing skills in eBook (ePub, mobi/Kindle, iBook) creation and conversion. Specialties:Website design, book (print & eBook) design, web application development, LAMP, networking software and hardware. English mother tongue, Modern Greek, some Italian, some French. I create books... and websites. International experience documenting telecommunications and networking hardware and software. I enjoy troubleshooting, whether in documentation or development. Currently developing skills in eBook (ePub, mobi/Kindle, iBook) creation and conversion. Specialties:Website design, book (print & eBook) design, web application development, LAMP, networking software and hardware. English mother tongue, Modern Greek, some Italian, some French. Experience Technical Writer Ericsson May 2011  –  October 2011  (6 months) Off-Site [via TechProse] Documented new CESoPSN and SAToP Pseudowire functionality in Ericsson SmartEdge Multi-Service Edge Routers. Collaborated with remote (off-site) team of writers and select Ericsson engineers. \n \nInternal tools: ClearCase, ExtraView, ReqPro, TagTool, DWAXE, GASK, Confluence, ArborText, XML, UltraEdit. \n \nSubject Technologies: MPLS Routing, CESoPSN (Circuit Emulation Service over Packet-Switched Network), SAToP (Structure-agnostic TDM over Packet), Pseudowire, MIBs. Senior Technical Writer HP Procurve September 2006  –  January 2009  (2 years 5 months) [via Lasselle-Ramsay] Developed and updated print and web documentation for AP-530 and other wireless access points. Updated documentation for various wired and wireless network devices. \n \nSubject Technologies: Wireless networking, web authentication, IPv6, SNMPv3, sFlow, PoE. Senior Technical Writer Samsung December 2005  –  December 2005  (1 month) [via PubsNetwork] Developed white papers on Samsung's IP Phone, IP PBX, ISP vertical market solutions, and the iBG-2006/2016/3026 family of high-security, high-performance switches. \n \nSubject Technologies: MPLS routing, L2/L3 switching, VoIP, PoE Senior Technical Writer FABRIC7 February 2005  –  April 2005  (3 months) [via PubsNetwork] Updated the Q160 Software Configuration Guide to include CLI commands in a new OS release for the Q160 enterprise-class fabric server. \n \nSubject Technologies: VoIP, IP PBX, MPLS routing \nCISCO Senior Technical Writer Cisco Systems January 2005  –  April 2005  (4 months) [via PubsNetwork] Updated Standards & Guidelines documents on Service Provider Carrier Class Requirement Specifications, and Hardware Design for Reliability Guidelines (for Cisco design engineers). \n \nSubject Technologies: High-availability switches Senior Technical Writer Cosine August 2004  –  August 2004  (1 month) [via PubsNetwork] Updated the IPNOS CLI Configuration Guide for the Control Blade on IPSX 3500 and 9500 service processing switches, covering installation, optimization, virtual routers, virtual interfaces, MPLS traffic, VLANs, QoS, routing policies, security, and so forth. \n \nSubject Technologies: Switch configuration \nIBM Senior Technical Writer IBM FRANCE November 2003  –  April 2004  (6 months) [via eCreation] Developed the WAC Installation and Customization Guide, documenting an installation and configuration tool for IBM EMEA's internal mainframe (MVS) automated operations platform. \n \nSubject Technologies: Remote mainframe configuration, IBM BookMaster documentation Senior Technical Writer SANERA SYSTEMS October 2002  –  November 2002  (2 months) [via PubsNetwork] Updated the CLI Command Reference for the DS10000 datacenter switch for SANs. \nSubject Technologies: Storage area networks \nCISCO Senior Technical Writer Cisco Systems June 2002  –  July 2002  (2 months) [via PubsNetwork] Updated the MetroPlanner Operations Guide, documenting Cisco's network design software for graphical modeling of optical networks. \n \nSubject Technologies: Network modeling software Senior Technical Writer IBM FRANCE March 2002  –  June 2002  (4 months) [via eCreation] Documented (in Microsoft Project) ongoing team activities for the design, deployment, installation, handover, migration, operations, support, and remote management of a large-enterprise datacenter in Paris. \n \nSubject Technologies: Datacenter management, project management Senior Technical Writer VISTO INC November 2001  –  February 2002  (4 months) Documented beta versions of Visto mLynx, a wireless messaging system with Windows NT server and Palm OS and PocketPC mail clients: Getting Started, Online Help, and Administrator's Guide. \n \nSubject Technologies: Palm OS (via Emulator); Code Warrior for Palm OS (for online help); PocketPC; Wireless Messaging; SNMP Senior Technical Writer BYTEMOBILE INC October 2001  –  November 2001  (2 months) Produced Administration Guide for Macara Wireless IP Platform Network Management Subsystem. Topics included performance and fault management, Bytemobile Enterprise MIB and other supported MIBs, SNMP management applications, customizations for HP OpenView, and SNMP agent. \n \nSubject Technologies: HP OpenView; Wireless Network Management; SNMP Senior Technical Writer AGILENT August 2001  –  September 2001  (2 months) Developed the User's Guide for Agilent's NITS inventory tracking system for used equipment (a Microsoft Access application). \n \nSubject Technologies: Database user interface and procedures Senior Technical Writer TEJA TECHNOLOGIES INC April 2001  –  June 2001  (3 months) Documented graphical OOP development tools used to design software for network processors (such as Intel IXP1200) on Teja's Network Processor Operating System (NPOS). Developed tutorials demonstrating basic use of graphic interface and procedures for interfacing with VxWorks Simulator and IXP 1200 Workbench applications. \n \nSubject Technologies: Network processors; Operating systems; OOP application design tools; Intel IXP1200 Senior Technical Writer CLARIFY (NORTEL) July 2000  –  October 2000  (4 months) Documented the reference implementation of the Clarify Customer Portal, a JSP-based B2B/B2C web portal application with customizable modules for order management, support, case management, site administration, user login and profile maintenance, and online help. Updated existing documentation to reflect changeover from ASP to JSP/JavaScript implementation. Documented server environment planning and installation of web applications. \n \nSubject Technologies: Active Server Pages (ASP); Java Server Pages (JSP); JavaScript Classes; Web portal design  \niPLANET Senior Technical Writer iPlanet July 2000  –  September 2000  (3 months) Documented procedures for administrators migrating from legacy Netscape Messaging Server 4 and Sun Internet Mail Server 4 to their successor, iPlanet Messaging Server 5. Developed scenarios for single- and multiple-server installations and guidelines for high-availability configurations. \nSubject Technologies: Internet mail/messaging applications; IMAP; POP; MTA; Sun Internet Mail Server (SIMS); Netscape Messaging Server (NMS)  \nSUN MICROSYSTEMS Senior Technical Writer Sun Microsystems January 2000  –  June 2000  (6 months) Developed 50-slide PowerPoint presentation as course materials documenting APIs to the Wireless Profile of Java 2 Micro Edition, based on MID and CLDC standards. Wrote a White Paper for the Solaris Developer Connection website on adopting Solaris 8. Wrote two White Papers for the Solaris Developer Connection website on techniques for printing under Solaris. \nSubject Technologies: Solaris 8, Solaris; LP Subsystem; Printing, Wireless Java APIs; CLDC; MID \nIBM Senior Technical Writer IBM FRANCE August 1995  –  September 1999  (4 years 2 months) Produced printed and PDF format documentation for IBM screenphone management software for ISPs; for IBM 8285 Nways ATM Workgroup Switch; 8265 Nways ATM Switch; 8260 Nways ATM Switch. \nSubject Technologies: Remote terminal configuration; Proxy server configuration; Customer-care systems; Self-care systems, ATM Switching; OC3/STM1; E3/DS3; E1/T1; 155Mbps ATM; 622Mbps ATM Senior Technical Writer Amadeus March 1995  –  May 1995  (3 months) Produced user guides for Windows-based X.25 and dial-up versions of AmadeusPro (travel agency software with enhanced interface to Amadeus central reservations system \n \nSubject Technologies: Travel reservation software.  \n \nUNIFACE BV Senior Technical Writer UNIFACE BV April 1994  –  December 1994  (9 months) Documented DBMS drivers and, CASE bridge tools for Uniface Six, a multiple-platform, client-server application development environment. Documents included: DBMS-Specific Guide, CASE Bridge Cookbook, and CASE Synchronizer Utility. \n \nSubject Technologies: DBMS drivers;, CASE tools; Oracle; RDB; Sybase  \nSHELL NEDERLAND (SNI Lead Technical Writer SHELL NEDERLAND January 1992  –  February 1994  (2 years 2 months) Documented internal procedures and in-house and commercial applications. Designed named styles for BookMaster documents output to IBM 3820, PostScript, and on-line formats. Responsibilities included interviewing, writing, artwork design, final editing, preparation of, Camera-ready PostScript output. \n \nSubject Technologies: MVS batch procedures; Security procedures; IBM BookMaster & ProcessMaster Junior Technical Writer IBM SEMEA June 1989  –  December 1991  (2 years 7 months) Produced documentation libraries for IBM OSI message handling software: X.400 PROFS Connection, and ONDS X.400 (Message Transfer Agent). Product Description and Operation Manual, General Information Manual, User's Guide, General Information Manual, Programming Guide, Diagnosis, Messages and Codes, and Online Help (ISPF). Produced Programming Guide for NetView Distribution Manager. \n \nSubject Technologies: X.400; PROFS; ONDS , IBM NetView; SNA  \n \n \n \nWilliam Bentley Resume - Technical Writer Ericsson May 2011  –  October 2011  (6 months) Off-Site [via TechProse] Documented new CESoPSN and SAToP Pseudowire functionality in Ericsson SmartEdge Multi-Service Edge Routers. Collaborated with remote (off-site) team of writers and select Ericsson engineers. \n \nInternal tools: ClearCase, ExtraView, ReqPro, TagTool, DWAXE, GASK, Confluence, ArborText, XML, UltraEdit. \n \nSubject Technologies: MPLS Routing, CESoPSN (Circuit Emulation Service over Packet-Switched Network), SAToP (Structure-agnostic TDM over Packet), Pseudowire, MIBs. Technical Writer Ericsson May 2011  –  October 2011  (6 months) Off-Site [via TechProse] Documented new CESoPSN and SAToP Pseudowire functionality in Ericsson SmartEdge Multi-Service Edge Routers. Collaborated with remote (off-site) team of writers and select Ericsson engineers. \n \nInternal tools: ClearCase, ExtraView, ReqPro, TagTool, DWAXE, GASK, Confluence, ArborText, XML, UltraEdit. \n \nSubject Technologies: MPLS Routing, CESoPSN (Circuit Emulation Service over Packet-Switched Network), SAToP (Structure-agnostic TDM over Packet), Pseudowire, MIBs. Senior Technical Writer HP Procurve September 2006  –  January 2009  (2 years 5 months) [via Lasselle-Ramsay] Developed and updated print and web documentation for AP-530 and other wireless access points. Updated documentation for various wired and wireless network devices. \n \nSubject Technologies: Wireless networking, web authentication, IPv6, SNMPv3, sFlow, PoE. Senior Technical Writer HP Procurve September 2006  –  January 2009  (2 years 5 months) [via Lasselle-Ramsay] Developed and updated print and web documentation for AP-530 and other wireless access points. Updated documentation for various wired and wireless network devices. \n \nSubject Technologies: Wireless networking, web authentication, IPv6, SNMPv3, sFlow, PoE. Senior Technical Writer Samsung December 2005  –  December 2005  (1 month) [via PubsNetwork] Developed white papers on Samsung's IP Phone, IP PBX, ISP vertical market solutions, and the iBG-2006/2016/3026 family of high-security, high-performance switches. \n \nSubject Technologies: MPLS routing, L2/L3 switching, VoIP, PoE Senior Technical Writer Samsung December 2005  –  December 2005  (1 month) [via PubsNetwork] Developed white papers on Samsung's IP Phone, IP PBX, ISP vertical market solutions, and the iBG-2006/2016/3026 family of high-security, high-performance switches. \n \nSubject Technologies: MPLS routing, L2/L3 switching, VoIP, PoE Senior Technical Writer FABRIC7 February 2005  –  April 2005  (3 months) [via PubsNetwork] Updated the Q160 Software Configuration Guide to include CLI commands in a new OS release for the Q160 enterprise-class fabric server. \n \nSubject Technologies: VoIP, IP PBX, MPLS routing \nCISCO Senior Technical Writer FABRIC7 February 2005  –  April 2005  (3 months) [via PubsNetwork] Updated the Q160 Software Configuration Guide to include CLI commands in a new OS release for the Q160 enterprise-class fabric server. \n \nSubject Technologies: VoIP, IP PBX, MPLS routing \nCISCO Senior Technical Writer Cisco Systems January 2005  –  April 2005  (4 months) [via PubsNetwork] Updated Standards & Guidelines documents on Service Provider Carrier Class Requirement Specifications, and Hardware Design for Reliability Guidelines (for Cisco design engineers). \n \nSubject Technologies: High-availability switches Senior Technical Writer Cisco Systems January 2005  –  April 2005  (4 months) [via PubsNetwork] Updated Standards & Guidelines documents on Service Provider Carrier Class Requirement Specifications, and Hardware Design for Reliability Guidelines (for Cisco design engineers). \n \nSubject Technologies: High-availability switches Senior Technical Writer Cosine August 2004  –  August 2004  (1 month) [via PubsNetwork] Updated the IPNOS CLI Configuration Guide for the Control Blade on IPSX 3500 and 9500 service processing switches, covering installation, optimization, virtual routers, virtual interfaces, MPLS traffic, VLANs, QoS, routing policies, security, and so forth. \n \nSubject Technologies: Switch configuration \nIBM Senior Technical Writer Cosine August 2004  –  August 2004  (1 month) [via PubsNetwork] Updated the IPNOS CLI Configuration Guide for the Control Blade on IPSX 3500 and 9500 service processing switches, covering installation, optimization, virtual routers, virtual interfaces, MPLS traffic, VLANs, QoS, routing policies, security, and so forth. \n \nSubject Technologies: Switch configuration \nIBM Senior Technical Writer IBM FRANCE November 2003  –  April 2004  (6 months) [via eCreation] Developed the WAC Installation and Customization Guide, documenting an installation and configuration tool for IBM EMEA's internal mainframe (MVS) automated operations platform. \n \nSubject Technologies: Remote mainframe configuration, IBM BookMaster documentation Senior Technical Writer IBM FRANCE November 2003  –  April 2004  (6 months) [via eCreation] Developed the WAC Installation and Customization Guide, documenting an installation and configuration tool for IBM EMEA's internal mainframe (MVS) automated operations platform. \n \nSubject Technologies: Remote mainframe configuration, IBM BookMaster documentation Senior Technical Writer SANERA SYSTEMS October 2002  –  November 2002  (2 months) [via PubsNetwork] Updated the CLI Command Reference for the DS10000 datacenter switch for SANs. \nSubject Technologies: Storage area networks \nCISCO Senior Technical Writer SANERA SYSTEMS October 2002  –  November 2002  (2 months) [via PubsNetwork] Updated the CLI Command Reference for the DS10000 datacenter switch for SANs. \nSubject Technologies: Storage area networks \nCISCO Senior Technical Writer Cisco Systems June 2002  –  July 2002  (2 months) [via PubsNetwork] Updated the MetroPlanner Operations Guide, documenting Cisco's network design software for graphical modeling of optical networks. \n \nSubject Technologies: Network modeling software Senior Technical Writer Cisco Systems June 2002  –  July 2002  (2 months) [via PubsNetwork] Updated the MetroPlanner Operations Guide, documenting Cisco's network design software for graphical modeling of optical networks. \n \nSubject Technologies: Network modeling software Senior Technical Writer IBM FRANCE March 2002  –  June 2002  (4 months) [via eCreation] Documented (in Microsoft Project) ongoing team activities for the design, deployment, installation, handover, migration, operations, support, and remote management of a large-enterprise datacenter in Paris. \n \nSubject Technologies: Datacenter management, project management Senior Technical Writer IBM FRANCE March 2002  –  June 2002  (4 months) [via eCreation] Documented (in Microsoft Project) ongoing team activities for the design, deployment, installation, handover, migration, operations, support, and remote management of a large-enterprise datacenter in Paris. \n \nSubject Technologies: Datacenter management, project management Senior Technical Writer VISTO INC November 2001  –  February 2002  (4 months) Documented beta versions of Visto mLynx, a wireless messaging system with Windows NT server and Palm OS and PocketPC mail clients: Getting Started, Online Help, and Administrator's Guide. \n \nSubject Technologies: Palm OS (via Emulator); Code Warrior for Palm OS (for online help); PocketPC; Wireless Messaging; SNMP Senior Technical Writer VISTO INC November 2001  –  February 2002  (4 months) Documented beta versions of Visto mLynx, a wireless messaging system with Windows NT server and Palm OS and PocketPC mail clients: Getting Started, Online Help, and Administrator's Guide. \n \nSubject Technologies: Palm OS (via Emulator); Code Warrior for Palm OS (for online help); PocketPC; Wireless Messaging; SNMP Senior Technical Writer BYTEMOBILE INC October 2001  –  November 2001  (2 months) Produced Administration Guide for Macara Wireless IP Platform Network Management Subsystem. Topics included performance and fault management, Bytemobile Enterprise MIB and other supported MIBs, SNMP management applications, customizations for HP OpenView, and SNMP agent. \n \nSubject Technologies: HP OpenView; Wireless Network Management; SNMP Senior Technical Writer BYTEMOBILE INC October 2001  –  November 2001  (2 months) Produced Administration Guide for Macara Wireless IP Platform Network Management Subsystem. Topics included performance and fault management, Bytemobile Enterprise MIB and other supported MIBs, SNMP management applications, customizations for HP OpenView, and SNMP agent. \n \nSubject Technologies: HP OpenView; Wireless Network Management; SNMP Senior Technical Writer AGILENT August 2001  –  September 2001  (2 months) Developed the User's Guide for Agilent's NITS inventory tracking system for used equipment (a Microsoft Access application). \n \nSubject Technologies: Database user interface and procedures Senior Technical Writer AGILENT August 2001  –  September 2001  (2 months) Developed the User's Guide for Agilent's NITS inventory tracking system for used equipment (a Microsoft Access application). \n \nSubject Technologies: Database user interface and procedures Senior Technical Writer TEJA TECHNOLOGIES INC April 2001  –  June 2001  (3 months) Documented graphical OOP development tools used to design software for network processors (such as Intel IXP1200) on Teja's Network Processor Operating System (NPOS). Developed tutorials demonstrating basic use of graphic interface and procedures for interfacing with VxWorks Simulator and IXP 1200 Workbench applications. \n \nSubject Technologies: Network processors; Operating systems; OOP application design tools; Intel IXP1200 Senior Technical Writer TEJA TECHNOLOGIES INC April 2001  –  June 2001  (3 months) Documented graphical OOP development tools used to design software for network processors (such as Intel IXP1200) on Teja's Network Processor Operating System (NPOS). Developed tutorials demonstrating basic use of graphic interface and procedures for interfacing with VxWorks Simulator and IXP 1200 Workbench applications. \n \nSubject Technologies: Network processors; Operating systems; OOP application design tools; Intel IXP1200 Senior Technical Writer CLARIFY (NORTEL) July 2000  –  October 2000  (4 months) Documented the reference implementation of the Clarify Customer Portal, a JSP-based B2B/B2C web portal application with customizable modules for order management, support, case management, site administration, user login and profile maintenance, and online help. Updated existing documentation to reflect changeover from ASP to JSP/JavaScript implementation. Documented server environment planning and installation of web applications. \n \nSubject Technologies: Active Server Pages (ASP); Java Server Pages (JSP); JavaScript Classes; Web portal design  \niPLANET Senior Technical Writer CLARIFY (NORTEL) July 2000  –  October 2000  (4 months) Documented the reference implementation of the Clarify Customer Portal, a JSP-based B2B/B2C web portal application with customizable modules for order management, support, case management, site administration, user login and profile maintenance, and online help. Updated existing documentation to reflect changeover from ASP to JSP/JavaScript implementation. Documented server environment planning and installation of web applications. \n \nSubject Technologies: Active Server Pages (ASP); Java Server Pages (JSP); JavaScript Classes; Web portal design  \niPLANET Senior Technical Writer iPlanet July 2000  –  September 2000  (3 months) Documented procedures for administrators migrating from legacy Netscape Messaging Server 4 and Sun Internet Mail Server 4 to their successor, iPlanet Messaging Server 5. Developed scenarios for single- and multiple-server installations and guidelines for high-availability configurations. \nSubject Technologies: Internet mail/messaging applications; IMAP; POP; MTA; Sun Internet Mail Server (SIMS); Netscape Messaging Server (NMS)  \nSUN MICROSYSTEMS Senior Technical Writer iPlanet July 2000  –  September 2000  (3 months) Documented procedures for administrators migrating from legacy Netscape Messaging Server 4 and Sun Internet Mail Server 4 to their successor, iPlanet Messaging Server 5. Developed scenarios for single- and multiple-server installations and guidelines for high-availability configurations. \nSubject Technologies: Internet mail/messaging applications; IMAP; POP; MTA; Sun Internet Mail Server (SIMS); Netscape Messaging Server (NMS)  \nSUN MICROSYSTEMS Senior Technical Writer Sun Microsystems January 2000  –  June 2000  (6 months) Developed 50-slide PowerPoint presentation as course materials documenting APIs to the Wireless Profile of Java 2 Micro Edition, based on MID and CLDC standards. Wrote a White Paper for the Solaris Developer Connection website on adopting Solaris 8. Wrote two White Papers for the Solaris Developer Connection website on techniques for printing under Solaris. \nSubject Technologies: Solaris 8, Solaris; LP Subsystem; Printing, Wireless Java APIs; CLDC; MID \nIBM Senior Technical Writer Sun Microsystems January 2000  –  June 2000  (6 months) Developed 50-slide PowerPoint presentation as course materials documenting APIs to the Wireless Profile of Java 2 Micro Edition, based on MID and CLDC standards. Wrote a White Paper for the Solaris Developer Connection website on adopting Solaris 8. Wrote two White Papers for the Solaris Developer Connection website on techniques for printing under Solaris. \nSubject Technologies: Solaris 8, Solaris; LP Subsystem; Printing, Wireless Java APIs; CLDC; MID \nIBM Senior Technical Writer IBM FRANCE August 1995  –  September 1999  (4 years 2 months) Produced printed and PDF format documentation for IBM screenphone management software for ISPs; for IBM 8285 Nways ATM Workgroup Switch; 8265 Nways ATM Switch; 8260 Nways ATM Switch. \nSubject Technologies: Remote terminal configuration; Proxy server configuration; Customer-care systems; Self-care systems, ATM Switching; OC3/STM1; E3/DS3; E1/T1; 155Mbps ATM; 622Mbps ATM Senior Technical Writer IBM FRANCE August 1995  –  September 1999  (4 years 2 months) Produced printed and PDF format documentation for IBM screenphone management software for ISPs; for IBM 8285 Nways ATM Workgroup Switch; 8265 Nways ATM Switch; 8260 Nways ATM Switch. \nSubject Technologies: Remote terminal configuration; Proxy server configuration; Customer-care systems; Self-care systems, ATM Switching; OC3/STM1; E3/DS3; E1/T1; 155Mbps ATM; 622Mbps ATM Senior Technical Writer Amadeus March 1995  –  May 1995  (3 months) Produced user guides for Windows-based X.25 and dial-up versions of AmadeusPro (travel agency software with enhanced interface to Amadeus central reservations system \n \nSubject Technologies: Travel reservation software.  \n \nUNIFACE BV Senior Technical Writer Amadeus March 1995  –  May 1995  (3 months) Produced user guides for Windows-based X.25 and dial-up versions of AmadeusPro (travel agency software with enhanced interface to Amadeus central reservations system \n \nSubject Technologies: Travel reservation software.  \n \nUNIFACE BV Senior Technical Writer UNIFACE BV April 1994  –  December 1994  (9 months) Documented DBMS drivers and, CASE bridge tools for Uniface Six, a multiple-platform, client-server application development environment. Documents included: DBMS-Specific Guide, CASE Bridge Cookbook, and CASE Synchronizer Utility. \n \nSubject Technologies: DBMS drivers;, CASE tools; Oracle; RDB; Sybase  \nSHELL NEDERLAND (SNI Senior Technical Writer UNIFACE BV April 1994  –  December 1994  (9 months) Documented DBMS drivers and, CASE bridge tools for Uniface Six, a multiple-platform, client-server application development environment. Documents included: DBMS-Specific Guide, CASE Bridge Cookbook, and CASE Synchronizer Utility. \n \nSubject Technologies: DBMS drivers;, CASE tools; Oracle; RDB; Sybase  \nSHELL NEDERLAND (SNI Lead Technical Writer SHELL NEDERLAND January 1992  –  February 1994  (2 years 2 months) Documented internal procedures and in-house and commercial applications. Designed named styles for BookMaster documents output to IBM 3820, PostScript, and on-line formats. Responsibilities included interviewing, writing, artwork design, final editing, preparation of, Camera-ready PostScript output. \n \nSubject Technologies: MVS batch procedures; Security procedures; IBM BookMaster & ProcessMaster Lead Technical Writer SHELL NEDERLAND January 1992  –  February 1994  (2 years 2 months) Documented internal procedures and in-house and commercial applications. Designed named styles for BookMaster documents output to IBM 3820, PostScript, and on-line formats. Responsibilities included interviewing, writing, artwork design, final editing, preparation of, Camera-ready PostScript output. \n \nSubject Technologies: MVS batch procedures; Security procedures; IBM BookMaster & ProcessMaster Junior Technical Writer IBM SEMEA June 1989  –  December 1991  (2 years 7 months) Produced documentation libraries for IBM OSI message handling software: X.400 PROFS Connection, and ONDS X.400 (Message Transfer Agent). Product Description and Operation Manual, General Information Manual, User's Guide, General Information Manual, Programming Guide, Diagnosis, Messages and Codes, and Online Help (ISPF). Produced Programming Guide for NetView Distribution Manager. \n \nSubject Technologies: X.400; PROFS; ONDS , IBM NetView; SNA  \n \n \n \nWilliam Bentley Resume - Junior Technical Writer IBM SEMEA June 1989  –  December 1991  (2 years 7 months) Produced documentation libraries for IBM OSI message handling software: X.400 PROFS Connection, and ONDS X.400 (Message Transfer Agent). Product Description and Operation Manual, General Information Manual, User's Guide, General Information Manual, Programming Guide, Diagnosis, Messages and Codes, and Online Help (ISPF). Produced Programming Guide for NetView Distribution Manager. \n \nSubject Technologies: X.400; PROFS; ONDS , IBM NetView; SNA  \n \n \n \nWilliam Bentley Resume - Skills Web Design Skills  Web Design Web Design Web Design ", "Skills Software Development Software Engineering Java XML Unix Eclipse MySQL Ant Perforce Microsoft SQL Server SOAP REST XSLT CSS JavaScript Windows 7 SoapUI Tomcat Bugzilla jQuery HTML 5 KML Arbortext FrameMaker DocBook SQL HTML TestNG JUnit WebDriver Selenium Mac OS Subversion VMware Fusion JIRA Zephyr See 21+     See less Skills  Software Development Software Engineering Java XML Unix Eclipse MySQL Ant Perforce Microsoft SQL Server SOAP REST XSLT CSS JavaScript Windows 7 SoapUI Tomcat Bugzilla jQuery HTML 5 KML Arbortext FrameMaker DocBook SQL HTML TestNG JUnit WebDriver Selenium Mac OS Subversion VMware Fusion JIRA Zephyr See 21+     See less Software Development Software Engineering Java XML Unix Eclipse MySQL Ant Perforce Microsoft SQL Server SOAP REST XSLT CSS JavaScript Windows 7 SoapUI Tomcat Bugzilla jQuery HTML 5 KML Arbortext FrameMaker DocBook SQL HTML TestNG JUnit WebDriver Selenium Mac OS Subversion VMware Fusion JIRA Zephyr See 21+     See less Software Development Software Engineering Java XML Unix Eclipse MySQL Ant Perforce Microsoft SQL Server SOAP REST XSLT CSS JavaScript Windows 7 SoapUI Tomcat Bugzilla jQuery HTML 5 KML Arbortext FrameMaker DocBook SQL HTML TestNG JUnit WebDriver Selenium Mac OS Subversion VMware Fusion JIRA Zephyr See 21+     See less ", "Summary STRATEGIC BRAND MANAGEMENT \n \n• Enterprising senior-level professional with a track record of developing and managing innovative brand strategies and plans that create and drive long-term value for clients. Former clients include Fortune 500 businesses within the healthcare, insurance, consumer and financial services industries, as well as non-profit organizations.  \n \n• Collaborative, authentic leader with business acumen and top-notch strategic planning and project management skills, respected for uncovering and capitalizing on market opportunities, thinking outside the box to develop and implement customer-focused solutions, and building and managing top-performing cross-functional teams. \n \n• Polished communicator with a natural ability to cultivate and maintain client and partner relationships and work gracefully under pressure in fast-paced, changing environments. \n \nAREAS OF EXPERTISE \nBrand Strategy • Brand Architecture • Design Strategy • Strategic Planning • Consumer Insight • Integrated Marketing • Strategic Communications • Consulting • P&L • New Business Development • Relationship Management • Team Leadership & Training Summary STRATEGIC BRAND MANAGEMENT \n \n• Enterprising senior-level professional with a track record of developing and managing innovative brand strategies and plans that create and drive long-term value for clients. Former clients include Fortune 500 businesses within the healthcare, insurance, consumer and financial services industries, as well as non-profit organizations.  \n \n• Collaborative, authentic leader with business acumen and top-notch strategic planning and project management skills, respected for uncovering and capitalizing on market opportunities, thinking outside the box to develop and implement customer-focused solutions, and building and managing top-performing cross-functional teams. \n \n• Polished communicator with a natural ability to cultivate and maintain client and partner relationships and work gracefully under pressure in fast-paced, changing environments. \n \nAREAS OF EXPERTISE \nBrand Strategy • Brand Architecture • Design Strategy • Strategic Planning • Consumer Insight • Integrated Marketing • Strategic Communications • Consulting • P&L • New Business Development • Relationship Management • Team Leadership & Training STRATEGIC BRAND MANAGEMENT \n \n• Enterprising senior-level professional with a track record of developing and managing innovative brand strategies and plans that create and drive long-term value for clients. Former clients include Fortune 500 businesses within the healthcare, insurance, consumer and financial services industries, as well as non-profit organizations.  \n \n• Collaborative, authentic leader with business acumen and top-notch strategic planning and project management skills, respected for uncovering and capitalizing on market opportunities, thinking outside the box to develop and implement customer-focused solutions, and building and managing top-performing cross-functional teams. \n \n• Polished communicator with a natural ability to cultivate and maintain client and partner relationships and work gracefully under pressure in fast-paced, changing environments. \n \nAREAS OF EXPERTISE \nBrand Strategy • Brand Architecture • Design Strategy • Strategic Planning • Consumer Insight • Integrated Marketing • Strategic Communications • Consulting • P&L • New Business Development • Relationship Management • Team Leadership & Training STRATEGIC BRAND MANAGEMENT \n \n• Enterprising senior-level professional with a track record of developing and managing innovative brand strategies and plans that create and drive long-term value for clients. Former clients include Fortune 500 businesses within the healthcare, insurance, consumer and financial services industries, as well as non-profit organizations.  \n \n• Collaborative, authentic leader with business acumen and top-notch strategic planning and project management skills, respected for uncovering and capitalizing on market opportunities, thinking outside the box to develop and implement customer-focused solutions, and building and managing top-performing cross-functional teams. \n \n• Polished communicator with a natural ability to cultivate and maintain client and partner relationships and work gracefully under pressure in fast-paced, changing environments. \n \nAREAS OF EXPERTISE \nBrand Strategy • Brand Architecture • Design Strategy • Strategic Planning • Consumer Insight • Integrated Marketing • Strategic Communications • Consulting • P&L • New Business Development • Relationship Management • Team Leadership & Training Experience Director, Global Brand and Corporate Marketing Communications Sensus April 2014  – Present (1 year 5 months) Raleigh-Durham, North Carolina Area Sensus helps a wide range of public service providers – from utilities to cities to industrial complexes and campuses – do more with their infrastructure to improve quality of life in their communities. We enable our customers to reach farther through the application of technology and data-driven insights that deliver efficiency and responsiveness. We partner with them to anticipate and respond to evolving business needs with innovation in sensing and communications technologies, data analytics and services. Learn more at www.sensus.com and follow us on LinkedIn and Twitter through @sensusglobal. Founder Renee Peet Brand Consulting January 2014  –  December 2014  (1 year) Durham, North Carolina Interim Marketing and Branding Executive \nProvide interim marketing and branding expertise to diverse clients, from crafting customer-centric brand strategies; to assisting with name development and service offering design; to formalizing processes for greater marketing efficiencies and speed to market; and helping companies strengthen their team collaboration and talent. Mom in Charge Maternity Leave - Twinsanity October 2011  –  December 2013  (2 years 3 months) Durham, North Carolina I've been spending my time mastering all new levels of patience, multi-tasking and good humor for my next paid gig. Group Director, Strategy Siegel+Gale January 2010  –  October 2011  (1 year 10 months) New York, New York • Shaped and directed the strategy practice for Siegel+Gale’s New York headquarters, generating and managing P&L for 20% of the firm’s overall revenue.  \n \n• Guided a team of 25 brand strategists, ensuring peak performance through providing ongoing team training sessions, one-on-one coaching, and fostering an environment focused on innovation and growth.  \n \n• Drove company growth through forging relationships with new high-level clients, resulting in new business wins across practice areas that generated approximately $9 million in revenue.  \n \n• Created a mentorship program for entry to senior-level employees, and substantially improved employee morale and retention through implementing a career planning and development framework for the strategy practice that put staff on a clearer path toward professional success. \n \n• Clients included ConocoPhillips, American Express, SAP, Target, Aetna, SAIC, Girls Write Now, Addeco, AARP, and Motorola. Principal Sullivan September 2008  –  January 2010  (1 year 5 months) • Established and led a new practice area focused on the travel and luxury sectors, managing a start-up P&L of $2M. Developed a sound business plan; conceptualized and implemented marketing strategies to attract new business; identified potential clients and set targets; and pitched new clients.  \n \n• Managed a team of 7 marketing and communications strategists and coached and mentored junior staff on brand strategy.  \n \n• Developed new strategic, communications, and creative offerings with the Executive Creative Director.  \n \n• As integral member of senior management team, set strategic goals and managed resources, and garnered new business across industry practice areas, with clients including Fidelity, Bessemer Trust, JPMorgan, TRowe, Coty Prestige and SingleStop USA. Executive Director, Brand Strategy; Acting Managing Director of the New York Office BrandImage - Desgrippes + Laga January 2008  –  September 2008  (9 months) • Managed company’s New York office and P&L for all client engagements. Directed all strategic and creative work, efficiently managing more than 50 employees involved in brand strategy, graphic design, industrial design, interior design and architecture, naming and writing, and other areas while recruiting a new Executive Creative Director. Partnered with the CFO to allocate resources and manage budgets of $10M+. \n \n• Recruited and then partnered with the new Director of Business Development to create new business opportunities. \n \n• As member of the global leadership and merger integration team, assisted in setting and aligning strategic vision for the newly created company. Co-led the knowledge management, insight methods, and process and methods integration teams. \n \n• Clients included Telefonica, NewYork Life, RealD, Proctor & Gamble, Bayer, Christian Bernard, Johnson & Johnson Lifescan, NeatReceipts, TheFaceShop, and The Hartford. Executive Director, Brand Strategy Desgrippes Gobe March 2007  –  January 2008  (11 months) • Guided the day-to-day activities for the strategy practice and oversaw client relationships, quality of work, and P&L for all accounts. Grew strategy team to 15 with 3 direct reports and led pitch teams. \n \n• Managed and extended client relationships across practice areas, encompassing the entire office’s revenues of $10M. Clients included AOL, Coca Cola, Johnson & Johnson, The History Channel, Dassault-Falcon, Banana Republic, Telefonica, and Danku. \n \n• Developed more modern and dynamic workshops and presentation formats that successfully attracted new business with potential and current clients. \n \n• Defined strategic offering and partnered with Executive Creative Director and President to streamline the process and standards for all of the firm’s strategic and creative deliverables, leading to a more consistent experience for the firm’s New York and global clients. Senior Director, Brand Strategy Desgrippes Gobe April 2004  –  March 2007  (3 years) • Co-managed the strategy practice and oversaw relationships, quality of work, and P&L for half of the agency’s client accounts representing two-thirds of the office’s revenues. Developed strategic approach to proposals and new business opportunities and participated on pitch teams. Managed project budgets averaging $4-5M annually. \n \n• Extended firm’s relationship with AOL, overseeing 20 to 30 projects annually in the areas of brand strategy, visual identity, product and interface design, brand architecture, research, naming, retail experience, internal communications, and international expansion. \n \n• Grew firm’s business with Staples by 5 times in a span of 6 months, personally managing brand strategy, architecture, identity, and product design recommendations for a number of the company’s initiatives, including the “M” sub-brand. \n \n• Led the re-launch of Banana Republic’s personal care line, bringing 5 fragrances, 6 home fragrances and a complete body line to market in under a year. Senior Consultant Siegel+Gale February 2000  –  April 2004  (4 years 3 months) Led multifunctional teams to develop and manage comprehensive strategic corporate identity and branding programs in the financial and professional services practice. Conducted in-depth analyses of corporate brand positioning, architecture, and competitive environment. Developed strategies and programs to align client processes and behaviors with brand strategy. Extended client relationships across practice areas and managed project budgets. Business Development Manager, MBA Internship Chemoil Corp. May 1999  –  September 1999  (5 months) Tracked weekly trading activity for bunker fuel and crude oil in the Dutch market. Working with the CEO, assessed potential relationships with ice-free ports in Latvia and Estonia for Russian crude oil supplies. International Product Manager, MBA Internship Aspect Communications May 1998  –  March 1999  (11 months) Conducted primary research with potential partners and clients on the viability of cloud-based call center services in Europe and Southeast Asia. Co-authored findings and recommendations on market entry for this new product category. Project Manager, Senior Technical Writer Aspect Communications April 1995  –  July 1997  (2 years 4 months) Wrote online and hardcopy user manuals for Aspect and client engineers to install and maintain the hardware and software for call center systems. Co-authored field alerts on maintenance and upgrade service actions with the engineering team. Library Planner, Senior Technical Writer IBM June 1989  –  April 1995  (5 years 11 months) San Jose, California Planned, managed and wrote user and reference manuals for IBM and client engineers to install and maintain mainframe hardware and operating system software. Designed and wrote the first online manuals for IBM field engineers for DFSORT and DASD-ICKDSF. Partnered with engineering teams beginning with product specifications to testing, launch and client support to ensure QA of the libraries and issue field alerts. Managed three main product libraries, comprising over 30 volumes, in addition to writing technical papers and field alerts for associated data storage, retrieval and manipulation products. Director, Global Brand and Corporate Marketing Communications Sensus April 2014  – Present (1 year 5 months) Raleigh-Durham, North Carolina Area Sensus helps a wide range of public service providers – from utilities to cities to industrial complexes and campuses – do more with their infrastructure to improve quality of life in their communities. We enable our customers to reach farther through the application of technology and data-driven insights that deliver efficiency and responsiveness. We partner with them to anticipate and respond to evolving business needs with innovation in sensing and communications technologies, data analytics and services. Learn more at www.sensus.com and follow us on LinkedIn and Twitter through @sensusglobal. Director, Global Brand and Corporate Marketing Communications Sensus April 2014  – Present (1 year 5 months) Raleigh-Durham, North Carolina Area Sensus helps a wide range of public service providers – from utilities to cities to industrial complexes and campuses – do more with their infrastructure to improve quality of life in their communities. We enable our customers to reach farther through the application of technology and data-driven insights that deliver efficiency and responsiveness. We partner with them to anticipate and respond to evolving business needs with innovation in sensing and communications technologies, data analytics and services. Learn more at www.sensus.com and follow us on LinkedIn and Twitter through @sensusglobal. Founder Renee Peet Brand Consulting January 2014  –  December 2014  (1 year) Durham, North Carolina Interim Marketing and Branding Executive \nProvide interim marketing and branding expertise to diverse clients, from crafting customer-centric brand strategies; to assisting with name development and service offering design; to formalizing processes for greater marketing efficiencies and speed to market; and helping companies strengthen their team collaboration and talent. Founder Renee Peet Brand Consulting January 2014  –  December 2014  (1 year) Durham, North Carolina Interim Marketing and Branding Executive \nProvide interim marketing and branding expertise to diverse clients, from crafting customer-centric brand strategies; to assisting with name development and service offering design; to formalizing processes for greater marketing efficiencies and speed to market; and helping companies strengthen their team collaboration and talent. Mom in Charge Maternity Leave - Twinsanity October 2011  –  December 2013  (2 years 3 months) Durham, North Carolina I've been spending my time mastering all new levels of patience, multi-tasking and good humor for my next paid gig. Mom in Charge Maternity Leave - Twinsanity October 2011  –  December 2013  (2 years 3 months) Durham, North Carolina I've been spending my time mastering all new levels of patience, multi-tasking and good humor for my next paid gig. Group Director, Strategy Siegel+Gale January 2010  –  October 2011  (1 year 10 months) New York, New York • Shaped and directed the strategy practice for Siegel+Gale’s New York headquarters, generating and managing P&L for 20% of the firm’s overall revenue.  \n \n• Guided a team of 25 brand strategists, ensuring peak performance through providing ongoing team training sessions, one-on-one coaching, and fostering an environment focused on innovation and growth.  \n \n• Drove company growth through forging relationships with new high-level clients, resulting in new business wins across practice areas that generated approximately $9 million in revenue.  \n \n• Created a mentorship program for entry to senior-level employees, and substantially improved employee morale and retention through implementing a career planning and development framework for the strategy practice that put staff on a clearer path toward professional success. \n \n• Clients included ConocoPhillips, American Express, SAP, Target, Aetna, SAIC, Girls Write Now, Addeco, AARP, and Motorola. Group Director, Strategy Siegel+Gale January 2010  –  October 2011  (1 year 10 months) New York, New York • Shaped and directed the strategy practice for Siegel+Gale’s New York headquarters, generating and managing P&L for 20% of the firm’s overall revenue.  \n \n• Guided a team of 25 brand strategists, ensuring peak performance through providing ongoing team training sessions, one-on-one coaching, and fostering an environment focused on innovation and growth.  \n \n• Drove company growth through forging relationships with new high-level clients, resulting in new business wins across practice areas that generated approximately $9 million in revenue.  \n \n• Created a mentorship program for entry to senior-level employees, and substantially improved employee morale and retention through implementing a career planning and development framework for the strategy practice that put staff on a clearer path toward professional success. \n \n• Clients included ConocoPhillips, American Express, SAP, Target, Aetna, SAIC, Girls Write Now, Addeco, AARP, and Motorola. Principal Sullivan September 2008  –  January 2010  (1 year 5 months) • Established and led a new practice area focused on the travel and luxury sectors, managing a start-up P&L of $2M. Developed a sound business plan; conceptualized and implemented marketing strategies to attract new business; identified potential clients and set targets; and pitched new clients.  \n \n• Managed a team of 7 marketing and communications strategists and coached and mentored junior staff on brand strategy.  \n \n• Developed new strategic, communications, and creative offerings with the Executive Creative Director.  \n \n• As integral member of senior management team, set strategic goals and managed resources, and garnered new business across industry practice areas, with clients including Fidelity, Bessemer Trust, JPMorgan, TRowe, Coty Prestige and SingleStop USA. Principal Sullivan September 2008  –  January 2010  (1 year 5 months) • Established and led a new practice area focused on the travel and luxury sectors, managing a start-up P&L of $2M. Developed a sound business plan; conceptualized and implemented marketing strategies to attract new business; identified potential clients and set targets; and pitched new clients.  \n \n• Managed a team of 7 marketing and communications strategists and coached and mentored junior staff on brand strategy.  \n \n• Developed new strategic, communications, and creative offerings with the Executive Creative Director.  \n \n• As integral member of senior management team, set strategic goals and managed resources, and garnered new business across industry practice areas, with clients including Fidelity, Bessemer Trust, JPMorgan, TRowe, Coty Prestige and SingleStop USA. Executive Director, Brand Strategy; Acting Managing Director of the New York Office BrandImage - Desgrippes + Laga January 2008  –  September 2008  (9 months) • Managed company’s New York office and P&L for all client engagements. Directed all strategic and creative work, efficiently managing more than 50 employees involved in brand strategy, graphic design, industrial design, interior design and architecture, naming and writing, and other areas while recruiting a new Executive Creative Director. Partnered with the CFO to allocate resources and manage budgets of $10M+. \n \n• Recruited and then partnered with the new Director of Business Development to create new business opportunities. \n \n• As member of the global leadership and merger integration team, assisted in setting and aligning strategic vision for the newly created company. Co-led the knowledge management, insight methods, and process and methods integration teams. \n \n• Clients included Telefonica, NewYork Life, RealD, Proctor & Gamble, Bayer, Christian Bernard, Johnson & Johnson Lifescan, NeatReceipts, TheFaceShop, and The Hartford. Executive Director, Brand Strategy; Acting Managing Director of the New York Office BrandImage - Desgrippes + Laga January 2008  –  September 2008  (9 months) • Managed company’s New York office and P&L for all client engagements. Directed all strategic and creative work, efficiently managing more than 50 employees involved in brand strategy, graphic design, industrial design, interior design and architecture, naming and writing, and other areas while recruiting a new Executive Creative Director. Partnered with the CFO to allocate resources and manage budgets of $10M+. \n \n• Recruited and then partnered with the new Director of Business Development to create new business opportunities. \n \n• As member of the global leadership and merger integration team, assisted in setting and aligning strategic vision for the newly created company. Co-led the knowledge management, insight methods, and process and methods integration teams. \n \n• Clients included Telefonica, NewYork Life, RealD, Proctor & Gamble, Bayer, Christian Bernard, Johnson & Johnson Lifescan, NeatReceipts, TheFaceShop, and The Hartford. Executive Director, Brand Strategy Desgrippes Gobe March 2007  –  January 2008  (11 months) • Guided the day-to-day activities for the strategy practice and oversaw client relationships, quality of work, and P&L for all accounts. Grew strategy team to 15 with 3 direct reports and led pitch teams. \n \n• Managed and extended client relationships across practice areas, encompassing the entire office’s revenues of $10M. Clients included AOL, Coca Cola, Johnson & Johnson, The History Channel, Dassault-Falcon, Banana Republic, Telefonica, and Danku. \n \n• Developed more modern and dynamic workshops and presentation formats that successfully attracted new business with potential and current clients. \n \n• Defined strategic offering and partnered with Executive Creative Director and President to streamline the process and standards for all of the firm’s strategic and creative deliverables, leading to a more consistent experience for the firm’s New York and global clients. Executive Director, Brand Strategy Desgrippes Gobe March 2007  –  January 2008  (11 months) • Guided the day-to-day activities for the strategy practice and oversaw client relationships, quality of work, and P&L for all accounts. Grew strategy team to 15 with 3 direct reports and led pitch teams. \n \n• Managed and extended client relationships across practice areas, encompassing the entire office’s revenues of $10M. Clients included AOL, Coca Cola, Johnson & Johnson, The History Channel, Dassault-Falcon, Banana Republic, Telefonica, and Danku. \n \n• Developed more modern and dynamic workshops and presentation formats that successfully attracted new business with potential and current clients. \n \n• Defined strategic offering and partnered with Executive Creative Director and President to streamline the process and standards for all of the firm’s strategic and creative deliverables, leading to a more consistent experience for the firm’s New York and global clients. Senior Director, Brand Strategy Desgrippes Gobe April 2004  –  March 2007  (3 years) • Co-managed the strategy practice and oversaw relationships, quality of work, and P&L for half of the agency’s client accounts representing two-thirds of the office’s revenues. Developed strategic approach to proposals and new business opportunities and participated on pitch teams. Managed project budgets averaging $4-5M annually. \n \n• Extended firm’s relationship with AOL, overseeing 20 to 30 projects annually in the areas of brand strategy, visual identity, product and interface design, brand architecture, research, naming, retail experience, internal communications, and international expansion. \n \n• Grew firm’s business with Staples by 5 times in a span of 6 months, personally managing brand strategy, architecture, identity, and product design recommendations for a number of the company’s initiatives, including the “M” sub-brand. \n \n• Led the re-launch of Banana Republic’s personal care line, bringing 5 fragrances, 6 home fragrances and a complete body line to market in under a year. Senior Director, Brand Strategy Desgrippes Gobe April 2004  –  March 2007  (3 years) • Co-managed the strategy practice and oversaw relationships, quality of work, and P&L for half of the agency’s client accounts representing two-thirds of the office’s revenues. Developed strategic approach to proposals and new business opportunities and participated on pitch teams. Managed project budgets averaging $4-5M annually. \n \n• Extended firm’s relationship with AOL, overseeing 20 to 30 projects annually in the areas of brand strategy, visual identity, product and interface design, brand architecture, research, naming, retail experience, internal communications, and international expansion. \n \n• Grew firm’s business with Staples by 5 times in a span of 6 months, personally managing brand strategy, architecture, identity, and product design recommendations for a number of the company’s initiatives, including the “M” sub-brand. \n \n• Led the re-launch of Banana Republic’s personal care line, bringing 5 fragrances, 6 home fragrances and a complete body line to market in under a year. Senior Consultant Siegel+Gale February 2000  –  April 2004  (4 years 3 months) Led multifunctional teams to develop and manage comprehensive strategic corporate identity and branding programs in the financial and professional services practice. Conducted in-depth analyses of corporate brand positioning, architecture, and competitive environment. Developed strategies and programs to align client processes and behaviors with brand strategy. Extended client relationships across practice areas and managed project budgets. Senior Consultant Siegel+Gale February 2000  –  April 2004  (4 years 3 months) Led multifunctional teams to develop and manage comprehensive strategic corporate identity and branding programs in the financial and professional services practice. Conducted in-depth analyses of corporate brand positioning, architecture, and competitive environment. Developed strategies and programs to align client processes and behaviors with brand strategy. Extended client relationships across practice areas and managed project budgets. Business Development Manager, MBA Internship Chemoil Corp. May 1999  –  September 1999  (5 months) Tracked weekly trading activity for bunker fuel and crude oil in the Dutch market. Working with the CEO, assessed potential relationships with ice-free ports in Latvia and Estonia for Russian crude oil supplies. Business Development Manager, MBA Internship Chemoil Corp. May 1999  –  September 1999  (5 months) Tracked weekly trading activity for bunker fuel and crude oil in the Dutch market. Working with the CEO, assessed potential relationships with ice-free ports in Latvia and Estonia for Russian crude oil supplies. International Product Manager, MBA Internship Aspect Communications May 1998  –  March 1999  (11 months) Conducted primary research with potential partners and clients on the viability of cloud-based call center services in Europe and Southeast Asia. Co-authored findings and recommendations on market entry for this new product category. International Product Manager, MBA Internship Aspect Communications May 1998  –  March 1999  (11 months) Conducted primary research with potential partners and clients on the viability of cloud-based call center services in Europe and Southeast Asia. Co-authored findings and recommendations on market entry for this new product category. Project Manager, Senior Technical Writer Aspect Communications April 1995  –  July 1997  (2 years 4 months) Wrote online and hardcopy user manuals for Aspect and client engineers to install and maintain the hardware and software for call center systems. Co-authored field alerts on maintenance and upgrade service actions with the engineering team. Project Manager, Senior Technical Writer Aspect Communications April 1995  –  July 1997  (2 years 4 months) Wrote online and hardcopy user manuals for Aspect and client engineers to install and maintain the hardware and software for call center systems. Co-authored field alerts on maintenance and upgrade service actions with the engineering team. Library Planner, Senior Technical Writer IBM June 1989  –  April 1995  (5 years 11 months) San Jose, California Planned, managed and wrote user and reference manuals for IBM and client engineers to install and maintain mainframe hardware and operating system software. Designed and wrote the first online manuals for IBM field engineers for DFSORT and DASD-ICKDSF. Partnered with engineering teams beginning with product specifications to testing, launch and client support to ensure QA of the libraries and issue field alerts. Managed three main product libraries, comprising over 30 volumes, in addition to writing technical papers and field alerts for associated data storage, retrieval and manipulation products. Library Planner, Senior Technical Writer IBM June 1989  –  April 1995  (5 years 11 months) San Jose, California Planned, managed and wrote user and reference manuals for IBM and client engineers to install and maintain mainframe hardware and operating system software. Designed and wrote the first online manuals for IBM field engineers for DFSORT and DASD-ICKDSF. Partnered with engineering teams beginning with product specifications to testing, launch and client support to ensure QA of the libraries and issue field alerts. Managed three main product libraries, comprising over 30 volumes, in addition to writing technical papers and field alerts for associated data storage, retrieval and manipulation products. Skills Brand Architecture Architects Strategic Communications Customer Insight Strategy Marketing CRM Corporate Branding Positioning Integrated Marketing Brand Management Segmentation Marketing Strategy Product Development Brand Development Digital Strategy Interactive Marketing Creative Strategy Marketing Communications Online Advertising Creative Direction Marketing Research Advertising Leadership Branding & Identity Market Research Cross-functional Team... New Business Development Business Development Strategic Planning Management Strategic Thinking P&L Management Business Planning Competitive Analysis Strategic Partnerships Direct Marketing Content Strategy Product Naming Brand Positioning... See 25+     See less Skills  Brand Architecture Architects Strategic Communications Customer Insight Strategy Marketing CRM Corporate Branding Positioning Integrated Marketing Brand Management Segmentation Marketing Strategy Product Development Brand Development Digital Strategy Interactive Marketing Creative Strategy Marketing Communications Online Advertising Creative Direction Marketing Research Advertising Leadership Branding & Identity Market Research Cross-functional Team... New Business Development Business Development Strategic Planning Management Strategic Thinking P&L Management Business Planning Competitive Analysis Strategic Partnerships Direct Marketing Content Strategy Product Naming Brand Positioning... See 25+     See less Brand Architecture Architects Strategic Communications Customer Insight Strategy Marketing CRM Corporate Branding Positioning Integrated Marketing Brand Management Segmentation Marketing Strategy Product Development Brand Development Digital Strategy Interactive Marketing Creative Strategy Marketing Communications Online Advertising Creative Direction Marketing Research Advertising Leadership Branding & Identity Market Research Cross-functional Team... New Business Development Business Development Strategic Planning Management Strategic Thinking P&L Management Business Planning Competitive Analysis Strategic Partnerships Direct Marketing Content Strategy Product Naming Brand Positioning... See 25+     See less Brand Architecture Architects Strategic Communications Customer Insight Strategy Marketing CRM Corporate Branding Positioning Integrated Marketing Brand Management Segmentation Marketing Strategy Product Development Brand Development Digital Strategy Interactive Marketing Creative Strategy Marketing Communications Online Advertising Creative Direction Marketing Research Advertising Leadership Branding & Identity Market Research Cross-functional Team... New Business Development Business Development Strategic Planning Management Strategic Thinking P&L Management Business Planning Competitive Analysis Strategic Partnerships Direct Marketing Content Strategy Product Naming Brand Positioning... See 25+     See less Education Rotterdam School of Management, Erasmus University MBA,  Marketing and Strategy 1997  – 1999 Editor, quarterly student paper: RSM Connections '98/'99 Activities and Societies:  Exchange program: 3rd semester at Asian Institute of Management ,  Manila ,  Phillippines Asian Institute of Management MBA,  Strategy and International Business 1998  – 1998 Activities and Societies:  Third term exchange ambassador from Rotterdam School of Management. Emphasis on strategy and international business. University of Arizona BA,  Creative Writing ,  Political Science 1985  – 1990 Activities and Societies:  Dean's List '86-'90 Rotterdam School of Management, Erasmus University MBA,  Marketing and Strategy 1997  – 1999 Editor, quarterly student paper: RSM Connections '98/'99 Activities and Societies:  Exchange program: 3rd semester at Asian Institute of Management ,  Manila ,  Phillippines Rotterdam School of Management, Erasmus University MBA,  Marketing and Strategy 1997  – 1999 Editor, quarterly student paper: RSM Connections '98/'99 Activities and Societies:  Exchange program: 3rd semester at Asian Institute of Management ,  Manila ,  Phillippines Rotterdam School of Management, Erasmus University MBA,  Marketing and Strategy 1997  – 1999 Editor, quarterly student paper: RSM Connections '98/'99 Activities and Societies:  Exchange program: 3rd semester at Asian Institute of Management ,  Manila ,  Phillippines Asian Institute of Management MBA,  Strategy and International Business 1998  – 1998 Activities and Societies:  Third term exchange ambassador from Rotterdam School of Management. Emphasis on strategy and international business. Asian Institute of Management MBA,  Strategy and International Business 1998  – 1998 Activities and Societies:  Third term exchange ambassador from Rotterdam School of Management. Emphasis on strategy and international business. Asian Institute of Management MBA,  Strategy and International Business 1998  – 1998 Activities and Societies:  Third term exchange ambassador from Rotterdam School of Management. Emphasis on strategy and international business. University of Arizona BA,  Creative Writing ,  Political Science 1985  – 1990 Activities and Societies:  Dean's List '86-'90 University of Arizona BA,  Creative Writing ,  Political Science 1985  – 1990 Activities and Societies:  Dean's List '86-'90 University of Arizona BA,  Creative Writing ,  Political Science 1985  – 1990 Activities and Societies:  Dean's List '86-'90 ", "Languages French French French Skills Project Management SaaS Technical Writing Agile Methodologies Software Documentation Product Marketing Lead Generation Enterprise Software CRM Product Management Marketing Communications Web Content White Papers Strategic Partnerships Analytics Business Analysis Cloud Computing Competitive Analysis Content Management Cross-functional Team... Demand Generation Integration Management Mobile Applications Professional Services Requirements Analysis Start-ups Team Leadership E-commerce Business Intelligence See 15+     See less Skills  Project Management SaaS Technical Writing Agile Methodologies Software Documentation Product Marketing Lead Generation Enterprise Software CRM Product Management Marketing Communications Web Content White Papers Strategic Partnerships Analytics Business Analysis Cloud Computing Competitive Analysis Content Management Cross-functional Team... Demand Generation Integration Management Mobile Applications Professional Services Requirements Analysis Start-ups Team Leadership E-commerce Business Intelligence See 15+     See less Project Management SaaS Technical Writing Agile Methodologies Software Documentation Product Marketing Lead Generation Enterprise Software CRM Product Management Marketing Communications Web Content White Papers Strategic Partnerships Analytics Business Analysis Cloud Computing Competitive Analysis Content Management Cross-functional Team... Demand Generation Integration Management Mobile Applications Professional Services Requirements Analysis Start-ups Team Leadership E-commerce Business Intelligence See 15+     See less Project Management SaaS Technical Writing Agile Methodologies Software Documentation Product Marketing Lead Generation Enterprise Software CRM Product Management Marketing Communications Web Content White Papers Strategic Partnerships Analytics Business Analysis Cloud Computing Competitive Analysis Content Management Cross-functional Team... Demand Generation Integration Management Mobile Applications Professional Services Requirements Analysis Start-ups Team Leadership E-commerce Business Intelligence See 15+     See less "]}