{"position": "Senior Yield Engineer", "company": "Intel Corporation", "profiles": ["Summary • Critical thinking and highly skilled problem-solving ability.  \n• Expert on data mining, analysis and interpretation.  \n• Comprehensive knowledge and rich experiences on project management, with PMP certificate. \n• Rich practices on continuous improvement, with LEAN six sigma green belt certificate. \n• Deep understanding on statistics, DOE, SPC etc. \n• Familiar with JMP, SQL, C, VB, Excel etc. \n• Good communication skills and influence capabilities. \n• Strong leadership and management skills. \n• Good knowledge on process integration, yield enhancement. Summary • Critical thinking and highly skilled problem-solving ability.  \n• Expert on data mining, analysis and interpretation.  \n• Comprehensive knowledge and rich experiences on project management, with PMP certificate. \n• Rich practices on continuous improvement, with LEAN six sigma green belt certificate. \n• Deep understanding on statistics, DOE, SPC etc. \n• Familiar with JMP, SQL, C, VB, Excel etc. \n• Good communication skills and influence capabilities. \n• Strong leadership and management skills. \n• Good knowledge on process integration, yield enhancement. • Critical thinking and highly skilled problem-solving ability.  \n• Expert on data mining, analysis and interpretation.  \n• Comprehensive knowledge and rich experiences on project management, with PMP certificate. \n• Rich practices on continuous improvement, with LEAN six sigma green belt certificate. \n• Deep understanding on statistics, DOE, SPC etc. \n• Familiar with JMP, SQL, C, VB, Excel etc. \n• Good communication skills and influence capabilities. \n• Strong leadership and management skills. \n• Good knowledge on process integration, yield enhancement. • Critical thinking and highly skilled problem-solving ability.  \n• Expert on data mining, analysis and interpretation.  \n• Comprehensive knowledge and rich experiences on project management, with PMP certificate. \n• Rich practices on continuous improvement, with LEAN six sigma green belt certificate. \n• Deep understanding on statistics, DOE, SPC etc. \n• Familiar with JMP, SQL, C, VB, Excel etc. \n• Good communication skills and influence capabilities. \n• Strong leadership and management skills. \n• Good knowledge on process integration, yield enhancement. Experience RDA Excursion Engineer IM Flash July 2015  – Present (2 months) Lehi Yield Engineer - Frontend defect reduction Intel Corporation July 2014  – Present (1 year 2 months) F68 Dalian • Acting as team leader, enhanced the strength of team members, managed the team to work closely and effectively, properly adjusted the team to fit situation changing. Successfully lead the team to keep excellent sustaining with limited resources. Yield Engineer - Frontend defect reduction Intel Corporation July 2012  –  June 2014  (2 years) F68 Dalian • Led tons of taskforce, successfully resolve plenty of complex technical issues by actively implementing LEAN methodology.  \n• Achieved total 30% defect reduction brilliant results by coming up smart ideas, making elaborate plans, and excuting detailed implementation work.  \n• As project organizer, consciously use PMP mindset and methodology to manage project progress in different phases (eg. Initiating, executing and monitoring etc.), by which smooth project progress were well maintained.  \n• Strong data analysis and interpretation skills, good data sense with highly attention to details. Yield Engineer - Backend defect reduction Intel Corporation April 2010  –  June 2012  (2 years 3 months) F68 Dalian • Demonstrated fast learning capability to quickly ramp to be a qualified engineer in short time before taking the key role in start-up.  \n• Acted as key member to successfully start up the 1st Intel Asian green field fab, led and contributed to numerous task force to achieve great results.  \n• Rich experiences of starting up the quality control system, including system setting up, procedure standardization, and people preparation, etc.  \n• Achieving best in class excellent sustaining results by detailed analysis work, rapid follow up, and closely team work with a broad range of members. RDA Excursion Engineer IM Flash July 2015  – Present (2 months) Lehi RDA Excursion Engineer IM Flash July 2015  – Present (2 months) Lehi Yield Engineer - Frontend defect reduction Intel Corporation July 2014  – Present (1 year 2 months) F68 Dalian • Acting as team leader, enhanced the strength of team members, managed the team to work closely and effectively, properly adjusted the team to fit situation changing. Successfully lead the team to keep excellent sustaining with limited resources. Yield Engineer - Frontend defect reduction Intel Corporation July 2014  – Present (1 year 2 months) F68 Dalian • Acting as team leader, enhanced the strength of team members, managed the team to work closely and effectively, properly adjusted the team to fit situation changing. Successfully lead the team to keep excellent sustaining with limited resources. Yield Engineer - Frontend defect reduction Intel Corporation July 2012  –  June 2014  (2 years) F68 Dalian • Led tons of taskforce, successfully resolve plenty of complex technical issues by actively implementing LEAN methodology.  \n• Achieved total 30% defect reduction brilliant results by coming up smart ideas, making elaborate plans, and excuting detailed implementation work.  \n• As project organizer, consciously use PMP mindset and methodology to manage project progress in different phases (eg. Initiating, executing and monitoring etc.), by which smooth project progress were well maintained.  \n• Strong data analysis and interpretation skills, good data sense with highly attention to details. Yield Engineer - Frontend defect reduction Intel Corporation July 2012  –  June 2014  (2 years) F68 Dalian • Led tons of taskforce, successfully resolve plenty of complex technical issues by actively implementing LEAN methodology.  \n• Achieved total 30% defect reduction brilliant results by coming up smart ideas, making elaborate plans, and excuting detailed implementation work.  \n• As project organizer, consciously use PMP mindset and methodology to manage project progress in different phases (eg. Initiating, executing and monitoring etc.), by which smooth project progress were well maintained.  \n• Strong data analysis and interpretation skills, good data sense with highly attention to details. Yield Engineer - Backend defect reduction Intel Corporation April 2010  –  June 2012  (2 years 3 months) F68 Dalian • Demonstrated fast learning capability to quickly ramp to be a qualified engineer in short time before taking the key role in start-up.  \n• Acted as key member to successfully start up the 1st Intel Asian green field fab, led and contributed to numerous task force to achieve great results.  \n• Rich experiences of starting up the quality control system, including system setting up, procedure standardization, and people preparation, etc.  \n• Achieving best in class excellent sustaining results by detailed analysis work, rapid follow up, and closely team work with a broad range of members. Yield Engineer - Backend defect reduction Intel Corporation April 2010  –  June 2012  (2 years 3 months) F68 Dalian • Demonstrated fast learning capability to quickly ramp to be a qualified engineer in short time before taking the key role in start-up.  \n• Acted as key member to successfully start up the 1st Intel Asian green field fab, led and contributed to numerous task force to achieve great results.  \n• Rich experiences of starting up the quality control system, including system setting up, procedure standardization, and people preparation, etc.  \n• Achieving best in class excellent sustaining results by detailed analysis work, rapid follow up, and closely team work with a broad range of members. Languages Chinese Native or bilingual proficiency English Professional working proficiency Chinese Native or bilingual proficiency English Professional working proficiency Chinese Native or bilingual proficiency English Professional working proficiency Native or bilingual proficiency Professional working proficiency Skills Data Analysis Problem Solving Critical Thinking PMP Lean Six Sigma Process Integration JMP Design of Experiments Semiconductors Process Engineering Yield Failure Analysis Start-ups Semiconductor Process Device Characterization Lean Manufacturing Defect Elimination Presentation Skills Statistics Influence Others Stakeholder Management SPC IC Semiconductor Industry See 9+     See less Skills  Data Analysis Problem Solving Critical Thinking PMP Lean Six Sigma Process Integration JMP Design of Experiments Semiconductors Process Engineering Yield Failure Analysis Start-ups Semiconductor Process Device Characterization Lean Manufacturing Defect Elimination Presentation Skills Statistics Influence Others Stakeholder Management SPC IC Semiconductor Industry See 9+     See less Data Analysis Problem Solving Critical Thinking PMP Lean Six Sigma Process Integration JMP Design of Experiments Semiconductors Process Engineering Yield Failure Analysis Start-ups Semiconductor Process Device Characterization Lean Manufacturing Defect Elimination Presentation Skills Statistics Influence Others Stakeholder Management SPC IC Semiconductor Industry See 9+     See less Data Analysis Problem Solving Critical Thinking PMP Lean Six Sigma Process Integration JMP Design of Experiments Semiconductors Process Engineering Yield Failure Analysis Start-ups Semiconductor Process Device Characterization Lean Manufacturing Defect Elimination Presentation Skills Statistics Influence Others Stakeholder Management SPC IC Semiconductor Industry See 9+     See less Education Shanghai Jiao Tong University Master's degree,  Microelectronics 2007  – 2010 Central South University Bachelor's degree,  Materials Science and Engineering 2003  – 2007 Shanghai Jiao Tong University Master's degree,  Microelectronics 2007  – 2010 Shanghai Jiao Tong University Master's degree,  Microelectronics 2007  – 2010 Shanghai Jiao Tong University Master's degree,  Microelectronics 2007  – 2010 Central South University Bachelor's degree,  Materials Science and Engineering 2003  – 2007 Central South University Bachelor's degree,  Materials Science and Engineering 2003  – 2007 Central South University Bachelor's degree,  Materials Science and Engineering 2003  – 2007 ", "Experience Analog Design Engineer Intel Corporation February 2014  – Present (1 year 7 months) Portland, Oregon Area Senior Device Engineer Intel Corporation February 2011  –  January 2014  (3 years) Senior Yield Engineer Intel Corporation February 2009  –  January 2011  (2 years) Defect metrology for 32nm technology Analog Design Engineer Intel Corporation February 2014  – Present (1 year 7 months) Portland, Oregon Area Analog Design Engineer Intel Corporation February 2014  – Present (1 year 7 months) Portland, Oregon Area Senior Device Engineer Intel Corporation February 2011  –  January 2014  (3 years) Senior Device Engineer Intel Corporation February 2011  –  January 2014  (3 years) Senior Yield Engineer Intel Corporation February 2009  –  January 2011  (2 years) Defect metrology for 32nm technology Senior Yield Engineer Intel Corporation February 2009  –  January 2011  (2 years) Defect metrology for 32nm technology Skills Thin Films CMOS Characterization Silicon JMP IC Skills  Thin Films CMOS Characterization Silicon JMP IC Thin Films CMOS Characterization Silicon JMP IC Thin Films CMOS Characterization Silicon JMP IC Education University of Michigan Ph. D,  Electrical Engineering 2004  – 2008 University of Michigan M.S,  Electrical Engineering 2002  – 2004 Yonsei University B.S,  Electronic Engineering 1995  – 2001 University of Michigan Ph. D,  Electrical Engineering 2004  – 2008 University of Michigan Ph. D,  Electrical Engineering 2004  – 2008 University of Michigan Ph. D,  Electrical Engineering 2004  – 2008 University of Michigan M.S,  Electrical Engineering 2002  – 2004 University of Michigan M.S,  Electrical Engineering 2002  – 2004 University of Michigan M.S,  Electrical Engineering 2002  – 2004 Yonsei University B.S,  Electronic Engineering 1995  – 2001 Yonsei University B.S,  Electronic Engineering 1995  – 2001 Yonsei University B.S,  Electronic Engineering 1995  – 2001 ", "Experience BE Integration Manager Intel July 2006  –  March 2013  (6 years 9 months) Portland, Oregon Area Senior yield engineer Intel Corporation July 2000  –  July 2006  (6 years 1 month) Ireland Process Engineer Motorola 1996  –  2000  (4 years) BE Integration Manager Intel July 2006  –  March 2013  (6 years 9 months) Portland, Oregon Area BE Integration Manager Intel July 2006  –  March 2013  (6 years 9 months) Portland, Oregon Area Senior yield engineer Intel Corporation July 2000  –  July 2006  (6 years 1 month) Ireland Senior yield engineer Intel Corporation July 2000  –  July 2006  (6 years 1 month) Ireland Process Engineer Motorola 1996  –  2000  (4 years) Process Engineer Motorola 1996  –  2000  (4 years) Skills JMP Process Integration Semiconductors Skills  JMP Process Integration Semiconductors JMP Process Integration Semiconductors JMP Process Integration Semiconductors Education University of Strathclyde PhD,  Semiconductor Elecrochemistry 1992  – 1996 University of Strathclyde PhD,  Semiconductor Elecrochemistry 1992  – 1996 University of Strathclyde PhD,  Semiconductor Elecrochemistry 1992  – 1996 University of Strathclyde PhD,  Semiconductor Elecrochemistry 1992  – 1996 ", "Experience Senior Yield Engineer Intel Corporation 2009  – Present (6 years) Intel Corporation Utilize independent judgment to design, develop, plan, execute and implement scientific and laboratory research projects to fuel growth in the areas of computing, communication, and technology. Assess feasibility of concepts to potential inventions and products prior to product roadmap. Maintain substantial knowledge of state-of-the-art principles and theories, and contribute to scientific literature and conferences. Participate in development of intellectual property Research and Development Scientist Centre of Research in Engineering Surface Technologies January 2008  –  December 2008  (1 year) Dublin 8 Apply Chemical theory and methods to collect, organize, interpret, and summarize engineering data. Formulate, plan, and execute analytic projects and serve as a technical expert on all phases of study design, data analysis, and statistical interpretation of the results relating to projects under consideration Lithography Research Scientist Intel Corporation January 2007  –  December 2007  (1 year) Intel Corporation Ireland Develop and drive process improvements on material and equipment to meet quality, reliability, cost, yield, productivity and manufacturability requirements. Plan and conduct experiments to fully characterize the process throughout the development cycle. Establish process control systems and develop strategies to resolve problems. Design, create, and support processes for high volume manufacturing. Senior Yield Engineer Intel Corporation 2009  – Present (6 years) Intel Corporation Utilize independent judgment to design, develop, plan, execute and implement scientific and laboratory research projects to fuel growth in the areas of computing, communication, and technology. Assess feasibility of concepts to potential inventions and products prior to product roadmap. Maintain substantial knowledge of state-of-the-art principles and theories, and contribute to scientific literature and conferences. Participate in development of intellectual property Senior Yield Engineer Intel Corporation 2009  – Present (6 years) Intel Corporation Utilize independent judgment to design, develop, plan, execute and implement scientific and laboratory research projects to fuel growth in the areas of computing, communication, and technology. Assess feasibility of concepts to potential inventions and products prior to product roadmap. Maintain substantial knowledge of state-of-the-art principles and theories, and contribute to scientific literature and conferences. Participate in development of intellectual property Research and Development Scientist Centre of Research in Engineering Surface Technologies January 2008  –  December 2008  (1 year) Dublin 8 Apply Chemical theory and methods to collect, organize, interpret, and summarize engineering data. Formulate, plan, and execute analytic projects and serve as a technical expert on all phases of study design, data analysis, and statistical interpretation of the results relating to projects under consideration Research and Development Scientist Centre of Research in Engineering Surface Technologies January 2008  –  December 2008  (1 year) Dublin 8 Apply Chemical theory and methods to collect, organize, interpret, and summarize engineering data. Formulate, plan, and execute analytic projects and serve as a technical expert on all phases of study design, data analysis, and statistical interpretation of the results relating to projects under consideration Lithography Research Scientist Intel Corporation January 2007  –  December 2007  (1 year) Intel Corporation Ireland Develop and drive process improvements on material and equipment to meet quality, reliability, cost, yield, productivity and manufacturability requirements. Plan and conduct experiments to fully characterize the process throughout the development cycle. Establish process control systems and develop strategies to resolve problems. Design, create, and support processes for high volume manufacturing. Lithography Research Scientist Intel Corporation January 2007  –  December 2007  (1 year) Intel Corporation Ireland Develop and drive process improvements on material and equipment to meet quality, reliability, cost, yield, productivity and manufacturability requirements. Plan and conduct experiments to fully characterize the process throughout the development cycle. Establish process control systems and develop strategies to resolve problems. Design, create, and support processes for high volume manufacturing. Languages German Professional working proficiency English Native or bilingual proficiency Irish Native or bilingual proficiency German Professional working proficiency English Native or bilingual proficiency Irish Native or bilingual proficiency German Professional working proficiency English Native or bilingual proficiency Irish Native or bilingual proficiency Professional working proficiency Native or bilingual proficiency Native or bilingual proficiency Skills Experimentation Nanomaterials Fluorescence... Regenerative Medicine Spectroscopy Electron Beam... Surface Chemistry Pharmacology Pharmaceutical Research Biochemistry Molecular Biology Semiconductor Design Semiconductor... SEM UV mapping Mathematical Analysis Mathematical Programming Statistical Modeling SQL JMP Analytical Chemistry Computational Chemistry Physical Chemistry Medicinal Chemistry Polymer Chemistry Process Modeling Semiconductors See 12+     See less Skills  Experimentation Nanomaterials Fluorescence... Regenerative Medicine Spectroscopy Electron Beam... Surface Chemistry Pharmacology Pharmaceutical Research Biochemistry Molecular Biology Semiconductor Design Semiconductor... SEM UV mapping Mathematical Analysis Mathematical Programming Statistical Modeling SQL JMP Analytical Chemistry Computational Chemistry Physical Chemistry Medicinal Chemistry Polymer Chemistry Process Modeling Semiconductors See 12+     See less Experimentation Nanomaterials Fluorescence... Regenerative Medicine Spectroscopy Electron Beam... Surface Chemistry Pharmacology Pharmaceutical Research Biochemistry Molecular Biology Semiconductor Design Semiconductor... SEM UV mapping Mathematical Analysis Mathematical Programming Statistical Modeling SQL JMP Analytical Chemistry Computational Chemistry Physical Chemistry Medicinal Chemistry Polymer Chemistry Process Modeling Semiconductors See 12+     See less Experimentation Nanomaterials Fluorescence... Regenerative Medicine Spectroscopy Electron Beam... Surface Chemistry Pharmacology Pharmaceutical Research Biochemistry Molecular Biology Semiconductor Design Semiconductor... SEM UV mapping Mathematical Analysis Mathematical Programming Statistical Modeling SQL JMP Analytical Chemistry Computational Chemistry Physical Chemistry Medicinal Chemistry Polymer Chemistry Process Modeling Semiconductors See 12+     See less Education Massachusetts Institute of Technology Professional Development Certificate,  Decision-Making , Design, and Strategy Under Uncertainty , 4.0 2011  – 2011 Trinity College, Dublin Master of Science (M.Sc.),  Chemistry , 4.0 2008  – 2010 Massachusetts Institute of Technology Professional Development Certificate,  Decision-Making , Design, and Strategy Under Uncertainty , 4.0 2011  – 2011 Massachusetts Institute of Technology Professional Development Certificate,  Decision-Making , Design, and Strategy Under Uncertainty , 4.0 2011  – 2011 Massachusetts Institute of Technology Professional Development Certificate,  Decision-Making , Design, and Strategy Under Uncertainty , 4.0 2011  – 2011 Trinity College, Dublin Master of Science (M.Sc.),  Chemistry , 4.0 2008  – 2010 Trinity College, Dublin Master of Science (M.Sc.),  Chemistry , 4.0 2008  – 2010 Trinity College, Dublin Master of Science (M.Sc.),  Chemistry , 4.0 2008  – 2010 ", "Summary Electrical Engineer with 8 years of safety engineering experience that includes subject matter expert in office and industrial ergonomics, subject matter expert in electrical safety, Environmental Safety and Health Coordinator, program and project management, engineered safety, mistake-proofing, loss control and quality analysis to improve safety and reduce risk. Over 7 years of semiconductor manufacturing experience that included flash and logic processes, failure analysis, statistical analysis, improve process optimization aligned with Lean Manufacturing methodologies. Proven excellent leadership, analytical, communication, and interpersonal skills with the expertise and skill to lead team efforts to identify and resolve complex design and process issues. Summary Electrical Engineer with 8 years of safety engineering experience that includes subject matter expert in office and industrial ergonomics, subject matter expert in electrical safety, Environmental Safety and Health Coordinator, program and project management, engineered safety, mistake-proofing, loss control and quality analysis to improve safety and reduce risk. Over 7 years of semiconductor manufacturing experience that included flash and logic processes, failure analysis, statistical analysis, improve process optimization aligned with Lean Manufacturing methodologies. Proven excellent leadership, analytical, communication, and interpersonal skills with the expertise and skill to lead team efforts to identify and resolve complex design and process issues. Electrical Engineer with 8 years of safety engineering experience that includes subject matter expert in office and industrial ergonomics, subject matter expert in electrical safety, Environmental Safety and Health Coordinator, program and project management, engineered safety, mistake-proofing, loss control and quality analysis to improve safety and reduce risk. Over 7 years of semiconductor manufacturing experience that included flash and logic processes, failure analysis, statistical analysis, improve process optimization aligned with Lean Manufacturing methodologies. Proven excellent leadership, analytical, communication, and interpersonal skills with the expertise and skill to lead team efforts to identify and resolve complex design and process issues. Electrical Engineer with 8 years of safety engineering experience that includes subject matter expert in office and industrial ergonomics, subject matter expert in electrical safety, Environmental Safety and Health Coordinator, program and project management, engineered safety, mistake-proofing, loss control and quality analysis to improve safety and reduce risk. Over 7 years of semiconductor manufacturing experience that included flash and logic processes, failure analysis, statistical analysis, improve process optimization aligned with Lean Manufacturing methodologies. Proven excellent leadership, analytical, communication, and interpersonal skills with the expertise and skill to lead team efforts to identify and resolve complex design and process issues. Experience Safety Engineering Consultant Clover Leaf October 2013  – Present (1 year 11 months) Developed and implemented an ergonomics program for the University of New Mexico Campus to create and improve the programs processes and procedures. \n \nDeveloped and implemented risk self-assessment survey to use as a leading indicator to identify trends and promote safety education and awareness. \n \nConducted training as an ergonomics safety subject matter expert for proper lifting techniques and performing ergonomic assessments. \n \nImplemented an ergonomics demonstration room to allow individuals to use the ergonomic products before purchasing to ensure the products were sufficient to mitigate their discomfort. \n \nConducted ergonomic evaluations and recommended changes and ergonomic products to mitigate risks and discomfort in both the office and industrial environments. \n \nDeveloped and implemented LOCKOUT/TAGOUT program scope, training, and process and procedures for construction related activities for CTSI \n \nDeveloped and implemented Electrical Safety program scope, training, and process and procedures for construction related activities for CSTI Safety Engineer Sandia National Laboratories May 2008  –  September 2013  (5 years 5 months) Albuquerque, New Mexico Area Served as an electrical safety subject matter expert, responsible for providing technical expertise and customer support to multiple line organizations in regard to electrical safety requirements governed by National Fire Protection Association (NFPA), National Electric Code (NEC), and Occupational Safety and Health Association (OSHA). Senior Yield Engineer Intel Corporation June 2001  –  September 2007  (6 years 4 months) Analyzed product quality and reliability issues to ensure customer product commitments were on time and satisfied the quality and performance parameters. \n \nEvaluated and eliminated process redundancy, which resulted in a decrease of 12 hours of cycle time and cost savings of $6/unit resulting in an annual savings of $1.2 million. \n \nDeveloped and implemented self-sustaining systems to identify real-time issues by using automated data extraction scripts and automated statistical analysis tools to improve response time by 35% and reduce impact by approximately 14%. Safety Engineering Consultant Clover Leaf October 2013  – Present (1 year 11 months) Developed and implemented an ergonomics program for the University of New Mexico Campus to create and improve the programs processes and procedures. \n \nDeveloped and implemented risk self-assessment survey to use as a leading indicator to identify trends and promote safety education and awareness. \n \nConducted training as an ergonomics safety subject matter expert for proper lifting techniques and performing ergonomic assessments. \n \nImplemented an ergonomics demonstration room to allow individuals to use the ergonomic products before purchasing to ensure the products were sufficient to mitigate their discomfort. \n \nConducted ergonomic evaluations and recommended changes and ergonomic products to mitigate risks and discomfort in both the office and industrial environments. \n \nDeveloped and implemented LOCKOUT/TAGOUT program scope, training, and process and procedures for construction related activities for CTSI \n \nDeveloped and implemented Electrical Safety program scope, training, and process and procedures for construction related activities for CSTI Safety Engineering Consultant Clover Leaf October 2013  – Present (1 year 11 months) Developed and implemented an ergonomics program for the University of New Mexico Campus to create and improve the programs processes and procedures. \n \nDeveloped and implemented risk self-assessment survey to use as a leading indicator to identify trends and promote safety education and awareness. \n \nConducted training as an ergonomics safety subject matter expert for proper lifting techniques and performing ergonomic assessments. \n \nImplemented an ergonomics demonstration room to allow individuals to use the ergonomic products before purchasing to ensure the products were sufficient to mitigate their discomfort. \n \nConducted ergonomic evaluations and recommended changes and ergonomic products to mitigate risks and discomfort in both the office and industrial environments. \n \nDeveloped and implemented LOCKOUT/TAGOUT program scope, training, and process and procedures for construction related activities for CTSI \n \nDeveloped and implemented Electrical Safety program scope, training, and process and procedures for construction related activities for CSTI Safety Engineer Sandia National Laboratories May 2008  –  September 2013  (5 years 5 months) Albuquerque, New Mexico Area Served as an electrical safety subject matter expert, responsible for providing technical expertise and customer support to multiple line organizations in regard to electrical safety requirements governed by National Fire Protection Association (NFPA), National Electric Code (NEC), and Occupational Safety and Health Association (OSHA). Safety Engineer Sandia National Laboratories May 2008  –  September 2013  (5 years 5 months) Albuquerque, New Mexico Area Served as an electrical safety subject matter expert, responsible for providing technical expertise and customer support to multiple line organizations in regard to electrical safety requirements governed by National Fire Protection Association (NFPA), National Electric Code (NEC), and Occupational Safety and Health Association (OSHA). Senior Yield Engineer Intel Corporation June 2001  –  September 2007  (6 years 4 months) Analyzed product quality and reliability issues to ensure customer product commitments were on time and satisfied the quality and performance parameters. \n \nEvaluated and eliminated process redundancy, which resulted in a decrease of 12 hours of cycle time and cost savings of $6/unit resulting in an annual savings of $1.2 million. \n \nDeveloped and implemented self-sustaining systems to identify real-time issues by using automated data extraction scripts and automated statistical analysis tools to improve response time by 35% and reduce impact by approximately 14%. Senior Yield Engineer Intel Corporation June 2001  –  September 2007  (6 years 4 months) Analyzed product quality and reliability issues to ensure customer product commitments were on time and satisfied the quality and performance parameters. \n \nEvaluated and eliminated process redundancy, which resulted in a decrease of 12 hours of cycle time and cost savings of $6/unit resulting in an annual savings of $1.2 million. \n \nDeveloped and implemented self-sustaining systems to identify real-time issues by using automated data extraction scripts and automated statistical analysis tools to improve response time by 35% and reduce impact by approximately 14%. Skills Engineering Systems Engineering Failure Analysis Simulations Engineering Management Labview System Design Root Cause Analysis Finite Element Analysis Matlab Embedded Systems Sensors Earned Value Management Software Engineering Electrical Engineering Spacecraft DoD Solidworks Signal Processing Radar Inspection Electronics Space Systems Fortran Digital Signal... Automation Optics Configuration Management Design for Manufacturing FPGA Testing Pro Engineer Requirements Management Security Clearance System Architecture Simulink Robotics Algorithms Aerospace Embedded Software Hardware Architecture Design of Experiments Semiconductors Microcontrollers Test Equipment Fault Tree Analysis Reliability Engineering Reliability Test Engineering SharePoint See 35+     See less Skills  Engineering Systems Engineering Failure Analysis Simulations Engineering Management Labview System Design Root Cause Analysis Finite Element Analysis Matlab Embedded Systems Sensors Earned Value Management Software Engineering Electrical Engineering Spacecraft DoD Solidworks Signal Processing Radar Inspection Electronics Space Systems Fortran Digital Signal... Automation Optics Configuration Management Design for Manufacturing FPGA Testing Pro Engineer Requirements Management Security Clearance System Architecture Simulink Robotics Algorithms Aerospace Embedded Software Hardware Architecture Design of Experiments Semiconductors Microcontrollers Test Equipment Fault Tree Analysis Reliability Engineering Reliability Test Engineering SharePoint See 35+     See less Engineering Systems Engineering Failure Analysis Simulations Engineering Management Labview System Design Root Cause Analysis Finite Element Analysis Matlab Embedded Systems Sensors Earned Value Management Software Engineering Electrical Engineering Spacecraft DoD Solidworks Signal Processing Radar Inspection Electronics Space Systems Fortran Digital Signal... Automation Optics Configuration Management Design for Manufacturing FPGA Testing Pro Engineer Requirements Management Security Clearance System Architecture Simulink Robotics Algorithms Aerospace Embedded Software Hardware Architecture Design of Experiments Semiconductors Microcontrollers Test Equipment Fault Tree Analysis Reliability Engineering Reliability Test Engineering SharePoint See 35+     See less Engineering Systems Engineering Failure Analysis Simulations Engineering Management Labview System Design Root Cause Analysis Finite Element Analysis Matlab Embedded Systems Sensors Earned Value Management Software Engineering Electrical Engineering Spacecraft DoD Solidworks Signal Processing Radar Inspection Electronics Space Systems Fortran Digital Signal... Automation Optics Configuration Management Design for Manufacturing FPGA Testing Pro Engineer Requirements Management Security Clearance System Architecture Simulink Robotics Algorithms Aerospace Embedded Software Hardware Architecture Design of Experiments Semiconductors Microcontrollers Test Equipment Fault Tree Analysis Reliability Engineering Reliability Test Engineering SharePoint See 35+     See less Education New Mexico Institute of Mining and Technology Master of Science (M.S.),  Engineering/Industrial Management 2010  – 2012 New Mexico Institute of Mining and Technology Bachelor of Engineering (B.E.),  Electrical and Electronics Engineering 1996  – 2001 Activities and Societies:  Tau Beta Pi - National Honor Society for Engineers New Mexico Institute of Mining and Technology Master of Science (M.S.),  Engineering/Industrial Management 2010  – 2012 New Mexico Institute of Mining and Technology Master of Science (M.S.),  Engineering/Industrial Management 2010  – 2012 New Mexico Institute of Mining and Technology Master of Science (M.S.),  Engineering/Industrial Management 2010  – 2012 New Mexico Institute of Mining and Technology Bachelor of Engineering (B.E.),  Electrical and Electronics Engineering 1996  – 2001 Activities and Societies:  Tau Beta Pi - National Honor Society for Engineers New Mexico Institute of Mining and Technology Bachelor of Engineering (B.E.),  Electrical and Electronics Engineering 1996  – 2001 Activities and Societies:  Tau Beta Pi - National Honor Society for Engineers New Mexico Institute of Mining and Technology Bachelor of Engineering (B.E.),  Electrical and Electronics Engineering 1996  – 2001 Activities and Societies:  Tau Beta Pi - National Honor Society for Engineers ", "Experience PhD University of Amsterdam April 2010  –  August 2014  (4 years 5 months) Amsterdasm - Design and perform experiments with equipments such as nanosecond ArF and XeCl excimer lasers, pulsed dye laser, Nd:YAG laser, linear and reflectron time-of-flight mass spectrometer, pulsed nozzle, and high vacuum pumps. \n- Aligning of lasers and optics for second and third harmonic generation, difference frequency mixing to perform 3-laser experiments utilising REMPI, hole-burning, depletion, and delayed ionisation techniques. \n- Spectroscopic study of the intrinsic properties of biological proteins’ chromophore and building block of molecular machine with multi-photon ionisation technique to discover the responses and motion upon light absorption. \n- Computational studies with DFT and TDDFT methods to simulate energy levels of molecules, conformational proper-ties and Franck-Condon spectrum with quantum chemical calculation using Gaussian09 and Turbomole. \n- Teach and advise undergraduate and graduate students, and supervise their research. \n \nPublications: \n \n[1]\tTan, Eric MM, et al. Fast photodynamics of azobenzene probed by scanning the excited state potential energy surfaces using slow spectroscopy. Nature Comm. 2015, 6, 5860. \n[2]\tTan, Eric MM, et al. Excited-state dynamics of isolated and microsolvated cinnamate based UV-B sunscreen, J Phys. Chem. Lett. 2014, 5, 2464-2468. \n[3]\tTan, Eric MM, et al. Molecular beam and ab-initio studies of Photoactive Yellow Protein chromophores: the influ-ence of the thioester functionality and single bond rotation. J Phys. Chem. B 2014, 118, 12395-12403.  \n[4]\tTan, Eric MM, et al. J Phys. Chem. B 2013, 117 (17), 4798-4805. \n[5]\tTan, Eric MM, et al. Excited state dynamics of Photoactive Yellow Protein chromophores elucidated by high-resolution spectroscopy and ab initio calculations. Faraday Discussions 2013, 163, 321-240. \n[6]\tSmolarek, S; Vdovin, A; Tan, Eric MM, et al. Phys. Chem. Chem. Phys. 2011, 13, 4393-4399. \n[7]\tSmolarek, S; Vdovin, A; Tan, Eric MM, et al. J. Phys. Chem. B 2011, 115, 1275-1281. Senior yield engineer Intel Corporation June 2006  –  July 2008  (2 years 2 months) Malaysia Worked in an assembly and test of ball grid array packaging manufacturing. Responsible in yield enhancement management, quality and reliability assessment and setting up of SPC with statistical methods with JMP. \n \n•\tDrive yield improvement projects together with product engineers by implementing early detection system and processes for production testing. \n•\tDevise a failure parameter detection system with statistical methods for manufacturing engineers, product engineers and reliability engineers on lot disposition and logistics for reliability screening. \n•\tFacilitate process improvements by designing manufacturing experiments with statistical sample size to check process-s, equipments and new materials used in the production line. \n•\tCross correlation analysis on fab e-test data with assembly test data followed by weekly collaboration with wafer fabrication plant, assembly plant to investigate root cause of low yield. \n•\tSetting up statistical process control for assembly process and test equipment based on pareto, normal distribution and confidence interval. \n•\tLeading a task team to resolve customer issues and provide technical explanations to managers and customers. Photolithography Process Engineer Silterra April 2005  –  June 2006  (1 year 3 months) Malaysia Worked in a 200mm wafer fabrication foundry manufacturing 0.18u and 0.22u CMOS technology. Responsible in the photolithography process of printing polysilicon layer and worked closely in collaboration with diffusion, etching and yield department. \n \n•\tSustaining and optimizing 200mm 0.18u and 0.22u CMOS technology photolithography process for the polysilicon and shallow trench isolation layer. Overlay and CD monitoring on the statistical process control charts and immediate reaction in the production line. \n•\tQualifying ASML deep UV scanner, metrology tools and process recipe to meet process requirements for production. \n•\tFacilitates yield improvement by collaborating with yield, etch and diffusion departments to design and execute exper-imental plans in the cleanroom, analyze and interpret results. \n•\tCharacterization of iso, dense lines, sram process windows, validate inter and intra-field performance of different scan-ners, optimization of CDSEM and registration metrology parameters, comparison of new batch of photoresist and BARC. \n•\tDesign process flow charts for manufacturing and technical personnel in the production line for lot disposition. \n•\tEnsure process capabilities with statistical methods. PhD University of Amsterdam April 2010  –  August 2014  (4 years 5 months) Amsterdasm - Design and perform experiments with equipments such as nanosecond ArF and XeCl excimer lasers, pulsed dye laser, Nd:YAG laser, linear and reflectron time-of-flight mass spectrometer, pulsed nozzle, and high vacuum pumps. \n- Aligning of lasers and optics for second and third harmonic generation, difference frequency mixing to perform 3-laser experiments utilising REMPI, hole-burning, depletion, and delayed ionisation techniques. \n- Spectroscopic study of the intrinsic properties of biological proteins’ chromophore and building block of molecular machine with multi-photon ionisation technique to discover the responses and motion upon light absorption. \n- Computational studies with DFT and TDDFT methods to simulate energy levels of molecules, conformational proper-ties and Franck-Condon spectrum with quantum chemical calculation using Gaussian09 and Turbomole. \n- Teach and advise undergraduate and graduate students, and supervise their research. \n \nPublications: \n \n[1]\tTan, Eric MM, et al. Fast photodynamics of azobenzene probed by scanning the excited state potential energy surfaces using slow spectroscopy. Nature Comm. 2015, 6, 5860. \n[2]\tTan, Eric MM, et al. Excited-state dynamics of isolated and microsolvated cinnamate based UV-B sunscreen, J Phys. Chem. Lett. 2014, 5, 2464-2468. \n[3]\tTan, Eric MM, et al. Molecular beam and ab-initio studies of Photoactive Yellow Protein chromophores: the influ-ence of the thioester functionality and single bond rotation. J Phys. Chem. B 2014, 118, 12395-12403.  \n[4]\tTan, Eric MM, et al. J Phys. Chem. B 2013, 117 (17), 4798-4805. \n[5]\tTan, Eric MM, et al. Excited state dynamics of Photoactive Yellow Protein chromophores elucidated by high-resolution spectroscopy and ab initio calculations. Faraday Discussions 2013, 163, 321-240. \n[6]\tSmolarek, S; Vdovin, A; Tan, Eric MM, et al. Phys. Chem. Chem. Phys. 2011, 13, 4393-4399. \n[7]\tSmolarek, S; Vdovin, A; Tan, Eric MM, et al. J. Phys. Chem. B 2011, 115, 1275-1281. PhD University of Amsterdam April 2010  –  August 2014  (4 years 5 months) Amsterdasm - Design and perform experiments with equipments such as nanosecond ArF and XeCl excimer lasers, pulsed dye laser, Nd:YAG laser, linear and reflectron time-of-flight mass spectrometer, pulsed nozzle, and high vacuum pumps. \n- Aligning of lasers and optics for second and third harmonic generation, difference frequency mixing to perform 3-laser experiments utilising REMPI, hole-burning, depletion, and delayed ionisation techniques. \n- Spectroscopic study of the intrinsic properties of biological proteins’ chromophore and building block of molecular machine with multi-photon ionisation technique to discover the responses and motion upon light absorption. \n- Computational studies with DFT and TDDFT methods to simulate energy levels of molecules, conformational proper-ties and Franck-Condon spectrum with quantum chemical calculation using Gaussian09 and Turbomole. \n- Teach and advise undergraduate and graduate students, and supervise their research. \n \nPublications: \n \n[1]\tTan, Eric MM, et al. Fast photodynamics of azobenzene probed by scanning the excited state potential energy surfaces using slow spectroscopy. Nature Comm. 2015, 6, 5860. \n[2]\tTan, Eric MM, et al. Excited-state dynamics of isolated and microsolvated cinnamate based UV-B sunscreen, J Phys. Chem. Lett. 2014, 5, 2464-2468. \n[3]\tTan, Eric MM, et al. Molecular beam and ab-initio studies of Photoactive Yellow Protein chromophores: the influ-ence of the thioester functionality and single bond rotation. J Phys. Chem. B 2014, 118, 12395-12403.  \n[4]\tTan, Eric MM, et al. J Phys. Chem. B 2013, 117 (17), 4798-4805. \n[5]\tTan, Eric MM, et al. Excited state dynamics of Photoactive Yellow Protein chromophores elucidated by high-resolution spectroscopy and ab initio calculations. Faraday Discussions 2013, 163, 321-240. \n[6]\tSmolarek, S; Vdovin, A; Tan, Eric MM, et al. Phys. Chem. Chem. Phys. 2011, 13, 4393-4399. \n[7]\tSmolarek, S; Vdovin, A; Tan, Eric MM, et al. J. Phys. Chem. B 2011, 115, 1275-1281. Senior yield engineer Intel Corporation June 2006  –  July 2008  (2 years 2 months) Malaysia Worked in an assembly and test of ball grid array packaging manufacturing. Responsible in yield enhancement management, quality and reliability assessment and setting up of SPC with statistical methods with JMP. \n \n•\tDrive yield improvement projects together with product engineers by implementing early detection system and processes for production testing. \n•\tDevise a failure parameter detection system with statistical methods for manufacturing engineers, product engineers and reliability engineers on lot disposition and logistics for reliability screening. \n•\tFacilitate process improvements by designing manufacturing experiments with statistical sample size to check process-s, equipments and new materials used in the production line. \n•\tCross correlation analysis on fab e-test data with assembly test data followed by weekly collaboration with wafer fabrication plant, assembly plant to investigate root cause of low yield. \n•\tSetting up statistical process control for assembly process and test equipment based on pareto, normal distribution and confidence interval. \n•\tLeading a task team to resolve customer issues and provide technical explanations to managers and customers. Senior yield engineer Intel Corporation June 2006  –  July 2008  (2 years 2 months) Malaysia Worked in an assembly and test of ball grid array packaging manufacturing. Responsible in yield enhancement management, quality and reliability assessment and setting up of SPC with statistical methods with JMP. \n \n•\tDrive yield improvement projects together with product engineers by implementing early detection system and processes for production testing. \n•\tDevise a failure parameter detection system with statistical methods for manufacturing engineers, product engineers and reliability engineers on lot disposition and logistics for reliability screening. \n•\tFacilitate process improvements by designing manufacturing experiments with statistical sample size to check process-s, equipments and new materials used in the production line. \n•\tCross correlation analysis on fab e-test data with assembly test data followed by weekly collaboration with wafer fabrication plant, assembly plant to investigate root cause of low yield. \n•\tSetting up statistical process control for assembly process and test equipment based on pareto, normal distribution and confidence interval. \n•\tLeading a task team to resolve customer issues and provide technical explanations to managers and customers. Photolithography Process Engineer Silterra April 2005  –  June 2006  (1 year 3 months) Malaysia Worked in a 200mm wafer fabrication foundry manufacturing 0.18u and 0.22u CMOS technology. Responsible in the photolithography process of printing polysilicon layer and worked closely in collaboration with diffusion, etching and yield department. \n \n•\tSustaining and optimizing 200mm 0.18u and 0.22u CMOS technology photolithography process for the polysilicon and shallow trench isolation layer. Overlay and CD monitoring on the statistical process control charts and immediate reaction in the production line. \n•\tQualifying ASML deep UV scanner, metrology tools and process recipe to meet process requirements for production. \n•\tFacilitates yield improvement by collaborating with yield, etch and diffusion departments to design and execute exper-imental plans in the cleanroom, analyze and interpret results. \n•\tCharacterization of iso, dense lines, sram process windows, validate inter and intra-field performance of different scan-ners, optimization of CDSEM and registration metrology parameters, comparison of new batch of photoresist and BARC. \n•\tDesign process flow charts for manufacturing and technical personnel in the production line for lot disposition. \n•\tEnsure process capabilities with statistical methods. Photolithography Process Engineer Silterra April 2005  –  June 2006  (1 year 3 months) Malaysia Worked in a 200mm wafer fabrication foundry manufacturing 0.18u and 0.22u CMOS technology. Responsible in the photolithography process of printing polysilicon layer and worked closely in collaboration with diffusion, etching and yield department. \n \n•\tSustaining and optimizing 200mm 0.18u and 0.22u CMOS technology photolithography process for the polysilicon and shallow trench isolation layer. Overlay and CD monitoring on the statistical process control charts and immediate reaction in the production line. \n•\tQualifying ASML deep UV scanner, metrology tools and process recipe to meet process requirements for production. \n•\tFacilitates yield improvement by collaborating with yield, etch and diffusion departments to design and execute exper-imental plans in the cleanroom, analyze and interpret results. \n•\tCharacterization of iso, dense lines, sram process windows, validate inter and intra-field performance of different scan-ners, optimization of CDSEM and registration metrology parameters, comparison of new batch of photoresist and BARC. \n•\tDesign process flow charts for manufacturing and technical personnel in the production line for lot disposition. \n•\tEnsure process capabilities with statistical methods. Languages English Native or bilingual proficiency Malay Native or bilingual proficiency Mandarin Limited working proficiency Cantonese Limited working proficiency Turkish Limited working proficiency English Native or bilingual proficiency Malay Native or bilingual proficiency Mandarin Limited working proficiency Cantonese Limited working proficiency Turkish Limited working proficiency English Native or bilingual proficiency Malay Native or bilingual proficiency Mandarin Limited working proficiency Cantonese Limited working proficiency Turkish Limited working proficiency Native or bilingual proficiency Native or bilingual proficiency Limited working proficiency Limited working proficiency Limited working proficiency Skills Photolithography Semiconductor... Spectroscopy Laser Optics Mass Spectrometry Molecular Modeling TOF-MS OriginLab REMPI Yield Management Semiconductor Packaging Semiconductor Failure... Organic Semiconductors Semiconductor Process... Mass Production IR spectroscopy OLEDs Vacuum Pumps JMP Statistical Data... Digital Photography Thin Film Coating Thin Film... Excimer Thermal Evaporation Optical Microscopy Ion Optics Material... Process Optimization Process Engineering Steady state Absorption... Gaussian 09 See 18+     See less Skills  Photolithography Semiconductor... Spectroscopy Laser Optics Mass Spectrometry Molecular Modeling TOF-MS OriginLab REMPI Yield Management Semiconductor Packaging Semiconductor Failure... Organic Semiconductors Semiconductor Process... Mass Production IR spectroscopy OLEDs Vacuum Pumps JMP Statistical Data... Digital Photography Thin Film Coating Thin Film... Excimer Thermal Evaporation Optical Microscopy Ion Optics Material... Process Optimization Process Engineering Steady state Absorption... Gaussian 09 See 18+     See less Photolithography Semiconductor... Spectroscopy Laser Optics Mass Spectrometry Molecular Modeling TOF-MS OriginLab REMPI Yield Management Semiconductor Packaging Semiconductor Failure... Organic Semiconductors Semiconductor Process... Mass Production IR spectroscopy OLEDs Vacuum Pumps JMP Statistical Data... Digital Photography Thin Film Coating Thin Film... Excimer Thermal Evaporation Optical Microscopy Ion Optics Material... Process Optimization Process Engineering Steady state Absorption... Gaussian 09 See 18+     See less Photolithography Semiconductor... Spectroscopy Laser Optics Mass Spectrometry Molecular Modeling TOF-MS OriginLab REMPI Yield Management Semiconductor Packaging Semiconductor Failure... Organic Semiconductors Semiconductor Process... Mass Production IR spectroscopy OLEDs Vacuum Pumps JMP Statistical Data... Digital Photography Thin Film Coating Thin Film... Excimer Thermal Evaporation Optical Microscopy Ion Optics Material... Process Optimization Process Engineering Steady state Absorption... Gaussian 09 See 18+     See less Education University of Amsterdam Doctor of Philosophy (PhD),  Physical Chemistry 2010  – 2014 Research on the fundamental and intrinsic properties of photo-activated molecules that occur in the ultrafast timescale of picoseconds up to femtoseconds. Molecules researched within the topic of interest include biomolecules like chromophore of Photoactive Yellow Protein (PYP), Green Fluorescent Protein (GFP), and azobenzene. With gas-phase spectroscopy and jet-cooled molecular beam tecnique, highly-resolved energy levels and vibrational modes in the excited states can be recorded. They are probed by techniques known as the resonance enhanced multi-photon ionization (REMPI), hole burning, and depletion. Dynamics of 'dark state' can be probed with delayed ionization. Combined with computational studies, we uncover vast information on the dynamics of the molecules which include lifetime of excited states, vertical and adiabatic energy levels, modes and mechanism of photoisomerization, conformations, and influence of proteins on the dynamics and properties of the molecules. The University of Sheffield Master of Science (MSc),  Nanoelectronics and nanomechanics 2008  – 2009 Designing and fabricating microcavity polariton electroluminiescence OLED. We investigated Forster energy transfer on a host-guest polymer that was used to develop the emissive layer of the OLED. At the same time designing a microcavity of which on one side an in-house grown indium tin oxide and on the other side capped with a highly reflective dielectric mirror (Distributed Bragg Reflector) constructed with plasma enhanced chemical vapor deposition (PECVD). Trapping the photon emitted by the emission layer, we precisely detuned the microcavity to induce strong coupling between photon and exciton within the microcavity. As the exciton and photon are in resonance, polariton (light-matter interaction) is generated and measurement of strong coupling can be inferred from a reflectivity spectra recorded at different detecting angles. Such coherence phenomena within a microcavity has potential application for polariton laser at room temperature. Multimedia University Bachelor of Engineering (B.Eng.),  Electrical and Electronics Engineering 2000  – 2005 Designing a ozonizer; a 20kV high-voltage circuit was designed and built to generate a plasma discharge between two discharge plates converting oxygen into ozone for the application of substrate cleaning. Various materials that were used for the discharge plates were characterized and flow of oxygen between the discharge plate were optimized to produce efficient amount of ozone. The high voltage circuit was put together into a home-built chamber that was equipped with exhaust fan and a UV lamp and reflector that is focused onto the substrate in the chamber. University of Amsterdam Doctor of Philosophy (PhD),  Physical Chemistry 2010  – 2014 Research on the fundamental and intrinsic properties of photo-activated molecules that occur in the ultrafast timescale of picoseconds up to femtoseconds. Molecules researched within the topic of interest include biomolecules like chromophore of Photoactive Yellow Protein (PYP), Green Fluorescent Protein (GFP), and azobenzene. With gas-phase spectroscopy and jet-cooled molecular beam tecnique, highly-resolved energy levels and vibrational modes in the excited states can be recorded. They are probed by techniques known as the resonance enhanced multi-photon ionization (REMPI), hole burning, and depletion. Dynamics of 'dark state' can be probed with delayed ionization. Combined with computational studies, we uncover vast information on the dynamics of the molecules which include lifetime of excited states, vertical and adiabatic energy levels, modes and mechanism of photoisomerization, conformations, and influence of proteins on the dynamics and properties of the molecules. University of Amsterdam Doctor of Philosophy (PhD),  Physical Chemistry 2010  – 2014 Research on the fundamental and intrinsic properties of photo-activated molecules that occur in the ultrafast timescale of picoseconds up to femtoseconds. Molecules researched within the topic of interest include biomolecules like chromophore of Photoactive Yellow Protein (PYP), Green Fluorescent Protein (GFP), and azobenzene. With gas-phase spectroscopy and jet-cooled molecular beam tecnique, highly-resolved energy levels and vibrational modes in the excited states can be recorded. They are probed by techniques known as the resonance enhanced multi-photon ionization (REMPI), hole burning, and depletion. Dynamics of 'dark state' can be probed with delayed ionization. Combined with computational studies, we uncover vast information on the dynamics of the molecules which include lifetime of excited states, vertical and adiabatic energy levels, modes and mechanism of photoisomerization, conformations, and influence of proteins on the dynamics and properties of the molecules. University of Amsterdam Doctor of Philosophy (PhD),  Physical Chemistry 2010  – 2014 Research on the fundamental and intrinsic properties of photo-activated molecules that occur in the ultrafast timescale of picoseconds up to femtoseconds. Molecules researched within the topic of interest include biomolecules like chromophore of Photoactive Yellow Protein (PYP), Green Fluorescent Protein (GFP), and azobenzene. With gas-phase spectroscopy and jet-cooled molecular beam tecnique, highly-resolved energy levels and vibrational modes in the excited states can be recorded. They are probed by techniques known as the resonance enhanced multi-photon ionization (REMPI), hole burning, and depletion. Dynamics of 'dark state' can be probed with delayed ionization. Combined with computational studies, we uncover vast information on the dynamics of the molecules which include lifetime of excited states, vertical and adiabatic energy levels, modes and mechanism of photoisomerization, conformations, and influence of proteins on the dynamics and properties of the molecules. The University of Sheffield Master of Science (MSc),  Nanoelectronics and nanomechanics 2008  – 2009 Designing and fabricating microcavity polariton electroluminiescence OLED. We investigated Forster energy transfer on a host-guest polymer that was used to develop the emissive layer of the OLED. At the same time designing a microcavity of which on one side an in-house grown indium tin oxide and on the other side capped with a highly reflective dielectric mirror (Distributed Bragg Reflector) constructed with plasma enhanced chemical vapor deposition (PECVD). Trapping the photon emitted by the emission layer, we precisely detuned the microcavity to induce strong coupling between photon and exciton within the microcavity. As the exciton and photon are in resonance, polariton (light-matter interaction) is generated and measurement of strong coupling can be inferred from a reflectivity spectra recorded at different detecting angles. Such coherence phenomena within a microcavity has potential application for polariton laser at room temperature. The University of Sheffield Master of Science (MSc),  Nanoelectronics and nanomechanics 2008  – 2009 Designing and fabricating microcavity polariton electroluminiescence OLED. We investigated Forster energy transfer on a host-guest polymer that was used to develop the emissive layer of the OLED. At the same time designing a microcavity of which on one side an in-house grown indium tin oxide and on the other side capped with a highly reflective dielectric mirror (Distributed Bragg Reflector) constructed with plasma enhanced chemical vapor deposition (PECVD). Trapping the photon emitted by the emission layer, we precisely detuned the microcavity to induce strong coupling between photon and exciton within the microcavity. As the exciton and photon are in resonance, polariton (light-matter interaction) is generated and measurement of strong coupling can be inferred from a reflectivity spectra recorded at different detecting angles. Such coherence phenomena within a microcavity has potential application for polariton laser at room temperature. The University of Sheffield Master of Science (MSc),  Nanoelectronics and nanomechanics 2008  – 2009 Designing and fabricating microcavity polariton electroluminiescence OLED. We investigated Forster energy transfer on a host-guest polymer that was used to develop the emissive layer of the OLED. At the same time designing a microcavity of which on one side an in-house grown indium tin oxide and on the other side capped with a highly reflective dielectric mirror (Distributed Bragg Reflector) constructed with plasma enhanced chemical vapor deposition (PECVD). Trapping the photon emitted by the emission layer, we precisely detuned the microcavity to induce strong coupling between photon and exciton within the microcavity. As the exciton and photon are in resonance, polariton (light-matter interaction) is generated and measurement of strong coupling can be inferred from a reflectivity spectra recorded at different detecting angles. Such coherence phenomena within a microcavity has potential application for polariton laser at room temperature. Multimedia University Bachelor of Engineering (B.Eng.),  Electrical and Electronics Engineering 2000  – 2005 Designing a ozonizer; a 20kV high-voltage circuit was designed and built to generate a plasma discharge between two discharge plates converting oxygen into ozone for the application of substrate cleaning. Various materials that were used for the discharge plates were characterized and flow of oxygen between the discharge plate were optimized to produce efficient amount of ozone. The high voltage circuit was put together into a home-built chamber that was equipped with exhaust fan and a UV lamp and reflector that is focused onto the substrate in the chamber. Multimedia University Bachelor of Engineering (B.Eng.),  Electrical and Electronics Engineering 2000  – 2005 Designing a ozonizer; a 20kV high-voltage circuit was designed and built to generate a plasma discharge between two discharge plates converting oxygen into ozone for the application of substrate cleaning. Various materials that were used for the discharge plates were characterized and flow of oxygen between the discharge plate were optimized to produce efficient amount of ozone. The high voltage circuit was put together into a home-built chamber that was equipped with exhaust fan and a UV lamp and reflector that is focused onto the substrate in the chamber. Multimedia University Bachelor of Engineering (B.Eng.),  Electrical and Electronics Engineering 2000  – 2005 Designing a ozonizer; a 20kV high-voltage circuit was designed and built to generate a plasma discharge between two discharge plates converting oxygen into ozone for the application of substrate cleaning. Various materials that were used for the discharge plates were characterized and flow of oxygen between the discharge plate were optimized to produce efficient amount of ozone. The high voltage circuit was put together into a home-built chamber that was equipped with exhaust fan and a UV lamp and reflector that is focused onto the substrate in the chamber. ", "Summary 10 years of defect reduction and yield enhencement FAB experiences in three different countries from 0.25um to 45nm processes in FAB start up, new technology transfer, ramp up and high volume manufacturing environments. Summary 10 years of defect reduction and yield enhencement FAB experiences in three different countries from 0.25um to 45nm processes in FAB start up, new technology transfer, ramp up and high volume manufacturing environments. 10 years of defect reduction and yield enhencement FAB experiences in three different countries from 0.25um to 45nm processes in FAB start up, new technology transfer, ramp up and high volume manufacturing environments. 10 years of defect reduction and yield enhencement FAB experiences in three different countries from 0.25um to 45nm processes in FAB start up, new technology transfer, ramp up and high volume manufacturing environments. Experience Senior Yield Engineer Intel Corporation October 2008  – Present (6 years 11 months) Fab68 Dalian Senior Yield Engineer GLOBALFOUNDRIES December 2005  –  October 2008  (2 years 11 months) Singapore -Chartered Semiconductor FAB7 Foundry Yield Engineer GLOBALFOUNDRIES October 2004  –  December 2005  (1 year 3 months) Singapore----Chartered Semiconductor Fab7 Engineer in YE Grace Semiconductor Manufacturing Corporation March 2003  –  September 2004  (1 year 7 months) Shanghai- 宏力半导体 Senior Yield Engineer Intel Corporation October 2008  – Present (6 years 11 months) Fab68 Dalian Senior Yield Engineer Intel Corporation October 2008  – Present (6 years 11 months) Fab68 Dalian Senior Yield Engineer GLOBALFOUNDRIES December 2005  –  October 2008  (2 years 11 months) Singapore -Chartered Semiconductor FAB7 Foundry Senior Yield Engineer GLOBALFOUNDRIES December 2005  –  October 2008  (2 years 11 months) Singapore -Chartered Semiconductor FAB7 Foundry Yield Engineer GLOBALFOUNDRIES October 2004  –  December 2005  (1 year 3 months) Singapore----Chartered Semiconductor Fab7 Yield Engineer GLOBALFOUNDRIES October 2004  –  December 2005  (1 year 3 months) Singapore----Chartered Semiconductor Fab7 Engineer in YE Grace Semiconductor Manufacturing Corporation March 2003  –  September 2004  (1 year 7 months) Shanghai- 宏力半导体 Engineer in YE Grace Semiconductor Manufacturing Corporation March 2003  –  September 2004  (1 year 7 months) Shanghai- 宏力半导体 Skills Yield Skills  Yield Yield Yield Education Shanghai University Master's degree,  Materials Science 1996  – 2003 Shanghai University Master's degree,  Materials Science 1996  – 2003 Shanghai University Master's degree,  Materials Science 1996  – 2003 Shanghai University Master's degree,  Materials Science 1996  – 2003 Honors & Awards Intel China AwardIntel Intel February 2011  Nominated as intel China Employee of the year 2012. Top Award to individual leadership or business team of intel worldwide. Intel China AwardIntel Intel February 2011  Nominated as intel China Employee of the year 2012. Top Award to individual leadership or business team of intel worldwide. Intel China AwardIntel Intel February 2011  Nominated as intel China Employee of the year 2012. Top Award to individual leadership or business team of intel worldwide. Intel China AwardIntel Intel February 2011  Nominated as intel China Employee of the year 2012. Top Award to individual leadership or business team of intel worldwide. ", "Skills Semiconductors Characterization Design of Experiments Thin Films Failure Analysis SPC Semiconductor Industry Process Engineering Nanotechnology JMP Materials Science R&D Silicon Simulations Skills  Semiconductors Characterization Design of Experiments Thin Films Failure Analysis SPC Semiconductor Industry Process Engineering Nanotechnology JMP Materials Science R&D Silicon Simulations Semiconductors Characterization Design of Experiments Thin Films Failure Analysis SPC Semiconductor Industry Process Engineering Nanotechnology JMP Materials Science R&D Silicon Simulations Semiconductors Characterization Design of Experiments Thin Films Failure Analysis SPC Semiconductor Industry Process Engineering Nanotechnology JMP Materials Science R&D Silicon Simulations ", "Summary Skilled engineer with over eight years of semiconductor and interconnect manufacturing experience both 200 and 300 mm on various process nodes varying from 90nm flash memory process and down to 14nm tri-gate logic processes,for both FE and BE.  \ngood background in new technologies start up , NPI, ramps and manufacturing process improvement along with HPM and lean principles.  \nStrong analytic, technical problem solving, and investigative skills using data mining and Interpreting SEM/TEM x sections and other analytic like SIMS/AFM etc. Summary Skilled engineer with over eight years of semiconductor and interconnect manufacturing experience both 200 and 300 mm on various process nodes varying from 90nm flash memory process and down to 14nm tri-gate logic processes,for both FE and BE.  \ngood background in new technologies start up , NPI, ramps and manufacturing process improvement along with HPM and lean principles.  \nStrong analytic, technical problem solving, and investigative skills using data mining and Interpreting SEM/TEM x sections and other analytic like SIMS/AFM etc. Skilled engineer with over eight years of semiconductor and interconnect manufacturing experience both 200 and 300 mm on various process nodes varying from 90nm flash memory process and down to 14nm tri-gate logic processes,for both FE and BE.  \ngood background in new technologies start up , NPI, ramps and manufacturing process improvement along with HPM and lean principles.  \nStrong analytic, technical problem solving, and investigative skills using data mining and Interpreting SEM/TEM x sections and other analytic like SIMS/AFM etc. Skilled engineer with over eight years of semiconductor and interconnect manufacturing experience both 200 and 300 mm on various process nodes varying from 90nm flash memory process and down to 14nm tri-gate logic processes,for both FE and BE.  \ngood background in new technologies start up , NPI, ramps and manufacturing process improvement along with HPM and lean principles.  \nStrong analytic, technical problem solving, and investigative skills using data mining and Interpreting SEM/TEM x sections and other analytic like SIMS/AFM etc. Experience Senior Yield Engineer Intel Corporation June 2012  – Present (3 years 3 months) Israel Late-stage process development and production ramp of 22 nm 300 mm copper interconnect technologies with expertise in patterning and etch processes( dry etch, and lithography )  \nLed teams of process, device, and yield engineers to identify and drive root cause closure for integrated process excursions and systematic issues, Assisted process engineers in the development, data collection, and analysis of process changes, and drove continuous improvement for integrated process technology issues as well as cost reduction. Drove analysis and response of inline parametric trends to ensure tool matching and on target performance Supervised and mentored process engineers. Process Engineer Intel Corporation October 2006  –  June 2012  (5 years 9 months) Israel Participated in the transfer and high volume ramp of 200 mm 90nm, 45 nm and 22 nm (300mm) as a diffusion process Eng. various diffusion process tool owner ( Kokusay and TEL vertical diffusion furnaces) Owned sustaining and preventive maintenance of semiconductor manufacturing of several processes such as CVD and special thermal oxide growth processes in various conditions/chemistries. Drove continuous improvement and cost reduction Partnered with end-of-line Fab to find root cause and solutions to downstream yield issues participated in several multi-factory shared learning teams to ensure factories remained matched for output, yield, and cost and to drive project implementation in lockstep Senior Yield Engineer Intel Corporation June 2012  – Present (3 years 3 months) Israel Late-stage process development and production ramp of 22 nm 300 mm copper interconnect technologies with expertise in patterning and etch processes( dry etch, and lithography )  \nLed teams of process, device, and yield engineers to identify and drive root cause closure for integrated process excursions and systematic issues, Assisted process engineers in the development, data collection, and analysis of process changes, and drove continuous improvement for integrated process technology issues as well as cost reduction. Drove analysis and response of inline parametric trends to ensure tool matching and on target performance Supervised and mentored process engineers. Senior Yield Engineer Intel Corporation June 2012  – Present (3 years 3 months) Israel Late-stage process development and production ramp of 22 nm 300 mm copper interconnect technologies with expertise in patterning and etch processes( dry etch, and lithography )  \nLed teams of process, device, and yield engineers to identify and drive root cause closure for integrated process excursions and systematic issues, Assisted process engineers in the development, data collection, and analysis of process changes, and drove continuous improvement for integrated process technology issues as well as cost reduction. Drove analysis and response of inline parametric trends to ensure tool matching and on target performance Supervised and mentored process engineers. Process Engineer Intel Corporation October 2006  –  June 2012  (5 years 9 months) Israel Participated in the transfer and high volume ramp of 200 mm 90nm, 45 nm and 22 nm (300mm) as a diffusion process Eng. various diffusion process tool owner ( Kokusay and TEL vertical diffusion furnaces) Owned sustaining and preventive maintenance of semiconductor manufacturing of several processes such as CVD and special thermal oxide growth processes in various conditions/chemistries. Drove continuous improvement and cost reduction Partnered with end-of-line Fab to find root cause and solutions to downstream yield issues participated in several multi-factory shared learning teams to ensure factories remained matched for output, yield, and cost and to drive project implementation in lockstep Process Engineer Intel Corporation October 2006  –  June 2012  (5 years 9 months) Israel Participated in the transfer and high volume ramp of 200 mm 90nm, 45 nm and 22 nm (300mm) as a diffusion process Eng. various diffusion process tool owner ( Kokusay and TEL vertical diffusion furnaces) Owned sustaining and preventive maintenance of semiconductor manufacturing of several processes such as CVD and special thermal oxide growth processes in various conditions/chemistries. Drove continuous improvement and cost reduction Partnered with end-of-line Fab to find root cause and solutions to downstream yield issues participated in several multi-factory shared learning teams to ensure factories remained matched for output, yield, and cost and to drive project implementation in lockstep Skills Process Integration Silicon JMP Semiconductor Industry Semiconductors Yield Diffusion Failure Analysis Thin Films CVD Design of Experiments Etching Metrology Lithography Semiconductor Process CMOS Characterization Flash Memory Photolithography PVD Device Characterization Microelectronics SPC Plasma Etch Process Simulation Technology Start-up Start-ups Management Start-ups NPI Product Development See 15+     See less Skills  Process Integration Silicon JMP Semiconductor Industry Semiconductors Yield Diffusion Failure Analysis Thin Films CVD Design of Experiments Etching Metrology Lithography Semiconductor Process CMOS Characterization Flash Memory Photolithography PVD Device Characterization Microelectronics SPC Plasma Etch Process Simulation Technology Start-up Start-ups Management Start-ups NPI Product Development See 15+     See less Process Integration Silicon JMP Semiconductor Industry Semiconductors Yield Diffusion Failure Analysis Thin Films CVD Design of Experiments Etching Metrology Lithography Semiconductor Process CMOS Characterization Flash Memory Photolithography PVD Device Characterization Microelectronics SPC Plasma Etch Process Simulation Technology Start-up Start-ups Management Start-ups NPI Product Development See 15+     See less Process Integration Silicon JMP Semiconductor Industry Semiconductors Yield Diffusion Failure Analysis Thin Films CVD Design of Experiments Etching Metrology Lithography Semiconductor Process CMOS Characterization Flash Memory Photolithography PVD Device Characterization Microelectronics SPC Plasma Etch Process Simulation Technology Start-up Start-ups Management Start-ups NPI Product Development See 15+     See less Education Ben-Gurion University of the Negev BSc,  Materials Engineering 2002  – 2006 Ben-Gurion University of the Negev BSc,  Materials Engineering 2002  – 2006 Ben-Gurion University of the Negev BSc,  Materials Engineering 2002  – 2006 Ben-Gurion University of the Negev BSc,  Materials Engineering 2002  – 2006 ", "Summary •\tOver 5 years of experience in materials characterization, including scanning electron microscopy (SEM), energy dispersive spectroscopy (EDS) X-ray diffraction, differential scanning calorimetry (DSC), thermogravimetric analysis (TGA), electrical and thermal transport measurements, Hall effect measurements, vibrating sample magnetometry (VSM), and mechanical testing \n•\tOver 2 years of industrial experience at General Motors Corporation and Intel Corporation \n•\t4 years of experience in synthesis of semiconducting and intermetallic compounds, including arc-melting, direct fusion, solid-state reaction, powder processing, induction melting, and melt-spinning techniques \n•\tExcellent written and oral communication skills \n•\tHighly motivated, forward-thinking and efficient; experienced in team leading, collaborative and independent work environments  \n•\tProficient in MS Office, MATLAB, JMP statistical software, LaTeX, and Jade 9.0; working knowledge of LabView, SolidWorks, AutoCAD, MathCAD, and DIFFRAC Plus EVA Summary •\tOver 5 years of experience in materials characterization, including scanning electron microscopy (SEM), energy dispersive spectroscopy (EDS) X-ray diffraction, differential scanning calorimetry (DSC), thermogravimetric analysis (TGA), electrical and thermal transport measurements, Hall effect measurements, vibrating sample magnetometry (VSM), and mechanical testing \n•\tOver 2 years of industrial experience at General Motors Corporation and Intel Corporation \n•\t4 years of experience in synthesis of semiconducting and intermetallic compounds, including arc-melting, direct fusion, solid-state reaction, powder processing, induction melting, and melt-spinning techniques \n•\tExcellent written and oral communication skills \n•\tHighly motivated, forward-thinking and efficient; experienced in team leading, collaborative and independent work environments  \n•\tProficient in MS Office, MATLAB, JMP statistical software, LaTeX, and Jade 9.0; working knowledge of LabView, SolidWorks, AutoCAD, MathCAD, and DIFFRAC Plus EVA •\tOver 5 years of experience in materials characterization, including scanning electron microscopy (SEM), energy dispersive spectroscopy (EDS) X-ray diffraction, differential scanning calorimetry (DSC), thermogravimetric analysis (TGA), electrical and thermal transport measurements, Hall effect measurements, vibrating sample magnetometry (VSM), and mechanical testing \n•\tOver 2 years of industrial experience at General Motors Corporation and Intel Corporation \n•\t4 years of experience in synthesis of semiconducting and intermetallic compounds, including arc-melting, direct fusion, solid-state reaction, powder processing, induction melting, and melt-spinning techniques \n•\tExcellent written and oral communication skills \n•\tHighly motivated, forward-thinking and efficient; experienced in team leading, collaborative and independent work environments  \n•\tProficient in MS Office, MATLAB, JMP statistical software, LaTeX, and Jade 9.0; working knowledge of LabView, SolidWorks, AutoCAD, MathCAD, and DIFFRAC Plus EVA •\tOver 5 years of experience in materials characterization, including scanning electron microscopy (SEM), energy dispersive spectroscopy (EDS) X-ray diffraction, differential scanning calorimetry (DSC), thermogravimetric analysis (TGA), electrical and thermal transport measurements, Hall effect measurements, vibrating sample magnetometry (VSM), and mechanical testing \n•\tOver 2 years of industrial experience at General Motors Corporation and Intel Corporation \n•\t4 years of experience in synthesis of semiconducting and intermetallic compounds, including arc-melting, direct fusion, solid-state reaction, powder processing, induction melting, and melt-spinning techniques \n•\tExcellent written and oral communication skills \n•\tHighly motivated, forward-thinking and efficient; experienced in team leading, collaborative and independent work environments  \n•\tProficient in MS Office, MATLAB, JMP statistical software, LaTeX, and Jade 9.0; working knowledge of LabView, SolidWorks, AutoCAD, MathCAD, and DIFFRAC Plus EVA Experience Senior Yield Engineer Intel Corporation January 2012  – Present (3 years 8 months) Hillsboro, OR Research Engineer General Motors June 2011  –  December 2011  (7 months) Warren, MI Responsibilities \n•Worked simultaneously on two research projects involving 1) intermetallic compounds for permanent magnet applications and 2) skutterudite compounds for thermoelectric applications \n•Developed intermetallic compounds to replace Nd2Fe14B in permanent magnet applications since Nd is expensive and in short supply \n•Investigated the effect of melt-spinning on the crystal structure and thermoelectric properties of multiple-filled skutterudites and skutterudite nanocomposites as a means of decreasing processing time and improving thermoelectric performance \n \nAchievements \n•Coauthored one patent application and one peer-reviewed publication \n•Established procedure for determining Curie temperature of Ce-Fe-B compounds using differential scanning calorimetry Graduate Research Assistant Michigan State University August 2008  –  June 2011  (2 years 11 months) Responsibilities  \n•Designed and conducted experiments for the discovery of new semiconducting compounds for thermoelectric applications  \n•Collaborated with other institutions to achieve research objectives, including University of Michigan, Ohio State University, Oak Ridge National Laboratory, Argonne National Laboratory, and General Motors R&D Center \n•Designed, assembled, and calibrated measurement systems for low and high temperature thermal and electrical transport, wrote LabView programs for automated data collection \n•Coordinated and supervised the relocation of our laboratory to a new campus research facility \n•Trained incoming students on laboratory safety procedures and equipment operation  \n \nAchievements \n•Developed new environmentally friendly p-type Cu-Sb-Se-S alloy with thermoelectric performance comparable to that of state-of-the-art thermoelectric materials \n•Coauthored 6 peer-reviewed publications and 4 conference proceedings  \n•Proposal for X-ray absorption near edge spectroscopy (XANES) work at Argonne National Lab accepted, completed in March 2010 \n•Presented work at four professional society meetings, a monthly teleconference of the Energy Frontier Research Center on Revolutionary Materials for Solid-State Energy Conversion, and a department-wide Chemical Engineering and Materials Science research forum Vice President/Graduate Advisor Materials Science and Engineering Society January 2007  –  December 2010  (4 years) East Lansing Michigan Responsibilities \n•Elected Vice President of the MSU chapter of MSES in 2007  \n•Elected Graduate Advisor of MSES in 2008, worked with president and vice president of the society to bring in speakers for monthly meetings and coordinate outreach activities \n \nAchievements \n•Coordinated MSES participation in the K-12 materials mini-camp (Materials Science and Technology Conference, 2007) and the Future Engineer’s Open House (Michigan State University College of Engineering, 2008) \n•Coordinated regional ASM seminar on electron microscopy (Michigan State University, March 2008) Head Teaching Assistant Michigan State University August 2008  –  December 2008  (5 months) East Lansing MI Responsibilities \n•Served as the head TA for the department’s introductory materials science course, which consisted of 150 undergraduate students \n•Instructed three other TAs on procedures for the laboratory section of the course, prepared laboratory exercises, taught “honors” section  \n•Wrote exams and homework assignments for the course, kept record of students’ overall grades  \n \nAchievements  \n•Received a 4.0/4.0 rating from end of semester student evaluations Research Assistant Michigan State University January 2007  –  August 2008  (1 year 8 months) Responsibilities \n•Conducted experiments for the discovery and optimization of new intermetallic alloys for thermoelectric applications  \n•Synthesized and characterized samples under direction of major professor \n•Assembled and calibrated equipment for newly-established laboratory of Dr. Donald Morelli \n \nAchievements  \n•Coauthored 2 peer-reviewed publications \n•Presented posters at 2 departmental conferences Research Assistant National Superconducting Cyclotron Laboratory, Michigan State University January 2007  –  November 2007  (11 months) East Lansing MI Responsibilities \n•Designed and fabricated processing systems for SRF accelerator cavities in class 100-10,000 clean room facilities  \n•Collaborated with the materials research division and the department of Chemical Engineering and Materials Science to study the effect of SRF cavity processing on grain structure and mechanical properties of high-purity niobium metal \n \nAchievements  \n•Coauthored one peer-reviewed publication  \n•Designed and fabricated high-pressure rinsing system for SRF cavities Senior Yield Engineer Intel Corporation January 2012  – Present (3 years 8 months) Hillsboro, OR Senior Yield Engineer Intel Corporation January 2012  – Present (3 years 8 months) Hillsboro, OR Research Engineer General Motors June 2011  –  December 2011  (7 months) Warren, MI Responsibilities \n•Worked simultaneously on two research projects involving 1) intermetallic compounds for permanent magnet applications and 2) skutterudite compounds for thermoelectric applications \n•Developed intermetallic compounds to replace Nd2Fe14B in permanent magnet applications since Nd is expensive and in short supply \n•Investigated the effect of melt-spinning on the crystal structure and thermoelectric properties of multiple-filled skutterudites and skutterudite nanocomposites as a means of decreasing processing time and improving thermoelectric performance \n \nAchievements \n•Coauthored one patent application and one peer-reviewed publication \n•Established procedure for determining Curie temperature of Ce-Fe-B compounds using differential scanning calorimetry Research Engineer General Motors June 2011  –  December 2011  (7 months) Warren, MI Responsibilities \n•Worked simultaneously on two research projects involving 1) intermetallic compounds for permanent magnet applications and 2) skutterudite compounds for thermoelectric applications \n•Developed intermetallic compounds to replace Nd2Fe14B in permanent magnet applications since Nd is expensive and in short supply \n•Investigated the effect of melt-spinning on the crystal structure and thermoelectric properties of multiple-filled skutterudites and skutterudite nanocomposites as a means of decreasing processing time and improving thermoelectric performance \n \nAchievements \n•Coauthored one patent application and one peer-reviewed publication \n•Established procedure for determining Curie temperature of Ce-Fe-B compounds using differential scanning calorimetry Graduate Research Assistant Michigan State University August 2008  –  June 2011  (2 years 11 months) Responsibilities  \n•Designed and conducted experiments for the discovery of new semiconducting compounds for thermoelectric applications  \n•Collaborated with other institutions to achieve research objectives, including University of Michigan, Ohio State University, Oak Ridge National Laboratory, Argonne National Laboratory, and General Motors R&D Center \n•Designed, assembled, and calibrated measurement systems for low and high temperature thermal and electrical transport, wrote LabView programs for automated data collection \n•Coordinated and supervised the relocation of our laboratory to a new campus research facility \n•Trained incoming students on laboratory safety procedures and equipment operation  \n \nAchievements \n•Developed new environmentally friendly p-type Cu-Sb-Se-S alloy with thermoelectric performance comparable to that of state-of-the-art thermoelectric materials \n•Coauthored 6 peer-reviewed publications and 4 conference proceedings  \n•Proposal for X-ray absorption near edge spectroscopy (XANES) work at Argonne National Lab accepted, completed in March 2010 \n•Presented work at four professional society meetings, a monthly teleconference of the Energy Frontier Research Center on Revolutionary Materials for Solid-State Energy Conversion, and a department-wide Chemical Engineering and Materials Science research forum Graduate Research Assistant Michigan State University August 2008  –  June 2011  (2 years 11 months) Responsibilities  \n•Designed and conducted experiments for the discovery of new semiconducting compounds for thermoelectric applications  \n•Collaborated with other institutions to achieve research objectives, including University of Michigan, Ohio State University, Oak Ridge National Laboratory, Argonne National Laboratory, and General Motors R&D Center \n•Designed, assembled, and calibrated measurement systems for low and high temperature thermal and electrical transport, wrote LabView programs for automated data collection \n•Coordinated and supervised the relocation of our laboratory to a new campus research facility \n•Trained incoming students on laboratory safety procedures and equipment operation  \n \nAchievements \n•Developed new environmentally friendly p-type Cu-Sb-Se-S alloy with thermoelectric performance comparable to that of state-of-the-art thermoelectric materials \n•Coauthored 6 peer-reviewed publications and 4 conference proceedings  \n•Proposal for X-ray absorption near edge spectroscopy (XANES) work at Argonne National Lab accepted, completed in March 2010 \n•Presented work at four professional society meetings, a monthly teleconference of the Energy Frontier Research Center on Revolutionary Materials for Solid-State Energy Conversion, and a department-wide Chemical Engineering and Materials Science research forum Vice President/Graduate Advisor Materials Science and Engineering Society January 2007  –  December 2010  (4 years) East Lansing Michigan Responsibilities \n•Elected Vice President of the MSU chapter of MSES in 2007  \n•Elected Graduate Advisor of MSES in 2008, worked with president and vice president of the society to bring in speakers for monthly meetings and coordinate outreach activities \n \nAchievements \n•Coordinated MSES participation in the K-12 materials mini-camp (Materials Science and Technology Conference, 2007) and the Future Engineer’s Open House (Michigan State University College of Engineering, 2008) \n•Coordinated regional ASM seminar on electron microscopy (Michigan State University, March 2008) Vice President/Graduate Advisor Materials Science and Engineering Society January 2007  –  December 2010  (4 years) East Lansing Michigan Responsibilities \n•Elected Vice President of the MSU chapter of MSES in 2007  \n•Elected Graduate Advisor of MSES in 2008, worked with president and vice president of the society to bring in speakers for monthly meetings and coordinate outreach activities \n \nAchievements \n•Coordinated MSES participation in the K-12 materials mini-camp (Materials Science and Technology Conference, 2007) and the Future Engineer’s Open House (Michigan State University College of Engineering, 2008) \n•Coordinated regional ASM seminar on electron microscopy (Michigan State University, March 2008) Head Teaching Assistant Michigan State University August 2008  –  December 2008  (5 months) East Lansing MI Responsibilities \n•Served as the head TA for the department’s introductory materials science course, which consisted of 150 undergraduate students \n•Instructed three other TAs on procedures for the laboratory section of the course, prepared laboratory exercises, taught “honors” section  \n•Wrote exams and homework assignments for the course, kept record of students’ overall grades  \n \nAchievements  \n•Received a 4.0/4.0 rating from end of semester student evaluations Head Teaching Assistant Michigan State University August 2008  –  December 2008  (5 months) East Lansing MI Responsibilities \n•Served as the head TA for the department’s introductory materials science course, which consisted of 150 undergraduate students \n•Instructed three other TAs on procedures for the laboratory section of the course, prepared laboratory exercises, taught “honors” section  \n•Wrote exams and homework assignments for the course, kept record of students’ overall grades  \n \nAchievements  \n•Received a 4.0/4.0 rating from end of semester student evaluations Research Assistant Michigan State University January 2007  –  August 2008  (1 year 8 months) Responsibilities \n•Conducted experiments for the discovery and optimization of new intermetallic alloys for thermoelectric applications  \n•Synthesized and characterized samples under direction of major professor \n•Assembled and calibrated equipment for newly-established laboratory of Dr. Donald Morelli \n \nAchievements  \n•Coauthored 2 peer-reviewed publications \n•Presented posters at 2 departmental conferences Research Assistant Michigan State University January 2007  –  August 2008  (1 year 8 months) Responsibilities \n•Conducted experiments for the discovery and optimization of new intermetallic alloys for thermoelectric applications  \n•Synthesized and characterized samples under direction of major professor \n•Assembled and calibrated equipment for newly-established laboratory of Dr. Donald Morelli \n \nAchievements  \n•Coauthored 2 peer-reviewed publications \n•Presented posters at 2 departmental conferences Research Assistant National Superconducting Cyclotron Laboratory, Michigan State University January 2007  –  November 2007  (11 months) East Lansing MI Responsibilities \n•Designed and fabricated processing systems for SRF accelerator cavities in class 100-10,000 clean room facilities  \n•Collaborated with the materials research division and the department of Chemical Engineering and Materials Science to study the effect of SRF cavity processing on grain structure and mechanical properties of high-purity niobium metal \n \nAchievements  \n•Coauthored one peer-reviewed publication  \n•Designed and fabricated high-pressure rinsing system for SRF cavities Research Assistant National Superconducting Cyclotron Laboratory, Michigan State University January 2007  –  November 2007  (11 months) East Lansing MI Responsibilities \n•Designed and fabricated processing systems for SRF accelerator cavities in class 100-10,000 clean room facilities  \n•Collaborated with the materials research division and the department of Chemical Engineering and Materials Science to study the effect of SRF cavity processing on grain structure and mechanical properties of high-purity niobium metal \n \nAchievements  \n•Coauthored one peer-reviewed publication  \n•Designed and fabricated high-pressure rinsing system for SRF cavities Skills Synthesis and... Thermal and Electrical... Excellent written and... Materials Science Characterization Skills  Synthesis and... Thermal and Electrical... Excellent written and... Materials Science Characterization Synthesis and... Thermal and Electrical... Excellent written and... Materials Science Characterization Synthesis and... Thermal and Electrical... Excellent written and... Materials Science Characterization Education Michigan State University Doctor of Philosophy,  Materials Science and Engineering 2008  – 2011 Michigan State University Bachelor of Science,  Materials Science and Engineering 2004  – 2008 Michigan State University Doctor of Philosophy,  Materials Science and Engineering 2008  – 2011 Michigan State University Doctor of Philosophy,  Materials Science and Engineering 2008  – 2011 Michigan State University Doctor of Philosophy,  Materials Science and Engineering 2008  – 2011 Michigan State University Bachelor of Science,  Materials Science and Engineering 2004  – 2008 Michigan State University Bachelor of Science,  Materials Science and Engineering 2004  – 2008 Michigan State University Bachelor of Science,  Materials Science and Engineering 2004  – 2008 Honors & Awards Additional Honors & Awards Honorable Mention, National Science Foundation Graduate Research Fellowship Program 2008 and 2009 \nDissertation Completion Fellowship Award, May 2008, Michigan State University \nCollege of Engineering Endowed Scholarship, November 2007, Michigan State University \nJ. Mason Reynolds Endowed Scholarship, November 2006 and July 2006, Michigan State University Additional Honors & Awards Honorable Mention, National Science Foundation Graduate Research Fellowship Program 2008 and 2009 \nDissertation Completion Fellowship Award, May 2008, Michigan State University \nCollege of Engineering Endowed Scholarship, November 2007, Michigan State University \nJ. Mason Reynolds Endowed Scholarship, November 2006 and July 2006, Michigan State University Additional Honors & Awards Honorable Mention, National Science Foundation Graduate Research Fellowship Program 2008 and 2009 \nDissertation Completion Fellowship Award, May 2008, Michigan State University \nCollege of Engineering Endowed Scholarship, November 2007, Michigan State University \nJ. Mason Reynolds Endowed Scholarship, November 2006 and July 2006, Michigan State University Additional Honors & Awards Honorable Mention, National Science Foundation Graduate Research Fellowship Program 2008 and 2009 \nDissertation Completion Fellowship Award, May 2008, Michigan State University \nCollege of Engineering Endowed Scholarship, November 2007, Michigan State University \nJ. Mason Reynolds Endowed Scholarship, November 2006 and July 2006, Michigan State University ", "Experience Senior Yield Engineer Intel Corporation April 2008  – Present (7 years 5 months) Senior Yield Engineer Intel Corporation April 2008  – Present (7 years 5 months) Senior Yield Engineer Intel Corporation April 2008  – Present (7 years 5 months) Skills Semiconductors Electronic Materials low k dielectrics Pore sealing of low k... CVD ALD Inorganic Organic... Semiconductor... Surface Chemistry Ultra High Vacuum... Yield Process Integration Design of Experiments IC Thin Films Metrology SPC Characterization JMP See 4+     See less Skills  Semiconductors Electronic Materials low k dielectrics Pore sealing of low k... CVD ALD Inorganic Organic... Semiconductor... Surface Chemistry Ultra High Vacuum... Yield Process Integration Design of Experiments IC Thin Films Metrology SPC Characterization JMP See 4+     See less Semiconductors Electronic Materials low k dielectrics Pore sealing of low k... CVD ALD Inorganic Organic... Semiconductor... Surface Chemistry Ultra High Vacuum... Yield Process Integration Design of Experiments IC Thin Films Metrology SPC Characterization JMP See 4+     See less Semiconductors Electronic Materials low k dielectrics Pore sealing of low k... CVD ALD Inorganic Organic... Semiconductor... Surface Chemistry Ultra High Vacuum... Yield Process Integration Design of Experiments IC Thin Films Metrology SPC Characterization JMP See 4+     See less Education Cornell University Doctor of Philosophy (PhD),  Chemical Engineering and Electronic Materials , Intel Foundation PhD Fellow 2002  – 2007 Activities and Societies:  - Intel Foundation PhD Fellowship\n- SRC Techcon Best Technical Presentation Award\n- International Precious Metals Institute (IPMI) Graduate Student Award\n- American Vacuum Society (AVS) Graduate Student Award IIT Delhi Bachelor of Technology (B.Tech.),  Chemical Engineering 1997  – 2001 Cornell University Doctor of Philosophy (PhD),  Chemical Engineering and Electronic Materials , Intel Foundation PhD Fellow 2002  – 2007 Activities and Societies:  - Intel Foundation PhD Fellowship\n- SRC Techcon Best Technical Presentation Award\n- International Precious Metals Institute (IPMI) Graduate Student Award\n- American Vacuum Society (AVS) Graduate Student Award Cornell University Doctor of Philosophy (PhD),  Chemical Engineering and Electronic Materials , Intel Foundation PhD Fellow 2002  – 2007 Activities and Societies:  - Intel Foundation PhD Fellowship\n- SRC Techcon Best Technical Presentation Award\n- International Precious Metals Institute (IPMI) Graduate Student Award\n- American Vacuum Society (AVS) Graduate Student Award Cornell University Doctor of Philosophy (PhD),  Chemical Engineering and Electronic Materials , Intel Foundation PhD Fellow 2002  – 2007 Activities and Societies:  - Intel Foundation PhD Fellowship\n- SRC Techcon Best Technical Presentation Award\n- International Precious Metals Institute (IPMI) Graduate Student Award\n- American Vacuum Society (AVS) Graduate Student Award IIT Delhi Bachelor of Technology (B.Tech.),  Chemical Engineering 1997  – 2001 IIT Delhi Bachelor of Technology (B.Tech.),  Chemical Engineering 1997  – 2001 IIT Delhi Bachelor of Technology (B.Tech.),  Chemical Engineering 1997  – 2001 ", "Summary Brad's professional expertise is in the the area of electronic materials and specifically MOSFETs. Brad is currently employed by Intel in Portland OR, where he works in technology development. Summary Brad's professional expertise is in the the area of electronic materials and specifically MOSFETs. Brad is currently employed by Intel in Portland OR, where he works in technology development. Brad's professional expertise is in the the area of electronic materials and specifically MOSFETs. Brad is currently employed by Intel in Portland OR, where he works in technology development. Brad's professional expertise is in the the area of electronic materials and specifically MOSFETs. Brad is currently employed by Intel in Portland OR, where he works in technology development. Experience Reliability Engineer Intel Corporation November 2013  – Present (1 year 10 months) Portland, Oregon Brad is currently working as a development engineer on transitor level reliability issues in the Technology Development Quality and Reliability group. Senior Yield Engineer Intel Corporation January 2012  –  November 2013  (1 year 11 months) Portland, Oregon Worked on front end defect reduction and yield projects in the Portland Technology Development group. Reliability Engineer Intel Corporation November 2013  – Present (1 year 10 months) Portland, Oregon Brad is currently working as a development engineer on transitor level reliability issues in the Technology Development Quality and Reliability group. Reliability Engineer Intel Corporation November 2013  – Present (1 year 10 months) Portland, Oregon Brad is currently working as a development engineer on transitor level reliability issues in the Technology Development Quality and Reliability group. Senior Yield Engineer Intel Corporation January 2012  –  November 2013  (1 year 11 months) Portland, Oregon Worked on front end defect reduction and yield projects in the Portland Technology Development group. Senior Yield Engineer Intel Corporation January 2012  –  November 2013  (1 year 11 months) Portland, Oregon Worked on front end defect reduction and yield projects in the Portland Technology Development group. Skills Matlab Scanning Electron... Optics Materials Science Sensors Nanotechnology Physics Nanofabrication Spectroscopy Simulations LabVIEW Microelectronics R Analog Skills  Matlab Scanning Electron... Optics Materials Science Sensors Nanotechnology Physics Nanofabrication Spectroscopy Simulations LabVIEW Microelectronics R Analog Matlab Scanning Electron... Optics Materials Science Sensors Nanotechnology Physics Nanofabrication Spectroscopy Simulations LabVIEW Microelectronics R Analog Matlab Scanning Electron... Optics Materials Science Sensors Nanotechnology Physics Nanofabrication Spectroscopy Simulations LabVIEW Microelectronics R Analog Education Penn State University Doctor of Philosophy (Ph.D.),  Materials Science and Engineering Researched atomic scale semiconductor defects utilizing electron paramagnetic resonance and electrical measurements. Explored the performance and reliability limiting defect structures in various dielectric / semiconductor material systems relevant to state of the art MOSFETs, including: high-k gate dielectrics, SiC MOSFETs, and BEOL dielectrics. Penn State University Bachelor's of Science,  Electrical Engineering Penn State University Doctor of Philosophy (Ph.D.),  Materials Science and Engineering Researched atomic scale semiconductor defects utilizing electron paramagnetic resonance and electrical measurements. Explored the performance and reliability limiting defect structures in various dielectric / semiconductor material systems relevant to state of the art MOSFETs, including: high-k gate dielectrics, SiC MOSFETs, and BEOL dielectrics. Penn State University Doctor of Philosophy (Ph.D.),  Materials Science and Engineering Researched atomic scale semiconductor defects utilizing electron paramagnetic resonance and electrical measurements. Explored the performance and reliability limiting defect structures in various dielectric / semiconductor material systems relevant to state of the art MOSFETs, including: high-k gate dielectrics, SiC MOSFETs, and BEOL dielectrics. Penn State University Doctor of Philosophy (Ph.D.),  Materials Science and Engineering Researched atomic scale semiconductor defects utilizing electron paramagnetic resonance and electrical measurements. Explored the performance and reliability limiting defect structures in various dielectric / semiconductor material systems relevant to state of the art MOSFETs, including: high-k gate dielectrics, SiC MOSFETs, and BEOL dielectrics. Penn State University Bachelor's of Science,  Electrical Engineering Penn State University Bachelor's of Science,  Electrical Engineering Penn State University Bachelor's of Science,  Electrical Engineering ", "Experience Senior Yield Engineer Intel Corporation February 2006  – Present (9 years 7 months) Senior Material Engineer Freescale Semiconductor January 2000  –  February 2006  (6 years 2 months) Senior Yield Engineer Intel Corporation February 2006  – Present (9 years 7 months) Senior Yield Engineer Intel Corporation February 2006  – Present (9 years 7 months) Senior Material Engineer Freescale Semiconductor January 2000  –  February 2006  (6 years 2 months) Senior Material Engineer Freescale Semiconductor January 2000  –  February 2006  (6 years 2 months) Education University of Southern California Ph. D,  Materials Science Activities and Societies:  Material Research Society\nIEEE University of Southern California Ph. D,  Materials Science Activities and Societies:  Material Research Society\nIEEE University of Southern California Ph. D,  Materials Science Activities and Societies:  Material Research Society\nIEEE University of Southern California Ph. D,  Materials Science Activities and Societies:  Material Research Society\nIEEE ", "Summary I received the BEng (Hons.) and PhD degrees in Electronic Engineering, both from the Science University of Malaysia in 2009 and 2012, respectively. My technical interests are in digital signal processing and advanced analytics technology development with application in automation and manufacturing systems that drive operational excellence in terms of cost, quality, performance, and efficiency. Currently, I am a Member of the IEEE. \n \nSpecialties:  \n• Digital Signal Processing (automated visual inspection and defect detection metrology) \n• Advanced Analytics (machine learning and data mining for yield modeling, prediction, sort/class screening, and analysis) Summary I received the BEng (Hons.) and PhD degrees in Electronic Engineering, both from the Science University of Malaysia in 2009 and 2012, respectively. My technical interests are in digital signal processing and advanced analytics technology development with application in automation and manufacturing systems that drive operational excellence in terms of cost, quality, performance, and efficiency. Currently, I am a Member of the IEEE. \n \nSpecialties:  \n• Digital Signal Processing (automated visual inspection and defect detection metrology) \n• Advanced Analytics (machine learning and data mining for yield modeling, prediction, sort/class screening, and analysis) I received the BEng (Hons.) and PhD degrees in Electronic Engineering, both from the Science University of Malaysia in 2009 and 2012, respectively. My technical interests are in digital signal processing and advanced analytics technology development with application in automation and manufacturing systems that drive operational excellence in terms of cost, quality, performance, and efficiency. Currently, I am a Member of the IEEE. \n \nSpecialties:  \n• Digital Signal Processing (automated visual inspection and defect detection metrology) \n• Advanced Analytics (machine learning and data mining for yield modeling, prediction, sort/class screening, and analysis) I received the BEng (Hons.) and PhD degrees in Electronic Engineering, both from the Science University of Malaysia in 2009 and 2012, respectively. My technical interests are in digital signal processing and advanced analytics technology development with application in automation and manufacturing systems that drive operational excellence in terms of cost, quality, performance, and efficiency. Currently, I am a Member of the IEEE. \n \nSpecialties:  \n• Digital Signal Processing (automated visual inspection and defect detection metrology) \n• Advanced Analytics (machine learning and data mining for yield modeling, prediction, sort/class screening, and analysis) Skills Machine Learning Data Mining Matlab Artificial Intelligence C++ Digital Image Processing Yield Engineering LaTeX Skills  Machine Learning Data Mining Matlab Artificial Intelligence C++ Digital Image Processing Yield Engineering LaTeX Machine Learning Data Mining Matlab Artificial Intelligence C++ Digital Image Processing Yield Engineering LaTeX Machine Learning Data Mining Matlab Artificial Intelligence C++ Digital Image Processing Yield Engineering LaTeX Honors & Awards ", "Experience Senior Yield Engineer Intel Corporation Senior Yield Engineer Intel Corporation Senior Yield Engineer Intel Corporation ", "Experience Senior Yield Engineer Intel Corporation August 2014  – Present (1 year 1 month) Portland, Oregon Area Engineering Manager Intel Corporation September 2008  – Present (7 years) Intern Fairchild 2007  –  2007  (less than a year) Intern Fairchild 2007  –  2007  (less than a year) Senior Yield Engineer Intel Corporation August 2014  – Present (1 year 1 month) Portland, Oregon Area Senior Yield Engineer Intel Corporation August 2014  – Present (1 year 1 month) Portland, Oregon Area Engineering Manager Intel Corporation September 2008  – Present (7 years) Engineering Manager Intel Corporation September 2008  – Present (7 years) Intern Fairchild 2007  –  2007  (less than a year) Intern Fairchild 2007  –  2007  (less than a year) Intern Fairchild 2007  –  2007  (less than a year) Intern Fairchild 2007  –  2007  (less than a year) Skills Semiconductors Semiconductor Industry Design of Experiments CMOS SPC Silicon Characterization Process Engineering Metrology JMP Manufacturing Engineering Management Failure Analysis Skills  Semiconductors Semiconductor Industry Design of Experiments CMOS SPC Silicon Characterization Process Engineering Metrology JMP Manufacturing Engineering Management Failure Analysis Semiconductors Semiconductor Industry Design of Experiments CMOS SPC Silicon Characterization Process Engineering Metrology JMP Manufacturing Engineering Management Failure Analysis Semiconductors Semiconductor Industry Design of Experiments CMOS SPC Silicon Characterization Process Engineering Metrology JMP Manufacturing Engineering Management Failure Analysis Education Rochester Institute of Technology Bachelor of Science (B.S.),  Microelectronic engineering 2003  – 2008 Rochester Institute of Technology Bachelor of Science (B.S.),  Microelectronic engineering 2003  – 2008 Rochester Institute of Technology Bachelor of Science (B.S.),  Microelectronic engineering 2003  – 2008 Rochester Institute of Technology Bachelor of Science (B.S.),  Microelectronic engineering 2003  – 2008 ", "Summary 1. Semiconductor Process Development and Yield Enhancement \n• Silicon CMOS process integration at advanced technology nodes \n• Yield analysis and electrical/physical failure analyses for yield enhancement \n• Device/process engineering for product speed/leakage performance enhancement \n \n2. Interdisciplinary Microfabrication Research \n• Hands-on microfabrication experience in the cleanroom facility \n• Design of experiments (DOE) for process development / optimization \n• Electrical and mechanical characterization of fabricated devices \n \n3. Multifaceted Communication Skills \n• Close collaboration with Intel process modules on process enhancement \n• Technical communication within TSMC and with industry customers in North America \n• Oral and poster presentations in international research conferences \n \nPrimary Projects: \n• 90 nm CMOS logic process technology development with internal SRAM test vehicles \n• 90 nm CMOS logic process ramp-up for customer products \n• Design, fabrication, and characterization of micromachined hollow polymer needles for drug delivery into skin \n \nSpecialties: \n• Wafer Fabrication Process Development and Integration \n• Yield Analysis \n• Device Analysis and Engineering \n• SRAM Bitcell Characterization \n• Design Rule Check \n• Electrical and Physical Failure Analysis \n \nGoogle Scholar Link: http://scholar.google.com/citations?user=BlKMUCcAAAAJ \n \npcwangk@gmail.com Summary 1. Semiconductor Process Development and Yield Enhancement \n• Silicon CMOS process integration at advanced technology nodes \n• Yield analysis and electrical/physical failure analyses for yield enhancement \n• Device/process engineering for product speed/leakage performance enhancement \n \n2. Interdisciplinary Microfabrication Research \n• Hands-on microfabrication experience in the cleanroom facility \n• Design of experiments (DOE) for process development / optimization \n• Electrical and mechanical characterization of fabricated devices \n \n3. Multifaceted Communication Skills \n• Close collaboration with Intel process modules on process enhancement \n• Technical communication within TSMC and with industry customers in North America \n• Oral and poster presentations in international research conferences \n \nPrimary Projects: \n• 90 nm CMOS logic process technology development with internal SRAM test vehicles \n• 90 nm CMOS logic process ramp-up for customer products \n• Design, fabrication, and characterization of micromachined hollow polymer needles for drug delivery into skin \n \nSpecialties: \n• Wafer Fabrication Process Development and Integration \n• Yield Analysis \n• Device Analysis and Engineering \n• SRAM Bitcell Characterization \n• Design Rule Check \n• Electrical and Physical Failure Analysis \n \nGoogle Scholar Link: http://scholar.google.com/citations?user=BlKMUCcAAAAJ \n \npcwangk@gmail.com 1. Semiconductor Process Development and Yield Enhancement \n• Silicon CMOS process integration at advanced technology nodes \n• Yield analysis and electrical/physical failure analyses for yield enhancement \n• Device/process engineering for product speed/leakage performance enhancement \n \n2. Interdisciplinary Microfabrication Research \n• Hands-on microfabrication experience in the cleanroom facility \n• Design of experiments (DOE) for process development / optimization \n• Electrical and mechanical characterization of fabricated devices \n \n3. Multifaceted Communication Skills \n• Close collaboration with Intel process modules on process enhancement \n• Technical communication within TSMC and with industry customers in North America \n• Oral and poster presentations in international research conferences \n \nPrimary Projects: \n• 90 nm CMOS logic process technology development with internal SRAM test vehicles \n• 90 nm CMOS logic process ramp-up for customer products \n• Design, fabrication, and characterization of micromachined hollow polymer needles for drug delivery into skin \n \nSpecialties: \n• Wafer Fabrication Process Development and Integration \n• Yield Analysis \n• Device Analysis and Engineering \n• SRAM Bitcell Characterization \n• Design Rule Check \n• Electrical and Physical Failure Analysis \n \nGoogle Scholar Link: http://scholar.google.com/citations?user=BlKMUCcAAAAJ \n \npcwangk@gmail.com 1. Semiconductor Process Development and Yield Enhancement \n• Silicon CMOS process integration at advanced technology nodes \n• Yield analysis and electrical/physical failure analyses for yield enhancement \n• Device/process engineering for product speed/leakage performance enhancement \n \n2. Interdisciplinary Microfabrication Research \n• Hands-on microfabrication experience in the cleanroom facility \n• Design of experiments (DOE) for process development / optimization \n• Electrical and mechanical characterization of fabricated devices \n \n3. Multifaceted Communication Skills \n• Close collaboration with Intel process modules on process enhancement \n• Technical communication within TSMC and with industry customers in North America \n• Oral and poster presentations in international research conferences \n \nPrimary Projects: \n• 90 nm CMOS logic process technology development with internal SRAM test vehicles \n• 90 nm CMOS logic process ramp-up for customer products \n• Design, fabrication, and characterization of micromachined hollow polymer needles for drug delivery into skin \n \nSpecialties: \n• Wafer Fabrication Process Development and Integration \n• Yield Analysis \n• Device Analysis and Engineering \n• SRAM Bitcell Characterization \n• Design Rule Check \n• Electrical and Physical Failure Analysis \n \nGoogle Scholar Link: http://scholar.google.com/citations?user=BlKMUCcAAAAJ \n \npcwangk@gmail.com Experience Senior Yield Engineer Intel Corporation November 2013  – Present (1 year 10 months) Rio Rancho, New Mexico Fab 11X Yield / BE Process Integration and Device \n \n• Monitor BE device health, investigate BE device issues, and support BE device analyses for process changes \n• Collaborate with BE dielectric module engineers to implement process changes and respond to process excursions \n• Monitor and improve BE dielectric process health Graduate Research Assistant Georgia Institute of Technology January 2008  –  November 2013  (5 years 11 months) Atlanta, GA, USA Dissertation: Fabrication, Packaging, and Application of Micromachined Hollow Polymer Needle Arrays \n \n• Designed, fabricated, and characterized micromachined hollow polymer needles for drug delivery into skin \n• Developed a fully photolithographic process to construct 1-mm-tall hollow microneedle arrays  Senior Product Engineer Taiwan Semiconductor Manufacturing Company June 2004  –  July 2007  (3 years 2 months) Fab 12, Hsin-Chu, Taiwan Primary Project: 90 nm CMOS logic process ramp-up for customer products \n \n• Enhanced manufacturing yield of customer products for process ramp-up \n- Conducted yield analyses and electrical/physical failure analyses of customer products to identify key process defects \n- Analyzed product yields, electrical device parameters, inline process monitors, and equipment data to enhance yields \n \n• Enhanced customer product speed/leakage performance through device/process engineering and verification \n- Analyzed electrical device and product parameters from process experiment to identify key device parameters  \n- Quantified device-to-product sensitivity and set new device targets to enhance product speed/leakage performance\t \n \n• Ensured design rule compliance of customer tape-outs for yield assurance \n- Conducted design rule checking (DRC), examined layouts, evaluated and summarized rule violations\t \n \n• Served as a primary technical liaison with customers in North America on production updates and engineering support \n• Worked cross-functionally with internal process integration, device, and testing teams to support customer requests \n• Mentored and trained junior product engineers Product Engineer Taiwan Semiconductor Manufacturing Company June 2002  –  May 2004  (2 years) Fab 12, Hsin-Chu, Taiwan Primary Project: 90 nm CMOS logic process technology development with internal SRAM test vehicles \n \n• Identified process margins and inline defects for process technology development \n- Conducted yield analyses of process experiments and physical failure analyses for internal SRAM test vehicle \n- Analyzed read/write operations and testing of SRAM bitcells for fault isolation of SRAM soft errors \n Senior Yield Engineer Intel Corporation November 2013  – Present (1 year 10 months) Rio Rancho, New Mexico Fab 11X Yield / BE Process Integration and Device \n \n• Monitor BE device health, investigate BE device issues, and support BE device analyses for process changes \n• Collaborate with BE dielectric module engineers to implement process changes and respond to process excursions \n• Monitor and improve BE dielectric process health Senior Yield Engineer Intel Corporation November 2013  – Present (1 year 10 months) Rio Rancho, New Mexico Fab 11X Yield / BE Process Integration and Device \n \n• Monitor BE device health, investigate BE device issues, and support BE device analyses for process changes \n• Collaborate with BE dielectric module engineers to implement process changes and respond to process excursions \n• Monitor and improve BE dielectric process health Graduate Research Assistant Georgia Institute of Technology January 2008  –  November 2013  (5 years 11 months) Atlanta, GA, USA Dissertation: Fabrication, Packaging, and Application of Micromachined Hollow Polymer Needle Arrays \n \n• Designed, fabricated, and characterized micromachined hollow polymer needles for drug delivery into skin \n• Developed a fully photolithographic process to construct 1-mm-tall hollow microneedle arrays  Graduate Research Assistant Georgia Institute of Technology January 2008  –  November 2013  (5 years 11 months) Atlanta, GA, USA Dissertation: Fabrication, Packaging, and Application of Micromachined Hollow Polymer Needle Arrays \n \n• Designed, fabricated, and characterized micromachined hollow polymer needles for drug delivery into skin \n• Developed a fully photolithographic process to construct 1-mm-tall hollow microneedle arrays  Senior Product Engineer Taiwan Semiconductor Manufacturing Company June 2004  –  July 2007  (3 years 2 months) Fab 12, Hsin-Chu, Taiwan Primary Project: 90 nm CMOS logic process ramp-up for customer products \n \n• Enhanced manufacturing yield of customer products for process ramp-up \n- Conducted yield analyses and electrical/physical failure analyses of customer products to identify key process defects \n- Analyzed product yields, electrical device parameters, inline process monitors, and equipment data to enhance yields \n \n• Enhanced customer product speed/leakage performance through device/process engineering and verification \n- Analyzed electrical device and product parameters from process experiment to identify key device parameters  \n- Quantified device-to-product sensitivity and set new device targets to enhance product speed/leakage performance\t \n \n• Ensured design rule compliance of customer tape-outs for yield assurance \n- Conducted design rule checking (DRC), examined layouts, evaluated and summarized rule violations\t \n \n• Served as a primary technical liaison with customers in North America on production updates and engineering support \n• Worked cross-functionally with internal process integration, device, and testing teams to support customer requests \n• Mentored and trained junior product engineers Senior Product Engineer Taiwan Semiconductor Manufacturing Company June 2004  –  July 2007  (3 years 2 months) Fab 12, Hsin-Chu, Taiwan Primary Project: 90 nm CMOS logic process ramp-up for customer products \n \n• Enhanced manufacturing yield of customer products for process ramp-up \n- Conducted yield analyses and electrical/physical failure analyses of customer products to identify key process defects \n- Analyzed product yields, electrical device parameters, inline process monitors, and equipment data to enhance yields \n \n• Enhanced customer product speed/leakage performance through device/process engineering and verification \n- Analyzed electrical device and product parameters from process experiment to identify key device parameters  \n- Quantified device-to-product sensitivity and set new device targets to enhance product speed/leakage performance\t \n \n• Ensured design rule compliance of customer tape-outs for yield assurance \n- Conducted design rule checking (DRC), examined layouts, evaluated and summarized rule violations\t \n \n• Served as a primary technical liaison with customers in North America on production updates and engineering support \n• Worked cross-functionally with internal process integration, device, and testing teams to support customer requests \n• Mentored and trained junior product engineers Product Engineer Taiwan Semiconductor Manufacturing Company June 2002  –  May 2004  (2 years) Fab 12, Hsin-Chu, Taiwan Primary Project: 90 nm CMOS logic process technology development with internal SRAM test vehicles \n \n• Identified process margins and inline defects for process technology development \n- Conducted yield analyses of process experiments and physical failure analyses for internal SRAM test vehicle \n- Analyzed read/write operations and testing of SRAM bitcells for fault isolation of SRAM soft errors \n Product Engineer Taiwan Semiconductor Manufacturing Company June 2002  –  May 2004  (2 years) Fab 12, Hsin-Chu, Taiwan Primary Project: 90 nm CMOS logic process technology development with internal SRAM test vehicles \n \n• Identified process margins and inline defects for process technology development \n- Conducted yield analyses of process experiments and physical failure analyses for internal SRAM test vehicle \n- Analyzed read/write operations and testing of SRAM bitcells for fault isolation of SRAM soft errors \n Languages Mandarin Chinese Native or bilingual proficiency English Full professional proficiency Mandarin Chinese Native or bilingual proficiency English Full professional proficiency Mandarin Chinese Native or bilingual proficiency English Full professional proficiency Native or bilingual proficiency Full professional proficiency Skills MEMS Silicon Failure Analysis Design of Experiments Physics Semiconductor Process Scanning Electron... Semiconductor Device Photolithography Semiconductor... Microfabrication... Sensors Microsoft Excel Solidworks Semiconductor Failure... Microsoft Excel VBA... Mechanical Testing Yield Analysis Physical Failure... SRAM Bitcell Failure... Device Physics Design Rule Check Interdisciplinary... AutoCAD Agilent 93000 tester MOSAID tester C programming Focused Ion Beam (FIB) JMP See 14+     See less Skills  MEMS Silicon Failure Analysis Design of Experiments Physics Semiconductor Process Scanning Electron... Semiconductor Device Photolithography Semiconductor... Microfabrication... Sensors Microsoft Excel Solidworks Semiconductor Failure... Microsoft Excel VBA... Mechanical Testing Yield Analysis Physical Failure... SRAM Bitcell Failure... Device Physics Design Rule Check Interdisciplinary... AutoCAD Agilent 93000 tester MOSAID tester C programming Focused Ion Beam (FIB) JMP See 14+     See less MEMS Silicon Failure Analysis Design of Experiments Physics Semiconductor Process Scanning Electron... Semiconductor Device Photolithography Semiconductor... Microfabrication... Sensors Microsoft Excel Solidworks Semiconductor Failure... Microsoft Excel VBA... Mechanical Testing Yield Analysis Physical Failure... SRAM Bitcell Failure... Device Physics Design Rule Check Interdisciplinary... AutoCAD Agilent 93000 tester MOSAID tester C programming Focused Ion Beam (FIB) JMP See 14+     See less MEMS Silicon Failure Analysis Design of Experiments Physics Semiconductor Process Scanning Electron... Semiconductor Device Photolithography Semiconductor... Microfabrication... Sensors Microsoft Excel Solidworks Semiconductor Failure... Microsoft Excel VBA... Mechanical Testing Yield Analysis Physical Failure... SRAM Bitcell Failure... Device Physics Design Rule Check Interdisciplinary... AutoCAD Agilent 93000 tester MOSAID tester C programming Focused Ion Beam (FIB) JMP See 14+     See less Education Georgia Institute of Technology Doctor of Philosophy (Ph.D.),  Electrical and Computer Engineering 2007  – 2013 Dissertation: Fabrication, Packaging, and Application of Micromachined Hollow Polymer Needle Arrays \n \nResearch Focus: Microelectromechanical Systems (MEMS) Fabrication and Characterization \n \nMinor: Biomedical Engineering \n \nAdvisor: Prof. Mark G. Allen \n \nProf. Allen research group: mems.seas.upenn.edu \n Activities and Societies:  IEEE Student Member Penn State University Master's Degree,  Electrical Engineering 2000  – 2002 Thesis: V/Al/Pt/Au Low Resistance Ohmic Contacts to n-type AlGaN/GaN Heterostructures \n \nFabricated, characterized, and optimized a Vanadium-based metal contact to GaN-based devices \n \nAdvisor: Prof. Suzanne Mohney \n \nProf. Mohney webpage: http://www.esm.psu.edu/mohney/ National Chiao Tung University Bachelor's Degree,  Electronics Engineering 1993  – 1997 Senior Project: Diffusion Barrier Effect of Tungsten in Al/W/p+-n Junction Diode \n \nProject Advisor: Prof. Mao-Chieh Chen Georgia Institute of Technology Doctor of Philosophy (Ph.D.),  Electrical and Computer Engineering 2007  – 2013 Dissertation: Fabrication, Packaging, and Application of Micromachined Hollow Polymer Needle Arrays \n \nResearch Focus: Microelectromechanical Systems (MEMS) Fabrication and Characterization \n \nMinor: Biomedical Engineering \n \nAdvisor: Prof. Mark G. Allen \n \nProf. Allen research group: mems.seas.upenn.edu \n Activities and Societies:  IEEE Student Member Georgia Institute of Technology Doctor of Philosophy (Ph.D.),  Electrical and Computer Engineering 2007  – 2013 Dissertation: Fabrication, Packaging, and Application of Micromachined Hollow Polymer Needle Arrays \n \nResearch Focus: Microelectromechanical Systems (MEMS) Fabrication and Characterization \n \nMinor: Biomedical Engineering \n \nAdvisor: Prof. Mark G. Allen \n \nProf. Allen research group: mems.seas.upenn.edu \n Activities and Societies:  IEEE Student Member Georgia Institute of Technology Doctor of Philosophy (Ph.D.),  Electrical and Computer Engineering 2007  – 2013 Dissertation: Fabrication, Packaging, and Application of Micromachined Hollow Polymer Needle Arrays \n \nResearch Focus: Microelectromechanical Systems (MEMS) Fabrication and Characterization \n \nMinor: Biomedical Engineering \n \nAdvisor: Prof. Mark G. Allen \n \nProf. Allen research group: mems.seas.upenn.edu \n Activities and Societies:  IEEE Student Member Penn State University Master's Degree,  Electrical Engineering 2000  – 2002 Thesis: V/Al/Pt/Au Low Resistance Ohmic Contacts to n-type AlGaN/GaN Heterostructures \n \nFabricated, characterized, and optimized a Vanadium-based metal contact to GaN-based devices \n \nAdvisor: Prof. Suzanne Mohney \n \nProf. Mohney webpage: http://www.esm.psu.edu/mohney/ Penn State University Master's Degree,  Electrical Engineering 2000  – 2002 Thesis: V/Al/Pt/Au Low Resistance Ohmic Contacts to n-type AlGaN/GaN Heterostructures \n \nFabricated, characterized, and optimized a Vanadium-based metal contact to GaN-based devices \n \nAdvisor: Prof. Suzanne Mohney \n \nProf. Mohney webpage: http://www.esm.psu.edu/mohney/ Penn State University Master's Degree,  Electrical Engineering 2000  – 2002 Thesis: V/Al/Pt/Au Low Resistance Ohmic Contacts to n-type AlGaN/GaN Heterostructures \n \nFabricated, characterized, and optimized a Vanadium-based metal contact to GaN-based devices \n \nAdvisor: Prof. Suzanne Mohney \n \nProf. Mohney webpage: http://www.esm.psu.edu/mohney/ National Chiao Tung University Bachelor's Degree,  Electronics Engineering 1993  – 1997 Senior Project: Diffusion Barrier Effect of Tungsten in Al/W/p+-n Junction Diode \n \nProject Advisor: Prof. Mao-Chieh Chen National Chiao Tung University Bachelor's Degree,  Electronics Engineering 1993  – 1997 Senior Project: Diffusion Barrier Effect of Tungsten in Al/W/p+-n Junction Diode \n \nProject Advisor: Prof. Mao-Chieh Chen National Chiao Tung University Bachelor's Degree,  Electronics Engineering 1993  – 1997 Senior Project: Diffusion Barrier Effect of Tungsten in Al/W/p+-n Junction Diode \n \nProject Advisor: Prof. Mao-Chieh Chen Honors & Awards 2011 MEMS Conference Student Travel Award National Science Foundation (NSF) and Transducer Research Foundation (TRF) January 2011 1997 Lam Thesis Award, First Prize for Bachelor Degree Lam Research Corporation 1997 Research Creativity Award National Science Council, Taiwan 2011 MEMS Conference Student Travel Award National Science Foundation (NSF) and Transducer Research Foundation (TRF) January 2011 2011 MEMS Conference Student Travel Award National Science Foundation (NSF) and Transducer Research Foundation (TRF) January 2011 2011 MEMS Conference Student Travel Award National Science Foundation (NSF) and Transducer Research Foundation (TRF) January 2011 1997 Lam Thesis Award, First Prize for Bachelor Degree Lam Research Corporation 1997 Lam Thesis Award, First Prize for Bachelor Degree Lam Research Corporation 1997 Lam Thesis Award, First Prize for Bachelor Degree Lam Research Corporation 1997 Research Creativity Award National Science Council, Taiwan 1997 Research Creativity Award National Science Council, Taiwan 1997 Research Creativity Award National Science Council, Taiwan "]}