{"position": "Senior Strategic Planner", "company": "Intel Corporation", "profiles": ["Experience Senior Strategic Planner Intel Corporation October 2011  – Present (3 years 11 months) Portland, Oregon Area Senior Strategic Planner Intel Corporation October 2011  – Present (3 years 11 months) Portland, Oregon Area Senior Strategic Planner Intel Corporation October 2011  – Present (3 years 11 months) Portland, Oregon Area Skills Team Leadership Strategic Planning Marketing Strategy Wireless Strategy Software Networking Hardware Product Management Semiconductors Start-ups Product Marketing Embedded Systems Competitive Analysis Mobile Devices Product Development Bluetooth Cross-functional Team... SoC ASIC Program Management Mobile Communications WiFi Digital Signal... Strategic Partnerships Testing IC Business Development Consumer Electronics Go-to-market Strategy Electronics RF System Architecture Analog See 19+     See less Skills  Team Leadership Strategic Planning Marketing Strategy Wireless Strategy Software Networking Hardware Product Management Semiconductors Start-ups Product Marketing Embedded Systems Competitive Analysis Mobile Devices Product Development Bluetooth Cross-functional Team... SoC ASIC Program Management Mobile Communications WiFi Digital Signal... Strategic Partnerships Testing IC Business Development Consumer Electronics Go-to-market Strategy Electronics RF System Architecture Analog See 19+     See less Team Leadership Strategic Planning Marketing Strategy Wireless Strategy Software Networking Hardware Product Management Semiconductors Start-ups Product Marketing Embedded Systems Competitive Analysis Mobile Devices Product Development Bluetooth Cross-functional Team... SoC ASIC Program Management Mobile Communications WiFi Digital Signal... Strategic Partnerships Testing IC Business Development Consumer Electronics Go-to-market Strategy Electronics RF System Architecture Analog See 19+     See less Team Leadership Strategic Planning Marketing Strategy Wireless Strategy Software Networking Hardware Product Management Semiconductors Start-ups Product Marketing Embedded Systems Competitive Analysis Mobile Devices Product Development Bluetooth Cross-functional Team... SoC ASIC Program Management Mobile Communications WiFi Digital Signal... Strategic Partnerships Testing IC Business Development Consumer Electronics Go-to-market Strategy Electronics RF System Architecture Analog See 19+     See less ", "Skills Product Management Strategic Planning Processors Semiconductors SoC Marketing Business Development Entrepreneurship Software Engineering User Experience Start-ups MRDs Intel Market Research VLSI Business Strategy System Architecture ASIC Competitive Analysis Microprocessors Embedded Systems Wireless Pre-sales Computer Architecture Electronics Go-to-market Strategy R&D Integration Strategy Enterprise Software Hardware Semiconductor Industry Product Development Arduino Management Software Development IC Verilog Embedded Software Software Design Hardware Architecture Mobile Devices Systems Engineering Debugging C Customer Relations C++ Python Image Processing Video Processing See 35+     See less Skills  Product Management Strategic Planning Processors Semiconductors SoC Marketing Business Development Entrepreneurship Software Engineering User Experience Start-ups MRDs Intel Market Research VLSI Business Strategy System Architecture ASIC Competitive Analysis Microprocessors Embedded Systems Wireless Pre-sales Computer Architecture Electronics Go-to-market Strategy R&D Integration Strategy Enterprise Software Hardware Semiconductor Industry Product Development Arduino Management Software Development IC Verilog Embedded Software Software Design Hardware Architecture Mobile Devices Systems Engineering Debugging C Customer Relations C++ Python Image Processing Video Processing See 35+     See less Product Management Strategic Planning Processors Semiconductors SoC Marketing Business Development Entrepreneurship Software Engineering User Experience Start-ups MRDs Intel Market Research VLSI Business Strategy System Architecture ASIC Competitive Analysis Microprocessors Embedded Systems Wireless Pre-sales Computer Architecture Electronics Go-to-market Strategy R&D Integration Strategy Enterprise Software Hardware Semiconductor Industry Product Development Arduino Management Software Development IC Verilog Embedded Software Software Design Hardware Architecture Mobile Devices Systems Engineering Debugging C Customer Relations C++ Python Image Processing Video Processing See 35+     See less Product Management Strategic Planning Processors Semiconductors SoC Marketing Business Development Entrepreneurship Software Engineering User Experience Start-ups MRDs Intel Market Research VLSI Business Strategy System Architecture ASIC Competitive Analysis Microprocessors Embedded Systems Wireless Pre-sales Computer Architecture Electronics Go-to-market Strategy R&D Integration Strategy Enterprise Software Hardware Semiconductor Industry Product Development Arduino Management Software Development IC Verilog Embedded Software Software Design Hardware Architecture Mobile Devices Systems Engineering Debugging C Customer Relations C++ Python Image Processing Video Processing See 35+     See less ", "Experience Senior Strategic Planner Intel Corporation February 2011  – Present (4 years 7 months) Munich Area, Germany Responsible for strategic planning of our 2G/3G/LTE modem. Single point of contact for Network Vendors and feature discussion with Mobile Operators. Focus on Protocol Stack Features and IMS Product Marketing Manager Comneon January 2008  – Present (7 years 8 months) Responsible for the Roadmap of our IMS device frame work and for our 2G/3G protocol stack Project Leader Nokia Siemens Networks 1990  –  2008  (18 years) Project Leader Nokia Siemens Networks 1990  –  2008  (18 years) Senior Strategic Planner Intel Corporation February 2011  – Present (4 years 7 months) Munich Area, Germany Responsible for strategic planning of our 2G/3G/LTE modem. Single point of contact for Network Vendors and feature discussion with Mobile Operators. Focus on Protocol Stack Features and IMS Senior Strategic Planner Intel Corporation February 2011  – Present (4 years 7 months) Munich Area, Germany Responsible for strategic planning of our 2G/3G/LTE modem. Single point of contact for Network Vendors and feature discussion with Mobile Operators. Focus on Protocol Stack Features and IMS Product Marketing Manager Comneon January 2008  – Present (7 years 8 months) Responsible for the Roadmap of our IMS device frame work and for our 2G/3G protocol stack Product Marketing Manager Comneon January 2008  – Present (7 years 8 months) Responsible for the Roadmap of our IMS device frame work and for our 2G/3G protocol stack Project Leader Nokia Siemens Networks 1990  –  2008  (18 years) Project Leader Nokia Siemens Networks 1990  –  2008  (18 years) Project Leader Nokia Siemens Networks 1990  –  2008  (18 years) Project Leader Nokia Siemens Networks 1990  –  2008  (18 years) Skills 3G Telecommunications GSM Mobile Communications LTE IMS DB/DC UMTS IP Product Management Mobile Devices Skills  3G Telecommunications GSM Mobile Communications LTE IMS DB/DC UMTS IP Product Management Mobile Devices 3G Telecommunications GSM Mobile Communications LTE IMS DB/DC UMTS IP Product Management Mobile Devices 3G Telecommunications GSM Mobile Communications LTE IMS DB/DC UMTS IP Product Management Mobile Devices Education Arnold-Janssen-Gymnasium Arnold-Janssen-Gymnasium Arnold-Janssen-Gymnasium Arnold-Janssen-Gymnasium ", "Summary Accomplished Senior Facilities Project Manager with experience in managing client office space and leading vital facilities projects for Fortune 500 organizations. Instrumental in driving flawless execution of multimillion-dollar office relocations involving thousands of employees. Dedicated to maximizing space utilization, managing supplier performance, and ensuring regulatory & legal compliance. Adept at multi-tasking in fast-paced, deadline-driven work environments. Finely honed leadership, negotiation, organizational, contract administration, budgeting, analytical, and issue resolution skills. Relevant core competencies include:  \n \n•Facilities Project Management\t•Procurement Management\t•Campus Relocations \n•Facilities Space Planning\t•CapEx Budgeting\t•Building Space Analysis \n•Architecture & Construction\t•Vendor/Contractor Relations •Headcount Validation \n•Contract Negotiations\t•Operations Management\t•Space Utilization  \n•Contract Administration\t•Strategic & Tactical Planning •Process Improvements \n \nProficient in: MS Word, Excel, PowerPoint, Outlook, AutoCad \n Summary Accomplished Senior Facilities Project Manager with experience in managing client office space and leading vital facilities projects for Fortune 500 organizations. Instrumental in driving flawless execution of multimillion-dollar office relocations involving thousands of employees. Dedicated to maximizing space utilization, managing supplier performance, and ensuring regulatory & legal compliance. Adept at multi-tasking in fast-paced, deadline-driven work environments. Finely honed leadership, negotiation, organizational, contract administration, budgeting, analytical, and issue resolution skills. Relevant core competencies include:  \n \n•Facilities Project Management\t•Procurement Management\t•Campus Relocations \n•Facilities Space Planning\t•CapEx Budgeting\t•Building Space Analysis \n•Architecture & Construction\t•Vendor/Contractor Relations •Headcount Validation \n•Contract Negotiations\t•Operations Management\t•Space Utilization  \n•Contract Administration\t•Strategic & Tactical Planning •Process Improvements \n \nProficient in: MS Word, Excel, PowerPoint, Outlook, AutoCad \n Accomplished Senior Facilities Project Manager with experience in managing client office space and leading vital facilities projects for Fortune 500 organizations. Instrumental in driving flawless execution of multimillion-dollar office relocations involving thousands of employees. Dedicated to maximizing space utilization, managing supplier performance, and ensuring regulatory & legal compliance. Adept at multi-tasking in fast-paced, deadline-driven work environments. Finely honed leadership, negotiation, organizational, contract administration, budgeting, analytical, and issue resolution skills. Relevant core competencies include:  \n \n•Facilities Project Management\t•Procurement Management\t•Campus Relocations \n•Facilities Space Planning\t•CapEx Budgeting\t•Building Space Analysis \n•Architecture & Construction\t•Vendor/Contractor Relations •Headcount Validation \n•Contract Negotiations\t•Operations Management\t•Space Utilization  \n•Contract Administration\t•Strategic & Tactical Planning •Process Improvements \n \nProficient in: MS Word, Excel, PowerPoint, Outlook, AutoCad \n Accomplished Senior Facilities Project Manager with experience in managing client office space and leading vital facilities projects for Fortune 500 organizations. Instrumental in driving flawless execution of multimillion-dollar office relocations involving thousands of employees. Dedicated to maximizing space utilization, managing supplier performance, and ensuring regulatory & legal compliance. Adept at multi-tasking in fast-paced, deadline-driven work environments. Finely honed leadership, negotiation, organizational, contract administration, budgeting, analytical, and issue resolution skills. Relevant core competencies include:  \n \n•Facilities Project Management\t•Procurement Management\t•Campus Relocations \n•Facilities Space Planning\t•CapEx Budgeting\t•Building Space Analysis \n•Architecture & Construction\t•Vendor/Contractor Relations •Headcount Validation \n•Contract Negotiations\t•Operations Management\t•Space Utilization  \n•Contract Administration\t•Strategic & Tactical Planning •Process Improvements \n \nProficient in: MS Word, Excel, PowerPoint, Outlook, AutoCad \n Languages   Skills Program Management Process Improvement Project Planning Operations Management Budgets Construction Management Contract Management Procurement Process Engineering Training Strategic Planning Management Engineering Analysis Project Management Facilities Management Manufacturing Negotiation Leadership CAD MS Project Architectures Team Building Process Scheduler Team Leadership Cross-functional Team... Continuous Improvement Vendor Management Construction Contract Negotiation Strategy Change Management See 17+     See less Skills  Program Management Process Improvement Project Planning Operations Management Budgets Construction Management Contract Management Procurement Process Engineering Training Strategic Planning Management Engineering Analysis Project Management Facilities Management Manufacturing Negotiation Leadership CAD MS Project Architectures Team Building Process Scheduler Team Leadership Cross-functional Team... Continuous Improvement Vendor Management Construction Contract Negotiation Strategy Change Management See 17+     See less Program Management Process Improvement Project Planning Operations Management Budgets Construction Management Contract Management Procurement Process Engineering Training Strategic Planning Management Engineering Analysis Project Management Facilities Management Manufacturing Negotiation Leadership CAD MS Project Architectures Team Building Process Scheduler Team Leadership Cross-functional Team... Continuous Improvement Vendor Management Construction Contract Negotiation Strategy Change Management See 17+     See less Program Management Process Improvement Project Planning Operations Management Budgets Construction Management Contract Management Procurement Process Engineering Training Strategic Planning Management Engineering Analysis Project Management Facilities Management Manufacturing Negotiation Leadership CAD MS Project Architectures Team Building Process Scheduler Team Leadership Cross-functional Team... Continuous Improvement Vendor Management Construction Contract Negotiation Strategy Change Management See 17+     See less Education Portland Community College Certification 2010  – 2012 University of Illinois Bachelor of Architecture (BArch) University of Illinois Bachelor of Arts (BA) Portland Community College Certification 2010  – 2012 Portland Community College Certification 2010  – 2012 Portland Community College Certification 2010  – 2012 University of Illinois Bachelor of Architecture (BArch) University of Illinois Bachelor of Architecture (BArch) University of Illinois Bachelor of Architecture (BArch) University of Illinois Bachelor of Arts (BA) University of Illinois Bachelor of Arts (BA) University of Illinois Bachelor of Arts (BA) Honors & Awards ", "Summary An accomplished business professional with strong technology experience, including driving end-to-end business performance through strategic planning, program development, and project management. Leverages expertise in multi-year forecasting and business planning, with added value in sales model development, customer behavior analysis, product line management, and solving ambiguous or unbounded problems. Summary An accomplished business professional with strong technology experience, including driving end-to-end business performance through strategic planning, program development, and project management. Leverages expertise in multi-year forecasting and business planning, with added value in sales model development, customer behavior analysis, product line management, and solving ambiguous or unbounded problems. An accomplished business professional with strong technology experience, including driving end-to-end business performance through strategic planning, program development, and project management. Leverages expertise in multi-year forecasting and business planning, with added value in sales model development, customer behavior analysis, product line management, and solving ambiguous or unbounded problems. An accomplished business professional with strong technology experience, including driving end-to-end business performance through strategic planning, program development, and project management. Leverages expertise in multi-year forecasting and business planning, with added value in sales model development, customer behavior analysis, product line management, and solving ambiguous or unbounded problems. Experience Senior Business Planner, Senior Strategic Planner Intel Corporation 1999  –  2015  (16 years) Chandler, AZ Senior Business Planner \n•\tTurned a classic competitive assignment into initiating the Quark product line.  \n•\tDeveloped a brand sales model that quantified sales elasticity and buying behaviors, fit most industries, accounted for the 2008 downturn, shared with sales and marketing VPs and Controllers across Intel. Explains most CPU brand sales since 1965. \n•\tCreated a 6-year forecast for PC market share that resulted in a mean error of 1% over 24 quarters, and server version with a mean error of 3%. Reworked the wireless sales model and cut the error rate by 50%.  \n•\tAutomated the embedded Internet of Things (IOT) market model and created algorithms to do hardware, software, geographical, and dollar range splits used across Intel. Used to justify the Altera acquisition.  \n•\tDrove consensus across the company about the impact of IOT, big data and any economic recovery on server sales. \n \nSenior Strategic Planner \n•\tInitiated product concepts, built cross-functional teams, created business plans and secured funding for Xeon server processors, platforms, and technologies. These Xeon processors had revenues over $3 Billion. \n•\tEstablished reliability standards for server products, and drove corresponding PC standards adoption. \n•\tDrove the major server change from single-core to multi-core products. Also guided the banking and financial markets from MIPS to Intel, and then from hardware to software checking without interruption. \n•\tRemoved a product line from the roadmap that would have required 2,000+ engineers, saving billions of dollars. \n Product Marketing and Planning Real 3D 1997  –  1999  (2 years) Orlando, FL Created business plans for PC graphics products. Managed co-development of the Intel 740. Graphics card received 26 awards. Drove Fab selection. Strategic Marketing VLSI Technology 1995  –  1997  (2 years) Tempe, AZ Managed PC graphics and 3D digital audio product lines. Created business plans, and got management funding. Won designs at Micron, Real 3D, and Q-Sound. Initiated ISV program. Senior Business Planner, Senior Strategic Planner Intel Corporation 1999  –  2015  (16 years) Chandler, AZ Senior Business Planner \n•\tTurned a classic competitive assignment into initiating the Quark product line.  \n•\tDeveloped a brand sales model that quantified sales elasticity and buying behaviors, fit most industries, accounted for the 2008 downturn, shared with sales and marketing VPs and Controllers across Intel. Explains most CPU brand sales since 1965. \n•\tCreated a 6-year forecast for PC market share that resulted in a mean error of 1% over 24 quarters, and server version with a mean error of 3%. Reworked the wireless sales model and cut the error rate by 50%.  \n•\tAutomated the embedded Internet of Things (IOT) market model and created algorithms to do hardware, software, geographical, and dollar range splits used across Intel. Used to justify the Altera acquisition.  \n•\tDrove consensus across the company about the impact of IOT, big data and any economic recovery on server sales. \n \nSenior Strategic Planner \n•\tInitiated product concepts, built cross-functional teams, created business plans and secured funding for Xeon server processors, platforms, and technologies. These Xeon processors had revenues over $3 Billion. \n•\tEstablished reliability standards for server products, and drove corresponding PC standards adoption. \n•\tDrove the major server change from single-core to multi-core products. Also guided the banking and financial markets from MIPS to Intel, and then from hardware to software checking without interruption. \n•\tRemoved a product line from the roadmap that would have required 2,000+ engineers, saving billions of dollars. \n Senior Business Planner, Senior Strategic Planner Intel Corporation 1999  –  2015  (16 years) Chandler, AZ Senior Business Planner \n•\tTurned a classic competitive assignment into initiating the Quark product line.  \n•\tDeveloped a brand sales model that quantified sales elasticity and buying behaviors, fit most industries, accounted for the 2008 downturn, shared with sales and marketing VPs and Controllers across Intel. Explains most CPU brand sales since 1965. \n•\tCreated a 6-year forecast for PC market share that resulted in a mean error of 1% over 24 quarters, and server version with a mean error of 3%. Reworked the wireless sales model and cut the error rate by 50%.  \n•\tAutomated the embedded Internet of Things (IOT) market model and created algorithms to do hardware, software, geographical, and dollar range splits used across Intel. Used to justify the Altera acquisition.  \n•\tDrove consensus across the company about the impact of IOT, big data and any economic recovery on server sales. \n \nSenior Strategic Planner \n•\tInitiated product concepts, built cross-functional teams, created business plans and secured funding for Xeon server processors, platforms, and technologies. These Xeon processors had revenues over $3 Billion. \n•\tEstablished reliability standards for server products, and drove corresponding PC standards adoption. \n•\tDrove the major server change from single-core to multi-core products. Also guided the banking and financial markets from MIPS to Intel, and then from hardware to software checking without interruption. \n•\tRemoved a product line from the roadmap that would have required 2,000+ engineers, saving billions of dollars. \n Product Marketing and Planning Real 3D 1997  –  1999  (2 years) Orlando, FL Created business plans for PC graphics products. Managed co-development of the Intel 740. Graphics card received 26 awards. Drove Fab selection. Product Marketing and Planning Real 3D 1997  –  1999  (2 years) Orlando, FL Created business plans for PC graphics products. Managed co-development of the Intel 740. Graphics card received 26 awards. Drove Fab selection. Strategic Marketing VLSI Technology 1995  –  1997  (2 years) Tempe, AZ Managed PC graphics and 3D digital audio product lines. Created business plans, and got management funding. Won designs at Micron, Real 3D, and Q-Sound. Initiated ISV program. Strategic Marketing VLSI Technology 1995  –  1997  (2 years) Tempe, AZ Managed PC graphics and 3D digital audio product lines. Created business plans, and got management funding. Won designs at Micron, Real 3D, and Q-Sound. Initiated ISV program. Skills Product Management Cross-functional Team... Management Embedded Systems Product Marketing Program Management Semiconductors Hardware Product Development Wireless Processors Market Research Strategic Planning Business Planning Internet of Things High Performance... Servers See 2+     See less Skills  Product Management Cross-functional Team... Management Embedded Systems Product Marketing Program Management Semiconductors Hardware Product Development Wireless Processors Market Research Strategic Planning Business Planning Internet of Things High Performance... Servers See 2+     See less Product Management Cross-functional Team... Management Embedded Systems Product Marketing Program Management Semiconductors Hardware Product Development Wireless Processors Market Research Strategic Planning Business Planning Internet of Things High Performance... Servers See 2+     See less Product Management Cross-functional Team... Management Embedded Systems Product Marketing Program Management Semiconductors Hardware Product Development Wireless Processors Market Research Strategic Planning Business Planning Internet of Things High Performance... Servers See 2+     See less Education Cornell University Bachelor of Science (BS),  Electrical and Electronics Engineering - Computer Architecture Cornell University - Johnson Graduate School of Management Master of Business Administration (MBA),  Marketing Activities and Societies:  Teaching Assistant for Micro Economics Cornell University Bachelor of Science (BS),  Electrical and Electronics Engineering - Computer Architecture Cornell University Bachelor of Science (BS),  Electrical and Electronics Engineering - Computer Architecture Cornell University Bachelor of Science (BS),  Electrical and Electronics Engineering - Computer Architecture Cornell University - Johnson Graduate School of Management Master of Business Administration (MBA),  Marketing Activities and Societies:  Teaching Assistant for Micro Economics Cornell University - Johnson Graduate School of Management Master of Business Administration (MBA),  Marketing Activities and Societies:  Teaching Assistant for Micro Economics Cornell University - Johnson Graduate School of Management Master of Business Administration (MBA),  Marketing Activities and Societies:  Teaching Assistant for Micro Economics ", "Summary I'm a technologist at heart who loves the challenges of transforming something unknown to something real. In an environment where competitive landscape is changing overnight, I believe that leadership is defined by solving customers' core problems with flawless execution and superior design.  \n \nI’m a proven leader with a track record of successfully leading cross-functional teams to exceed business goals. Over my professional career, I have groomed myself in many different functions and developed the right balance of technology and business skills with a Masters in Computer Science from USC (Los Angeles) and a world renowned MBA from Haas School of Business (University of California, Berkeley). \n \nSpecialties: Product Management, Roadmap development, Key stakeholder management, Project life cycle, Go-to-market strategy, Business development, User experience, Competitive analysis, Technology evaluation, People management, Operational execution of multi-release/multi-product strategy. Summary I'm a technologist at heart who loves the challenges of transforming something unknown to something real. In an environment where competitive landscape is changing overnight, I believe that leadership is defined by solving customers' core problems with flawless execution and superior design.  \n \nI’m a proven leader with a track record of successfully leading cross-functional teams to exceed business goals. Over my professional career, I have groomed myself in many different functions and developed the right balance of technology and business skills with a Masters in Computer Science from USC (Los Angeles) and a world renowned MBA from Haas School of Business (University of California, Berkeley). \n \nSpecialties: Product Management, Roadmap development, Key stakeholder management, Project life cycle, Go-to-market strategy, Business development, User experience, Competitive analysis, Technology evaluation, People management, Operational execution of multi-release/multi-product strategy. I'm a technologist at heart who loves the challenges of transforming something unknown to something real. In an environment where competitive landscape is changing overnight, I believe that leadership is defined by solving customers' core problems with flawless execution and superior design.  \n \nI’m a proven leader with a track record of successfully leading cross-functional teams to exceed business goals. Over my professional career, I have groomed myself in many different functions and developed the right balance of technology and business skills with a Masters in Computer Science from USC (Los Angeles) and a world renowned MBA from Haas School of Business (University of California, Berkeley). \n \nSpecialties: Product Management, Roadmap development, Key stakeholder management, Project life cycle, Go-to-market strategy, Business development, User experience, Competitive analysis, Technology evaluation, People management, Operational execution of multi-release/multi-product strategy. I'm a technologist at heart who loves the challenges of transforming something unknown to something real. In an environment where competitive landscape is changing overnight, I believe that leadership is defined by solving customers' core problems with flawless execution and superior design.  \n \nI’m a proven leader with a track record of successfully leading cross-functional teams to exceed business goals. Over my professional career, I have groomed myself in many different functions and developed the right balance of technology and business skills with a Masters in Computer Science from USC (Los Angeles) and a world renowned MBA from Haas School of Business (University of California, Berkeley). \n \nSpecialties: Product Management, Roadmap development, Key stakeholder management, Project life cycle, Go-to-market strategy, Business development, User experience, Competitive analysis, Technology evaluation, People management, Operational execution of multi-release/multi-product strategy. Experience Senior Product Manager Amazon April 2014  – Present (1 year 5 months) Greater Seattle Area Responsible for planning and execution of various post-paid wireless initiatives in US and International territories. \n \nDrive product strategy and creating a best in class experience for buying a mobile device with service.  \n \nConduct business analysis, including gathering business/customer requirements, technical inputs and market data, and translation of results into business priorities and functional specifications. \n \nLeading cross-functional teams and oversee product/technology coordination throughout the development life-cycle, from strategic definition to delivery. \n \nDrive a clear and well-defined process to assess priorities, generate requirements and ensure on-time delivery of key initiatives. \n \nManage the product relationships with Amazon and mobile service providers both local and international. Senior Strategic Planner Intel Corporation May 2012  –  April 2014  (2 years) United States Promoted to lead partnering and influencing strategic deliverables for phone and tablet platform throughout silicon design organization. Serve in Product Management role and run critical initiatives in multiple areas, including augmented reality, to influence customer product adoptions. Oversee cross-functional group responsible for product and experience definition. Create business, execution, and go-to-market plans. Monitor emerging technologies to identify opportunities for M&A deals. \n♦ Completed an end-to-end smartphone product design targeted for emerging markets with unique differentiating features. \n♦ Invented and delivered Intel’s first ever self-powered wearable to facilitate next-generation business. \n♦ Market expert on emerging market segment and go-to-person on evaluating new investment and concept development opportunity in Intel Silicon Design team. \n♦ Drafted critical statement of work (SOW) with two Augmented Reality vendors and assisted with contract negotiations. \n♦ Collaborated with leadership teams to develop a corporate-wide process to integrate user experience methodologies across all Intel platforms. Research and Development Manager Intel Corporation March 2008  –  April 2012  (4 years 2 months) Hillsboro, Oregon Spearheaded business development, strategy design, relationship management, technology transfer to product roadmaps, and formulation of next-generation technology solutions. Supervised as many as 13 senior research personnel. Administered and co-managed operational and project budgets up to $1.1M. Established and directed Power Management Architecture team. Validated product strategies with external user design experience firm and delivered use case definitions. Formulated business value propositions for several power management technologies. \n♦ Led high-profile team that drove innovation, producing 10 papers, 46 inventions, and 17 patents. \n♦ Facilitated investments as large as $200M by analyzing business models of startups and advising Cleantech Investment Group on viable investment choices. \n♦ Oversaw team that created methodology for reducing technology adoption by one year, after formulating vision for establishing long-term collaboration between Intel Labs and Intel IT. \n♦ Researched and analyzed new market opportunity for home desktop and tablet lines. Prepared project proposal and business plan to acquire $200,000 in seed funding for first functional hardware platform prototype.  \n♦ Created new multi-million dollar business model for proprietary technology and delivered associated business plan to obtain $250,000 in seed funding from new business initiative (NBI). \n♦ Drove company-wide strategy to improve sustainable leadership in energy efficiency. Built successful relationships with Computer Engineering departments of University of California San Diego and other institutions to support 2015 corporate energy-efficiency charter.  \n♦ Delivered two power management initiatives with power savings up to 60% and revenues of more than $300M across all product segments.  \n♦ Achieved new power management solution for micro-server platform that improved energy efficiency by 30% and resulted in two product design wins with OEMs. Research Scientist Intel Corporation February 2004  –  February 2008  (4 years 1 month) Portland, Oregon Area Oversaw one of Intel Labs' Top Five strategic priorities. Managed development and design of power management technologies and architectural solutions/frameworks. Supervised project teams \n \n♦ Lowered power consumption 20% for server products. Filed three patents for innovative algorithms. \n♦ Expedited technology implementations by three quarters, through formulation and implementation of critical processes to review technologies. \n♦ Lowered manufacturing costs 35% and streamlined the deployment schedule 90 days by simplifying the architecture design of a proof-of-concept platform Senior Software Engineer Intel Corporation February 2002  –  January 2004  (2 years) Portland, Oregon Area Designed and developed backend software infrastructure and web solutions. Supervised staff of five. \n \n♦ Conducted make vs. buy analysis and proposed building in-house database. Led design activities and delivered first release, used by 20,000 employees, in only nine months. Database enabled CPU designers to improve batch process execution by 20% and improve backend processes. \n♦ Saved $3M in switching costs and increased bug tracking system performance 50% by analyzing complex bottlenecks and creating performance optimization solutions. \n♦ Lowered maintenance costs 30% by redesigning lab infrastructure used by 200 employees Software Engineer Intel Corporation February 2000  –  January 2002  (2 years) Portland, Oregon Area Summary: Developed concepts, prototypes and product-ready software framework to deploy personalization technologies on desktop, handheld and mobile platforms. \n \n♦ Developed Apache server module extension to enable consumer profile based customization of web site content. Released the module as part of a major software release by Intel's Wireless Communication Group. \n♦ Designed and implemented Kerberos based authentication system for a distributed environment and was delivered to key customer. Software Engineer Zensar 1997  –  1998  (1 year) Designed and developed a JSQL pre-compiler tool (similar to Oracle’s SQLJ) for Object Manager Phase IV for Fujitsu (Japan) on behalf of ICIL Senior Product Manager Amazon April 2014  – Present (1 year 5 months) Greater Seattle Area Responsible for planning and execution of various post-paid wireless initiatives in US and International territories. \n \nDrive product strategy and creating a best in class experience for buying a mobile device with service.  \n \nConduct business analysis, including gathering business/customer requirements, technical inputs and market data, and translation of results into business priorities and functional specifications. \n \nLeading cross-functional teams and oversee product/technology coordination throughout the development life-cycle, from strategic definition to delivery. \n \nDrive a clear and well-defined process to assess priorities, generate requirements and ensure on-time delivery of key initiatives. \n \nManage the product relationships with Amazon and mobile service providers both local and international. Senior Product Manager Amazon April 2014  – Present (1 year 5 months) Greater Seattle Area Responsible for planning and execution of various post-paid wireless initiatives in US and International territories. \n \nDrive product strategy and creating a best in class experience for buying a mobile device with service.  \n \nConduct business analysis, including gathering business/customer requirements, technical inputs and market data, and translation of results into business priorities and functional specifications. \n \nLeading cross-functional teams and oversee product/technology coordination throughout the development life-cycle, from strategic definition to delivery. \n \nDrive a clear and well-defined process to assess priorities, generate requirements and ensure on-time delivery of key initiatives. \n \nManage the product relationships with Amazon and mobile service providers both local and international. Senior Strategic Planner Intel Corporation May 2012  –  April 2014  (2 years) United States Promoted to lead partnering and influencing strategic deliverables for phone and tablet platform throughout silicon design organization. Serve in Product Management role and run critical initiatives in multiple areas, including augmented reality, to influence customer product adoptions. Oversee cross-functional group responsible for product and experience definition. Create business, execution, and go-to-market plans. Monitor emerging technologies to identify opportunities for M&A deals. \n♦ Completed an end-to-end smartphone product design targeted for emerging markets with unique differentiating features. \n♦ Invented and delivered Intel’s first ever self-powered wearable to facilitate next-generation business. \n♦ Market expert on emerging market segment and go-to-person on evaluating new investment and concept development opportunity in Intel Silicon Design team. \n♦ Drafted critical statement of work (SOW) with two Augmented Reality vendors and assisted with contract negotiations. \n♦ Collaborated with leadership teams to develop a corporate-wide process to integrate user experience methodologies across all Intel platforms. Senior Strategic Planner Intel Corporation May 2012  –  April 2014  (2 years) United States Promoted to lead partnering and influencing strategic deliverables for phone and tablet platform throughout silicon design organization. Serve in Product Management role and run critical initiatives in multiple areas, including augmented reality, to influence customer product adoptions. Oversee cross-functional group responsible for product and experience definition. Create business, execution, and go-to-market plans. Monitor emerging technologies to identify opportunities for M&A deals. \n♦ Completed an end-to-end smartphone product design targeted for emerging markets with unique differentiating features. \n♦ Invented and delivered Intel’s first ever self-powered wearable to facilitate next-generation business. \n♦ Market expert on emerging market segment and go-to-person on evaluating new investment and concept development opportunity in Intel Silicon Design team. \n♦ Drafted critical statement of work (SOW) with two Augmented Reality vendors and assisted with contract negotiations. \n♦ Collaborated with leadership teams to develop a corporate-wide process to integrate user experience methodologies across all Intel platforms. Research and Development Manager Intel Corporation March 2008  –  April 2012  (4 years 2 months) Hillsboro, Oregon Spearheaded business development, strategy design, relationship management, technology transfer to product roadmaps, and formulation of next-generation technology solutions. Supervised as many as 13 senior research personnel. Administered and co-managed operational and project budgets up to $1.1M. Established and directed Power Management Architecture team. Validated product strategies with external user design experience firm and delivered use case definitions. Formulated business value propositions for several power management technologies. \n♦ Led high-profile team that drove innovation, producing 10 papers, 46 inventions, and 17 patents. \n♦ Facilitated investments as large as $200M by analyzing business models of startups and advising Cleantech Investment Group on viable investment choices. \n♦ Oversaw team that created methodology for reducing technology adoption by one year, after formulating vision for establishing long-term collaboration between Intel Labs and Intel IT. \n♦ Researched and analyzed new market opportunity for home desktop and tablet lines. Prepared project proposal and business plan to acquire $200,000 in seed funding for first functional hardware platform prototype.  \n♦ Created new multi-million dollar business model for proprietary technology and delivered associated business plan to obtain $250,000 in seed funding from new business initiative (NBI). \n♦ Drove company-wide strategy to improve sustainable leadership in energy efficiency. Built successful relationships with Computer Engineering departments of University of California San Diego and other institutions to support 2015 corporate energy-efficiency charter.  \n♦ Delivered two power management initiatives with power savings up to 60% and revenues of more than $300M across all product segments.  \n♦ Achieved new power management solution for micro-server platform that improved energy efficiency by 30% and resulted in two product design wins with OEMs. Research and Development Manager Intel Corporation March 2008  –  April 2012  (4 years 2 months) Hillsboro, Oregon Spearheaded business development, strategy design, relationship management, technology transfer to product roadmaps, and formulation of next-generation technology solutions. Supervised as many as 13 senior research personnel. Administered and co-managed operational and project budgets up to $1.1M. Established and directed Power Management Architecture team. Validated product strategies with external user design experience firm and delivered use case definitions. Formulated business value propositions for several power management technologies. \n♦ Led high-profile team that drove innovation, producing 10 papers, 46 inventions, and 17 patents. \n♦ Facilitated investments as large as $200M by analyzing business models of startups and advising Cleantech Investment Group on viable investment choices. \n♦ Oversaw team that created methodology for reducing technology adoption by one year, after formulating vision for establishing long-term collaboration between Intel Labs and Intel IT. \n♦ Researched and analyzed new market opportunity for home desktop and tablet lines. Prepared project proposal and business plan to acquire $200,000 in seed funding for first functional hardware platform prototype.  \n♦ Created new multi-million dollar business model for proprietary technology and delivered associated business plan to obtain $250,000 in seed funding from new business initiative (NBI). \n♦ Drove company-wide strategy to improve sustainable leadership in energy efficiency. Built successful relationships with Computer Engineering departments of University of California San Diego and other institutions to support 2015 corporate energy-efficiency charter.  \n♦ Delivered two power management initiatives with power savings up to 60% and revenues of more than $300M across all product segments.  \n♦ Achieved new power management solution for micro-server platform that improved energy efficiency by 30% and resulted in two product design wins with OEMs. Research Scientist Intel Corporation February 2004  –  February 2008  (4 years 1 month) Portland, Oregon Area Oversaw one of Intel Labs' Top Five strategic priorities. Managed development and design of power management technologies and architectural solutions/frameworks. Supervised project teams \n \n♦ Lowered power consumption 20% for server products. Filed three patents for innovative algorithms. \n♦ Expedited technology implementations by three quarters, through formulation and implementation of critical processes to review technologies. \n♦ Lowered manufacturing costs 35% and streamlined the deployment schedule 90 days by simplifying the architecture design of a proof-of-concept platform Research Scientist Intel Corporation February 2004  –  February 2008  (4 years 1 month) Portland, Oregon Area Oversaw one of Intel Labs' Top Five strategic priorities. Managed development and design of power management technologies and architectural solutions/frameworks. Supervised project teams \n \n♦ Lowered power consumption 20% for server products. Filed three patents for innovative algorithms. \n♦ Expedited technology implementations by three quarters, through formulation and implementation of critical processes to review technologies. \n♦ Lowered manufacturing costs 35% and streamlined the deployment schedule 90 days by simplifying the architecture design of a proof-of-concept platform Senior Software Engineer Intel Corporation February 2002  –  January 2004  (2 years) Portland, Oregon Area Designed and developed backend software infrastructure and web solutions. Supervised staff of five. \n \n♦ Conducted make vs. buy analysis and proposed building in-house database. Led design activities and delivered first release, used by 20,000 employees, in only nine months. Database enabled CPU designers to improve batch process execution by 20% and improve backend processes. \n♦ Saved $3M in switching costs and increased bug tracking system performance 50% by analyzing complex bottlenecks and creating performance optimization solutions. \n♦ Lowered maintenance costs 30% by redesigning lab infrastructure used by 200 employees Senior Software Engineer Intel Corporation February 2002  –  January 2004  (2 years) Portland, Oregon Area Designed and developed backend software infrastructure and web solutions. Supervised staff of five. \n \n♦ Conducted make vs. buy analysis and proposed building in-house database. Led design activities and delivered first release, used by 20,000 employees, in only nine months. Database enabled CPU designers to improve batch process execution by 20% and improve backend processes. \n♦ Saved $3M in switching costs and increased bug tracking system performance 50% by analyzing complex bottlenecks and creating performance optimization solutions. \n♦ Lowered maintenance costs 30% by redesigning lab infrastructure used by 200 employees Software Engineer Intel Corporation February 2000  –  January 2002  (2 years) Portland, Oregon Area Summary: Developed concepts, prototypes and product-ready software framework to deploy personalization technologies on desktop, handheld and mobile platforms. \n \n♦ Developed Apache server module extension to enable consumer profile based customization of web site content. Released the module as part of a major software release by Intel's Wireless Communication Group. \n♦ Designed and implemented Kerberos based authentication system for a distributed environment and was delivered to key customer. Software Engineer Intel Corporation February 2000  –  January 2002  (2 years) Portland, Oregon Area Summary: Developed concepts, prototypes and product-ready software framework to deploy personalization technologies on desktop, handheld and mobile platforms. \n \n♦ Developed Apache server module extension to enable consumer profile based customization of web site content. Released the module as part of a major software release by Intel's Wireless Communication Group. \n♦ Designed and implemented Kerberos based authentication system for a distributed environment and was delivered to key customer. Software Engineer Zensar 1997  –  1998  (1 year) Designed and developed a JSQL pre-compiler tool (similar to Oracle’s SQLJ) for Object Manager Phase IV for Fujitsu (Japan) on behalf of ICIL Software Engineer Zensar 1997  –  1998  (1 year) Designed and developed a JSQL pre-compiler tool (similar to Oracle’s SQLJ) for Object Manager Phase IV for Fujitsu (Japan) on behalf of ICIL Languages English Hindi Marathi English Hindi Marathi English Hindi Marathi Skills New Business Development Business Strategy Competitive Analysis Product Management Product Design Strategic Planning Emerging Technologies Marketing Strategy Written & Oral... Coaching Processors Computer Architecture Product Lifecycle... Cross-functional Team... Go-to-market Strategy Management Project Management Strategy Cloud Computing Mobile Devices Software Development Start-ups Leadership Enterprise Software See 9+     See less Skills  New Business Development Business Strategy Competitive Analysis Product Management Product Design Strategic Planning Emerging Technologies Marketing Strategy Written & Oral... Coaching Processors Computer Architecture Product Lifecycle... Cross-functional Team... Go-to-market Strategy Management Project Management Strategy Cloud Computing Mobile Devices Software Development Start-ups Leadership Enterprise Software See 9+     See less New Business Development Business Strategy Competitive Analysis Product Management Product Design Strategic Planning Emerging Technologies Marketing Strategy Written & Oral... Coaching Processors Computer Architecture Product Lifecycle... Cross-functional Team... Go-to-market Strategy Management Project Management Strategy Cloud Computing Mobile Devices Software Development Start-ups Leadership Enterprise Software See 9+     See less New Business Development Business Strategy Competitive Analysis Product Management Product Design Strategic Planning Emerging Technologies Marketing Strategy Written & Oral... Coaching Processors Computer Architecture Product Lifecycle... Cross-functional Team... Go-to-market Strategy Management Project Management Strategy Cloud Computing Mobile Devices Software Development Start-ups Leadership Enterprise Software See 9+     See less Education University of California, Berkeley - Walter A. Haas School of Business Master of Business Administration (M.B.A.),  Marketing ,  Strategy and Entrepreneurship 2009  – 2012 Focus Areas: Strategy, Business Model Innovation and Entrepreneurship \n \n♦ Key member of team that redeveloped business model strategy for Lexity.com. Identified new revenue streams and presented recommendations. \n♦ Participated on team that developed accepted strategy for Yahoo! To increase user engagement on yahoo.com website an estimated 20%. Team delivered presentation to Yahoo! Executives. \n♦ Contributed to market and segment analysis for project involving creation of marketing strategy and determination of pricing for launching LG's 100\" flat screen TV. \n♦ Formulated business plans for real estate finance startup and energy management startup. Developed and delivered VC pitches. Personally prepared competitive analyses, business model definitions, and pro-forma statements. \n♦ Aided in development of marketing strategy proposal for increasing brand awareness of boutique fashion design company, Kajan Padraig. Recommended three proposals to CEO, all were adopted. University of Southern California MS,  Computer Science 1998  – 2000 University of Pune BE,  Computer Science 1994  – 1997 University of California, Berkeley - Walter A. Haas School of Business Master of Business Administration (M.B.A.),  Marketing ,  Strategy and Entrepreneurship 2009  – 2012 Focus Areas: Strategy, Business Model Innovation and Entrepreneurship \n \n♦ Key member of team that redeveloped business model strategy for Lexity.com. Identified new revenue streams and presented recommendations. \n♦ Participated on team that developed accepted strategy for Yahoo! To increase user engagement on yahoo.com website an estimated 20%. Team delivered presentation to Yahoo! Executives. \n♦ Contributed to market and segment analysis for project involving creation of marketing strategy and determination of pricing for launching LG's 100\" flat screen TV. \n♦ Formulated business plans for real estate finance startup and energy management startup. Developed and delivered VC pitches. Personally prepared competitive analyses, business model definitions, and pro-forma statements. \n♦ Aided in development of marketing strategy proposal for increasing brand awareness of boutique fashion design company, Kajan Padraig. Recommended three proposals to CEO, all were adopted. University of California, Berkeley - Walter A. Haas School of Business Master of Business Administration (M.B.A.),  Marketing ,  Strategy and Entrepreneurship 2009  – 2012 Focus Areas: Strategy, Business Model Innovation and Entrepreneurship \n \n♦ Key member of team that redeveloped business model strategy for Lexity.com. Identified new revenue streams and presented recommendations. \n♦ Participated on team that developed accepted strategy for Yahoo! To increase user engagement on yahoo.com website an estimated 20%. Team delivered presentation to Yahoo! Executives. \n♦ Contributed to market and segment analysis for project involving creation of marketing strategy and determination of pricing for launching LG's 100\" flat screen TV. \n♦ Formulated business plans for real estate finance startup and energy management startup. Developed and delivered VC pitches. Personally prepared competitive analyses, business model definitions, and pro-forma statements. \n♦ Aided in development of marketing strategy proposal for increasing brand awareness of boutique fashion design company, Kajan Padraig. Recommended three proposals to CEO, all were adopted. University of California, Berkeley - Walter A. Haas School of Business Master of Business Administration (M.B.A.),  Marketing ,  Strategy and Entrepreneurship 2009  – 2012 Focus Areas: Strategy, Business Model Innovation and Entrepreneurship \n \n♦ Key member of team that redeveloped business model strategy for Lexity.com. Identified new revenue streams and presented recommendations. \n♦ Participated on team that developed accepted strategy for Yahoo! To increase user engagement on yahoo.com website an estimated 20%. Team delivered presentation to Yahoo! Executives. \n♦ Contributed to market and segment analysis for project involving creation of marketing strategy and determination of pricing for launching LG's 100\" flat screen TV. \n♦ Formulated business plans for real estate finance startup and energy management startup. Developed and delivered VC pitches. Personally prepared competitive analyses, business model definitions, and pro-forma statements. \n♦ Aided in development of marketing strategy proposal for increasing brand awareness of boutique fashion design company, Kajan Padraig. Recommended three proposals to CEO, all were adopted. University of Southern California MS,  Computer Science 1998  – 2000 University of Southern California MS,  Computer Science 1998  – 2000 University of Southern California MS,  Computer Science 1998  – 2000 University of Pune BE,  Computer Science 1994  – 1997 University of Pune BE,  Computer Science 1994  – 1997 University of Pune BE,  Computer Science 1994  – 1997 ", "Skills Software Development Program Management Mobile Devices Go-to-market Strategy Product Management Strategic Partnerships Analysis Leadership Management Product Marketing Project Planning Start-ups Semiconductors Executive Management Entrepreneurship Wireless Business Development Competitive Analysis Telecommunications Business Strategy Mergers & Acquisitions Marketing Business Planning New Business Development Strategy Product Development Marketing Strategy See 12+     See less Skills  Software Development Program Management Mobile Devices Go-to-market Strategy Product Management Strategic Partnerships Analysis Leadership Management Product Marketing Project Planning Start-ups Semiconductors Executive Management Entrepreneurship Wireless Business Development Competitive Analysis Telecommunications Business Strategy Mergers & Acquisitions Marketing Business Planning New Business Development Strategy Product Development Marketing Strategy See 12+     See less Software Development Program Management Mobile Devices Go-to-market Strategy Product Management Strategic Partnerships Analysis Leadership Management Product Marketing Project Planning Start-ups Semiconductors Executive Management Entrepreneurship Wireless Business Development Competitive Analysis Telecommunications Business Strategy Mergers & Acquisitions Marketing Business Planning New Business Development Strategy Product Development Marketing Strategy See 12+     See less Software Development Program Management Mobile Devices Go-to-market Strategy Product Management Strategic Partnerships Analysis Leadership Management Product Marketing Project Planning Start-ups Semiconductors Executive Management Entrepreneurship Wireless Business Development Competitive Analysis Telecommunications Business Strategy Mergers & Acquisitions Marketing Business Planning New Business Development Strategy Product Development Marketing Strategy See 12+     See less ", "Summary Zach Hamm is the Director of Media & Display Strategy and Planning in the Visual & Parallel Computing Group at Intel Corporation. He is responsible for industry focused strategic partnership and business development as well as setting the vision, strategy and future roadmap for a worldwide organization that develops & integrates media and display technologies for Intel's world class SoC's. \n \nPreviously, Zach was responsible for the planning of several successful Intel products grossing multi-billion dollar revenue including the first Intel x86 CPU with integrated processor graphics. \n \nZach joined Intel Corporation in 2001. Summary Zach Hamm is the Director of Media & Display Strategy and Planning in the Visual & Parallel Computing Group at Intel Corporation. He is responsible for industry focused strategic partnership and business development as well as setting the vision, strategy and future roadmap for a worldwide organization that develops & integrates media and display technologies for Intel's world class SoC's. \n \nPreviously, Zach was responsible for the planning of several successful Intel products grossing multi-billion dollar revenue including the first Intel x86 CPU with integrated processor graphics. \n \nZach joined Intel Corporation in 2001. Zach Hamm is the Director of Media & Display Strategy and Planning in the Visual & Parallel Computing Group at Intel Corporation. He is responsible for industry focused strategic partnership and business development as well as setting the vision, strategy and future roadmap for a worldwide organization that develops & integrates media and display technologies for Intel's world class SoC's. \n \nPreviously, Zach was responsible for the planning of several successful Intel products grossing multi-billion dollar revenue including the first Intel x86 CPU with integrated processor graphics. \n \nZach joined Intel Corporation in 2001. Zach Hamm is the Director of Media & Display Strategy and Planning in the Visual & Parallel Computing Group at Intel Corporation. He is responsible for industry focused strategic partnership and business development as well as setting the vision, strategy and future roadmap for a worldwide organization that develops & integrates media and display technologies for Intel's world class SoC's. \n \nPreviously, Zach was responsible for the planning of several successful Intel products grossing multi-billion dollar revenue including the first Intel x86 CPU with integrated processor graphics. \n \nZach joined Intel Corporation in 2001. Experience Director, Media & Display Strategy and Planning Intel Corporation July 2010  – Present (5 years 2 months) Sacramento, California Area Senior Strategic Planner Intel Corporation July 2006  –  June 2010  (4 years) Chipset and Graphics Marketing Intel Corporation July 2003  –  June 2006  (3 years) CPU Architect Intel Corporation July 2001  –  June 2003  (2 years) SW Engineer Harris Corporation January 2000  –  June 2000  (6 months) Director, Media & Display Strategy and Planning Intel Corporation July 2010  – Present (5 years 2 months) Sacramento, California Area Director, Media & Display Strategy and Planning Intel Corporation July 2010  – Present (5 years 2 months) Sacramento, California Area Senior Strategic Planner Intel Corporation July 2006  –  June 2010  (4 years) Senior Strategic Planner Intel Corporation July 2006  –  June 2010  (4 years) Chipset and Graphics Marketing Intel Corporation July 2003  –  June 2006  (3 years) Chipset and Graphics Marketing Intel Corporation July 2003  –  June 2006  (3 years) CPU Architect Intel Corporation July 2001  –  June 2003  (2 years) CPU Architect Intel Corporation July 2001  –  June 2003  (2 years) SW Engineer Harris Corporation January 2000  –  June 2000  (6 months) SW Engineer Harris Corporation January 2000  –  June 2000  (6 months) Skills Processors Strategic Partnerships Intel Cross-functional Team... SoC Go-to-market Strategy Semiconductors Strategy Business Development Management Program Management Strategic Roadmaps Competitive Analysis Product Planning Product Marketing Presentations Public Speaking Display Technologies Media Technologies HDR Streaming Media Video Wearable Computing Embedded Systems Computer Vision 3D graphics Semiconductor Industry LCD OLED AVC HEVC VP8 VP9 DisplayPort HDMI MIPI USB-C Thunderbolt WiGig Product Management Mobile Devices Wireless System Architecture Software Engineering Consumer Electronics See 30+     See less Skills  Processors Strategic Partnerships Intel Cross-functional Team... SoC Go-to-market Strategy Semiconductors Strategy Business Development Management Program Management Strategic Roadmaps Competitive Analysis Product Planning Product Marketing Presentations Public Speaking Display Technologies Media Technologies HDR Streaming Media Video Wearable Computing Embedded Systems Computer Vision 3D graphics Semiconductor Industry LCD OLED AVC HEVC VP8 VP9 DisplayPort HDMI MIPI USB-C Thunderbolt WiGig Product Management Mobile Devices Wireless System Architecture Software Engineering Consumer Electronics See 30+     See less Processors Strategic Partnerships Intel Cross-functional Team... SoC Go-to-market Strategy Semiconductors Strategy Business Development Management Program Management Strategic Roadmaps Competitive Analysis Product Planning Product Marketing Presentations Public Speaking Display Technologies Media Technologies HDR Streaming Media Video Wearable Computing Embedded Systems Computer Vision 3D graphics Semiconductor Industry LCD OLED AVC HEVC VP8 VP9 DisplayPort HDMI MIPI USB-C Thunderbolt WiGig Product Management Mobile Devices Wireless System Architecture Software Engineering Consumer Electronics See 30+     See less Processors Strategic Partnerships Intel Cross-functional Team... SoC Go-to-market Strategy Semiconductors Strategy Business Development Management Program Management Strategic Roadmaps Competitive Analysis Product Planning Product Marketing Presentations Public Speaking Display Technologies Media Technologies HDR Streaming Media Video Wearable Computing Embedded Systems Computer Vision 3D graphics Semiconductor Industry LCD OLED AVC HEVC VP8 VP9 DisplayPort HDMI MIPI USB-C Thunderbolt WiGig Product Management Mobile Devices Wireless System Architecture Software Engineering Consumer Electronics See 30+     See less Education Rochester Institute of Technology Bachelor of Science (BS),  Computer Engineering 1998  – 2001 Rochester Institute of Technology Bachelor of Science (BS),  Computer Engineering 1998  – 2001 Rochester Institute of Technology Bachelor of Science (BS),  Computer Engineering 1998  – 2001 Rochester Institute of Technology Bachelor of Science (BS),  Computer Engineering 1998  – 2001 ", "Summary Product Management \n“Running the Product Manager Playbook”; Pricing; Product Positioning; Competitive Analysis; Customer and market development; creation of Market Requirement Documents (MRD) and Product Requirement Documents(PRD); feature analysis and trade-offs, and cradle to grave Product Life Cycle management; Win-loss analysis; eco-system creation, development, positioning, and relations; Press and Analyst communication; Sales development and training \n \nNew Venture Development \nNew product ideation, creation, market validation, financial analysis and delivery; Business Plan creation; venture creation, funding, operation, and liquidation; Market research \n \nSoftware Engineering\tDevelopment \nManagement of engineering resources; support and major account technical development; customer support start-up, management, and process improvement; Software Quality Engineering (QA); Program Management; developer hiring/coaching/termination; Agile and CMMI project management \n \nSoftware Product Marketing \nDemo development and deployment at trade-shows; sales collateral, tools and content creation; competitive analysis; benchmark definition, development and deployment; sales force and customer training; analyst and press development and communication Summary Product Management \n“Running the Product Manager Playbook”; Pricing; Product Positioning; Competitive Analysis; Customer and market development; creation of Market Requirement Documents (MRD) and Product Requirement Documents(PRD); feature analysis and trade-offs, and cradle to grave Product Life Cycle management; Win-loss analysis; eco-system creation, development, positioning, and relations; Press and Analyst communication; Sales development and training \n \nNew Venture Development \nNew product ideation, creation, market validation, financial analysis and delivery; Business Plan creation; venture creation, funding, operation, and liquidation; Market research \n \nSoftware Engineering\tDevelopment \nManagement of engineering resources; support and major account technical development; customer support start-up, management, and process improvement; Software Quality Engineering (QA); Program Management; developer hiring/coaching/termination; Agile and CMMI project management \n \nSoftware Product Marketing \nDemo development and deployment at trade-shows; sales collateral, tools and content creation; competitive analysis; benchmark definition, development and deployment; sales force and customer training; analyst and press development and communication Product Management \n“Running the Product Manager Playbook”; Pricing; Product Positioning; Competitive Analysis; Customer and market development; creation of Market Requirement Documents (MRD) and Product Requirement Documents(PRD); feature analysis and trade-offs, and cradle to grave Product Life Cycle management; Win-loss analysis; eco-system creation, development, positioning, and relations; Press and Analyst communication; Sales development and training \n \nNew Venture Development \nNew product ideation, creation, market validation, financial analysis and delivery; Business Plan creation; venture creation, funding, operation, and liquidation; Market research \n \nSoftware Engineering\tDevelopment \nManagement of engineering resources; support and major account technical development; customer support start-up, management, and process improvement; Software Quality Engineering (QA); Program Management; developer hiring/coaching/termination; Agile and CMMI project management \n \nSoftware Product Marketing \nDemo development and deployment at trade-shows; sales collateral, tools and content creation; competitive analysis; benchmark definition, development and deployment; sales force and customer training; analyst and press development and communication Product Management \n“Running the Product Manager Playbook”; Pricing; Product Positioning; Competitive Analysis; Customer and market development; creation of Market Requirement Documents (MRD) and Product Requirement Documents(PRD); feature analysis and trade-offs, and cradle to grave Product Life Cycle management; Win-loss analysis; eco-system creation, development, positioning, and relations; Press and Analyst communication; Sales development and training \n \nNew Venture Development \nNew product ideation, creation, market validation, financial analysis and delivery; Business Plan creation; venture creation, funding, operation, and liquidation; Market research \n \nSoftware Engineering\tDevelopment \nManagement of engineering resources; support and major account technical development; customer support start-up, management, and process improvement; Software Quality Engineering (QA); Program Management; developer hiring/coaching/termination; Agile and CMMI project management \n \nSoftware Product Marketing \nDemo development and deployment at trade-shows; sales collateral, tools and content creation; competitive analysis; benchmark definition, development and deployment; sales force and customer training; analyst and press development and communication Experience Advisory Board Member Qurasense 2015  – Present (less than a year) Palo Alto, California Consulting with founding team to define and bring to market a break-thru life sciences technology. Advising team and external vendors on firmware, software and hardware platform design from edge up thru the Cloud. Also assisting with market development, product structure, and business model in addition to venture funding and development tasks. Advisory Board Member IOTA Computing, Inc. 2014  – Present (1 year) Palo Alto, California Assisting Founder/CEO with product planning, technology analysis, and market development for a pre-tapein semiconductor start-up with a unique low-power secure processor design in the IoT and wearables space. Senior Strategic Planner Intel Corporation - SOC Product Design Group (nee IDGa) 2011  –  2014  (3 years) Santa Clara, California Senior Planner (Product Manager) on the planning team defining and owning software technology and product roadmap for Intel’s SoC (Atom and Quark) for the mobile phone, Internet-of-Things (IOT) and wearable markets. \n \nInitiated, defined, and drove Android and Windows software product requirements for 2014, 2015 and 2016 Atom SoCs for the mobile, tablet, and phone market segments. Created standardized software requirements, refined existing rudimentary processes, and worked across Intel defining system software elements (Android OS, drivers, firmware, middleware, tools) to be released with corresponding silicon. \n \nI also owned and delivered PDG’s ongoing annual software planning process and deliverables for the 1-7 year silicon SOC product stream from Intel’s Software and Services Group (SSG-PLBP). This included software, firmware, and ecosystem development elements needed for both short-term product releases up thru long-term research and proof-of-concept activities.  \n \nFinal Intel project was working with a colleague from SSG to define Intel’s software efforts around the Quark micro-controller in the Wearable, IoT and embedded segments. Worked with internal Intel software, hardware and firmware teams across the company, and external Wind River resources.  \n \nReceived several peer and management nominated awards for 1) internal software/firmware asset database, 2) planning for Broxton SOC software deliverables, and 3) work developing our 2014 SSG business planning exercise. Advisory Board GoldenLeaf 2011  –  September 2011  (less than a year) Member of advisor board providing product, venture assistance, and guidance for a start-up formed by Stanford GSB alumni. Vice President - Customer Support and Quality Audible Magic 2008  –  2010  (2 years) Was responsible for all customer and partner support, and product QA functions. \n \nManaged the Audible Magic Support team providing world-wide support for Audible Magic’s installed base of customers and technology partners. Worked with existing team to transform Support into a productive, efficient group exceeding customer expectations. Managed U.S. team and European contractor. Defined position and trained a Technical Account Manager supporting major Web 2.0 and content owner accounts, created a partner support function and Lab, cross-trained support staff on different product lines. Introduced processes focusing Support (and larger organization) on faster and more accurate problem resolution and avoidance. Managed selection and implementation of new CRM system. \n \nAlso managed Quality Engineering function. Focused newly formed QA team around more repeatable and defined quality processes and automation. Worked with QA team to creatively acquire required resources and automation to create new in-depth product coverage. Greatly expanded test coverage. Worked with other teams and project managers in Engineering to implement new Agile development process. Results have been higher quality, improved processes, and increased customer satisfaction. \n \nExecutive staff – participated with CEO and peers in Board presentations, corporate strategy and implementation plans, budgeting, and performance management. Product Line Manager – Open Source Automotive Infotainment Platform Wind River 2007  –  2008  (1 year) Product Line Manager for, and member of, a cross-company (Intel/BMW/Wind River) consortium creating a new open-source standards based Infotainment and Telematics platform for the automotive market. I created and managed the Wind River portion of product platform definitions, Product Requirement Documents, worked with Services and Engineering to define product schedule and features, Roadmaps, Product structure, initial pricing, positioning and customer collateral. Worked with Alliances, Business Development, Services and the Field to define an eco-system and recruit partners for this new platform. With partners from BMW and Intel defined consortia governance, Roadmaps, technology deliverables, market positioning, and was participant initiating discussions with AUTOSAR. Product Line Manager - Linux for Consumer Devices Wind River 2006  –  2007  (1 year) In this position I am responsible for the success of Wind RIver's Linux Platform targeted at the consumer electronics market segments - primarily mobile handsets/cell-phones, digital video, and infotainment/telematics. This position involves working with all organizational functions (Sales, Finance, Engineering, Manufacturing, and Executive staff) and external groups (customers, analysts, press) to define, build, and market a successful product portfolio based on the Linux and other Open Source components. This position involves the usual tasks such as MRD and PRD creation and maintenance, but also new market research, build vs. buy vs. partner investment decisions, and how to maintain and accelerate business growth via Open and Proprietary technologies. Technical Account Manager - Mobile and Telecom Montavista Software 2004  –  2006  (2 years) I was the “customer advocate” and troubleshooter for two Tier-1 consumer electronics manufacturers and a tier-1 Telcom Equipment Manufacturer. This position involves working directly with the customer’s program, engineering, and management staff, and within MontaVista marshaling and coordinating relevant field teams, engineering projects, and executive resources to insure MontaVista business and customer objectives are met. On an ad hoc basis involved with the management, motivation, and facilitation of the engineering team here in the U.S. and in Russia. Also devoted considerable time working with MontaVista Business Development team enhancing our relationship with semiconductor partners (Intel, Freescale) to deliver solutions to these customers. Engineering Manager - Developer Tools and Languages Montavista Software 2000  –  2004  (4 years) Simultaneously managed several projects responsible for creating and maintaining developer tools. Successfully delivered new and follow-on product releases within time and resource constrained start-up environment. Team ranged from maximum of 18 and on average 12 direct reports (local, remote domestic, and offshore). Product teams managed: \n \nJava - Working with IBM, delivered ‘clean-room’ VM and Websphere IDE. Managed technology relationship with IBM Phoenix, Raleigh and Toronto. \n \n- Compiler Toolchain  \n- Eclipse IDE \n- Windows Host  \n- Graphics Toolkits  \n \nPerformed management tasks including budgeting, scheduling, resource allocation, planning, performance evaluation, coaching, hiring, and termination.  \n \nCustomer Evangelist for Alcatel, Agilent, Texas Instruments and IBM Pervasive Computing. President Monterey Software Group 1987  –  2000  (13 years) Founder of Monterey Software Group. Involved in all aspects of starting, running, and growing a nascent software business that successfully developed and marketed mainframe caliber access control and audit tools for the HP3000 business computer. These included initiating, working and delivering results in the following areas: \n \n- Bootstrapping and Fundraising \n- Product development and support \n- Marketing \n- Sales\t \n- Business planning \n- Legal issues \n- Business operations \n- Personnel management \n \nMonterey Software customers included: Exxon Company USA, Exxon Chemicals, Exxon Chemical Americas, Exxon Energy, MassMutual Life Insurance, U.S. Department of Defense, U.S. Merit Systems Protection Board, Royal Saudi Air Force, Blue Cross-Blue Shield, University of Notre Dame, Mercantile Mutual Insurance (Australia), and Riverside County Flood Control District among others. VP - Engineering Durango Software 1999  –  1999  (less than a year) Durango Software was engaged with IBM-Tivoli to acquire several software products and assets. Participated in discussions with IBM-Tivoli around the acquisition and future development of the technology, worked with founders on creating, building and growing the Engineering and Support Organization, and performed due diligence on the technology. Technology Consultant RSA Security 1999  –  1999  (less than a year) Consulting engagement at RSA Security where I ported, QA’d, productized, and documented the BSAFE Encryption Engine and SSL-C software suite for the HP3000 POSIX environment. Product Manager Hewlett-Packard 1985  –  1987  (2 years) Worked closely with R&D organization, field teams, other HP entities, and major accounts to insure a successful implementation, introduction, and release of \nthe MPE/iX OS on a new family of 32-bit PA-RISC computer systems. Position was focal point for internal (development, functionality, introduction) and external (customer, field, shipment) issues. Member Technical Staff Hewlett-Packard Company - Computer Systems Division 1982  –  1985  (3 years) Member of team porting the MPE Operating System from 16-bit to 32-bit hardware architecture. Responsible for the design and implementation of OS bootstrap code. Position required that I interface to different teams including OS kernel, CPU hardware, memory, networking and peripheral groups. Member Technical Staff Hewlett-Packard - Data Systems Division 1979  –  1982  (3 years) Responsible for RTE-6 Operating System generator (RT6GN) and SWTCH RTE OS installation utility. Also wrote and maintained several system utility tools. Programmer APL Data Systems 1979  –  1979  (less than a year) Part-time position designing and developing a APL\\Plus file system emulator for a PC based APL. This allowed mainframe program to be easily and quickly ported from the mainframe to PC environment with minimal source code changes. Advisory Board Member Qurasense 2015  – Present (less than a year) Palo Alto, California Consulting with founding team to define and bring to market a break-thru life sciences technology. Advising team and external vendors on firmware, software and hardware platform design from edge up thru the Cloud. Also assisting with market development, product structure, and business model in addition to venture funding and development tasks. Advisory Board Member Qurasense 2015  – Present (less than a year) Palo Alto, California Consulting with founding team to define and bring to market a break-thru life sciences technology. Advising team and external vendors on firmware, software and hardware platform design from edge up thru the Cloud. Also assisting with market development, product structure, and business model in addition to venture funding and development tasks. Advisory Board Member IOTA Computing, Inc. 2014  – Present (1 year) Palo Alto, California Assisting Founder/CEO with product planning, technology analysis, and market development for a pre-tapein semiconductor start-up with a unique low-power secure processor design in the IoT and wearables space. Advisory Board Member IOTA Computing, Inc. 2014  – Present (1 year) Palo Alto, California Assisting Founder/CEO with product planning, technology analysis, and market development for a pre-tapein semiconductor start-up with a unique low-power secure processor design in the IoT and wearables space. Senior Strategic Planner Intel Corporation - SOC Product Design Group (nee IDGa) 2011  –  2014  (3 years) Santa Clara, California Senior Planner (Product Manager) on the planning team defining and owning software technology and product roadmap for Intel’s SoC (Atom and Quark) for the mobile phone, Internet-of-Things (IOT) and wearable markets. \n \nInitiated, defined, and drove Android and Windows software product requirements for 2014, 2015 and 2016 Atom SoCs for the mobile, tablet, and phone market segments. Created standardized software requirements, refined existing rudimentary processes, and worked across Intel defining system software elements (Android OS, drivers, firmware, middleware, tools) to be released with corresponding silicon. \n \nI also owned and delivered PDG’s ongoing annual software planning process and deliverables for the 1-7 year silicon SOC product stream from Intel’s Software and Services Group (SSG-PLBP). This included software, firmware, and ecosystem development elements needed for both short-term product releases up thru long-term research and proof-of-concept activities.  \n \nFinal Intel project was working with a colleague from SSG to define Intel’s software efforts around the Quark micro-controller in the Wearable, IoT and embedded segments. Worked with internal Intel software, hardware and firmware teams across the company, and external Wind River resources.  \n \nReceived several peer and management nominated awards for 1) internal software/firmware asset database, 2) planning for Broxton SOC software deliverables, and 3) work developing our 2014 SSG business planning exercise. Senior Strategic Planner Intel Corporation - SOC Product Design Group (nee IDGa) 2011  –  2014  (3 years) Santa Clara, California Senior Planner (Product Manager) on the planning team defining and owning software technology and product roadmap for Intel’s SoC (Atom and Quark) for the mobile phone, Internet-of-Things (IOT) and wearable markets. \n \nInitiated, defined, and drove Android and Windows software product requirements for 2014, 2015 and 2016 Atom SoCs for the mobile, tablet, and phone market segments. Created standardized software requirements, refined existing rudimentary processes, and worked across Intel defining system software elements (Android OS, drivers, firmware, middleware, tools) to be released with corresponding silicon. \n \nI also owned and delivered PDG’s ongoing annual software planning process and deliverables for the 1-7 year silicon SOC product stream from Intel’s Software and Services Group (SSG-PLBP). This included software, firmware, and ecosystem development elements needed for both short-term product releases up thru long-term research and proof-of-concept activities.  \n \nFinal Intel project was working with a colleague from SSG to define Intel’s software efforts around the Quark micro-controller in the Wearable, IoT and embedded segments. Worked with internal Intel software, hardware and firmware teams across the company, and external Wind River resources.  \n \nReceived several peer and management nominated awards for 1) internal software/firmware asset database, 2) planning for Broxton SOC software deliverables, and 3) work developing our 2014 SSG business planning exercise. Advisory Board GoldenLeaf 2011  –  September 2011  (less than a year) Member of advisor board providing product, venture assistance, and guidance for a start-up formed by Stanford GSB alumni. Advisory Board GoldenLeaf 2011  –  September 2011  (less than a year) Member of advisor board providing product, venture assistance, and guidance for a start-up formed by Stanford GSB alumni. Vice President - Customer Support and Quality Audible Magic 2008  –  2010  (2 years) Was responsible for all customer and partner support, and product QA functions. \n \nManaged the Audible Magic Support team providing world-wide support for Audible Magic’s installed base of customers and technology partners. Worked with existing team to transform Support into a productive, efficient group exceeding customer expectations. Managed U.S. team and European contractor. Defined position and trained a Technical Account Manager supporting major Web 2.0 and content owner accounts, created a partner support function and Lab, cross-trained support staff on different product lines. Introduced processes focusing Support (and larger organization) on faster and more accurate problem resolution and avoidance. Managed selection and implementation of new CRM system. \n \nAlso managed Quality Engineering function. Focused newly formed QA team around more repeatable and defined quality processes and automation. Worked with QA team to creatively acquire required resources and automation to create new in-depth product coverage. Greatly expanded test coverage. Worked with other teams and project managers in Engineering to implement new Agile development process. Results have been higher quality, improved processes, and increased customer satisfaction. \n \nExecutive staff – participated with CEO and peers in Board presentations, corporate strategy and implementation plans, budgeting, and performance management. Vice President - Customer Support and Quality Audible Magic 2008  –  2010  (2 years) Was responsible for all customer and partner support, and product QA functions. \n \nManaged the Audible Magic Support team providing world-wide support for Audible Magic’s installed base of customers and technology partners. Worked with existing team to transform Support into a productive, efficient group exceeding customer expectations. Managed U.S. team and European contractor. Defined position and trained a Technical Account Manager supporting major Web 2.0 and content owner accounts, created a partner support function and Lab, cross-trained support staff on different product lines. Introduced processes focusing Support (and larger organization) on faster and more accurate problem resolution and avoidance. Managed selection and implementation of new CRM system. \n \nAlso managed Quality Engineering function. Focused newly formed QA team around more repeatable and defined quality processes and automation. Worked with QA team to creatively acquire required resources and automation to create new in-depth product coverage. Greatly expanded test coverage. Worked with other teams and project managers in Engineering to implement new Agile development process. Results have been higher quality, improved processes, and increased customer satisfaction. \n \nExecutive staff – participated with CEO and peers in Board presentations, corporate strategy and implementation plans, budgeting, and performance management. Product Line Manager – Open Source Automotive Infotainment Platform Wind River 2007  –  2008  (1 year) Product Line Manager for, and member of, a cross-company (Intel/BMW/Wind River) consortium creating a new open-source standards based Infotainment and Telematics platform for the automotive market. I created and managed the Wind River portion of product platform definitions, Product Requirement Documents, worked with Services and Engineering to define product schedule and features, Roadmaps, Product structure, initial pricing, positioning and customer collateral. Worked with Alliances, Business Development, Services and the Field to define an eco-system and recruit partners for this new platform. With partners from BMW and Intel defined consortia governance, Roadmaps, technology deliverables, market positioning, and was participant initiating discussions with AUTOSAR. Product Line Manager – Open Source Automotive Infotainment Platform Wind River 2007  –  2008  (1 year) Product Line Manager for, and member of, a cross-company (Intel/BMW/Wind River) consortium creating a new open-source standards based Infotainment and Telematics platform for the automotive market. I created and managed the Wind River portion of product platform definitions, Product Requirement Documents, worked with Services and Engineering to define product schedule and features, Roadmaps, Product structure, initial pricing, positioning and customer collateral. Worked with Alliances, Business Development, Services and the Field to define an eco-system and recruit partners for this new platform. With partners from BMW and Intel defined consortia governance, Roadmaps, technology deliverables, market positioning, and was participant initiating discussions with AUTOSAR. Product Line Manager - Linux for Consumer Devices Wind River 2006  –  2007  (1 year) In this position I am responsible for the success of Wind RIver's Linux Platform targeted at the consumer electronics market segments - primarily mobile handsets/cell-phones, digital video, and infotainment/telematics. This position involves working with all organizational functions (Sales, Finance, Engineering, Manufacturing, and Executive staff) and external groups (customers, analysts, press) to define, build, and market a successful product portfolio based on the Linux and other Open Source components. This position involves the usual tasks such as MRD and PRD creation and maintenance, but also new market research, build vs. buy vs. partner investment decisions, and how to maintain and accelerate business growth via Open and Proprietary technologies. Product Line Manager - Linux for Consumer Devices Wind River 2006  –  2007  (1 year) In this position I am responsible for the success of Wind RIver's Linux Platform targeted at the consumer electronics market segments - primarily mobile handsets/cell-phones, digital video, and infotainment/telematics. This position involves working with all organizational functions (Sales, Finance, Engineering, Manufacturing, and Executive staff) and external groups (customers, analysts, press) to define, build, and market a successful product portfolio based on the Linux and other Open Source components. This position involves the usual tasks such as MRD and PRD creation and maintenance, but also new market research, build vs. buy vs. partner investment decisions, and how to maintain and accelerate business growth via Open and Proprietary technologies. Technical Account Manager - Mobile and Telecom Montavista Software 2004  –  2006  (2 years) I was the “customer advocate” and troubleshooter for two Tier-1 consumer electronics manufacturers and a tier-1 Telcom Equipment Manufacturer. This position involves working directly with the customer’s program, engineering, and management staff, and within MontaVista marshaling and coordinating relevant field teams, engineering projects, and executive resources to insure MontaVista business and customer objectives are met. On an ad hoc basis involved with the management, motivation, and facilitation of the engineering team here in the U.S. and in Russia. Also devoted considerable time working with MontaVista Business Development team enhancing our relationship with semiconductor partners (Intel, Freescale) to deliver solutions to these customers. Technical Account Manager - Mobile and Telecom Montavista Software 2004  –  2006  (2 years) I was the “customer advocate” and troubleshooter for two Tier-1 consumer electronics manufacturers and a tier-1 Telcom Equipment Manufacturer. This position involves working directly with the customer’s program, engineering, and management staff, and within MontaVista marshaling and coordinating relevant field teams, engineering projects, and executive resources to insure MontaVista business and customer objectives are met. On an ad hoc basis involved with the management, motivation, and facilitation of the engineering team here in the U.S. and in Russia. Also devoted considerable time working with MontaVista Business Development team enhancing our relationship with semiconductor partners (Intel, Freescale) to deliver solutions to these customers. Engineering Manager - Developer Tools and Languages Montavista Software 2000  –  2004  (4 years) Simultaneously managed several projects responsible for creating and maintaining developer tools. Successfully delivered new and follow-on product releases within time and resource constrained start-up environment. Team ranged from maximum of 18 and on average 12 direct reports (local, remote domestic, and offshore). Product teams managed: \n \nJava - Working with IBM, delivered ‘clean-room’ VM and Websphere IDE. Managed technology relationship with IBM Phoenix, Raleigh and Toronto. \n \n- Compiler Toolchain  \n- Eclipse IDE \n- Windows Host  \n- Graphics Toolkits  \n \nPerformed management tasks including budgeting, scheduling, resource allocation, planning, performance evaluation, coaching, hiring, and termination.  \n \nCustomer Evangelist for Alcatel, Agilent, Texas Instruments and IBM Pervasive Computing. Engineering Manager - Developer Tools and Languages Montavista Software 2000  –  2004  (4 years) Simultaneously managed several projects responsible for creating and maintaining developer tools. Successfully delivered new and follow-on product releases within time and resource constrained start-up environment. Team ranged from maximum of 18 and on average 12 direct reports (local, remote domestic, and offshore). Product teams managed: \n \nJava - Working with IBM, delivered ‘clean-room’ VM and Websphere IDE. Managed technology relationship with IBM Phoenix, Raleigh and Toronto. \n \n- Compiler Toolchain  \n- Eclipse IDE \n- Windows Host  \n- Graphics Toolkits  \n \nPerformed management tasks including budgeting, scheduling, resource allocation, planning, performance evaluation, coaching, hiring, and termination.  \n \nCustomer Evangelist for Alcatel, Agilent, Texas Instruments and IBM Pervasive Computing. President Monterey Software Group 1987  –  2000  (13 years) Founder of Monterey Software Group. Involved in all aspects of starting, running, and growing a nascent software business that successfully developed and marketed mainframe caliber access control and audit tools for the HP3000 business computer. These included initiating, working and delivering results in the following areas: \n \n- Bootstrapping and Fundraising \n- Product development and support \n- Marketing \n- Sales\t \n- Business planning \n- Legal issues \n- Business operations \n- Personnel management \n \nMonterey Software customers included: Exxon Company USA, Exxon Chemicals, Exxon Chemical Americas, Exxon Energy, MassMutual Life Insurance, U.S. Department of Defense, U.S. Merit Systems Protection Board, Royal Saudi Air Force, Blue Cross-Blue Shield, University of Notre Dame, Mercantile Mutual Insurance (Australia), and Riverside County Flood Control District among others. President Monterey Software Group 1987  –  2000  (13 years) Founder of Monterey Software Group. Involved in all aspects of starting, running, and growing a nascent software business that successfully developed and marketed mainframe caliber access control and audit tools for the HP3000 business computer. These included initiating, working and delivering results in the following areas: \n \n- Bootstrapping and Fundraising \n- Product development and support \n- Marketing \n- Sales\t \n- Business planning \n- Legal issues \n- Business operations \n- Personnel management \n \nMonterey Software customers included: Exxon Company USA, Exxon Chemicals, Exxon Chemical Americas, Exxon Energy, MassMutual Life Insurance, U.S. Department of Defense, U.S. Merit Systems Protection Board, Royal Saudi Air Force, Blue Cross-Blue Shield, University of Notre Dame, Mercantile Mutual Insurance (Australia), and Riverside County Flood Control District among others. VP - Engineering Durango Software 1999  –  1999  (less than a year) Durango Software was engaged with IBM-Tivoli to acquire several software products and assets. Participated in discussions with IBM-Tivoli around the acquisition and future development of the technology, worked with founders on creating, building and growing the Engineering and Support Organization, and performed due diligence on the technology. VP - Engineering Durango Software 1999  –  1999  (less than a year) Durango Software was engaged with IBM-Tivoli to acquire several software products and assets. Participated in discussions with IBM-Tivoli around the acquisition and future development of the technology, worked with founders on creating, building and growing the Engineering and Support Organization, and performed due diligence on the technology. Technology Consultant RSA Security 1999  –  1999  (less than a year) Consulting engagement at RSA Security where I ported, QA’d, productized, and documented the BSAFE Encryption Engine and SSL-C software suite for the HP3000 POSIX environment. Technology Consultant RSA Security 1999  –  1999  (less than a year) Consulting engagement at RSA Security where I ported, QA’d, productized, and documented the BSAFE Encryption Engine and SSL-C software suite for the HP3000 POSIX environment. Product Manager Hewlett-Packard 1985  –  1987  (2 years) Worked closely with R&D organization, field teams, other HP entities, and major accounts to insure a successful implementation, introduction, and release of \nthe MPE/iX OS on a new family of 32-bit PA-RISC computer systems. Position was focal point for internal (development, functionality, introduction) and external (customer, field, shipment) issues. Product Manager Hewlett-Packard 1985  –  1987  (2 years) Worked closely with R&D organization, field teams, other HP entities, and major accounts to insure a successful implementation, introduction, and release of \nthe MPE/iX OS on a new family of 32-bit PA-RISC computer systems. Position was focal point for internal (development, functionality, introduction) and external (customer, field, shipment) issues. Member Technical Staff Hewlett-Packard Company - Computer Systems Division 1982  –  1985  (3 years) Member of team porting the MPE Operating System from 16-bit to 32-bit hardware architecture. Responsible for the design and implementation of OS bootstrap code. Position required that I interface to different teams including OS kernel, CPU hardware, memory, networking and peripheral groups. Member Technical Staff Hewlett-Packard Company - Computer Systems Division 1982  –  1985  (3 years) Member of team porting the MPE Operating System from 16-bit to 32-bit hardware architecture. Responsible for the design and implementation of OS bootstrap code. Position required that I interface to different teams including OS kernel, CPU hardware, memory, networking and peripheral groups. Member Technical Staff Hewlett-Packard - Data Systems Division 1979  –  1982  (3 years) Responsible for RTE-6 Operating System generator (RT6GN) and SWTCH RTE OS installation utility. Also wrote and maintained several system utility tools. Member Technical Staff Hewlett-Packard - Data Systems Division 1979  –  1982  (3 years) Responsible for RTE-6 Operating System generator (RT6GN) and SWTCH RTE OS installation utility. Also wrote and maintained several system utility tools. Programmer APL Data Systems 1979  –  1979  (less than a year) Part-time position designing and developing a APL\\Plus file system emulator for a PC based APL. This allowed mainframe program to be easily and quickly ported from the mainframe to PC environment with minimal source code changes. Programmer APL Data Systems 1979  –  1979  (less than a year) Part-time position designing and developing a APL\\Plus file system emulator for a PC based APL. This allowed mainframe program to be easily and quickly ported from the mainframe to PC environment with minimal source code changes. Languages English English English Skills Software Development Product Management Software Engineering Start-ups Mobile Devices Embedded Systems Linux Strategic Planning Program Management Strategy Business Development Product Development Android Operating Systems CRM Java Open Source Entrepreneurship C System Architecture Software Design New Venture Development Management Leadership Strategic Partnerships Internet of Things IOT Wearable Computing APL Intel Unix Product Marketing See 17+     See less Skills  Software Development Product Management Software Engineering Start-ups Mobile Devices Embedded Systems Linux Strategic Planning Program Management Strategy Business Development Product Development Android Operating Systems CRM Java Open Source Entrepreneurship C System Architecture Software Design New Venture Development Management Leadership Strategic Partnerships Internet of Things IOT Wearable Computing APL Intel Unix Product Marketing See 17+     See less Software Development Product Management Software Engineering Start-ups Mobile Devices Embedded Systems Linux Strategic Planning Program Management Strategy Business Development Product Development Android Operating Systems CRM Java Open Source Entrepreneurship C System Architecture Software Design New Venture Development Management Leadership Strategic Partnerships Internet of Things IOT Wearable Computing APL Intel Unix Product Marketing See 17+     See less Software Development Product Management Software Engineering Start-ups Mobile Devices Embedded Systems Linux Strategic Planning Program Management Strategy Business Development Product Development Android Operating Systems CRM Java Open Source Entrepreneurship C System Architecture Software Design New Venture Development Management Leadership Strategic Partnerships Internet of Things IOT Wearable Computing APL Intel Unix Product Marketing See 17+     See less Education The University of Texas at Arlington BS 1976  – 1979 University of Maryland Overseas Program - Berlin Germany 1975  – 1975 Continuing Education The University of Texas at Arlington BS 1976  – 1979 The University of Texas at Arlington BS 1976  – 1979 The University of Texas at Arlington BS 1976  – 1979 University of Maryland Overseas Program - Berlin Germany 1975  – 1975 University of Maryland Overseas Program - Berlin Germany 1975  – 1975 University of Maryland Overseas Program - Berlin Germany 1975  – 1975 Continuing Education Continuing Education Continuing Education Honors & Awards Upsilon Pi Epsilon Honor Society http://upe.acm.org/ Additional Honors & Awards Intel Achievement Award for driving the software planning and product definition at the OS and below level for future mobile SoC. Specifically cited for collaboration across organizational boundaries, attention to detail and effective team-work. Upsilon Pi Epsilon Honor Society http://upe.acm.org/ Upsilon Pi Epsilon Honor Society http://upe.acm.org/ Upsilon Pi Epsilon Honor Society http://upe.acm.org/ Additional Honors & Awards Intel Achievement Award for driving the software planning and product definition at the OS and below level for future mobile SoC. Specifically cited for collaboration across organizational boundaries, attention to detail and effective team-work. Additional Honors & Awards Intel Achievement Award for driving the software planning and product definition at the OS and below level for future mobile SoC. Specifically cited for collaboration across organizational boundaries, attention to detail and effective team-work. Additional Honors & Awards Intel Achievement Award for driving the software planning and product definition at the OS and below level for future mobile SoC. Specifically cited for collaboration across organizational boundaries, attention to detail and effective team-work. "]}