{"position": "Senior Technical Engineer", "company": "Intel Corporation", "profiles": ["Summary Leading a company of software engineering and product marketing talent focused on product definition and development for a variety of high tech client companies. Over 20 years of consumer software management and development experience.  \n \nThroughout my career I have a proven track record for developing innovative mobile, web and retail products that are consistently completed on time and within budget. I have experience managing distributed development teams and multiple simultaneous software projects and business relationships. \n \nOur technology experience includes products for customers using Sencha ExtJS/Touch utilizing HTML and Javascript, iPhone and iPad applications, Android mobile applications, Adobe Flex/Flash and Air, Native desktop applications for Windows and Mac platforms, server side Java applications and PHP/Javascript web applications. \n \nSpecialties: Mobile, web and desktop software. Engineering management, accounting and budgeting, business development, customer relations.  \n \n \nTechnologies: Sencha ExtJS and Touch, iOS for iPad and iPhones, Android Mobile, HTML5, Javascript, JQuery and JQuery Touch, Flex, Flash and ActionScript 3, Java, PHP, Google App Engine, Windows software, Mac software, C/C++, Objective C, Win32, ATL/WTL, MFC, COM, XPCOM. Summary Leading a company of software engineering and product marketing talent focused on product definition and development for a variety of high tech client companies. Over 20 years of consumer software management and development experience.  \n \nThroughout my career I have a proven track record for developing innovative mobile, web and retail products that are consistently completed on time and within budget. I have experience managing distributed development teams and multiple simultaneous software projects and business relationships. \n \nOur technology experience includes products for customers using Sencha ExtJS/Touch utilizing HTML and Javascript, iPhone and iPad applications, Android mobile applications, Adobe Flex/Flash and Air, Native desktop applications for Windows and Mac platforms, server side Java applications and PHP/Javascript web applications. \n \nSpecialties: Mobile, web and desktop software. Engineering management, accounting and budgeting, business development, customer relations.  \n \n \nTechnologies: Sencha ExtJS and Touch, iOS for iPad and iPhones, Android Mobile, HTML5, Javascript, JQuery and JQuery Touch, Flex, Flash and ActionScript 3, Java, PHP, Google App Engine, Windows software, Mac software, C/C++, Objective C, Win32, ATL/WTL, MFC, COM, XPCOM. Leading a company of software engineering and product marketing talent focused on product definition and development for a variety of high tech client companies. Over 20 years of consumer software management and development experience.  \n \nThroughout my career I have a proven track record for developing innovative mobile, web and retail products that are consistently completed on time and within budget. I have experience managing distributed development teams and multiple simultaneous software projects and business relationships. \n \nOur technology experience includes products for customers using Sencha ExtJS/Touch utilizing HTML and Javascript, iPhone and iPad applications, Android mobile applications, Adobe Flex/Flash and Air, Native desktop applications for Windows and Mac platforms, server side Java applications and PHP/Javascript web applications. \n \nSpecialties: Mobile, web and desktop software. Engineering management, accounting and budgeting, business development, customer relations.  \n \n \nTechnologies: Sencha ExtJS and Touch, iOS for iPad and iPhones, Android Mobile, HTML5, Javascript, JQuery and JQuery Touch, Flex, Flash and ActionScript 3, Java, PHP, Google App Engine, Windows software, Mac software, C/C++, Objective C, Win32, ATL/WTL, MFC, COM, XPCOM. Leading a company of software engineering and product marketing talent focused on product definition and development for a variety of high tech client companies. Over 20 years of consumer software management and development experience.  \n \nThroughout my career I have a proven track record for developing innovative mobile, web and retail products that are consistently completed on time and within budget. I have experience managing distributed development teams and multiple simultaneous software projects and business relationships. \n \nOur technology experience includes products for customers using Sencha ExtJS/Touch utilizing HTML and Javascript, iPhone and iPad applications, Android mobile applications, Adobe Flex/Flash and Air, Native desktop applications for Windows and Mac platforms, server side Java applications and PHP/Javascript web applications. \n \nSpecialties: Mobile, web and desktop software. Engineering management, accounting and budgeting, business development, customer relations.  \n \n \nTechnologies: Sencha ExtJS and Touch, iOS for iPad and iPhones, Android Mobile, HTML5, Javascript, JQuery and JQuery Touch, Flex, Flash and ActionScript 3, Java, PHP, Google App Engine, Windows software, Mac software, C/C++, Objective C, Win32, ATL/WTL, MFC, COM, XPCOM. Experience Founder and CEO Phase 2 Industries, LLC. February 2007  – Present (8 years 7 months) Santa Clara, CA Software technology and consulting company focused on mobile, internet and desktop software for top tier software companies on a referral basis. We have designed products for clients that range from iOS and Android mobile applications to scalable server side solutions written in Java and PHP. \n \nResponsible for overall direction of the company. Focused on business relationships, managing product development, acquiring engineering talent, and hands on development for internal and customer projects. \n \nExperience developing and managing products for companies that range from small early stage startups to Fortune 500 corporations. Software Engineering Manager/Lead FilmLoop Inc July 2005  –  February 2007  (1 year 8 months) Palo Alto, CA Lead a team of software talent creating a desktop application for both Windows and the Mac to upload and share photos. The application made use of internet transfer protocols to synchronize photo albums between client applications. My team also created a Flash based plugin for web based viewing of shared albums in a slideshow format. Software Engineering Manager Sonic Solutions September 2002  –  June 2005  (2 years 10 months) Managing a team software engineers responsible for multiple retail applications. Work closely with product marketing and product design to define features and schedules for new versions of retail applications. Work with external companies on technology integration. Lead the design and implementation of software features along with mentoring engineers working on the products. Principal Engineer Liquid Audio Inc March 1999  –  September 2002  (3 years 7 months) Team lead and architect for Liquid Audio's Player software (music jukebox software). Worked closely with Product Marketing to define features and product requirements. Designed and implemented software (2 major releases). Managed team development resources. Senior Technical Engineer Intel Corporation November 1997  –  March 1999  (1 year 5 months) Senior Technical Engineer responsible for performance measurement software for software engineering and technology evangelism to external companies. This included creation of software applications that highlighted performance of Intel architectures. Software Engineer Timberline Software October 1995  –  November 1997  (2 years 2 months) Software Engineer on a team writing Property Management software. Responsible for several main features of the application as well as writing core components that were reused by other team members and external groups. Product was successfully released on time. Software Consultant Compuware Corporation September 1994  –  October 1995  (1 year 2 months) Software Engineering consultant working on an infection control system at Henry Ford Hospital in Detroit, MI. Lead Team designing and implementing PC application interfacting with Ingres database residing on Unix system. Founder and CEO Phase 2 Industries, LLC. February 2007  – Present (8 years 7 months) Santa Clara, CA Software technology and consulting company focused on mobile, internet and desktop software for top tier software companies on a referral basis. We have designed products for clients that range from iOS and Android mobile applications to scalable server side solutions written in Java and PHP. \n \nResponsible for overall direction of the company. Focused on business relationships, managing product development, acquiring engineering talent, and hands on development for internal and customer projects. \n \nExperience developing and managing products for companies that range from small early stage startups to Fortune 500 corporations. Founder and CEO Phase 2 Industries, LLC. February 2007  – Present (8 years 7 months) Santa Clara, CA Software technology and consulting company focused on mobile, internet and desktop software for top tier software companies on a referral basis. We have designed products for clients that range from iOS and Android mobile applications to scalable server side solutions written in Java and PHP. \n \nResponsible for overall direction of the company. Focused on business relationships, managing product development, acquiring engineering talent, and hands on development for internal and customer projects. \n \nExperience developing and managing products for companies that range from small early stage startups to Fortune 500 corporations. Software Engineering Manager/Lead FilmLoop Inc July 2005  –  February 2007  (1 year 8 months) Palo Alto, CA Lead a team of software talent creating a desktop application for both Windows and the Mac to upload and share photos. The application made use of internet transfer protocols to synchronize photo albums between client applications. My team also created a Flash based plugin for web based viewing of shared albums in a slideshow format. Software Engineering Manager/Lead FilmLoop Inc July 2005  –  February 2007  (1 year 8 months) Palo Alto, CA Lead a team of software talent creating a desktop application for both Windows and the Mac to upload and share photos. The application made use of internet transfer protocols to synchronize photo albums between client applications. My team also created a Flash based plugin for web based viewing of shared albums in a slideshow format. Software Engineering Manager Sonic Solutions September 2002  –  June 2005  (2 years 10 months) Managing a team software engineers responsible for multiple retail applications. Work closely with product marketing and product design to define features and schedules for new versions of retail applications. Work with external companies on technology integration. Lead the design and implementation of software features along with mentoring engineers working on the products. Software Engineering Manager Sonic Solutions September 2002  –  June 2005  (2 years 10 months) Managing a team software engineers responsible for multiple retail applications. Work closely with product marketing and product design to define features and schedules for new versions of retail applications. Work with external companies on technology integration. Lead the design and implementation of software features along with mentoring engineers working on the products. Principal Engineer Liquid Audio Inc March 1999  –  September 2002  (3 years 7 months) Team lead and architect for Liquid Audio's Player software (music jukebox software). Worked closely with Product Marketing to define features and product requirements. Designed and implemented software (2 major releases). Managed team development resources. Principal Engineer Liquid Audio Inc March 1999  –  September 2002  (3 years 7 months) Team lead and architect for Liquid Audio's Player software (music jukebox software). Worked closely with Product Marketing to define features and product requirements. Designed and implemented software (2 major releases). Managed team development resources. Senior Technical Engineer Intel Corporation November 1997  –  March 1999  (1 year 5 months) Senior Technical Engineer responsible for performance measurement software for software engineering and technology evangelism to external companies. This included creation of software applications that highlighted performance of Intel architectures. Senior Technical Engineer Intel Corporation November 1997  –  March 1999  (1 year 5 months) Senior Technical Engineer responsible for performance measurement software for software engineering and technology evangelism to external companies. This included creation of software applications that highlighted performance of Intel architectures. Software Engineer Timberline Software October 1995  –  November 1997  (2 years 2 months) Software Engineer on a team writing Property Management software. Responsible for several main features of the application as well as writing core components that were reused by other team members and external groups. Product was successfully released on time. Software Engineer Timberline Software October 1995  –  November 1997  (2 years 2 months) Software Engineer on a team writing Property Management software. Responsible for several main features of the application as well as writing core components that were reused by other team members and external groups. Product was successfully released on time. Software Consultant Compuware Corporation September 1994  –  October 1995  (1 year 2 months) Software Engineering consultant working on an infection control system at Henry Ford Hospital in Detroit, MI. Lead Team designing and implementing PC application interfacting with Ingres database residing on Unix system. Software Consultant Compuware Corporation September 1994  –  October 1995  (1 year 2 months) Software Engineering consultant working on an infection control system at Henry Ford Hospital in Detroit, MI. Lead Team designing and implementing PC application interfacting with Ingres database residing on Unix system. Languages English Native or bilingual proficiency English Native or bilingual proficiency English Native or bilingual proficiency Native or bilingual proficiency Skills Engineering Management Software Engineering Corporate Management JavaScript Java Objective-C HTML 5 Mobile Devices PHP Google App Engine Windows Win32 API MFC Flex Business Development User Experience Android Management Ruby iOS HTML Unix Start-ups MySQL Python Web Applications jQuery Databases Mobile Applications Integration Architectures User Interface See 17+     See less Skills  Engineering Management Software Engineering Corporate Management JavaScript Java Objective-C HTML 5 Mobile Devices PHP Google App Engine Windows Win32 API MFC Flex Business Development User Experience Android Management Ruby iOS HTML Unix Start-ups MySQL Python Web Applications jQuery Databases Mobile Applications Integration Architectures User Interface See 17+     See less Engineering Management Software Engineering Corporate Management JavaScript Java Objective-C HTML 5 Mobile Devices PHP Google App Engine Windows Win32 API MFC Flex Business Development User Experience Android Management Ruby iOS HTML Unix Start-ups MySQL Python Web Applications jQuery Databases Mobile Applications Integration Architectures User Interface See 17+     See less Engineering Management Software Engineering Corporate Management JavaScript Java Objective-C HTML 5 Mobile Devices PHP Google App Engine Windows Win32 API MFC Flex Business Development User Experience Android Management Ruby iOS HTML Unix Start-ups MySQL Python Web Applications jQuery Databases Mobile Applications Integration Architectures User Interface See 17+     See less Education Michigan State University MS,  Computer Science September 1992  – August 1994 Hope College BS,  Computer Science 1988  – 1992 Michigan State University MS,  Computer Science September 1992  – August 1994 Michigan State University MS,  Computer Science September 1992  – August 1994 Michigan State University MS,  Computer Science September 1992  – August 1994 Hope College BS,  Computer Science 1988  – 1992 Hope College BS,  Computer Science 1988  – 1992 Hope College BS,  Computer Science 1988  – 1992 ", "Summary Hardware Experience: \nServers – HP C-Class Chassis with BL Blades and ProLiant DL, Dell PowerEdge and Cisco UCS \n \nIP Networking – L2 & L3 routing and switching using Cisco iOS, Dell PowerConnect, HP BladeOS and Network Connect/Flex Fabric, Extreme XOS and Juniper JunOS \n \nA good understanding of networking technologies such as LAN, WAN, Enterprise Wireless, VOIP, MPLS, BGP, QoS, VLANs, LACP, Spanning Tree, OSPF, Leaf/Spine and Core/Edge topologies, DMZ, VPN, SIP Trunking and load Balancing. \n \nFirewalls – Juniper SSG and SRX, Cisco ASA \n \nFibre Channel – Experience with zoning and maintaining Brocade, McDATA and Cisco MDS switches \n \nStorage – Block based SAN administration using Fibre Channel and iSCSI with HP MSA, HP EVA, HP 3AR and EMC Clariion based arrays \n \nVirtualisation Experience: \nHighly experienced supporting VSphere High Availability DRS enabled clusters spanning large server estates  \nVMware ESX 4.0 to ESXi 5.5 using VSphere from 4.0 to 5.5 Enterprise and Enterprise Plus \nVMware Converter, PlateSpin \nVeeam Backup and Replication \nvRanger Backup and Replication \nHP OneView \nNFS file, iSCSI and FC block with VMFS and RDM based storage \n \nMicrosoft Windows Technologies: \nWindows Server administration from 2000 – 2012 R2 \nActive Directory design including DNS, DHCP, Group Policy, NPS, WSUS, WDS, RADUIS, Certificate Management \nMicrosoft Exchange 2003 – 2010, IIS, SQL Server 2000 – 2012  \nMicrosoft Failover Clustering, File Servers, Print Servers \nSystem Centre Configuration Manager – SCCM, System Centre Operations Manager - SCOM \nMicrosoft Lync 2010 – 2013 with Enterprise Voice, ISA 2006 - Forefront 2010 Proxy \nPowerShell, VBScript, Microsoft Azure Infrastructure as a Service (IaaS) \n \nOther technology exposure and legacy skills: \nSymantec NetBackup, HP Tape Libraries \nMicrosoft Office 2000 – 2013 including Office 365 and Visio 2010-2013 \nSymantec.cloud (Messagelabs) \nSophos Enterprise \nNortel/Avaya  \nNovell Netware and GroupWise and Zen Works legacy experience. Summary Hardware Experience: \nServers – HP C-Class Chassis with BL Blades and ProLiant DL, Dell PowerEdge and Cisco UCS \n \nIP Networking – L2 & L3 routing and switching using Cisco iOS, Dell PowerConnect, HP BladeOS and Network Connect/Flex Fabric, Extreme XOS and Juniper JunOS \n \nA good understanding of networking technologies such as LAN, WAN, Enterprise Wireless, VOIP, MPLS, BGP, QoS, VLANs, LACP, Spanning Tree, OSPF, Leaf/Spine and Core/Edge topologies, DMZ, VPN, SIP Trunking and load Balancing. \n \nFirewalls – Juniper SSG and SRX, Cisco ASA \n \nFibre Channel – Experience with zoning and maintaining Brocade, McDATA and Cisco MDS switches \n \nStorage – Block based SAN administration using Fibre Channel and iSCSI with HP MSA, HP EVA, HP 3AR and EMC Clariion based arrays \n \nVirtualisation Experience: \nHighly experienced supporting VSphere High Availability DRS enabled clusters spanning large server estates  \nVMware ESX 4.0 to ESXi 5.5 using VSphere from 4.0 to 5.5 Enterprise and Enterprise Plus \nVMware Converter, PlateSpin \nVeeam Backup and Replication \nvRanger Backup and Replication \nHP OneView \nNFS file, iSCSI and FC block with VMFS and RDM based storage \n \nMicrosoft Windows Technologies: \nWindows Server administration from 2000 – 2012 R2 \nActive Directory design including DNS, DHCP, Group Policy, NPS, WSUS, WDS, RADUIS, Certificate Management \nMicrosoft Exchange 2003 – 2010, IIS, SQL Server 2000 – 2012  \nMicrosoft Failover Clustering, File Servers, Print Servers \nSystem Centre Configuration Manager – SCCM, System Centre Operations Manager - SCOM \nMicrosoft Lync 2010 – 2013 with Enterprise Voice, ISA 2006 - Forefront 2010 Proxy \nPowerShell, VBScript, Microsoft Azure Infrastructure as a Service (IaaS) \n \nOther technology exposure and legacy skills: \nSymantec NetBackup, HP Tape Libraries \nMicrosoft Office 2000 – 2013 including Office 365 and Visio 2010-2013 \nSymantec.cloud (Messagelabs) \nSophos Enterprise \nNortel/Avaya  \nNovell Netware and GroupWise and Zen Works legacy experience. Hardware Experience: \nServers – HP C-Class Chassis with BL Blades and ProLiant DL, Dell PowerEdge and Cisco UCS \n \nIP Networking – L2 & L3 routing and switching using Cisco iOS, Dell PowerConnect, HP BladeOS and Network Connect/Flex Fabric, Extreme XOS and Juniper JunOS \n \nA good understanding of networking technologies such as LAN, WAN, Enterprise Wireless, VOIP, MPLS, BGP, QoS, VLANs, LACP, Spanning Tree, OSPF, Leaf/Spine and Core/Edge topologies, DMZ, VPN, SIP Trunking and load Balancing. \n \nFirewalls – Juniper SSG and SRX, Cisco ASA \n \nFibre Channel – Experience with zoning and maintaining Brocade, McDATA and Cisco MDS switches \n \nStorage – Block based SAN administration using Fibre Channel and iSCSI with HP MSA, HP EVA, HP 3AR and EMC Clariion based arrays \n \nVirtualisation Experience: \nHighly experienced supporting VSphere High Availability DRS enabled clusters spanning large server estates  \nVMware ESX 4.0 to ESXi 5.5 using VSphere from 4.0 to 5.5 Enterprise and Enterprise Plus \nVMware Converter, PlateSpin \nVeeam Backup and Replication \nvRanger Backup and Replication \nHP OneView \nNFS file, iSCSI and FC block with VMFS and RDM based storage \n \nMicrosoft Windows Technologies: \nWindows Server administration from 2000 – 2012 R2 \nActive Directory design including DNS, DHCP, Group Policy, NPS, WSUS, WDS, RADUIS, Certificate Management \nMicrosoft Exchange 2003 – 2010, IIS, SQL Server 2000 – 2012  \nMicrosoft Failover Clustering, File Servers, Print Servers \nSystem Centre Configuration Manager – SCCM, System Centre Operations Manager - SCOM \nMicrosoft Lync 2010 – 2013 with Enterprise Voice, ISA 2006 - Forefront 2010 Proxy \nPowerShell, VBScript, Microsoft Azure Infrastructure as a Service (IaaS) \n \nOther technology exposure and legacy skills: \nSymantec NetBackup, HP Tape Libraries \nMicrosoft Office 2000 – 2013 including Office 365 and Visio 2010-2013 \nSymantec.cloud (Messagelabs) \nSophos Enterprise \nNortel/Avaya  \nNovell Netware and GroupWise and Zen Works legacy experience. Hardware Experience: \nServers – HP C-Class Chassis with BL Blades and ProLiant DL, Dell PowerEdge and Cisco UCS \n \nIP Networking – L2 & L3 routing and switching using Cisco iOS, Dell PowerConnect, HP BladeOS and Network Connect/Flex Fabric, Extreme XOS and Juniper JunOS \n \nA good understanding of networking technologies such as LAN, WAN, Enterprise Wireless, VOIP, MPLS, BGP, QoS, VLANs, LACP, Spanning Tree, OSPF, Leaf/Spine and Core/Edge topologies, DMZ, VPN, SIP Trunking and load Balancing. \n \nFirewalls – Juniper SSG and SRX, Cisco ASA \n \nFibre Channel – Experience with zoning and maintaining Brocade, McDATA and Cisco MDS switches \n \nStorage – Block based SAN administration using Fibre Channel and iSCSI with HP MSA, HP EVA, HP 3AR and EMC Clariion based arrays \n \nVirtualisation Experience: \nHighly experienced supporting VSphere High Availability DRS enabled clusters spanning large server estates  \nVMware ESX 4.0 to ESXi 5.5 using VSphere from 4.0 to 5.5 Enterprise and Enterprise Plus \nVMware Converter, PlateSpin \nVeeam Backup and Replication \nvRanger Backup and Replication \nHP OneView \nNFS file, iSCSI and FC block with VMFS and RDM based storage \n \nMicrosoft Windows Technologies: \nWindows Server administration from 2000 – 2012 R2 \nActive Directory design including DNS, DHCP, Group Policy, NPS, WSUS, WDS, RADUIS, Certificate Management \nMicrosoft Exchange 2003 – 2010, IIS, SQL Server 2000 – 2012  \nMicrosoft Failover Clustering, File Servers, Print Servers \nSystem Centre Configuration Manager – SCCM, System Centre Operations Manager - SCOM \nMicrosoft Lync 2010 – 2013 with Enterprise Voice, ISA 2006 - Forefront 2010 Proxy \nPowerShell, VBScript, Microsoft Azure Infrastructure as a Service (IaaS) \n \nOther technology exposure and legacy skills: \nSymantec NetBackup, HP Tape Libraries \nMicrosoft Office 2000 – 2013 including Office 365 and Visio 2010-2013 \nSymantec.cloud (Messagelabs) \nSophos Enterprise \nNortel/Avaya  \nNovell Netware and GroupWise and Zen Works legacy experience. Experience IS Infrastructure Engineer Network Housing Group June 2015  – Present (3 months) London, United Kingdom IT Technical Specialist ELEXON December 2011  –  June 2015  (3 years 7 months) London, United Kingdom Responsible for the infrastructure and on-site data centre comprising of 120 servers supporting 220 users. Lead engineer for a HP Blade centre and fibre channel storage administrator for a HP SAN storage area network hosting a large VMware ESXi VSphere 5.5 high availability and DRS enabled clustered environment. Supporting a diverse infrastructure that comprises of a large Windows 2008-2012 Active Directory Domain with DNS, DHCP, Group Policy, NPS, RADIUS, Exchange 2010, Lync 2013, SCCM, SCOM, FTP, NetBackup 7.x, vRanger, multiple IIS instances, internal applications and several SQL server 2008 and 2012 clustered instances.  \n \nResponsible for configuring and maintaining the fibre and copper network topology for high availability and security of all L2-L3 wired and wireless network devices for route/switch, VLANS, iSCSI, DMZ, MPLS, WAN, VOIP, SIP trunk and L4 –L7 load balancers and firewalls that comprises of Extreme, Cisco, HP, Juniper and KEMP. \n \nProviding on-site and out of hours break/fix; troubleshooting, backup and DR, infrastructure hardware tendering process, planned changes, hardware & software upgrades, software & firmware patching, providing application support, technical project support and technical documentation for the ELEXON infrastructure. Infrastructure Systems Analyst 2e2 January 2011  –  November 2011  (11 months) London Borough Waltham Forest Responsible for maintaining over 300 servers in an ITIL environment running VMware ESXi, Windows Server, Red Hat Linux and Novell Netware Open Enterprise Server supporting 5000 users. Domain Administrator of Microsoft Active Directory, DNS, DHCP, Group Policy, MS SQL Server, Citrix, VMware, SCCM, GroupWise, Exchange 2010, storage & backup using Symantec NetBackup, Backup Exec and Veeam.  \nProvided out of hours support, liaised with external vendors and co-located cloud-based data centres. \n \nBAU administration on all physical and virtual servers within server estate, VDI support, SAN block storage creation, server application clustering, server anti-virus, Cisco and Brocade switches, backups and disaster recovery. Developed a standardised server build for Windows Severs maintained by SCCM and performed P2V migration of physical servers to VMware ESXi using VMware Converter and PlateSpin. Data Centre Systems Analyst Dell Computers January 2010  –  February 2011  (1 year 2 months) London Borough Waltham Forest Administrator of a 10 node Novell Netware cluster running multiple fileservers and GroupWise post offices, LDAP servers, Zen Works middle tier servers, and external facing FTP servers. Maintained all servers and L2 switches within 2 large data centres, provided commissioning and decommissioning of services to the business of 5000 users. Lead technical consultant within the ICT project team, implementation of a greenfield Microsoft Active Directory 2008 R2 Forest and Domain, maintained high availability on a large VMware VSphere DRS enabled cluster running VMware ESX, SQL Server 2008 Clustering, Exchange 2010 servers and 2 EMC Clariion NS480 SAN Arrays with Cisco UCS blades. Technically involved in supplier tender process, procurement of new services and responsible for implementing Virtual Desktop Infrastructure (VDI) using Citrix Xen Desktop 4 with XenApp. 3rd Line Desktop Support Analyst Dell Computers January 2009  –  January 2010  (1 year 1 month) London Borough Waltham Forest Provided 3rd line support and break/fix to users with Remedy and SupportWorks software. Support given on Roaming profiles, eDirectory and Zen Works, troubleshooting VPN issues, file and print support, Blackberry, Citrix and Microsoft Office. Support provided by remote desktop or visiting client sites spread across East London. Designed and implemented a standardised Windows XP build using Novell Zen Works and WSUS to 5000 users. Senior Technical Engineer Hewlett-Packard January 2007  –  December 2008  (2 years) On-site at Intel Corporation, Swindon, United Kingdom 1st point of contact for users and responsible for all client hardware repairs for the UK and several EMEA countries. Supporting a user base of 2500 spanned over 4000 devices. Performed hardware and software repairs on Lenovo, Dell, Toshiba, Acer and HP desktops and laptops. Provided data migration, disaster recovery services and liaised with 3rd party vendors.  \n3rd level hardware & software support for users by phone, email, desk side, by courier or remote desktop. Active Directory administrator, performing user and file maintenance within a 90K user active directory. Delivered training and learning workshops for UK staff including new employees and existing staff migrating to new systems and application platforms. Managed interns during IT placements, monitoring performance and providing technical assistance. Senior Technical Engineer Intel Corporation January 2007  –  December 2008  (2 years) Swindon, United Kingdom 1st point of contact for users and responsible for all client hardware repairs for the UK and several EMEA countries. Supporting a user base of 2500 spanned over 4000 devices. Performed hardware and software repairs on Lenovo, Dell, Toshiba, Acer and HP desktops and laptops. Provided data migration, disaster recovery services and liaised with 3rd party vendors.  \n3rd level hardware & software support for users by phone, email, desk side, by courier or remote desktop. Active Directory administrator, performing user and file maintenance within a 90K user active directory. Delivered training and learning workshops for UK staff including new employees and existing staff migrating to new systems and application platforms. Managed interns during IT placements, monitoring performance and providing technical assistance. Windows XP Staging & Deployment Engineer IBM Global Services September 2006  –  February 2007  (6 months) Swindon, United Kingdom Provided on-site support at various sites for Zurich Financial Services. Delivered hardware and software rollout from Windows 2000 to Windows XP. Performed hardware upgrades, error reporting and technical snagging regarding IBM Tivoli and Lotus Notes to Outlook 2003 migration support. 1st Line Support & Linux Troubleshooter Siemens Business Services December 2004  –  February 2006  (1 year 3 months) Swindon, United Kingdom My role was technical lead liaising with MOT centres and garages setting up the new Linux-based MOT computerisation system. My duties included helpdesk support, troubleshooting, system issues, advising programmers and developers on bugs, implementing software patches to the Linux-based clients, organising and dispatching hardware to sites and clients, telephone based support to staff and general office admin. IS Infrastructure Engineer Network Housing Group June 2015  – Present (3 months) London, United Kingdom IS Infrastructure Engineer Network Housing Group June 2015  – Present (3 months) London, United Kingdom IT Technical Specialist ELEXON December 2011  –  June 2015  (3 years 7 months) London, United Kingdom Responsible for the infrastructure and on-site data centre comprising of 120 servers supporting 220 users. Lead engineer for a HP Blade centre and fibre channel storage administrator for a HP SAN storage area network hosting a large VMware ESXi VSphere 5.5 high availability and DRS enabled clustered environment. Supporting a diverse infrastructure that comprises of a large Windows 2008-2012 Active Directory Domain with DNS, DHCP, Group Policy, NPS, RADIUS, Exchange 2010, Lync 2013, SCCM, SCOM, FTP, NetBackup 7.x, vRanger, multiple IIS instances, internal applications and several SQL server 2008 and 2012 clustered instances.  \n \nResponsible for configuring and maintaining the fibre and copper network topology for high availability and security of all L2-L3 wired and wireless network devices for route/switch, VLANS, iSCSI, DMZ, MPLS, WAN, VOIP, SIP trunk and L4 –L7 load balancers and firewalls that comprises of Extreme, Cisco, HP, Juniper and KEMP. \n \nProviding on-site and out of hours break/fix; troubleshooting, backup and DR, infrastructure hardware tendering process, planned changes, hardware & software upgrades, software & firmware patching, providing application support, technical project support and technical documentation for the ELEXON infrastructure. IT Technical Specialist ELEXON December 2011  –  June 2015  (3 years 7 months) London, United Kingdom Responsible for the infrastructure and on-site data centre comprising of 120 servers supporting 220 users. Lead engineer for a HP Blade centre and fibre channel storage administrator for a HP SAN storage area network hosting a large VMware ESXi VSphere 5.5 high availability and DRS enabled clustered environment. Supporting a diverse infrastructure that comprises of a large Windows 2008-2012 Active Directory Domain with DNS, DHCP, Group Policy, NPS, RADIUS, Exchange 2010, Lync 2013, SCCM, SCOM, FTP, NetBackup 7.x, vRanger, multiple IIS instances, internal applications and several SQL server 2008 and 2012 clustered instances.  \n \nResponsible for configuring and maintaining the fibre and copper network topology for high availability and security of all L2-L3 wired and wireless network devices for route/switch, VLANS, iSCSI, DMZ, MPLS, WAN, VOIP, SIP trunk and L4 –L7 load balancers and firewalls that comprises of Extreme, Cisco, HP, Juniper and KEMP. \n \nProviding on-site and out of hours break/fix; troubleshooting, backup and DR, infrastructure hardware tendering process, planned changes, hardware & software upgrades, software & firmware patching, providing application support, technical project support and technical documentation for the ELEXON infrastructure. Infrastructure Systems Analyst 2e2 January 2011  –  November 2011  (11 months) London Borough Waltham Forest Responsible for maintaining over 300 servers in an ITIL environment running VMware ESXi, Windows Server, Red Hat Linux and Novell Netware Open Enterprise Server supporting 5000 users. Domain Administrator of Microsoft Active Directory, DNS, DHCP, Group Policy, MS SQL Server, Citrix, VMware, SCCM, GroupWise, Exchange 2010, storage & backup using Symantec NetBackup, Backup Exec and Veeam.  \nProvided out of hours support, liaised with external vendors and co-located cloud-based data centres. \n \nBAU administration on all physical and virtual servers within server estate, VDI support, SAN block storage creation, server application clustering, server anti-virus, Cisco and Brocade switches, backups and disaster recovery. Developed a standardised server build for Windows Severs maintained by SCCM and performed P2V migration of physical servers to VMware ESXi using VMware Converter and PlateSpin. Infrastructure Systems Analyst 2e2 January 2011  –  November 2011  (11 months) London Borough Waltham Forest Responsible for maintaining over 300 servers in an ITIL environment running VMware ESXi, Windows Server, Red Hat Linux and Novell Netware Open Enterprise Server supporting 5000 users. Domain Administrator of Microsoft Active Directory, DNS, DHCP, Group Policy, MS SQL Server, Citrix, VMware, SCCM, GroupWise, Exchange 2010, storage & backup using Symantec NetBackup, Backup Exec and Veeam.  \nProvided out of hours support, liaised with external vendors and co-located cloud-based data centres. \n \nBAU administration on all physical and virtual servers within server estate, VDI support, SAN block storage creation, server application clustering, server anti-virus, Cisco and Brocade switches, backups and disaster recovery. Developed a standardised server build for Windows Severs maintained by SCCM and performed P2V migration of physical servers to VMware ESXi using VMware Converter and PlateSpin. Data Centre Systems Analyst Dell Computers January 2010  –  February 2011  (1 year 2 months) London Borough Waltham Forest Administrator of a 10 node Novell Netware cluster running multiple fileservers and GroupWise post offices, LDAP servers, Zen Works middle tier servers, and external facing FTP servers. Maintained all servers and L2 switches within 2 large data centres, provided commissioning and decommissioning of services to the business of 5000 users. Lead technical consultant within the ICT project team, implementation of a greenfield Microsoft Active Directory 2008 R2 Forest and Domain, maintained high availability on a large VMware VSphere DRS enabled cluster running VMware ESX, SQL Server 2008 Clustering, Exchange 2010 servers and 2 EMC Clariion NS480 SAN Arrays with Cisco UCS blades. Technically involved in supplier tender process, procurement of new services and responsible for implementing Virtual Desktop Infrastructure (VDI) using Citrix Xen Desktop 4 with XenApp. Data Centre Systems Analyst Dell Computers January 2010  –  February 2011  (1 year 2 months) London Borough Waltham Forest Administrator of a 10 node Novell Netware cluster running multiple fileservers and GroupWise post offices, LDAP servers, Zen Works middle tier servers, and external facing FTP servers. Maintained all servers and L2 switches within 2 large data centres, provided commissioning and decommissioning of services to the business of 5000 users. Lead technical consultant within the ICT project team, implementation of a greenfield Microsoft Active Directory 2008 R2 Forest and Domain, maintained high availability on a large VMware VSphere DRS enabled cluster running VMware ESX, SQL Server 2008 Clustering, Exchange 2010 servers and 2 EMC Clariion NS480 SAN Arrays with Cisco UCS blades. Technically involved in supplier tender process, procurement of new services and responsible for implementing Virtual Desktop Infrastructure (VDI) using Citrix Xen Desktop 4 with XenApp. 3rd Line Desktop Support Analyst Dell Computers January 2009  –  January 2010  (1 year 1 month) London Borough Waltham Forest Provided 3rd line support and break/fix to users with Remedy and SupportWorks software. Support given on Roaming profiles, eDirectory and Zen Works, troubleshooting VPN issues, file and print support, Blackberry, Citrix and Microsoft Office. Support provided by remote desktop or visiting client sites spread across East London. Designed and implemented a standardised Windows XP build using Novell Zen Works and WSUS to 5000 users. 3rd Line Desktop Support Analyst Dell Computers January 2009  –  January 2010  (1 year 1 month) London Borough Waltham Forest Provided 3rd line support and break/fix to users with Remedy and SupportWorks software. Support given on Roaming profiles, eDirectory and Zen Works, troubleshooting VPN issues, file and print support, Blackberry, Citrix and Microsoft Office. Support provided by remote desktop or visiting client sites spread across East London. Designed and implemented a standardised Windows XP build using Novell Zen Works and WSUS to 5000 users. Senior Technical Engineer Hewlett-Packard January 2007  –  December 2008  (2 years) On-site at Intel Corporation, Swindon, United Kingdom 1st point of contact for users and responsible for all client hardware repairs for the UK and several EMEA countries. Supporting a user base of 2500 spanned over 4000 devices. Performed hardware and software repairs on Lenovo, Dell, Toshiba, Acer and HP desktops and laptops. Provided data migration, disaster recovery services and liaised with 3rd party vendors.  \n3rd level hardware & software support for users by phone, email, desk side, by courier or remote desktop. Active Directory administrator, performing user and file maintenance within a 90K user active directory. Delivered training and learning workshops for UK staff including new employees and existing staff migrating to new systems and application platforms. Managed interns during IT placements, monitoring performance and providing technical assistance. Senior Technical Engineer Hewlett-Packard January 2007  –  December 2008  (2 years) On-site at Intel Corporation, Swindon, United Kingdom 1st point of contact for users and responsible for all client hardware repairs for the UK and several EMEA countries. Supporting a user base of 2500 spanned over 4000 devices. Performed hardware and software repairs on Lenovo, Dell, Toshiba, Acer and HP desktops and laptops. Provided data migration, disaster recovery services and liaised with 3rd party vendors.  \n3rd level hardware & software support for users by phone, email, desk side, by courier or remote desktop. Active Directory administrator, performing user and file maintenance within a 90K user active directory. Delivered training and learning workshops for UK staff including new employees and existing staff migrating to new systems and application platforms. Managed interns during IT placements, monitoring performance and providing technical assistance. Senior Technical Engineer Intel Corporation January 2007  –  December 2008  (2 years) Swindon, United Kingdom 1st point of contact for users and responsible for all client hardware repairs for the UK and several EMEA countries. Supporting a user base of 2500 spanned over 4000 devices. Performed hardware and software repairs on Lenovo, Dell, Toshiba, Acer and HP desktops and laptops. Provided data migration, disaster recovery services and liaised with 3rd party vendors.  \n3rd level hardware & software support for users by phone, email, desk side, by courier or remote desktop. Active Directory administrator, performing user and file maintenance within a 90K user active directory. Delivered training and learning workshops for UK staff including new employees and existing staff migrating to new systems and application platforms. Managed interns during IT placements, monitoring performance and providing technical assistance. Senior Technical Engineer Intel Corporation January 2007  –  December 2008  (2 years) Swindon, United Kingdom 1st point of contact for users and responsible for all client hardware repairs for the UK and several EMEA countries. Supporting a user base of 2500 spanned over 4000 devices. Performed hardware and software repairs on Lenovo, Dell, Toshiba, Acer and HP desktops and laptops. Provided data migration, disaster recovery services and liaised with 3rd party vendors.  \n3rd level hardware & software support for users by phone, email, desk side, by courier or remote desktop. Active Directory administrator, performing user and file maintenance within a 90K user active directory. Delivered training and learning workshops for UK staff including new employees and existing staff migrating to new systems and application platforms. Managed interns during IT placements, monitoring performance and providing technical assistance. Windows XP Staging & Deployment Engineer IBM Global Services September 2006  –  February 2007  (6 months) Swindon, United Kingdom Provided on-site support at various sites for Zurich Financial Services. Delivered hardware and software rollout from Windows 2000 to Windows XP. Performed hardware upgrades, error reporting and technical snagging regarding IBM Tivoli and Lotus Notes to Outlook 2003 migration support. Windows XP Staging & Deployment Engineer IBM Global Services September 2006  –  February 2007  (6 months) Swindon, United Kingdom Provided on-site support at various sites for Zurich Financial Services. Delivered hardware and software rollout from Windows 2000 to Windows XP. Performed hardware upgrades, error reporting and technical snagging regarding IBM Tivoli and Lotus Notes to Outlook 2003 migration support. 1st Line Support & Linux Troubleshooter Siemens Business Services December 2004  –  February 2006  (1 year 3 months) Swindon, United Kingdom My role was technical lead liaising with MOT centres and garages setting up the new Linux-based MOT computerisation system. My duties included helpdesk support, troubleshooting, system issues, advising programmers and developers on bugs, implementing software patches to the Linux-based clients, organising and dispatching hardware to sites and clients, telephone based support to staff and general office admin. 1st Line Support & Linux Troubleshooter Siemens Business Services December 2004  –  February 2006  (1 year 3 months) Swindon, United Kingdom My role was technical lead liaising with MOT centres and garages setting up the new Linux-based MOT computerisation system. My duties included helpdesk support, troubleshooting, system issues, advising programmers and developers on bugs, implementing software patches to the Linux-based clients, organising and dispatching hardware to sites and clients, telephone based support to staff and general office admin. Languages English Native or bilingual proficiency English Native or bilingual proficiency English Native or bilingual proficiency Native or bilingual proficiency Skills Windows Server Active Directory Citrix VMware ESX VMware Servers Virtualization DNS Hardware SAN VPN Hyper-V Windows 7 Blackberry Enterprise... Operating Systems Data Center Windows TCP/IP Backup Exec Firewalls HP Security WSUS System Administration DHCP VDI Storage Cloud Computing High Availability Switches WAN Storage Area Networks Clustering VMware Infrastructure Netbackup SQL Server Fibre Channel Extreme Networks Juniper Technologies HP Blade Lync HP Storage Cisco IOS Brocade Fibre Switches Group Policy JUNOS vSphere SCCM SIP Trunking Troubleshooting See 35+     See less Skills  Windows Server Active Directory Citrix VMware ESX VMware Servers Virtualization DNS Hardware SAN VPN Hyper-V Windows 7 Blackberry Enterprise... Operating Systems Data Center Windows TCP/IP Backup Exec Firewalls HP Security WSUS System Administration DHCP VDI Storage Cloud Computing High Availability Switches WAN Storage Area Networks Clustering VMware Infrastructure Netbackup SQL Server Fibre Channel Extreme Networks Juniper Technologies HP Blade Lync HP Storage Cisco IOS Brocade Fibre Switches Group Policy JUNOS vSphere SCCM SIP Trunking Troubleshooting See 35+     See less Windows Server Active Directory Citrix VMware ESX VMware Servers Virtualization DNS Hardware SAN VPN Hyper-V Windows 7 Blackberry Enterprise... Operating Systems Data Center Windows TCP/IP Backup Exec Firewalls HP Security WSUS System Administration DHCP VDI Storage Cloud Computing High Availability Switches WAN Storage Area Networks Clustering VMware Infrastructure Netbackup SQL Server Fibre Channel Extreme Networks Juniper Technologies HP Blade Lync HP Storage Cisco IOS Brocade Fibre Switches Group Policy JUNOS vSphere SCCM SIP Trunking Troubleshooting See 35+     See less Windows Server Active Directory Citrix VMware ESX VMware Servers Virtualization DNS Hardware SAN VPN Hyper-V Windows 7 Blackberry Enterprise... Operating Systems Data Center Windows TCP/IP Backup Exec Firewalls HP Security WSUS System Administration DHCP VDI Storage Cloud Computing High Availability Switches WAN Storage Area Networks Clustering VMware Infrastructure Netbackup SQL Server Fibre Channel Extreme Networks Juniper Technologies HP Blade Lync HP Storage Cisco IOS Brocade Fibre Switches Group Policy JUNOS vSphere SCCM SIP Trunking Troubleshooting See 35+     See less Education Swindon College 1996  – 1997 Churchfields School GCSE 1991  – 1996 Swindon College 1996  – 1997 Swindon College 1996  – 1997 Swindon College 1996  – 1997 Churchfields School GCSE 1991  – 1996 Churchfields School GCSE 1991  – 1996 Churchfields School GCSE 1991  – 1996 "]}