{"position": "Senior Interaction Designer", "company": "Intel Corporation", "profiles": ["Summary I am a user experience designer that has spent the past three years creating user centered design and functionality for multinationals, local government, and small start-ups, working in both Waterfall and Agile methodologies. I have designed ecommerce functionality for healthcare sites; developed intranet applications that increased employee efficiency, engagement, and revenue; created personas; created new information architectures; worked with graphic designers to create style guides; and have designed sites that work on desktop and mobile devices. \n \nI run the PDX UX Book Club, and am co-lead of IxDA Portland. Specialties:Wireframing, sketching, user research, competitive analysis, heuristic evaluation, information architecture design, usability testing. Summary I am a user experience designer that has spent the past three years creating user centered design and functionality for multinationals, local government, and small start-ups, working in both Waterfall and Agile methodologies. I have designed ecommerce functionality for healthcare sites; developed intranet applications that increased employee efficiency, engagement, and revenue; created personas; created new information architectures; worked with graphic designers to create style guides; and have designed sites that work on desktop and mobile devices. \n \nI run the PDX UX Book Club, and am co-lead of IxDA Portland. Specialties:Wireframing, sketching, user research, competitive analysis, heuristic evaluation, information architecture design, usability testing. I am a user experience designer that has spent the past three years creating user centered design and functionality for multinationals, local government, and small start-ups, working in both Waterfall and Agile methodologies. I have designed ecommerce functionality for healthcare sites; developed intranet applications that increased employee efficiency, engagement, and revenue; created personas; created new information architectures; worked with graphic designers to create style guides; and have designed sites that work on desktop and mobile devices. \n \nI run the PDX UX Book Club, and am co-lead of IxDA Portland. Specialties:Wireframing, sketching, user research, competitive analysis, heuristic evaluation, information architecture design, usability testing. I am a user experience designer that has spent the past three years creating user centered design and functionality for multinationals, local government, and small start-ups, working in both Waterfall and Agile methodologies. I have designed ecommerce functionality for healthcare sites; developed intranet applications that increased employee efficiency, engagement, and revenue; created personas; created new information architectures; worked with graphic designers to create style guides; and have designed sites that work on desktop and mobile devices. \n \nI run the PDX UX Book Club, and am co-lead of IxDA Portland. Specialties:Wireframing, sketching, user research, competitive analysis, heuristic evaluation, information architecture design, usability testing. Experience Senior Interaction Designer Intel Corporation August 2014  – Present (1 year 1 month) Senior Interaction Designer Intel Corporation August 2014  – Present (1 year 1 month) Senior Interaction Designer Intel Corporation August 2014  – Present (1 year 1 month) Skills Competitive Analysis Information Architecture User Experience User Interface Design Start-ups User-centered Design Personas Paper Prototyping Card Sorting Wire Framing Site Maps Agile Mobile Internet Interaction Design Prototyping Front-end Development Usability Testing Agile Methodologies See 3+     See less Skills  Competitive Analysis Information Architecture User Experience User Interface Design Start-ups User-centered Design Personas Paper Prototyping Card Sorting Wire Framing Site Maps Agile Mobile Internet Interaction Design Prototyping Front-end Development Usability Testing Agile Methodologies See 3+     See less Competitive Analysis Information Architecture User Experience User Interface Design Start-ups User-centered Design Personas Paper Prototyping Card Sorting Wire Framing Site Maps Agile Mobile Internet Interaction Design Prototyping Front-end Development Usability Testing Agile Methodologies See 3+     See less Competitive Analysis Information Architecture User Experience User Interface Design Start-ups User-centered Design Personas Paper Prototyping Card Sorting Wire Framing Site Maps Agile Mobile Internet Interaction Design Prototyping Front-end Development Usability Testing Agile Methodologies See 3+     See less Education The Open University Fundamentals Of Interaction Design undergraduate course,  Usability , accessibility, human computer interaction, web-heuristics, personas, wireframing 2008  – 2008 University of Greenwich Master's degree,  Web site architecture 2003  – 2005 The Open University Fundamentals Of Interaction Design undergraduate course,  Usability , accessibility, human computer interaction, web-heuristics, personas, wireframing 2008  – 2008 The Open University Fundamentals Of Interaction Design undergraduate course,  Usability , accessibility, human computer interaction, web-heuristics, personas, wireframing 2008  – 2008 The Open University Fundamentals Of Interaction Design undergraduate course,  Usability , accessibility, human computer interaction, web-heuristics, personas, wireframing 2008  – 2008 University of Greenwich Master's degree,  Web site architecture 2003  – 2005 University of Greenwich Master's degree,  Web site architecture 2003  – 2005 University of Greenwich Master's degree,  Web site architecture 2003  – 2005 ", "Experience Senior Interaction Designer Intel Corporation January 2015  – Present (8 months) Lead Experience Designer Great Fridays June 2013  –  February 2015  (1 year 9 months) Experience Designer Great Fridays April 2012  –  June 2013  (1 year 3 months) London, United Kingdom Consultant Seren Partners Ltd June 2010  –  May 2012  (2 years) Designer House of Mosaics January 2010  –  April 2010  (4 months) Designer Khazarian Ltd January 2009  –  October 2009  (10 months) Senior Interaction Designer Intel Corporation January 2015  – Present (8 months) Senior Interaction Designer Intel Corporation January 2015  – Present (8 months) Lead Experience Designer Great Fridays June 2013  –  February 2015  (1 year 9 months) Lead Experience Designer Great Fridays June 2013  –  February 2015  (1 year 9 months) Experience Designer Great Fridays April 2012  –  June 2013  (1 year 3 months) London, United Kingdom Experience Designer Great Fridays April 2012  –  June 2013  (1 year 3 months) London, United Kingdom Consultant Seren Partners Ltd June 2010  –  May 2012  (2 years) Consultant Seren Partners Ltd June 2010  –  May 2012  (2 years) Designer House of Mosaics January 2010  –  April 2010  (4 months) Designer House of Mosaics January 2010  –  April 2010  (4 months) Designer Khazarian Ltd January 2009  –  October 2009  (10 months) Designer Khazarian Ltd January 2009  –  October 2009  (10 months) Skills Service Design Visual Communication Participatory Design Persona OmniGraffle User Experience Trends Heuristic Evaluation Research Design Interaction Design User-centered Design User Research Design Thinking Information Architecture User Experience Design Design Strategy User Interface Design Experience Design See 3+     See less Skills  Service Design Visual Communication Participatory Design Persona OmniGraffle User Experience Trends Heuristic Evaluation Research Design Interaction Design User-centered Design User Research Design Thinking Information Architecture User Experience Design Design Strategy User Interface Design Experience Design See 3+     See less Service Design Visual Communication Participatory Design Persona OmniGraffle User Experience Trends Heuristic Evaluation Research Design Interaction Design User-centered Design User Research Design Thinking Information Architecture User Experience Design Design Strategy User Interface Design Experience Design See 3+     See less Service Design Visual Communication Participatory Design Persona OmniGraffle User Experience Trends Heuristic Evaluation Research Design Interaction Design User-centered Design User Research Design Thinking Information Architecture User Experience Design Design Strategy User Interface Design Experience Design See 3+     See less Education University of Brighton BA(Hons),  Fashion Textiles with Business Studies 2003  – 2008 University of Brighton BA(Hons),  Fashion Textiles with Business Studies 2003  – 2008 University of Brighton BA(Hons),  Fashion Textiles with Business Studies 2003  – 2008 University of Brighton BA(Hons),  Fashion Textiles with Business Studies 2003  – 2008 ", "Summary Interaction Designer with a passion for delivering valuable services to consumers.  \n \nCollaborate across disciplines to create a vision and strategy for a product or service. Envision how disparate components come together to build a user experience and affect user behavior. Communicate insights through visual models. \n \nFacilitate and participate in the design process from ideation to implementation. Utilize social media tools to learn about upcoming trends and methods while sharing knowledge and ideas with colleagues. Specialties:user centered design, systems thinking, concept sketching, storyboarding, paper prototyping, fast iterations Summary Interaction Designer with a passion for delivering valuable services to consumers.  \n \nCollaborate across disciplines to create a vision and strategy for a product or service. Envision how disparate components come together to build a user experience and affect user behavior. Communicate insights through visual models. \n \nFacilitate and participate in the design process from ideation to implementation. Utilize social media tools to learn about upcoming trends and methods while sharing knowledge and ideas with colleagues. Specialties:user centered design, systems thinking, concept sketching, storyboarding, paper prototyping, fast iterations Interaction Designer with a passion for delivering valuable services to consumers.  \n \nCollaborate across disciplines to create a vision and strategy for a product or service. Envision how disparate components come together to build a user experience and affect user behavior. Communicate insights through visual models. \n \nFacilitate and participate in the design process from ideation to implementation. Utilize social media tools to learn about upcoming trends and methods while sharing knowledge and ideas with colleagues. Specialties:user centered design, systems thinking, concept sketching, storyboarding, paper prototyping, fast iterations Interaction Designer with a passion for delivering valuable services to consumers.  \n \nCollaborate across disciplines to create a vision and strategy for a product or service. Envision how disparate components come together to build a user experience and affect user behavior. Communicate insights through visual models. \n \nFacilitate and participate in the design process from ideation to implementation. Utilize social media tools to learn about upcoming trends and methods while sharing knowledge and ideas with colleagues. Specialties:user centered design, systems thinking, concept sketching, storyboarding, paper prototyping, fast iterations Experience Senior Interaction Designer Intel Corporation June 2013  – Present (2 years 3 months) Senior Interaction Designer Intel Corporation June 2013  – Present (2 years 3 months) Senior Interaction Designer Intel Corporation June 2013  – Present (2 years 3 months) Languages Finnish Finnish Finnish Skills Paper Prototyping User-centered Design Interaction Design Storyboarding Wireframes User Experience Axure Human Computer... Wire Framing Agile Methodologies Heuristic Evaluation User Research Contextual Inquiry User Experience Design Skills  Paper Prototyping User-centered Design Interaction Design Storyboarding Wireframes User Experience Axure Human Computer... Wire Framing Agile Methodologies Heuristic Evaluation User Research Contextual Inquiry User Experience Design Paper Prototyping User-centered Design Interaction Design Storyboarding Wireframes User Experience Axure Human Computer... Wire Framing Agile Methodologies Heuristic Evaluation User Research Contextual Inquiry User Experience Design Paper Prototyping User-centered Design Interaction Design Storyboarding Wireframes User Experience Axure Human Computer... Wire Framing Agile Methodologies Heuristic Evaluation User Research Contextual Inquiry User Experience Design Education Carnegie Mellon University Masters,  Human Computer Interaction 2006  – 2007 University of California, Santa Barbara Bachelor of Science,  Computer Science 2002  – 2006 While excelling in my computer science classes, I was always more interested in creating the interface than coding the back end. I found my calling when the Human Computer Interaction elective class was offered for the first time at UCSB. Activities and Societies:  Media Equipment Carnegie Mellon University Masters,  Human Computer Interaction 2006  – 2007 Carnegie Mellon University Masters,  Human Computer Interaction 2006  – 2007 Carnegie Mellon University Masters,  Human Computer Interaction 2006  – 2007 University of California, Santa Barbara Bachelor of Science,  Computer Science 2002  – 2006 While excelling in my computer science classes, I was always more interested in creating the interface than coding the back end. I found my calling when the Human Computer Interaction elective class was offered for the first time at UCSB. Activities and Societies:  Media Equipment University of California, Santa Barbara Bachelor of Science,  Computer Science 2002  – 2006 While excelling in my computer science classes, I was always more interested in creating the interface than coding the back end. I found my calling when the Human Computer Interaction elective class was offered for the first time at UCSB. Activities and Societies:  Media Equipment University of California, Santa Barbara Bachelor of Science,  Computer Science 2002  – 2006 While excelling in my computer science classes, I was always more interested in creating the interface than coding the back end. I found my calling when the Human Computer Interaction elective class was offered for the first time at UCSB. Activities and Societies:  Media Equipment Honors & Awards Additional Honors & Awards Outstanding Senior in Computer Science Award (UCSB, 2006) \nGrow the Blue Award (HP, 2008) Additional Honors & Awards Outstanding Senior in Computer Science Award (UCSB, 2006) \nGrow the Blue Award (HP, 2008) Additional Honors & Awards Outstanding Senior in Computer Science Award (UCSB, 2006) \nGrow the Blue Award (HP, 2008) Additional Honors & Awards Outstanding Senior in Computer Science Award (UCSB, 2006) \nGrow the Blue Award (HP, 2008) "]}