{"position": "Senior Mechanical Engineer", "company": "Intel Corporation", "profiles": ["Experience Senior Mechanical Engineer Intel Corporation Senior Mechanical Engineer Intel Corporation Senior Mechanical Engineer Intel Corporation Skills Design of Experiments Semiconductors Skills  Design of Experiments Semiconductors Design of Experiments Semiconductors Design of Experiments Semiconductors ", "Experience IT Project Manager Intel Corporation November 2014  – Present (10 months) System development of business tools supporting Sales and Marketing.  \n Senior Mechanical Engineer Intel Corporation June 1996  –  November 2014  (18 years 6 months) Construction project engineer focused on special facility and delivery systems supporting semiconductor processing. Developed facility modeling and forecasting tools using SQL database and .NET technology.  IT Project Manager Intel Corporation November 2014  – Present (10 months) System development of business tools supporting Sales and Marketing.  \n IT Project Manager Intel Corporation November 2014  – Present (10 months) System development of business tools supporting Sales and Marketing.  \n Senior Mechanical Engineer Intel Corporation June 1996  –  November 2014  (18 years 6 months) Construction project engineer focused on special facility and delivery systems supporting semiconductor processing. Developed facility modeling and forecasting tools using SQL database and .NET technology.  Senior Mechanical Engineer Intel Corporation June 1996  –  November 2014  (18 years 6 months) Construction project engineer focused on special facility and delivery systems supporting semiconductor processing. Developed facility modeling and forecasting tools using SQL database and .NET technology.  Skills Semiconductors Design of Experiments SQL Programming System Architecture,... Skills  Semiconductors Design of Experiments SQL Programming System Architecture,... Semiconductors Design of Experiments SQL Programming System Architecture,... Semiconductors Design of Experiments SQL Programming System Architecture,... Education The University of New Mexico Master of Science (M.S.),  Aerospace/Mechanical Engineering 1989  – 1996 Specialized in Laser Optic Propagation through Turbulent Mediums. Stochastic Estimation solutions in Chaos Theory.  Activities and Societies:  NHO National Hispanic Organization. The University of New Mexico Master of Science (M.S.),  Aerospace/Mechanical Engineering 1989  – 1996 Specialized in Laser Optic Propagation through Turbulent Mediums. Stochastic Estimation solutions in Chaos Theory.  Activities and Societies:  NHO National Hispanic Organization. The University of New Mexico Master of Science (M.S.),  Aerospace/Mechanical Engineering 1989  – 1996 Specialized in Laser Optic Propagation through Turbulent Mediums. Stochastic Estimation solutions in Chaos Theory.  Activities and Societies:  NHO National Hispanic Organization. The University of New Mexico Master of Science (M.S.),  Aerospace/Mechanical Engineering 1989  – 1996 Specialized in Laser Optic Propagation through Turbulent Mediums. Stochastic Estimation solutions in Chaos Theory.  Activities and Societies:  NHO National Hispanic Organization. ", "Experience Senior Mechanical Engineer Intel Corporation March 1997  – Present (18 years 6 months) Senior Mechanical Engineer Intel Corporation March 1997  – Present (18 years 6 months) Senior Mechanical Engineer Intel Corporation March 1997  – Present (18 years 6 months) Skills Microsoft Office Management Microsoft Excel Microsoft Word Research PowerPoint Sales Leadership Training Photoshop Skills  Microsoft Office Management Microsoft Excel Microsoft Word Research PowerPoint Sales Leadership Training Photoshop Microsoft Office Management Microsoft Excel Microsoft Word Research PowerPoint Sales Leadership Training Photoshop Microsoft Office Management Microsoft Excel Microsoft Word Research PowerPoint Sales Leadership Training Photoshop ", "Experience Senior Mechanical Engineer Intel Corporation September 2014  – Present (1 year) Portland, Oregon Area Senior Mechanical Engineer Intel Corporation June 2012  –  August 2014  (2 years 3 months) Taipei City, Taiwan Senior Mechanical Engineer HTC September 2011  –  April 2012  (8 months) Taoyuan County, Taiwan 1. Mechanical structure design \n2. Components acceptance process running \n3. Supplier management \n4. New process development co-working with supplier Mechanical Project Manager FIH Co., Ltd September 2008  –  August 2011  (3 years) Shenzhen, Guangdong, China 1. Customer main contact window \n2. Coordinate with manufacturing department and RD team to have a good-designed quality product. \n3. Team management with 6 RDs and 10 PDs. NPI Program Manager FIH Co., Ltd March 2007  –  September 2008  (1 year 7 months) Shenzhen, Guangdong, China My Job is to lead the NPI (New Product Introduction) team to co-word with RD and feedback all the DFM(Desigh for Manufacturing) issues to RD. NPI team is consisted by DFBA (Desigh for Board Assemble, SMT specialist), DFFA (Desigh for Final assembly, Assembly process define and improvement), DFATP (Desigh for Alignment and Testing, Testing related issue), PSPHW (Produce Specific HW, Jig design for FA and also repairing), BM (Build Manager, Coordinate with RD, Sourcing, Factory, Operation team to make sure a smooth build could be held). My Job is to manage all NPI team issues for all projects. I also work as a Build manager and the project I've done is Vesper(Nokia 6600S). Senior Mechanical Engineer Intel Corporation September 2014  – Present (1 year) Portland, Oregon Area Senior Mechanical Engineer Intel Corporation September 2014  – Present (1 year) Portland, Oregon Area Senior Mechanical Engineer Intel Corporation June 2012  –  August 2014  (2 years 3 months) Taipei City, Taiwan Senior Mechanical Engineer Intel Corporation June 2012  –  August 2014  (2 years 3 months) Taipei City, Taiwan Senior Mechanical Engineer HTC September 2011  –  April 2012  (8 months) Taoyuan County, Taiwan 1. Mechanical structure design \n2. Components acceptance process running \n3. Supplier management \n4. New process development co-working with supplier Senior Mechanical Engineer HTC September 2011  –  April 2012  (8 months) Taoyuan County, Taiwan 1. Mechanical structure design \n2. Components acceptance process running \n3. Supplier management \n4. New process development co-working with supplier Mechanical Project Manager FIH Co., Ltd September 2008  –  August 2011  (3 years) Shenzhen, Guangdong, China 1. Customer main contact window \n2. Coordinate with manufacturing department and RD team to have a good-designed quality product. \n3. Team management with 6 RDs and 10 PDs. Mechanical Project Manager FIH Co., Ltd September 2008  –  August 2011  (3 years) Shenzhen, Guangdong, China 1. Customer main contact window \n2. Coordinate with manufacturing department and RD team to have a good-designed quality product. \n3. Team management with 6 RDs and 10 PDs. NPI Program Manager FIH Co., Ltd March 2007  –  September 2008  (1 year 7 months) Shenzhen, Guangdong, China My Job is to lead the NPI (New Product Introduction) team to co-word with RD and feedback all the DFM(Desigh for Manufacturing) issues to RD. NPI team is consisted by DFBA (Desigh for Board Assemble, SMT specialist), DFFA (Desigh for Final assembly, Assembly process define and improvement), DFATP (Desigh for Alignment and Testing, Testing related issue), PSPHW (Produce Specific HW, Jig design for FA and also repairing), BM (Build Manager, Coordinate with RD, Sourcing, Factory, Operation team to make sure a smooth build could be held). My Job is to manage all NPI team issues for all projects. I also work as a Build manager and the project I've done is Vesper(Nokia 6600S). NPI Program Manager FIH Co., Ltd March 2007  –  September 2008  (1 year 7 months) Shenzhen, Guangdong, China My Job is to lead the NPI (New Product Introduction) team to co-word with RD and feedback all the DFM(Desigh for Manufacturing) issues to RD. NPI team is consisted by DFBA (Desigh for Board Assemble, SMT specialist), DFFA (Desigh for Final assembly, Assembly process define and improvement), DFATP (Desigh for Alignment and Testing, Testing related issue), PSPHW (Produce Specific HW, Jig design for FA and also repairing), BM (Build Manager, Coordinate with RD, Sourcing, Factory, Operation team to make sure a smooth build could be held). My Job is to manage all NPI team issues for all projects. I also work as a Build manager and the project I've done is Vesper(Nokia 6600S). Languages Chinese Native or bilingual proficiency English Full professional proficiency Chinese Native or bilingual proficiency English Full professional proficiency Chinese Native or bilingual proficiency English Full professional proficiency Native or bilingual proficiency Full professional proficiency Skills Design for Manufacturing Manufacturing Design of Experiments Failure Analysis Product Development Testing Engineering Pro Engineer Electronics Simulations Mechanical Engineering Semiconductors AutoCAD Mobile Devices R&D Manufacturing... Product Design SMT Matlab Smartphones FMEA Catia Verilog Project Management Mechanical Product... SPC C++ SoC Design for Assembly Java Creo Parametric 2.0 Tablets PTC Creo See 18+     See less Skills  Design for Manufacturing Manufacturing Design of Experiments Failure Analysis Product Development Testing Engineering Pro Engineer Electronics Simulations Mechanical Engineering Semiconductors AutoCAD Mobile Devices R&D Manufacturing... Product Design SMT Matlab Smartphones FMEA Catia Verilog Project Management Mechanical Product... SPC C++ SoC Design for Assembly Java Creo Parametric 2.0 Tablets PTC Creo See 18+     See less Design for Manufacturing Manufacturing Design of Experiments Failure Analysis Product Development Testing Engineering Pro Engineer Electronics Simulations Mechanical Engineering Semiconductors AutoCAD Mobile Devices R&D Manufacturing... Product Design SMT Matlab Smartphones FMEA Catia Verilog Project Management Mechanical Product... SPC C++ SoC Design for Assembly Java Creo Parametric 2.0 Tablets PTC Creo See 18+     See less Design for Manufacturing Manufacturing Design of Experiments Failure Analysis Product Development Testing Engineering Pro Engineer Electronics Simulations Mechanical Engineering Semiconductors AutoCAD Mobile Devices R&D Manufacturing... Product Design SMT Matlab Smartphones FMEA Catia Verilog Project Management Mechanical Product... SPC C++ SoC Design for Assembly Java Creo Parametric 2.0 Tablets PTC Creo See 18+     See less Education National Taiwan University Master's degree,  Electrical and Electronics Engineering 2002  – 2005 Activities and Societies:  School Basketball team (PF) National Taiwan University Bachelor of Science (BS),  Mechanical Engineering 1998  – 2002 Activities and Societies:  School Basketball team (PF) National Taiwan University Master's degree,  Electrical and Electronics Engineering 2002  – 2005 Activities and Societies:  School Basketball team (PF) National Taiwan University Master's degree,  Electrical and Electronics Engineering 2002  – 2005 Activities and Societies:  School Basketball team (PF) National Taiwan University Master's degree,  Electrical and Electronics Engineering 2002  – 2005 Activities and Societies:  School Basketball team (PF) National Taiwan University Bachelor of Science (BS),  Mechanical Engineering 1998  – 2002 Activities and Societies:  School Basketball team (PF) National Taiwan University Bachelor of Science (BS),  Mechanical Engineering 1998  – 2002 Activities and Societies:  School Basketball team (PF) National Taiwan University Bachelor of Science (BS),  Mechanical Engineering 1998  – 2002 Activities and Societies:  School Basketball team (PF) ", "Experience Senior Mechanical Engineer Intel Corporation Senior Mechanical Engineer Intel Corporation Senior Mechanical Engineer Intel Corporation Education Oregon Institute of Technology Bachelor's degree,  Mechanical Engineering 1994  – 1996 Oregon Institute of Technology Bachelor's degree,  Mechanical Engineering 1994  – 1996 Oregon Institute of Technology Bachelor's degree,  Mechanical Engineering 1994  – 1996 Oregon Institute of Technology Bachelor's degree,  Mechanical Engineering 1994  – 1996 ", "Experience Oregon Site - Energy Conservation Program Manager Intel Corporation Inc March 1997  – Present (18 years 6 months) Oregon Site - Energy Conservation Program Manager Intel Corporation Inc March 1997  – Present (18 years 6 months) Oregon Site - Energy Conservation Program Manager Intel Corporation Inc March 1997  – Present (18 years 6 months) Skills HVAC Engineering Management Energy Efficiency Engineering Manufacturing Project Engineering Process Engineering Commissioning CAD Mechanical Engineering Electrical Engineering Renewable Energy Lean Manufacturing Energy Management Contract Management Skills  HVAC Engineering Management Energy Efficiency Engineering Manufacturing Project Engineering Process Engineering Commissioning CAD Mechanical Engineering Electrical Engineering Renewable Energy Lean Manufacturing Energy Management Contract Management HVAC Engineering Management Energy Efficiency Engineering Manufacturing Project Engineering Process Engineering Commissioning CAD Mechanical Engineering Electrical Engineering Renewable Energy Lean Manufacturing Energy Management Contract Management HVAC Engineering Management Energy Efficiency Engineering Manufacturing Project Engineering Process Engineering Commissioning CAD Mechanical Engineering Electrical Engineering Renewable Energy Lean Manufacturing Energy Management Contract Management Education Portland State University Master of Science (MS),  Mechanical Engineering Portland State University Master of Science (MS),  Mechanical Engineering Portland State University Master of Science (MS),  Mechanical Engineering Portland State University Master of Science (MS),  Mechanical Engineering ", "Summary I am a technophile that always keeps an eye on the horizon. Good design is a result of challenge and constructive conflict. Well designed products disappear leaving the users with the experience. Summary I am a technophile that always keeps an eye on the horizon. Good design is a result of challenge and constructive conflict. Well designed products disappear leaving the users with the experience. I am a technophile that always keeps an eye on the horizon. Good design is a result of challenge and constructive conflict. Well designed products disappear leaving the users with the experience. I am a technophile that always keeps an eye on the horizon. Good design is a result of challenge and constructive conflict. Well designed products disappear leaving the users with the experience. Experience Senior Mechanical Engineer Intel Corporation July 2006  – Present (9 years 2 months) System Level Thermal-Mechanical Analysis for Notebook PCs. \nThermal Test Vehicle design and development. \nTest Device Program Development and Management. \nPlatform Customer Thermal Communications and Enabling. \nTechnical Marketing Support at Intel Developer Forum. \nReference Design Mechanical Component Engineering focusing on Display and Touch Sensor technologies. Mechanical Engineer Blount April 2004  –  September 2004  (6 months) Assembly area lean improvements. \nDesigned and Manufactured a Lean and Ergonomic assembly cell for the Replaceable Sprocket Nose in the Industrial Harvester Bar division. Senior Mechanical Engineer Intel Corporation July 2006  – Present (9 years 2 months) System Level Thermal-Mechanical Analysis for Notebook PCs. \nThermal Test Vehicle design and development. \nTest Device Program Development and Management. \nPlatform Customer Thermal Communications and Enabling. \nTechnical Marketing Support at Intel Developer Forum. \nReference Design Mechanical Component Engineering focusing on Display and Touch Sensor technologies. Senior Mechanical Engineer Intel Corporation July 2006  – Present (9 years 2 months) System Level Thermal-Mechanical Analysis for Notebook PCs. \nThermal Test Vehicle design and development. \nTest Device Program Development and Management. \nPlatform Customer Thermal Communications and Enabling. \nTechnical Marketing Support at Intel Developer Forum. \nReference Design Mechanical Component Engineering focusing on Display and Touch Sensor technologies. Mechanical Engineer Blount April 2004  –  September 2004  (6 months) Assembly area lean improvements. \nDesigned and Manufactured a Lean and Ergonomic assembly cell for the Replaceable Sprocket Nose in the Industrial Harvester Bar division. Mechanical Engineer Blount April 2004  –  September 2004  (6 months) Assembly area lean improvements. \nDesigned and Manufactured a Lean and Ergonomic assembly cell for the Replaceable Sprocket Nose in the Industrial Harvester Bar division. Languages Spanish Spanish Spanish Skills Mechanical Product... Structural Analysis Thermal System Design NI LabVIEW Pro Engineer Solidworks Flotherm Abaqus Rapid Prototyping Tablets Product Design Solid Modeling Program Management Process Engineering Electronics Packaging PCB layout design PCB design Injection Molding CNC Machine Design for Manufacturing Thermal Thermal Analysis Tolerance Analysis Thermodynamics Engineering Finite Element Analysis Sheet Metal GD Mechanical Engineering Matlab PTC Creo See 16+     See less Skills  Mechanical Product... Structural Analysis Thermal System Design NI LabVIEW Pro Engineer Solidworks Flotherm Abaqus Rapid Prototyping Tablets Product Design Solid Modeling Program Management Process Engineering Electronics Packaging PCB layout design PCB design Injection Molding CNC Machine Design for Manufacturing Thermal Thermal Analysis Tolerance Analysis Thermodynamics Engineering Finite Element Analysis Sheet Metal GD Mechanical Engineering Matlab PTC Creo See 16+     See less Mechanical Product... Structural Analysis Thermal System Design NI LabVIEW Pro Engineer Solidworks Flotherm Abaqus Rapid Prototyping Tablets Product Design Solid Modeling Program Management Process Engineering Electronics Packaging PCB layout design PCB design Injection Molding CNC Machine Design for Manufacturing Thermal Thermal Analysis Tolerance Analysis Thermodynamics Engineering Finite Element Analysis Sheet Metal GD Mechanical Engineering Matlab PTC Creo See 16+     See less Mechanical Product... Structural Analysis Thermal System Design NI LabVIEW Pro Engineer Solidworks Flotherm Abaqus Rapid Prototyping Tablets Product Design Solid Modeling Program Management Process Engineering Electronics Packaging PCB layout design PCB design Injection Molding CNC Machine Design for Manufacturing Thermal Thermal Analysis Tolerance Analysis Thermodynamics Engineering Finite Element Analysis Sheet Metal GD Mechanical Engineering Matlab PTC Creo See 16+     See less Education Oregon State University Bachelor of Science (BS),  Mechanical Engineering 2000  – 2006 Oregon State University Bachelor of Science (BS),  Mechanical Engineering 2000  – 2006 Oregon State University Bachelor of Science (BS),  Mechanical Engineering 2000  – 2006 Oregon State University Bachelor of Science (BS),  Mechanical Engineering 2000  – 2006 ", "Skills Solidworks Product Development Manufacturing Pro Engineer Finite Element Analysis Injection Molding Sheet Metal Tolerance Analysis Engineering Design for Manufacturing Testing Product Design FMEA Failure Analysis Mechanical Engineering Thermal Cross-functional Team... Electronics SPC Design of Experiments Manufacturing... Root Cause Analysis Six Sigma R&D GD&T Simulations See 11+     See less Skills  Solidworks Product Development Manufacturing Pro Engineer Finite Element Analysis Injection Molding Sheet Metal Tolerance Analysis Engineering Design for Manufacturing Testing Product Design FMEA Failure Analysis Mechanical Engineering Thermal Cross-functional Team... Electronics SPC Design of Experiments Manufacturing... Root Cause Analysis Six Sigma R&D GD&T Simulations See 11+     See less Solidworks Product Development Manufacturing Pro Engineer Finite Element Analysis Injection Molding Sheet Metal Tolerance Analysis Engineering Design for Manufacturing Testing Product Design FMEA Failure Analysis Mechanical Engineering Thermal Cross-functional Team... Electronics SPC Design of Experiments Manufacturing... Root Cause Analysis Six Sigma R&D GD&T Simulations See 11+     See less Solidworks Product Development Manufacturing Pro Engineer Finite Element Analysis Injection Molding Sheet Metal Tolerance Analysis Engineering Design for Manufacturing Testing Product Design FMEA Failure Analysis Mechanical Engineering Thermal Cross-functional Team... Electronics SPC Design of Experiments Manufacturing... Root Cause Analysis Six Sigma R&D GD&T Simulations See 11+     See less Honors & Awards ", "Experience Senior Mechanical Engineer Department of the Army September 2011  –  January 2013  (1 year 5 months) Mechanical Engineer Department of the Army September 2008  –  September 2011  (3 years 1 month) Service Manager DACom Systems, Inc. 2000  –  2002  (2 years) Senior Mechanical Engineer Department of the Army September 2011  –  January 2013  (1 year 5 months) Senior Mechanical Engineer Department of the Army September 2011  –  January 2013  (1 year 5 months) Mechanical Engineer Department of the Army September 2008  –  September 2011  (3 years 1 month) Mechanical Engineer Department of the Army September 2008  –  September 2011  (3 years 1 month) Service Manager DACom Systems, Inc. 2000  –  2002  (2 years) Service Manager DACom Systems, Inc. 2000  –  2002  (2 years) Skills Finite Element Analysis ANSYS Mechanical Engineering Mechanics Hydraulics MathCAD CAD Engineering Management Metal Fabrication Labview Simulations Engineering Solidworks HVAC Project Engineering Design for Manufacturing Heat Transfer Root Cause Analysis AutoCAD Thermodynamics Automation Equipment Maintenance Solid Modeling Mathematica SPC Materials Science Stress Analysis AutoCAD Mechanical Engineering Design Thermal See 15+     See less Skills  Finite Element Analysis ANSYS Mechanical Engineering Mechanics Hydraulics MathCAD CAD Engineering Management Metal Fabrication Labview Simulations Engineering Solidworks HVAC Project Engineering Design for Manufacturing Heat Transfer Root Cause Analysis AutoCAD Thermodynamics Automation Equipment Maintenance Solid Modeling Mathematica SPC Materials Science Stress Analysis AutoCAD Mechanical Engineering Design Thermal See 15+     See less Finite Element Analysis ANSYS Mechanical Engineering Mechanics Hydraulics MathCAD CAD Engineering Management Metal Fabrication Labview Simulations Engineering Solidworks HVAC Project Engineering Design for Manufacturing Heat Transfer Root Cause Analysis AutoCAD Thermodynamics Automation Equipment Maintenance Solid Modeling Mathematica SPC Materials Science Stress Analysis AutoCAD Mechanical Engineering Design Thermal See 15+     See less Finite Element Analysis ANSYS Mechanical Engineering Mechanics Hydraulics MathCAD CAD Engineering Management Metal Fabrication Labview Simulations Engineering Solidworks HVAC Project Engineering Design for Manufacturing Heat Transfer Root Cause Analysis AutoCAD Thermodynamics Automation Equipment Maintenance Solid Modeling Mathematica SPC Materials Science Stress Analysis AutoCAD Mechanical Engineering Design Thermal See 15+     See less Education Universidad de Puerto Rico BSME,  Mechanical Engineering 1998  – 2004 Activities and Societies:  Member of Tau Beta Pi ,  Golden Key International Honor Society ,  ASME and the Institute of Mechanical Engineers Universidad de Puerto Rico BSME,  Mechanical Engineering 1998  – 2004 Activities and Societies:  Member of Tau Beta Pi ,  Golden Key International Honor Society ,  ASME and the Institute of Mechanical Engineers Universidad de Puerto Rico BSME,  Mechanical Engineering 1998  – 2004 Activities and Societies:  Member of Tau Beta Pi ,  Golden Key International Honor Society ,  ASME and the Institute of Mechanical Engineers Universidad de Puerto Rico BSME,  Mechanical Engineering 1998  – 2004 Activities and Societies:  Member of Tau Beta Pi ,  Golden Key International Honor Society ,  ASME and the Institute of Mechanical Engineers ", "Summary Over 20 years of experience in competitive mechanical designs and process/manufacturing in new technology research, aerospace, hydraulics components, consumer electronics mobile devices. \n \n2012 - Present - Senior mechanical engineer Intel corporation \n2007 –2011– Development Senior mechanical Engineer, Mobile Devices, Motorola \n2005-2007 – Supply chain senior mechanical engineer, Mobile Devices Motorola. \n2000 – 2005 – DFM, DFX and Project Management Engineer, covering high precision aerospace assemblies; Waltz Bros Inc, Chicago IL  \n1999- 2000 – Hands on, Manufacturing and Process Engineer; tool and die company, Chicago \n1991-1998 – Mechanical design engineer, National Institute of research for Technical Physics, Romania \n \nSpecialties: Six Sigma, Green Belt Certified \nPRO_E and Solid-works, proficient \nTolerance Analysis \nTooling, manufacturing experience Summary Over 20 years of experience in competitive mechanical designs and process/manufacturing in new technology research, aerospace, hydraulics components, consumer electronics mobile devices. \n \n2012 - Present - Senior mechanical engineer Intel corporation \n2007 –2011– Development Senior mechanical Engineer, Mobile Devices, Motorola \n2005-2007 – Supply chain senior mechanical engineer, Mobile Devices Motorola. \n2000 – 2005 – DFM, DFX and Project Management Engineer, covering high precision aerospace assemblies; Waltz Bros Inc, Chicago IL  \n1999- 2000 – Hands on, Manufacturing and Process Engineer; tool and die company, Chicago \n1991-1998 – Mechanical design engineer, National Institute of research for Technical Physics, Romania \n \nSpecialties: Six Sigma, Green Belt Certified \nPRO_E and Solid-works, proficient \nTolerance Analysis \nTooling, manufacturing experience Over 20 years of experience in competitive mechanical designs and process/manufacturing in new technology research, aerospace, hydraulics components, consumer electronics mobile devices. \n \n2012 - Present - Senior mechanical engineer Intel corporation \n2007 –2011– Development Senior mechanical Engineer, Mobile Devices, Motorola \n2005-2007 – Supply chain senior mechanical engineer, Mobile Devices Motorola. \n2000 – 2005 – DFM, DFX and Project Management Engineer, covering high precision aerospace assemblies; Waltz Bros Inc, Chicago IL  \n1999- 2000 – Hands on, Manufacturing and Process Engineer; tool and die company, Chicago \n1991-1998 – Mechanical design engineer, National Institute of research for Technical Physics, Romania \n \nSpecialties: Six Sigma, Green Belt Certified \nPRO_E and Solid-works, proficient \nTolerance Analysis \nTooling, manufacturing experience Over 20 years of experience in competitive mechanical designs and process/manufacturing in new technology research, aerospace, hydraulics components, consumer electronics mobile devices. \n \n2012 - Present - Senior mechanical engineer Intel corporation \n2007 –2011– Development Senior mechanical Engineer, Mobile Devices, Motorola \n2005-2007 – Supply chain senior mechanical engineer, Mobile Devices Motorola. \n2000 – 2005 – DFM, DFX and Project Management Engineer, covering high precision aerospace assemblies; Waltz Bros Inc, Chicago IL  \n1999- 2000 – Hands on, Manufacturing and Process Engineer; tool and die company, Chicago \n1991-1998 – Mechanical design engineer, National Institute of research for Technical Physics, Romania \n \nSpecialties: Six Sigma, Green Belt Certified \nPRO_E and Solid-works, proficient \nTolerance Analysis \nTooling, manufacturing experience Experience Mechanical Design Engineer Intel Corporation January 2012  – Present (3 years 8 months) San Francisco Bay area Senior Mechanical Design Engineer Motorola Mobility March 2007  –  January 2012  (4 years 11 months) Libertyville IL Interfaced with Audio team and covered the audio requirements (seal and volume chamber) for an android smart phone for best in class experience. \nDesigned and optimized critical structural parts of the phone metal chassis, to assure LCD and other sensitive components are not being damaged during life of the product. \nMB520 android rotator smartphone \nDesign of the rotator mechanism and adjacent housings \nOptimized the opening and close motion of the blade for a best in class experience for customers. \nV13 Clam Style phone:  \n* Colaborated on LCD design and optimized the housing fit to prevent LCD from cracking during DTF testing. \n*Design the GPS antenna and contact clips. Supply Chain Senior Mechanical Engineer Motorola October 2005  –  February 2007  (1 year 5 months) Libertyville IL Part of the Supply Chain organization. Worked with the development team, factory personnel and suppliers in China on the construction of Z3, Z6 Slide style mobile phones including assembly process, fixtures, testing and verification, from first prototype builds through product launch.Conducted DOE's and FMEA for Process optimization. \nFully support for the assembly process on Rokr EM35. Multiple trips to China working hands on with suppliers EMS suppliers for process optimization yield increase and DPHU reduction. Manufacturing and Process Management Engineer WALTZ BROTHERS INC December 2000  –  October 2005  (4 years 11 months) Fixtures and Tooling Design for Manufacturing of High precision OEM replacement parts for Aerospace industry. \n-Reverse engineering of OEM parts for aerospace industry. \n-Create the manufacturing process including feasibility studies for high precision aerospace parts. \nConducted PFMEA, PPAP, SPC and 8D evaluation processes. \nDeveloped clear requirements for outside operations managing and cooperating with suppliers in achieving all the required certifications normally applied to critical aerospace assemblies and parts. Mechanical Design Engineer Intel Corporation January 2012  – Present (3 years 8 months) San Francisco Bay area Mechanical Design Engineer Intel Corporation January 2012  – Present (3 years 8 months) San Francisco Bay area Senior Mechanical Design Engineer Motorola Mobility March 2007  –  January 2012  (4 years 11 months) Libertyville IL Interfaced with Audio team and covered the audio requirements (seal and volume chamber) for an android smart phone for best in class experience. \nDesigned and optimized critical structural parts of the phone metal chassis, to assure LCD and other sensitive components are not being damaged during life of the product. \nMB520 android rotator smartphone \nDesign of the rotator mechanism and adjacent housings \nOptimized the opening and close motion of the blade for a best in class experience for customers. \nV13 Clam Style phone:  \n* Colaborated on LCD design and optimized the housing fit to prevent LCD from cracking during DTF testing. \n*Design the GPS antenna and contact clips. Senior Mechanical Design Engineer Motorola Mobility March 2007  –  January 2012  (4 years 11 months) Libertyville IL Interfaced with Audio team and covered the audio requirements (seal and volume chamber) for an android smart phone for best in class experience. \nDesigned and optimized critical structural parts of the phone metal chassis, to assure LCD and other sensitive components are not being damaged during life of the product. \nMB520 android rotator smartphone \nDesign of the rotator mechanism and adjacent housings \nOptimized the opening and close motion of the blade for a best in class experience for customers. \nV13 Clam Style phone:  \n* Colaborated on LCD design and optimized the housing fit to prevent LCD from cracking during DTF testing. \n*Design the GPS antenna and contact clips. Supply Chain Senior Mechanical Engineer Motorola October 2005  –  February 2007  (1 year 5 months) Libertyville IL Part of the Supply Chain organization. Worked with the development team, factory personnel and suppliers in China on the construction of Z3, Z6 Slide style mobile phones including assembly process, fixtures, testing and verification, from first prototype builds through product launch.Conducted DOE's and FMEA for Process optimization. \nFully support for the assembly process on Rokr EM35. Multiple trips to China working hands on with suppliers EMS suppliers for process optimization yield increase and DPHU reduction. Supply Chain Senior Mechanical Engineer Motorola October 2005  –  February 2007  (1 year 5 months) Libertyville IL Part of the Supply Chain organization. Worked with the development team, factory personnel and suppliers in China on the construction of Z3, Z6 Slide style mobile phones including assembly process, fixtures, testing and verification, from first prototype builds through product launch.Conducted DOE's and FMEA for Process optimization. \nFully support for the assembly process on Rokr EM35. Multiple trips to China working hands on with suppliers EMS suppliers for process optimization yield increase and DPHU reduction. Manufacturing and Process Management Engineer WALTZ BROTHERS INC December 2000  –  October 2005  (4 years 11 months) Fixtures and Tooling Design for Manufacturing of High precision OEM replacement parts for Aerospace industry. \n-Reverse engineering of OEM parts for aerospace industry. \n-Create the manufacturing process including feasibility studies for high precision aerospace parts. \nConducted PFMEA, PPAP, SPC and 8D evaluation processes. \nDeveloped clear requirements for outside operations managing and cooperating with suppliers in achieving all the required certifications normally applied to critical aerospace assemblies and parts. Manufacturing and Process Management Engineer WALTZ BROTHERS INC December 2000  –  October 2005  (4 years 11 months) Fixtures and Tooling Design for Manufacturing of High precision OEM replacement parts for Aerospace industry. \n-Reverse engineering of OEM parts for aerospace industry. \n-Create the manufacturing process including feasibility studies for high precision aerospace parts. \nConducted PFMEA, PPAP, SPC and 8D evaluation processes. \nDeveloped clear requirements for outside operations managing and cooperating with suppliers in achieving all the required certifications normally applied to critical aerospace assemblies and parts. Skills Tolerance Analysis Know How Green Belt Six Sigma SPC Design of Experiments Design for Manufacturing Manufacturing Solidworks Product Design Mechanical Engineering Testing Product Development PPAP Pro Engineer FMEA SolidWorks PTC Creo See 3+     See less Skills  Tolerance Analysis Know How Green Belt Six Sigma SPC Design of Experiments Design for Manufacturing Manufacturing Solidworks Product Design Mechanical Engineering Testing Product Development PPAP Pro Engineer FMEA SolidWorks PTC Creo See 3+     See less Tolerance Analysis Know How Green Belt Six Sigma SPC Design of Experiments Design for Manufacturing Manufacturing Solidworks Product Design Mechanical Engineering Testing Product Development PPAP Pro Engineer FMEA SolidWorks PTC Creo See 3+     See less Tolerance Analysis Know How Green Belt Six Sigma SPC Design of Experiments Design for Manufacturing Manufacturing Solidworks Product Design Mechanical Engineering Testing Product Development PPAP Pro Engineer FMEA SolidWorks PTC Creo See 3+     See less Education Universitatea Tehnică „Gh. Asachi” din Iași Master Equivalent,  Mechanical Engineering 1985  – 1991 MOTOROLA UNIVERSITY SIX SIGMA GREEN BELT CERTIFIED,  Design for Six Sigma DFSS and DMAIC curriculum: Concept , Design, Optimize, Verify. 2007  – 2010 Universitatea Tehnică „Gh. Asachi” din Iași Master Equivalent,  Mechanical Engineering 1985  – 1991 Universitatea Tehnică „Gh. Asachi” din Iași Master Equivalent,  Mechanical Engineering 1985  – 1991 Universitatea Tehnică „Gh. Asachi” din Iași Master Equivalent,  Mechanical Engineering 1985  – 1991 MOTOROLA UNIVERSITY SIX SIGMA GREEN BELT CERTIFIED,  Design for Six Sigma DFSS and DMAIC curriculum: Concept , Design, Optimize, Verify. 2007  – 2010 MOTOROLA UNIVERSITY SIX SIGMA GREEN BELT CERTIFIED,  Design for Six Sigma DFSS and DMAIC curriculum: Concept , Design, Optimize, Verify. 2007  – 2010 MOTOROLA UNIVERSITY SIX SIGMA GREEN BELT CERTIFIED,  Design for Six Sigma DFSS and DMAIC curriculum: Concept , Design, Optimize, Verify. 2007  – 2010 ", "Summary Su Yan is an accomplished electro-mechanic design engineer, who has multidisciplinary knowledge and strong experience on RF medical device R& D, Design of Experience (DOE), Design for Manufacture (DOM) and statics analyses, six sigma process improvement experiences in electro-mechanic device/products. \n \nAlso, she has strong knowledge and skills in system vibration control and precision positioning, which includes system modeling, system identification, advance control, system simulation, control system architecture design, control software development, control system implementation. \n Summary Su Yan is an accomplished electro-mechanic design engineer, who has multidisciplinary knowledge and strong experience on RF medical device R& D, Design of Experience (DOE), Design for Manufacture (DOM) and statics analyses, six sigma process improvement experiences in electro-mechanic device/products. \n \nAlso, she has strong knowledge and skills in system vibration control and precision positioning, which includes system modeling, system identification, advance control, system simulation, control system architecture design, control software development, control system implementation. \n Su Yan is an accomplished electro-mechanic design engineer, who has multidisciplinary knowledge and strong experience on RF medical device R& D, Design of Experience (DOE), Design for Manufacture (DOM) and statics analyses, six sigma process improvement experiences in electro-mechanic device/products. \n \nAlso, she has strong knowledge and skills in system vibration control and precision positioning, which includes system modeling, system identification, advance control, system simulation, control system architecture design, control software development, control system implementation. \n Su Yan is an accomplished electro-mechanic design engineer, who has multidisciplinary knowledge and strong experience on RF medical device R& D, Design of Experience (DOE), Design for Manufacture (DOM) and statics analyses, six sigma process improvement experiences in electro-mechanic device/products. \n \nAlso, she has strong knowledge and skills in system vibration control and precision positioning, which includes system modeling, system identification, advance control, system simulation, control system architecture design, control software development, control system implementation. \n Experience Senior Mechanical Engineer Intel Corporation December 2012  – Present (2 years 9 months) Hillsboro, OR Electro-mechanical Designs and RF EMI/EMC Simulation for Wifi, blue tooth, wireless products used in laptops, desktops, tablets, ultra-books and mobile device. Hardware Engineer Lam Research July 2012  –  December 2012  (6 months) Portland, Oregon Area Development Engineer for Surgical Device Tyco Electronics February 2008  –  January 2012  (4 years) Wilsonville, OR New Product Introduction (NPI) project with hands-on technical design skill for the new electro-mechanical products, connectors, cable, EMI and EMC sheet metal and the PCB, including 2D/3D modeling, design for manufacture (DFM), optimization design based on design of experiments (DOE) and strong knowledge of Geometric Dimensioning & Tolerance (GD&T). Research Assistant Intelligent and Composite Materials Laboratory (ICML) at University of Hawaii January 2001  –  December 2007  (7 years) Honolulu, HI Develop and design the precision mechanism;Possess strong understanding in all facets of machine Creation to include Design, development, research, engineering, Materials, and manufacturing. Hands on experience in a manufacturing environment. Stress/strain analysis and dynamic analysis. Finite Element Analysis (FEA) of dynamic and static analysis. \n Product Development Engineer (PDE) Technical Center, China Yituo Group, Co., China June 1999  –  December 2000  (1 year 7 months) Luoyang, P.R. China Finite Element Analysis of the strength, fatigue, stress-strain for the vehicle chassis components and driven shafts and Design of the body frames, the transmission shafts, the final drives, and the suspension.  \n Process Engineer Technical Center, China Yituo Group, Co., China June 1994  –  May 1999  (5 years) Luoyang, P.R.China Lead the transition of chassis-based products and new assembly processes from prototype to volume production. and Characterize optical assemblies and provide feedback to the development team with written and verbal technical reports. Take ownership of equipment and product on key production lines.Lead process FMEA with cross functional teams. Identify, evaluate, procure and qualify new equipment and fixtures. \n Senior Mechanical Engineer Intel Corporation December 2012  – Present (2 years 9 months) Hillsboro, OR Electro-mechanical Designs and RF EMI/EMC Simulation for Wifi, blue tooth, wireless products used in laptops, desktops, tablets, ultra-books and mobile device. Senior Mechanical Engineer Intel Corporation December 2012  – Present (2 years 9 months) Hillsboro, OR Electro-mechanical Designs and RF EMI/EMC Simulation for Wifi, blue tooth, wireless products used in laptops, desktops, tablets, ultra-books and mobile device. Hardware Engineer Lam Research July 2012  –  December 2012  (6 months) Portland, Oregon Area Hardware Engineer Lam Research July 2012  –  December 2012  (6 months) Portland, Oregon Area Development Engineer for Surgical Device Tyco Electronics February 2008  –  January 2012  (4 years) Wilsonville, OR New Product Introduction (NPI) project with hands-on technical design skill for the new electro-mechanical products, connectors, cable, EMI and EMC sheet metal and the PCB, including 2D/3D modeling, design for manufacture (DFM), optimization design based on design of experiments (DOE) and strong knowledge of Geometric Dimensioning & Tolerance (GD&T). Development Engineer for Surgical Device Tyco Electronics February 2008  –  January 2012  (4 years) Wilsonville, OR New Product Introduction (NPI) project with hands-on technical design skill for the new electro-mechanical products, connectors, cable, EMI and EMC sheet metal and the PCB, including 2D/3D modeling, design for manufacture (DFM), optimization design based on design of experiments (DOE) and strong knowledge of Geometric Dimensioning & Tolerance (GD&T). Research Assistant Intelligent and Composite Materials Laboratory (ICML) at University of Hawaii January 2001  –  December 2007  (7 years) Honolulu, HI Develop and design the precision mechanism;Possess strong understanding in all facets of machine Creation to include Design, development, research, engineering, Materials, and manufacturing. Hands on experience in a manufacturing environment. Stress/strain analysis and dynamic analysis. Finite Element Analysis (FEA) of dynamic and static analysis. \n Research Assistant Intelligent and Composite Materials Laboratory (ICML) at University of Hawaii January 2001  –  December 2007  (7 years) Honolulu, HI Develop and design the precision mechanism;Possess strong understanding in all facets of machine Creation to include Design, development, research, engineering, Materials, and manufacturing. Hands on experience in a manufacturing environment. Stress/strain analysis and dynamic analysis. Finite Element Analysis (FEA) of dynamic and static analysis. \n Product Development Engineer (PDE) Technical Center, China Yituo Group, Co., China June 1999  –  December 2000  (1 year 7 months) Luoyang, P.R. China Finite Element Analysis of the strength, fatigue, stress-strain for the vehicle chassis components and driven shafts and Design of the body frames, the transmission shafts, the final drives, and the suspension.  \n Product Development Engineer (PDE) Technical Center, China Yituo Group, Co., China June 1999  –  December 2000  (1 year 7 months) Luoyang, P.R. China Finite Element Analysis of the strength, fatigue, stress-strain for the vehicle chassis components and driven shafts and Design of the body frames, the transmission shafts, the final drives, and the suspension.  \n Process Engineer Technical Center, China Yituo Group, Co., China June 1994  –  May 1999  (5 years) Luoyang, P.R.China Lead the transition of chassis-based products and new assembly processes from prototype to volume production. and Characterize optical assemblies and provide feedback to the development team with written and verbal technical reports. Take ownership of equipment and product on key production lines.Lead process FMEA with cross functional teams. Identify, evaluate, procure and qualify new equipment and fixtures. \n Process Engineer Technical Center, China Yituo Group, Co., China June 1994  –  May 1999  (5 years) Luoyang, P.R.China Lead the transition of chassis-based products and new assembly processes from prototype to volume production. and Characterize optical assemblies and provide feedback to the development team with written and verbal technical reports. Take ownership of equipment and product on key production lines.Lead process FMEA with cross functional teams. Identify, evaluate, procure and qualify new equipment and fixtures. \n Skills Finite Element Analysis Pro/Engineer ANSYS Structural Mechanics Numerical Simulation Agilent ADS OrCAD Capture CIS Cadence Allegro Pro Engineer Manufacturing Product Development Cadence FMEA Design of Experiments Lean Manufacturing Six Sigma GD&T Testing Geometric Dimensioning... PTC Creo Electronics See 6+     See less Skills  Finite Element Analysis Pro/Engineer ANSYS Structural Mechanics Numerical Simulation Agilent ADS OrCAD Capture CIS Cadence Allegro Pro Engineer Manufacturing Product Development Cadence FMEA Design of Experiments Lean Manufacturing Six Sigma GD&T Testing Geometric Dimensioning... PTC Creo Electronics See 6+     See less Finite Element Analysis Pro/Engineer ANSYS Structural Mechanics Numerical Simulation Agilent ADS OrCAD Capture CIS Cadence Allegro Pro Engineer Manufacturing Product Development Cadence FMEA Design of Experiments Lean Manufacturing Six Sigma GD&T Testing Geometric Dimensioning... PTC Creo Electronics See 6+     See less Finite Element Analysis Pro/Engineer ANSYS Structural Mechanics Numerical Simulation Agilent ADS OrCAD Capture CIS Cadence Allegro Pro Engineer Manufacturing Product Development Cadence FMEA Design of Experiments Lean Manufacturing Six Sigma GD&T Testing Geometric Dimensioning... PTC Creo Electronics See 6+     See less Education Jilin University Master,  Vehicle Ergonomics Engineering University of Hawaii at Manoa Ph.D,  Mechanical Engineering Activities and Societies:  - Intelligent Composite Structure Development and design\n- Stress/strain analysis and dynamic analysis.\n- Finite Element Analysis (FEA) of dynamic and static analysis.\n- Actuator/Sensor optimization design and system optimization.\n- PLC design and algorithm program.\n- Simulation and real-time position control. Jilin University Master,  Vehicle Ergonomics Engineering Jilin University Master,  Vehicle Ergonomics Engineering Jilin University Master,  Vehicle Ergonomics Engineering University of Hawaii at Manoa Ph.D,  Mechanical Engineering Activities and Societies:  - Intelligent Composite Structure Development and design\n- Stress/strain analysis and dynamic analysis.\n- Finite Element Analysis (FEA) of dynamic and static analysis.\n- Actuator/Sensor optimization design and system optimization.\n- PLC design and algorithm program.\n- Simulation and real-time position control. University of Hawaii at Manoa Ph.D,  Mechanical Engineering Activities and Societies:  - Intelligent Composite Structure Development and design\n- Stress/strain analysis and dynamic analysis.\n- Finite Element Analysis (FEA) of dynamic and static analysis.\n- Actuator/Sensor optimization design and system optimization.\n- PLC design and algorithm program.\n- Simulation and real-time position control. University of Hawaii at Manoa Ph.D,  Mechanical Engineering Activities and Societies:  - Intelligent Composite Structure Development and design\n- Stress/strain analysis and dynamic analysis.\n- Finite Element Analysis (FEA) of dynamic and static analysis.\n- Actuator/Sensor optimization design and system optimization.\n- PLC design and algorithm program.\n- Simulation and real-time position control. ", "Experience Senior Mechanical Engineer Intel Corporation April 2014  – Present (1 year 5 months) Santa Clara, CA Intel Media -> Verizon Mechanical Engineer Sparkfactor Design 2005  – Present (10 years) Mechanical Engineer Alloy Product Development 2011  –  August 2013  (2 years) Mechanical Engineer Contractor Palm 2009  –  July 2011  (2 years) Sr.Mechanical Engineer Apple 2001  –  2005  (4 years) Sr. Mechanical Engineer Apple Computer 2001  –  2005  (4 years) Sr. Mechanical Engineer Lunar Design 1999  –  2001  (2 years) Mechanical Engineer Palo Alto Products 1995  –  1999  (4 years) Mechanical Engineer PADG/Flextronics Design 1995  –  1999  (4 years) Mechanical Engineer Palo Alto Design Group 1994  –  1999  (5 years) Mechanical Engineer Consultant MicroUnity Systems Engineering 1995  –  1996  (1 year) Mechanical Engineer Acuson/Siemens 1994  –  1995  (1 year) Mechanical Engineer Amdahl 1988  –  1994  (6 years) Mechanical Engineer Lightgate / Altra 1987  –  1988  (1 year) Senior Mechanical Engineer Intel Corporation April 2014  – Present (1 year 5 months) Santa Clara, CA Intel Media -> Verizon Senior Mechanical Engineer Intel Corporation April 2014  – Present (1 year 5 months) Santa Clara, CA Intel Media -> Verizon Mechanical Engineer Sparkfactor Design 2005  – Present (10 years) Mechanical Engineer Sparkfactor Design 2005  – Present (10 years) Mechanical Engineer Alloy Product Development 2011  –  August 2013  (2 years) Mechanical Engineer Alloy Product Development 2011  –  August 2013  (2 years) Mechanical Engineer Contractor Palm 2009  –  July 2011  (2 years) Mechanical Engineer Contractor Palm 2009  –  July 2011  (2 years) Sr.Mechanical Engineer Apple 2001  –  2005  (4 years) Sr.Mechanical Engineer Apple 2001  –  2005  (4 years) Sr. Mechanical Engineer Apple Computer 2001  –  2005  (4 years) Sr. Mechanical Engineer Apple Computer 2001  –  2005  (4 years) Sr. Mechanical Engineer Lunar Design 1999  –  2001  (2 years) Sr. Mechanical Engineer Lunar Design 1999  –  2001  (2 years) Mechanical Engineer Palo Alto Products 1995  –  1999  (4 years) Mechanical Engineer Palo Alto Products 1995  –  1999  (4 years) Mechanical Engineer PADG/Flextronics Design 1995  –  1999  (4 years) Mechanical Engineer PADG/Flextronics Design 1995  –  1999  (4 years) Mechanical Engineer Palo Alto Design Group 1994  –  1999  (5 years) Mechanical Engineer Palo Alto Design Group 1994  –  1999  (5 years) Mechanical Engineer Consultant MicroUnity Systems Engineering 1995  –  1996  (1 year) Mechanical Engineer Consultant MicroUnity Systems Engineering 1995  –  1996  (1 year) Mechanical Engineer Acuson/Siemens 1994  –  1995  (1 year) Mechanical Engineer Acuson/Siemens 1994  –  1995  (1 year) Mechanical Engineer Amdahl 1988  –  1994  (6 years) Mechanical Engineer Amdahl 1988  –  1994  (6 years) Mechanical Engineer Lightgate / Altra 1987  –  1988  (1 year) Mechanical Engineer Lightgate / Altra 1987  –  1988  (1 year) Skills Design for Manufacturing Rapid Prototyping Product Design Concept Development Consumer Electronics Metal Fabrication Solid Modeling Product Development CAD Injection Molding Mechanical Engineering Industrial Design Solidworks Sheet Metal Finite Element Analysis Unigraphics Pro Engineer Engineering Management Mechanism Design Design for Assembly Tolerance Analysis Design Thinking GD&T Machining Machine Design PTC Creo See 11+     See less Skills  Design for Manufacturing Rapid Prototyping Product Design Concept Development Consumer Electronics Metal Fabrication Solid Modeling Product Development CAD Injection Molding Mechanical Engineering Industrial Design Solidworks Sheet Metal Finite Element Analysis Unigraphics Pro Engineer Engineering Management Mechanism Design Design for Assembly Tolerance Analysis Design Thinking GD&T Machining Machine Design PTC Creo See 11+     See less Design for Manufacturing Rapid Prototyping Product Design Concept Development Consumer Electronics Metal Fabrication Solid Modeling Product Development CAD Injection Molding Mechanical Engineering Industrial Design Solidworks Sheet Metal Finite Element Analysis Unigraphics Pro Engineer Engineering Management Mechanism Design Design for Assembly Tolerance Analysis Design Thinking GD&T Machining Machine Design PTC Creo See 11+     See less Design for Manufacturing Rapid Prototyping Product Design Concept Development Consumer Electronics Metal Fabrication Solid Modeling Product Development CAD Injection Molding Mechanical Engineering Industrial Design Solidworks Sheet Metal Finite Element Analysis Unigraphics Pro Engineer Engineering Management Mechanism Design Design for Assembly Tolerance Analysis Design Thinking GD&T Machining Machine Design PTC Creo See 11+     See less Education University of California, Berkeley 1985  – 1987 University of California, Berkeley 1985  – 1987 University of California, Berkeley 1985  – 1987 University of California, Berkeley 1985  – 1987 ", "Experience Senior Mechanical Engineer Intel Corporation January 2015  – Present (8 months) Data Center Group Mechanical Engineer Hewlett-Packard November 2000  –  December 2014  (14 years 2 months) Senior Mechanical Engineer SCP Global Technologies May 1999  –  November 2000  (1 year 7 months) Design Engineer Kenworth Truck Company May 1998  –  April 1999  (1 year) Project Mechanical Engineer Advanced Silicon Materials March 1997  –  May 1998  (1 year 3 months) Manufacturing Engineer Boeing Commercial Airplanes May 1995  –  March 1997  (1 year 11 months) Senior Mechanical Engineer Intel Corporation January 2015  – Present (8 months) Data Center Group Senior Mechanical Engineer Intel Corporation January 2015  – Present (8 months) Data Center Group Mechanical Engineer Hewlett-Packard November 2000  –  December 2014  (14 years 2 months) Mechanical Engineer Hewlett-Packard November 2000  –  December 2014  (14 years 2 months) Senior Mechanical Engineer SCP Global Technologies May 1999  –  November 2000  (1 year 7 months) Senior Mechanical Engineer SCP Global Technologies May 1999  –  November 2000  (1 year 7 months) Design Engineer Kenworth Truck Company May 1998  –  April 1999  (1 year) Design Engineer Kenworth Truck Company May 1998  –  April 1999  (1 year) Project Mechanical Engineer Advanced Silicon Materials March 1997  –  May 1998  (1 year 3 months) Project Mechanical Engineer Advanced Silicon Materials March 1997  –  May 1998  (1 year 3 months) Manufacturing Engineer Boeing Commercial Airplanes May 1995  –  March 1997  (1 year 11 months) Manufacturing Engineer Boeing Commercial Airplanes May 1995  –  March 1997  (1 year 11 months) Skills Design for Manufacturing Product Design Pro Engineer CAD Engineering Management GD&T PCB layout design Mechanical Engineering Solidworks Engineering Skills  Design for Manufacturing Product Design Pro Engineer CAD Engineering Management GD&T PCB layout design Mechanical Engineering Solidworks Engineering Design for Manufacturing Product Design Pro Engineer CAD Engineering Management GD&T PCB layout design Mechanical Engineering Solidworks Engineering Design for Manufacturing Product Design Pro Engineer CAD Engineering Management GD&T PCB layout design Mechanical Engineering Solidworks Engineering Education Montana State University-Bozeman BSME,  mechanical engineer Activities and Societies:  ASME ,  Tau Beta Pi The University of Montana BSBA,  marketing Montana State University-Bozeman BSME,  mechanical engineer Activities and Societies:  ASME ,  Tau Beta Pi Montana State University-Bozeman BSME,  mechanical engineer Activities and Societies:  ASME ,  Tau Beta Pi Montana State University-Bozeman BSME,  mechanical engineer Activities and Societies:  ASME ,  Tau Beta Pi The University of Montana BSBA,  marketing The University of Montana BSBA,  marketing The University of Montana BSBA,  marketing ", "Experience Senior Mechanical Engineer Intel Corporation April 2014  – Present (1 year 5 months) Hillsboro, Oregon Heavily influenced product roadmap for client systems on multiple generations by highlighting key thermal/mechanical concerns and providing mitigation paths while minimizing negative impact to both Intel and external customers; provided comprehensive package- and system-level guidance to industry to enable smooth adoption and integration of Intel silicon into client systems; determined thermal specifications on client silicon by balancing Intel’s fabrication needs with customer needs; addressed key customers’ specific issues and concerns on short notice; developed test procedures for lab testing to validate analytical assumptions; mentored and provided dozens of technical training sessions to new hires and interns. Key contributions: \n• Instrumental in enabling industry to adopt Intel’s Core™ M silicon in passively cooled client systems for the first time, allowing customers to integrate high-performance silicon into light and sleek consumer devices; this addressed a crucial area in Intel’s strategic roadmap as a response to both internal and external calls for action in this segment. \n• Assessed risk factors in revolutionary 2018 product and proposed unique thermal solution that minimizes customer adoption burden while delivering adequate thermal budget, overcoming previously understood thermal limitations. \n• Set and ensured accurate product thermal recommendations on all client products for 2014 by working with factory and customer-facing organizations.  \n• Resolved launch-gating issues on high publicity products, enabling timely production and shipment. Mechanical Engineer Intel Corporation February 2013  –  March 2014  (1 year 2 months) Hillsboro, Oregon Performed CFD analyses for passively cooled client systems, keeping within constraints such as maximum silicon junction temperature and ergonomic temperature specifications while minimizing costs to customers; analyzed package-level thermal densities and thermal solution requirements for all client mobile products; analyzed heat generation from wireless docking system components and possible mitigation methods. Key contributions: \n• Performed CFD analysis for Intel reference design of passively cooled tablet with groundbreaking thinness, unveiled at Computex 2014, unequivocally resetting the industry understanding of consumer device form factors and performance with Intel silicon. \n• Performed CFD analyses for key customer engagements, demonstrating feasibility of passively cooled systems with Intel silicon. Thermal Applications Engineer Intel Corporation August 2011  –  January 2013  (1 year 6 months) Hillsboro, Oregon Wrote and maintained customer enabling documents; provided CFD analysis to customers to demonstrate feasibility of space constrained form factors for both desktop and mobile segments. Key contributions: \n• Provided on-site customer training sessions in Oregon and California on thermal management with focus on Intel Turbo Boost Technology and Configurable Thermal Design Power. \n• Analyzed hundreds of customer system logs to identify sub-optimal settings and provided customized feedback per system; authored tool to optimize analysis time and increase accuracy. Senior Mechanical Engineer Intel Corporation April 2014  – Present (1 year 5 months) Hillsboro, Oregon Heavily influenced product roadmap for client systems on multiple generations by highlighting key thermal/mechanical concerns and providing mitigation paths while minimizing negative impact to both Intel and external customers; provided comprehensive package- and system-level guidance to industry to enable smooth adoption and integration of Intel silicon into client systems; determined thermal specifications on client silicon by balancing Intel’s fabrication needs with customer needs; addressed key customers’ specific issues and concerns on short notice; developed test procedures for lab testing to validate analytical assumptions; mentored and provided dozens of technical training sessions to new hires and interns. Key contributions: \n• Instrumental in enabling industry to adopt Intel’s Core™ M silicon in passively cooled client systems for the first time, allowing customers to integrate high-performance silicon into light and sleek consumer devices; this addressed a crucial area in Intel’s strategic roadmap as a response to both internal and external calls for action in this segment. \n• Assessed risk factors in revolutionary 2018 product and proposed unique thermal solution that minimizes customer adoption burden while delivering adequate thermal budget, overcoming previously understood thermal limitations. \n• Set and ensured accurate product thermal recommendations on all client products for 2014 by working with factory and customer-facing organizations.  \n• Resolved launch-gating issues on high publicity products, enabling timely production and shipment. Senior Mechanical Engineer Intel Corporation April 2014  – Present (1 year 5 months) Hillsboro, Oregon Heavily influenced product roadmap for client systems on multiple generations by highlighting key thermal/mechanical concerns and providing mitigation paths while minimizing negative impact to both Intel and external customers; provided comprehensive package- and system-level guidance to industry to enable smooth adoption and integration of Intel silicon into client systems; determined thermal specifications on client silicon by balancing Intel’s fabrication needs with customer needs; addressed key customers’ specific issues and concerns on short notice; developed test procedures for lab testing to validate analytical assumptions; mentored and provided dozens of technical training sessions to new hires and interns. Key contributions: \n• Instrumental in enabling industry to adopt Intel’s Core™ M silicon in passively cooled client systems for the first time, allowing customers to integrate high-performance silicon into light and sleek consumer devices; this addressed a crucial area in Intel’s strategic roadmap as a response to both internal and external calls for action in this segment. \n• Assessed risk factors in revolutionary 2018 product and proposed unique thermal solution that minimizes customer adoption burden while delivering adequate thermal budget, overcoming previously understood thermal limitations. \n• Set and ensured accurate product thermal recommendations on all client products for 2014 by working with factory and customer-facing organizations.  \n• Resolved launch-gating issues on high publicity products, enabling timely production and shipment. Mechanical Engineer Intel Corporation February 2013  –  March 2014  (1 year 2 months) Hillsboro, Oregon Performed CFD analyses for passively cooled client systems, keeping within constraints such as maximum silicon junction temperature and ergonomic temperature specifications while minimizing costs to customers; analyzed package-level thermal densities and thermal solution requirements for all client mobile products; analyzed heat generation from wireless docking system components and possible mitigation methods. Key contributions: \n• Performed CFD analysis for Intel reference design of passively cooled tablet with groundbreaking thinness, unveiled at Computex 2014, unequivocally resetting the industry understanding of consumer device form factors and performance with Intel silicon. \n• Performed CFD analyses for key customer engagements, demonstrating feasibility of passively cooled systems with Intel silicon. Mechanical Engineer Intel Corporation February 2013  –  March 2014  (1 year 2 months) Hillsboro, Oregon Performed CFD analyses for passively cooled client systems, keeping within constraints such as maximum silicon junction temperature and ergonomic temperature specifications while minimizing costs to customers; analyzed package-level thermal densities and thermal solution requirements for all client mobile products; analyzed heat generation from wireless docking system components and possible mitigation methods. Key contributions: \n• Performed CFD analysis for Intel reference design of passively cooled tablet with groundbreaking thinness, unveiled at Computex 2014, unequivocally resetting the industry understanding of consumer device form factors and performance with Intel silicon. \n• Performed CFD analyses for key customer engagements, demonstrating feasibility of passively cooled systems with Intel silicon. Thermal Applications Engineer Intel Corporation August 2011  –  January 2013  (1 year 6 months) Hillsboro, Oregon Wrote and maintained customer enabling documents; provided CFD analysis to customers to demonstrate feasibility of space constrained form factors for both desktop and mobile segments. Key contributions: \n• Provided on-site customer training sessions in Oregon and California on thermal management with focus on Intel Turbo Boost Technology and Configurable Thermal Design Power. \n• Analyzed hundreds of customer system logs to identify sub-optimal settings and provided customized feedback per system; authored tool to optimize analysis time and increase accuracy. Thermal Applications Engineer Intel Corporation August 2011  –  January 2013  (1 year 6 months) Hillsboro, Oregon Wrote and maintained customer enabling documents; provided CFD analysis to customers to demonstrate feasibility of space constrained form factors for both desktop and mobile segments. Key contributions: \n• Provided on-site customer training sessions in Oregon and California on thermal management with focus on Intel Turbo Boost Technology and Configurable Thermal Design Power. \n• Analyzed hundreds of customer system logs to identify sub-optimal settings and provided customized feedback per system; authored tool to optimize analysis time and increase accuracy. Skills Semiconductors CFD Flotherm Icepak AFM Thermal Management Gambit Fluent Simulations Skills  Semiconductors CFD Flotherm Icepak AFM Thermal Management Gambit Fluent Simulations Semiconductors CFD Flotherm Icepak AFM Thermal Management Gambit Fluent Simulations Semiconductors CFD Flotherm Icepak AFM Thermal Management Gambit Fluent Simulations Education Columbia Engineering M.S.,  Mechanical Engineering 2010  – 2011 Columbia University in the City of New York B.A.,  Physics 2006  – 2010 Columbia Engineering M.S.,  Mechanical Engineering 2010  – 2011 Columbia Engineering M.S.,  Mechanical Engineering 2010  – 2011 Columbia Engineering M.S.,  Mechanical Engineering 2010  – 2011 Columbia University in the City of New York B.A.,  Physics 2006  – 2010 Columbia University in the City of New York B.A.,  Physics 2006  – 2010 Columbia University in the City of New York B.A.,  Physics 2006  – 2010 ", "Summary Objective and Areas of Expertise: \nSenior mechanical engineer seeking a full-time position in product research, design and development. \n· Extensive experience in consumer electronic product architecture and design including; injection molded plastics, cast metal, sheet metal, and machined parts, organic surface modeling, ECAD integration, thermal analysis, EMI containment, custom cabling, cosmetic finishes and regulatory conformance. \n· Excellent communication skills supported with rich visuals and renderings. Ability to speak the language of and collaborate with multiple disciplines and suppliers both foreign and domestic. \n· Creative engineer and problem solver, passionate about product design that exceeds the user's expectations. Specialties:Pro/E, surfacing, plastic injection molded part assemblies, rapid prototyping, low volume production, product rendering, marketing collateral. Summary Objective and Areas of Expertise: \nSenior mechanical engineer seeking a full-time position in product research, design and development. \n· Extensive experience in consumer electronic product architecture and design including; injection molded plastics, cast metal, sheet metal, and machined parts, organic surface modeling, ECAD integration, thermal analysis, EMI containment, custom cabling, cosmetic finishes and regulatory conformance. \n· Excellent communication skills supported with rich visuals and renderings. Ability to speak the language of and collaborate with multiple disciplines and suppliers both foreign and domestic. \n· Creative engineer and problem solver, passionate about product design that exceeds the user's expectations. Specialties:Pro/E, surfacing, plastic injection molded part assemblies, rapid prototyping, low volume production, product rendering, marketing collateral. Objective and Areas of Expertise: \nSenior mechanical engineer seeking a full-time position in product research, design and development. \n· Extensive experience in consumer electronic product architecture and design including; injection molded plastics, cast metal, sheet metal, and machined parts, organic surface modeling, ECAD integration, thermal analysis, EMI containment, custom cabling, cosmetic finishes and regulatory conformance. \n· Excellent communication skills supported with rich visuals and renderings. Ability to speak the language of and collaborate with multiple disciplines and suppliers both foreign and domestic. \n· Creative engineer and problem solver, passionate about product design that exceeds the user's expectations. Specialties:Pro/E, surfacing, plastic injection molded part assemblies, rapid prototyping, low volume production, product rendering, marketing collateral. Objective and Areas of Expertise: \nSenior mechanical engineer seeking a full-time position in product research, design and development. \n· Extensive experience in consumer electronic product architecture and design including; injection molded plastics, cast metal, sheet metal, and machined parts, organic surface modeling, ECAD integration, thermal analysis, EMI containment, custom cabling, cosmetic finishes and regulatory conformance. \n· Excellent communication skills supported with rich visuals and renderings. Ability to speak the language of and collaborate with multiple disciplines and suppliers both foreign and domestic. \n· Creative engineer and problem solver, passionate about product design that exceeds the user's expectations. Specialties:Pro/E, surfacing, plastic injection molded part assemblies, rapid prototyping, low volume production, product rendering, marketing collateral. Experience Senior Mechanical Engineer Intel Corporation July 2012  – Present (3 years 2 months) Hillsboro, OR Senior Mechanical Engineer Leatherman Tool Group March 2010  –  July 2012  (2 years 5 months) Senior R&D Mechanical Engineer Digital Blue Corporation May 2008  –  November 2009  (1 year 7 months) Part of a four member team in the Portland R&D division responsible for research and development of consumer electronic products targeted to teens and tweens. Researched new technologies and assessed feasibility for their use in toy electronics with regards to cost, marketability and maturity. \n· Executed all mechanical design and architecture for multiple to-market products (Disney Mix Stick Lights MP3 player, Disney Flix Jr. video camera, SNAP! Video accessory) \n· Provided and managed industrial design for Digital Blue concept products and partnered with Disney Imagineers for licensed to-market products \n· Designed and fabricated quick turn proof-of-concept systems to test new technologies and play patterns \n· Managed external optical engineers for design of toy grade microscope and 3D camera optics \n· Supplied marketing collaterals, play pattern storyboards, 3D renderings, and animations \n· Assisted in creating test strategies for and analyzed data from user testing Sr. Mechanical Engineer Intel April 2000  –  April 2008  (8 years 1 month) Member of the Integrated Design Services group at Intel, a self funded mechanical engineering team that served as an internal consultancy providing design and program management services for various organizations. \n· Mechanical architect for Intel's McCaslin, Menlow and Moorestown ultra-mobile (Atom) platforms \n· System architecture and full mechanical design for mutliple small form factor and handheld systems \n· Thermal analysis and testing of notebook and handheld systems including components and skins \n· Test socket support including finite elemet analysis, tolerance analysis and production release DOE \n· Design of low and medium volume plastic injection molded chassis and assemblies \n· Kinematic analysis and mechanism design for concept desktop systems \n· BOM management, factory documentation and production support for multiple products Mechanical Test Engineer Intel April 1996  –  March 2000  (4 years) Responsible for designing automated test equipment to support high volume motherboard production \n· Designed highly reliable and repeatable electro-mechanical and electro-pneumatic systems for the final quality check in high volume board production lines \n· Employed statistics to design experiments, analyze data, and modify the factory test process to improve throughput and system accuracy and repeatability. \n· Successfully partnered with off-shore production facilities for continued process and design improvements of test equipment through statistical data collection Mechanical Engineer FREIGHTLINER CORPORATION March 1995  –  September 1995  (7 months) Responsible for analysis of drive shaft dynamics related to vibration and u-joint failure. Mechanical Engineer TEKTRONIX CORPORATION March 1994  –  September 1994  (7 months) Responsible for testing paper transport mechanisms under extreme environmental, load, and life conditions for a new product design group. Senior Mechanical Engineer Intel Corporation July 2012  – Present (3 years 2 months) Hillsboro, OR Senior Mechanical Engineer Intel Corporation July 2012  – Present (3 years 2 months) Hillsboro, OR Senior Mechanical Engineer Leatherman Tool Group March 2010  –  July 2012  (2 years 5 months) Senior Mechanical Engineer Leatherman Tool Group March 2010  –  July 2012  (2 years 5 months) Senior R&D Mechanical Engineer Digital Blue Corporation May 2008  –  November 2009  (1 year 7 months) Part of a four member team in the Portland R&D division responsible for research and development of consumer electronic products targeted to teens and tweens. Researched new technologies and assessed feasibility for their use in toy electronics with regards to cost, marketability and maturity. \n· Executed all mechanical design and architecture for multiple to-market products (Disney Mix Stick Lights MP3 player, Disney Flix Jr. video camera, SNAP! Video accessory) \n· Provided and managed industrial design for Digital Blue concept products and partnered with Disney Imagineers for licensed to-market products \n· Designed and fabricated quick turn proof-of-concept systems to test new technologies and play patterns \n· Managed external optical engineers for design of toy grade microscope and 3D camera optics \n· Supplied marketing collaterals, play pattern storyboards, 3D renderings, and animations \n· Assisted in creating test strategies for and analyzed data from user testing Senior R&D Mechanical Engineer Digital Blue Corporation May 2008  –  November 2009  (1 year 7 months) Part of a four member team in the Portland R&D division responsible for research and development of consumer electronic products targeted to teens and tweens. Researched new technologies and assessed feasibility for their use in toy electronics with regards to cost, marketability and maturity. \n· Executed all mechanical design and architecture for multiple to-market products (Disney Mix Stick Lights MP3 player, Disney Flix Jr. video camera, SNAP! Video accessory) \n· Provided and managed industrial design for Digital Blue concept products and partnered with Disney Imagineers for licensed to-market products \n· Designed and fabricated quick turn proof-of-concept systems to test new technologies and play patterns \n· Managed external optical engineers for design of toy grade microscope and 3D camera optics \n· Supplied marketing collaterals, play pattern storyboards, 3D renderings, and animations \n· Assisted in creating test strategies for and analyzed data from user testing Sr. Mechanical Engineer Intel April 2000  –  April 2008  (8 years 1 month) Member of the Integrated Design Services group at Intel, a self funded mechanical engineering team that served as an internal consultancy providing design and program management services for various organizations. \n· Mechanical architect for Intel's McCaslin, Menlow and Moorestown ultra-mobile (Atom) platforms \n· System architecture and full mechanical design for mutliple small form factor and handheld systems \n· Thermal analysis and testing of notebook and handheld systems including components and skins \n· Test socket support including finite elemet analysis, tolerance analysis and production release DOE \n· Design of low and medium volume plastic injection molded chassis and assemblies \n· Kinematic analysis and mechanism design for concept desktop systems \n· BOM management, factory documentation and production support for multiple products Sr. Mechanical Engineer Intel April 2000  –  April 2008  (8 years 1 month) Member of the Integrated Design Services group at Intel, a self funded mechanical engineering team that served as an internal consultancy providing design and program management services for various organizations. \n· Mechanical architect for Intel's McCaslin, Menlow and Moorestown ultra-mobile (Atom) platforms \n· System architecture and full mechanical design for mutliple small form factor and handheld systems \n· Thermal analysis and testing of notebook and handheld systems including components and skins \n· Test socket support including finite elemet analysis, tolerance analysis and production release DOE \n· Design of low and medium volume plastic injection molded chassis and assemblies \n· Kinematic analysis and mechanism design for concept desktop systems \n· BOM management, factory documentation and production support for multiple products Mechanical Test Engineer Intel April 1996  –  March 2000  (4 years) Responsible for designing automated test equipment to support high volume motherboard production \n· Designed highly reliable and repeatable electro-mechanical and electro-pneumatic systems for the final quality check in high volume board production lines \n· Employed statistics to design experiments, analyze data, and modify the factory test process to improve throughput and system accuracy and repeatability. \n· Successfully partnered with off-shore production facilities for continued process and design improvements of test equipment through statistical data collection Mechanical Test Engineer Intel April 1996  –  March 2000  (4 years) Responsible for designing automated test equipment to support high volume motherboard production \n· Designed highly reliable and repeatable electro-mechanical and electro-pneumatic systems for the final quality check in high volume board production lines \n· Employed statistics to design experiments, analyze data, and modify the factory test process to improve throughput and system accuracy and repeatability. \n· Successfully partnered with off-shore production facilities for continued process and design improvements of test equipment through statistical data collection Mechanical Engineer FREIGHTLINER CORPORATION March 1995  –  September 1995  (7 months) Responsible for analysis of drive shaft dynamics related to vibration and u-joint failure. Mechanical Engineer FREIGHTLINER CORPORATION March 1995  –  September 1995  (7 months) Responsible for analysis of drive shaft dynamics related to vibration and u-joint failure. Mechanical Engineer TEKTRONIX CORPORATION March 1994  –  September 1994  (7 months) Responsible for testing paper transport mechanisms under extreme environmental, load, and life conditions for a new product design group. Mechanical Engineer TEKTRONIX CORPORATION March 1994  –  September 1994  (7 months) Responsible for testing paper transport mechanisms under extreme environmental, load, and life conditions for a new product design group. Skills Product Design Consumer Electronics Surfacing Collateral Product Development Rapid Prototyping Design for Manufacturing Manufacturing Skills  Product Design Consumer Electronics Surfacing Collateral Product Development Rapid Prototyping Design for Manufacturing Manufacturing Product Design Consumer Electronics Surfacing Collateral Product Development Rapid Prototyping Design for Manufacturing Manufacturing Product Design Consumer Electronics Surfacing Collateral Product Development Rapid Prototyping Design for Manufacturing Manufacturing Education Oregon State University BSME,  Mechanical Engineering 1993  – 1996 Continuing education: Strategic Product Design Intensive, PSU, 2003 Oregon State University BSME,  Mechanical Engineering 1993  – 1996 Continuing education: Strategic Product Design Intensive, PSU, 2003 Oregon State University BSME,  Mechanical Engineering 1993  – 1996 Continuing education: Strategic Product Design Intensive, PSU, 2003 Oregon State University BSME,  Mechanical Engineering 1993  – 1996 Continuing education: Strategic Product Design Intensive, PSU, 2003 ", "Experience Seniour Mechanical Engineer Intel Corporation Seniour Mechanical Engineer Intel Corporation Seniour Mechanical Engineer Intel Corporation "]}