{"position": "Senior Systems Engineer", "company": "Intel Corporation", "profiles": ["Experience Senior Systems Engineer Intel Corporation January 2001  – Present (14 years 8 months) Folsom Systems Engineer DCM Data Systems June 1995  –  January 2001  (5 years 8 months) Senior Systems Engineer Intel Corporation January 2001  – Present (14 years 8 months) Folsom Senior Systems Engineer Intel Corporation January 2001  – Present (14 years 8 months) Folsom Systems Engineer DCM Data Systems June 1995  –  January 2001  (5 years 8 months) Systems Engineer DCM Data Systems June 1995  –  January 2001  (5 years 8 months) Skills Top Skills 11 Embedded Systems 10 Debugging 8 Perl 7 Software Development 7 Software Engineering 3 Algorithms 2 Device Drivers 2 SoC 1 Embedded Software 1 Firmware Tapas also knows about... 1 System Architecture 1 RTOS 1 X86 0 Intel 0 Processors 0 Linux Kernel 0 VxWorks 0 iRMK kernel 0 MB2 multiBus Skills  Top Skills 11 Embedded Systems 10 Debugging 8 Perl 7 Software Development 7 Software Engineering 3 Algorithms 2 Device Drivers 2 SoC 1 Embedded Software 1 Firmware Tapas also knows about... 1 System Architecture 1 RTOS 1 X86 0 Intel 0 Processors 0 Linux Kernel 0 VxWorks 0 iRMK kernel 0 MB2 multiBus Top Skills 11 Embedded Systems 10 Debugging 8 Perl 7 Software Development 7 Software Engineering 3 Algorithms 2 Device Drivers 2 SoC 1 Embedded Software 1 Firmware Tapas also knows about... 1 System Architecture 1 RTOS 1 X86 0 Intel 0 Processors 0 Linux Kernel 0 VxWorks 0 iRMK kernel 0 MB2 multiBus Top Skills 11 Embedded Systems 10 Debugging 8 Perl 7 Software Development 7 Software Engineering 3 Algorithms 2 Device Drivers 2 SoC 1 Embedded Software 1 Firmware Tapas also knows about... 1 System Architecture 1 RTOS 1 X86 0 Intel 0 Processors 0 Linux Kernel 0 VxWorks 0 iRMK kernel 0 MB2 multiBus                     1 System Architecture 1 RTOS 1 X86 0 Intel 0 Processors 0 Linux Kernel 0 VxWorks 0 iRMK kernel 0 MB2 multiBus Education Jawaharlal Nehru University MCA,  Computer Science 1992  – 1995 Dayal Singh College BS,  Physics 1989  – 1992 Naval Public School High School 1977  – 1989 Jawaharlal Nehru University MCA,  Computer Science 1992  – 1995 Jawaharlal Nehru University MCA,  Computer Science 1992  – 1995 Jawaharlal Nehru University MCA,  Computer Science 1992  – 1995 Dayal Singh College BS,  Physics 1989  – 1992 Dayal Singh College BS,  Physics 1989  – 1992 Dayal Singh College BS,  Physics 1989  – 1992 Naval Public School High School 1977  – 1989 Naval Public School High School 1977  – 1989 Naval Public School High School 1977  – 1989 ", "Experience Senior Systems Engineer Intel Corporation January 2011  – Present (4 years 8 months) Singapore Supplier enabling and value chain integration Systems Engineer Infineon Technologies August 2007  –  January 2011  (3 years 6 months) Singapore Project Engineer Critical Software 2006  –  2007  (1 year) Portugal (Open) 1 recommendation Pedro Rosas Frontend Developer at Blip.pt Daniel is the most pleasant colleague I had in my career.\nHe is team-oriented and his dedication to the work is outstanding!\nDaniel's most remarkable quality is, for sure, his commitment to the objectives.\nHiring Daniel, is also to win a friend! View Software Engineer Qimonda 2006  –  2006  (less than a year) Portugal Software Engineer Infineon Technologies 2002  –  2006  (4 years) Portugal Intern (Industrial Attachment) Altitude Software 2001  –  2001  (less than a year) Portugal Senior Systems Engineer Intel Corporation January 2011  – Present (4 years 8 months) Singapore Supplier enabling and value chain integration Senior Systems Engineer Intel Corporation January 2011  – Present (4 years 8 months) Singapore Supplier enabling and value chain integration Systems Engineer Infineon Technologies August 2007  –  January 2011  (3 years 6 months) Singapore Systems Engineer Infineon Technologies August 2007  –  January 2011  (3 years 6 months) Singapore Project Engineer Critical Software 2006  –  2007  (1 year) Portugal (Open) 1 recommendation Pedro Rosas Frontend Developer at Blip.pt Daniel is the most pleasant colleague I had in my career.\nHe is team-oriented and his dedication to the work is outstanding!\nDaniel's most remarkable quality is, for sure, his commitment to the objectives.\nHiring Daniel, is also to win a friend! View Project Engineer Critical Software 2006  –  2007  (1 year) Portugal (Open) 1 recommendation Pedro Rosas Frontend Developer at Blip.pt Daniel is the most pleasant colleague I had in my career.\nHe is team-oriented and his dedication to the work is outstanding!\nDaniel's most remarkable quality is, for sure, his commitment to the objectives.\nHiring Daniel, is also to win a friend! View Software Engineer Qimonda 2006  –  2006  (less than a year) Portugal Software Engineer Qimonda 2006  –  2006  (less than a year) Portugal Software Engineer Infineon Technologies 2002  –  2006  (4 years) Portugal Software Engineer Infineon Technologies 2002  –  2006  (4 years) Portugal Intern (Industrial Attachment) Altitude Software 2001  –  2001  (less than a year) Portugal Intern (Industrial Attachment) Altitude Software 2001  –  2001  (less than a year) Portugal Languages English Native or bilingual proficiency Portuguese Native or bilingual proficiency Spanish Limited working proficiency French Elementary proficiency English Native or bilingual proficiency Portuguese Native or bilingual proficiency Spanish Limited working proficiency French Elementary proficiency English Native or bilingual proficiency Portuguese Native or bilingual proficiency Spanish Limited working proficiency French Elementary proficiency Native or bilingual proficiency Native or bilingual proficiency Limited working proficiency Elementary proficiency Skills 8 Software Engineering 2 Shell Scripting 1 Requirements Analysis 0 Semiconductor Failure... 0 Supply Chain Operations 0 Supply Chain Software 0 B2B 0 RosettaNet 0 Oracle PL/SQL... Skills  8 Software Engineering 2 Shell Scripting 1 Requirements Analysis 0 Semiconductor Failure... 0 Supply Chain Operations 0 Supply Chain Software 0 B2B 0 RosettaNet 0 Oracle PL/SQL... 8 Software Engineering 2 Shell Scripting 1 Requirements Analysis 0 Semiconductor Failure... 0 Supply Chain Operations 0 Supply Chain Software 0 B2B 0 RosettaNet 0 Oracle PL/SQL... 8 Software Engineering 2 Shell Scripting 1 Requirements Analysis 0 Semiconductor Failure... 0 Supply Chain Operations 0 Supply Chain Software 0 B2B 0 RosettaNet 0 Oracle PL/SQL...                   Education Instituto Superior de Engenharia do Porto Engenharia Informática,  Sistemas de informação 1997  – 2003 Instituto Superior de Engenharia do Porto Engenharia Informática,  Sistemas de informação 1997  – 2003 Instituto Superior de Engenharia do Porto Engenharia Informática,  Sistemas de informação 1997  – 2003 Instituto Superior de Engenharia do Porto Engenharia Informática,  Sistemas de informação 1997  – 2003 ", "Summary Senior level Product and Operations Manager for software and hardware products and services. Skilled in definition, design and development of software and hardware systems, as well as all phases of the sales, operations and support processes. Successful as both an engineering and business leader. Ability to adapt quickly and use diverse background to build teams, solve problems and improve processes. Seeking a leadership role in a small, high-growth technology startup. \n \nSpecialties: Product Management, program management, agile development, high availability web services, sales support, solutions engineering, account management, leadership, customer support. Summary Senior level Product and Operations Manager for software and hardware products and services. Skilled in definition, design and development of software and hardware systems, as well as all phases of the sales, operations and support processes. Successful as both an engineering and business leader. Ability to adapt quickly and use diverse background to build teams, solve problems and improve processes. Seeking a leadership role in a small, high-growth technology startup. \n \nSpecialties: Product Management, program management, agile development, high availability web services, sales support, solutions engineering, account management, leadership, customer support. Senior level Product and Operations Manager for software and hardware products and services. Skilled in definition, design and development of software and hardware systems, as well as all phases of the sales, operations and support processes. Successful as both an engineering and business leader. Ability to adapt quickly and use diverse background to build teams, solve problems and improve processes. Seeking a leadership role in a small, high-growth technology startup. \n \nSpecialties: Product Management, program management, agile development, high availability web services, sales support, solutions engineering, account management, leadership, customer support. Senior level Product and Operations Manager for software and hardware products and services. Skilled in definition, design and development of software and hardware systems, as well as all phases of the sales, operations and support processes. Successful as both an engineering and business leader. Ability to adapt quickly and use diverse background to build teams, solve problems and improve processes. Seeking a leadership role in a small, high-growth technology startup. \n \nSpecialties: Product Management, program management, agile development, high availability web services, sales support, solutions engineering, account management, leadership, customer support. Experience VP Product Delivery BrightPoint Security, formerly Vorstack February 2012  – Present (3 years 7 months) - Develop and maintain product roadmap. \n \n- Manage agile development process and release cycle. \n \n- Provide technical sales support. \n \n- Ongoing customer support. Sr. Director, Product Management LiveOps March 2009  –  July 2011  (2 years 5 months) Maintained technology roadmap to support $100M+ call center outsourcing services with a focus on improving agent quality and entering new business verticals. \n \nDefined product requirements. \n \nFunctioned as Product Owner in agile development process. \n \nPerformed Sales Engineering and Solution Engineering support for key customers. (Open) 1 recommendation Libby Hoenig Manager, Enterprise Programs & Customer Success Scott is one of those rare people who holds amazing talent and knowledge and who, even while managing a number of projects and being bombarded with requests, remains accessible, friendly, and truly helpful. Scott never hesitates to lend his... View Chair, LiveOps Foundation Committee LiveOps January 2008  –  July 2011  (3 years 7 months) Responsible for corporate philanthropy program that won The Entrepreneurs Foundation Company of the Year 2008. Sr. Director of Client Services - Enterprise LiveOps August 2007  –  March 2009  (1 year 8 months) Built team of 10 people to provide Account Management, Professional Services and Customer Support to both platform and outsourcing services customers of the newly formed enterprise business unit. \n \nWorked with Sales to qualify opportunities in the pipeline. \n \nManaged key customer relationships. Sr. Director of Network Operations LiveOps, Inc August 2006  –  August 2007  (1 year 1 month) Responsible for improving service availability of the web and telephony platform through geo-redundancy, automated failover and other high availability practices. \n \nManaged $4M budget to support both corporate IT and the 24x7 service operations of on-demand contact center platform. \n \nLed team of 24 people including system administrators, network administrators, database administrators and network operations center (NOC) engineers. (Open) 2 recommendations John Ubante Software Developer at Yahoo! The previous head of Operations left the company, creating an organizational hole. Scott stepped up, synthesized his past... View Michael Gardner Managing Director and Head of Center at BNY Mellon Innovation Center - Silicon Valley Scott is very smart, resourceful, creative, and a really hard worker, and knows how to get things done. He is also very... View Senior Director of Client Services, Hosted Call Center LiveOps, Inc July 2005  –  August 2006  (1 year 2 months) Managed team of 3 people to provide Account Management, Professional Services and Customer Support for LiveOps first on-demand platform customers. \n \nProvided Sales Engineering and Solutions Engineering support for key customers. \n \nCo-inventor on US Patent 8009821 “Stores as call center resources” Lead Program Manager Microsoft July 2001  –  July 2005  (4 years 1 month) Lead Program Manager – MSN Operation \nNetwork Operation Program Management lead managing PM team that supports planning, development, deployment and management of Internet facing services for MSN in the television space. These services include MSNTV, MSNTV2, Broadcast Services for UltimateTV, TV Listings for MSN and Windows MCE, Remote Record, etc. \n- Manage team of six direct reports that provide program management support. Focused on building capabilities in this young team. \n- Responsible for development and management of $20+ Million fiscal year budget. \n- Service lifecycle responsibility from envisioning phase through production deployment and management.  \n- Manage internal customer relationship. \n- Develop and execute project plans through cross-functional teams. \n- Implement process improvements that improve service delivery. (Open) 3 recommendations, including: Rachel Bondi WW Media & Entertainment/Games Team Leader, New Cloud Division, IBM Global I found Scott, I recommended Scott to the team, Scott reported to me when we hired him at Microsoft then immediately... View Thomas Tilley Principal Program Manager (Infrastructure) at EMC Scott and I worked together as co-managers for over 4 years in the WebTV/MSN-TV space at Microsoft. The particular time... View 1 more recommendation Engineering Project Leader/Firmware Manager Axiohm Transaction Solutions July 1998  –  July 2000  (2 years 1 month) - Managed six person engineering team responsible for firmware development and validation on revenue-leading products in an ISO9000 environment.  \n- Project lead for the $0.5 Million development of a USB interface. Negotiated third-party contracts and licensing to support internal development. \n- Responsible for recovery plan of firmware development for Axiohm’s latest Point-of-Sale printer products that now account for approximately $50 Million in annual revenue.  \n- Worked with worldwide customer base to develop specifications and solve issues. Resulted in Asian printer products for Japan and Korea. \n- Worked with third parties to provide contract solutions to our product needs. \n- Coordinated development efforts between our other engineering sites in Wyoming and France. \n- Coordinated all engineering hiring. \n- Involved in new product planning process. Senior Systems Engineer Intel Corporation June 1994  –  July 1998  (4 years 2 months) - Managed a team of four engineers and a technician who were responsible for, \n> Developing and deploying software tests and procedures to evaluate BIOS initialization of Intel chipsets. \n> Maintenance and upgrading of Intel’s Bus Master IDE driver for Microsoft Windows Operating Systems. \n- Worked with Microsoft Windows Hardware Quality Lab to assure that OEM platforms containing Intel chipsets obtained logo certification \n- Responsible for groups new college graduate and experienced hiring for PCD’s Manufacturing and Systems Engineering Group. \n- Championed the development of two courses at local colleges to train students in skill areas needed by Intel. (Open) 1 recommendation John Trelford Application/Validation Engineer at Intel Corporation I believe Scott's education, experience, and interpersonal skills qualify him for any tough assignment in the industry. His sense of humor and positive attitude make working with Scott a very positive experience. View Senior Design Engineer Intel corporation September 1990  –  June 1994  (3 years 10 months) - VLSI Design engineer working on iFX8160 and iFX880 Flash FPGA. \n> Performed logic changes and setup and performed full-chip simulation. \n> Provided CAD tool support including automatic array programming and verification, and circuit optimization tools. \n> Performed first silicon evaluation of the iFX8160. \n \nSenior Design Engineer – Intel Connectivity Division \n- VLSI Design engineer working on 89C127FX Modem Analog Front-End. \n> Implemented all logic changes required. \n> Managed tape-out process. \n> Performed first silicon design verification and debug. \n- Assisted in the development of expert system test vector translator for 82595 LAN controller. Associate Development Engineer The University of California at Davis July 1989  –  June 1990  (1 year) - Developed laboratory experiments and trained students in computer design. \n- Ported real-time operating system from IBM PC to STD bus computer. \n- Managed industry donations. Consulting Design Engineer Osiris Corporation June 1989  –  June 1990  (1 year 1 month) - Co-developed hardware and software for innovative pointing device for the personal computer for engineering startup. This included microcontroller firmware and PC software development. Design Engineer LUMA TELECOM INCORPORATED May 1988  –  May 1989  (1 year 1 month) - Assisted in the algorithm and hardware development for patented color still-picture videotelephone modem.  \n- Implemented modem in general purpose TI DSP. Research Assistant THE UNIVERSITY OF MICHIGAN September 1986  –  May 1988  (1 year 9 months) - Designed and built a high-speed, multi-channel current source for neural stimulation. This device was used in auditory research. Development Engineer EASTMAN KODAK COMPANY June 1984  –  August 1986  (2 years 3 months) - Contributed to the development of patented image processing algorithms in a microfilm and paper scanning systems. VP Product Delivery BrightPoint Security, formerly Vorstack February 2012  – Present (3 years 7 months) - Develop and maintain product roadmap. \n \n- Manage agile development process and release cycle. \n \n- Provide technical sales support. \n \n- Ongoing customer support. VP Product Delivery BrightPoint Security, formerly Vorstack February 2012  – Present (3 years 7 months) - Develop and maintain product roadmap. \n \n- Manage agile development process and release cycle. \n \n- Provide technical sales support. \n \n- Ongoing customer support. Sr. Director, Product Management LiveOps March 2009  –  July 2011  (2 years 5 months) Maintained technology roadmap to support $100M+ call center outsourcing services with a focus on improving agent quality and entering new business verticals. \n \nDefined product requirements. \n \nFunctioned as Product Owner in agile development process. \n \nPerformed Sales Engineering and Solution Engineering support for key customers. (Open) 1 recommendation Libby Hoenig Manager, Enterprise Programs & Customer Success Scott is one of those rare people who holds amazing talent and knowledge and who, even while managing a number of projects and being bombarded with requests, remains accessible, friendly, and truly helpful. Scott never hesitates to lend his... View Sr. Director, Product Management LiveOps March 2009  –  July 2011  (2 years 5 months) Maintained technology roadmap to support $100M+ call center outsourcing services with a focus on improving agent quality and entering new business verticals. \n \nDefined product requirements. \n \nFunctioned as Product Owner in agile development process. \n \nPerformed Sales Engineering and Solution Engineering support for key customers. (Open) 1 recommendation Libby Hoenig Manager, Enterprise Programs & Customer Success Scott is one of those rare people who holds amazing talent and knowledge and who, even while managing a number of projects and being bombarded with requests, remains accessible, friendly, and truly helpful. Scott never hesitates to lend his... View Chair, LiveOps Foundation Committee LiveOps January 2008  –  July 2011  (3 years 7 months) Responsible for corporate philanthropy program that won The Entrepreneurs Foundation Company of the Year 2008. Chair, LiveOps Foundation Committee LiveOps January 2008  –  July 2011  (3 years 7 months) Responsible for corporate philanthropy program that won The Entrepreneurs Foundation Company of the Year 2008. Sr. Director of Client Services - Enterprise LiveOps August 2007  –  March 2009  (1 year 8 months) Built team of 10 people to provide Account Management, Professional Services and Customer Support to both platform and outsourcing services customers of the newly formed enterprise business unit. \n \nWorked with Sales to qualify opportunities in the pipeline. \n \nManaged key customer relationships. Sr. Director of Client Services - Enterprise LiveOps August 2007  –  March 2009  (1 year 8 months) Built team of 10 people to provide Account Management, Professional Services and Customer Support to both platform and outsourcing services customers of the newly formed enterprise business unit. \n \nWorked with Sales to qualify opportunities in the pipeline. \n \nManaged key customer relationships. Sr. Director of Network Operations LiveOps, Inc August 2006  –  August 2007  (1 year 1 month) Responsible for improving service availability of the web and telephony platform through geo-redundancy, automated failover and other high availability practices. \n \nManaged $4M budget to support both corporate IT and the 24x7 service operations of on-demand contact center platform. \n \nLed team of 24 people including system administrators, network administrators, database administrators and network operations center (NOC) engineers. (Open) 2 recommendations John Ubante Software Developer at Yahoo! The previous head of Operations left the company, creating an organizational hole. Scott stepped up, synthesized his past... View Michael Gardner Managing Director and Head of Center at BNY Mellon Innovation Center - Silicon Valley Scott is very smart, resourceful, creative, and a really hard worker, and knows how to get things done. He is also very... View Sr. Director of Network Operations LiveOps, Inc August 2006  –  August 2007  (1 year 1 month) Responsible for improving service availability of the web and telephony platform through geo-redundancy, automated failover and other high availability practices. \n \nManaged $4M budget to support both corporate IT and the 24x7 service operations of on-demand contact center platform. \n \nLed team of 24 people including system administrators, network administrators, database administrators and network operations center (NOC) engineers. (Open) 2 recommendations John Ubante Software Developer at Yahoo! The previous head of Operations left the company, creating an organizational hole. Scott stepped up, synthesized his past... View Michael Gardner Managing Director and Head of Center at BNY Mellon Innovation Center - Silicon Valley Scott is very smart, resourceful, creative, and a really hard worker, and knows how to get things done. He is also very... View Senior Director of Client Services, Hosted Call Center LiveOps, Inc July 2005  –  August 2006  (1 year 2 months) Managed team of 3 people to provide Account Management, Professional Services and Customer Support for LiveOps first on-demand platform customers. \n \nProvided Sales Engineering and Solutions Engineering support for key customers. \n \nCo-inventor on US Patent 8009821 “Stores as call center resources” Senior Director of Client Services, Hosted Call Center LiveOps, Inc July 2005  –  August 2006  (1 year 2 months) Managed team of 3 people to provide Account Management, Professional Services and Customer Support for LiveOps first on-demand platform customers. \n \nProvided Sales Engineering and Solutions Engineering support for key customers. \n \nCo-inventor on US Patent 8009821 “Stores as call center resources” Lead Program Manager Microsoft July 2001  –  July 2005  (4 years 1 month) Lead Program Manager – MSN Operation \nNetwork Operation Program Management lead managing PM team that supports planning, development, deployment and management of Internet facing services for MSN in the television space. These services include MSNTV, MSNTV2, Broadcast Services for UltimateTV, TV Listings for MSN and Windows MCE, Remote Record, etc. \n- Manage team of six direct reports that provide program management support. Focused on building capabilities in this young team. \n- Responsible for development and management of $20+ Million fiscal year budget. \n- Service lifecycle responsibility from envisioning phase through production deployment and management.  \n- Manage internal customer relationship. \n- Develop and execute project plans through cross-functional teams. \n- Implement process improvements that improve service delivery. (Open) 3 recommendations, including: Rachel Bondi WW Media & Entertainment/Games Team Leader, New Cloud Division, IBM Global I found Scott, I recommended Scott to the team, Scott reported to me when we hired him at Microsoft then immediately... View Thomas Tilley Principal Program Manager (Infrastructure) at EMC Scott and I worked together as co-managers for over 4 years in the WebTV/MSN-TV space at Microsoft. The particular time... View 1 more recommendation Lead Program Manager Microsoft July 2001  –  July 2005  (4 years 1 month) Lead Program Manager – MSN Operation \nNetwork Operation Program Management lead managing PM team that supports planning, development, deployment and management of Internet facing services for MSN in the television space. These services include MSNTV, MSNTV2, Broadcast Services for UltimateTV, TV Listings for MSN and Windows MCE, Remote Record, etc. \n- Manage team of six direct reports that provide program management support. Focused on building capabilities in this young team. \n- Responsible for development and management of $20+ Million fiscal year budget. \n- Service lifecycle responsibility from envisioning phase through production deployment and management.  \n- Manage internal customer relationship. \n- Develop and execute project plans through cross-functional teams. \n- Implement process improvements that improve service delivery. (Open) 3 recommendations, including: Rachel Bondi WW Media & Entertainment/Games Team Leader, New Cloud Division, IBM Global I found Scott, I recommended Scott to the team, Scott reported to me when we hired him at Microsoft then immediately... View Thomas Tilley Principal Program Manager (Infrastructure) at EMC Scott and I worked together as co-managers for over 4 years in the WebTV/MSN-TV space at Microsoft. The particular time... View 1 more recommendation Engineering Project Leader/Firmware Manager Axiohm Transaction Solutions July 1998  –  July 2000  (2 years 1 month) - Managed six person engineering team responsible for firmware development and validation on revenue-leading products in an ISO9000 environment.  \n- Project lead for the $0.5 Million development of a USB interface. Negotiated third-party contracts and licensing to support internal development. \n- Responsible for recovery plan of firmware development for Axiohm’s latest Point-of-Sale printer products that now account for approximately $50 Million in annual revenue.  \n- Worked with worldwide customer base to develop specifications and solve issues. Resulted in Asian printer products for Japan and Korea. \n- Worked with third parties to provide contract solutions to our product needs. \n- Coordinated development efforts between our other engineering sites in Wyoming and France. \n- Coordinated all engineering hiring. \n- Involved in new product planning process. Engineering Project Leader/Firmware Manager Axiohm Transaction Solutions July 1998  –  July 2000  (2 years 1 month) - Managed six person engineering team responsible for firmware development and validation on revenue-leading products in an ISO9000 environment.  \n- Project lead for the $0.5 Million development of a USB interface. Negotiated third-party contracts and licensing to support internal development. \n- Responsible for recovery plan of firmware development for Axiohm’s latest Point-of-Sale printer products that now account for approximately $50 Million in annual revenue.  \n- Worked with worldwide customer base to develop specifications and solve issues. Resulted in Asian printer products for Japan and Korea. \n- Worked with third parties to provide contract solutions to our product needs. \n- Coordinated development efforts between our other engineering sites in Wyoming and France. \n- Coordinated all engineering hiring. \n- Involved in new product planning process. Senior Systems Engineer Intel Corporation June 1994  –  July 1998  (4 years 2 months) - Managed a team of four engineers and a technician who were responsible for, \n> Developing and deploying software tests and procedures to evaluate BIOS initialization of Intel chipsets. \n> Maintenance and upgrading of Intel’s Bus Master IDE driver for Microsoft Windows Operating Systems. \n- Worked with Microsoft Windows Hardware Quality Lab to assure that OEM platforms containing Intel chipsets obtained logo certification \n- Responsible for groups new college graduate and experienced hiring for PCD’s Manufacturing and Systems Engineering Group. \n- Championed the development of two courses at local colleges to train students in skill areas needed by Intel. (Open) 1 recommendation John Trelford Application/Validation Engineer at Intel Corporation I believe Scott's education, experience, and interpersonal skills qualify him for any tough assignment in the industry. His sense of humor and positive attitude make working with Scott a very positive experience. View Senior Systems Engineer Intel Corporation June 1994  –  July 1998  (4 years 2 months) - Managed a team of four engineers and a technician who were responsible for, \n> Developing and deploying software tests and procedures to evaluate BIOS initialization of Intel chipsets. \n> Maintenance and upgrading of Intel’s Bus Master IDE driver for Microsoft Windows Operating Systems. \n- Worked with Microsoft Windows Hardware Quality Lab to assure that OEM platforms containing Intel chipsets obtained logo certification \n- Responsible for groups new college graduate and experienced hiring for PCD’s Manufacturing and Systems Engineering Group. \n- Championed the development of two courses at local colleges to train students in skill areas needed by Intel. (Open) 1 recommendation John Trelford Application/Validation Engineer at Intel Corporation I believe Scott's education, experience, and interpersonal skills qualify him for any tough assignment in the industry. His sense of humor and positive attitude make working with Scott a very positive experience. View Senior Design Engineer Intel corporation September 1990  –  June 1994  (3 years 10 months) - VLSI Design engineer working on iFX8160 and iFX880 Flash FPGA. \n> Performed logic changes and setup and performed full-chip simulation. \n> Provided CAD tool support including automatic array programming and verification, and circuit optimization tools. \n> Performed first silicon evaluation of the iFX8160. \n \nSenior Design Engineer – Intel Connectivity Division \n- VLSI Design engineer working on 89C127FX Modem Analog Front-End. \n> Implemented all logic changes required. \n> Managed tape-out process. \n> Performed first silicon design verification and debug. \n- Assisted in the development of expert system test vector translator for 82595 LAN controller. Senior Design Engineer Intel corporation September 1990  –  June 1994  (3 years 10 months) - VLSI Design engineer working on iFX8160 and iFX880 Flash FPGA. \n> Performed logic changes and setup and performed full-chip simulation. \n> Provided CAD tool support including automatic array programming and verification, and circuit optimization tools. \n> Performed first silicon evaluation of the iFX8160. \n \nSenior Design Engineer – Intel Connectivity Division \n- VLSI Design engineer working on 89C127FX Modem Analog Front-End. \n> Implemented all logic changes required. \n> Managed tape-out process. \n> Performed first silicon design verification and debug. \n- Assisted in the development of expert system test vector translator for 82595 LAN controller. Associate Development Engineer The University of California at Davis July 1989  –  June 1990  (1 year) - Developed laboratory experiments and trained students in computer design. \n- Ported real-time operating system from IBM PC to STD bus computer. \n- Managed industry donations. Associate Development Engineer The University of California at Davis July 1989  –  June 1990  (1 year) - Developed laboratory experiments and trained students in computer design. \n- Ported real-time operating system from IBM PC to STD bus computer. \n- Managed industry donations. Consulting Design Engineer Osiris Corporation June 1989  –  June 1990  (1 year 1 month) - Co-developed hardware and software for innovative pointing device for the personal computer for engineering startup. This included microcontroller firmware and PC software development. Consulting Design Engineer Osiris Corporation June 1989  –  June 1990  (1 year 1 month) - Co-developed hardware and software for innovative pointing device for the personal computer for engineering startup. This included microcontroller firmware and PC software development. Design Engineer LUMA TELECOM INCORPORATED May 1988  –  May 1989  (1 year 1 month) - Assisted in the algorithm and hardware development for patented color still-picture videotelephone modem.  \n- Implemented modem in general purpose TI DSP. Design Engineer LUMA TELECOM INCORPORATED May 1988  –  May 1989  (1 year 1 month) - Assisted in the algorithm and hardware development for patented color still-picture videotelephone modem.  \n- Implemented modem in general purpose TI DSP. Research Assistant THE UNIVERSITY OF MICHIGAN September 1986  –  May 1988  (1 year 9 months) - Designed and built a high-speed, multi-channel current source for neural stimulation. This device was used in auditory research. Research Assistant THE UNIVERSITY OF MICHIGAN September 1986  –  May 1988  (1 year 9 months) - Designed and built a high-speed, multi-channel current source for neural stimulation. This device was used in auditory research. Development Engineer EASTMAN KODAK COMPANY June 1984  –  August 1986  (2 years 3 months) - Contributed to the development of patented image processing algorithms in a microfilm and paper scanning systems. Development Engineer EASTMAN KODAK COMPANY June 1984  –  August 1986  (2 years 3 months) - Contributed to the development of patented image processing algorithms in a microfilm and paper scanning systems. Skills Top Skills 81 Product Management 60 Enterprise Software 57 Cross-functional Team... 46 Program Management 30 Product Development 29 Start-ups 27 Customer Support 24 Agile Methodologies 20 Cloud Computing 18 Account Management Scott also knows about... 16 Software Development 15 Analytics 13 SaaS 9 Management 6 Sales Operations 5 Entrepreneurship 4 Call Centers 4 Project Management 3 Hardware 3 Mobile Devices 2 Web Services 2 Pre-sales 1 Agile 1 Scrum 1 Sales Support 1 High Availability See 1+     See less Skills  Top Skills 81 Product Management 60 Enterprise Software 57 Cross-functional Team... 46 Program Management 30 Product Development 29 Start-ups 27 Customer Support 24 Agile Methodologies 20 Cloud Computing 18 Account Management Scott also knows about... 16 Software Development 15 Analytics 13 SaaS 9 Management 6 Sales Operations 5 Entrepreneurship 4 Call Centers 4 Project Management 3 Hardware 3 Mobile Devices 2 Web Services 2 Pre-sales 1 Agile 1 Scrum 1 Sales Support 1 High Availability See 1+     See less Top Skills 81 Product Management 60 Enterprise Software 57 Cross-functional Team... 46 Program Management 30 Product Development 29 Start-ups 27 Customer Support 24 Agile Methodologies 20 Cloud Computing 18 Account Management Scott also knows about... 16 Software Development 15 Analytics 13 SaaS 9 Management 6 Sales Operations 5 Entrepreneurship 4 Call Centers 4 Project Management 3 Hardware 3 Mobile Devices 2 Web Services 2 Pre-sales 1 Agile 1 Scrum 1 Sales Support 1 High Availability See 1+     See less Top Skills 81 Product Management 60 Enterprise Software 57 Cross-functional Team... 46 Program Management 30 Product Development 29 Start-ups 27 Customer Support 24 Agile Methodologies 20 Cloud Computing 18 Account Management Scott also knows about... 16 Software Development 15 Analytics 13 SaaS 9 Management 6 Sales Operations 5 Entrepreneurship 4 Call Centers 4 Project Management 3 Hardware 3 Mobile Devices 2 Web Services 2 Pre-sales 1 Agile 1 Scrum 1 Sales Support 1 High Availability See 1+     See less                     16 Software Development 15 Analytics 13 SaaS 9 Management 6 Sales Operations 5 Entrepreneurship 4 Call Centers 4 Project Management 3 Hardware 3 Mobile Devices 2 Web Services 2 Pre-sales 1 Agile 1 Scrum 1 Sales Support 1 High Availability Education Johnson Graduate School of Management at Cornell University MBA,  General Management ,  Entrepreneurship ,  Finance May 2000  – May 2001 Activities and Societies:  Admissions committee The Univerisity of Michigan - Ann Arbor MSEE,  Signal Processing September 1986  – May 1988 Activities and Societies:  IEEE Cornell University BSEE,  Signal Processing September 1980  – May 1984 Activities and Societies:  Cornell Rifle Team ,  Cornell Savoyards ,  Volunteer at the student radio station. Johnson Graduate School of Management at Cornell University MBA,  General Management ,  Entrepreneurship ,  Finance May 2000  – May 2001 Activities and Societies:  Admissions committee Johnson Graduate School of Management at Cornell University MBA,  General Management ,  Entrepreneurship ,  Finance May 2000  – May 2001 Activities and Societies:  Admissions committee Johnson Graduate School of Management at Cornell University MBA,  General Management ,  Entrepreneurship ,  Finance May 2000  – May 2001 Activities and Societies:  Admissions committee The Univerisity of Michigan - Ann Arbor MSEE,  Signal Processing September 1986  – May 1988 Activities and Societies:  IEEE The Univerisity of Michigan - Ann Arbor MSEE,  Signal Processing September 1986  – May 1988 Activities and Societies:  IEEE The Univerisity of Michigan - Ann Arbor MSEE,  Signal Processing September 1986  – May 1988 Activities and Societies:  IEEE Cornell University BSEE,  Signal Processing September 1980  – May 1984 Activities and Societies:  Cornell Rifle Team ,  Cornell Savoyards ,  Volunteer at the student radio station. Cornell University BSEE,  Signal Processing September 1980  – May 1984 Activities and Societies:  Cornell Rifle Team ,  Cornell Savoyards ,  Volunteer at the student radio station. Cornell University BSEE,  Signal Processing September 1980  – May 1984 Activities and Societies:  Cornell Rifle Team ,  Cornell Savoyards ,  Volunteer at the student radio station. Honors & Awards ", "Experience Senior Systems Engineer Intel Corporation Senior Systems Engineer Intel Corporation Senior Systems Engineer Intel Corporation Skills Skills     Education Pennsylvania State University-Great Valley Graduate Center 1975  – 1977 Pennsylvania State University-Great Valley Graduate Center 1975  – 1977 Pennsylvania State University-Great Valley Graduate Center 1975  – 1977 Pennsylvania State University-Great Valley Graduate Center 1975  – 1977 ", "Experience Senior Systems Engineer Intel Corporation January 2000  – Present (15 years 8 months) (Open) 1 recommendation Leo Godin Capacity Manager Mike is a dedicated employee who applies an engineers detail orientation to system administration. He takes ownership of any problem and always makes the system work. He is an advanced programmer as well as a systems engineer and is just as... View DBA / Software Developer Molex Premise Networks, Inc. 1997  –  2000  (3 years) Win32 FE Application Development; Oracle MRP; Oracle DBA - UNIX Network Administrator / Programmer AMP, Incorporated 1994  –  1997  (3 years) Senior Systems Engineer Intel Corporation January 2000  – Present (15 years 8 months) (Open) 1 recommendation Leo Godin Capacity Manager Mike is a dedicated employee who applies an engineers detail orientation to system administration. He takes ownership of any problem and always makes the system work. He is an advanced programmer as well as a systems engineer and is just as... View Senior Systems Engineer Intel Corporation January 2000  – Present (15 years 8 months) (Open) 1 recommendation Leo Godin Capacity Manager Mike is a dedicated employee who applies an engineers detail orientation to system administration. He takes ownership of any problem and always makes the system work. He is an advanced programmer as well as a systems engineer and is just as... View DBA / Software Developer Molex Premise Networks, Inc. 1997  –  2000  (3 years) Win32 FE Application Development; Oracle MRP; Oracle DBA - UNIX DBA / Software Developer Molex Premise Networks, Inc. 1997  –  2000  (3 years) Win32 FE Application Development; Oracle MRP; Oracle DBA - UNIX Network Administrator / Programmer AMP, Incorporated 1994  –  1997  (3 years) Network Administrator / Programmer AMP, Incorporated 1994  –  1997  (3 years) Skills Top Skills 7 Intel 7 Perl 5 Oracle 5 Software Development 5 Debugging 3 System Administration 2 Software Engineering 2 Unix 1 Shell Scripting 1 Networking Michael also knows about... 1 Windows Skills  Top Skills 7 Intel 7 Perl 5 Oracle 5 Software Development 5 Debugging 3 System Administration 2 Software Engineering 2 Unix 1 Shell Scripting 1 Networking Michael also knows about... 1 Windows Top Skills 7 Intel 7 Perl 5 Oracle 5 Software Development 5 Debugging 3 System Administration 2 Software Engineering 2 Unix 1 Shell Scripting 1 Networking Michael also knows about... 1 Windows Top Skills 7 Intel 7 Perl 5 Oracle 5 Software Development 5 Debugging 3 System Administration 2 Software Engineering 2 Unix 1 Shell Scripting 1 Networking Michael also knows about... 1 Windows                     1 Windows Honors & Awards Additional Honors & Awards Intel Quality Award - Intel Corporation \n \nAmericas Achievement Award - Molex Premise Networks, Inc. Additional Honors & Awards Intel Quality Award - Intel Corporation \n \nAmericas Achievement Award - Molex Premise Networks, Inc. Additional Honors & Awards Intel Quality Award - Intel Corporation \n \nAmericas Achievement Award - Molex Premise Networks, Inc. Additional Honors & Awards Intel Quality Award - Intel Corporation \n \nAmericas Achievement Award - Molex Premise Networks, Inc. ", "Summary •\tResults-oriented Sr. Systems Engineer with extensive experience in designing, implementing and maintaining enterprise systems.  \n \n•\t37+ years of progressive experience in IT related business which includes 20+ years in systems engineering, 5 years in application programming. Skilled Project Manager with expertise in Windows 2003 Advanced Server Operating System and server hardware installation and configuration (i.e. NCR, DELL and Compaq etc.). Strengths include strategic planning, troubleshooting, project management, team building, excellent customer orientation and written and verbal presentation skills.  \n \n•\tPositions held at Hansen and Intel includes, Sr. Systems Engineer, Sales Engineer, Sr. Enterprise Application Integration/B2B (Business to Business) Systems Engineer Senior, Sr. SAP Systems Engineer, Sr. Internet Systems Engineer, Sr. Database Systems Engineer and CICS Systems Programmer. Specialties:Server Architecture, systems engineer, technical support, project manager, network engineer, windows system administrator Summary •\tResults-oriented Sr. Systems Engineer with extensive experience in designing, implementing and maintaining enterprise systems.  \n \n•\t37+ years of progressive experience in IT related business which includes 20+ years in systems engineering, 5 years in application programming. Skilled Project Manager with expertise in Windows 2003 Advanced Server Operating System and server hardware installation and configuration (i.e. NCR, DELL and Compaq etc.). Strengths include strategic planning, troubleshooting, project management, team building, excellent customer orientation and written and verbal presentation skills.  \n \n•\tPositions held at Hansen and Intel includes, Sr. Systems Engineer, Sales Engineer, Sr. Enterprise Application Integration/B2B (Business to Business) Systems Engineer Senior, Sr. SAP Systems Engineer, Sr. Internet Systems Engineer, Sr. Database Systems Engineer and CICS Systems Programmer. Specialties:Server Architecture, systems engineer, technical support, project manager, network engineer, windows system administrator •\tResults-oriented Sr. Systems Engineer with extensive experience in designing, implementing and maintaining enterprise systems.  \n \n•\t37+ years of progressive experience in IT related business which includes 20+ years in systems engineering, 5 years in application programming. Skilled Project Manager with expertise in Windows 2003 Advanced Server Operating System and server hardware installation and configuration (i.e. NCR, DELL and Compaq etc.). Strengths include strategic planning, troubleshooting, project management, team building, excellent customer orientation and written and verbal presentation skills.  \n \n•\tPositions held at Hansen and Intel includes, Sr. Systems Engineer, Sales Engineer, Sr. Enterprise Application Integration/B2B (Business to Business) Systems Engineer Senior, Sr. SAP Systems Engineer, Sr. Internet Systems Engineer, Sr. Database Systems Engineer and CICS Systems Programmer. Specialties:Server Architecture, systems engineer, technical support, project manager, network engineer, windows system administrator •\tResults-oriented Sr. Systems Engineer with extensive experience in designing, implementing and maintaining enterprise systems.  \n \n•\t37+ years of progressive experience in IT related business which includes 20+ years in systems engineering, 5 years in application programming. Skilled Project Manager with expertise in Windows 2003 Advanced Server Operating System and server hardware installation and configuration (i.e. NCR, DELL and Compaq etc.). Strengths include strategic planning, troubleshooting, project management, team building, excellent customer orientation and written and verbal presentation skills.  \n \n•\tPositions held at Hansen and Intel includes, Sr. Systems Engineer, Sales Engineer, Sr. Enterprise Application Integration/B2B (Business to Business) Systems Engineer Senior, Sr. SAP Systems Engineer, Sr. Internet Systems Engineer, Sr. Database Systems Engineer and CICS Systems Programmer. Specialties:Server Architecture, systems engineer, technical support, project manager, network engineer, windows system administrator Experience Investment partner Yabut Real Estate Investments July 2009  – Present (6 years 2 months) Our company specializes in acquiring foreclosure homes as investment properties. CEO Zerotek Motorsports, Inc. December 2003  – Present (11 years 9 months) We are a direct importer of Automotive Performance Parts and Accessories from Asia. We have access to literally thousands of performance products and accessories. These items are OEM parts and will have our name on it. We supply retailers all over the United States and Overseas. We currently service accounts in Germany, UK, Canada, Finland and Sweden just to name a few. Senior Systems Engineer Intel Corporation July 2011  –  January 2012  (7 months) Folsom, CA Currently working for the IT CCAP (Customer CAPability) Production Support Services group performing Level 2 System Support for Sales and Marketing Web applications. Consultant/Technical Support Fairfax Imaging April 2008  –  October 2010  (2 years 7 months) Support implementation of Fairfax Remittance system \nat the customer’s site. Performs software installation and configurations, provide technical support, technical procedure writing, installation of software fixes and other pre/post implementation project related tasks. Sales/Systems Engineer Hansen Information Technologies February 2006  –  June 2007  (1 year 5 months) •\tA Sales Engineer performing Software demonstrations in customer’s site and on trade shows. Review RFP for pricing. \n•\tA Sr. Systems Engineer performing Hansen Software installation and configuration. Performs client’s software/hardware analysis and makes recommendations. Trouble-shoot Hansen Software problems and work closely with software developers to fix problems. Performs software testing and evaluating of new features. Systems Software Specialist II State of CA Franchise tax board December 2002  –  May 2005  (2 years 6 months) Sacramento, California Area A Senior Software specialist II working in Computing Resource Bureau, Software Support Section, Capacity Planning and Performance, responsible of maintaining and supporting software products that relates to Capacity planning and System Performance. Recently implemented Perfman for OS/390. This product is used to measure IBM system performance, capacity planning and system modeling tool. It is also used for historical performance reporting. This product is a multi-platform environment (i.e. IBM mainframe, Unix and Windows 2000 server). Installed and configured all three platforms. Senior Systems Engineer Intel Corporation March 1993  –  December 2002  (9 years 10 months) A Senior Systems Engineer responsible for hardware design, implementation and maintenance support for Tibco EAI/B2B environments for the Capacity Planning and Benchmarking group. Project Manager for all of the EAI/B2B benchmarking projects. Provides systems support for Microsoft Windows 2000 Advanced Server, Windows NT, SQL Server, Oracle, Tibco eBusiness software for Intel’s Enterprise Application Integration Business-to-Business (EAI/B2B) systems. Prior to current assignment, was a Senior EAI Systems Engineer Project Manager. Systems Software Specialist II State of California – Legislative Counsel Bureau January 1980  –  March 1993  (13 years 3 months) Sacramento, California Area As a CICS Systems Programmer, I installed and maintained CICS regions in the IBM mainframe. I also maintained DISOSS and DB2 systems. Supported various CICS related software (i.e. Omegamon/CICS, Intertest, Eyewitness, Dumpmaster etc.) \n \n \nAssociate Programmer \nDec ’80 till Dec ‘86 \nResponsibilities: \n \nWrote and modified Cobol application programs for the Bill History and Payroll systems. Performed systems analysis and also wrote and analyzed computer program specifications. Wrote CICS online transaction programs using Cobol. Investment partner Yabut Real Estate Investments July 2009  – Present (6 years 2 months) Our company specializes in acquiring foreclosure homes as investment properties. Investment partner Yabut Real Estate Investments July 2009  – Present (6 years 2 months) Our company specializes in acquiring foreclosure homes as investment properties. CEO Zerotek Motorsports, Inc. December 2003  – Present (11 years 9 months) We are a direct importer of Automotive Performance Parts and Accessories from Asia. We have access to literally thousands of performance products and accessories. These items are OEM parts and will have our name on it. We supply retailers all over the United States and Overseas. We currently service accounts in Germany, UK, Canada, Finland and Sweden just to name a few. CEO Zerotek Motorsports, Inc. December 2003  – Present (11 years 9 months) We are a direct importer of Automotive Performance Parts and Accessories from Asia. We have access to literally thousands of performance products and accessories. These items are OEM parts and will have our name on it. We supply retailers all over the United States and Overseas. We currently service accounts in Germany, UK, Canada, Finland and Sweden just to name a few. Senior Systems Engineer Intel Corporation July 2011  –  January 2012  (7 months) Folsom, CA Currently working for the IT CCAP (Customer CAPability) Production Support Services group performing Level 2 System Support for Sales and Marketing Web applications. Senior Systems Engineer Intel Corporation July 2011  –  January 2012  (7 months) Folsom, CA Currently working for the IT CCAP (Customer CAPability) Production Support Services group performing Level 2 System Support for Sales and Marketing Web applications. Consultant/Technical Support Fairfax Imaging April 2008  –  October 2010  (2 years 7 months) Support implementation of Fairfax Remittance system \nat the customer’s site. Performs software installation and configurations, provide technical support, technical procedure writing, installation of software fixes and other pre/post implementation project related tasks. Consultant/Technical Support Fairfax Imaging April 2008  –  October 2010  (2 years 7 months) Support implementation of Fairfax Remittance system \nat the customer’s site. Performs software installation and configurations, provide technical support, technical procedure writing, installation of software fixes and other pre/post implementation project related tasks. Sales/Systems Engineer Hansen Information Technologies February 2006  –  June 2007  (1 year 5 months) •\tA Sales Engineer performing Software demonstrations in customer’s site and on trade shows. Review RFP for pricing. \n•\tA Sr. Systems Engineer performing Hansen Software installation and configuration. Performs client’s software/hardware analysis and makes recommendations. Trouble-shoot Hansen Software problems and work closely with software developers to fix problems. Performs software testing and evaluating of new features. Sales/Systems Engineer Hansen Information Technologies February 2006  –  June 2007  (1 year 5 months) •\tA Sales Engineer performing Software demonstrations in customer’s site and on trade shows. Review RFP for pricing. \n•\tA Sr. Systems Engineer performing Hansen Software installation and configuration. Performs client’s software/hardware analysis and makes recommendations. Trouble-shoot Hansen Software problems and work closely with software developers to fix problems. Performs software testing and evaluating of new features. Systems Software Specialist II State of CA Franchise tax board December 2002  –  May 2005  (2 years 6 months) Sacramento, California Area A Senior Software specialist II working in Computing Resource Bureau, Software Support Section, Capacity Planning and Performance, responsible of maintaining and supporting software products that relates to Capacity planning and System Performance. Recently implemented Perfman for OS/390. This product is used to measure IBM system performance, capacity planning and system modeling tool. It is also used for historical performance reporting. This product is a multi-platform environment (i.e. IBM mainframe, Unix and Windows 2000 server). Installed and configured all three platforms. Systems Software Specialist II State of CA Franchise tax board December 2002  –  May 2005  (2 years 6 months) Sacramento, California Area A Senior Software specialist II working in Computing Resource Bureau, Software Support Section, Capacity Planning and Performance, responsible of maintaining and supporting software products that relates to Capacity planning and System Performance. Recently implemented Perfman for OS/390. This product is used to measure IBM system performance, capacity planning and system modeling tool. It is also used for historical performance reporting. This product is a multi-platform environment (i.e. IBM mainframe, Unix and Windows 2000 server). Installed and configured all three platforms. Senior Systems Engineer Intel Corporation March 1993  –  December 2002  (9 years 10 months) A Senior Systems Engineer responsible for hardware design, implementation and maintenance support for Tibco EAI/B2B environments for the Capacity Planning and Benchmarking group. Project Manager for all of the EAI/B2B benchmarking projects. Provides systems support for Microsoft Windows 2000 Advanced Server, Windows NT, SQL Server, Oracle, Tibco eBusiness software for Intel’s Enterprise Application Integration Business-to-Business (EAI/B2B) systems. Prior to current assignment, was a Senior EAI Systems Engineer Project Manager. Senior Systems Engineer Intel Corporation March 1993  –  December 2002  (9 years 10 months) A Senior Systems Engineer responsible for hardware design, implementation and maintenance support for Tibco EAI/B2B environments for the Capacity Planning and Benchmarking group. Project Manager for all of the EAI/B2B benchmarking projects. Provides systems support for Microsoft Windows 2000 Advanced Server, Windows NT, SQL Server, Oracle, Tibco eBusiness software for Intel’s Enterprise Application Integration Business-to-Business (EAI/B2B) systems. Prior to current assignment, was a Senior EAI Systems Engineer Project Manager. Systems Software Specialist II State of California – Legislative Counsel Bureau January 1980  –  March 1993  (13 years 3 months) Sacramento, California Area As a CICS Systems Programmer, I installed and maintained CICS regions in the IBM mainframe. I also maintained DISOSS and DB2 systems. Supported various CICS related software (i.e. Omegamon/CICS, Intertest, Eyewitness, Dumpmaster etc.) \n \n \nAssociate Programmer \nDec ’80 till Dec ‘86 \nResponsibilities: \n \nWrote and modified Cobol application programs for the Bill History and Payroll systems. Performed systems analysis and also wrote and analyzed computer program specifications. Wrote CICS online transaction programs using Cobol. Systems Software Specialist II State of California – Legislative Counsel Bureau January 1980  –  March 1993  (13 years 3 months) Sacramento, California Area As a CICS Systems Programmer, I installed and maintained CICS regions in the IBM mainframe. I also maintained DISOSS and DB2 systems. Supported various CICS related software (i.e. Omegamon/CICS, Intertest, Eyewitness, Dumpmaster etc.) \n \n \nAssociate Programmer \nDec ’80 till Dec ‘86 \nResponsibilities: \n \nWrote and modified Cobol application programs for the Bill History and Payroll systems. Performed systems analysis and also wrote and analyzed computer program specifications. Wrote CICS online transaction programs using Cobol. Languages Tagalog Tagalog Tagalog Skills Top Skills 17 Enterprise Software 12 Microsoft SQL Server 12 Operating Systems 6 Windows Server 5 Servers 5 Oracle 3 Technical Support 3 Integration 3 Testing 2 Software Development Jaime also knows about... 2 Cloud Computing 2 Agile Methodologies 2 SharePoint 2 SQL 2 Software 2 Program Management 1 Server Architecture 0 Programming 0 Hansen 8 software 0 Fairfax Imaging... 0 Application support and... 0 Windows Services Skills  Top Skills 17 Enterprise Software 12 Microsoft SQL Server 12 Operating Systems 6 Windows Server 5 Servers 5 Oracle 3 Technical Support 3 Integration 3 Testing 2 Software Development Jaime also knows about... 2 Cloud Computing 2 Agile Methodologies 2 SharePoint 2 SQL 2 Software 2 Program Management 1 Server Architecture 0 Programming 0 Hansen 8 software 0 Fairfax Imaging... 0 Application support and... 0 Windows Services Top Skills 17 Enterprise Software 12 Microsoft SQL Server 12 Operating Systems 6 Windows Server 5 Servers 5 Oracle 3 Technical Support 3 Integration 3 Testing 2 Software Development Jaime also knows about... 2 Cloud Computing 2 Agile Methodologies 2 SharePoint 2 SQL 2 Software 2 Program Management 1 Server Architecture 0 Programming 0 Hansen 8 software 0 Fairfax Imaging... 0 Application support and... 0 Windows Services Top Skills 17 Enterprise Software 12 Microsoft SQL Server 12 Operating Systems 6 Windows Server 5 Servers 5 Oracle 3 Technical Support 3 Integration 3 Testing 2 Software Development Jaime also knows about... 2 Cloud Computing 2 Agile Methodologies 2 SharePoint 2 SQL 2 Software 2 Program Management 1 Server Architecture 0 Programming 0 Hansen 8 software 0 Fairfax Imaging... 0 Application support and... 0 Windows Services                     2 Cloud Computing 2 Agile Methodologies 2 SharePoint 2 SQL 2 Software 2 Program Management 1 Server Architecture 0 Programming 0 Hansen 8 software 0 Fairfax Imaging... 0 Application support and... 0 Windows Services Education California State University-Sacramento BS,  Business Administration 1975  – 1978 Sacramento City College Associate of Arts (A.A.),  Data Processing , 3.0 1973  – 1975 California State University-Sacramento BS,  Business Administration 1975  – 1978 California State University-Sacramento BS,  Business Administration 1975  – 1978 California State University-Sacramento BS,  Business Administration 1975  – 1978 Sacramento City College Associate of Arts (A.A.),  Data Processing , 3.0 1973  – 1975 Sacramento City College Associate of Arts (A.A.),  Data Processing , 3.0 1973  – 1975 Sacramento City College Associate of Arts (A.A.),  Data Processing , 3.0 1973  – 1975 ", "Summary Signal Processing Engineer \n \n•\tOver 15 years of hands on industrial experience, product development and commercial oriented R&D work \n•\tDesign, simulation, implementation and product development experience at leading organizations such as Fujitsu, NEC, AT&T, Ubinetics and Intel \n•\tSource of numerous inventions, granted patents and conference/journal publications \n \nSpecialties: • Fixed and mobile wireless telecommunications  \n• 3GPP WCDMA/UMTS/DC-HSUPA (3G) and LTE (4G) \n• Research & development of future wireless technologies\t \n• Algorithm design/development \n• Digital signal processing \n• Systems engineering  \n• Simulation and modeling (Matlab, C, C++)\t \n• Digital radio modem design \n• Orthogonal frequency division multiplexing (OFDM)\t \n• DSP software programming/implementation (TI C25, C30, C40 and C60)\t \n• RF amplifier (PA) linearization Summary Signal Processing Engineer \n \n•\tOver 15 years of hands on industrial experience, product development and commercial oriented R&D work \n•\tDesign, simulation, implementation and product development experience at leading organizations such as Fujitsu, NEC, AT&T, Ubinetics and Intel \n•\tSource of numerous inventions, granted patents and conference/journal publications \n \nSpecialties: • Fixed and mobile wireless telecommunications  \n• 3GPP WCDMA/UMTS/DC-HSUPA (3G) and LTE (4G) \n• Research & development of future wireless technologies\t \n• Algorithm design/development \n• Digital signal processing \n• Systems engineering  \n• Simulation and modeling (Matlab, C, C++)\t \n• Digital radio modem design \n• Orthogonal frequency division multiplexing (OFDM)\t \n• DSP software programming/implementation (TI C25, C30, C40 and C60)\t \n• RF amplifier (PA) linearization Signal Processing Engineer \n \n•\tOver 15 years of hands on industrial experience, product development and commercial oriented R&D work \n•\tDesign, simulation, implementation and product development experience at leading organizations such as Fujitsu, NEC, AT&T, Ubinetics and Intel \n•\tSource of numerous inventions, granted patents and conference/journal publications \n \nSpecialties: • Fixed and mobile wireless telecommunications  \n• 3GPP WCDMA/UMTS/DC-HSUPA (3G) and LTE (4G) \n• Research & development of future wireless technologies\t \n• Algorithm design/development \n• Digital signal processing \n• Systems engineering  \n• Simulation and modeling (Matlab, C, C++)\t \n• Digital radio modem design \n• Orthogonal frequency division multiplexing (OFDM)\t \n• DSP software programming/implementation (TI C25, C30, C40 and C60)\t \n• RF amplifier (PA) linearization Signal Processing Engineer \n \n•\tOver 15 years of hands on industrial experience, product development and commercial oriented R&D work \n•\tDesign, simulation, implementation and product development experience at leading organizations such as Fujitsu, NEC, AT&T, Ubinetics and Intel \n•\tSource of numerous inventions, granted patents and conference/journal publications \n \nSpecialties: • Fixed and mobile wireless telecommunications  \n• 3GPP WCDMA/UMTS/DC-HSUPA (3G) and LTE (4G) \n• Research & development of future wireless technologies\t \n• Algorithm design/development \n• Digital signal processing \n• Systems engineering  \n• Simulation and modeling (Matlab, C, C++)\t \n• Digital radio modem design \n• Orthogonal frequency division multiplexing (OFDM)\t \n• DSP software programming/implementation (TI C25, C30, C40 and C60)\t \n• RF amplifier (PA) linearization Experience Senior Systems Engineer Intel Corporation July 2011  – Present (4 years 2 months) San Diego, CA, USA Wireless systems engineering Independent Consultant Savant Consulting Limited, Oakville, Canada October 2005  –  July 2011  (5 years 10 months) In this role, I provided consulting services on the physical layer aspects of the 3GPP WCDMA/UMTS and LTE standards. I have designed scalable transmitter entities generating the downlink signals, including RS, synchronization signals, L1/L2 control channels and the broadcast channel, for the FDD mode of the LTE. On the WCDMA side, I have provided fixed-point designs/algorithms for both the transmitter and receiver sides of pico-cell base-stations. These have included QAM modulators, FHT, spreading and scrambling code generators, DPCH, S-CCPCH, HS-SCCH, HS-PDSCH, AICH, PICH, RACH preamble and TFCI detection algorithms and transmitter scaling mechanisms under power control. I verified the effectiveness of these by Matlab simulations and worked closely with FPGA/DSP engineers to ensure their successful implementation within project timelines. Senior Algorithms Engineer Ubinetics Limited/Aeroflex, Cambridge, UK August 2003  –  June 2005  (1 year 11 months) Design of downlink receiver algorithms for company’s WCDMA/UMTS based system-on-chip project and popular TM500 test mobile products were amongst my main responsibilities in this role. Provision of physical layer system support to various company teams/groups, investigation of more advanced receiver solutions, building WCDMA and LTE based link level Matlab simulators, fixed-point design/implementation of receiver algorithms using C were amongst my other responsibilities. In this period, I originated a number of peer-reviewed publications and patent proposals. Senior Systems Engineer AT&T Wireless / Netro Corporation, Redmond, WA, USA February 2001  –  February 2003  (2 years 1 month) In this capacity, I designed and developed novel downlink transceiver algorithms for the AT&T’s OFDM based fixed-wireless Angel product. The designs included efficient synchronization, frequency tracking and SINR estimation techniques. Link level Matlab simulations were used to examine the effectiveness of the designs in various multipath channel scenarios. I also worked with RF hardware design engineers to design flexible RF filtering schemes for the next generation products. In this role, I submitted a multitude of patent proposals and was the author of numerous white papers. DSP Algorithms Consultant NEC Technologies (UK) Ltd, Reading, UK August 1999  –  February 2001  (1 year 7 months) As the lead engineer in the WCDMA/UMTS algorithms design team, I was responsible for the direction of the team’s activities and for the coordination of the team’s efforts with those of NEC Japan and Australia. The focus of my work was on the design of NEC’s handset cell search algorithm and solutions to the problems associated with its practical implementation. My work during this period resulted in numerous inventions, patent submissions and the NEC’s patent of the Year 2000 award. Principal Engineer Fujitsu Europe Telecom R&D Centre, Uxbridge, UK April 1997  –  July 1999  (2 years 4 months) I joined Fujitsu during the early days of WCDMA/UMTS standardization activities and amongst my first responsibilities was participation in the standardization meetings as the company representative. In parallel, I was involved in other technical activities resulting in generation of novel WCDMA-related algorithms and consequently patent proposals. I also provided a real-time flexible DSP-based solution for the Fujitsu’s WCDMA adaptive antenna array product, which I fully implemented using the Texas Instruments fixed-point TMS320C60. Research Associate (postdoctoral research) Centre for Communications Research, University of Bristol, UK October 1994  –  March 1997  (2 years 6 months) At CCR, I was responsible for a UK Engineering and Physical Sciences Research Council (EPSRC) funded project. In this project, I built a frequency hopping (FH) simulator modeling the modules of the FH transceiver together with a controllable multipath channel in C++. Subsequently, I implemented the transceiver modules and a real-time channel model in hardware and in DSP code using TI’s TMS320C30 and C40. Ph.D. student (Ph.D. research) Centre for Communications Research, University of Bristol, UK October 1991  –  May 1995  (3 years 8 months) The focus of my Ph.D. project was on linearization of RF amplifiers. Through theoretical work and C simulations, I formulated the behaviour of the Cartesian feedback transmitter. I used the findings to swiftly design and construct the transmitter hardware prototype. Next, I enhanced the prototype to operate under frequency hopping conditions. The linearization bandwidth of the transmitter was increased by a factor of 12 by my invention of the twin-loop and phase-lag compensated transmitters and their derivatives. I developed a variety of DSP (TI’s TMS320C25) controlled techniques to compensate for practical imperfections of transmitter modules. This work resulted in a number of journal and conference publications. Senior Systems Engineer Intel Corporation July 2011  – Present (4 years 2 months) San Diego, CA, USA Wireless systems engineering Senior Systems Engineer Intel Corporation July 2011  – Present (4 years 2 months) San Diego, CA, USA Wireless systems engineering Independent Consultant Savant Consulting Limited, Oakville, Canada October 2005  –  July 2011  (5 years 10 months) In this role, I provided consulting services on the physical layer aspects of the 3GPP WCDMA/UMTS and LTE standards. I have designed scalable transmitter entities generating the downlink signals, including RS, synchronization signals, L1/L2 control channels and the broadcast channel, for the FDD mode of the LTE. On the WCDMA side, I have provided fixed-point designs/algorithms for both the transmitter and receiver sides of pico-cell base-stations. These have included QAM modulators, FHT, spreading and scrambling code generators, DPCH, S-CCPCH, HS-SCCH, HS-PDSCH, AICH, PICH, RACH preamble and TFCI detection algorithms and transmitter scaling mechanisms under power control. I verified the effectiveness of these by Matlab simulations and worked closely with FPGA/DSP engineers to ensure their successful implementation within project timelines. Independent Consultant Savant Consulting Limited, Oakville, Canada October 2005  –  July 2011  (5 years 10 months) In this role, I provided consulting services on the physical layer aspects of the 3GPP WCDMA/UMTS and LTE standards. I have designed scalable transmitter entities generating the downlink signals, including RS, synchronization signals, L1/L2 control channels and the broadcast channel, for the FDD mode of the LTE. On the WCDMA side, I have provided fixed-point designs/algorithms for both the transmitter and receiver sides of pico-cell base-stations. These have included QAM modulators, FHT, spreading and scrambling code generators, DPCH, S-CCPCH, HS-SCCH, HS-PDSCH, AICH, PICH, RACH preamble and TFCI detection algorithms and transmitter scaling mechanisms under power control. I verified the effectiveness of these by Matlab simulations and worked closely with FPGA/DSP engineers to ensure their successful implementation within project timelines. Senior Algorithms Engineer Ubinetics Limited/Aeroflex, Cambridge, UK August 2003  –  June 2005  (1 year 11 months) Design of downlink receiver algorithms for company’s WCDMA/UMTS based system-on-chip project and popular TM500 test mobile products were amongst my main responsibilities in this role. Provision of physical layer system support to various company teams/groups, investigation of more advanced receiver solutions, building WCDMA and LTE based link level Matlab simulators, fixed-point design/implementation of receiver algorithms using C were amongst my other responsibilities. In this period, I originated a number of peer-reviewed publications and patent proposals. Senior Algorithms Engineer Ubinetics Limited/Aeroflex, Cambridge, UK August 2003  –  June 2005  (1 year 11 months) Design of downlink receiver algorithms for company’s WCDMA/UMTS based system-on-chip project and popular TM500 test mobile products were amongst my main responsibilities in this role. Provision of physical layer system support to various company teams/groups, investigation of more advanced receiver solutions, building WCDMA and LTE based link level Matlab simulators, fixed-point design/implementation of receiver algorithms using C were amongst my other responsibilities. In this period, I originated a number of peer-reviewed publications and patent proposals. Senior Systems Engineer AT&T Wireless / Netro Corporation, Redmond, WA, USA February 2001  –  February 2003  (2 years 1 month) In this capacity, I designed and developed novel downlink transceiver algorithms for the AT&T’s OFDM based fixed-wireless Angel product. The designs included efficient synchronization, frequency tracking and SINR estimation techniques. Link level Matlab simulations were used to examine the effectiveness of the designs in various multipath channel scenarios. I also worked with RF hardware design engineers to design flexible RF filtering schemes for the next generation products. In this role, I submitted a multitude of patent proposals and was the author of numerous white papers. Senior Systems Engineer AT&T Wireless / Netro Corporation, Redmond, WA, USA February 2001  –  February 2003  (2 years 1 month) In this capacity, I designed and developed novel downlink transceiver algorithms for the AT&T’s OFDM based fixed-wireless Angel product. The designs included efficient synchronization, frequency tracking and SINR estimation techniques. Link level Matlab simulations were used to examine the effectiveness of the designs in various multipath channel scenarios. I also worked with RF hardware design engineers to design flexible RF filtering schemes for the next generation products. In this role, I submitted a multitude of patent proposals and was the author of numerous white papers. DSP Algorithms Consultant NEC Technologies (UK) Ltd, Reading, UK August 1999  –  February 2001  (1 year 7 months) As the lead engineer in the WCDMA/UMTS algorithms design team, I was responsible for the direction of the team’s activities and for the coordination of the team’s efforts with those of NEC Japan and Australia. The focus of my work was on the design of NEC’s handset cell search algorithm and solutions to the problems associated with its practical implementation. My work during this period resulted in numerous inventions, patent submissions and the NEC’s patent of the Year 2000 award. DSP Algorithms Consultant NEC Technologies (UK) Ltd, Reading, UK August 1999  –  February 2001  (1 year 7 months) As the lead engineer in the WCDMA/UMTS algorithms design team, I was responsible for the direction of the team’s activities and for the coordination of the team’s efforts with those of NEC Japan and Australia. The focus of my work was on the design of NEC’s handset cell search algorithm and solutions to the problems associated with its practical implementation. My work during this period resulted in numerous inventions, patent submissions and the NEC’s patent of the Year 2000 award. Principal Engineer Fujitsu Europe Telecom R&D Centre, Uxbridge, UK April 1997  –  July 1999  (2 years 4 months) I joined Fujitsu during the early days of WCDMA/UMTS standardization activities and amongst my first responsibilities was participation in the standardization meetings as the company representative. In parallel, I was involved in other technical activities resulting in generation of novel WCDMA-related algorithms and consequently patent proposals. I also provided a real-time flexible DSP-based solution for the Fujitsu’s WCDMA adaptive antenna array product, which I fully implemented using the Texas Instruments fixed-point TMS320C60. Principal Engineer Fujitsu Europe Telecom R&D Centre, Uxbridge, UK April 1997  –  July 1999  (2 years 4 months) I joined Fujitsu during the early days of WCDMA/UMTS standardization activities and amongst my first responsibilities was participation in the standardization meetings as the company representative. In parallel, I was involved in other technical activities resulting in generation of novel WCDMA-related algorithms and consequently patent proposals. I also provided a real-time flexible DSP-based solution for the Fujitsu’s WCDMA adaptive antenna array product, which I fully implemented using the Texas Instruments fixed-point TMS320C60. Research Associate (postdoctoral research) Centre for Communications Research, University of Bristol, UK October 1994  –  March 1997  (2 years 6 months) At CCR, I was responsible for a UK Engineering and Physical Sciences Research Council (EPSRC) funded project. In this project, I built a frequency hopping (FH) simulator modeling the modules of the FH transceiver together with a controllable multipath channel in C++. Subsequently, I implemented the transceiver modules and a real-time channel model in hardware and in DSP code using TI’s TMS320C30 and C40. Research Associate (postdoctoral research) Centre for Communications Research, University of Bristol, UK October 1994  –  March 1997  (2 years 6 months) At CCR, I was responsible for a UK Engineering and Physical Sciences Research Council (EPSRC) funded project. In this project, I built a frequency hopping (FH) simulator modeling the modules of the FH transceiver together with a controllable multipath channel in C++. Subsequently, I implemented the transceiver modules and a real-time channel model in hardware and in DSP code using TI’s TMS320C30 and C40. Ph.D. student (Ph.D. research) Centre for Communications Research, University of Bristol, UK October 1991  –  May 1995  (3 years 8 months) The focus of my Ph.D. project was on linearization of RF amplifiers. Through theoretical work and C simulations, I formulated the behaviour of the Cartesian feedback transmitter. I used the findings to swiftly design and construct the transmitter hardware prototype. Next, I enhanced the prototype to operate under frequency hopping conditions. The linearization bandwidth of the transmitter was increased by a factor of 12 by my invention of the twin-loop and phase-lag compensated transmitters and their derivatives. I developed a variety of DSP (TI’s TMS320C25) controlled techniques to compensate for practical imperfections of transmitter modules. This work resulted in a number of journal and conference publications. Ph.D. student (Ph.D. research) Centre for Communications Research, University of Bristol, UK October 1991  –  May 1995  (3 years 8 months) The focus of my Ph.D. project was on linearization of RF amplifiers. Through theoretical work and C simulations, I formulated the behaviour of the Cartesian feedback transmitter. I used the findings to swiftly design and construct the transmitter hardware prototype. Next, I enhanced the prototype to operate under frequency hopping conditions. The linearization bandwidth of the transmitter was increased by a factor of 12 by my invention of the twin-loop and phase-lag compensated transmitters and their derivatives. I developed a variety of DSP (TI’s TMS320C25) controlled techniques to compensate for practical imperfections of transmitter modules. This work resulted in a number of journal and conference publications. Skills Top Skills 4 Digital Signal... 4 LTE 3 RF 3 Wireless 3 WCDMA 3 Algorithms 2 Simulations 2 Matlab 1 3G 1 C Majid also knows about... 1 3GPP 1 C++ 1 Digital Signal... 0 Telecommunications 0 Systems Engineering 0 4G 0 OFDM Skills  Top Skills 4 Digital Signal... 4 LTE 3 RF 3 Wireless 3 WCDMA 3 Algorithms 2 Simulations 2 Matlab 1 3G 1 C Majid also knows about... 1 3GPP 1 C++ 1 Digital Signal... 0 Telecommunications 0 Systems Engineering 0 4G 0 OFDM Top Skills 4 Digital Signal... 4 LTE 3 RF 3 Wireless 3 WCDMA 3 Algorithms 2 Simulations 2 Matlab 1 3G 1 C Majid also knows about... 1 3GPP 1 C++ 1 Digital Signal... 0 Telecommunications 0 Systems Engineering 0 4G 0 OFDM Top Skills 4 Digital Signal... 4 LTE 3 RF 3 Wireless 3 WCDMA 3 Algorithms 2 Simulations 2 Matlab 1 3G 1 C Majid also knows about... 1 3GPP 1 C++ 1 Digital Signal... 0 Telecommunications 0 Systems Engineering 0 4G 0 OFDM                     1 3GPP 1 C++ 1 Digital Signal... 0 Telecommunications 0 Systems Engineering 0 4G 0 OFDM Education University of Bristol, UK Ph.D.,  Electrical and Electronics Engineering (with a telecommunications focus) 1991  – 1995 Thesis title: \"Linearization of RF amplifiers using  \nthe Cartesian feedback technique\" The University of Manchester B.Eng. (Hons.),  Electrical and Electronics Engineering 1987  – 1990 University of Bristol, UK Ph.D.,  Electrical and Electronics Engineering (with a telecommunications focus) 1991  – 1995 Thesis title: \"Linearization of RF amplifiers using  \nthe Cartesian feedback technique\" University of Bristol, UK Ph.D.,  Electrical and Electronics Engineering (with a telecommunications focus) 1991  – 1995 Thesis title: \"Linearization of RF amplifiers using  \nthe Cartesian feedback technique\" University of Bristol, UK Ph.D.,  Electrical and Electronics Engineering (with a telecommunications focus) 1991  – 1995 Thesis title: \"Linearization of RF amplifiers using  \nthe Cartesian feedback technique\" The University of Manchester B.Eng. (Hons.),  Electrical and Electronics Engineering 1987  – 1990 The University of Manchester B.Eng. (Hons.),  Electrical and Electronics Engineering 1987  – 1990 The University of Manchester B.Eng. (Hons.),  Electrical and Electronics Engineering 1987  – 1990 Honors & Awards Additional Honors & Awards Patents and publications Additional Honors & Awards Patents and publications Additional Honors & Awards Patents and publications Additional Honors & Awards Patents and publications ", "Experience Senior Systems Engineer Intel December 2000  – Present (14 years 9 months) Senior Systems Engineer Intel December 2000  – Present (14 years 9 months) Senior Systems Engineer Intel December 2000  – Present (14 years 9 months) Skills Skills     ", "Summary Senior Systems Engineer with a wealth of knowledge, experience and skills to help your company be successful. Expertise in many areas with emphasis in Microsoft Clustering (MSCS), Storage Area Networks (SAN), Virtualization, System Monitoring, Disaster Recovery and Backup and Restore. Summary Senior Systems Engineer with a wealth of knowledge, experience and skills to help your company be successful. Expertise in many areas with emphasis in Microsoft Clustering (MSCS), Storage Area Networks (SAN), Virtualization, System Monitoring, Disaster Recovery and Backup and Restore. Senior Systems Engineer with a wealth of knowledge, experience and skills to help your company be successful. Expertise in many areas with emphasis in Microsoft Clustering (MSCS), Storage Area Networks (SAN), Virtualization, System Monitoring, Disaster Recovery and Backup and Restore. Senior Systems Engineer with a wealth of knowledge, experience and skills to help your company be successful. Expertise in many areas with emphasis in Microsoft Clustering (MSCS), Storage Area Networks (SAN), Virtualization, System Monitoring, Disaster Recovery and Backup and Restore. Experience Senior Systems Engineer Intel Corporation 2000  – Present (15 years) Hudson, Massachusetts • Technical Team Lead in charge of installation, troubleshooting, maintenance and support of all hardware, operating systems and layered products in our Windows, Linux and UNIX-based server environment. Provided technical direction, mentoring and support to members of the Platforms team. Provided training to other Systems Engineers in Microsoft Cluster Server and Storage Area Networks.  \n• Drove all aspects of the purchase, installation, configuration and support of HP ProLiant servers, HP EVA5000 and EVA8000 Enterprise Virtual Arrays and associated Brocade Fibre-channel switches. Suggested some design changes that resulted in a cost savings of $125,000.  \n• Utilized VMware Converter to migrate 40% of our physical servers to Virtual Machines. \n• Completed a critical Disaster Recovery deliverable by migrating all 270 Windows, Linux, UNIX, NetApp and VMS server backups from an older NetBackup tape library-based backup environment to a newer, more cost effective, and reliable Virtual Tape Library (VTL). \n• Established the infrastructure for 5 Oracle RAC clusters. \n• Installation, maintenance and support of System Center Operations Manager (SCOM) and HP Systems Insight Manager (HPSIM).  \n• Developed numerous administrative scripts to make administration tasks easier and improve the monitoring of our server environment. Improved the overall reliability and monitoring of the windows server and storage environments, maintaining a very robust and healthy Platforms environment. \n• Utilized Altiris to deploy both physical and virtual servers. \n• Managed manufacturing-wide migration to Windows 2000. Gained valuable corporate recognition.  \n• Responded to multiple virus outbreaks including Code Red, Blaster, NIMDA and Sality. \n• Implemented SLA changes for redundant hardware saving 50% on the cost of vendor maintenance. \n• Event Manager for adoption of ITIL. \n• Received multiple Divisional Recognition Awards and an award from Intel CIO Diane Bryant. Principal Staff Engineer NEC Corporation - Server Business Unit 1997  –  2000  (3 years) Boxboro, Massachusetts • Technical Team Lead for Windows 2000 Server compatibility testing. Participated in weekly conference calls with Microsoft’s OEM Recon group. Headed the company’s compatibility testing efforts. \n• Led Microsoft Cluster Server MSCS (Wolfpack) Hardware Compatibility Testing (HCT) of NEC Intel-based servers with Data General CLARiiON and EMC Symmetrix Fibre-Channel disk storage arrays. Worked with storage vendors to resolve configuration issues. \n• Created a worldwide Server Engineering Technical Support site, a high-availability clustered RAID 5 configuration with Microsoft BackOffice Server software. Implemented the solution using Microsoft Windows NT Server Enterprise Edition, Internet Information Server IIS, Active Server Pages ASP, ActiveX, HTML, VBScript, Exchange Server, SQLServer 6.5/7.0, Index Server, Visual Studio, Visual InterDev, FrontPage, Crystal Report Writer and Adobe Acrobat. The site was ported on four different occasions to systems sent to various trade show events, including two visits to COMDEX. \n• In the role of Technical Team Lead for Microsoft BackOffice Small Business Server, uncovered problems with the modems that were selected for use, took the lead in getting Microsoft and 3Com to jointly help in developing a solution. Senior Staff Engineer NEC Corporation - Server Business Unit 1994  –  1997  (3 years) • Liaison with Intel’s Enterprise Server Group. Provided sustaining engineering support for Intel-based servers. Technical Team Lead for the introduction of new Intel servers into manufacturing with hands-on training and documentation. \n• Technical Team Lead for System Level Test, led effort to certify Microsoft Windows NT Server 4.0 on all current product offerings. \n• Introduced Motorola PowerPC-based servers into the product line, supporting IBM’s AIX version of UNIX and Microsoft Windows NT 3.51. Supported testing of SCO UNIX, Sun Solaris and Novell Netware. Staff Engineer Honeywell Information Systems 1981  –  1994  (13 years) Billerica, Massachusetts • Provided customer support of ORACLE, Informix and Ingres relational databases running under IBM’s AIX version of UNIX on Bull Unix and IBM RS/6000 hardware. \n• Implemented Client/Server project management system using Gupta SQL Base. \n• Designed a Computer Support Services Billing System using ORACLE SQL*Plus, PL/SQL, SQL*Forms, and SQL*Report under IBM’s AIX UNIX Operating System.\t \n• Provided training and support to Personal Computer users through the Information Resource Center. \n• Designed and implemented numerous computer-based Management Information and Decision Support Systems including Product Cost Tracking, man loading, Planning and Shipment Reporting Systems. \n• Received Vice President’s Award for Excellence for outstanding support to Finance and Administration. \n• Faculty member – Honeywell Financial Development Program \n• Graduate – Honeywell Manufacturing Studies Program Technical Co-Op to Principal Engineer Honeywell Information Systems 1967  –  1981  (14 years) Brighton, Massachusetts • Advanced through the Engineering ranks at Honeywell from Technical Co-Op, Associate Industrial Engineer, Industrial Engineer, Senior Industrial Engineer and Principal Engineer. \n• Led groups of Industrial Engineers in cost reduction efforts, conducting time studies, setting labor standards, generating plant layouts and the preparation of product cost estimates, method and workplace layouts, and Process Summaries. \n• Assisted in the design, development and implementation of a Factory Control System and a real-time Labor Collection and Reporting System. \n• Designed systems for the generation of manloading requirements, capacity analysis, Process Summaries and Product Cost Estimates. \n• Designed a computerized Engineering Change Order Tracking System using COBOL. \n• Designed and implemented a system for generating labor standards and a labor reporting system using FORTRAN. Senior Systems Engineer Intel Corporation 2000  – Present (15 years) Hudson, Massachusetts • Technical Team Lead in charge of installation, troubleshooting, maintenance and support of all hardware, operating systems and layered products in our Windows, Linux and UNIX-based server environment. Provided technical direction, mentoring and support to members of the Platforms team. Provided training to other Systems Engineers in Microsoft Cluster Server and Storage Area Networks.  \n• Drove all aspects of the purchase, installation, configuration and support of HP ProLiant servers, HP EVA5000 and EVA8000 Enterprise Virtual Arrays and associated Brocade Fibre-channel switches. Suggested some design changes that resulted in a cost savings of $125,000.  \n• Utilized VMware Converter to migrate 40% of our physical servers to Virtual Machines. \n• Completed a critical Disaster Recovery deliverable by migrating all 270 Windows, Linux, UNIX, NetApp and VMS server backups from an older NetBackup tape library-based backup environment to a newer, more cost effective, and reliable Virtual Tape Library (VTL). \n• Established the infrastructure for 5 Oracle RAC clusters. \n• Installation, maintenance and support of System Center Operations Manager (SCOM) and HP Systems Insight Manager (HPSIM).  \n• Developed numerous administrative scripts to make administration tasks easier and improve the monitoring of our server environment. Improved the overall reliability and monitoring of the windows server and storage environments, maintaining a very robust and healthy Platforms environment. \n• Utilized Altiris to deploy both physical and virtual servers. \n• Managed manufacturing-wide migration to Windows 2000. Gained valuable corporate recognition.  \n• Responded to multiple virus outbreaks including Code Red, Blaster, NIMDA and Sality. \n• Implemented SLA changes for redundant hardware saving 50% on the cost of vendor maintenance. \n• Event Manager for adoption of ITIL. \n• Received multiple Divisional Recognition Awards and an award from Intel CIO Diane Bryant. Senior Systems Engineer Intel Corporation 2000  – Present (15 years) Hudson, Massachusetts • Technical Team Lead in charge of installation, troubleshooting, maintenance and support of all hardware, operating systems and layered products in our Windows, Linux and UNIX-based server environment. Provided technical direction, mentoring and support to members of the Platforms team. Provided training to other Systems Engineers in Microsoft Cluster Server and Storage Area Networks.  \n• Drove all aspects of the purchase, installation, configuration and support of HP ProLiant servers, HP EVA5000 and EVA8000 Enterprise Virtual Arrays and associated Brocade Fibre-channel switches. Suggested some design changes that resulted in a cost savings of $125,000.  \n• Utilized VMware Converter to migrate 40% of our physical servers to Virtual Machines. \n• Completed a critical Disaster Recovery deliverable by migrating all 270 Windows, Linux, UNIX, NetApp and VMS server backups from an older NetBackup tape library-based backup environment to a newer, more cost effective, and reliable Virtual Tape Library (VTL). \n• Established the infrastructure for 5 Oracle RAC clusters. \n• Installation, maintenance and support of System Center Operations Manager (SCOM) and HP Systems Insight Manager (HPSIM).  \n• Developed numerous administrative scripts to make administration tasks easier and improve the monitoring of our server environment. Improved the overall reliability and monitoring of the windows server and storage environments, maintaining a very robust and healthy Platforms environment. \n• Utilized Altiris to deploy both physical and virtual servers. \n• Managed manufacturing-wide migration to Windows 2000. Gained valuable corporate recognition.  \n• Responded to multiple virus outbreaks including Code Red, Blaster, NIMDA and Sality. \n• Implemented SLA changes for redundant hardware saving 50% on the cost of vendor maintenance. \n• Event Manager for adoption of ITIL. \n• Received multiple Divisional Recognition Awards and an award from Intel CIO Diane Bryant. Principal Staff Engineer NEC Corporation - Server Business Unit 1997  –  2000  (3 years) Boxboro, Massachusetts • Technical Team Lead for Windows 2000 Server compatibility testing. Participated in weekly conference calls with Microsoft’s OEM Recon group. Headed the company’s compatibility testing efforts. \n• Led Microsoft Cluster Server MSCS (Wolfpack) Hardware Compatibility Testing (HCT) of NEC Intel-based servers with Data General CLARiiON and EMC Symmetrix Fibre-Channel disk storage arrays. Worked with storage vendors to resolve configuration issues. \n• Created a worldwide Server Engineering Technical Support site, a high-availability clustered RAID 5 configuration with Microsoft BackOffice Server software. Implemented the solution using Microsoft Windows NT Server Enterprise Edition, Internet Information Server IIS, Active Server Pages ASP, ActiveX, HTML, VBScript, Exchange Server, SQLServer 6.5/7.0, Index Server, Visual Studio, Visual InterDev, FrontPage, Crystal Report Writer and Adobe Acrobat. The site was ported on four different occasions to systems sent to various trade show events, including two visits to COMDEX. \n• In the role of Technical Team Lead for Microsoft BackOffice Small Business Server, uncovered problems with the modems that were selected for use, took the lead in getting Microsoft and 3Com to jointly help in developing a solution. Principal Staff Engineer NEC Corporation - Server Business Unit 1997  –  2000  (3 years) Boxboro, Massachusetts • Technical Team Lead for Windows 2000 Server compatibility testing. Participated in weekly conference calls with Microsoft’s OEM Recon group. Headed the company’s compatibility testing efforts. \n• Led Microsoft Cluster Server MSCS (Wolfpack) Hardware Compatibility Testing (HCT) of NEC Intel-based servers with Data General CLARiiON and EMC Symmetrix Fibre-Channel disk storage arrays. Worked with storage vendors to resolve configuration issues. \n• Created a worldwide Server Engineering Technical Support site, a high-availability clustered RAID 5 configuration with Microsoft BackOffice Server software. Implemented the solution using Microsoft Windows NT Server Enterprise Edition, Internet Information Server IIS, Active Server Pages ASP, ActiveX, HTML, VBScript, Exchange Server, SQLServer 6.5/7.0, Index Server, Visual Studio, Visual InterDev, FrontPage, Crystal Report Writer and Adobe Acrobat. The site was ported on four different occasions to systems sent to various trade show events, including two visits to COMDEX. \n• In the role of Technical Team Lead for Microsoft BackOffice Small Business Server, uncovered problems with the modems that were selected for use, took the lead in getting Microsoft and 3Com to jointly help in developing a solution. Senior Staff Engineer NEC Corporation - Server Business Unit 1994  –  1997  (3 years) • Liaison with Intel’s Enterprise Server Group. Provided sustaining engineering support for Intel-based servers. Technical Team Lead for the introduction of new Intel servers into manufacturing with hands-on training and documentation. \n• Technical Team Lead for System Level Test, led effort to certify Microsoft Windows NT Server 4.0 on all current product offerings. \n• Introduced Motorola PowerPC-based servers into the product line, supporting IBM’s AIX version of UNIX and Microsoft Windows NT 3.51. Supported testing of SCO UNIX, Sun Solaris and Novell Netware. Senior Staff Engineer NEC Corporation - Server Business Unit 1994  –  1997  (3 years) • Liaison with Intel’s Enterprise Server Group. Provided sustaining engineering support for Intel-based servers. Technical Team Lead for the introduction of new Intel servers into manufacturing with hands-on training and documentation. \n• Technical Team Lead for System Level Test, led effort to certify Microsoft Windows NT Server 4.0 on all current product offerings. \n• Introduced Motorola PowerPC-based servers into the product line, supporting IBM’s AIX version of UNIX and Microsoft Windows NT 3.51. Supported testing of SCO UNIX, Sun Solaris and Novell Netware. Staff Engineer Honeywell Information Systems 1981  –  1994  (13 years) Billerica, Massachusetts • Provided customer support of ORACLE, Informix and Ingres relational databases running under IBM’s AIX version of UNIX on Bull Unix and IBM RS/6000 hardware. \n• Implemented Client/Server project management system using Gupta SQL Base. \n• Designed a Computer Support Services Billing System using ORACLE SQL*Plus, PL/SQL, SQL*Forms, and SQL*Report under IBM’s AIX UNIX Operating System.\t \n• Provided training and support to Personal Computer users through the Information Resource Center. \n• Designed and implemented numerous computer-based Management Information and Decision Support Systems including Product Cost Tracking, man loading, Planning and Shipment Reporting Systems. \n• Received Vice President’s Award for Excellence for outstanding support to Finance and Administration. \n• Faculty member – Honeywell Financial Development Program \n• Graduate – Honeywell Manufacturing Studies Program Staff Engineer Honeywell Information Systems 1981  –  1994  (13 years) Billerica, Massachusetts • Provided customer support of ORACLE, Informix and Ingres relational databases running under IBM’s AIX version of UNIX on Bull Unix and IBM RS/6000 hardware. \n• Implemented Client/Server project management system using Gupta SQL Base. \n• Designed a Computer Support Services Billing System using ORACLE SQL*Plus, PL/SQL, SQL*Forms, and SQL*Report under IBM’s AIX UNIX Operating System.\t \n• Provided training and support to Personal Computer users through the Information Resource Center. \n• Designed and implemented numerous computer-based Management Information and Decision Support Systems including Product Cost Tracking, man loading, Planning and Shipment Reporting Systems. \n• Received Vice President’s Award for Excellence for outstanding support to Finance and Administration. \n• Faculty member – Honeywell Financial Development Program \n• Graduate – Honeywell Manufacturing Studies Program Technical Co-Op to Principal Engineer Honeywell Information Systems 1967  –  1981  (14 years) Brighton, Massachusetts • Advanced through the Engineering ranks at Honeywell from Technical Co-Op, Associate Industrial Engineer, Industrial Engineer, Senior Industrial Engineer and Principal Engineer. \n• Led groups of Industrial Engineers in cost reduction efforts, conducting time studies, setting labor standards, generating plant layouts and the preparation of product cost estimates, method and workplace layouts, and Process Summaries. \n• Assisted in the design, development and implementation of a Factory Control System and a real-time Labor Collection and Reporting System. \n• Designed systems for the generation of manloading requirements, capacity analysis, Process Summaries and Product Cost Estimates. \n• Designed a computerized Engineering Change Order Tracking System using COBOL. \n• Designed and implemented a system for generating labor standards and a labor reporting system using FORTRAN. Technical Co-Op to Principal Engineer Honeywell Information Systems 1967  –  1981  (14 years) Brighton, Massachusetts • Advanced through the Engineering ranks at Honeywell from Technical Co-Op, Associate Industrial Engineer, Industrial Engineer, Senior Industrial Engineer and Principal Engineer. \n• Led groups of Industrial Engineers in cost reduction efforts, conducting time studies, setting labor standards, generating plant layouts and the preparation of product cost estimates, method and workplace layouts, and Process Summaries. \n• Assisted in the design, development and implementation of a Factory Control System and a real-time Labor Collection and Reporting System. \n• Designed systems for the generation of manloading requirements, capacity analysis, Process Summaries and Product Cost Estimates. \n• Designed a computerized Engineering Change Order Tracking System using COBOL. \n• Designed and implemented a system for generating labor standards and a labor reporting system using FORTRAN. Skills Top Skills 7 Debugging 7 Computer Architecture 7 SAN 6 Semiconductors 6 Windows Server 5 System Architecture 5 Linux 4 Storage Area Networks 4 Device Drivers 4 Hardware Architecture Michael also knows about... 3 Veritas Volume Manager 3 Embedded Systems 2 SoC 2 Embedded Software 2 Processors Skills  Top Skills 7 Debugging 7 Computer Architecture 7 SAN 6 Semiconductors 6 Windows Server 5 System Architecture 5 Linux 4 Storage Area Networks 4 Device Drivers 4 Hardware Architecture Michael also knows about... 3 Veritas Volume Manager 3 Embedded Systems 2 SoC 2 Embedded Software 2 Processors Top Skills 7 Debugging 7 Computer Architecture 7 SAN 6 Semiconductors 6 Windows Server 5 System Architecture 5 Linux 4 Storage Area Networks 4 Device Drivers 4 Hardware Architecture Michael also knows about... 3 Veritas Volume Manager 3 Embedded Systems 2 SoC 2 Embedded Software 2 Processors Top Skills 7 Debugging 7 Computer Architecture 7 SAN 6 Semiconductors 6 Windows Server 5 System Architecture 5 Linux 4 Storage Area Networks 4 Device Drivers 4 Hardware Architecture Michael also knows about... 3 Veritas Volume Manager 3 Embedded Systems 2 SoC 2 Embedded Software 2 Processors                     3 Veritas Volume Manager 3 Embedded Systems 2 SoC 2 Embedded Software 2 Processors Education Northeastern University Bachelor of Science in Industrial Engineering,  Information Technology 1966  – 1972 Non-Commissioned Officer U.S. Army R.O.T.C. Activities and Societies:  WNEU and WRBB-FM college radio stations. Northeastern University Bachelor of Science in Industrial Engineering,  Information Technology 1966  – 1972 Non-Commissioned Officer U.S. Army R.O.T.C. Activities and Societies:  WNEU and WRBB-FM college radio stations. Northeastern University Bachelor of Science in Industrial Engineering,  Information Technology 1966  – 1972 Non-Commissioned Officer U.S. Army R.O.T.C. Activities and Societies:  WNEU and WRBB-FM college radio stations. Northeastern University Bachelor of Science in Industrial Engineering,  Information Technology 1966  – 1972 Non-Commissioned Officer U.S. Army R.O.T.C. Activities and Societies:  WNEU and WRBB-FM college radio stations. ", "Summary Systems Engineer, Solutions Engineer, Technical Architect, Technical Lead with over 25 years of experience designing, developing and maintaining application solutions and application on the Microsoft stack. Experienced in multiple software life cycle development methodologies, include the Microsoft Solution Framework for Agile Development and Microsoft’s implementation of Scrum.  \n \nProven technical leadership, project management and communications skills demonstrated in large and small scale information technology projects. Enjoys the opportunity to perform technical evangelism with customers and development team in support of specific business solutions. \n \nSeeking a challenging senior position with as a team member to deliver business solutions based on the Microsoft technology stack. Current technology focus has been on SharePoint 2010/2013 designs and implementation work, as well as .NET application development to support business solutions.  \n \nComplementing my technical leadership and architecture experience, I have recent hands-on system integration experience with Windows Servers, SharePoint and Visual Studio Team Foundation Server. I have a good knowledge of C# and can work as a team member on software development projects. \n \nSome of my recent experience include creation of a custom authentication provider for an Internet facing SharePoint 2013 site, Design, Implementation, Management of an Enterprise Level SharePoint Intranet for a Manufacturing Company, Design and Technical Leadership of a team working on a .NET Application based on WCF Services, and an Application/Security Assessment of an extranet Application in preparation for a software and database redesign. \n \nMy Experience with the Microsoft Solution Stack in both the Systems Engineering and Solutions Development areas allows me to work well in a team environment. Summary Systems Engineer, Solutions Engineer, Technical Architect, Technical Lead with over 25 years of experience designing, developing and maintaining application solutions and application on the Microsoft stack. Experienced in multiple software life cycle development methodologies, include the Microsoft Solution Framework for Agile Development and Microsoft’s implementation of Scrum.  \n \nProven technical leadership, project management and communications skills demonstrated in large and small scale information technology projects. Enjoys the opportunity to perform technical evangelism with customers and development team in support of specific business solutions. \n \nSeeking a challenging senior position with as a team member to deliver business solutions based on the Microsoft technology stack. Current technology focus has been on SharePoint 2010/2013 designs and implementation work, as well as .NET application development to support business solutions.  \n \nComplementing my technical leadership and architecture experience, I have recent hands-on system integration experience with Windows Servers, SharePoint and Visual Studio Team Foundation Server. I have a good knowledge of C# and can work as a team member on software development projects. \n \nSome of my recent experience include creation of a custom authentication provider for an Internet facing SharePoint 2013 site, Design, Implementation, Management of an Enterprise Level SharePoint Intranet for a Manufacturing Company, Design and Technical Leadership of a team working on a .NET Application based on WCF Services, and an Application/Security Assessment of an extranet Application in preparation for a software and database redesign. \n \nMy Experience with the Microsoft Solution Stack in both the Systems Engineering and Solutions Development areas allows me to work well in a team environment. Systems Engineer, Solutions Engineer, Technical Architect, Technical Lead with over 25 years of experience designing, developing and maintaining application solutions and application on the Microsoft stack. Experienced in multiple software life cycle development methodologies, include the Microsoft Solution Framework for Agile Development and Microsoft’s implementation of Scrum.  \n \nProven technical leadership, project management and communications skills demonstrated in large and small scale information technology projects. Enjoys the opportunity to perform technical evangelism with customers and development team in support of specific business solutions. \n \nSeeking a challenging senior position with as a team member to deliver business solutions based on the Microsoft technology stack. Current technology focus has been on SharePoint 2010/2013 designs and implementation work, as well as .NET application development to support business solutions.  \n \nComplementing my technical leadership and architecture experience, I have recent hands-on system integration experience with Windows Servers, SharePoint and Visual Studio Team Foundation Server. I have a good knowledge of C# and can work as a team member on software development projects. \n \nSome of my recent experience include creation of a custom authentication provider for an Internet facing SharePoint 2013 site, Design, Implementation, Management of an Enterprise Level SharePoint Intranet for a Manufacturing Company, Design and Technical Leadership of a team working on a .NET Application based on WCF Services, and an Application/Security Assessment of an extranet Application in preparation for a software and database redesign. \n \nMy Experience with the Microsoft Solution Stack in both the Systems Engineering and Solutions Development areas allows me to work well in a team environment. Systems Engineer, Solutions Engineer, Technical Architect, Technical Lead with over 25 years of experience designing, developing and maintaining application solutions and application on the Microsoft stack. Experienced in multiple software life cycle development methodologies, include the Microsoft Solution Framework for Agile Development and Microsoft’s implementation of Scrum.  \n \nProven technical leadership, project management and communications skills demonstrated in large and small scale information technology projects. Enjoys the opportunity to perform technical evangelism with customers and development team in support of specific business solutions. \n \nSeeking a challenging senior position with as a team member to deliver business solutions based on the Microsoft technology stack. Current technology focus has been on SharePoint 2010/2013 designs and implementation work, as well as .NET application development to support business solutions.  \n \nComplementing my technical leadership and architecture experience, I have recent hands-on system integration experience with Windows Servers, SharePoint and Visual Studio Team Foundation Server. I have a good knowledge of C# and can work as a team member on software development projects. \n \nSome of my recent experience include creation of a custom authentication provider for an Internet facing SharePoint 2013 site, Design, Implementation, Management of an Enterprise Level SharePoint Intranet for a Manufacturing Company, Design and Technical Leadership of a team working on a .NET Application based on WCF Services, and an Application/Security Assessment of an extranet Application in preparation for a software and database redesign. \n \nMy Experience with the Microsoft Solution Stack in both the Systems Engineering and Solutions Development areas allows me to work well in a team environment. Experience Principal Consultant Tektanium Inc. April 2001  – Present (14 years 5 months) Damascus, Oregon Independent Consultant focused on Microsoft SharePoint and Office 365 Technologies. Office Automation for any size company is now possible using the Office 365 Platform. My focus has been on design and implementation of the SharePoint Platform, I also have a focus on SharePoint Development. (Open) 2 courses Sharepoint 2010 Branding Experience (2010) Sharepoint Web Developer Experience (All) See more Mobile Marketing Consultant Collaboration Secrets January 2011  – Present (4 years 8 months) Damascus Oregon Mobile Marketing Consultant focused on delivering Premium Mobile Solutions that improve the reach and profits for local business owners. My focus is bring the best technologies together that help leverage your online assets to connect with your customers on their mobile devices. Axia College Faciliator University of Phoenix January 2000  –  April 2013  (13 years 4 months) Facilitator for PC Applications Support - IT/206 SharePoint Architect/Administrator A-dec 2003  –  2013  (10 years) SharePoint is a platform for improving business collaboration. Because of SharePoint's flexibility, building the right solution, in the right way is important. My focus is to provide ways for management to begin to automate and maintain the business processes that keep the business moving forward.  \nFor most businesses this means building a robust, highly available SharePoint infrastructure that users can depend on. The challenge is having a vision for where the company wants collaboration and content management to go in the future. In 1990, Bill Gates described a concept, \"Information at your Fingertips\". SharePoint done right moves us closer to that vision. .NET Architect Pacfic Crest Technology May 2005  –  September 2005  (5 months) Consulting and project work focused on delivery of Microsoft .NET based solutions. Senior Technical Architect ServerLogic Corporation January 2004  –  May 2004  (5 months) Project: Senior Technical Architect \nRole: Architect/Developer/Consultant/Instructor \nProject Detail: \n \n· Design, installation, configuration and deployment of Microsoft CRM Version 1.2. \n \n· Design, installation, configuration and deployment of Microsoft Sharepoint 2003 \n \n· Developed Microsoft CRM sales process workflow for the initial roll out. \n \n· Used the Microsoft CRM Implementation Toolkit as a deployment tool. \n \n· Consulting for Microsoft Exchange 2003 deployment. \n \n· Consulting for Microsoft Active Directory Migration \n \nDuration: Jan 2004 – Apr 2004 \nEnvironment: Microsoft Windows XP/2000, Windows 200 Server, Windows 2003 Server, IIS 5.0, IIS 6.0, Microsoft Exchange 2000, Microsoft SQL Server 2000 (Open) 1 recommendation Don Meyers Enterprise Architect Manager / IT R&D Chair at Intel Corporation Don held various senior IT engineering, architecture, and project/program mgmt roles. He is organized and detail oriented with exceptional technical skills. Performs well in a variety of roles within an organization and through the product... View Senior Systems Engineer Intel Corporation September 1990  –  May 2001  (10 years 9 months) Intel Corporation, Folsom, CA. (Employee)  \nSystem Engineer/Programmer/Analyst/Consultant \n \nProvided 3rd level System Engineering support for cc:Mail and Exchange Messaging systems.  \n \nProject Lead on a variety of system implementation and migrations projects. \n \nInternal and External consulting experience with Microsoft technologies. \n \nWeb Application Development team leadership and experience. (Open) 1 recommendation Ed Braaten Sr. Software Engineer at Intel Corporation Don possesses an extraordinary drive and dedication to get things done. When Don worked for me at Intel, I could always count on him to keep even the largest enterprise deployment on track. Don delivers! View Principal Consultant Tektanium Inc. April 2001  – Present (14 years 5 months) Damascus, Oregon Independent Consultant focused on Microsoft SharePoint and Office 365 Technologies. Office Automation for any size company is now possible using the Office 365 Platform. My focus has been on design and implementation of the SharePoint Platform, I also have a focus on SharePoint Development. (Open) 2 courses Sharepoint 2010 Branding Experience (2010) Sharepoint Web Developer Experience (All) See more Principal Consultant Tektanium Inc. April 2001  – Present (14 years 5 months) Damascus, Oregon Independent Consultant focused on Microsoft SharePoint and Office 365 Technologies. Office Automation for any size company is now possible using the Office 365 Platform. My focus has been on design and implementation of the SharePoint Platform, I also have a focus on SharePoint Development. (Open) 2 courses Sharepoint 2010 Branding Experience (2010) Sharepoint Web Developer Experience (All) See more Mobile Marketing Consultant Collaboration Secrets January 2011  – Present (4 years 8 months) Damascus Oregon Mobile Marketing Consultant focused on delivering Premium Mobile Solutions that improve the reach and profits for local business owners. My focus is bring the best technologies together that help leverage your online assets to connect with your customers on their mobile devices. Mobile Marketing Consultant Collaboration Secrets January 2011  – Present (4 years 8 months) Damascus Oregon Mobile Marketing Consultant focused on delivering Premium Mobile Solutions that improve the reach and profits for local business owners. My focus is bring the best technologies together that help leverage your online assets to connect with your customers on their mobile devices. Axia College Faciliator University of Phoenix January 2000  –  April 2013  (13 years 4 months) Facilitator for PC Applications Support - IT/206 Axia College Faciliator University of Phoenix January 2000  –  April 2013  (13 years 4 months) Facilitator for PC Applications Support - IT/206 SharePoint Architect/Administrator A-dec 2003  –  2013  (10 years) SharePoint is a platform for improving business collaboration. Because of SharePoint's flexibility, building the right solution, in the right way is important. My focus is to provide ways for management to begin to automate and maintain the business processes that keep the business moving forward.  \nFor most businesses this means building a robust, highly available SharePoint infrastructure that users can depend on. The challenge is having a vision for where the company wants collaboration and content management to go in the future. In 1990, Bill Gates described a concept, \"Information at your Fingertips\". SharePoint done right moves us closer to that vision. SharePoint Architect/Administrator A-dec 2003  –  2013  (10 years) SharePoint is a platform for improving business collaboration. Because of SharePoint's flexibility, building the right solution, in the right way is important. My focus is to provide ways for management to begin to automate and maintain the business processes that keep the business moving forward.  \nFor most businesses this means building a robust, highly available SharePoint infrastructure that users can depend on. The challenge is having a vision for where the company wants collaboration and content management to go in the future. In 1990, Bill Gates described a concept, \"Information at your Fingertips\". SharePoint done right moves us closer to that vision. .NET Architect Pacfic Crest Technology May 2005  –  September 2005  (5 months) Consulting and project work focused on delivery of Microsoft .NET based solutions. .NET Architect Pacfic Crest Technology May 2005  –  September 2005  (5 months) Consulting and project work focused on delivery of Microsoft .NET based solutions. Senior Technical Architect ServerLogic Corporation January 2004  –  May 2004  (5 months) Project: Senior Technical Architect \nRole: Architect/Developer/Consultant/Instructor \nProject Detail: \n \n· Design, installation, configuration and deployment of Microsoft CRM Version 1.2. \n \n· Design, installation, configuration and deployment of Microsoft Sharepoint 2003 \n \n· Developed Microsoft CRM sales process workflow for the initial roll out. \n \n· Used the Microsoft CRM Implementation Toolkit as a deployment tool. \n \n· Consulting for Microsoft Exchange 2003 deployment. \n \n· Consulting for Microsoft Active Directory Migration \n \nDuration: Jan 2004 – Apr 2004 \nEnvironment: Microsoft Windows XP/2000, Windows 200 Server, Windows 2003 Server, IIS 5.0, IIS 6.0, Microsoft Exchange 2000, Microsoft SQL Server 2000 (Open) 1 recommendation Don Meyers Enterprise Architect Manager / IT R&D Chair at Intel Corporation Don held various senior IT engineering, architecture, and project/program mgmt roles. He is organized and detail oriented with exceptional technical skills. Performs well in a variety of roles within an organization and through the product... View Senior Technical Architect ServerLogic Corporation January 2004  –  May 2004  (5 months) Project: Senior Technical Architect \nRole: Architect/Developer/Consultant/Instructor \nProject Detail: \n \n· Design, installation, configuration and deployment of Microsoft CRM Version 1.2. \n \n· Design, installation, configuration and deployment of Microsoft Sharepoint 2003 \n \n· Developed Microsoft CRM sales process workflow for the initial roll out. \n \n· Used the Microsoft CRM Implementation Toolkit as a deployment tool. \n \n· Consulting for Microsoft Exchange 2003 deployment. \n \n· Consulting for Microsoft Active Directory Migration \n \nDuration: Jan 2004 – Apr 2004 \nEnvironment: Microsoft Windows XP/2000, Windows 200 Server, Windows 2003 Server, IIS 5.0, IIS 6.0, Microsoft Exchange 2000, Microsoft SQL Server 2000 (Open) 1 recommendation Don Meyers Enterprise Architect Manager / IT R&D Chair at Intel Corporation Don held various senior IT engineering, architecture, and project/program mgmt roles. He is organized and detail oriented with exceptional technical skills. Performs well in a variety of roles within an organization and through the product... View Senior Systems Engineer Intel Corporation September 1990  –  May 2001  (10 years 9 months) Intel Corporation, Folsom, CA. (Employee)  \nSystem Engineer/Programmer/Analyst/Consultant \n \nProvided 3rd level System Engineering support for cc:Mail and Exchange Messaging systems.  \n \nProject Lead on a variety of system implementation and migrations projects. \n \nInternal and External consulting experience with Microsoft technologies. \n \nWeb Application Development team leadership and experience. (Open) 1 recommendation Ed Braaten Sr. Software Engineer at Intel Corporation Don possesses an extraordinary drive and dedication to get things done. When Don worked for me at Intel, I could always count on him to keep even the largest enterprise deployment on track. Don delivers! View Senior Systems Engineer Intel Corporation September 1990  –  May 2001  (10 years 9 months) Intel Corporation, Folsom, CA. (Employee)  \nSystem Engineer/Programmer/Analyst/Consultant \n \nProvided 3rd level System Engineering support for cc:Mail and Exchange Messaging systems.  \n \nProject Lead on a variety of system implementation and migrations projects. \n \nInternal and External consulting experience with Microsoft technologies. \n \nWeb Application Development team leadership and experience. (Open) 1 recommendation Ed Braaten Sr. Software Engineer at Intel Corporation Don possesses an extraordinary drive and dedication to get things done. When Don worked for me at Intel, I could always count on him to keep even the largest enterprise deployment on track. Don delivers! View Languages   Skills Top Skills 68 SharePoint 26 IIS 22 Databases 20 Agile Methodologies 19 .NET 18 Integration 16 Project Management 14 Business Intelligence 14 Software Development 11 Microsoft SQL Server Don also knows about... 11 Enterprise Software 10 Web Applications 10 Microsoft Technologies 9 Enterprise Architecture 8 Visio 8 ASP.NET 7 CMS 7 SharePoint Designer 5 Windows Server 5 System Deployment 5 Information Technology 3 Microsoft CRM 3 Microsoft Exchange 3 Active Directory 3 Windows 3 Business Process 3 Social Media Marketing 2 Business Analysis 2 C# 2 ASP 2 Microsoft Office... 2 Marketing Strategy 1 XML 1 PMP 1 CSS 1 Architecture 1 Social Networking 1 Architectures 1 Leadership 1 Scrum 1 Management 0 Sharepoint 2010 0 JavaScript 0 MySQL 0 Technical Writing 0 TFS 0 Team Leadership 0 Software Documentation 0 SDLC 0 Web Services See 25+     See less Skills  Top Skills 68 SharePoint 26 IIS 22 Databases 20 Agile Methodologies 19 .NET 18 Integration 16 Project Management 14 Business Intelligence 14 Software Development 11 Microsoft SQL Server Don also knows about... 11 Enterprise Software 10 Web Applications 10 Microsoft Technologies 9 Enterprise Architecture 8 Visio 8 ASP.NET 7 CMS 7 SharePoint Designer 5 Windows Server 5 System Deployment 5 Information Technology 3 Microsoft CRM 3 Microsoft Exchange 3 Active Directory 3 Windows 3 Business Process 3 Social Media Marketing 2 Business Analysis 2 C# 2 ASP 2 Microsoft Office... 2 Marketing Strategy 1 XML 1 PMP 1 CSS 1 Architecture 1 Social Networking 1 Architectures 1 Leadership 1 Scrum 1 Management 0 Sharepoint 2010 0 JavaScript 0 MySQL 0 Technical Writing 0 TFS 0 Team Leadership 0 Software Documentation 0 SDLC 0 Web Services See 25+     See less Top Skills 68 SharePoint 26 IIS 22 Databases 20 Agile Methodologies 19 .NET 18 Integration 16 Project Management 14 Business Intelligence 14 Software Development 11 Microsoft SQL Server Don also knows about... 11 Enterprise Software 10 Web Applications 10 Microsoft Technologies 9 Enterprise Architecture 8 Visio 8 ASP.NET 7 CMS 7 SharePoint Designer 5 Windows Server 5 System Deployment 5 Information Technology 3 Microsoft CRM 3 Microsoft Exchange 3 Active Directory 3 Windows 3 Business Process 3 Social Media Marketing 2 Business Analysis 2 C# 2 ASP 2 Microsoft Office... 2 Marketing Strategy 1 XML 1 PMP 1 CSS 1 Architecture 1 Social Networking 1 Architectures 1 Leadership 1 Scrum 1 Management 0 Sharepoint 2010 0 JavaScript 0 MySQL 0 Technical Writing 0 TFS 0 Team Leadership 0 Software Documentation 0 SDLC 0 Web Services See 25+     See less Top Skills 68 SharePoint 26 IIS 22 Databases 20 Agile Methodologies 19 .NET 18 Integration 16 Project Management 14 Business Intelligence 14 Software Development 11 Microsoft SQL Server Don also knows about... 11 Enterprise Software 10 Web Applications 10 Microsoft Technologies 9 Enterprise Architecture 8 Visio 8 ASP.NET 7 CMS 7 SharePoint Designer 5 Windows Server 5 System Deployment 5 Information Technology 3 Microsoft CRM 3 Microsoft Exchange 3 Active Directory 3 Windows 3 Business Process 3 Social Media Marketing 2 Business Analysis 2 C# 2 ASP 2 Microsoft Office... 2 Marketing Strategy 1 XML 1 PMP 1 CSS 1 Architecture 1 Social Networking 1 Architectures 1 Leadership 1 Scrum 1 Management 0 Sharepoint 2010 0 JavaScript 0 MySQL 0 Technical Writing 0 TFS 0 Team Leadership 0 Software Documentation 0 SDLC 0 Web Services See 25+     See less                     11 Enterprise Software 10 Web Applications 10 Microsoft Technologies 9 Enterprise Architecture 8 Visio 8 ASP.NET 7 CMS 7 SharePoint Designer 5 Windows Server 5 System Deployment 5 Information Technology 3 Microsoft CRM 3 Microsoft Exchange 3 Active Directory 3 Windows 3 Business Process 3 Social Media Marketing 2 Business Analysis 2 C# 2 ASP 2 Microsoft Office... 2 Marketing Strategy 1 XML 1 PMP 1 CSS 1 Architecture 1 Social Networking 1 Architectures 1 Leadership 1 Scrum 1 Management 0 Sharepoint 2010 0 JavaScript 0 MySQL 0 Technical Writing 0 TFS 0 Team Leadership 0 Software Documentation 0 SDLC 0 Web Services Education University of Phoenix Masters,  Computer Information Systems 2002  – 2004 The University of Texas at El Paso Bachelor of Science (BS),  Computer and Information Sciences and Support Services 1992  – 1995 Activities and Societies:  Reserve Office Training Corp University of Phoenix Masters,  Computer Information Systems 2002  – 2004 University of Phoenix Masters,  Computer Information Systems 2002  – 2004 University of Phoenix Masters,  Computer Information Systems 2002  – 2004 The University of Texas at El Paso Bachelor of Science (BS),  Computer and Information Sciences and Support Services 1992  – 1995 Activities and Societies:  Reserve Office Training Corp The University of Texas at El Paso Bachelor of Science (BS),  Computer and Information Sciences and Support Services 1992  – 1995 Activities and Societies:  Reserve Office Training Corp The University of Texas at El Paso Bachelor of Science (BS),  Computer and Information Sciences and Support Services 1992  – 1995 Activities and Societies:  Reserve Office Training Corp ", "Experience Senior Systems Engineer Intel Corporation Senior Systems Engineer Intel Corporation Senior Systems Engineer Intel Corporation Skills Skills     ", "Summary Energetic and enthusiastic Technical Project Manager with proven experience developing and growing internal and external client relationships through flawless execution of technical projects and implementations. \n \nReputation for achieving the highest level of customer satisfaction over the longest period of time for client managed projects. \n \nMore than 15 years of experience providing both hands-on technical leadership and project management, with demonstrated ability to work with virtual teams across the country. \n \nAbility to look for revenue opportunities while balancing core values in customer orientation. I strive to effectively listen and respond to customers, clearly communicate mutual intentions and expectations, and ensure that customers feel that it’s easy to work with my company. Specialties:Operational Excellence, Configuration and Change Management, Project Management, Microsoft Certified Systems Engineer (MCSE), Project Management Professional (PMP), Capability Maturity Model® Integration (CMMI). Summary Energetic and enthusiastic Technical Project Manager with proven experience developing and growing internal and external client relationships through flawless execution of technical projects and implementations. \n \nReputation for achieving the highest level of customer satisfaction over the longest period of time for client managed projects. \n \nMore than 15 years of experience providing both hands-on technical leadership and project management, with demonstrated ability to work with virtual teams across the country. \n \nAbility to look for revenue opportunities while balancing core values in customer orientation. I strive to effectively listen and respond to customers, clearly communicate mutual intentions and expectations, and ensure that customers feel that it’s easy to work with my company. Specialties:Operational Excellence, Configuration and Change Management, Project Management, Microsoft Certified Systems Engineer (MCSE), Project Management Professional (PMP), Capability Maturity Model® Integration (CMMI). Energetic and enthusiastic Technical Project Manager with proven experience developing and growing internal and external client relationships through flawless execution of technical projects and implementations. \n \nReputation for achieving the highest level of customer satisfaction over the longest period of time for client managed projects. \n \nMore than 15 years of experience providing both hands-on technical leadership and project management, with demonstrated ability to work with virtual teams across the country. \n \nAbility to look for revenue opportunities while balancing core values in customer orientation. I strive to effectively listen and respond to customers, clearly communicate mutual intentions and expectations, and ensure that customers feel that it’s easy to work with my company. Specialties:Operational Excellence, Configuration and Change Management, Project Management, Microsoft Certified Systems Engineer (MCSE), Project Management Professional (PMP), Capability Maturity Model® Integration (CMMI). Energetic and enthusiastic Technical Project Manager with proven experience developing and growing internal and external client relationships through flawless execution of technical projects and implementations. \n \nReputation for achieving the highest level of customer satisfaction over the longest period of time for client managed projects. \n \nMore than 15 years of experience providing both hands-on technical leadership and project management, with demonstrated ability to work with virtual teams across the country. \n \nAbility to look for revenue opportunities while balancing core values in customer orientation. I strive to effectively listen and respond to customers, clearly communicate mutual intentions and expectations, and ensure that customers feel that it’s easy to work with my company. Specialties:Operational Excellence, Configuration and Change Management, Project Management, Microsoft Certified Systems Engineer (MCSE), Project Management Professional (PMP), Capability Maturity Model® Integration (CMMI). Experience Senior IT Specialist FDIC April 2010  – Present (5 years 5 months) IT Specialist FDIC July 2009  –  May 2010  (11 months) Project Manager of Engineering Solutions Buchanan & Edwards January 2008  –  July 2009  (1 year 7 months) Technical Project Manager Intel Corporation June 2003  –  December 2007  (4 years 7 months) Responsible for managing multiple web application development and IT projects to meet client specific objectives within agreed upon constraints. Provide technical Project Management leadership and responsible for gathering and documenting project requirements, performing project cost estimation, formulating a project team, developing a detailed project plan and schedule, identifying and documenting risks/assumptions, ensuring that all projects are completed within approved funding constraints and ensuring customer satisfaction. All projects adhere to the Capability Maturity Model (CMMI) Level 2 requirements. Consistently achieved/maintained the highest customer satisfaction among my peers. Senior Systems Engineer Intel Corporation February 2000  –  June 2003  (3 years 5 months) Developed operational and performance requirements with Intel Online Service clients. Implemented customized hosting environments based on collected customer requirements, including the installation and configuration of computer hardware, operating systems, website monitoring and customer specific applications. Clients included Gucci, American Express, Merant, Knowledge Planet and Blueman Group. LAN Analyst III QSS Group, Inc. September 1997  –  February 2000  (2 years 6 months) Responsible for administering FDIC’s Intranet, Internet and Extranet WEB environment, including support and maintenance for 20+ servers. Duties included installation and upgrades to software packages such as IIS, Inoculan, Verity, FrontPage, Cold Fusion, MDAC drivers, and PERL as well as BIOS and Firmware upgrades and EISA configuration changes. Principle Information Systems Engineer Computer Data Systems Incorporated September 1995  –  September 1997  (2 years 1 month) Researched and provided recommendations on an Information Technology vision for Air Force’s Bolling Air Base. Responsible for the implementation and administration of 3 StreetTalk for NT Servers and 3 Banyan VINES 7.10 Servers. Created a standard Windows 95 desktop utilization policies and then completed the installation and rollout of 200+ Windows 95 Workstations in less than 30 days. Systems Administrator/Programmer FDIC June 1992  –  September 1995  (3 years 4 months) Conducted pilot initiative to install “VINES Serverless” networks in 98 FDIC Field Offices. After this successful pilot program, the networks were rolled out to all FDIC Field Offices. Established a standard network software configuration for 3,000+ laptop users. Developed and conducted training on applications and network operations.Conducted pilot initiative to install “VINES Serverless” networks in 98 FDIC Field Offices. After this successful pilot program, the networks were rolled out to all FDIC Field Offices. Established a standard network software configuration for 3,000+ laptop users. Developed and conducted training on applications and network operations. Software developer in COBOL and Ideal. Responsible for requirements development, code rewrites and product improvements. Senior IT Specialist FDIC April 2010  – Present (5 years 5 months) Senior IT Specialist FDIC April 2010  – Present (5 years 5 months) IT Specialist FDIC July 2009  –  May 2010  (11 months) IT Specialist FDIC July 2009  –  May 2010  (11 months) Project Manager of Engineering Solutions Buchanan & Edwards January 2008  –  July 2009  (1 year 7 months) Project Manager of Engineering Solutions Buchanan & Edwards January 2008  –  July 2009  (1 year 7 months) Technical Project Manager Intel Corporation June 2003  –  December 2007  (4 years 7 months) Responsible for managing multiple web application development and IT projects to meet client specific objectives within agreed upon constraints. Provide technical Project Management leadership and responsible for gathering and documenting project requirements, performing project cost estimation, formulating a project team, developing a detailed project plan and schedule, identifying and documenting risks/assumptions, ensuring that all projects are completed within approved funding constraints and ensuring customer satisfaction. All projects adhere to the Capability Maturity Model (CMMI) Level 2 requirements. Consistently achieved/maintained the highest customer satisfaction among my peers. Technical Project Manager Intel Corporation June 2003  –  December 2007  (4 years 7 months) Responsible for managing multiple web application development and IT projects to meet client specific objectives within agreed upon constraints. Provide technical Project Management leadership and responsible for gathering and documenting project requirements, performing project cost estimation, formulating a project team, developing a detailed project plan and schedule, identifying and documenting risks/assumptions, ensuring that all projects are completed within approved funding constraints and ensuring customer satisfaction. All projects adhere to the Capability Maturity Model (CMMI) Level 2 requirements. Consistently achieved/maintained the highest customer satisfaction among my peers. Senior Systems Engineer Intel Corporation February 2000  –  June 2003  (3 years 5 months) Developed operational and performance requirements with Intel Online Service clients. Implemented customized hosting environments based on collected customer requirements, including the installation and configuration of computer hardware, operating systems, website monitoring and customer specific applications. Clients included Gucci, American Express, Merant, Knowledge Planet and Blueman Group. Senior Systems Engineer Intel Corporation February 2000  –  June 2003  (3 years 5 months) Developed operational and performance requirements with Intel Online Service clients. Implemented customized hosting environments based on collected customer requirements, including the installation and configuration of computer hardware, operating systems, website monitoring and customer specific applications. Clients included Gucci, American Express, Merant, Knowledge Planet and Blueman Group. LAN Analyst III QSS Group, Inc. September 1997  –  February 2000  (2 years 6 months) Responsible for administering FDIC’s Intranet, Internet and Extranet WEB environment, including support and maintenance for 20+ servers. Duties included installation and upgrades to software packages such as IIS, Inoculan, Verity, FrontPage, Cold Fusion, MDAC drivers, and PERL as well as BIOS and Firmware upgrades and EISA configuration changes. LAN Analyst III QSS Group, Inc. September 1997  –  February 2000  (2 years 6 months) Responsible for administering FDIC’s Intranet, Internet and Extranet WEB environment, including support and maintenance for 20+ servers. Duties included installation and upgrades to software packages such as IIS, Inoculan, Verity, FrontPage, Cold Fusion, MDAC drivers, and PERL as well as BIOS and Firmware upgrades and EISA configuration changes. Principle Information Systems Engineer Computer Data Systems Incorporated September 1995  –  September 1997  (2 years 1 month) Researched and provided recommendations on an Information Technology vision for Air Force’s Bolling Air Base. Responsible for the implementation and administration of 3 StreetTalk for NT Servers and 3 Banyan VINES 7.10 Servers. Created a standard Windows 95 desktop utilization policies and then completed the installation and rollout of 200+ Windows 95 Workstations in less than 30 days. Principle Information Systems Engineer Computer Data Systems Incorporated September 1995  –  September 1997  (2 years 1 month) Researched and provided recommendations on an Information Technology vision for Air Force’s Bolling Air Base. Responsible for the implementation and administration of 3 StreetTalk for NT Servers and 3 Banyan VINES 7.10 Servers. Created a standard Windows 95 desktop utilization policies and then completed the installation and rollout of 200+ Windows 95 Workstations in less than 30 days. Systems Administrator/Programmer FDIC June 1992  –  September 1995  (3 years 4 months) Conducted pilot initiative to install “VINES Serverless” networks in 98 FDIC Field Offices. After this successful pilot program, the networks were rolled out to all FDIC Field Offices. Established a standard network software configuration for 3,000+ laptop users. Developed and conducted training on applications and network operations.Conducted pilot initiative to install “VINES Serverless” networks in 98 FDIC Field Offices. After this successful pilot program, the networks were rolled out to all FDIC Field Offices. Established a standard network software configuration for 3,000+ laptop users. Developed and conducted training on applications and network operations. Software developer in COBOL and Ideal. Responsible for requirements development, code rewrites and product improvements. Systems Administrator/Programmer FDIC June 1992  –  September 1995  (3 years 4 months) Conducted pilot initiative to install “VINES Serverless” networks in 98 FDIC Field Offices. After this successful pilot program, the networks were rolled out to all FDIC Field Offices. Established a standard network software configuration for 3,000+ laptop users. Developed and conducted training on applications and network operations.Conducted pilot initiative to install “VINES Serverless” networks in 98 FDIC Field Offices. After this successful pilot program, the networks were rolled out to all FDIC Field Offices. Established a standard network software configuration for 3,000+ laptop users. Developed and conducted training on applications and network operations. Software developer in COBOL and Ideal. Responsible for requirements development, code rewrites and product improvements. Skills 17 PMP 11 VMware Skills  17 PMP 11 VMware 17 PMP 11 VMware 17 PMP 11 VMware     Education University of Maryland Baltimore County BS,  Information Systems Management 1989  – 2004 GPA: 3.41 University of Maryland Baltimore County MS,  Information Systems Management 1996  – 1998 GPA: 4.0 University of Maryland Baltimore County BS,  Information Systems Management 1989  – 2004 GPA: 3.41 University of Maryland Baltimore County BS,  Information Systems Management 1989  – 2004 GPA: 3.41 University of Maryland Baltimore County BS,  Information Systems Management 1989  – 2004 GPA: 3.41 University of Maryland Baltimore County MS,  Information Systems Management 1996  – 1998 GPA: 4.0 University of Maryland Baltimore County MS,  Information Systems Management 1996  – 1998 GPA: 4.0 University of Maryland Baltimore County MS,  Information Systems Management 1996  – 1998 GPA: 4.0 ", "Experience Senior Sensor Architect Intel Corporation March 2015  – Present (6 months) IOTG Senior Systems Engineer Intel Corporation July 2011  –  March 2015  (3 years 9 months) Working on next generation cutting edge Netbooks and Tablets. Engineer Freescale Semi-Conductor, Inc July 2005  –  September 2011  (6 years 3 months) Digital/Software Systems and Applications Engineer Freescale Semiconductor July 2005  –  July 2011  (6 years 1 month) Software Developer VTSG Inc. 2004  –  2005  (1 year) Apps Engineering Silicon Laboratories March 2004  –  October 2004  (8 months) Senior Sensor Architect Intel Corporation March 2015  – Present (6 months) IOTG Senior Sensor Architect Intel Corporation March 2015  – Present (6 months) IOTG Senior Systems Engineer Intel Corporation July 2011  –  March 2015  (3 years 9 months) Working on next generation cutting edge Netbooks and Tablets. Senior Systems Engineer Intel Corporation July 2011  –  March 2015  (3 years 9 months) Working on next generation cutting edge Netbooks and Tablets. Engineer Freescale Semi-Conductor, Inc July 2005  –  September 2011  (6 years 3 months) Engineer Freescale Semi-Conductor, Inc July 2005  –  September 2011  (6 years 3 months) Digital/Software Systems and Applications Engineer Freescale Semiconductor July 2005  –  July 2011  (6 years 1 month) Digital/Software Systems and Applications Engineer Freescale Semiconductor July 2005  –  July 2011  (6 years 1 month) Software Developer VTSG Inc. 2004  –  2005  (1 year) Software Developer VTSG Inc. 2004  –  2005  (1 year) Apps Engineering Silicon Laboratories March 2004  –  October 2004  (8 months) Apps Engineering Silicon Laboratories March 2004  –  October 2004  (8 months) Languages Ibibio Creoles and pidgins, English-based Ibibio Creoles and pidgins, English-based Ibibio Creoles and pidgins, English-based Skills Top Skills 26 SoC 16 IC 11 Microprocessors 8 RTL design 8 Semiconductors 6 Analog 4 Verilog 3 Mixed Signal 3 ASIC 3 Embedded Systems Aniekeme also knows about... 2 Android Development 2 Sensors 1 Logic Analyzer 1 Static Timing Analysis 0 Windows Driver... 0 Debugging 0 Semiconductor Industry 0 Simulations 0 C 0 Firmware 0 Testing 0 Embedded Software 0 Electronics Skills  Top Skills 26 SoC 16 IC 11 Microprocessors 8 RTL design 8 Semiconductors 6 Analog 4 Verilog 3 Mixed Signal 3 ASIC 3 Embedded Systems Aniekeme also knows about... 2 Android Development 2 Sensors 1 Logic Analyzer 1 Static Timing Analysis 0 Windows Driver... 0 Debugging 0 Semiconductor Industry 0 Simulations 0 C 0 Firmware 0 Testing 0 Embedded Software 0 Electronics Top Skills 26 SoC 16 IC 11 Microprocessors 8 RTL design 8 Semiconductors 6 Analog 4 Verilog 3 Mixed Signal 3 ASIC 3 Embedded Systems Aniekeme also knows about... 2 Android Development 2 Sensors 1 Logic Analyzer 1 Static Timing Analysis 0 Windows Driver... 0 Debugging 0 Semiconductor Industry 0 Simulations 0 C 0 Firmware 0 Testing 0 Embedded Software 0 Electronics Top Skills 26 SoC 16 IC 11 Microprocessors 8 RTL design 8 Semiconductors 6 Analog 4 Verilog 3 Mixed Signal 3 ASIC 3 Embedded Systems Aniekeme also knows about... 2 Android Development 2 Sensors 1 Logic Analyzer 1 Static Timing Analysis 0 Windows Driver... 0 Debugging 0 Semiconductor Industry 0 Simulations 0 C 0 Firmware 0 Testing 0 Embedded Software 0 Electronics                     2 Android Development 2 Sensors 1 Logic Analyzer 1 Static Timing Analysis 0 Windows Driver... 0 Debugging 0 Semiconductor Industry 0 Simulations 0 C 0 Firmware 0 Testing 0 Embedded Software 0 Electronics Education Arizona State University Masters,  Software Engineering 2005  – 2008 Rochester Institute of Technology BS,  Computer Engineering 1999  – 2004 Arizona State University Masters,  Software Engineering 2005  – 2008 Arizona State University Masters,  Software Engineering 2005  – 2008 Arizona State University Masters,  Software Engineering 2005  – 2008 Rochester Institute of Technology BS,  Computer Engineering 1999  – 2004 Rochester Institute of Technology BS,  Computer Engineering 1999  – 2004 Rochester Institute of Technology BS,  Computer Engineering 1999  – 2004 ", "Experience Senior Systems Engineer Intel Corporation February 2011  – Present (4 years 7 months) Allentown, Pennsylvania Area Senior Member of Technical Staff Infineon Technologies October 2007  –  January 2011  (3 years 4 months) Allentown, Pennsylvania Area Senior Member of Technical Staff LSI Corporation May 2007  –  October 2007  (6 months) Allentown, Pennsylvania Area Member of Technical Staff Agere Systems May 2002  –  May 2007  (5 years 1 month) Holmdel NJ / Allentown PA Member of Technical Staff Lucent / Bell Labs June 2000  –  May 2002  (2 years) Whippany NJ Senior Systems Engineer Intel Corporation February 2011  – Present (4 years 7 months) Allentown, Pennsylvania Area Senior Systems Engineer Intel Corporation February 2011  – Present (4 years 7 months) Allentown, Pennsylvania Area Senior Member of Technical Staff Infineon Technologies October 2007  –  January 2011  (3 years 4 months) Allentown, Pennsylvania Area Senior Member of Technical Staff Infineon Technologies October 2007  –  January 2011  (3 years 4 months) Allentown, Pennsylvania Area Senior Member of Technical Staff LSI Corporation May 2007  –  October 2007  (6 months) Allentown, Pennsylvania Area Senior Member of Technical Staff LSI Corporation May 2007  –  October 2007  (6 months) Allentown, Pennsylvania Area Member of Technical Staff Agere Systems May 2002  –  May 2007  (5 years 1 month) Holmdel NJ / Allentown PA Member of Technical Staff Agere Systems May 2002  –  May 2007  (5 years 1 month) Holmdel NJ / Allentown PA Member of Technical Staff Lucent / Bell Labs June 2000  –  May 2002  (2 years) Whippany NJ Member of Technical Staff Lucent / Bell Labs June 2000  –  May 2002  (2 years) Whippany NJ Skills Top Skills 11 Semiconductors 10 SoC 10 ASIC 7 Debugging 7 Embedded Systems 6 Mixed Signal 4 Electronics 3 Analog 3 IC 3 CMOS Dan also knows about... 2 Circuit Design Skills  Top Skills 11 Semiconductors 10 SoC 10 ASIC 7 Debugging 7 Embedded Systems 6 Mixed Signal 4 Electronics 3 Analog 3 IC 3 CMOS Dan also knows about... 2 Circuit Design Top Skills 11 Semiconductors 10 SoC 10 ASIC 7 Debugging 7 Embedded Systems 6 Mixed Signal 4 Electronics 3 Analog 3 IC 3 CMOS Dan also knows about... 2 Circuit Design Top Skills 11 Semiconductors 10 SoC 10 ASIC 7 Debugging 7 Embedded Systems 6 Mixed Signal 4 Electronics 3 Analog 3 IC 3 CMOS Dan also knows about... 2 Circuit Design                     2 Circuit Design Education “Politehnica” University of Timisoara, Romania “Politehnica” University of Timisoara, Romania “Politehnica” University of Timisoara, Romania “Politehnica” University of Timisoara, Romania ", "Experience Senior Systems Engineer Intel Corporation October 2008  – Present (6 years 11 months) (Open) 5 recommendations, including: Somnath Banerjee, MBA Sr. Business Systems Manager at Nautilus Herman Wong is a great engineer to work with - very knowledgeable in the fields of computer networks. He consistently... View Frank Micciche Network Engineer II at The Children's Hospital Herman is a fantastic Senior Network Engineer that takes the lead role in Networking. He is detailed orientated and very... View 3 more recommendations Sr. Network Engineer Nautilus, Inc. November 2002  –  October 2008  (6 years) Senior Systems Engineer Intel Corporation October 2008  – Present (6 years 11 months) (Open) 5 recommendations, including: Somnath Banerjee, MBA Sr. Business Systems Manager at Nautilus Herman Wong is a great engineer to work with - very knowledgeable in the fields of computer networks. He consistently... View Frank Micciche Network Engineer II at The Children's Hospital Herman is a fantastic Senior Network Engineer that takes the lead role in Networking. He is detailed orientated and very... View 3 more recommendations Senior Systems Engineer Intel Corporation October 2008  – Present (6 years 11 months) (Open) 5 recommendations, including: Somnath Banerjee, MBA Sr. Business Systems Manager at Nautilus Herman Wong is a great engineer to work with - very knowledgeable in the fields of computer networks. He consistently... View Frank Micciche Network Engineer II at The Children's Hospital Herman is a fantastic Senior Network Engineer that takes the lead role in Networking. He is detailed orientated and very... View 3 more recommendations Sr. Network Engineer Nautilus, Inc. November 2002  –  October 2008  (6 years) Sr. Network Engineer Nautilus, Inc. November 2002  –  October 2008  (6 years) Skills Skills     ", "Summary Enterprise Systems Integration Principal with a record of meeting critical deployment deliveries with innovative solutions and a minimum of resource allocation. Capable of decomposing problems into resolvable vignettes and unearthing true requirements through effective discovery interviewing. \n \nInnovation Enthusiast who employs out of the box thinking to resolve problems with available resources and deliver exceptional value to key customers. Finds solutions to problem through effective mapping of goals, human factors, available and near horizon technologies, and synthesis of deductive methodologies. Specialties:Innovation Enthusiast who employs out of the box thinking to resolve problems with available resources and deliver exceptional value to key customers. Finds solutions to problem through effective mapping of goals, human factors, available and near horizon technologies, and synthesis of deductive methodologies. Summary Enterprise Systems Integration Principal with a record of meeting critical deployment deliveries with innovative solutions and a minimum of resource allocation. Capable of decomposing problems into resolvable vignettes and unearthing true requirements through effective discovery interviewing. \n \nInnovation Enthusiast who employs out of the box thinking to resolve problems with available resources and deliver exceptional value to key customers. Finds solutions to problem through effective mapping of goals, human factors, available and near horizon technologies, and synthesis of deductive methodologies. Specialties:Innovation Enthusiast who employs out of the box thinking to resolve problems with available resources and deliver exceptional value to key customers. Finds solutions to problem through effective mapping of goals, human factors, available and near horizon technologies, and synthesis of deductive methodologies. Enterprise Systems Integration Principal with a record of meeting critical deployment deliveries with innovative solutions and a minimum of resource allocation. Capable of decomposing problems into resolvable vignettes and unearthing true requirements through effective discovery interviewing. \n \nInnovation Enthusiast who employs out of the box thinking to resolve problems with available resources and deliver exceptional value to key customers. Finds solutions to problem through effective mapping of goals, human factors, available and near horizon technologies, and synthesis of deductive methodologies. Specialties:Innovation Enthusiast who employs out of the box thinking to resolve problems with available resources and deliver exceptional value to key customers. Finds solutions to problem through effective mapping of goals, human factors, available and near horizon technologies, and synthesis of deductive methodologies. Enterprise Systems Integration Principal with a record of meeting critical deployment deliveries with innovative solutions and a minimum of resource allocation. Capable of decomposing problems into resolvable vignettes and unearthing true requirements through effective discovery interviewing. \n \nInnovation Enthusiast who employs out of the box thinking to resolve problems with available resources and deliver exceptional value to key customers. Finds solutions to problem through effective mapping of goals, human factors, available and near horizon technologies, and synthesis of deductive methodologies. Specialties:Innovation Enthusiast who employs out of the box thinking to resolve problems with available resources and deliver exceptional value to key customers. Finds solutions to problem through effective mapping of goals, human factors, available and near horizon technologies, and synthesis of deductive methodologies. Experience Principal Systems Architect Thomson Reuters April 2015  – Present (5 months) Lake Oswego, Oregon Cloud automation engineering  \n \nService monitoring and automation quality administration test automation framework high availability Senior Systems Engineer Intel Corporation March 2013  –  March 2015  (2 years 1 month) Hillsboro, Oregon Application Lifecycle Management Engineer implementing IBM Rational Team Concert and Jazz based Tools. Delivering high cadence system upgrades, improving release quality, empowering peers and metrics gathering through prudent application of systems automation and process re-usability, saving systems engineering time and improving community productivity.  \n•Develop reusable automated validation solutions using Selenium and Build Engine Services. \n•Automated deployment process delivering upgrades and releases multiple times a year within small maintenance windows, minimizing maintenance outage time. Maintenance was often less than two hours for major upgrades. \n•Encouraged adoption of new tool capabilities with user community through mentoring and support. \n•Resolved long standing high security impediment to empower highly classified company data to reside in Team Concert. \n•Determine root cause of application problems. \n•Improved SQL Performance through index development, resource distribution, systems analysis, profiling, tracing and other system performance metrics. \n•Developed and implemented distributed performance metrics gathering and reporting system using open source solutions. \n•Designed access log analysis system for customer experience metrics without external instrumentation. \n•Contribute to road mapping and service delivery planning of application infrastructure. \n•Mentored and trained global engineering staff. (Open) 1 recommendation Dayal Sachdev Technical Sales Specialist at IBM Sales & Distribution, Cloud Software Sales Dean has been a great pleasure to work with. Alongside his professionalism in the workplace, he continues to demonstrate client success through his strong technical background and perseverance. View Application Lifecycle Architect ALM Solutions Group May 2011  –  March 2013  (1 year 11 months) Building and deploying reusable software development frameworks for improving software development environments and productivity \n•Cloud based development \n•Shared Infrastructure \n•High availability collaborative solutions \n•Innovative outside the box solutions not yet realized! \n \nWork with organizations to solve challenging ALM deficiencies. \n•Look for ways within an organization to leverage all of their resources \n•Help to get the productivity back into the development stream \n•Drive efficiencies in the testing process \n•Improve the quality of the design and definition of a product \n•Focused on implementing the best practices utilizing Rational tools \n•Keenly aware that there are opportunities in the open source and alternative tool communities for integration and process enhancement \n•Specialize in getting the tools out of the way of engineers \n•Put powerful metrics and reporting systems in the hands of managers and directors \n•Empowering the entire organization to deliver products on time and on budget. Principle Engineer - Division Build and Release Lead General Dynamics C4 Systems January 2010  –  May 2011  (1 year 5 months) Division Build and Release Lead for developing methods for improving quality of delivered product inside the organizational Rational Tools software development framework. Responsible for Division marketing and collaboration portal. Provided direction on portal road map.  \n•\tManaged SharePoint, Apache, and Tomcat productions services with Oracle and MS SQL integration \n•\tEvaluated WebSphere for Division productivity improvement through distributed services \n•\tBuilt business opportunity generating visualizations for Homeland Security and Department of Defense \n•\tMaintained Rational software development environments consisting of Rational Team Concert, Rational Quality Manager, DOORS, ClearCase and ClearQuest \n•\tDeveloped requirements list for projects and lead project teams, assigning work and resources \n•\tSuccessfully developed organizational project plans and lead project execution teams \n•\tImplemented automated testing environment, reducing manual testing costs (Open) 3 recommendations, including: Pete Palmer Director EDGE Innovation Network at General Dynamics C4 Systems When Dean joined my EDGE KMS team he presesnted a great deal of enthusiasm and drive to fix the challenges presented in our... View Sheila Leone Lucas Marketing Manager at General Dynamics Mission Systems Dean has an innate ability to get to the core of IT problems at warp speed. He single handedly got a stalled project we had... View 1 more recommendation Principle Engineer - Global Rational Tools Architect Emerson Embedded Computing October 2008  –  December 2009  (1 year 3 months) Global Rational Tools Architect delivering exceptional high availability software development environments for international software development teams for the reduction of software development costs. Enabled organization to move migrate basic software development tasks to best cost centers reducing development costs 70%. Developed deployment strategy and implemented entire software development framework at international sites.  \n•\tDeveloped and maintained global development environments in Germany, China, India, The Philippines and the United States \n•\tDeployed services on Solaris Zoned Virtual Machines providing high reliability services \n•\tLead global support team and mentored local junior engineers \n•\tDefined global software development framework for assuring international import/export law compliance and implemented application environment for compliance monitoring \n•\tDefined Enterprise software development roadmaps \n•\tProposed software development framework alternatives for further reducing development costs (Open) 2 recommendations Ocean Ma Manager III, Advisory Services(TMT) at Ernst & Young (China) Advisory Dean's passion and professional skills on CM gives a great contribution to the ClearCase Multisite setup which plays a... View Jo Farrington Da Boss at Blissfully Retired I had the privilege of working with Dean while implementing Global Trade Compliance requirements at ENPEC. He was always... View Senior Staff Software Engineer - Enterprise Tools Team Lead General Dynamics C4 Systems April 2006  –  October 2009  (3 years 7 months) Enterprise Tools Team Lead for 3000 software developer organization providing systems deployment plans and project execution meeting strict deadlines with zero Enterprise impact. Developed reduced maintenance sustainable solutions for all areas of software development lifecycle framework. Developed Enterprise roadmaps for integrating industry best practices.  \n•\tArchitect and project lead of major maintenance deployment plans, coordinating cross organizational resources for plan execution \n•\tMaintained environment resources for diverse platforms, IE Windows, Solaris, Linux, Netapp \n•\tDeveloped migration tools for consolidating business acquisitions into core Enterprise framework \n•\tEnforced software development policy and standards compliance through PERL based triggers \n•\tParticipated in the Rational Tools portion of FISMA certification for I-WIN program \n•\tEvaluated and supported BuildForge Enterprise build environment Founder / Systems Consultant Richardson Consulting April 2001  –  March 2006  (5 years) Consultant providing computing infrastructure services to wholesale distribution organizations. Provided innovative solutions for migration of mainframe services to customized Linux platform, reducing infrastructure operating costs by 80% and enabled services otherwise unavailable to the environment. Deployed secure infrastructure technologies between sites leveraging commodity internet infrastructure, reducing communications costs 70%. Consulted with customers on emerging internet technologies and implemented solutions.  \n•\tImproved customer relationships through improved communication methods like corporate email systems and web presences \n•\tReduced infrastructure costs by implementing open source solutions, eliminating incumbent licensing costs \n•\tDeveloped Linux HA file server system leveraging GFS and NMB service architecture \n•\tDeveloped Linux Kernel Mainframe Emulator, eliminating mainframe equipment and licensing costs \n•\tProactively maintained customer environments through service agreements Network admin SNET Internet 1999  –  2000  (1 year) Windows Server Administration Principal Systems Architect Thomson Reuters April 2015  – Present (5 months) Lake Oswego, Oregon Cloud automation engineering  \n \nService monitoring and automation quality administration test automation framework high availability Principal Systems Architect Thomson Reuters April 2015  – Present (5 months) Lake Oswego, Oregon Cloud automation engineering  \n \nService monitoring and automation quality administration test automation framework high availability Senior Systems Engineer Intel Corporation March 2013  –  March 2015  (2 years 1 month) Hillsboro, Oregon Application Lifecycle Management Engineer implementing IBM Rational Team Concert and Jazz based Tools. Delivering high cadence system upgrades, improving release quality, empowering peers and metrics gathering through prudent application of systems automation and process re-usability, saving systems engineering time and improving community productivity.  \n•Develop reusable automated validation solutions using Selenium and Build Engine Services. \n•Automated deployment process delivering upgrades and releases multiple times a year within small maintenance windows, minimizing maintenance outage time. Maintenance was often less than two hours for major upgrades. \n•Encouraged adoption of new tool capabilities with user community through mentoring and support. \n•Resolved long standing high security impediment to empower highly classified company data to reside in Team Concert. \n•Determine root cause of application problems. \n•Improved SQL Performance through index development, resource distribution, systems analysis, profiling, tracing and other system performance metrics. \n•Developed and implemented distributed performance metrics gathering and reporting system using open source solutions. \n•Designed access log analysis system for customer experience metrics without external instrumentation. \n•Contribute to road mapping and service delivery planning of application infrastructure. \n•Mentored and trained global engineering staff. (Open) 1 recommendation Dayal Sachdev Technical Sales Specialist at IBM Sales & Distribution, Cloud Software Sales Dean has been a great pleasure to work with. Alongside his professionalism in the workplace, he continues to demonstrate client success through his strong technical background and perseverance. View Senior Systems Engineer Intel Corporation March 2013  –  March 2015  (2 years 1 month) Hillsboro, Oregon Application Lifecycle Management Engineer implementing IBM Rational Team Concert and Jazz based Tools. Delivering high cadence system upgrades, improving release quality, empowering peers and metrics gathering through prudent application of systems automation and process re-usability, saving systems engineering time and improving community productivity.  \n•Develop reusable automated validation solutions using Selenium and Build Engine Services. \n•Automated deployment process delivering upgrades and releases multiple times a year within small maintenance windows, minimizing maintenance outage time. Maintenance was often less than two hours for major upgrades. \n•Encouraged adoption of new tool capabilities with user community through mentoring and support. \n•Resolved long standing high security impediment to empower highly classified company data to reside in Team Concert. \n•Determine root cause of application problems. \n•Improved SQL Performance through index development, resource distribution, systems analysis, profiling, tracing and other system performance metrics. \n•Developed and implemented distributed performance metrics gathering and reporting system using open source solutions. \n•Designed access log analysis system for customer experience metrics without external instrumentation. \n•Contribute to road mapping and service delivery planning of application infrastructure. \n•Mentored and trained global engineering staff. (Open) 1 recommendation Dayal Sachdev Technical Sales Specialist at IBM Sales & Distribution, Cloud Software Sales Dean has been a great pleasure to work with. Alongside his professionalism in the workplace, he continues to demonstrate client success through his strong technical background and perseverance. View Application Lifecycle Architect ALM Solutions Group May 2011  –  March 2013  (1 year 11 months) Building and deploying reusable software development frameworks for improving software development environments and productivity \n•Cloud based development \n•Shared Infrastructure \n•High availability collaborative solutions \n•Innovative outside the box solutions not yet realized! \n \nWork with organizations to solve challenging ALM deficiencies. \n•Look for ways within an organization to leverage all of their resources \n•Help to get the productivity back into the development stream \n•Drive efficiencies in the testing process \n•Improve the quality of the design and definition of a product \n•Focused on implementing the best practices utilizing Rational tools \n•Keenly aware that there are opportunities in the open source and alternative tool communities for integration and process enhancement \n•Specialize in getting the tools out of the way of engineers \n•Put powerful metrics and reporting systems in the hands of managers and directors \n•Empowering the entire organization to deliver products on time and on budget. Application Lifecycle Architect ALM Solutions Group May 2011  –  March 2013  (1 year 11 months) Building and deploying reusable software development frameworks for improving software development environments and productivity \n•Cloud based development \n•Shared Infrastructure \n•High availability collaborative solutions \n•Innovative outside the box solutions not yet realized! \n \nWork with organizations to solve challenging ALM deficiencies. \n•Look for ways within an organization to leverage all of their resources \n•Help to get the productivity back into the development stream \n•Drive efficiencies in the testing process \n•Improve the quality of the design and definition of a product \n•Focused on implementing the best practices utilizing Rational tools \n•Keenly aware that there are opportunities in the open source and alternative tool communities for integration and process enhancement \n•Specialize in getting the tools out of the way of engineers \n•Put powerful metrics and reporting systems in the hands of managers and directors \n•Empowering the entire organization to deliver products on time and on budget. Principle Engineer - Division Build and Release Lead General Dynamics C4 Systems January 2010  –  May 2011  (1 year 5 months) Division Build and Release Lead for developing methods for improving quality of delivered product inside the organizational Rational Tools software development framework. Responsible for Division marketing and collaboration portal. Provided direction on portal road map.  \n•\tManaged SharePoint, Apache, and Tomcat productions services with Oracle and MS SQL integration \n•\tEvaluated WebSphere for Division productivity improvement through distributed services \n•\tBuilt business opportunity generating visualizations for Homeland Security and Department of Defense \n•\tMaintained Rational software development environments consisting of Rational Team Concert, Rational Quality Manager, DOORS, ClearCase and ClearQuest \n•\tDeveloped requirements list for projects and lead project teams, assigning work and resources \n•\tSuccessfully developed organizational project plans and lead project execution teams \n•\tImplemented automated testing environment, reducing manual testing costs (Open) 3 recommendations, including: Pete Palmer Director EDGE Innovation Network at General Dynamics C4 Systems When Dean joined my EDGE KMS team he presesnted a great deal of enthusiasm and drive to fix the challenges presented in our... View Sheila Leone Lucas Marketing Manager at General Dynamics Mission Systems Dean has an innate ability to get to the core of IT problems at warp speed. He single handedly got a stalled project we had... View 1 more recommendation Principle Engineer - Division Build and Release Lead General Dynamics C4 Systems January 2010  –  May 2011  (1 year 5 months) Division Build and Release Lead for developing methods for improving quality of delivered product inside the organizational Rational Tools software development framework. Responsible for Division marketing and collaboration portal. Provided direction on portal road map.  \n•\tManaged SharePoint, Apache, and Tomcat productions services with Oracle and MS SQL integration \n•\tEvaluated WebSphere for Division productivity improvement through distributed services \n•\tBuilt business opportunity generating visualizations for Homeland Security and Department of Defense \n•\tMaintained Rational software development environments consisting of Rational Team Concert, Rational Quality Manager, DOORS, ClearCase and ClearQuest \n•\tDeveloped requirements list for projects and lead project teams, assigning work and resources \n•\tSuccessfully developed organizational project plans and lead project execution teams \n•\tImplemented automated testing environment, reducing manual testing costs (Open) 3 recommendations, including: Pete Palmer Director EDGE Innovation Network at General Dynamics C4 Systems When Dean joined my EDGE KMS team he presesnted a great deal of enthusiasm and drive to fix the challenges presented in our... View Sheila Leone Lucas Marketing Manager at General Dynamics Mission Systems Dean has an innate ability to get to the core of IT problems at warp speed. He single handedly got a stalled project we had... View 1 more recommendation Principle Engineer - Global Rational Tools Architect Emerson Embedded Computing October 2008  –  December 2009  (1 year 3 months) Global Rational Tools Architect delivering exceptional high availability software development environments for international software development teams for the reduction of software development costs. Enabled organization to move migrate basic software development tasks to best cost centers reducing development costs 70%. Developed deployment strategy and implemented entire software development framework at international sites.  \n•\tDeveloped and maintained global development environments in Germany, China, India, The Philippines and the United States \n•\tDeployed services on Solaris Zoned Virtual Machines providing high reliability services \n•\tLead global support team and mentored local junior engineers \n•\tDefined global software development framework for assuring international import/export law compliance and implemented application environment for compliance monitoring \n•\tDefined Enterprise software development roadmaps \n•\tProposed software development framework alternatives for further reducing development costs (Open) 2 recommendations Ocean Ma Manager III, Advisory Services(TMT) at Ernst & Young (China) Advisory Dean's passion and professional skills on CM gives a great contribution to the ClearCase Multisite setup which plays a... View Jo Farrington Da Boss at Blissfully Retired I had the privilege of working with Dean while implementing Global Trade Compliance requirements at ENPEC. He was always... View Principle Engineer - Global Rational Tools Architect Emerson Embedded Computing October 2008  –  December 2009  (1 year 3 months) Global Rational Tools Architect delivering exceptional high availability software development environments for international software development teams for the reduction of software development costs. Enabled organization to move migrate basic software development tasks to best cost centers reducing development costs 70%. Developed deployment strategy and implemented entire software development framework at international sites.  \n•\tDeveloped and maintained global development environments in Germany, China, India, The Philippines and the United States \n•\tDeployed services on Solaris Zoned Virtual Machines providing high reliability services \n•\tLead global support team and mentored local junior engineers \n•\tDefined global software development framework for assuring international import/export law compliance and implemented application environment for compliance monitoring \n•\tDefined Enterprise software development roadmaps \n•\tProposed software development framework alternatives for further reducing development costs (Open) 2 recommendations Ocean Ma Manager III, Advisory Services(TMT) at Ernst & Young (China) Advisory Dean's passion and professional skills on CM gives a great contribution to the ClearCase Multisite setup which plays a... View Jo Farrington Da Boss at Blissfully Retired I had the privilege of working with Dean while implementing Global Trade Compliance requirements at ENPEC. He was always... View Senior Staff Software Engineer - Enterprise Tools Team Lead General Dynamics C4 Systems April 2006  –  October 2009  (3 years 7 months) Enterprise Tools Team Lead for 3000 software developer organization providing systems deployment plans and project execution meeting strict deadlines with zero Enterprise impact. Developed reduced maintenance sustainable solutions for all areas of software development lifecycle framework. Developed Enterprise roadmaps for integrating industry best practices.  \n•\tArchitect and project lead of major maintenance deployment plans, coordinating cross organizational resources for plan execution \n•\tMaintained environment resources for diverse platforms, IE Windows, Solaris, Linux, Netapp \n•\tDeveloped migration tools for consolidating business acquisitions into core Enterprise framework \n•\tEnforced software development policy and standards compliance through PERL based triggers \n•\tParticipated in the Rational Tools portion of FISMA certification for I-WIN program \n•\tEvaluated and supported BuildForge Enterprise build environment Senior Staff Software Engineer - Enterprise Tools Team Lead General Dynamics C4 Systems April 2006  –  October 2009  (3 years 7 months) Enterprise Tools Team Lead for 3000 software developer organization providing systems deployment plans and project execution meeting strict deadlines with zero Enterprise impact. Developed reduced maintenance sustainable solutions for all areas of software development lifecycle framework. Developed Enterprise roadmaps for integrating industry best practices.  \n•\tArchitect and project lead of major maintenance deployment plans, coordinating cross organizational resources for plan execution \n•\tMaintained environment resources for diverse platforms, IE Windows, Solaris, Linux, Netapp \n•\tDeveloped migration tools for consolidating business acquisitions into core Enterprise framework \n•\tEnforced software development policy and standards compliance through PERL based triggers \n•\tParticipated in the Rational Tools portion of FISMA certification for I-WIN program \n•\tEvaluated and supported BuildForge Enterprise build environment Founder / Systems Consultant Richardson Consulting April 2001  –  March 2006  (5 years) Consultant providing computing infrastructure services to wholesale distribution organizations. Provided innovative solutions for migration of mainframe services to customized Linux platform, reducing infrastructure operating costs by 80% and enabled services otherwise unavailable to the environment. Deployed secure infrastructure technologies between sites leveraging commodity internet infrastructure, reducing communications costs 70%. Consulted with customers on emerging internet technologies and implemented solutions.  \n•\tImproved customer relationships through improved communication methods like corporate email systems and web presences \n•\tReduced infrastructure costs by implementing open source solutions, eliminating incumbent licensing costs \n•\tDeveloped Linux HA file server system leveraging GFS and NMB service architecture \n•\tDeveloped Linux Kernel Mainframe Emulator, eliminating mainframe equipment and licensing costs \n•\tProactively maintained customer environments through service agreements Founder / Systems Consultant Richardson Consulting April 2001  –  March 2006  (5 years) Consultant providing computing infrastructure services to wholesale distribution organizations. Provided innovative solutions for migration of mainframe services to customized Linux platform, reducing infrastructure operating costs by 80% and enabled services otherwise unavailable to the environment. Deployed secure infrastructure technologies between sites leveraging commodity internet infrastructure, reducing communications costs 70%. Consulted with customers on emerging internet technologies and implemented solutions.  \n•\tImproved customer relationships through improved communication methods like corporate email systems and web presences \n•\tReduced infrastructure costs by implementing open source solutions, eliminating incumbent licensing costs \n•\tDeveloped Linux HA file server system leveraging GFS and NMB service architecture \n•\tDeveloped Linux Kernel Mainframe Emulator, eliminating mainframe equipment and licensing costs \n•\tProactively maintained customer environments through service agreements Network admin SNET Internet 1999  –  2000  (1 year) Windows Server Administration Network admin SNET Internet 1999  –  2000  (1 year) Windows Server Administration Skills Top Skills 35 Integration 28 ClearCase 23 Perl 21 Software Development 17 SDLC 16 ClearQuest 15 Software Engineering 15 Linux 15 Enterprise Software 11 Cloud Computing Dean also knows about... 9 Solaris 8 Agile Methodologies 7 Project Management 7 Systems Engineering 7 Configuration Management 7 System Architecture 6 Rational Team Concert 6 Enterprise Architecture 6 Java 6 UML 5 SQL 4 Rational DOORS 3 Rational Quality Manager 3 Distributed Systems 2 Rational Requirements... 2 Rational Change 1 Rational Synergy 1 RequisitePro 1 WebSphere Application... 1 BASH 1 Visual Basic 1 .NET 1 MySQL 1 Microsoft Office 1 Solution Architecture 1 JavaScript 1 Engineering 1 Process Engineering 1 Rhapsody 1 Bash 1 CM Synergy See 16+     See less Skills  Top Skills 35 Integration 28 ClearCase 23 Perl 21 Software Development 17 SDLC 16 ClearQuest 15 Software Engineering 15 Linux 15 Enterprise Software 11 Cloud Computing Dean also knows about... 9 Solaris 8 Agile Methodologies 7 Project Management 7 Systems Engineering 7 Configuration Management 7 System Architecture 6 Rational Team Concert 6 Enterprise Architecture 6 Java 6 UML 5 SQL 4 Rational DOORS 3 Rational Quality Manager 3 Distributed Systems 2 Rational Requirements... 2 Rational Change 1 Rational Synergy 1 RequisitePro 1 WebSphere Application... 1 BASH 1 Visual Basic 1 .NET 1 MySQL 1 Microsoft Office 1 Solution Architecture 1 JavaScript 1 Engineering 1 Process Engineering 1 Rhapsody 1 Bash 1 CM Synergy See 16+     See less Top Skills 35 Integration 28 ClearCase 23 Perl 21 Software Development 17 SDLC 16 ClearQuest 15 Software Engineering 15 Linux 15 Enterprise Software 11 Cloud Computing Dean also knows about... 9 Solaris 8 Agile Methodologies 7 Project Management 7 Systems Engineering 7 Configuration Management 7 System Architecture 6 Rational Team Concert 6 Enterprise Architecture 6 Java 6 UML 5 SQL 4 Rational DOORS 3 Rational Quality Manager 3 Distributed Systems 2 Rational Requirements... 2 Rational Change 1 Rational Synergy 1 RequisitePro 1 WebSphere Application... 1 BASH 1 Visual Basic 1 .NET 1 MySQL 1 Microsoft Office 1 Solution Architecture 1 JavaScript 1 Engineering 1 Process Engineering 1 Rhapsody 1 Bash 1 CM Synergy See 16+     See less Top Skills 35 Integration 28 ClearCase 23 Perl 21 Software Development 17 SDLC 16 ClearQuest 15 Software Engineering 15 Linux 15 Enterprise Software 11 Cloud Computing Dean also knows about... 9 Solaris 8 Agile Methodologies 7 Project Management 7 Systems Engineering 7 Configuration Management 7 System Architecture 6 Rational Team Concert 6 Enterprise Architecture 6 Java 6 UML 5 SQL 4 Rational DOORS 3 Rational Quality Manager 3 Distributed Systems 2 Rational Requirements... 2 Rational Change 1 Rational Synergy 1 RequisitePro 1 WebSphere Application... 1 BASH 1 Visual Basic 1 .NET 1 MySQL 1 Microsoft Office 1 Solution Architecture 1 JavaScript 1 Engineering 1 Process Engineering 1 Rhapsody 1 Bash 1 CM Synergy See 16+     See less                     9 Solaris 8 Agile Methodologies 7 Project Management 7 Systems Engineering 7 Configuration Management 7 System Architecture 6 Rational Team Concert 6 Enterprise Architecture 6 Java 6 UML 5 SQL 4 Rational DOORS 3 Rational Quality Manager 3 Distributed Systems 2 Rational Requirements... 2 Rational Change 1 Rational Synergy 1 RequisitePro 1 WebSphere Application... 1 BASH 1 Visual Basic 1 .NET 1 MySQL 1 Microsoft Office 1 Solution Architecture 1 JavaScript 1 Engineering 1 Process Engineering 1 Rhapsody 1 Bash 1 CM Synergy Education Georgia Institute of Technology Graduate,  Health Physics 1995  – 1996 Rensselaer Polytechnic Institute Graduate Studies,  Engineering Physics 1994  – 1995 Teaching assistant for Nuclear Engineering Classes.  \n \nConducted research on advanced microchip lasers. Rensselaer Polytechnic Institute Bachelors,  Engineering Physics 1990  – 1995 Engineering Physics Activities and Societies:  Rensselaer Christian Association Georgia Institute of Technology Graduate,  Health Physics 1995  – 1996 Georgia Institute of Technology Graduate,  Health Physics 1995  – 1996 Georgia Institute of Technology Graduate,  Health Physics 1995  – 1996 Rensselaer Polytechnic Institute Graduate Studies,  Engineering Physics 1994  – 1995 Teaching assistant for Nuclear Engineering Classes.  \n \nConducted research on advanced microchip lasers. Rensselaer Polytechnic Institute Graduate Studies,  Engineering Physics 1994  – 1995 Teaching assistant for Nuclear Engineering Classes.  \n \nConducted research on advanced microchip lasers. Rensselaer Polytechnic Institute Graduate Studies,  Engineering Physics 1994  – 1995 Teaching assistant for Nuclear Engineering Classes.  \n \nConducted research on advanced microchip lasers. Rensselaer Polytechnic Institute Bachelors,  Engineering Physics 1990  – 1995 Engineering Physics Activities and Societies:  Rensselaer Christian Association Rensselaer Polytechnic Institute Bachelors,  Engineering Physics 1990  – 1995 Engineering Physics Activities and Societies:  Rensselaer Christian Association Rensselaer Polytechnic Institute Bachelors,  Engineering Physics 1990  – 1995 Engineering Physics Activities and Societies:  Rensselaer Christian Association ", "Summary Specialties:15 years experience in VMS \nDCL Programming \nCost Avoidance/Reduction \nSEI Level 3 \nProcess Improvement \nReuse of Resources \nExcellent Communication Skills \nTeam Player and Leader \n99.999% Uptime Maintained \nVMS 5 to 5.5 to 6.2 to 7.2 to 7.3\t \nPatch Management\t \nPROMIS Application Support \nUNIX and Linux Exposure\t \nCluster Support\t \nWorldwide Support Summary Specialties:15 years experience in VMS \nDCL Programming \nCost Avoidance/Reduction \nSEI Level 3 \nProcess Improvement \nReuse of Resources \nExcellent Communication Skills \nTeam Player and Leader \n99.999% Uptime Maintained \nVMS 5 to 5.5 to 6.2 to 7.2 to 7.3\t \nPatch Management\t \nPROMIS Application Support \nUNIX and Linux Exposure\t \nCluster Support\t \nWorldwide Support Specialties:15 years experience in VMS \nDCL Programming \nCost Avoidance/Reduction \nSEI Level 3 \nProcess Improvement \nReuse of Resources \nExcellent Communication Skills \nTeam Player and Leader \n99.999% Uptime Maintained \nVMS 5 to 5.5 to 6.2 to 7.2 to 7.3\t \nPatch Management\t \nPROMIS Application Support \nUNIX and Linux Exposure\t \nCluster Support\t \nWorldwide Support Specialties:15 years experience in VMS \nDCL Programming \nCost Avoidance/Reduction \nSEI Level 3 \nProcess Improvement \nReuse of Resources \nExcellent Communication Skills \nTeam Player and Leader \n99.999% Uptime Maintained \nVMS 5 to 5.5 to 6.2 to 7.2 to 7.3\t \nPatch Management\t \nPROMIS Application Support \nUNIX and Linux Exposure\t \nCluster Support\t \nWorldwide Support Experience Sr. Systems Engineer Intel Corporation January 2006  – Present (9 years 8 months) Support, upgades and consolidation of VMS systems. Senior VMS System Manager ON Semiconductor June 1993  –  January 2006  (12 years 8 months) VMS System Manager Motorola 1993  –  1999  (6 years) Sr. Systems Engineer Intel Corporation January 2006  – Present (9 years 8 months) Support, upgades and consolidation of VMS systems. Sr. Systems Engineer Intel Corporation January 2006  – Present (9 years 8 months) Support, upgades and consolidation of VMS systems. Senior VMS System Manager ON Semiconductor June 1993  –  January 2006  (12 years 8 months) Senior VMS System Manager ON Semiconductor June 1993  –  January 2006  (12 years 8 months) VMS System Manager Motorola 1993  –  1999  (6 years) VMS System Manager Motorola 1993  –  1999  (6 years) Skills Top Skills 21 Unix 14 Linux 10 Data Center 7 VMS 6 Cluster 5 Perl 5 TCP/IP 3 Process Improvement 3 Operating Systems 3 System Administration Susan also knows about... 3 ITIL 3 Windows Server 3 Windows 3 Storage 2 Patch Management 2 Disaster Recovery 1 Scripting 1 Project Management Skills  Top Skills 21 Unix 14 Linux 10 Data Center 7 VMS 6 Cluster 5 Perl 5 TCP/IP 3 Process Improvement 3 Operating Systems 3 System Administration Susan also knows about... 3 ITIL 3 Windows Server 3 Windows 3 Storage 2 Patch Management 2 Disaster Recovery 1 Scripting 1 Project Management Top Skills 21 Unix 14 Linux 10 Data Center 7 VMS 6 Cluster 5 Perl 5 TCP/IP 3 Process Improvement 3 Operating Systems 3 System Administration Susan also knows about... 3 ITIL 3 Windows Server 3 Windows 3 Storage 2 Patch Management 2 Disaster Recovery 1 Scripting 1 Project Management Top Skills 21 Unix 14 Linux 10 Data Center 7 VMS 6 Cluster 5 Perl 5 TCP/IP 3 Process Improvement 3 Operating Systems 3 System Administration Susan also knows about... 3 ITIL 3 Windows Server 3 Windows 3 Storage 2 Patch Management 2 Disaster Recovery 1 Scripting 1 Project Management                     3 ITIL 3 Windows Server 3 Windows 3 Storage 2 Patch Management 2 Disaster Recovery 1 Scripting 1 Project Management Education University of Phoenix MSCIS,  Computer and Information Sciences and Support Services 2003  – 2005 Arizona State University BS,  CIS 1990  – 1993 Arizona State University - W. P. Carey School of Business BS,  Computer Information Systems 1990  – 1993 University of Phoenix MSCIS,  Computer and Information Sciences and Support Services 2003  – 2005 University of Phoenix MSCIS,  Computer and Information Sciences and Support Services 2003  – 2005 University of Phoenix MSCIS,  Computer and Information Sciences and Support Services 2003  – 2005 Arizona State University BS,  CIS 1990  – 1993 Arizona State University BS,  CIS 1990  – 1993 Arizona State University BS,  CIS 1990  – 1993 Arizona State University - W. P. Carey School of Business BS,  Computer Information Systems 1990  – 1993 Arizona State University - W. P. Carey School of Business BS,  Computer Information Systems 1990  – 1993 Arizona State University - W. P. Carey School of Business BS,  Computer Information Systems 1990  – 1993 ", "Experience Senior Systems Engineer Intel Corporation October 2004  – Present (10 years 11 months) Senior Systems Engineer Intel Corporation October 2004  – Present (10 years 11 months) Senior Systems Engineer Intel Corporation October 2004  – Present (10 years 11 months) Skills Top Skills 2 Microsoft Office 2 Microsoft Excel 2 Microsoft Word 2 Windows 1 Customer Service 1 PowerPoint 1 English 1 Outlook 1 Teaching 1 HTML Karl also knows about... 1 C++ 1 C 0 Research 0 Photoshop 0 Public Speaking 0 Strategic Planning 0 Budgets 0 Negotiation 0 Editing 0 Java Skills  Top Skills 2 Microsoft Office 2 Microsoft Excel 2 Microsoft Word 2 Windows 1 Customer Service 1 PowerPoint 1 English 1 Outlook 1 Teaching 1 HTML Karl also knows about... 1 C++ 1 C 0 Research 0 Photoshop 0 Public Speaking 0 Strategic Planning 0 Budgets 0 Negotiation 0 Editing 0 Java Top Skills 2 Microsoft Office 2 Microsoft Excel 2 Microsoft Word 2 Windows 1 Customer Service 1 PowerPoint 1 English 1 Outlook 1 Teaching 1 HTML Karl also knows about... 1 C++ 1 C 0 Research 0 Photoshop 0 Public Speaking 0 Strategic Planning 0 Budgets 0 Negotiation 0 Editing 0 Java Top Skills 2 Microsoft Office 2 Microsoft Excel 2 Microsoft Word 2 Windows 1 Customer Service 1 PowerPoint 1 English 1 Outlook 1 Teaching 1 HTML Karl also knows about... 1 C++ 1 C 0 Research 0 Photoshop 0 Public Speaking 0 Strategic Planning 0 Budgets 0 Negotiation 0 Editing 0 Java                     1 C++ 1 C 0 Research 0 Photoshop 0 Public Speaking 0 Strategic Planning 0 Budgets 0 Negotiation 0 Editing 0 Java ", "Languages   Skills Top Skills 23 Security 21 Integration 21 Enterprise Software 14 Software Development 11 Cloud Computing 11 SaaS 9 Virtualization 9 SDLC 8 CRM 8 Product Management Ronen also knows about... 8 Business Intelligence 7 Microsoft SQL Server 7 Management 6 Agile Methodologies 6 Business Analysis 5 Requirements Analysis 5 Networking 4 Program Management 4 Project Management 4 Strategy 4 Software Project... 4 Data Center 4 Microsoft Exchange 3 Leadership 3 IT Management 3 Professional Services 3 IIS 3 Web Applications 3 Network Architecture 2 Start-ups 2 Databases 2 Firewalls 2 Enterprise Architecture 2 IT Strategy 2 .NET 2 Team Leadership 2 Architecture 2 IT Operations 2 Information Security 2 Consulting 2 Vendor Management 2 Project Delivery 2 Network Security 2 System Administration 1 Start-up Consulting 1 Business Development 1 Hosting Services 1 Entrepreneurship 1 Project Planning 1 SharePoint See 25+     See less Skills  Top Skills 23 Security 21 Integration 21 Enterprise Software 14 Software Development 11 Cloud Computing 11 SaaS 9 Virtualization 9 SDLC 8 CRM 8 Product Management Ronen also knows about... 8 Business Intelligence 7 Microsoft SQL Server 7 Management 6 Agile Methodologies 6 Business Analysis 5 Requirements Analysis 5 Networking 4 Program Management 4 Project Management 4 Strategy 4 Software Project... 4 Data Center 4 Microsoft Exchange 3 Leadership 3 IT Management 3 Professional Services 3 IIS 3 Web Applications 3 Network Architecture 2 Start-ups 2 Databases 2 Firewalls 2 Enterprise Architecture 2 IT Strategy 2 .NET 2 Team Leadership 2 Architecture 2 IT Operations 2 Information Security 2 Consulting 2 Vendor Management 2 Project Delivery 2 Network Security 2 System Administration 1 Start-up Consulting 1 Business Development 1 Hosting Services 1 Entrepreneurship 1 Project Planning 1 SharePoint See 25+     See less Top Skills 23 Security 21 Integration 21 Enterprise Software 14 Software Development 11 Cloud Computing 11 SaaS 9 Virtualization 9 SDLC 8 CRM 8 Product Management Ronen also knows about... 8 Business Intelligence 7 Microsoft SQL Server 7 Management 6 Agile Methodologies 6 Business Analysis 5 Requirements Analysis 5 Networking 4 Program Management 4 Project Management 4 Strategy 4 Software Project... 4 Data Center 4 Microsoft Exchange 3 Leadership 3 IT Management 3 Professional Services 3 IIS 3 Web Applications 3 Network Architecture 2 Start-ups 2 Databases 2 Firewalls 2 Enterprise Architecture 2 IT Strategy 2 .NET 2 Team Leadership 2 Architecture 2 IT Operations 2 Information Security 2 Consulting 2 Vendor Management 2 Project Delivery 2 Network Security 2 System Administration 1 Start-up Consulting 1 Business Development 1 Hosting Services 1 Entrepreneurship 1 Project Planning 1 SharePoint See 25+     See less Top Skills 23 Security 21 Integration 21 Enterprise Software 14 Software Development 11 Cloud Computing 11 SaaS 9 Virtualization 9 SDLC 8 CRM 8 Product Management Ronen also knows about... 8 Business Intelligence 7 Microsoft SQL Server 7 Management 6 Agile Methodologies 6 Business Analysis 5 Requirements Analysis 5 Networking 4 Program Management 4 Project Management 4 Strategy 4 Software Project... 4 Data Center 4 Microsoft Exchange 3 Leadership 3 IT Management 3 Professional Services 3 IIS 3 Web Applications 3 Network Architecture 2 Start-ups 2 Databases 2 Firewalls 2 Enterprise Architecture 2 IT Strategy 2 .NET 2 Team Leadership 2 Architecture 2 IT Operations 2 Information Security 2 Consulting 2 Vendor Management 2 Project Delivery 2 Network Security 2 System Administration 1 Start-up Consulting 1 Business Development 1 Hosting Services 1 Entrepreneurship 1 Project Planning 1 SharePoint See 25+     See less                     8 Business Intelligence 7 Microsoft SQL Server 7 Management 6 Agile Methodologies 6 Business Analysis 5 Requirements Analysis 5 Networking 4 Program Management 4 Project Management 4 Strategy 4 Software Project... 4 Data Center 4 Microsoft Exchange 3 Leadership 3 IT Management 3 Professional Services 3 IIS 3 Web Applications 3 Network Architecture 2 Start-ups 2 Databases 2 Firewalls 2 Enterprise Architecture 2 IT Strategy 2 .NET 2 Team Leadership 2 Architecture 2 IT Operations 2 Information Security 2 Consulting 2 Vendor Management 2 Project Delivery 2 Network Security 2 System Administration 1 Start-up Consulting 1 Business Development 1 Hosting Services 1 Entrepreneurship 1 Project Planning 1 SharePoint ", "Summary Results-driven IT professional with more than 17 years of experience managing operations for enterprise IT capabilities at Intel. Proven ability to lead operational organizations to build and operate best in class processes and procedures in alignment with corporate objectives. Notable success influencing across organizations on behalf of customers to deliver quality capabilities enabling the customer’s business needs. Summary Results-driven IT professional with more than 17 years of experience managing operations for enterprise IT capabilities at Intel. Proven ability to lead operational organizations to build and operate best in class processes and procedures in alignment with corporate objectives. Notable success influencing across organizations on behalf of customers to deliver quality capabilities enabling the customer’s business needs. Results-driven IT professional with more than 17 years of experience managing operations for enterprise IT capabilities at Intel. Proven ability to lead operational organizations to build and operate best in class processes and procedures in alignment with corporate objectives. Notable success influencing across organizations on behalf of customers to deliver quality capabilities enabling the customer’s business needs. Results-driven IT professional with more than 17 years of experience managing operations for enterprise IT capabilities at Intel. Proven ability to lead operational organizations to build and operate best in class processes and procedures in alignment with corporate objectives. Notable success influencing across organizations on behalf of customers to deliver quality capabilities enabling the customer’s business needs. Experience Enterprise Applications Vendor & Service Level Manager Intel Corporation August 2011  – Present (4 years 1 month) - Responsible for global operational quality of external company gateways (RosettaNet, EDI, File Transfer) and middleware to enterprise applications \n- Created and negotiated Service Level Targets and Operational Level Agreements with customers \n- Successfully outsourced second level support from 2 disjoined organizations in to a single 24x7 team providing a higher level of support quality for global customers including external users \n- Implemented standardized Major Incident Management process across the organization \n- Led the Service Level Management aspects of the organizations move to an ITIL based service operations framework while providing consultation on the Incident and Problem processes \n- Manage and report out on improvement plans to senior management and customer stakeholders \n- Provided leadership to the production services team, providing coaching to the team in processes, troubleshooting logic and personal growth \n- Manage IBM relationship for all products in use as well as financial management for additional vendors Service Operations Manager Intel Corporation June 2008  –  August 2011  (3 years 3 months) - Responsible for global operational quality of enterprise SAP, PeopleSoft and Scheduling services \n- Own operational processes and indicators with focus on ITIL based Incident and Problem Management \n- ITIL V2 and V3 Foundations certified \n- ITIL V3 Operational Support and Analysis certified \n- Designed and implemented Problem Management processes which were role modeled cross IT \n- SLA/OLA and Service Level Objectives ownership \n- Create and deliver Service Management Reviews to partners/customers \n- Owned all operational transition items in two major reorganizations, rebuilding each time to a role model org. \n- Member of the corporate IT crisis manager rotation, managing events across IT and non-IT business units Employee Portal Operations Manager Intel Corporation November 2006  –  June 2008  (1 year 8 months) - Operations lead for the Business Analysts responsible for global operational activities on the existing enterprise employee portal \n- Developed and implemented the organizational design for supporting the next generation enterprise employee portal \n- Project managed build out of infrastructure for next generation portal and migration of employees between the portals \n- Owned new customer engagement for applications and content landing on the portal \n- Lead a cross functional team of technical & business leads, customer support and project managers responsible for maintaining the internal portal platform IT Manager Intel Corporation February 2006  –  November 2006  (10 months) - Managed 4 Business Analysts responsible for delivery of the global internal employee portal \n- Created and executed to organizational objectives through clear goal setting with individual team members \n- Removed roadblocks for employees and facilitated problem solving, enabling them to perform at their highest potential \n- Managed employee development through personal development plans and effective performance management, increasing employee output Senior Business Analyst Intel Corporation September 2003  –  February 2006  (2 years 6 months) - Managed projects across the business team and partner development team to achieve shared goals within the employee portal \n- Developed roadmaps for group owned capabilities to plan for customer impact, technology and resource needs \n- Performed internal customer management, external vendor management and end user engagement to ensure smooth operations across the platform \n- Performed release management for global capabilities \n- Ensured compliance to corporate controls and industry initiatives Senior Systems Integrator Intel Corporation April 2002  –  September 2003  (1 year 6 months) - Led an enterprise integration and deployment effort of a standardized Microsoft Operations Manager (MOM) based systems management solution across multiple business units \n- Created a technical design for the solution that aligned customer business needs with capabilities of the product \n- Drove change to customer business processes in order to support the standardized solution Site Operations Manager Intel Corporation June 2000  –  April 2002  (1 year 11 months) - Responsible for quality and stability of an information management system used to deliver technical and marketing content from internal authors to sales personnel and their external customers \n- Acted as a liaison between application development, business, support, and legal/information security teams as well as interfacing with end customers and global geography representatives to ensure quality and stability of the system Senior Systems Engineer Intel Corporation May 1999  –  June 2000  (1 year 2 months) - Led a product engineering team responsible for architecting, integrating, and supporting eBusiness products (purchased and developed) internal and external facing \n- Implemented an Internet based secure documents distribution system utilizing PKI (Digital Certificate) technology Systems Engineer Intel Corporation January 1996  –  May 1999  (3 years 5 months) - Responsible for architecting, implementing, and supporting multiple messaging systems including Microsoft Exchange, Lotus Notes and cc:Mail \n- Designed, tested, and globally deployed (both onsite and remotely) email infrastructure standards \n- Built & executed a plan to test functionality and performance on competing email products, publishing & presenting the test results used for product selection \n- Developed operational procedures and support training materials including delivery of the training Computer Consultant Self Employed 1991  –  1996  (5 years) - Planned, implemented, and maintained Novell based LAN’s for several small businesses \n- Setup, maintenance and repair of PC’s & associated peripherals Engineering Assistant Eldyne Inc. June 1990  –  December 1995  (5 years 7 months) - Hardware development consisting of circuit board fabrication, diagnostics, modification, and prototype layout \n- Testing of software for embedded and integrated systems \n- Managed companywide PC and network infrastructure Enterprise Applications Vendor & Service Level Manager Intel Corporation August 2011  – Present (4 years 1 month) - Responsible for global operational quality of external company gateways (RosettaNet, EDI, File Transfer) and middleware to enterprise applications \n- Created and negotiated Service Level Targets and Operational Level Agreements with customers \n- Successfully outsourced second level support from 2 disjoined organizations in to a single 24x7 team providing a higher level of support quality for global customers including external users \n- Implemented standardized Major Incident Management process across the organization \n- Led the Service Level Management aspects of the organizations move to an ITIL based service operations framework while providing consultation on the Incident and Problem processes \n- Manage and report out on improvement plans to senior management and customer stakeholders \n- Provided leadership to the production services team, providing coaching to the team in processes, troubleshooting logic and personal growth \n- Manage IBM relationship for all products in use as well as financial management for additional vendors Enterprise Applications Vendor & Service Level Manager Intel Corporation August 2011  – Present (4 years 1 month) - Responsible for global operational quality of external company gateways (RosettaNet, EDI, File Transfer) and middleware to enterprise applications \n- Created and negotiated Service Level Targets and Operational Level Agreements with customers \n- Successfully outsourced second level support from 2 disjoined organizations in to a single 24x7 team providing a higher level of support quality for global customers including external users \n- Implemented standardized Major Incident Management process across the organization \n- Led the Service Level Management aspects of the organizations move to an ITIL based service operations framework while providing consultation on the Incident and Problem processes \n- Manage and report out on improvement plans to senior management and customer stakeholders \n- Provided leadership to the production services team, providing coaching to the team in processes, troubleshooting logic and personal growth \n- Manage IBM relationship for all products in use as well as financial management for additional vendors Service Operations Manager Intel Corporation June 2008  –  August 2011  (3 years 3 months) - Responsible for global operational quality of enterprise SAP, PeopleSoft and Scheduling services \n- Own operational processes and indicators with focus on ITIL based Incident and Problem Management \n- ITIL V2 and V3 Foundations certified \n- ITIL V3 Operational Support and Analysis certified \n- Designed and implemented Problem Management processes which were role modeled cross IT \n- SLA/OLA and Service Level Objectives ownership \n- Create and deliver Service Management Reviews to partners/customers \n- Owned all operational transition items in two major reorganizations, rebuilding each time to a role model org. \n- Member of the corporate IT crisis manager rotation, managing events across IT and non-IT business units Service Operations Manager Intel Corporation June 2008  –  August 2011  (3 years 3 months) - Responsible for global operational quality of enterprise SAP, PeopleSoft and Scheduling services \n- Own operational processes and indicators with focus on ITIL based Incident and Problem Management \n- ITIL V2 and V3 Foundations certified \n- ITIL V3 Operational Support and Analysis certified \n- Designed and implemented Problem Management processes which were role modeled cross IT \n- SLA/OLA and Service Level Objectives ownership \n- Create and deliver Service Management Reviews to partners/customers \n- Owned all operational transition items in two major reorganizations, rebuilding each time to a role model org. \n- Member of the corporate IT crisis manager rotation, managing events across IT and non-IT business units Employee Portal Operations Manager Intel Corporation November 2006  –  June 2008  (1 year 8 months) - Operations lead for the Business Analysts responsible for global operational activities on the existing enterprise employee portal \n- Developed and implemented the organizational design for supporting the next generation enterprise employee portal \n- Project managed build out of infrastructure for next generation portal and migration of employees between the portals \n- Owned new customer engagement for applications and content landing on the portal \n- Lead a cross functional team of technical & business leads, customer support and project managers responsible for maintaining the internal portal platform Employee Portal Operations Manager Intel Corporation November 2006  –  June 2008  (1 year 8 months) - Operations lead for the Business Analysts responsible for global operational activities on the existing enterprise employee portal \n- Developed and implemented the organizational design for supporting the next generation enterprise employee portal \n- Project managed build out of infrastructure for next generation portal and migration of employees between the portals \n- Owned new customer engagement for applications and content landing on the portal \n- Lead a cross functional team of technical & business leads, customer support and project managers responsible for maintaining the internal portal platform IT Manager Intel Corporation February 2006  –  November 2006  (10 months) - Managed 4 Business Analysts responsible for delivery of the global internal employee portal \n- Created and executed to organizational objectives through clear goal setting with individual team members \n- Removed roadblocks for employees and facilitated problem solving, enabling them to perform at their highest potential \n- Managed employee development through personal development plans and effective performance management, increasing employee output IT Manager Intel Corporation February 2006  –  November 2006  (10 months) - Managed 4 Business Analysts responsible for delivery of the global internal employee portal \n- Created and executed to organizational objectives through clear goal setting with individual team members \n- Removed roadblocks for employees and facilitated problem solving, enabling them to perform at their highest potential \n- Managed employee development through personal development plans and effective performance management, increasing employee output Senior Business Analyst Intel Corporation September 2003  –  February 2006  (2 years 6 months) - Managed projects across the business team and partner development team to achieve shared goals within the employee portal \n- Developed roadmaps for group owned capabilities to plan for customer impact, technology and resource needs \n- Performed internal customer management, external vendor management and end user engagement to ensure smooth operations across the platform \n- Performed release management for global capabilities \n- Ensured compliance to corporate controls and industry initiatives Senior Business Analyst Intel Corporation September 2003  –  February 2006  (2 years 6 months) - Managed projects across the business team and partner development team to achieve shared goals within the employee portal \n- Developed roadmaps for group owned capabilities to plan for customer impact, technology and resource needs \n- Performed internal customer management, external vendor management and end user engagement to ensure smooth operations across the platform \n- Performed release management for global capabilities \n- Ensured compliance to corporate controls and industry initiatives Senior Systems Integrator Intel Corporation April 2002  –  September 2003  (1 year 6 months) - Led an enterprise integration and deployment effort of a standardized Microsoft Operations Manager (MOM) based systems management solution across multiple business units \n- Created a technical design for the solution that aligned customer business needs with capabilities of the product \n- Drove change to customer business processes in order to support the standardized solution Senior Systems Integrator Intel Corporation April 2002  –  September 2003  (1 year 6 months) - Led an enterprise integration and deployment effort of a standardized Microsoft Operations Manager (MOM) based systems management solution across multiple business units \n- Created a technical design for the solution that aligned customer business needs with capabilities of the product \n- Drove change to customer business processes in order to support the standardized solution Site Operations Manager Intel Corporation June 2000  –  April 2002  (1 year 11 months) - Responsible for quality and stability of an information management system used to deliver technical and marketing content from internal authors to sales personnel and their external customers \n- Acted as a liaison between application development, business, support, and legal/information security teams as well as interfacing with end customers and global geography representatives to ensure quality and stability of the system Site Operations Manager Intel Corporation June 2000  –  April 2002  (1 year 11 months) - Responsible for quality and stability of an information management system used to deliver technical and marketing content from internal authors to sales personnel and their external customers \n- Acted as a liaison between application development, business, support, and legal/information security teams as well as interfacing with end customers and global geography representatives to ensure quality and stability of the system Senior Systems Engineer Intel Corporation May 1999  –  June 2000  (1 year 2 months) - Led a product engineering team responsible for architecting, integrating, and supporting eBusiness products (purchased and developed) internal and external facing \n- Implemented an Internet based secure documents distribution system utilizing PKI (Digital Certificate) technology Senior Systems Engineer Intel Corporation May 1999  –  June 2000  (1 year 2 months) - Led a product engineering team responsible for architecting, integrating, and supporting eBusiness products (purchased and developed) internal and external facing \n- Implemented an Internet based secure documents distribution system utilizing PKI (Digital Certificate) technology Systems Engineer Intel Corporation January 1996  –  May 1999  (3 years 5 months) - Responsible for architecting, implementing, and supporting multiple messaging systems including Microsoft Exchange, Lotus Notes and cc:Mail \n- Designed, tested, and globally deployed (both onsite and remotely) email infrastructure standards \n- Built & executed a plan to test functionality and performance on competing email products, publishing & presenting the test results used for product selection \n- Developed operational procedures and support training materials including delivery of the training Systems Engineer Intel Corporation January 1996  –  May 1999  (3 years 5 months) - Responsible for architecting, implementing, and supporting multiple messaging systems including Microsoft Exchange, Lotus Notes and cc:Mail \n- Designed, tested, and globally deployed (both onsite and remotely) email infrastructure standards \n- Built & executed a plan to test functionality and performance on competing email products, publishing & presenting the test results used for product selection \n- Developed operational procedures and support training materials including delivery of the training Computer Consultant Self Employed 1991  –  1996  (5 years) - Planned, implemented, and maintained Novell based LAN’s for several small businesses \n- Setup, maintenance and repair of PC’s & associated peripherals Computer Consultant Self Employed 1991  –  1996  (5 years) - Planned, implemented, and maintained Novell based LAN’s for several small businesses \n- Setup, maintenance and repair of PC’s & associated peripherals Engineering Assistant Eldyne Inc. June 1990  –  December 1995  (5 years 7 months) - Hardware development consisting of circuit board fabrication, diagnostics, modification, and prototype layout \n- Testing of software for embedded and integrated systems \n- Managed companywide PC and network infrastructure Engineering Assistant Eldyne Inc. June 1990  –  December 1995  (5 years 7 months) - Hardware development consisting of circuit board fabrication, diagnostics, modification, and prototype layout \n- Testing of software for embedded and integrated systems \n- Managed companywide PC and network infrastructure Skills Top Skills 11 ITIL 10 Business Analysis 7 IT Management 6 Operations Management 6 Security 5 Service Management 5 Team Leadership 5 Business Process 2 Integration 2 Program Management James also knows about... 1 Software Documentation 0 ITIL Framework 0 Outsourcing Management 0 Customer Management 0 Stakeholder Management 0 SLA/OLA Management 0 Crisis Management 0 Operational Indicators 0 Process Design &... 0 ITIL Design &... Skills  Top Skills 11 ITIL 10 Business Analysis 7 IT Management 6 Operations Management 6 Security 5 Service Management 5 Team Leadership 5 Business Process 2 Integration 2 Program Management James also knows about... 1 Software Documentation 0 ITIL Framework 0 Outsourcing Management 0 Customer Management 0 Stakeholder Management 0 SLA/OLA Management 0 Crisis Management 0 Operational Indicators 0 Process Design &... 0 ITIL Design &... Top Skills 11 ITIL 10 Business Analysis 7 IT Management 6 Operations Management 6 Security 5 Service Management 5 Team Leadership 5 Business Process 2 Integration 2 Program Management James also knows about... 1 Software Documentation 0 ITIL Framework 0 Outsourcing Management 0 Customer Management 0 Stakeholder Management 0 SLA/OLA Management 0 Crisis Management 0 Operational Indicators 0 Process Design &... 0 ITIL Design &... Top Skills 11 ITIL 10 Business Analysis 7 IT Management 6 Operations Management 6 Security 5 Service Management 5 Team Leadership 5 Business Process 2 Integration 2 Program Management James also knows about... 1 Software Documentation 0 ITIL Framework 0 Outsourcing Management 0 Customer Management 0 Stakeholder Management 0 SLA/OLA Management 0 Crisis Management 0 Operational Indicators 0 Process Design &... 0 ITIL Design &...                     1 Software Documentation 0 ITIL Framework 0 Outsourcing Management 0 Customer Management 0 Stakeholder Management 0 SLA/OLA Management 0 Crisis Management 0 Operational Indicators 0 Process Design &... 0 ITIL Design &... Education San Diego State University-California State University Bachelor of Science,  Electrical Engineering 1990  – 1995 Activities and Societies:  Tau Beta Pi National Engineering Honor Society San Diego State University-California State University Bachelor of Science,  Electrical Engineering 1990  – 1995 Activities and Societies:  Tau Beta Pi National Engineering Honor Society San Diego State University-California State University Bachelor of Science,  Electrical Engineering 1990  – 1995 Activities and Societies:  Tau Beta Pi National Engineering Honor Society San Diego State University-California State University Bachelor of Science,  Electrical Engineering 1990  – 1995 Activities and Societies:  Tau Beta Pi National Engineering Honor Society "]}