{"position": "Senior Packaging Engineer", "company": "Intel Corporation", "profiles": ["Experience Senior Packaging engineer Intel Corporation Senior Packaging engineer Intel Corporation Senior Packaging engineer Intel Corporation Education Auburn University Auburn University Auburn University Auburn University ", "Summary Specialties:Polymers; surface science and engineering; Chemical engineering; microelectronics packaging; Si wet and dry etching. Summary Specialties:Polymers; surface science and engineering; Chemical engineering; microelectronics packaging; Si wet and dry etching. Specialties:Polymers; surface science and engineering; Chemical engineering; microelectronics packaging; Si wet and dry etching. Specialties:Polymers; surface science and engineering; Chemical engineering; microelectronics packaging; Si wet and dry etching. Experience Senior Packaging Engineer Intel Corporation August 2010  – Present (5 years 1 month) Material Technology Development: Capillary Underfill Project Lead (10nm) \nAssembly Test Technology Development MEMS Packaging Engineer Spatial Photonics, Inc. January 2009  –  August 2010  (1 year 8 months) Packaging of micro-mirror MEMS devices \nAnti-stiction coating \nSurface characterization \nSurface micro-machining Senior Packaging Engineer Intel Corporation August 2010  – Present (5 years 1 month) Material Technology Development: Capillary Underfill Project Lead (10nm) \nAssembly Test Technology Development Senior Packaging Engineer Intel Corporation August 2010  – Present (5 years 1 month) Material Technology Development: Capillary Underfill Project Lead (10nm) \nAssembly Test Technology Development MEMS Packaging Engineer Spatial Photonics, Inc. January 2009  –  August 2010  (1 year 8 months) Packaging of micro-mirror MEMS devices \nAnti-stiction coating \nSurface characterization \nSurface micro-machining MEMS Packaging Engineer Spatial Photonics, Inc. January 2009  –  August 2010  (1 year 8 months) Packaging of micro-mirror MEMS devices \nAnti-stiction coating \nSurface characterization \nSurface micro-machining Skills MEMS Semiconductors Nanotechnology Materials Science Thin Films Failure Analysis Characterization Surface Chemistry Chemical Engineering Nanomaterials Materials Polymers Microelectronics Design of Experiments Manufacturing Skills  MEMS Semiconductors Nanotechnology Materials Science Thin Films Failure Analysis Characterization Surface Chemistry Chemical Engineering Nanomaterials Materials Polymers Microelectronics Design of Experiments Manufacturing MEMS Semiconductors Nanotechnology Materials Science Thin Films Failure Analysis Characterization Surface Chemistry Chemical Engineering Nanomaterials Materials Polymers Microelectronics Design of Experiments Manufacturing MEMS Semiconductors Nanotechnology Materials Science Thin Films Failure Analysis Characterization Surface Chemistry Chemical Engineering Nanomaterials Materials Polymers Microelectronics Design of Experiments Manufacturing Education Georgia Institute of Technology PhD,  Chemical Engineering 2003  – 2008 Surface wetting/dewetting and interface adhesion for polymers and Si based materials: \nPolymers for nano-structured surface;  \nWater-repellent surfaces;  \nSilane surface treatment;  \nParylene conformal coating for microelectronics;  \nCNT growth and application; \nSol-gel process;  \nSi surface texturing. Zhejiang University Master,  Chemical Engineering 1998  – 2001 Studied in the state key lab of Polymerization Reaction Engineering.  \nRubber grafted PVC high impact resistant materials Georgia Institute of Technology PhD,  Chemical Engineering 2003  – 2008 Surface wetting/dewetting and interface adhesion for polymers and Si based materials: \nPolymers for nano-structured surface;  \nWater-repellent surfaces;  \nSilane surface treatment;  \nParylene conformal coating for microelectronics;  \nCNT growth and application; \nSol-gel process;  \nSi surface texturing. Georgia Institute of Technology PhD,  Chemical Engineering 2003  – 2008 Surface wetting/dewetting and interface adhesion for polymers and Si based materials: \nPolymers for nano-structured surface;  \nWater-repellent surfaces;  \nSilane surface treatment;  \nParylene conformal coating for microelectronics;  \nCNT growth and application; \nSol-gel process;  \nSi surface texturing. Georgia Institute of Technology PhD,  Chemical Engineering 2003  – 2008 Surface wetting/dewetting and interface adhesion for polymers and Si based materials: \nPolymers for nano-structured surface;  \nWater-repellent surfaces;  \nSilane surface treatment;  \nParylene conformal coating for microelectronics;  \nCNT growth and application; \nSol-gel process;  \nSi surface texturing. Zhejiang University Master,  Chemical Engineering 1998  – 2001 Studied in the state key lab of Polymerization Reaction Engineering.  \nRubber grafted PVC high impact resistant materials Zhejiang University Master,  Chemical Engineering 1998  – 2001 Studied in the state key lab of Polymerization Reaction Engineering.  \nRubber grafted PVC high impact resistant materials Zhejiang University Master,  Chemical Engineering 1998  – 2001 Studied in the state key lab of Polymerization Reaction Engineering.  \nRubber grafted PVC high impact resistant materials ", "Experience Senior Packaging Engineer Intel Corporation October 2011  – Present (3 years 11 months) Chandler, AZ Develope material for microelectronic packaging Senior Packaging Engineer Intel Corporation October 2011  – Present (3 years 11 months) Chandler, AZ Develope material for microelectronic packaging Senior Packaging Engineer Intel Corporation October 2011  – Present (3 years 11 months) Chandler, AZ Develope material for microelectronic packaging Skills Problem Solving Packaging Six Sigma Cross-functional Team... Process Engineering Testing Manufacturing Product Development Nanotechnology Characterization Lean Manufacturing Engineering Thin Films Electronics Design of Experiments Skills  Problem Solving Packaging Six Sigma Cross-functional Team... Process Engineering Testing Manufacturing Product Development Nanotechnology Characterization Lean Manufacturing Engineering Thin Films Electronics Design of Experiments Problem Solving Packaging Six Sigma Cross-functional Team... Process Engineering Testing Manufacturing Product Development Nanotechnology Characterization Lean Manufacturing Engineering Thin Films Electronics Design of Experiments Problem Solving Packaging Six Sigma Cross-functional Team... Process Engineering Testing Manufacturing Product Development Nanotechnology Characterization Lean Manufacturing Engineering Thin Films Electronics Design of Experiments Education Virginia Polytechnic Institute and State University Ph.D,  Polymer, Surface 2003  – 2009 Virginia Polytechnic Institute and State University Ph.D,  Polymer, Surface 2003  – 2009 Virginia Polytechnic Institute and State University Ph.D,  Polymer, Surface 2003  – 2009 Virginia Polytechnic Institute and State University Ph.D,  Polymer, Surface 2003  – 2009 ", "Summary Numerical and experimental fluids dynamics Summary Numerical and experimental fluids dynamics Numerical and experimental fluids dynamics Numerical and experimental fluids dynamics Experience Senior Packaging Engineer Intel Corporation November 2012  – Present (2 years 10 months) Chandler, AZ Thermo-fluids analysis supporting process technology development for electronics packaging applications. Graduate Student University of Wisconsin-Madison January 2008  –  October 2012  (4 years 10 months) Nuclear Engineering Graduate student with research position at the Wisconsin Shock Tube Laboratory performing experimental research on shock accelerated inhomogenous flows. My particular work involves the investigation of the shock acceleration of spherical soap bubbles. I study both the bubble morphology and the shock-initiated combustion of bubbles with reactive mixtures. Heat Transfer Instructor University of Wisconsin-Madison June 2011  –  May 2012  (1 year) Instructor for ME 364: Heat and Mass Transfer. Senior Packaging Engineer Intel Corporation November 2012  – Present (2 years 10 months) Chandler, AZ Thermo-fluids analysis supporting process technology development for electronics packaging applications. Senior Packaging Engineer Intel Corporation November 2012  – Present (2 years 10 months) Chandler, AZ Thermo-fluids analysis supporting process technology development for electronics packaging applications. Graduate Student University of Wisconsin-Madison January 2008  –  October 2012  (4 years 10 months) Nuclear Engineering Graduate student with research position at the Wisconsin Shock Tube Laboratory performing experimental research on shock accelerated inhomogenous flows. My particular work involves the investigation of the shock acceleration of spherical soap bubbles. I study both the bubble morphology and the shock-initiated combustion of bubbles with reactive mixtures. Graduate Student University of Wisconsin-Madison January 2008  –  October 2012  (4 years 10 months) Nuclear Engineering Graduate student with research position at the Wisconsin Shock Tube Laboratory performing experimental research on shock accelerated inhomogenous flows. My particular work involves the investigation of the shock acceleration of spherical soap bubbles. I study both the bubble morphology and the shock-initiated combustion of bubbles with reactive mixtures. Heat Transfer Instructor University of Wisconsin-Madison June 2011  –  May 2012  (1 year) Instructor for ME 364: Heat and Mass Transfer. Heat Transfer Instructor University of Wisconsin-Madison June 2011  –  May 2012  (1 year) Instructor for ME 364: Heat and Mass Transfer. Languages Arabic Elementary proficiency English Native or bilingual proficiency Arabic Elementary proficiency English Native or bilingual proficiency Arabic Elementary proficiency English Native or bilingual proficiency Elementary proficiency Native or bilingual proficiency Skills Heat Transfer Fluid Dynamics Thermal Analysis CFD Numerical Analysis Thermodynamics Combustion Electronics Packaging Electroplating Non-Newtonian Flow Diagnostics Spectroscopy Fluid Mechanics Fluids Thermal Shockwave compressible flows detonations PLIF Flow visualization Experimental Design Experimental Research Aerodynamics Aeronautics combustion diagnostics Nuclear Engineering Structural Analysis mechanics of materials Low Reynolds Number Flow Matlab Simulations Design of Experiments Experimentation See 18+     See less Skills  Heat Transfer Fluid Dynamics Thermal Analysis CFD Numerical Analysis Thermodynamics Combustion Electronics Packaging Electroplating Non-Newtonian Flow Diagnostics Spectroscopy Fluid Mechanics Fluids Thermal Shockwave compressible flows detonations PLIF Flow visualization Experimental Design Experimental Research Aerodynamics Aeronautics combustion diagnostics Nuclear Engineering Structural Analysis mechanics of materials Low Reynolds Number Flow Matlab Simulations Design of Experiments Experimentation See 18+     See less Heat Transfer Fluid Dynamics Thermal Analysis CFD Numerical Analysis Thermodynamics Combustion Electronics Packaging Electroplating Non-Newtonian Flow Diagnostics Spectroscopy Fluid Mechanics Fluids Thermal Shockwave compressible flows detonations PLIF Flow visualization Experimental Design Experimental Research Aerodynamics Aeronautics combustion diagnostics Nuclear Engineering Structural Analysis mechanics of materials Low Reynolds Number Flow Matlab Simulations Design of Experiments Experimentation See 18+     See less Heat Transfer Fluid Dynamics Thermal Analysis CFD Numerical Analysis Thermodynamics Combustion Electronics Packaging Electroplating Non-Newtonian Flow Diagnostics Spectroscopy Fluid Mechanics Fluids Thermal Shockwave compressible flows detonations PLIF Flow visualization Experimental Design Experimental Research Aerodynamics Aeronautics combustion diagnostics Nuclear Engineering Structural Analysis mechanics of materials Low Reynolds Number Flow Matlab Simulations Design of Experiments Experimentation See 18+     See less Education University of Wisconsin - Madison PhD,  Engineering Physics and Mechanical Engineering , 3.9 2010  – 2012 Activities and Societies:  American Physical Society (APS)\nAmerican Nuclear Society (ANS)\nAmerican Society of Mechanical Engineers (ASME)\nAmerican Institute of Chemical Engineers (AIChE) University of Wisconsin - Madison Master's degree,  Engineering Physics and Mechanical Engineering , 3.9 2007  – 2010 Activities and Societies:  APS University of Wisconsin-Madison B.S.,  Physics/Engineering Mechanics and Astronautics , 3.8/4.0 2002  – 2008 Activities and Societies:  Member of APS ,  Supplementary Instructor for Calculus 3 ,  CFD Research on Madison Dynamo Experiment University of Wisconsin - Madison PhD,  Engineering Physics and Mechanical Engineering , 3.9 2010  – 2012 Activities and Societies:  American Physical Society (APS)\nAmerican Nuclear Society (ANS)\nAmerican Society of Mechanical Engineers (ASME)\nAmerican Institute of Chemical Engineers (AIChE) University of Wisconsin - Madison PhD,  Engineering Physics and Mechanical Engineering , 3.9 2010  – 2012 Activities and Societies:  American Physical Society (APS)\nAmerican Nuclear Society (ANS)\nAmerican Society of Mechanical Engineers (ASME)\nAmerican Institute of Chemical Engineers (AIChE) University of Wisconsin - Madison PhD,  Engineering Physics and Mechanical Engineering , 3.9 2010  – 2012 Activities and Societies:  American Physical Society (APS)\nAmerican Nuclear Society (ANS)\nAmerican Society of Mechanical Engineers (ASME)\nAmerican Institute of Chemical Engineers (AIChE) University of Wisconsin - Madison Master's degree,  Engineering Physics and Mechanical Engineering , 3.9 2007  – 2010 Activities and Societies:  APS University of Wisconsin - Madison Master's degree,  Engineering Physics and Mechanical Engineering , 3.9 2007  – 2010 Activities and Societies:  APS University of Wisconsin - Madison Master's degree,  Engineering Physics and Mechanical Engineering , 3.9 2007  – 2010 Activities and Societies:  APS University of Wisconsin-Madison B.S.,  Physics/Engineering Mechanics and Astronautics , 3.8/4.0 2002  – 2008 Activities and Societies:  Member of APS ,  Supplementary Instructor for Calculus 3 ,  CFD Research on Madison Dynamo Experiment University of Wisconsin-Madison B.S.,  Physics/Engineering Mechanics and Astronautics , 3.8/4.0 2002  – 2008 Activities and Societies:  Member of APS ,  Supplementary Instructor for Calculus 3 ,  CFD Research on Madison Dynamo Experiment University of Wisconsin-Madison B.S.,  Physics/Engineering Mechanics and Astronautics , 3.8/4.0 2002  – 2008 Activities and Societies:  Member of APS ,  Supplementary Instructor for Calculus 3 ,  CFD Research on Madison Dynamo Experiment Honors & Awards Additional Honors & Awards Academic Achievement Award scholarship (2005) \nL. Moulton Bashford scholarship (2004) Additional Honors & Awards Academic Achievement Award scholarship (2005) \nL. Moulton Bashford scholarship (2004) Additional Honors & Awards Academic Achievement Award scholarship (2005) \nL. Moulton Bashford scholarship (2004) Additional Honors & Awards Academic Achievement Award scholarship (2005) \nL. Moulton Bashford scholarship (2004) ", "Summary Looking forward to interact with the scientific community and build a career in the following key research areas: \nMicroelectronics Packaging, Quality and Reliability, Mechanical Behavior, Constitutive Model Building, Diffusion in solids, Microstructural Analysis and its Quantification. Summary Looking forward to interact with the scientific community and build a career in the following key research areas: \nMicroelectronics Packaging, Quality and Reliability, Mechanical Behavior, Constitutive Model Building, Diffusion in solids, Microstructural Analysis and its Quantification. Looking forward to interact with the scientific community and build a career in the following key research areas: \nMicroelectronics Packaging, Quality and Reliability, Mechanical Behavior, Constitutive Model Building, Diffusion in solids, Microstructural Analysis and its Quantification. Looking forward to interact with the scientific community and build a career in the following key research areas: \nMicroelectronics Packaging, Quality and Reliability, Mechanical Behavior, Constitutive Model Building, Diffusion in solids, Microstructural Analysis and its Quantification. Experience Packaging Engineer Intel Corporation January 2013  – Present (2 years 8 months) Chandler, AZ Warpage in Electronic Substrates and Packages, Developing Design Rules for Next Generation Technologies Doctor of Philosophy Purdue University August 2007  –  December 2012  (5 years 5 months) West Lafayette, IN Studied the effect of static aging, cooling rate, surface finish and solder size and metallurgy on microstructure using SEM, EDS techniques and mechanical behavior for SnAgCu alloy systems – funded by Cisco Systems, Inc. \nExperimentally characterized SnAgCu solders alloys to develop microstructurally adaptive primary cum secondary creep model and constitutive models – funded by Semiconductor Research Corporation (SRC) Task 1630.001 (TI/IBM) \nFailure Analysis of solder joints in processor assemblies \nDesigned and implemented an anisothermal cycling tester to characterize failure in microelectronic packages – funded by SUN Microsystems, Oracle Corporation \nDeveloped and validated multiple cross-validated test procedures to identify time-dependent behavior of compliant TIMs – funded by Delphi, Toyota, Intel Corp. (NSF, Cooling Technologies Research Center) Graduate Technical Intern Intel Corporation June 2011  –  September 2011  (4 months) Chandler, AZ Impact of solder microstructure and grain orientation on metallization dissolving in solder joints during electromigration Teaching Assistant: ME 571 Reliability Based Design Purdue University January 2010  –  May 2010  (5 months) School of Mechanical Engineering Course offered via video stream to practicing engineers at automotive industry. Developed homeworks, exams and guided over 200 students through web based discussion as well as phone (Course offered again in January, 2012 - May 2012 timeframe). MS Graduate Student Assistant Purdue University August 2007  –  December 2009  (2 years 5 months) West Lafayette, IN Masters Student Teaching Assistant - ME 270, 274 Basic Mechanics and Dynamics Purdue University January 2009  –  May 2009  (5 months) School of Mechanical Engineering Guided over 200 students through personal discussion, assisted with homework solutions and proctored exams. Undergraduate Intern International Advanced Research Center for Powder Metallurgy and New Materials January 2007  –  April 2007  (4 months) Hyderabad Area, India Electron backscattered diffraction (EBSD) studies on Ion Beam milled ZnO varistor materials (nanocomposites) Undergraduate Intern Indian Institute of Technology, Bombay April 2005  –  July 2005  (4 months) Bombay, India Flow behavior and its correlation with concurrent microstructural evolution in α Brass Packaging Engineer Intel Corporation January 2013  – Present (2 years 8 months) Chandler, AZ Warpage in Electronic Substrates and Packages, Developing Design Rules for Next Generation Technologies Packaging Engineer Intel Corporation January 2013  – Present (2 years 8 months) Chandler, AZ Warpage in Electronic Substrates and Packages, Developing Design Rules for Next Generation Technologies Doctor of Philosophy Purdue University August 2007  –  December 2012  (5 years 5 months) West Lafayette, IN Studied the effect of static aging, cooling rate, surface finish and solder size and metallurgy on microstructure using SEM, EDS techniques and mechanical behavior for SnAgCu alloy systems – funded by Cisco Systems, Inc. \nExperimentally characterized SnAgCu solders alloys to develop microstructurally adaptive primary cum secondary creep model and constitutive models – funded by Semiconductor Research Corporation (SRC) Task 1630.001 (TI/IBM) \nFailure Analysis of solder joints in processor assemblies \nDesigned and implemented an anisothermal cycling tester to characterize failure in microelectronic packages – funded by SUN Microsystems, Oracle Corporation \nDeveloped and validated multiple cross-validated test procedures to identify time-dependent behavior of compliant TIMs – funded by Delphi, Toyota, Intel Corp. (NSF, Cooling Technologies Research Center) Doctor of Philosophy Purdue University August 2007  –  December 2012  (5 years 5 months) West Lafayette, IN Studied the effect of static aging, cooling rate, surface finish and solder size and metallurgy on microstructure using SEM, EDS techniques and mechanical behavior for SnAgCu alloy systems – funded by Cisco Systems, Inc. \nExperimentally characterized SnAgCu solders alloys to develop microstructurally adaptive primary cum secondary creep model and constitutive models – funded by Semiconductor Research Corporation (SRC) Task 1630.001 (TI/IBM) \nFailure Analysis of solder joints in processor assemblies \nDesigned and implemented an anisothermal cycling tester to characterize failure in microelectronic packages – funded by SUN Microsystems, Oracle Corporation \nDeveloped and validated multiple cross-validated test procedures to identify time-dependent behavior of compliant TIMs – funded by Delphi, Toyota, Intel Corp. (NSF, Cooling Technologies Research Center) Graduate Technical Intern Intel Corporation June 2011  –  September 2011  (4 months) Chandler, AZ Impact of solder microstructure and grain orientation on metallization dissolving in solder joints during electromigration Graduate Technical Intern Intel Corporation June 2011  –  September 2011  (4 months) Chandler, AZ Impact of solder microstructure and grain orientation on metallization dissolving in solder joints during electromigration Teaching Assistant: ME 571 Reliability Based Design Purdue University January 2010  –  May 2010  (5 months) School of Mechanical Engineering Course offered via video stream to practicing engineers at automotive industry. Developed homeworks, exams and guided over 200 students through web based discussion as well as phone (Course offered again in January, 2012 - May 2012 timeframe). Teaching Assistant: ME 571 Reliability Based Design Purdue University January 2010  –  May 2010  (5 months) School of Mechanical Engineering Course offered via video stream to practicing engineers at automotive industry. Developed homeworks, exams and guided over 200 students through web based discussion as well as phone (Course offered again in January, 2012 - May 2012 timeframe). MS Graduate Student Assistant Purdue University August 2007  –  December 2009  (2 years 5 months) West Lafayette, IN Masters Student MS Graduate Student Assistant Purdue University August 2007  –  December 2009  (2 years 5 months) West Lafayette, IN Masters Student Teaching Assistant - ME 270, 274 Basic Mechanics and Dynamics Purdue University January 2009  –  May 2009  (5 months) School of Mechanical Engineering Guided over 200 students through personal discussion, assisted with homework solutions and proctored exams. Teaching Assistant - ME 270, 274 Basic Mechanics and Dynamics Purdue University January 2009  –  May 2009  (5 months) School of Mechanical Engineering Guided over 200 students through personal discussion, assisted with homework solutions and proctored exams. Undergraduate Intern International Advanced Research Center for Powder Metallurgy and New Materials January 2007  –  April 2007  (4 months) Hyderabad Area, India Electron backscattered diffraction (EBSD) studies on Ion Beam milled ZnO varistor materials (nanocomposites) Undergraduate Intern International Advanced Research Center for Powder Metallurgy and New Materials January 2007  –  April 2007  (4 months) Hyderabad Area, India Electron backscattered diffraction (EBSD) studies on Ion Beam milled ZnO varistor materials (nanocomposites) Undergraduate Intern Indian Institute of Technology, Bombay April 2005  –  July 2005  (4 months) Bombay, India Flow behavior and its correlation with concurrent microstructural evolution in α Brass Undergraduate Intern Indian Institute of Technology, Bombay April 2005  –  July 2005  (4 months) Bombay, India Flow behavior and its correlation with concurrent microstructural evolution in α Brass Languages English Telugu English Telugu English Telugu Skills Scanning Electron... Electronics Packaging Reliability Engineering Matlab Finite Element Analysis Characterization Design of Experiments Solidworks Materials Science Stereology Abaqus EBSD Skills  Scanning Electron... Electronics Packaging Reliability Engineering Matlab Finite Element Analysis Characterization Design of Experiments Solidworks Materials Science Stereology Abaqus EBSD Scanning Electron... Electronics Packaging Reliability Engineering Matlab Finite Element Analysis Characterization Design of Experiments Solidworks Materials Science Stereology Abaqus EBSD Scanning Electron... Electronics Packaging Reliability Engineering Matlab Finite Element Analysis Characterization Design of Experiments Solidworks Materials Science Stereology Abaqus EBSD Education Purdue University Doctor of Philosophy (Ph.D.),  Mechanical Engineering 2009  – 2012 Purdue University MS,  Mechanical Engineering 2007  – 2009 Osmania University BE,  Mechanical Engineering 2003  – 2007 Purdue University Doctor of Philosophy (Ph.D.),  Mechanical Engineering 2009  – 2012 Purdue University Doctor of Philosophy (Ph.D.),  Mechanical Engineering 2009  – 2012 Purdue University Doctor of Philosophy (Ph.D.),  Mechanical Engineering 2009  – 2012 Purdue University MS,  Mechanical Engineering 2007  – 2009 Purdue University MS,  Mechanical Engineering 2007  – 2009 Purdue University MS,  Mechanical Engineering 2007  – 2009 Osmania University BE,  Mechanical Engineering 2003  – 2007 Osmania University BE,  Mechanical Engineering 2003  – 2007 Osmania University BE,  Mechanical Engineering 2003  – 2007 Honors & Awards Additional Honors & Awards \"Microstructurally Adaptive Model for Primary and Secondary Creep of Sn-Ag-Based Solders\", 2012 Best Paper -- IEEE Transactions on Components, Packaging and Manufacturing Technology in the Components: Characterization and Modeling category presented in ECTC, 2013. \n \n\"Aging Aware Constitutive Models for SnAgCu Solder Alloys\", Intel Best Student Paper Award for Electronic Components and Technology Conference, 2011 (ECTC '2011) among 36 sessions and 252 papers, presented in ECTC, 2012. \n \nThe Minerals, Metals & Materials Society (TMS) Symposium on Pb-free solders, Poster Session, 2009 – Second place award out of 23 papers. \n \nWomen in Engineering at Purdue University, Travel Grant, 2011. \nCollege of Engineering at Purdue University, Travel Grant, 2012. Additional Honors & Awards \"Microstructurally Adaptive Model for Primary and Secondary Creep of Sn-Ag-Based Solders\", 2012 Best Paper -- IEEE Transactions on Components, Packaging and Manufacturing Technology in the Components: Characterization and Modeling category presented in ECTC, 2013. \n \n\"Aging Aware Constitutive Models for SnAgCu Solder Alloys\", Intel Best Student Paper Award for Electronic Components and Technology Conference, 2011 (ECTC '2011) among 36 sessions and 252 papers, presented in ECTC, 2012. \n \nThe Minerals, Metals & Materials Society (TMS) Symposium on Pb-free solders, Poster Session, 2009 – Second place award out of 23 papers. \n \nWomen in Engineering at Purdue University, Travel Grant, 2011. \nCollege of Engineering at Purdue University, Travel Grant, 2012. Additional Honors & Awards \"Microstructurally Adaptive Model for Primary and Secondary Creep of Sn-Ag-Based Solders\", 2012 Best Paper -- IEEE Transactions on Components, Packaging and Manufacturing Technology in the Components: Characterization and Modeling category presented in ECTC, 2013. \n \n\"Aging Aware Constitutive Models for SnAgCu Solder Alloys\", Intel Best Student Paper Award for Electronic Components and Technology Conference, 2011 (ECTC '2011) among 36 sessions and 252 papers, presented in ECTC, 2012. \n \nThe Minerals, Metals & Materials Society (TMS) Symposium on Pb-free solders, Poster Session, 2009 – Second place award out of 23 papers. \n \nWomen in Engineering at Purdue University, Travel Grant, 2011. \nCollege of Engineering at Purdue University, Travel Grant, 2012. Additional Honors & Awards \"Microstructurally Adaptive Model for Primary and Secondary Creep of Sn-Ag-Based Solders\", 2012 Best Paper -- IEEE Transactions on Components, Packaging and Manufacturing Technology in the Components: Characterization and Modeling category presented in ECTC, 2013. \n \n\"Aging Aware Constitutive Models for SnAgCu Solder Alloys\", Intel Best Student Paper Award for Electronic Components and Technology Conference, 2011 (ECTC '2011) among 36 sessions and 252 papers, presented in ECTC, 2012. \n \nThe Minerals, Metals & Materials Society (TMS) Symposium on Pb-free solders, Poster Session, 2009 – Second place award out of 23 papers. \n \nWomen in Engineering at Purdue University, Travel Grant, 2011. \nCollege of Engineering at Purdue University, Travel Grant, 2012. ", "Experience Senior Packaging Engineer Intel Corporation February 2013  – Present (2 years 7 months) Research Assistant University of Florida January 2008  –  December 2012  (5 years) Senior Packaging Engineer Intel Corporation February 2013  – Present (2 years 7 months) Senior Packaging Engineer Intel Corporation February 2013  – Present (2 years 7 months) Research Assistant University of Florida January 2008  –  December 2012  (5 years) Research Assistant University of Florida January 2008  –  December 2012  (5 years) Skills TGA Polymer Characterization AFM Polymers GPC FTIR Materials Science TEM Differential Scanning... Nanocomposites Characterization NMR Scanning Electron... XPS Spectroscopy Nanomaterials Mechanical Testing Polymer Chemistry See 3+     See less Skills  TGA Polymer Characterization AFM Polymers GPC FTIR Materials Science TEM Differential Scanning... Nanocomposites Characterization NMR Scanning Electron... XPS Spectroscopy Nanomaterials Mechanical Testing Polymer Chemistry See 3+     See less TGA Polymer Characterization AFM Polymers GPC FTIR Materials Science TEM Differential Scanning... Nanocomposites Characterization NMR Scanning Electron... XPS Spectroscopy Nanomaterials Mechanical Testing Polymer Chemistry See 3+     See less TGA Polymer Characterization AFM Polymers GPC FTIR Materials Science TEM Differential Scanning... Nanocomposites Characterization NMR Scanning Electron... XPS Spectroscopy Nanomaterials Mechanical Testing Polymer Chemistry See 3+     See less Education University of Florida Ph.D.,  Materials Science and Engneering 2007  – 2012 University of Science and Technology of China BE,  Macromolecular Science and engineering 2003  – 2007 University of Florida Ph.D.,  Materials Science and Engneering 2007  – 2012 University of Florida Ph.D.,  Materials Science and Engneering 2007  – 2012 University of Florida Ph.D.,  Materials Science and Engneering 2007  – 2012 University of Science and Technology of China BE,  Macromolecular Science and engineering 2003  – 2007 University of Science and Technology of China BE,  Macromolecular Science and engineering 2003  – 2007 University of Science and Technology of China BE,  Macromolecular Science and engineering 2003  – 2007 ", "Experience Senior Packaging Engineer Intel Corporation June 2014  – Present (1 year 3 months) Chandler, AZ Research and develop new integrated CPU sockets/connectors for upcoming client/server products \no\tIdentify, research and develop new socket/connector/high speed I/O technology \no\tSelect and enable supplier to deliver new and robust technology \no\tInterface with internal stakeholders by integrating electrical and mechanical core competency, materials, Q&R and surface mount team \no\tDefine critical dimensions/tolerances, stack up, alignment and mechanical loading requirement to optimize electrical performance \no\tDesign test vehicle and tooling to support prototype fabrication, validation and high volume manufacturing \n Senior Test Engineer Intel Corporation October 2008  –  May 2014  (5 years 8 months) Chandler, AZ Develop and implement advanced test tooling technology for Intel’s server/desktop/mobile products. \nLead design and qualification of first article sockets and handler kits for Class Test/Burn In module. \no\tDefine tooling design rules and mechanical specifications \no\tWork with supplier closely for design concepts, prototype validation and first article deployment \no\tReview the final design with management/stakeholders and get approval \no\tDesign tooling qualification collaterals \no\tInspect first article critical to function dimensions \no\tPerform mechanical/thermal/electrical qualification and characterization of the test tools \no\tInvestigate tooling quality problems, derive root causes and provide technical solutions \no\tProvide qualification report to stakeholders and document best known methods \no\tDrive cost reduction and tool conversion time reduction in high volume manufacturing \no\tLead ISO9000 quality certificate on tooling development process \n Senior Packaging Engineer Intel Corporation June 2014  – Present (1 year 3 months) Chandler, AZ Research and develop new integrated CPU sockets/connectors for upcoming client/server products \no\tIdentify, research and develop new socket/connector/high speed I/O technology \no\tSelect and enable supplier to deliver new and robust technology \no\tInterface with internal stakeholders by integrating electrical and mechanical core competency, materials, Q&R and surface mount team \no\tDefine critical dimensions/tolerances, stack up, alignment and mechanical loading requirement to optimize electrical performance \no\tDesign test vehicle and tooling to support prototype fabrication, validation and high volume manufacturing \n Senior Packaging Engineer Intel Corporation June 2014  – Present (1 year 3 months) Chandler, AZ Research and develop new integrated CPU sockets/connectors for upcoming client/server products \no\tIdentify, research and develop new socket/connector/high speed I/O technology \no\tSelect and enable supplier to deliver new and robust technology \no\tInterface with internal stakeholders by integrating electrical and mechanical core competency, materials, Q&R and surface mount team \no\tDefine critical dimensions/tolerances, stack up, alignment and mechanical loading requirement to optimize electrical performance \no\tDesign test vehicle and tooling to support prototype fabrication, validation and high volume manufacturing \n Senior Test Engineer Intel Corporation October 2008  –  May 2014  (5 years 8 months) Chandler, AZ Develop and implement advanced test tooling technology for Intel’s server/desktop/mobile products. \nLead design and qualification of first article sockets and handler kits for Class Test/Burn In module. \no\tDefine tooling design rules and mechanical specifications \no\tWork with supplier closely for design concepts, prototype validation and first article deployment \no\tReview the final design with management/stakeholders and get approval \no\tDesign tooling qualification collaterals \no\tInspect first article critical to function dimensions \no\tPerform mechanical/thermal/electrical qualification and characterization of the test tools \no\tInvestigate tooling quality problems, derive root causes and provide technical solutions \no\tProvide qualification report to stakeholders and document best known methods \no\tDrive cost reduction and tool conversion time reduction in high volume manufacturing \no\tLead ISO9000 quality certificate on tooling development process \n Senior Test Engineer Intel Corporation October 2008  –  May 2014  (5 years 8 months) Chandler, AZ Develop and implement advanced test tooling technology for Intel’s server/desktop/mobile products. \nLead design and qualification of first article sockets and handler kits for Class Test/Burn In module. \no\tDefine tooling design rules and mechanical specifications \no\tWork with supplier closely for design concepts, prototype validation and first article deployment \no\tReview the final design with management/stakeholders and get approval \no\tDesign tooling qualification collaterals \no\tInspect first article critical to function dimensions \no\tPerform mechanical/thermal/electrical qualification and characterization of the test tools \no\tInvestigate tooling quality problems, derive root causes and provide technical solutions \no\tProvide qualification report to stakeholders and document best known methods \no\tDrive cost reduction and tool conversion time reduction in high volume manufacturing \no\tLead ISO9000 quality certificate on tooling development process \n Languages English Native or bilingual proficiency Chinese Native or bilingual proficiency English Native or bilingual proficiency Chinese Native or bilingual proficiency English Native or bilingual proficiency Chinese Native or bilingual proficiency Native or bilingual proficiency Native or bilingual proficiency Skills Solid Mechanics Abaqus Finite Element Analysis Simulation Engineering Matlab Mathematica Solidworks Semiconductor... Design of Experiments JMP Skills  Solid Mechanics Abaqus Finite Element Analysis Simulation Engineering Matlab Mathematica Solidworks Semiconductor... Design of Experiments JMP Solid Mechanics Abaqus Finite Element Analysis Simulation Engineering Matlab Mathematica Solidworks Semiconductor... Design of Experiments JMP Solid Mechanics Abaqus Finite Element Analysis Simulation Engineering Matlab Mathematica Solidworks Semiconductor... Design of Experiments JMP Education Caltech Doctor,  Mechanical Engineering 2005  – 2008 Investigate thin membrane wrinkling onset and profile using both experimental and numerical approaches. \no\tDesign experimental setup for membrane loading/boundary conditions and optical measurement. \no\tDevelop a non-contact optical method for membrane out-of-plane deformation measurement. \no\tCharacterize silicone rubber membrane material properties through mechanical tensile test. \no\tPerform geometrically nonlinear finite element analysis on membrane structure using ABAQUS. \no\tSuppress wrinkling instability of dielectric membranes using through-thickness electric field in both experimental and numerical approaches. \n Caltech Master of Science,  Mechanical Engineering 2004  – 2005 University of Wisconsin-Madison Graduate Study,  Engineering Physics 2003  – 2004 Tsinghua University Bachelor,  Mechanical Engineering 1999  – 2003 Caltech Doctor,  Mechanical Engineering 2005  – 2008 Investigate thin membrane wrinkling onset and profile using both experimental and numerical approaches. \no\tDesign experimental setup for membrane loading/boundary conditions and optical measurement. \no\tDevelop a non-contact optical method for membrane out-of-plane deformation measurement. \no\tCharacterize silicone rubber membrane material properties through mechanical tensile test. \no\tPerform geometrically nonlinear finite element analysis on membrane structure using ABAQUS. \no\tSuppress wrinkling instability of dielectric membranes using through-thickness electric field in both experimental and numerical approaches. \n Caltech Doctor,  Mechanical Engineering 2005  – 2008 Investigate thin membrane wrinkling onset and profile using both experimental and numerical approaches. \no\tDesign experimental setup for membrane loading/boundary conditions and optical measurement. \no\tDevelop a non-contact optical method for membrane out-of-plane deformation measurement. \no\tCharacterize silicone rubber membrane material properties through mechanical tensile test. \no\tPerform geometrically nonlinear finite element analysis on membrane structure using ABAQUS. \no\tSuppress wrinkling instability of dielectric membranes using through-thickness electric field in both experimental and numerical approaches. \n Caltech Doctor,  Mechanical Engineering 2005  – 2008 Investigate thin membrane wrinkling onset and profile using both experimental and numerical approaches. \no\tDesign experimental setup for membrane loading/boundary conditions and optical measurement. \no\tDevelop a non-contact optical method for membrane out-of-plane deformation measurement. \no\tCharacterize silicone rubber membrane material properties through mechanical tensile test. \no\tPerform geometrically nonlinear finite element analysis on membrane structure using ABAQUS. \no\tSuppress wrinkling instability of dielectric membranes using through-thickness electric field in both experimental and numerical approaches. \n Caltech Master of Science,  Mechanical Engineering 2004  – 2005 Caltech Master of Science,  Mechanical Engineering 2004  – 2005 Caltech Master of Science,  Mechanical Engineering 2004  – 2005 University of Wisconsin-Madison Graduate Study,  Engineering Physics 2003  – 2004 University of Wisconsin-Madison Graduate Study,  Engineering Physics 2003  – 2004 University of Wisconsin-Madison Graduate Study,  Engineering Physics 2003  – 2004 Tsinghua University Bachelor,  Mechanical Engineering 1999  – 2003 Tsinghua University Bachelor,  Mechanical Engineering 1999  – 2003 Tsinghua University Bachelor,  Mechanical Engineering 1999  – 2003 ", "Summary I have obtained a B.A. degree in Physics, a M.S. in Optics, and a Ph.D. in Optics. The research focus for my dissertation is how visual effects impact a search and identification task. \n \nI specialize in semiconductor packaging R&D and laser/material interactions. Summary I have obtained a B.A. degree in Physics, a M.S. in Optics, and a Ph.D. in Optics. The research focus for my dissertation is how visual effects impact a search and identification task. \n \nI specialize in semiconductor packaging R&D and laser/material interactions. I have obtained a B.A. degree in Physics, a M.S. in Optics, and a Ph.D. in Optics. The research focus for my dissertation is how visual effects impact a search and identification task. \n \nI specialize in semiconductor packaging R&D and laser/material interactions. I have obtained a B.A. degree in Physics, a M.S. in Optics, and a Ph.D. in Optics. The research focus for my dissertation is how visual effects impact a search and identification task. \n \nI specialize in semiconductor packaging R&D and laser/material interactions. Experience Senior Packaging Engineer Intel Corporation October 2012  – Present (2 years 11 months) Chandler, AZ Substrate packaging integration for server products. Tutor Wise Owl Tutoring January 2012  –  August 2012  (8 months) Graduate Researcher Institute for Simulation and Training August 2010  –  August 2011  (1 year 1 month) Orlando, FL Working with eye-tracking systems and military training simulations. Graduate Researcher University of Central Florida August 2007  –  August 2011  (4 years 1 month) University of Central Florida Working towards my Ph.D. in Optics from the College of Optics and Photonics at the University of Central Florida. Graduation is expected in the Fall of 2011. Current research involves the use of eye-tracking systems for military training. Patent Intern UCF Technology Transfer Office 2009  –  2009  (less than a year) Research Assistant CREOL May 2006  –  July 2006  (3 months) International REU program through the University of Central Florida. I did research in nonlinear optics at the University Joseph-Fourier in Grenoble, France. The project allowed me to build the first laser using a nonlinear material as the gain medium. Senior Packaging Engineer Intel Corporation October 2012  – Present (2 years 11 months) Chandler, AZ Substrate packaging integration for server products. Senior Packaging Engineer Intel Corporation October 2012  – Present (2 years 11 months) Chandler, AZ Substrate packaging integration for server products. Tutor Wise Owl Tutoring January 2012  –  August 2012  (8 months) Tutor Wise Owl Tutoring January 2012  –  August 2012  (8 months) Graduate Researcher Institute for Simulation and Training August 2010  –  August 2011  (1 year 1 month) Orlando, FL Working with eye-tracking systems and military training simulations. Graduate Researcher Institute for Simulation and Training August 2010  –  August 2011  (1 year 1 month) Orlando, FL Working with eye-tracking systems and military training simulations. Graduate Researcher University of Central Florida August 2007  –  August 2011  (4 years 1 month) University of Central Florida Working towards my Ph.D. in Optics from the College of Optics and Photonics at the University of Central Florida. Graduation is expected in the Fall of 2011. Current research involves the use of eye-tracking systems for military training. Graduate Researcher University of Central Florida August 2007  –  August 2011  (4 years 1 month) University of Central Florida Working towards my Ph.D. in Optics from the College of Optics and Photonics at the University of Central Florida. Graduation is expected in the Fall of 2011. Current research involves the use of eye-tracking systems for military training. Patent Intern UCF Technology Transfer Office 2009  –  2009  (less than a year) Patent Intern UCF Technology Transfer Office 2009  –  2009  (less than a year) Research Assistant CREOL May 2006  –  July 2006  (3 months) International REU program through the University of Central Florida. I did research in nonlinear optics at the University Joseph-Fourier in Grenoble, France. The project allowed me to build the first laser using a nonlinear material as the gain medium. Research Assistant CREOL May 2006  –  July 2006  (3 months) International REU program through the University of Central Florida. I did research in nonlinear optics at the University Joseph-Fourier in Grenoble, France. The project allowed me to build the first laser using a nonlinear material as the gain medium. Languages English Native or bilingual proficiency Spanish Limited working proficiency English Native or bilingual proficiency Spanish Limited working proficiency English Native or bilingual proficiency Spanish Limited working proficiency Native or bilingual proficiency Limited working proficiency Skills Thin Films Device Fabrication Optics Photovoltaics Engineering Substrate Development Skills  Thin Films Device Fabrication Optics Photovoltaics Engineering Substrate Development Thin Films Device Fabrication Optics Photovoltaics Engineering Substrate Development Thin Films Device Fabrication Optics Photovoltaics Engineering Substrate Development Education University of Central Florida PhD,  Optics 2007  – 2012 Activities and Societies:  Vice President of the CREOL Association of Optics Students (CAOS) ,  Member of the Society for Information Displays (SID) University of Central Florida MS,  Optics 2007  – 2009 Activities and Societies:  Vice President of the CREOL Association of Optics Students (CAOS) ,  Member of the Society for Information Displays (SID) The College of Wooster BA,  Physics 2003  – 2007 Deans List, Graduated Cum Laude Activities and Societies:  Physics Club ,  Xi Chi Psi Fraternity ,  and Wooster Christian Fellowship (OASIS) University of Central Florida PhD,  Optics 2007  – 2012 Activities and Societies:  Vice President of the CREOL Association of Optics Students (CAOS) ,  Member of the Society for Information Displays (SID) University of Central Florida PhD,  Optics 2007  – 2012 Activities and Societies:  Vice President of the CREOL Association of Optics Students (CAOS) ,  Member of the Society for Information Displays (SID) University of Central Florida PhD,  Optics 2007  – 2012 Activities and Societies:  Vice President of the CREOL Association of Optics Students (CAOS) ,  Member of the Society for Information Displays (SID) University of Central Florida MS,  Optics 2007  – 2009 Activities and Societies:  Vice President of the CREOL Association of Optics Students (CAOS) ,  Member of the Society for Information Displays (SID) University of Central Florida MS,  Optics 2007  – 2009 Activities and Societies:  Vice President of the CREOL Association of Optics Students (CAOS) ,  Member of the Society for Information Displays (SID) University of Central Florida MS,  Optics 2007  – 2009 Activities and Societies:  Vice President of the CREOL Association of Optics Students (CAOS) ,  Member of the Society for Information Displays (SID) The College of Wooster BA,  Physics 2003  – 2007 Deans List, Graduated Cum Laude Activities and Societies:  Physics Club ,  Xi Chi Psi Fraternity ,  and Wooster Christian Fellowship (OASIS) The College of Wooster BA,  Physics 2003  – 2007 Deans List, Graduated Cum Laude Activities and Societies:  Physics Club ,  Xi Chi Psi Fraternity ,  and Wooster Christian Fellowship (OASIS) The College of Wooster BA,  Physics 2003  – 2007 Deans List, Graduated Cum Laude Activities and Societies:  Physics Club ,  Xi Chi Psi Fraternity ,  and Wooster Christian Fellowship (OASIS) ", "Summary * Seven years of experience in heat transfer, two years in electronics cooling \n \n* Doctoral research in thermal properties of nano-materials and nano-composites \n \n* Expert user of various engineering analysis softwares and proficient in computer programming \n \n* Excellent verbal and written communication skills Summary * Seven years of experience in heat transfer, two years in electronics cooling \n \n* Doctoral research in thermal properties of nano-materials and nano-composites \n \n* Expert user of various engineering analysis softwares and proficient in computer programming \n \n* Excellent verbal and written communication skills * Seven years of experience in heat transfer, two years in electronics cooling \n \n* Doctoral research in thermal properties of nano-materials and nano-composites \n \n* Expert user of various engineering analysis softwares and proficient in computer programming \n \n* Excellent verbal and written communication skills * Seven years of experience in heat transfer, two years in electronics cooling \n \n* Doctoral research in thermal properties of nano-materials and nano-composites \n \n* Expert user of various engineering analysis softwares and proficient in computer programming \n \n* Excellent verbal and written communication skills Experience Senior Packaging Engineer Intel Corporation May 2012  – Present (3 years 4 months) Chandler, Arizona * Lead engineer for thermal assessment of Intel products catering to mobile computing clients (tablets, ultra-books and laptops). Responsible for providing recommendations to package and chip architecture design teams to define thermal budget of different products. \n \n* Leading efforts in the group to develop transient thermal modeling capabilities. Improved accuracy and turnaround time using an innovative method for simplifying package thermal model generation. \n \n* Responsible for providing thermal requirements and collaborating with materials engineering teams to develop new materials with enhanced thermal properties for future packaging technologies. \n \n* Conducted CFD and multi-physics simulations of manufacturing processes and provided recommendations to process engineering teams for optimizing chip assembly processes. Graduate Student/Research Assistant Case Western Reserve University January 2007  –  April 2012  (5 years 4 months) Cleveland/Akron, Ohio Area * Actively collaborated with industrial partners through Research Commercialization Projects for the successful launch of novel graphite heat spreader. \n \n* Developed novel techniques for characterizing thermal transport in individual nanostructures and nanostructured bulk materials. Critical analysis of the results to find structure-property relationships. \n \n* Conducted Computational Fluid Dynamics (CFD) simulations for thermal management of building environments using COMSOL. \n \n* Extensive use of materials analysis/characterization techniques such as SEM-FIB, TEM, AFM, XEDS, XPS, AES, RBS, SIMS. \n \n* MEMS fabrication using Wafer Cleaning, LTO, LPCVD, PVD, DRIE, Wet Etching and Wire bonding. \n \n* Authored articles for publication in peer reviewed journals and presented in international conferences. \n \n* Trained and supervised several undergraduate students working on senior year projects. Materials Technologist Intern PolyOne January 2011  –  July 2011  (7 months) Avon Lake, Ohio Software Engineer Infosys Technologies Ltd February 2006  –  December 2006  (11 months) Senior Packaging Engineer Intel Corporation May 2012  – Present (3 years 4 months) Chandler, Arizona * Lead engineer for thermal assessment of Intel products catering to mobile computing clients (tablets, ultra-books and laptops). Responsible for providing recommendations to package and chip architecture design teams to define thermal budget of different products. \n \n* Leading efforts in the group to develop transient thermal modeling capabilities. Improved accuracy and turnaround time using an innovative method for simplifying package thermal model generation. \n \n* Responsible for providing thermal requirements and collaborating with materials engineering teams to develop new materials with enhanced thermal properties for future packaging technologies. \n \n* Conducted CFD and multi-physics simulations of manufacturing processes and provided recommendations to process engineering teams for optimizing chip assembly processes. Senior Packaging Engineer Intel Corporation May 2012  – Present (3 years 4 months) Chandler, Arizona * Lead engineer for thermal assessment of Intel products catering to mobile computing clients (tablets, ultra-books and laptops). Responsible for providing recommendations to package and chip architecture design teams to define thermal budget of different products. \n \n* Leading efforts in the group to develop transient thermal modeling capabilities. Improved accuracy and turnaround time using an innovative method for simplifying package thermal model generation. \n \n* Responsible for providing thermal requirements and collaborating with materials engineering teams to develop new materials with enhanced thermal properties for future packaging technologies. \n \n* Conducted CFD and multi-physics simulations of manufacturing processes and provided recommendations to process engineering teams for optimizing chip assembly processes. Graduate Student/Research Assistant Case Western Reserve University January 2007  –  April 2012  (5 years 4 months) Cleveland/Akron, Ohio Area * Actively collaborated with industrial partners through Research Commercialization Projects for the successful launch of novel graphite heat spreader. \n \n* Developed novel techniques for characterizing thermal transport in individual nanostructures and nanostructured bulk materials. Critical analysis of the results to find structure-property relationships. \n \n* Conducted Computational Fluid Dynamics (CFD) simulations for thermal management of building environments using COMSOL. \n \n* Extensive use of materials analysis/characterization techniques such as SEM-FIB, TEM, AFM, XEDS, XPS, AES, RBS, SIMS. \n \n* MEMS fabrication using Wafer Cleaning, LTO, LPCVD, PVD, DRIE, Wet Etching and Wire bonding. \n \n* Authored articles for publication in peer reviewed journals and presented in international conferences. \n \n* Trained and supervised several undergraduate students working on senior year projects. Graduate Student/Research Assistant Case Western Reserve University January 2007  –  April 2012  (5 years 4 months) Cleveland/Akron, Ohio Area * Actively collaborated with industrial partners through Research Commercialization Projects for the successful launch of novel graphite heat spreader. \n \n* Developed novel techniques for characterizing thermal transport in individual nanostructures and nanostructured bulk materials. Critical analysis of the results to find structure-property relationships. \n \n* Conducted Computational Fluid Dynamics (CFD) simulations for thermal management of building environments using COMSOL. \n \n* Extensive use of materials analysis/characterization techniques such as SEM-FIB, TEM, AFM, XEDS, XPS, AES, RBS, SIMS. \n \n* MEMS fabrication using Wafer Cleaning, LTO, LPCVD, PVD, DRIE, Wet Etching and Wire bonding. \n \n* Authored articles for publication in peer reviewed journals and presented in international conferences. \n \n* Trained and supervised several undergraduate students working on senior year projects. Materials Technologist Intern PolyOne January 2011  –  July 2011  (7 months) Avon Lake, Ohio Materials Technologist Intern PolyOne January 2011  –  July 2011  (7 months) Avon Lake, Ohio Software Engineer Infosys Technologies Ltd February 2006  –  December 2006  (11 months) Software Engineer Infosys Technologies Ltd February 2006  –  December 2006  (11 months) Skills Heat Transfer Nanomaterials Materials Development Materials Science Fluid Mechanics Thermodynamics Thermal Analysis Thermal Management Product Development Semiconductor... Semiconductor Packaging Consulting Programming Technical Presentations Technical Writing Skills  Heat Transfer Nanomaterials Materials Development Materials Science Fluid Mechanics Thermodynamics Thermal Analysis Thermal Management Product Development Semiconductor... Semiconductor Packaging Consulting Programming Technical Presentations Technical Writing Heat Transfer Nanomaterials Materials Development Materials Science Fluid Mechanics Thermodynamics Thermal Analysis Thermal Management Product Development Semiconductor... Semiconductor Packaging Consulting Programming Technical Presentations Technical Writing Heat Transfer Nanomaterials Materials Development Materials Science Fluid Mechanics Thermodynamics Thermal Analysis Thermal Management Product Development Semiconductor... Semiconductor Packaging Consulting Programming Technical Presentations Technical Writing Education Case Western Reserve University PhD,  Mechanical Engineering 2009  – 2012 Dissertation Title: Thermal Transport in Isolated Carbon Nanostructures and Associated Nanocomposites Case Western Reserve University Master of Science (MS),  Mechanical Engineering 2007  – 2009 Thesis Title: Characterization and Analysis of Graphite Nanomaterials for Thermal Management of Electronics National Institute of Technology Surat Bachelor of Engineering (BEng),  Mechanical Engineering 2001  – 2005 Case Western Reserve University PhD,  Mechanical Engineering 2009  – 2012 Dissertation Title: Thermal Transport in Isolated Carbon Nanostructures and Associated Nanocomposites Case Western Reserve University PhD,  Mechanical Engineering 2009  – 2012 Dissertation Title: Thermal Transport in Isolated Carbon Nanostructures and Associated Nanocomposites Case Western Reserve University PhD,  Mechanical Engineering 2009  – 2012 Dissertation Title: Thermal Transport in Isolated Carbon Nanostructures and Associated Nanocomposites Case Western Reserve University Master of Science (MS),  Mechanical Engineering 2007  – 2009 Thesis Title: Characterization and Analysis of Graphite Nanomaterials for Thermal Management of Electronics Case Western Reserve University Master of Science (MS),  Mechanical Engineering 2007  – 2009 Thesis Title: Characterization and Analysis of Graphite Nanomaterials for Thermal Management of Electronics Case Western Reserve University Master of Science (MS),  Mechanical Engineering 2007  – 2009 Thesis Title: Characterization and Analysis of Graphite Nanomaterials for Thermal Management of Electronics National Institute of Technology Surat Bachelor of Engineering (BEng),  Mechanical Engineering 2001  – 2005 National Institute of Technology Surat Bachelor of Engineering (BEng),  Mechanical Engineering 2001  – 2005 National Institute of Technology Surat Bachelor of Engineering (BEng),  Mechanical Engineering 2001  – 2005 ", "Experience Senior Packaging Engineer Intel Corporation April 2006  – Present (9 years 5 months) Hillsboro, Oregon Senior Packaging Engineer Intel Corporation April 2006  – Present (9 years 5 months) Hillsboro, Oregon Senior Packaging Engineer Intel Corporation April 2006  – Present (9 years 5 months) Hillsboro, Oregon Education The University of North Dakota Bachelor of Science (BS),  Industrial Technology 1982  – 1986 The University of North Dakota Bachelor of Science (BS),  Industrial Technology 1982  – 1986 The University of North Dakota Bachelor of Science (BS),  Industrial Technology 1982  – 1986 The University of North Dakota Bachelor of Science (BS),  Industrial Technology 1982  – 1986 ", "Experience Senior Packaging Engineer Intel Corporation October 2000  – Present (14 years 11 months) Applications Engineer Freightliner 1995  –  2000  (5 years) Manufacturing/Packaging Engineer Tyco / View Master 1989  –  1995  (6 years) Senior Packaging Engineer Intel Corporation October 2000  – Present (14 years 11 months) Senior Packaging Engineer Intel Corporation October 2000  – Present (14 years 11 months) Applications Engineer Freightliner 1995  –  2000  (5 years) Applications Engineer Freightliner 1995  –  2000  (5 years) Manufacturing/Packaging Engineer Tyco / View Master 1989  –  1995  (6 years) Manufacturing/Packaging Engineer Tyco / View Master 1989  –  1995  (6 years) Skills Lean Manufacturing Supply Chain Design of Experiments Strategic Planning Cross-functional Team... Manufacturing Product Development Continuous Improvement Skills  Lean Manufacturing Supply Chain Design of Experiments Strategic Planning Cross-functional Team... Manufacturing Product Development Continuous Improvement Lean Manufacturing Supply Chain Design of Experiments Strategic Planning Cross-functional Team... Manufacturing Product Development Continuous Improvement Lean Manufacturing Supply Chain Design of Experiments Strategic Planning Cross-functional Team... Manufacturing Product Development Continuous Improvement Education Colorado State University 1985  – 1989 Fort Lewis College 1984  – 1985 Manitou Springs High School 1980  – 1984 Colorado State University 1985  – 1989 Colorado State University 1985  – 1989 Colorado State University 1985  – 1989 Fort Lewis College 1984  – 1985 Fort Lewis College 1984  – 1985 Fort Lewis College 1984  – 1985 Manitou Springs High School 1980  – 1984 Manitou Springs High School 1980  – 1984 Manitou Springs High School 1980  – 1984 ", "Experience Senior Packaging Engineer Intel Corporation September 2010  – Present (5 years) Laser application engineer Resonetics June 2008  –  September 2010  (2 years 4 months) Find laser micromachining solutions for medical device, semiconductors and industrial components. Senior Packaging Engineer Intel Corporation September 2010  – Present (5 years) Senior Packaging Engineer Intel Corporation September 2010  – Present (5 years) Laser application engineer Resonetics June 2008  –  September 2010  (2 years 4 months) Find laser micromachining solutions for medical device, semiconductors and industrial components. Laser application engineer Resonetics June 2008  –  September 2010  (2 years 4 months) Find laser micromachining solutions for medical device, semiconductors and industrial components. Languages English Chinese (Simplified) English Chinese (Simplified) English Chinese (Simplified) Skills Optics Medical Devices Semiconductors Laser Thin Films Design of Experiments Photonics Failure Analysis CVD R&D Skills  Optics Medical Devices Semiconductors Laser Thin Films Design of Experiments Photonics Failure Analysis CVD R&D Optics Medical Devices Semiconductors Laser Thin Films Design of Experiments Photonics Failure Analysis CVD R&D Optics Medical Devices Semiconductors Laser Thin Films Design of Experiments Photonics Failure Analysis CVD R&D Education University of Central Florida PhD,  Mechinacal Engineering 2005  – 2008 University of Central Florida MS,  Optics 2005  – 2008 Beihang University MS,  Aerospace Engineering 2001  – 2004 Beihang University BS,  Thermal Engineering 1997  – 2001 University of Central Florida PhD,  Mechinacal Engineering 2005  – 2008 University of Central Florida PhD,  Mechinacal Engineering 2005  – 2008 University of Central Florida PhD,  Mechinacal Engineering 2005  – 2008 University of Central Florida MS,  Optics 2005  – 2008 University of Central Florida MS,  Optics 2005  – 2008 University of Central Florida MS,  Optics 2005  – 2008 Beihang University MS,  Aerospace Engineering 2001  – 2004 Beihang University MS,  Aerospace Engineering 2001  – 2004 Beihang University MS,  Aerospace Engineering 2001  – 2004 Beihang University BS,  Thermal Engineering 1997  – 2001 Beihang University BS,  Thermal Engineering 1997  – 2001 Beihang University BS,  Thermal Engineering 1997  – 2001 Honors & Awards Additional Honors & Awards CECS Outstanding Dissertation Award, 2009 Additional Honors & Awards CECS Outstanding Dissertation Award, 2009 Additional Honors & Awards CECS Outstanding Dissertation Award, 2009 Additional Honors & Awards CECS Outstanding Dissertation Award, 2009 ", "Experience Senior Packaging Engineer Intel Corporation May 1998  – Present (17 years 4 months) Semiconductor Packaging Design Integration. Senior Packaging Engineer Intel Corporation May 1998  – Present (17 years 4 months) Semiconductor Packaging Design Integration. Senior Packaging Engineer Intel Corporation May 1998  – Present (17 years 4 months) Semiconductor Packaging Design Integration. ", "Summary •\t10 years of expertise in the electronic/IC packaging field focusing on solder metallurgy and interconnect technologies \n•\t3 years of High Volume Manufacturing experience as a process engineer focusing on substrate bumping processes, equipment installation/qualification/maintenance, yield improvement and in-line inspection metrology development \n•\t1.5 years of program management experience of developing High Speed I/O interconnect technologies for next generation Intel server products \n•\tExperimental and numerical simulation background in multiphase flow and convection and radiation heat transfer Summary •\t10 years of expertise in the electronic/IC packaging field focusing on solder metallurgy and interconnect technologies \n•\t3 years of High Volume Manufacturing experience as a process engineer focusing on substrate bumping processes, equipment installation/qualification/maintenance, yield improvement and in-line inspection metrology development \n•\t1.5 years of program management experience of developing High Speed I/O interconnect technologies for next generation Intel server products \n•\tExperimental and numerical simulation background in multiphase flow and convection and radiation heat transfer •\t10 years of expertise in the electronic/IC packaging field focusing on solder metallurgy and interconnect technologies \n•\t3 years of High Volume Manufacturing experience as a process engineer focusing on substrate bumping processes, equipment installation/qualification/maintenance, yield improvement and in-line inspection metrology development \n•\t1.5 years of program management experience of developing High Speed I/O interconnect technologies for next generation Intel server products \n•\tExperimental and numerical simulation background in multiphase flow and convection and radiation heat transfer •\t10 years of expertise in the electronic/IC packaging field focusing on solder metallurgy and interconnect technologies \n•\t3 years of High Volume Manufacturing experience as a process engineer focusing on substrate bumping processes, equipment installation/qualification/maintenance, yield improvement and in-line inspection metrology development \n•\t1.5 years of program management experience of developing High Speed I/O interconnect technologies for next generation Intel server products \n•\tExperimental and numerical simulation background in multiphase flow and convection and radiation heat transfer Experience Senior Packaging Engineer Intel Corporation January 2014  – Present (1 year 8 months) Phoenix, Arizona Area •\tLed Intel cross-functional teams and international vendors to design and manufacture High Speed interconnect components of 14nm server products and enabled successful product functional tests ahead of schedule.  \n•\tDrove the vendors to improve product quality and reliability, assembly yield and product mechanical and electrical performances while meeting multiple product development milestones. \n•\tEstablished and correlated Low Level Contact Resistance and Critical to Function parameter measurement metrologies at Intel and vendors. Senior Process Engineer Intel Corporation January 2011  –  January 2014  (3 years 1 month) Phoenix, Arizona Area •\tInstalled, qualified and maintained Intel First Level Interconnect (FLI) substrate Micro-bumping link and Chip Capacitor Attachment link to support substrate High Volume Manufacturing ramp up. \n•\tDrove equipment suppliers to continuously improve tool quality, reliability and capacity to meet various volumes of multiple products manufacturing demand.  \n•\tEstablished Intel 14nm FLI micro-bumping and Land Side Capacitor Attachment processes by driving equipment suppliers to continuously improve tool quality, reliability and capacity and leading material suppliers to optimize direct materials to meet substrate yield and manufacturability targets. \n•\tEnabled 10nm fine-pitch micro-bumping processes with high yield to support Intel’s future product roadmap.  \n•\tLed fundamental solder joint characterization such as voiding reduction, shear strength and Intermetallic Compound microstructure, and established process baselines of micro-bumping and capacitor attachment.  \n•\tInitiated and established Pack/Ship Module to enable the 24/7 operation across different Intel sites. Intern Universal Instruments May 2005  –  May 2007  (2 years 1 month) •\tDeveloped a systematic understanding of the effects of Cu plating conditions on subsequent voiding at the SAC/Cu interface. \n•\tGained in-depth experience with wet etching, reliability testing, and reflow profile design. Research Associate Shanghai Jiao Tong University September 2000  –  May 2004  (3 years 9 months) Shanghai City, China •\tConducted numerical simulation of multi-flow and radiation heat transfer \n•\tModeled dual-vane swirling combustor for industrial test to control NOx emission Research Assistant Wuhan University September 1997  –  May 2000  (2 years 9 months) Wuhan, Hubei, China •\tExplored experimental/numerical simulation and designed a patented dual-vane swirling combustor Senior Packaging Engineer Intel Corporation January 2014  – Present (1 year 8 months) Phoenix, Arizona Area •\tLed Intel cross-functional teams and international vendors to design and manufacture High Speed interconnect components of 14nm server products and enabled successful product functional tests ahead of schedule.  \n•\tDrove the vendors to improve product quality and reliability, assembly yield and product mechanical and electrical performances while meeting multiple product development milestones. \n•\tEstablished and correlated Low Level Contact Resistance and Critical to Function parameter measurement metrologies at Intel and vendors. Senior Packaging Engineer Intel Corporation January 2014  – Present (1 year 8 months) Phoenix, Arizona Area •\tLed Intel cross-functional teams and international vendors to design and manufacture High Speed interconnect components of 14nm server products and enabled successful product functional tests ahead of schedule.  \n•\tDrove the vendors to improve product quality and reliability, assembly yield and product mechanical and electrical performances while meeting multiple product development milestones. \n•\tEstablished and correlated Low Level Contact Resistance and Critical to Function parameter measurement metrologies at Intel and vendors. Senior Process Engineer Intel Corporation January 2011  –  January 2014  (3 years 1 month) Phoenix, Arizona Area •\tInstalled, qualified and maintained Intel First Level Interconnect (FLI) substrate Micro-bumping link and Chip Capacitor Attachment link to support substrate High Volume Manufacturing ramp up. \n•\tDrove equipment suppliers to continuously improve tool quality, reliability and capacity to meet various volumes of multiple products manufacturing demand.  \n•\tEstablished Intel 14nm FLI micro-bumping and Land Side Capacitor Attachment processes by driving equipment suppliers to continuously improve tool quality, reliability and capacity and leading material suppliers to optimize direct materials to meet substrate yield and manufacturability targets. \n•\tEnabled 10nm fine-pitch micro-bumping processes with high yield to support Intel’s future product roadmap.  \n•\tLed fundamental solder joint characterization such as voiding reduction, shear strength and Intermetallic Compound microstructure, and established process baselines of micro-bumping and capacitor attachment.  \n•\tInitiated and established Pack/Ship Module to enable the 24/7 operation across different Intel sites. Senior Process Engineer Intel Corporation January 2011  –  January 2014  (3 years 1 month) Phoenix, Arizona Area •\tInstalled, qualified and maintained Intel First Level Interconnect (FLI) substrate Micro-bumping link and Chip Capacitor Attachment link to support substrate High Volume Manufacturing ramp up. \n•\tDrove equipment suppliers to continuously improve tool quality, reliability and capacity to meet various volumes of multiple products manufacturing demand.  \n•\tEstablished Intel 14nm FLI micro-bumping and Land Side Capacitor Attachment processes by driving equipment suppliers to continuously improve tool quality, reliability and capacity and leading material suppliers to optimize direct materials to meet substrate yield and manufacturability targets. \n•\tEnabled 10nm fine-pitch micro-bumping processes with high yield to support Intel’s future product roadmap.  \n•\tLed fundamental solder joint characterization such as voiding reduction, shear strength and Intermetallic Compound microstructure, and established process baselines of micro-bumping and capacitor attachment.  \n•\tInitiated and established Pack/Ship Module to enable the 24/7 operation across different Intel sites. Intern Universal Instruments May 2005  –  May 2007  (2 years 1 month) •\tDeveloped a systematic understanding of the effects of Cu plating conditions on subsequent voiding at the SAC/Cu interface. \n•\tGained in-depth experience with wet etching, reliability testing, and reflow profile design. Intern Universal Instruments May 2005  –  May 2007  (2 years 1 month) •\tDeveloped a systematic understanding of the effects of Cu plating conditions on subsequent voiding at the SAC/Cu interface. \n•\tGained in-depth experience with wet etching, reliability testing, and reflow profile design. Research Associate Shanghai Jiao Tong University September 2000  –  May 2004  (3 years 9 months) Shanghai City, China •\tConducted numerical simulation of multi-flow and radiation heat transfer \n•\tModeled dual-vane swirling combustor for industrial test to control NOx emission Research Associate Shanghai Jiao Tong University September 2000  –  May 2004  (3 years 9 months) Shanghai City, China •\tConducted numerical simulation of multi-flow and radiation heat transfer \n•\tModeled dual-vane swirling combustor for industrial test to control NOx emission Research Assistant Wuhan University September 1997  –  May 2000  (2 years 9 months) Wuhan, Hubei, China •\tExplored experimental/numerical simulation and designed a patented dual-vane swirling combustor Research Assistant Wuhan University September 1997  –  May 2000  (2 years 9 months) Wuhan, Hubei, China •\tExplored experimental/numerical simulation and designed a patented dual-vane swirling combustor Languages English Chinese (Traditional) English Chinese (Traditional) English Chinese (Traditional) Skills Characterization Materials Semiconductors Design of Experiments Failure Analysis Materials Science JMP Thin Films R&D SPC Electronics JSL FMEA SolidWorks Fortran SEM XRD LLCR PVD FIB TEM TGA DSC High Volume... Program Management SQL Lean Six Sigma Project Management Manufacturing See 14+     See less Skills  Characterization Materials Semiconductors Design of Experiments Failure Analysis Materials Science JMP Thin Films R&D SPC Electronics JSL FMEA SolidWorks Fortran SEM XRD LLCR PVD FIB TEM TGA DSC High Volume... Program Management SQL Lean Six Sigma Project Management Manufacturing See 14+     See less Characterization Materials Semiconductors Design of Experiments Failure Analysis Materials Science JMP Thin Films R&D SPC Electronics JSL FMEA SolidWorks Fortran SEM XRD LLCR PVD FIB TEM TGA DSC High Volume... Program Management SQL Lean Six Sigma Project Management Manufacturing See 14+     See less Characterization Materials Semiconductors Design of Experiments Failure Analysis Materials Science JMP Thin Films R&D SPC Electronics JSL FMEA SolidWorks Fortran SEM XRD LLCR PVD FIB TEM TGA DSC High Volume... Program Management SQL Lean Six Sigma Project Management Manufacturing See 14+     See less Education Binghamton University Ph.D,  Material Science & Engineering , 3.75 2004  – 2010 •\tIdentified and quantified the effect of Sn plating parameters on the propensity for Sn whisker formation in Sn film. \n•\tEstablished a quantitative understanding of the effects of soldering conditions on the formation of intermetallic compounds (IMCs) at the interfaces between Pb free solders and common pad finishes. \n•\tEstablished a quantitative understanding of the low temperature reactions between lead-free solders and Au/Ni pad finish. \n•\tIdentified the process parameters which control the spalling of IMCs at the SAC/Au/Ni interface. \n•\tIdentified and analyzed the failure of contact probe pins when contacted with SAC solders. \n•\tQuantified the effects of stress state and Cu grain size on voiding at the SAC/Cu interface. Wuhan University Master’s Degree,  Mechanical Engineering , 3.8 1997  – 2000 Wuhan University Bachelor’s Degree,  Mechanical Engineering , 3.5 1993  – 1997 Binghamton University Ph.D,  Material Science & Engineering , 3.75 2004  – 2010 •\tIdentified and quantified the effect of Sn plating parameters on the propensity for Sn whisker formation in Sn film. \n•\tEstablished a quantitative understanding of the effects of soldering conditions on the formation of intermetallic compounds (IMCs) at the interfaces between Pb free solders and common pad finishes. \n•\tEstablished a quantitative understanding of the low temperature reactions between lead-free solders and Au/Ni pad finish. \n•\tIdentified the process parameters which control the spalling of IMCs at the SAC/Au/Ni interface. \n•\tIdentified and analyzed the failure of contact probe pins when contacted with SAC solders. \n•\tQuantified the effects of stress state and Cu grain size on voiding at the SAC/Cu interface. Binghamton University Ph.D,  Material Science & Engineering , 3.75 2004  – 2010 •\tIdentified and quantified the effect of Sn plating parameters on the propensity for Sn whisker formation in Sn film. \n•\tEstablished a quantitative understanding of the effects of soldering conditions on the formation of intermetallic compounds (IMCs) at the interfaces between Pb free solders and common pad finishes. \n•\tEstablished a quantitative understanding of the low temperature reactions between lead-free solders and Au/Ni pad finish. \n•\tIdentified the process parameters which control the spalling of IMCs at the SAC/Au/Ni interface. \n•\tIdentified and analyzed the failure of contact probe pins when contacted with SAC solders. \n•\tQuantified the effects of stress state and Cu grain size on voiding at the SAC/Cu interface. Binghamton University Ph.D,  Material Science & Engineering , 3.75 2004  – 2010 •\tIdentified and quantified the effect of Sn plating parameters on the propensity for Sn whisker formation in Sn film. \n•\tEstablished a quantitative understanding of the effects of soldering conditions on the formation of intermetallic compounds (IMCs) at the interfaces between Pb free solders and common pad finishes. \n•\tEstablished a quantitative understanding of the low temperature reactions between lead-free solders and Au/Ni pad finish. \n•\tIdentified the process parameters which control the spalling of IMCs at the SAC/Au/Ni interface. \n•\tIdentified and analyzed the failure of contact probe pins when contacted with SAC solders. \n•\tQuantified the effects of stress state and Cu grain size on voiding at the SAC/Cu interface. Wuhan University Master’s Degree,  Mechanical Engineering , 3.8 1997  – 2000 Wuhan University Master’s Degree,  Mechanical Engineering , 3.8 1997  – 2000 Wuhan University Master’s Degree,  Mechanical Engineering , 3.8 1997  – 2000 Wuhan University Bachelor’s Degree,  Mechanical Engineering , 3.5 1993  – 1997 Wuhan University Bachelor’s Degree,  Mechanical Engineering , 3.5 1993  – 1997 Wuhan University Bachelor’s Degree,  Mechanical Engineering , 3.5 1993  – 1997 Honors & Awards Excellent Student Scholarship Wuhan University May 1998 Awarded Excellent Student Scholarship, Wuhan University, 1998 Excellent Student Scholarship Wuhan University May 1998 Awarded Excellent Student Scholarship, Wuhan University, 1998 Excellent Student Scholarship Wuhan University May 1998 Awarded Excellent Student Scholarship, Wuhan University, 1998 Excellent Student Scholarship Wuhan University May 1998 Awarded Excellent Student Scholarship, Wuhan University, 1998 ", "Experience Senior Packaging Engineer Intel Corporation Senior Packaging Engineer Intel Corporation Senior Packaging Engineer Intel Corporation Education The Ohio State University 1998  – 2003 The Ohio State University 1998  – 2003 The Ohio State University 1998  – 2003 The Ohio State University 1998  – 2003 ", "Experience Engineering TD Manager Intel Corporation February 2014  – Present (1 year 7 months) Chandler, Arizona Materials Group Lead in Substrate Pathfinding Technology. Managing team responsible for core, prepreg, build up dielectric film and solder resist materials in substrate flip-chip packages. Senior Packaging Engineer Intel Corporation January 2011  –  February 2014  (3 years 2 months) chandler, arizona Wet Process Module Owner in Substrate Pathfinding Technology. Areas of expertise in substrate flip chip packaging: electrolytic Cu plating, electroless Cu plating and desmear. Graduate Student Intern Huntsman 2009  –  2010  (1 year) the woodlands, tx Polyurethane R&D Engineering TD Manager Intel Corporation February 2014  – Present (1 year 7 months) Chandler, Arizona Materials Group Lead in Substrate Pathfinding Technology. Managing team responsible for core, prepreg, build up dielectric film and solder resist materials in substrate flip-chip packages. Engineering TD Manager Intel Corporation February 2014  – Present (1 year 7 months) Chandler, Arizona Materials Group Lead in Substrate Pathfinding Technology. Managing team responsible for core, prepreg, build up dielectric film and solder resist materials in substrate flip-chip packages. Senior Packaging Engineer Intel Corporation January 2011  –  February 2014  (3 years 2 months) chandler, arizona Wet Process Module Owner in Substrate Pathfinding Technology. Areas of expertise in substrate flip chip packaging: electrolytic Cu plating, electroless Cu plating and desmear. Senior Packaging Engineer Intel Corporation January 2011  –  February 2014  (3 years 2 months) chandler, arizona Wet Process Module Owner in Substrate Pathfinding Technology. Areas of expertise in substrate flip chip packaging: electrolytic Cu plating, electroless Cu plating and desmear. Graduate Student Intern Huntsman 2009  –  2010  (1 year) the woodlands, tx Polyurethane R&D Graduate Student Intern Huntsman 2009  –  2010  (1 year) the woodlands, tx Polyurethane R&D Skills Materials Science Characterization Nanotechnology Design of Experiments R&D AFM Thin Films Polymers Chemistry Spectroscopy Powder X-ray Diffraction Scanning Electron... Nanomaterials Analytical Chemistry Semiconductors XPS Engineering TEM UV/Vis Surface Chemistry Electronics Packaging Lean Manufacturing JMP Failure Analysis Materials Product Development Semiconductor Industry Manufacturing See 13+     See less Skills  Materials Science Characterization Nanotechnology Design of Experiments R&D AFM Thin Films Polymers Chemistry Spectroscopy Powder X-ray Diffraction Scanning Electron... Nanomaterials Analytical Chemistry Semiconductors XPS Engineering TEM UV/Vis Surface Chemistry Electronics Packaging Lean Manufacturing JMP Failure Analysis Materials Product Development Semiconductor Industry Manufacturing See 13+     See less Materials Science Characterization Nanotechnology Design of Experiments R&D AFM Thin Films Polymers Chemistry Spectroscopy Powder X-ray Diffraction Scanning Electron... Nanomaterials Analytical Chemistry Semiconductors XPS Engineering TEM UV/Vis Surface Chemistry Electronics Packaging Lean Manufacturing JMP Failure Analysis Materials Product Development Semiconductor Industry Manufacturing See 13+     See less Materials Science Characterization Nanotechnology Design of Experiments R&D AFM Thin Films Polymers Chemistry Spectroscopy Powder X-ray Diffraction Scanning Electron... Nanomaterials Analytical Chemistry Semiconductors XPS Engineering TEM UV/Vis Surface Chemistry Electronics Packaging Lean Manufacturing JMP Failure Analysis Materials Product Development Semiconductor Industry Manufacturing See 13+     See less Education Texas A&M University Doctor of Philosophy (Ph.D.),  Chemistry 2006  – 2010 Texas Lutheran University Bachelor of Science (B.S.),  Chemistry 2002  – 2005 Texas A&M University Doctor of Philosophy (Ph.D.),  Chemistry 2006  – 2010 Texas A&M University Doctor of Philosophy (Ph.D.),  Chemistry 2006  – 2010 Texas A&M University Doctor of Philosophy (Ph.D.),  Chemistry 2006  – 2010 Texas Lutheran University Bachelor of Science (B.S.),  Chemistry 2002  – 2005 Texas Lutheran University Bachelor of Science (B.S.),  Chemistry 2002  – 2005 Texas Lutheran University Bachelor of Science (B.S.),  Chemistry 2002  – 2005 "]}