{"position": "Senior Marketing Manager", "company": "Intel Corporation", "profiles": ["Experience Senior Marketing Manager Intel Corporation October 2011  – Present (3 years 11 months) portland area, oregon Wireless Program Initiatives Marketing Manager Intel 2007  –  September 2011  (4 years) Manage the development and execution of Intel's U.S. go to market plan incorporating business and consumer campaign and co-marketing w/key partners. Senior Marketing Programs Manager Intel September 2004  –  2006  (2 years) Responsible for accelerating the adoption and sales of Intel’s communications boards and servers to equipment manufacturers and Service Providers. Create and manage push and pull go to market programs driving $57M in revenue attainment and 30 % market share.  \n•Conducted market analysis resulting in strategic focus on Wireless and IP Multi Media Systems \n•Achieved incremental 25% in revenue by creating & implementing go to market plan for adjacent military market \n•Increased sales by 15% by developing channel marketing and development program.  \n•Increased sales by 10% through go to market plans with strategic partners (Motorola, Nortel) Plans consisted of product seed programs, co selling and co marketing \n•Drove brand awareness and product knowledge by creating & implemented marcom plan across multiple mediums. Plan consists of tradeshows, online, direct marketing, seminars Campaign Marketing Manager Intel December 2002  –  August 2004  (1 year 9 months) Manage million dollar budget market development pull plan to migrate the communications market to open standard products. Successfully created industry entrance for key Intel communication products resulting in clear early product market share leadership \n•\tDefined target audience requirements and developed marketing mix responsible for creating awareness, knowledge and consideration at service providers  \n•\tEstablished strategic marketing relationships with key companies (Tektronix, HP) to create solutions based market interest  \n•\tEstablished fledgling relationship marketing program that netted 1000% growth in target audience acquisition \n•\tIncreased marketing effectiveness 20% by creating stronger accountability for marketing ROI, improved results tracking methodology and implementation \n•\tMatrix managed cross division, group & function to achieve results. AT&T Strategic Alliance Manager for IBM and Dell AT&T January 1998  –  December 2000  (3 years) Developed strategic business relationships relative to service offerings that generated $10M in revenue. Responsibilities also included Business Development. \n•\tManaged marketing plan for new Strategic Alliance with IBM generating $10M in annual revenue \n•\tRecruited 100 new channel partners by developing and executing recruitment plan \n•\tMatrix managed key internal and external relationships to milestone objectives. \n•\tManaged $500K budget to business objectives Marketing Manager AT&T 1996  –  2000  (4 years) Senior Marketing Manager Intel Corporation October 2011  – Present (3 years 11 months) portland area, oregon Senior Marketing Manager Intel Corporation October 2011  – Present (3 years 11 months) portland area, oregon Wireless Program Initiatives Marketing Manager Intel 2007  –  September 2011  (4 years) Manage the development and execution of Intel's U.S. go to market plan incorporating business and consumer campaign and co-marketing w/key partners. Wireless Program Initiatives Marketing Manager Intel 2007  –  September 2011  (4 years) Manage the development and execution of Intel's U.S. go to market plan incorporating business and consumer campaign and co-marketing w/key partners. Senior Marketing Programs Manager Intel September 2004  –  2006  (2 years) Responsible for accelerating the adoption and sales of Intel’s communications boards and servers to equipment manufacturers and Service Providers. Create and manage push and pull go to market programs driving $57M in revenue attainment and 30 % market share.  \n•Conducted market analysis resulting in strategic focus on Wireless and IP Multi Media Systems \n•Achieved incremental 25% in revenue by creating & implementing go to market plan for adjacent military market \n•Increased sales by 15% by developing channel marketing and development program.  \n•Increased sales by 10% through go to market plans with strategic partners (Motorola, Nortel) Plans consisted of product seed programs, co selling and co marketing \n•Drove brand awareness and product knowledge by creating & implemented marcom plan across multiple mediums. Plan consists of tradeshows, online, direct marketing, seminars Senior Marketing Programs Manager Intel September 2004  –  2006  (2 years) Responsible for accelerating the adoption and sales of Intel’s communications boards and servers to equipment manufacturers and Service Providers. Create and manage push and pull go to market programs driving $57M in revenue attainment and 30 % market share.  \n•Conducted market analysis resulting in strategic focus on Wireless and IP Multi Media Systems \n•Achieved incremental 25% in revenue by creating & implementing go to market plan for adjacent military market \n•Increased sales by 15% by developing channel marketing and development program.  \n•Increased sales by 10% through go to market plans with strategic partners (Motorola, Nortel) Plans consisted of product seed programs, co selling and co marketing \n•Drove brand awareness and product knowledge by creating & implemented marcom plan across multiple mediums. Plan consists of tradeshows, online, direct marketing, seminars Campaign Marketing Manager Intel December 2002  –  August 2004  (1 year 9 months) Manage million dollar budget market development pull plan to migrate the communications market to open standard products. Successfully created industry entrance for key Intel communication products resulting in clear early product market share leadership \n•\tDefined target audience requirements and developed marketing mix responsible for creating awareness, knowledge and consideration at service providers  \n•\tEstablished strategic marketing relationships with key companies (Tektronix, HP) to create solutions based market interest  \n•\tEstablished fledgling relationship marketing program that netted 1000% growth in target audience acquisition \n•\tIncreased marketing effectiveness 20% by creating stronger accountability for marketing ROI, improved results tracking methodology and implementation \n•\tMatrix managed cross division, group & function to achieve results. Campaign Marketing Manager Intel December 2002  –  August 2004  (1 year 9 months) Manage million dollar budget market development pull plan to migrate the communications market to open standard products. Successfully created industry entrance for key Intel communication products resulting in clear early product market share leadership \n•\tDefined target audience requirements and developed marketing mix responsible for creating awareness, knowledge and consideration at service providers  \n•\tEstablished strategic marketing relationships with key companies (Tektronix, HP) to create solutions based market interest  \n•\tEstablished fledgling relationship marketing program that netted 1000% growth in target audience acquisition \n•\tIncreased marketing effectiveness 20% by creating stronger accountability for marketing ROI, improved results tracking methodology and implementation \n•\tMatrix managed cross division, group & function to achieve results. AT&T Strategic Alliance Manager for IBM and Dell AT&T January 1998  –  December 2000  (3 years) Developed strategic business relationships relative to service offerings that generated $10M in revenue. Responsibilities also included Business Development. \n•\tManaged marketing plan for new Strategic Alliance with IBM generating $10M in annual revenue \n•\tRecruited 100 new channel partners by developing and executing recruitment plan \n•\tMatrix managed key internal and external relationships to milestone objectives. \n•\tManaged $500K budget to business objectives AT&T Strategic Alliance Manager for IBM and Dell AT&T January 1998  –  December 2000  (3 years) Developed strategic business relationships relative to service offerings that generated $10M in revenue. Responsibilities also included Business Development. \n•\tManaged marketing plan for new Strategic Alliance with IBM generating $10M in annual revenue \n•\tRecruited 100 new channel partners by developing and executing recruitment plan \n•\tMatrix managed key internal and external relationships to milestone objectives. \n•\tManaged $500K budget to business objectives Marketing Manager AT&T 1996  –  2000  (4 years) Marketing Manager AT&T 1996  –  2000  (4 years) Skills Strategic Partnerships Go-to-market Strategy Marketing Strategy Program Management Marketing Communications Channel Business Development Channel Partners Direct Marketing Marketing Leadership Management Market Analysis Skills  Strategic Partnerships Go-to-market Strategy Marketing Strategy Program Management Marketing Communications Channel Business Development Channel Partners Direct Marketing Marketing Leadership Management Market Analysis Strategic Partnerships Go-to-market Strategy Marketing Strategy Program Management Marketing Communications Channel Business Development Channel Partners Direct Marketing Marketing Leadership Management Market Analysis Strategic Partnerships Go-to-market Strategy Marketing Strategy Program Management Marketing Communications Channel Business Development Channel Partners Direct Marketing Marketing Leadership Management Market Analysis Education New York Institute of Technology 1988  – 1991 New York Institute of Technology 1988  – 1991 New York Institute of Technology 1988  – 1991 New York Institute of Technology 1988  – 1991 ", "Summary Accomplished marketing professional with over 18 years of diverse marketing and communications experience in both consumer & business segments. Strategic marketing skills include pre-launch, launch planning, brand management, messaging/positioning, and demand creation. Tactical marketing experiences include sales force promotional campaigns, publication planning, event management, and account management. Possess outstanding team leadership and project management abilities with a proved track record for meeting timelines, budget, and exceeding goals and expectations. Summary Accomplished marketing professional with over 18 years of diverse marketing and communications experience in both consumer & business segments. Strategic marketing skills include pre-launch, launch planning, brand management, messaging/positioning, and demand creation. Tactical marketing experiences include sales force promotional campaigns, publication planning, event management, and account management. Possess outstanding team leadership and project management abilities with a proved track record for meeting timelines, budget, and exceeding goals and expectations. Accomplished marketing professional with over 18 years of diverse marketing and communications experience in both consumer & business segments. Strategic marketing skills include pre-launch, launch planning, brand management, messaging/positioning, and demand creation. Tactical marketing experiences include sales force promotional campaigns, publication planning, event management, and account management. Possess outstanding team leadership and project management abilities with a proved track record for meeting timelines, budget, and exceeding goals and expectations. Accomplished marketing professional with over 18 years of diverse marketing and communications experience in both consumer & business segments. Strategic marketing skills include pre-launch, launch planning, brand management, messaging/positioning, and demand creation. Tactical marketing experiences include sales force promotional campaigns, publication planning, event management, and account management. Possess outstanding team leadership and project management abilities with a proved track record for meeting timelines, budget, and exceeding goals and expectations. Experience Customer Marketing Manager Intel Corporation October 2013  – Present (1 year 11 months) • Managed strategic desktop PC programs with Dell to influence and drive product roadmap alignment, innovation, and GTM strategies. Developed account specific strategies to align with Intel strategies, plans, and priorities. \n• Aligned GTM activities by facilitating participation in Intel marketing events and programs. \npriorities. \n• Provided path to market for first <$500 pAIO for Holiday 2014 with assortment at 500+ Microsoft stores and Best Buy across North America with updated messaging and positioning. \n• Facilitated Exec relationships via cadence of executive interactions and meetings, ensuring proper attendees/topics are addressed, and drove prep, pre-work, and content. \n Senior Marketing Manager Intel Corporation January 2010  –  October 2013  (3 years 10 months) • Responsible for developing business Ultrabook GTM plans including marketing, positioning, securing OEM design wins, and ramping product. \n• Created iPad competitive response guide and companion device positioning along with training for worldwide field sales organization. \n• Provided customer marketing support for HP, Acer, Asus and acted as the conduit for field requests to the factory and provided training to field on product updates. Developed strategic relationships with account teams to drive design wins on business solutions. Regularly developed content for senior executive business update meetings. \n• Worked on annual sales acceleration programs for field to promote PC client refresh and sell up by providing updated proof points, identify pending customer PC purchases and working with field to close deals, and track volumes. \n• Produced business related content and support for various keynotes aimed at both internal and external audiences. Marketing Manager Intel Corporation July 2006  –  December 2009  (3 years 6 months) • Cross segment marketing manager responsible for consumer and business programs. \n• Develop pre-launch and go-to-market plans for new products. \n• Worked with product marketing to develop feature benefit analysis and tracked progress of various initiatives targeted for launch. \n• Responsible for cross division activities to ensure alignment on disclosure timelines, messaging, PR/AR, branding, and launch. \n• Managed cross division and worldwide activities for Core2 Duo processor launch in July 2006. \n• Key stakeholder with corporate brand management to develop new brand and logo along with usage requirements. Co-Marketing Manager Intel Corporation November 2005  –  June 2006  (8 months) • Defined 2006 WiMAX marketing strategy and developed internal and external marketing plan to drive awareness.  \n• Developed WiMAX co-marketing plans with partners including Alcatel, Motorola, and Nortel. \n• Drove strategic customer meetings to review roadmaps and identify areas of joint opportunities for demand generation programs. \n• Created joint legally approved WiMAX carrier presentations with accounts for dissemination to sales teams to scale messages. Marketing Manager Intel Corporation April 2003  –  November 2005  (2 years 8 months) • Implemented and drove strategy to increase notebook and WLAN adoption in large businesses by addressing key barriers and highlighting Centrino feature benefits. \n• Developed Centrino messaging targeted for enterprise segment which was used in corporate marketing campaigns at launch. \n• Produced content and supported divisional VP keynotes at various external events. \n• Led worldwide IT customer meetings working with geos, field management, Intel IT, and divisional stakeholders to ensure the voice of the customer was represented in our programs. Results were shared across product and sales divisions and led to direct actions for strategic corporate planning. \n• Developed customer-ready Centrino presentation targeted for field sales to use at Fortune 500 accounts and was a top 10 downloaded document of the year. \n• Created approved joint messaging with leading ISV’s such as SAP, Oracle, Reuters, Adobe, Groove Networks, and Computer Associates highlighting their mobile optimized applications. Program Manager Intel Corporation January 2002  –  March 2003  (1 year 3 months) • Drove APAC Infrastructure Enabling Program for broader WLAN hotspot deployment with leading Telco’s such as PCCW, China Mobile, China Netcom, Korea Telecom, and Hanaro Telecom to prepare for Centrino launch. \n• Developed worldwide Service Provider/OEM co-marketing programs with corporate sales and secured $6M incremental funding to execute program. \n• Conducted 802.11b wireless industry market analysis through analyst reports and forecasts and conducted SWOT analysis of fellow travelers. Project Manager Intel Corporation January 2001  –  January 2002  (1 year 1 month) • Member of Bluetooth SIG Marketing Team and WECA (Wireless Ethernet) Marketing committee representing Intel. \n• Assisted with development, ratification and execution of annual marketing plans and budgets. \n• Chaired cross-company Bluetooth Marketing team responsible for events, contract negotiations, brand management, and speaker recruitment/placement. \n• Project lead for Bluetooth Developers Conference which drew over 2000 attendees worldwide at Moscone Center and secured keynote for Intel as well as content for keynote. Responsibilities included working with vendor on details of conference, tracks, promotional materials, and various marketing outreach activities. Operations Manager Intel Corporation July 1999  –  December 2000  (1 year 6 months) • Managed product recall operations and responsible for implementing and ensuring processes for customer calls, fulfillment, collateral, service centers, and worldwide training when needed. \n• Lead issue manager for Intel 820 chipset MTH recall program and key participant of high level problem resolution team overseeing key decisions and communications to customers and executive management. \n• Managed ongoing $500M FDIV program (Pentium® processor replacement program) \n• Implemented an 80% cost savings for the FDIV program through contract renegotiation with vendor. Marketing Specialist Intel Corporation April 1997  –  June 1999  (2 years 3 months) Customer Marketing Manager Intel Corporation October 2013  – Present (1 year 11 months) • Managed strategic desktop PC programs with Dell to influence and drive product roadmap alignment, innovation, and GTM strategies. Developed account specific strategies to align with Intel strategies, plans, and priorities. \n• Aligned GTM activities by facilitating participation in Intel marketing events and programs. \npriorities. \n• Provided path to market for first <$500 pAIO for Holiday 2014 with assortment at 500+ Microsoft stores and Best Buy across North America with updated messaging and positioning. \n• Facilitated Exec relationships via cadence of executive interactions and meetings, ensuring proper attendees/topics are addressed, and drove prep, pre-work, and content. \n Customer Marketing Manager Intel Corporation October 2013  – Present (1 year 11 months) • Managed strategic desktop PC programs with Dell to influence and drive product roadmap alignment, innovation, and GTM strategies. Developed account specific strategies to align with Intel strategies, plans, and priorities. \n• Aligned GTM activities by facilitating participation in Intel marketing events and programs. \npriorities. \n• Provided path to market for first <$500 pAIO for Holiday 2014 with assortment at 500+ Microsoft stores and Best Buy across North America with updated messaging and positioning. \n• Facilitated Exec relationships via cadence of executive interactions and meetings, ensuring proper attendees/topics are addressed, and drove prep, pre-work, and content. \n Senior Marketing Manager Intel Corporation January 2010  –  October 2013  (3 years 10 months) • Responsible for developing business Ultrabook GTM plans including marketing, positioning, securing OEM design wins, and ramping product. \n• Created iPad competitive response guide and companion device positioning along with training for worldwide field sales organization. \n• Provided customer marketing support for HP, Acer, Asus and acted as the conduit for field requests to the factory and provided training to field on product updates. Developed strategic relationships with account teams to drive design wins on business solutions. Regularly developed content for senior executive business update meetings. \n• Worked on annual sales acceleration programs for field to promote PC client refresh and sell up by providing updated proof points, identify pending customer PC purchases and working with field to close deals, and track volumes. \n• Produced business related content and support for various keynotes aimed at both internal and external audiences. Senior Marketing Manager Intel Corporation January 2010  –  October 2013  (3 years 10 months) • Responsible for developing business Ultrabook GTM plans including marketing, positioning, securing OEM design wins, and ramping product. \n• Created iPad competitive response guide and companion device positioning along with training for worldwide field sales organization. \n• Provided customer marketing support for HP, Acer, Asus and acted as the conduit for field requests to the factory and provided training to field on product updates. Developed strategic relationships with account teams to drive design wins on business solutions. Regularly developed content for senior executive business update meetings. \n• Worked on annual sales acceleration programs for field to promote PC client refresh and sell up by providing updated proof points, identify pending customer PC purchases and working with field to close deals, and track volumes. \n• Produced business related content and support for various keynotes aimed at both internal and external audiences. Marketing Manager Intel Corporation July 2006  –  December 2009  (3 years 6 months) • Cross segment marketing manager responsible for consumer and business programs. \n• Develop pre-launch and go-to-market plans for new products. \n• Worked with product marketing to develop feature benefit analysis and tracked progress of various initiatives targeted for launch. \n• Responsible for cross division activities to ensure alignment on disclosure timelines, messaging, PR/AR, branding, and launch. \n• Managed cross division and worldwide activities for Core2 Duo processor launch in July 2006. \n• Key stakeholder with corporate brand management to develop new brand and logo along with usage requirements. Marketing Manager Intel Corporation July 2006  –  December 2009  (3 years 6 months) • Cross segment marketing manager responsible for consumer and business programs. \n• Develop pre-launch and go-to-market plans for new products. \n• Worked with product marketing to develop feature benefit analysis and tracked progress of various initiatives targeted for launch. \n• Responsible for cross division activities to ensure alignment on disclosure timelines, messaging, PR/AR, branding, and launch. \n• Managed cross division and worldwide activities for Core2 Duo processor launch in July 2006. \n• Key stakeholder with corporate brand management to develop new brand and logo along with usage requirements. Co-Marketing Manager Intel Corporation November 2005  –  June 2006  (8 months) • Defined 2006 WiMAX marketing strategy and developed internal and external marketing plan to drive awareness.  \n• Developed WiMAX co-marketing plans with partners including Alcatel, Motorola, and Nortel. \n• Drove strategic customer meetings to review roadmaps and identify areas of joint opportunities for demand generation programs. \n• Created joint legally approved WiMAX carrier presentations with accounts for dissemination to sales teams to scale messages. Co-Marketing Manager Intel Corporation November 2005  –  June 2006  (8 months) • Defined 2006 WiMAX marketing strategy and developed internal and external marketing plan to drive awareness.  \n• Developed WiMAX co-marketing plans with partners including Alcatel, Motorola, and Nortel. \n• Drove strategic customer meetings to review roadmaps and identify areas of joint opportunities for demand generation programs. \n• Created joint legally approved WiMAX carrier presentations with accounts for dissemination to sales teams to scale messages. Marketing Manager Intel Corporation April 2003  –  November 2005  (2 years 8 months) • Implemented and drove strategy to increase notebook and WLAN adoption in large businesses by addressing key barriers and highlighting Centrino feature benefits. \n• Developed Centrino messaging targeted for enterprise segment which was used in corporate marketing campaigns at launch. \n• Produced content and supported divisional VP keynotes at various external events. \n• Led worldwide IT customer meetings working with geos, field management, Intel IT, and divisional stakeholders to ensure the voice of the customer was represented in our programs. Results were shared across product and sales divisions and led to direct actions for strategic corporate planning. \n• Developed customer-ready Centrino presentation targeted for field sales to use at Fortune 500 accounts and was a top 10 downloaded document of the year. \n• Created approved joint messaging with leading ISV’s such as SAP, Oracle, Reuters, Adobe, Groove Networks, and Computer Associates highlighting their mobile optimized applications. Marketing Manager Intel Corporation April 2003  –  November 2005  (2 years 8 months) • Implemented and drove strategy to increase notebook and WLAN adoption in large businesses by addressing key barriers and highlighting Centrino feature benefits. \n• Developed Centrino messaging targeted for enterprise segment which was used in corporate marketing campaigns at launch. \n• Produced content and supported divisional VP keynotes at various external events. \n• Led worldwide IT customer meetings working with geos, field management, Intel IT, and divisional stakeholders to ensure the voice of the customer was represented in our programs. Results were shared across product and sales divisions and led to direct actions for strategic corporate planning. \n• Developed customer-ready Centrino presentation targeted for field sales to use at Fortune 500 accounts and was a top 10 downloaded document of the year. \n• Created approved joint messaging with leading ISV’s such as SAP, Oracle, Reuters, Adobe, Groove Networks, and Computer Associates highlighting their mobile optimized applications. Program Manager Intel Corporation January 2002  –  March 2003  (1 year 3 months) • Drove APAC Infrastructure Enabling Program for broader WLAN hotspot deployment with leading Telco’s such as PCCW, China Mobile, China Netcom, Korea Telecom, and Hanaro Telecom to prepare for Centrino launch. \n• Developed worldwide Service Provider/OEM co-marketing programs with corporate sales and secured $6M incremental funding to execute program. \n• Conducted 802.11b wireless industry market analysis through analyst reports and forecasts and conducted SWOT analysis of fellow travelers. Program Manager Intel Corporation January 2002  –  March 2003  (1 year 3 months) • Drove APAC Infrastructure Enabling Program for broader WLAN hotspot deployment with leading Telco’s such as PCCW, China Mobile, China Netcom, Korea Telecom, and Hanaro Telecom to prepare for Centrino launch. \n• Developed worldwide Service Provider/OEM co-marketing programs with corporate sales and secured $6M incremental funding to execute program. \n• Conducted 802.11b wireless industry market analysis through analyst reports and forecasts and conducted SWOT analysis of fellow travelers. Project Manager Intel Corporation January 2001  –  January 2002  (1 year 1 month) • Member of Bluetooth SIG Marketing Team and WECA (Wireless Ethernet) Marketing committee representing Intel. \n• Assisted with development, ratification and execution of annual marketing plans and budgets. \n• Chaired cross-company Bluetooth Marketing team responsible for events, contract negotiations, brand management, and speaker recruitment/placement. \n• Project lead for Bluetooth Developers Conference which drew over 2000 attendees worldwide at Moscone Center and secured keynote for Intel as well as content for keynote. Responsibilities included working with vendor on details of conference, tracks, promotional materials, and various marketing outreach activities. Project Manager Intel Corporation January 2001  –  January 2002  (1 year 1 month) • Member of Bluetooth SIG Marketing Team and WECA (Wireless Ethernet) Marketing committee representing Intel. \n• Assisted with development, ratification and execution of annual marketing plans and budgets. \n• Chaired cross-company Bluetooth Marketing team responsible for events, contract negotiations, brand management, and speaker recruitment/placement. \n• Project lead for Bluetooth Developers Conference which drew over 2000 attendees worldwide at Moscone Center and secured keynote for Intel as well as content for keynote. Responsibilities included working with vendor on details of conference, tracks, promotional materials, and various marketing outreach activities. Operations Manager Intel Corporation July 1999  –  December 2000  (1 year 6 months) • Managed product recall operations and responsible for implementing and ensuring processes for customer calls, fulfillment, collateral, service centers, and worldwide training when needed. \n• Lead issue manager for Intel 820 chipset MTH recall program and key participant of high level problem resolution team overseeing key decisions and communications to customers and executive management. \n• Managed ongoing $500M FDIV program (Pentium® processor replacement program) \n• Implemented an 80% cost savings for the FDIV program through contract renegotiation with vendor. Operations Manager Intel Corporation July 1999  –  December 2000  (1 year 6 months) • Managed product recall operations and responsible for implementing and ensuring processes for customer calls, fulfillment, collateral, service centers, and worldwide training when needed. \n• Lead issue manager for Intel 820 chipset MTH recall program and key participant of high level problem resolution team overseeing key decisions and communications to customers and executive management. \n• Managed ongoing $500M FDIV program (Pentium® processor replacement program) \n• Implemented an 80% cost savings for the FDIV program through contract renegotiation with vendor. Marketing Specialist Intel Corporation April 1997  –  June 1999  (2 years 3 months) Marketing Specialist Intel Corporation April 1997  –  June 1999  (2 years 3 months) Languages English Chinese (Traditional) English Chinese (Traditional) English Chinese (Traditional) Skills Product Marketing Go-to-market Strategy Cross-functional Team... Strategic Partnerships Demand Generation Semiconductors Product Management Messaging Strategic Communications Brand Management Skills  Product Marketing Go-to-market Strategy Cross-functional Team... Strategic Partnerships Demand Generation Semiconductors Product Management Messaging Strategic Communications Brand Management Product Marketing Go-to-market Strategy Cross-functional Team... Strategic Partnerships Demand Generation Semiconductors Product Management Messaging Strategic Communications Brand Management Product Marketing Go-to-market Strategy Cross-functional Team... Strategic Partnerships Demand Generation Semiconductors Product Management Messaging Strategic Communications Brand Management Education California Polytechnic State University-San Luis Obispo Bachelor of Applied Science (B.A.Sc.),  business 1994  – 1997 California Polytechnic State University-San Luis Obispo Bachelor of Applied Science (B.A.Sc.),  business 1994  – 1997 California Polytechnic State University-San Luis Obispo Bachelor of Applied Science (B.A.Sc.),  business 1994  – 1997 California Polytechnic State University-San Luis Obispo Bachelor of Applied Science (B.A.Sc.),  business 1994  – 1997 ", "Summary Seasoned Marketing professional with experience in: \n•Worldwide, cross-organizational business management and program implementation  \n•Strategic planning, product and program marketing  \n•Channel/Reseller, Distributor Retail and Multi-National/Global account relationship management \n•Enterprise and consumer products \n•Global Business Development \n•People management and organizational development \n \nLooking for a Senior Marketing Position, preferably in channel, partner and sales organization. Summary Seasoned Marketing professional with experience in: \n•Worldwide, cross-organizational business management and program implementation  \n•Strategic planning, product and program marketing  \n•Channel/Reseller, Distributor Retail and Multi-National/Global account relationship management \n•Enterprise and consumer products \n•Global Business Development \n•People management and organizational development \n \nLooking for a Senior Marketing Position, preferably in channel, partner and sales organization. Seasoned Marketing professional with experience in: \n•Worldwide, cross-organizational business management and program implementation  \n•Strategic planning, product and program marketing  \n•Channel/Reseller, Distributor Retail and Multi-National/Global account relationship management \n•Enterprise and consumer products \n•Global Business Development \n•People management and organizational development \n \nLooking for a Senior Marketing Position, preferably in channel, partner and sales organization. Seasoned Marketing professional with experience in: \n•Worldwide, cross-organizational business management and program implementation  \n•Strategic planning, product and program marketing  \n•Channel/Reseller, Distributor Retail and Multi-National/Global account relationship management \n•Enterprise and consumer products \n•Global Business Development \n•People management and organizational development \n \nLooking for a Senior Marketing Position, preferably in channel, partner and sales organization. Experience Senior Marketing Manager Intel Corporation October 2006  – Present (8 years 11 months) SERVER PRODUCTS GROUP, INTEL CORPORATION  \n \n•\tNegotiated and closed technology investment opportunities for Intel Corporation. Investments totaling greater than $10M. Interests include licensing of intellectual property, funding for technology investment/product development, market development funding, branding and positioning. Received Divisional Recognition Award for results and accomplishments. \n•\tDeveloped and implemented global Value Added Reseller (VAR) Channel Marketing Strategy including product development, marketing and sales investment models. Results yielded new investment of $20M into global channel programs. \n•\tManagement of $2M marketing budget for global launch and support of new Intel products and platforms.  \n•\tDeveloped Server as a Client “thin client” product strategy to ensure Intel based servers are positioned for success to win the backend portion of client consolidation usage models. Received Divisional Recognition Award for results and accomplishments Worldwide Server Marketing Manager Intel Corporation March 2005  –  October 2006  (1 year 8 months) WW RESELLER CHANNEL ORGANIZATION \n \n•\tResponsible for global marketing and platform launch strategy for Intel’s $300M server channel business including a $6M annual budget and driving the geographies to meet/exceed business goals.  \n•\tManagement of 5 people and indirect, WW management of another 6 individuals in geography positions.  \n•\tPersonally developed the server product positioning strategy, high performance computing and small business segment strategy, promotion strategy and executive business indicators. Managed team to deliver distributor, top and broad channel marketing programs for the dual-core Intel® Xeon® Processor. \n•\tKey Results: Exceeded unit and revenue expectations for Q1 and Q2 of 2006, increased MSS 2% worldwide for the first time in 5 quarters, and successfully executed the largest server platform launch in the channel with a 3X faster ramp than previous platforms. Coordinated global marketing programs that increased sales 12% quarter on quarter. Global Business Development Manager Intel October 2003  –  March 2005  (1 year 6 months) CORPORATE TECHNOLOGY GROUP, INTEL CORPORATION  \n \n•\tExtended the Intel® Developer Forum brand worldwide via a global series of conferences. Increased revenue from $0 to $1.9M in 1 year (2004) based on new global strategy.  \n•\tResponsible for driving the first global sponsor and exhibitor representation at the IDF conferences. Developed and executed a global sales strategy and implemented new online marketing tools, contracts and customer relationship management systems to coordinate global sales efforts.  \n•\tLaunched new solutions conference and developed a sales strategy and framework to bring in new, strategic solutions sponsors/exhibitors to IDF including: SAP, SGI, Oracle, Sybase, BEA, and HP Solutions.  \n•\tKey Results: Achieved record revenue for spring ’05 event: $2.41M v. $2.28M target. Exceeded revenue and partner goals on global sponsorship for China and Taiwan conferences. sponsors for IDF for the spring 2005 Series. Intel Inside Brand Program Manager Intel April 2002  –  October 2003  (1 year 7 months) CORPORATE MARKETING GROUP, INTEL CORPORATION HILLSBORO, OR Apr ‘02 – Oct ‘03 \nIntel Inside® Brand Program Manager for IBM Corporation and the Worldwide Channel Organization \n•\tManaged the worldwide IBM Intel Inside brand program, which encompassed $100 million in brand advertising & marketing funds. Negotiated the first IBM xSeries TV campaign and a $3M outdoor (billboard & transit) advertising campaign to support the Centrino Mobile Technology brand launch \n•\tNegotiated the new Integrated Marketing Campaign pilot for desktop, mobile and server brands which was a significant step in creation of the next generation Intel Inside program. Pilot then rolled out to all customers in 2H’03 and is the primary focus of today’s Intel® Inside Program. \n•\tWorked directly with the Geos to implement a channel expansion strategy to increase brand advertising, program participation and enrollment. WW program participation increased from 52% to 75% Senior Marketing Manager Intel Corporation October 2006  – Present (8 years 11 months) SERVER PRODUCTS GROUP, INTEL CORPORATION  \n \n•\tNegotiated and closed technology investment opportunities for Intel Corporation. Investments totaling greater than $10M. Interests include licensing of intellectual property, funding for technology investment/product development, market development funding, branding and positioning. Received Divisional Recognition Award for results and accomplishments. \n•\tDeveloped and implemented global Value Added Reseller (VAR) Channel Marketing Strategy including product development, marketing and sales investment models. Results yielded new investment of $20M into global channel programs. \n•\tManagement of $2M marketing budget for global launch and support of new Intel products and platforms.  \n•\tDeveloped Server as a Client “thin client” product strategy to ensure Intel based servers are positioned for success to win the backend portion of client consolidation usage models. Received Divisional Recognition Award for results and accomplishments Senior Marketing Manager Intel Corporation October 2006  – Present (8 years 11 months) SERVER PRODUCTS GROUP, INTEL CORPORATION  \n \n•\tNegotiated and closed technology investment opportunities for Intel Corporation. Investments totaling greater than $10M. Interests include licensing of intellectual property, funding for technology investment/product development, market development funding, branding and positioning. Received Divisional Recognition Award for results and accomplishments. \n•\tDeveloped and implemented global Value Added Reseller (VAR) Channel Marketing Strategy including product development, marketing and sales investment models. Results yielded new investment of $20M into global channel programs. \n•\tManagement of $2M marketing budget for global launch and support of new Intel products and platforms.  \n•\tDeveloped Server as a Client “thin client” product strategy to ensure Intel based servers are positioned for success to win the backend portion of client consolidation usage models. Received Divisional Recognition Award for results and accomplishments Worldwide Server Marketing Manager Intel Corporation March 2005  –  October 2006  (1 year 8 months) WW RESELLER CHANNEL ORGANIZATION \n \n•\tResponsible for global marketing and platform launch strategy for Intel’s $300M server channel business including a $6M annual budget and driving the geographies to meet/exceed business goals.  \n•\tManagement of 5 people and indirect, WW management of another 6 individuals in geography positions.  \n•\tPersonally developed the server product positioning strategy, high performance computing and small business segment strategy, promotion strategy and executive business indicators. Managed team to deliver distributor, top and broad channel marketing programs for the dual-core Intel® Xeon® Processor. \n•\tKey Results: Exceeded unit and revenue expectations for Q1 and Q2 of 2006, increased MSS 2% worldwide for the first time in 5 quarters, and successfully executed the largest server platform launch in the channel with a 3X faster ramp than previous platforms. Coordinated global marketing programs that increased sales 12% quarter on quarter. Worldwide Server Marketing Manager Intel Corporation March 2005  –  October 2006  (1 year 8 months) WW RESELLER CHANNEL ORGANIZATION \n \n•\tResponsible for global marketing and platform launch strategy for Intel’s $300M server channel business including a $6M annual budget and driving the geographies to meet/exceed business goals.  \n•\tManagement of 5 people and indirect, WW management of another 6 individuals in geography positions.  \n•\tPersonally developed the server product positioning strategy, high performance computing and small business segment strategy, promotion strategy and executive business indicators. Managed team to deliver distributor, top and broad channel marketing programs for the dual-core Intel® Xeon® Processor. \n•\tKey Results: Exceeded unit and revenue expectations for Q1 and Q2 of 2006, increased MSS 2% worldwide for the first time in 5 quarters, and successfully executed the largest server platform launch in the channel with a 3X faster ramp than previous platforms. Coordinated global marketing programs that increased sales 12% quarter on quarter. Global Business Development Manager Intel October 2003  –  March 2005  (1 year 6 months) CORPORATE TECHNOLOGY GROUP, INTEL CORPORATION  \n \n•\tExtended the Intel® Developer Forum brand worldwide via a global series of conferences. Increased revenue from $0 to $1.9M in 1 year (2004) based on new global strategy.  \n•\tResponsible for driving the first global sponsor and exhibitor representation at the IDF conferences. Developed and executed a global sales strategy and implemented new online marketing tools, contracts and customer relationship management systems to coordinate global sales efforts.  \n•\tLaunched new solutions conference and developed a sales strategy and framework to bring in new, strategic solutions sponsors/exhibitors to IDF including: SAP, SGI, Oracle, Sybase, BEA, and HP Solutions.  \n•\tKey Results: Achieved record revenue for spring ’05 event: $2.41M v. $2.28M target. Exceeded revenue and partner goals on global sponsorship for China and Taiwan conferences. sponsors for IDF for the spring 2005 Series. Global Business Development Manager Intel October 2003  –  March 2005  (1 year 6 months) CORPORATE TECHNOLOGY GROUP, INTEL CORPORATION  \n \n•\tExtended the Intel® Developer Forum brand worldwide via a global series of conferences. Increased revenue from $0 to $1.9M in 1 year (2004) based on new global strategy.  \n•\tResponsible for driving the first global sponsor and exhibitor representation at the IDF conferences. Developed and executed a global sales strategy and implemented new online marketing tools, contracts and customer relationship management systems to coordinate global sales efforts.  \n•\tLaunched new solutions conference and developed a sales strategy and framework to bring in new, strategic solutions sponsors/exhibitors to IDF including: SAP, SGI, Oracle, Sybase, BEA, and HP Solutions.  \n•\tKey Results: Achieved record revenue for spring ’05 event: $2.41M v. $2.28M target. Exceeded revenue and partner goals on global sponsorship for China and Taiwan conferences. sponsors for IDF for the spring 2005 Series. Intel Inside Brand Program Manager Intel April 2002  –  October 2003  (1 year 7 months) CORPORATE MARKETING GROUP, INTEL CORPORATION HILLSBORO, OR Apr ‘02 – Oct ‘03 \nIntel Inside® Brand Program Manager for IBM Corporation and the Worldwide Channel Organization \n•\tManaged the worldwide IBM Intel Inside brand program, which encompassed $100 million in brand advertising & marketing funds. Negotiated the first IBM xSeries TV campaign and a $3M outdoor (billboard & transit) advertising campaign to support the Centrino Mobile Technology brand launch \n•\tNegotiated the new Integrated Marketing Campaign pilot for desktop, mobile and server brands which was a significant step in creation of the next generation Intel Inside program. Pilot then rolled out to all customers in 2H’03 and is the primary focus of today’s Intel® Inside Program. \n•\tWorked directly with the Geos to implement a channel expansion strategy to increase brand advertising, program participation and enrollment. WW program participation increased from 52% to 75% Intel Inside Brand Program Manager Intel April 2002  –  October 2003  (1 year 7 months) CORPORATE MARKETING GROUP, INTEL CORPORATION HILLSBORO, OR Apr ‘02 – Oct ‘03 \nIntel Inside® Brand Program Manager for IBM Corporation and the Worldwide Channel Organization \n•\tManaged the worldwide IBM Intel Inside brand program, which encompassed $100 million in brand advertising & marketing funds. Negotiated the first IBM xSeries TV campaign and a $3M outdoor (billboard & transit) advertising campaign to support the Centrino Mobile Technology brand launch \n•\tNegotiated the new Integrated Marketing Campaign pilot for desktop, mobile and server brands which was a significant step in creation of the next generation Intel Inside program. Pilot then rolled out to all customers in 2H’03 and is the primary focus of today’s Intel® Inside Program. \n•\tWorked directly with the Geos to implement a channel expansion strategy to increase brand advertising, program participation and enrollment. WW program participation increased from 52% to 75% Education Indiana University Bloomington 1994  – 1996 Miami University Bachelor of Arts,  Psychology 1987  – 1991 Indiana University Bloomington 1994  – 1996 Indiana University Bloomington 1994  – 1996 Indiana University Bloomington 1994  – 1996 Miami University Bachelor of Arts,  Psychology 1987  – 1991 Miami University Bachelor of Arts,  Psychology 1987  – 1991 Miami University Bachelor of Arts,  Psychology 1987  – 1991 ", "Skills Intel Enterprise Software Product Management Product Marketing Multi-channel Marketing Go-to-market Strategy Cross-functional Team... Product Development Competitive Analysis Demand Generation Product Launch Sales Enablement Product Planning Field Marketing Marketing Communications Positioning Press Analysts Sampling Q&As Customer Experience Written & Oral... Presentation Development Executive Relationships Co-marketing Software Development Consumer Management Business Alliances Semiconductors Processors Product Lifecycle... Marketing Segmentation Strategic Partnerships Semiconductor Industry B2B Marketing Partner Management Consumer Electronics Leadership Analytics Pricing Strategy Start-ups Marketing Management See 29+     See less Skills  Intel Enterprise Software Product Management Product Marketing Multi-channel Marketing Go-to-market Strategy Cross-functional Team... Product Development Competitive Analysis Demand Generation Product Launch Sales Enablement Product Planning Field Marketing Marketing Communications Positioning Press Analysts Sampling Q&As Customer Experience Written & Oral... Presentation Development Executive Relationships Co-marketing Software Development Consumer Management Business Alliances Semiconductors Processors Product Lifecycle... Marketing Segmentation Strategic Partnerships Semiconductor Industry B2B Marketing Partner Management Consumer Electronics Leadership Analytics Pricing Strategy Start-ups Marketing Management See 29+     See less Intel Enterprise Software Product Management Product Marketing Multi-channel Marketing Go-to-market Strategy Cross-functional Team... Product Development Competitive Analysis Demand Generation Product Launch Sales Enablement Product Planning Field Marketing Marketing Communications Positioning Press Analysts Sampling Q&As Customer Experience Written & Oral... Presentation Development Executive Relationships Co-marketing Software Development Consumer Management Business Alliances Semiconductors Processors Product Lifecycle... Marketing Segmentation Strategic Partnerships Semiconductor Industry B2B Marketing Partner Management Consumer Electronics Leadership Analytics Pricing Strategy Start-ups Marketing Management See 29+     See less Intel Enterprise Software Product Management Product Marketing Multi-channel Marketing Go-to-market Strategy Cross-functional Team... Product Development Competitive Analysis Demand Generation Product Launch Sales Enablement Product Planning Field Marketing Marketing Communications Positioning Press Analysts Sampling Q&As Customer Experience Written & Oral... Presentation Development Executive Relationships Co-marketing Software Development Consumer Management Business Alliances Semiconductors Processors Product Lifecycle... Marketing Segmentation Strategic Partnerships Semiconductor Industry B2B Marketing Partner Management Consumer Electronics Leadership Analytics Pricing Strategy Start-ups Marketing Management See 29+     See less ", "Experience Senior Marketing Manager Intel Corporation Senior Marketing Manager Intel Corporation Senior Marketing Manager Intel Corporation Education Miami University 1987  – 1991 Miami University 1987  – 1991 Miami University 1987  – 1991 Miami University 1987  – 1991 ", "Summary Experienced, energetic consultative technology sales, marketing and alliance/channel program development leader with 20 years of experience selling and marketing enterprise software, SaaS, hardware, consulting services, embedded/IoT and mobile technologies/products. Highly personable and results driven with extensive global experience leading high-performing cross functional teams, exceeding quotas and driving/closing multimillion dollar sales and partnerships. Ability to thrive in fast paced, entrepreneurial and ambiguous environments. Seek to consistently drive win-win relationships at all levels from C-Suite to field level. Experience with and strong networks within large multinational OEMs, small/medium-sized, (SMBs), System Integrators, VARs/IHV/ISVs and start-up companies. \n \nSpecialties: \nEnterprise Technology Solution Sales \nBusiness Development Hunter of \"New Logos\" \nStrategic Alliance Programs/Partner Strategy/Channel Development \nAccount Management \nExecutive Relationships \nTechnology Partnerships \nComplex/Technical Sales SOWs and Licensing Agreements \nField Sales Team Management/Development/Communications/Compensation Plans \nGlobal Content Creation/Channel Programs \nP&L Management/Financial Analysis and Processes \nValue Proposition Creation \nStrategic Vision and Implementation \nSelling Offshore, Onshore, and Near-Shore offerings \n \nHave experience in vertical markets including: \n \nCloud Computing- VMware, Oracle, Microsoft, and SAP \nMobile Technologies- iOS and Android \nEnterprise Solution Sales- HPC, ERP, EPM, BPM, SQL, Data Warehousing \nSaaS \nBig Data BI/Analytics \nSemiconductors \nIT Security- Firewalls, DR, BCP \nVARs/Systems Integrators \nIT Outsourced Managed Solutions  \nSalesforce.com/MS Dynamics/CRM Optimization \nQA Testing and Solutions \nMarketing Automation (Marketo, Act-On) \nUX/UI \nHigher Education \nMedia and Entertainment \nTelecommunications Infrastructure Solutions \nIntelligent Systems/IoT/Embedded Computing Technologies \nTelematics/In-vehicle Infotainment \n \n \n \n \nFluent in German Summary Experienced, energetic consultative technology sales, marketing and alliance/channel program development leader with 20 years of experience selling and marketing enterprise software, SaaS, hardware, consulting services, embedded/IoT and mobile technologies/products. Highly personable and results driven with extensive global experience leading high-performing cross functional teams, exceeding quotas and driving/closing multimillion dollar sales and partnerships. Ability to thrive in fast paced, entrepreneurial and ambiguous environments. Seek to consistently drive win-win relationships at all levels from C-Suite to field level. Experience with and strong networks within large multinational OEMs, small/medium-sized, (SMBs), System Integrators, VARs/IHV/ISVs and start-up companies. \n \nSpecialties: \nEnterprise Technology Solution Sales \nBusiness Development Hunter of \"New Logos\" \nStrategic Alliance Programs/Partner Strategy/Channel Development \nAccount Management \nExecutive Relationships \nTechnology Partnerships \nComplex/Technical Sales SOWs and Licensing Agreements \nField Sales Team Management/Development/Communications/Compensation Plans \nGlobal Content Creation/Channel Programs \nP&L Management/Financial Analysis and Processes \nValue Proposition Creation \nStrategic Vision and Implementation \nSelling Offshore, Onshore, and Near-Shore offerings \n \nHave experience in vertical markets including: \n \nCloud Computing- VMware, Oracle, Microsoft, and SAP \nMobile Technologies- iOS and Android \nEnterprise Solution Sales- HPC, ERP, EPM, BPM, SQL, Data Warehousing \nSaaS \nBig Data BI/Analytics \nSemiconductors \nIT Security- Firewalls, DR, BCP \nVARs/Systems Integrators \nIT Outsourced Managed Solutions  \nSalesforce.com/MS Dynamics/CRM Optimization \nQA Testing and Solutions \nMarketing Automation (Marketo, Act-On) \nUX/UI \nHigher Education \nMedia and Entertainment \nTelecommunications Infrastructure Solutions \nIntelligent Systems/IoT/Embedded Computing Technologies \nTelematics/In-vehicle Infotainment \n \n \n \n \nFluent in German Experienced, energetic consultative technology sales, marketing and alliance/channel program development leader with 20 years of experience selling and marketing enterprise software, SaaS, hardware, consulting services, embedded/IoT and mobile technologies/products. Highly personable and results driven with extensive global experience leading high-performing cross functional teams, exceeding quotas and driving/closing multimillion dollar sales and partnerships. Ability to thrive in fast paced, entrepreneurial and ambiguous environments. Seek to consistently drive win-win relationships at all levels from C-Suite to field level. Experience with and strong networks within large multinational OEMs, small/medium-sized, (SMBs), System Integrators, VARs/IHV/ISVs and start-up companies. \n \nSpecialties: \nEnterprise Technology Solution Sales \nBusiness Development Hunter of \"New Logos\" \nStrategic Alliance Programs/Partner Strategy/Channel Development \nAccount Management \nExecutive Relationships \nTechnology Partnerships \nComplex/Technical Sales SOWs and Licensing Agreements \nField Sales Team Management/Development/Communications/Compensation Plans \nGlobal Content Creation/Channel Programs \nP&L Management/Financial Analysis and Processes \nValue Proposition Creation \nStrategic Vision and Implementation \nSelling Offshore, Onshore, and Near-Shore offerings \n \nHave experience in vertical markets including: \n \nCloud Computing- VMware, Oracle, Microsoft, and SAP \nMobile Technologies- iOS and Android \nEnterprise Solution Sales- HPC, ERP, EPM, BPM, SQL, Data Warehousing \nSaaS \nBig Data BI/Analytics \nSemiconductors \nIT Security- Firewalls, DR, BCP \nVARs/Systems Integrators \nIT Outsourced Managed Solutions  \nSalesforce.com/MS Dynamics/CRM Optimization \nQA Testing and Solutions \nMarketing Automation (Marketo, Act-On) \nUX/UI \nHigher Education \nMedia and Entertainment \nTelecommunications Infrastructure Solutions \nIntelligent Systems/IoT/Embedded Computing Technologies \nTelematics/In-vehicle Infotainment \n \n \n \n \nFluent in German Experienced, energetic consultative technology sales, marketing and alliance/channel program development leader with 20 years of experience selling and marketing enterprise software, SaaS, hardware, consulting services, embedded/IoT and mobile technologies/products. Highly personable and results driven with extensive global experience leading high-performing cross functional teams, exceeding quotas and driving/closing multimillion dollar sales and partnerships. Ability to thrive in fast paced, entrepreneurial and ambiguous environments. Seek to consistently drive win-win relationships at all levels from C-Suite to field level. Experience with and strong networks within large multinational OEMs, small/medium-sized, (SMBs), System Integrators, VARs/IHV/ISVs and start-up companies. \n \nSpecialties: \nEnterprise Technology Solution Sales \nBusiness Development Hunter of \"New Logos\" \nStrategic Alliance Programs/Partner Strategy/Channel Development \nAccount Management \nExecutive Relationships \nTechnology Partnerships \nComplex/Technical Sales SOWs and Licensing Agreements \nField Sales Team Management/Development/Communications/Compensation Plans \nGlobal Content Creation/Channel Programs \nP&L Management/Financial Analysis and Processes \nValue Proposition Creation \nStrategic Vision and Implementation \nSelling Offshore, Onshore, and Near-Shore offerings \n \nHave experience in vertical markets including: \n \nCloud Computing- VMware, Oracle, Microsoft, and SAP \nMobile Technologies- iOS and Android \nEnterprise Solution Sales- HPC, ERP, EPM, BPM, SQL, Data Warehousing \nSaaS \nBig Data BI/Analytics \nSemiconductors \nIT Security- Firewalls, DR, BCP \nVARs/Systems Integrators \nIT Outsourced Managed Solutions  \nSalesforce.com/MS Dynamics/CRM Optimization \nQA Testing and Solutions \nMarketing Automation (Marketo, Act-On) \nUX/UI \nHigher Education \nMedia and Entertainment \nTelecommunications Infrastructure Solutions \nIntelligent Systems/IoT/Embedded Computing Technologies \nTelematics/In-vehicle Infotainment \n \n \n \n \nFluent in German Experience Director of Business Development Experis March 2013  – Present (2 years 6 months) Portland, Oregon Area Consultative sales relationship developer/trusted advisor to CIO/CTO decision makers. Lead project business development activities with key accounts and new clients to uncover critical needs, create SOWs and solve their information technology/engineering challenges. Consistently exceeded quotas by over 25%. Focus areas include: developer solutions, mobile app development,high performance computing (HPC), cloud computing, IT security/firewalls, program management, outsourced managed solutions, technical/IT staff augmentation, global content solutions, infrastructure, data solutions, ERP/EPM/BPM, business intelligence and analytics and information security in a variety of vertical markets including enterprise, semiconductor, healthcare IT, education, media/entertainment, mobile, banking, retail, telecommunications, construction and industrial manufacturing. Principal Spectrums Consulting, LLC August 2008  – Present (7 years 1 month) Portland, Oregon Area Currently serve on an advisory board and work supporting start-up companies. Previously sold and delivered comprehensive consulting services to develop strategic alliance programs, increase revenues, develop marketing strategy, reduce costs and drive efficiency. Consistently increased year over year growth by 30%. Consulting practice areas included: strategic alliance program formation,mobile strategy, branding, B2B sales, M&A Strategy, financial analysis and planning, marketing automation, content development, cloud computing, program management, user interface (UI), user experience (UX), SEM, web analytics, licensing/contract negotiation, SaaS, storage, public/investor relations and customer development. Focus on companies in mobile, intelligent systems, server infrastructure, healthcare, education, media/entertainment markets. Director, Business Development, Media and Entertainment Digimarc March 2008  –  August 2008  (6 months) Beaverton, OR (Company Acquired) Responsible for business growth fo publicly held (Nasdaq:DMRC) SaaS software company. Target customers included companies in: global media, retail, entertainment and mobile OEMs. Responsible for contracts and closing of $5M annual revenue with Strategic Licensing Partners. Also had additional focus on Mobile Marketing Alliances and program management to influence mobile service providers and handset OEMs to adopt Digital Watermarking for Print-to-Web mobile commerce, DRM, brand security and anti-counterfeit solutions. Vice President of Business Development and Marketing Corvalent Corporation January 2007  –  March 2008  (1 year 3 months) Portland, Oregon Area Developed executive-level strategy and relationships with partner companies including Intel, Microsoft, and RadiSys to expand global revenue growth. Identified, developed and negotiated Strategic Alliance relationships to drive revenue growth for system integration company based on Intel Architecture solutions. \nResponsible for all business development, strategic alliance, product marketing and sales strategy to increase global footprint and exceed design win revenue quotas. Vertical markets included enterprise, semiconductor, energy, in-vehicle infotainment, transportation, industrial automation, defense and banking. \nServed as company spokesperson. Senior Marketing Manager Intel Corporation July 2005  –  December 2006  (1 year 6 months) Hillsboro, Oregon Worked on the Industry Leadership Programs and Trademark and Branding Team with the Sales and Marketing Group to drive overall success of Intel's Technology Leadership, multi-channel marketing to global external and internal audiences. Served as executive and Fellows liaison and drove global joint selling with Intel Field Sales teams resulting in design win activity exceeding $300 million. Partner/Alliance joint selling facilitation, global branding, marketing plan development, P&L accountability, advertising agency interface and partner co-marketing were key responsibilities of this position. Strategic Alliance Manager Intel Corporation January 2000  –  July 2005  (5 years 7 months) Chandler, Arizona Co-founded Intel Communications Alliance to increase revenues and technical alignment with a global channel of Intel system integrators, ISVs and VARs. (Currently known as the Intelligent Systems Alliance (ISA) and has grown to an over $1 billion channel for Intel) Collaborated extensively with OEM partners such as Microsoft, Cisco and Oracle and others to drive sales strategy alignment for joint selling revenues. \nProvided Strategic Alliance management of key Premier level companies in Motorola, Fujitsu-Siemens and RadiSys as part of the alliance program that drove over $60 million in revenue annually for Intel selling into companies such as Cisco, Nortel, Boeing, Diebold and others. Responsible for joint selling initiatives, technical road-map presentations, architectural alignment, joint marketing, and program management to drive new design wins based on Intel Architecture. Director of National Sales and Marketing SeminarSource.com February 1998  –  December 1999  (1 year 11 months) Greater San Diego Area Director of National Sales and Marketing for this SaaS internet start-up serving corporate, medical and legal organizations with streaming audio, video, e-commerce and distance learning SaaS solutions company. Directed a team of eight individuals and led sales, marketing campaigns, collateral development. Director of Business Development Experis March 2013  – Present (2 years 6 months) Portland, Oregon Area Consultative sales relationship developer/trusted advisor to CIO/CTO decision makers. Lead project business development activities with key accounts and new clients to uncover critical needs, create SOWs and solve their information technology/engineering challenges. Consistently exceeded quotas by over 25%. Focus areas include: developer solutions, mobile app development,high performance computing (HPC), cloud computing, IT security/firewalls, program management, outsourced managed solutions, technical/IT staff augmentation, global content solutions, infrastructure, data solutions, ERP/EPM/BPM, business intelligence and analytics and information security in a variety of vertical markets including enterprise, semiconductor, healthcare IT, education, media/entertainment, mobile, banking, retail, telecommunications, construction and industrial manufacturing. Director of Business Development Experis March 2013  – Present (2 years 6 months) Portland, Oregon Area Consultative sales relationship developer/trusted advisor to CIO/CTO decision makers. Lead project business development activities with key accounts and new clients to uncover critical needs, create SOWs and solve their information technology/engineering challenges. Consistently exceeded quotas by over 25%. Focus areas include: developer solutions, mobile app development,high performance computing (HPC), cloud computing, IT security/firewalls, program management, outsourced managed solutions, technical/IT staff augmentation, global content solutions, infrastructure, data solutions, ERP/EPM/BPM, business intelligence and analytics and information security in a variety of vertical markets including enterprise, semiconductor, healthcare IT, education, media/entertainment, mobile, banking, retail, telecommunications, construction and industrial manufacturing. Principal Spectrums Consulting, LLC August 2008  – Present (7 years 1 month) Portland, Oregon Area Currently serve on an advisory board and work supporting start-up companies. Previously sold and delivered comprehensive consulting services to develop strategic alliance programs, increase revenues, develop marketing strategy, reduce costs and drive efficiency. Consistently increased year over year growth by 30%. Consulting practice areas included: strategic alliance program formation,mobile strategy, branding, B2B sales, M&A Strategy, financial analysis and planning, marketing automation, content development, cloud computing, program management, user interface (UI), user experience (UX), SEM, web analytics, licensing/contract negotiation, SaaS, storage, public/investor relations and customer development. Focus on companies in mobile, intelligent systems, server infrastructure, healthcare, education, media/entertainment markets. Principal Spectrums Consulting, LLC August 2008  – Present (7 years 1 month) Portland, Oregon Area Currently serve on an advisory board and work supporting start-up companies. Previously sold and delivered comprehensive consulting services to develop strategic alliance programs, increase revenues, develop marketing strategy, reduce costs and drive efficiency. Consistently increased year over year growth by 30%. Consulting practice areas included: strategic alliance program formation,mobile strategy, branding, B2B sales, M&A Strategy, financial analysis and planning, marketing automation, content development, cloud computing, program management, user interface (UI), user experience (UX), SEM, web analytics, licensing/contract negotiation, SaaS, storage, public/investor relations and customer development. Focus on companies in mobile, intelligent systems, server infrastructure, healthcare, education, media/entertainment markets. Director, Business Development, Media and Entertainment Digimarc March 2008  –  August 2008  (6 months) Beaverton, OR (Company Acquired) Responsible for business growth fo publicly held (Nasdaq:DMRC) SaaS software company. Target customers included companies in: global media, retail, entertainment and mobile OEMs. Responsible for contracts and closing of $5M annual revenue with Strategic Licensing Partners. Also had additional focus on Mobile Marketing Alliances and program management to influence mobile service providers and handset OEMs to adopt Digital Watermarking for Print-to-Web mobile commerce, DRM, brand security and anti-counterfeit solutions. Director, Business Development, Media and Entertainment Digimarc March 2008  –  August 2008  (6 months) Beaverton, OR (Company Acquired) Responsible for business growth fo publicly held (Nasdaq:DMRC) SaaS software company. Target customers included companies in: global media, retail, entertainment and mobile OEMs. Responsible for contracts and closing of $5M annual revenue with Strategic Licensing Partners. Also had additional focus on Mobile Marketing Alliances and program management to influence mobile service providers and handset OEMs to adopt Digital Watermarking for Print-to-Web mobile commerce, DRM, brand security and anti-counterfeit solutions. Vice President of Business Development and Marketing Corvalent Corporation January 2007  –  March 2008  (1 year 3 months) Portland, Oregon Area Developed executive-level strategy and relationships with partner companies including Intel, Microsoft, and RadiSys to expand global revenue growth. Identified, developed and negotiated Strategic Alliance relationships to drive revenue growth for system integration company based on Intel Architecture solutions. \nResponsible for all business development, strategic alliance, product marketing and sales strategy to increase global footprint and exceed design win revenue quotas. Vertical markets included enterprise, semiconductor, energy, in-vehicle infotainment, transportation, industrial automation, defense and banking. \nServed as company spokesperson. Vice President of Business Development and Marketing Corvalent Corporation January 2007  –  March 2008  (1 year 3 months) Portland, Oregon Area Developed executive-level strategy and relationships with partner companies including Intel, Microsoft, and RadiSys to expand global revenue growth. Identified, developed and negotiated Strategic Alliance relationships to drive revenue growth for system integration company based on Intel Architecture solutions. \nResponsible for all business development, strategic alliance, product marketing and sales strategy to increase global footprint and exceed design win revenue quotas. Vertical markets included enterprise, semiconductor, energy, in-vehicle infotainment, transportation, industrial automation, defense and banking. \nServed as company spokesperson. Senior Marketing Manager Intel Corporation July 2005  –  December 2006  (1 year 6 months) Hillsboro, Oregon Worked on the Industry Leadership Programs and Trademark and Branding Team with the Sales and Marketing Group to drive overall success of Intel's Technology Leadership, multi-channel marketing to global external and internal audiences. Served as executive and Fellows liaison and drove global joint selling with Intel Field Sales teams resulting in design win activity exceeding $300 million. Partner/Alliance joint selling facilitation, global branding, marketing plan development, P&L accountability, advertising agency interface and partner co-marketing were key responsibilities of this position. Senior Marketing Manager Intel Corporation July 2005  –  December 2006  (1 year 6 months) Hillsboro, Oregon Worked on the Industry Leadership Programs and Trademark and Branding Team with the Sales and Marketing Group to drive overall success of Intel's Technology Leadership, multi-channel marketing to global external and internal audiences. Served as executive and Fellows liaison and drove global joint selling with Intel Field Sales teams resulting in design win activity exceeding $300 million. Partner/Alliance joint selling facilitation, global branding, marketing plan development, P&L accountability, advertising agency interface and partner co-marketing were key responsibilities of this position. Strategic Alliance Manager Intel Corporation January 2000  –  July 2005  (5 years 7 months) Chandler, Arizona Co-founded Intel Communications Alliance to increase revenues and technical alignment with a global channel of Intel system integrators, ISVs and VARs. (Currently known as the Intelligent Systems Alliance (ISA) and has grown to an over $1 billion channel for Intel) Collaborated extensively with OEM partners such as Microsoft, Cisco and Oracle and others to drive sales strategy alignment for joint selling revenues. \nProvided Strategic Alliance management of key Premier level companies in Motorola, Fujitsu-Siemens and RadiSys as part of the alliance program that drove over $60 million in revenue annually for Intel selling into companies such as Cisco, Nortel, Boeing, Diebold and others. Responsible for joint selling initiatives, technical road-map presentations, architectural alignment, joint marketing, and program management to drive new design wins based on Intel Architecture. Strategic Alliance Manager Intel Corporation January 2000  –  July 2005  (5 years 7 months) Chandler, Arizona Co-founded Intel Communications Alliance to increase revenues and technical alignment with a global channel of Intel system integrators, ISVs and VARs. (Currently known as the Intelligent Systems Alliance (ISA) and has grown to an over $1 billion channel for Intel) Collaborated extensively with OEM partners such as Microsoft, Cisco and Oracle and others to drive sales strategy alignment for joint selling revenues. \nProvided Strategic Alliance management of key Premier level companies in Motorola, Fujitsu-Siemens and RadiSys as part of the alliance program that drove over $60 million in revenue annually for Intel selling into companies such as Cisco, Nortel, Boeing, Diebold and others. Responsible for joint selling initiatives, technical road-map presentations, architectural alignment, joint marketing, and program management to drive new design wins based on Intel Architecture. Director of National Sales and Marketing SeminarSource.com February 1998  –  December 1999  (1 year 11 months) Greater San Diego Area Director of National Sales and Marketing for this SaaS internet start-up serving corporate, medical and legal organizations with streaming audio, video, e-commerce and distance learning SaaS solutions company. Directed a team of eight individuals and led sales, marketing campaigns, collateral development. Director of National Sales and Marketing SeminarSource.com February 1998  –  December 1999  (1 year 11 months) Greater San Diego Area Director of National Sales and Marketing for this SaaS internet start-up serving corporate, medical and legal organizations with streaming audio, video, e-commerce and distance learning SaaS solutions company. Directed a team of eight individuals and led sales, marketing campaigns, collateral development. Languages German German German Skills Solution Selling Product Marketing Business Alliances Program Management Go-to-market Strategy SaaS Strategic Partnerships Start-ups Strategy Leadership New Business Development Management Strategic Alliances Global Business... Analytics Licensing Agreements Marketing Strategy Business Intelligence Sales Management Outsourcing Product Management Marketing Management Integration Sales Operations Channel Partners P&L Management B2B Consulting Mobile Applications Ecosystem Development Channel Management Embedded Solutions Marketing Team Management Digital Marketing Solutions Marketing Competitive Analysis Mentoring Strategic Planning Salesforce.com Retail Systems Mobile Solutions Team Motivator Cloud Computing IaaS PaaS Field Marketing Sales Funnel... Consultative Sales... RFP Business Strategy See 35+     See less Skills  Solution Selling Product Marketing Business Alliances Program Management Go-to-market Strategy SaaS Strategic Partnerships Start-ups Strategy Leadership New Business Development Management Strategic Alliances Global Business... Analytics Licensing Agreements Marketing Strategy Business Intelligence Sales Management Outsourcing Product Management Marketing Management Integration Sales Operations Channel Partners P&L Management B2B Consulting Mobile Applications Ecosystem Development Channel Management Embedded Solutions Marketing Team Management Digital Marketing Solutions Marketing Competitive Analysis Mentoring Strategic Planning Salesforce.com Retail Systems Mobile Solutions Team Motivator Cloud Computing IaaS PaaS Field Marketing Sales Funnel... Consultative Sales... RFP Business Strategy See 35+     See less Solution Selling Product Marketing Business Alliances Program Management Go-to-market Strategy SaaS Strategic Partnerships Start-ups Strategy Leadership New Business Development Management Strategic Alliances Global Business... Analytics Licensing Agreements Marketing Strategy Business Intelligence Sales Management Outsourcing Product Management Marketing Management Integration Sales Operations Channel Partners P&L Management B2B Consulting Mobile Applications Ecosystem Development Channel Management Embedded Solutions Marketing Team Management Digital Marketing Solutions Marketing Competitive Analysis Mentoring Strategic Planning Salesforce.com Retail Systems Mobile Solutions Team Motivator Cloud Computing IaaS PaaS Field Marketing Sales Funnel... Consultative Sales... RFP Business Strategy See 35+     See less Solution Selling Product Marketing Business Alliances Program Management Go-to-market Strategy SaaS Strategic Partnerships Start-ups Strategy Leadership New Business Development Management Strategic Alliances Global Business... Analytics Licensing Agreements Marketing Strategy Business Intelligence Sales Management Outsourcing Product Management Marketing Management Integration Sales Operations Channel Partners P&L Management B2B Consulting Mobile Applications Ecosystem Development Channel Management Embedded Solutions Marketing Team Management Digital Marketing Solutions Marketing Competitive Analysis Mentoring Strategic Planning Salesforce.com Retail Systems Mobile Solutions Team Motivator Cloud Computing IaaS PaaS Field Marketing Sales Funnel... Consultative Sales... RFP Business Strategy See 35+     See less Education University of Phoenix Master’s Degree,  Organizational Management 1996  – 1998 California State Polytechnic University-Pomona Bachelor of Science (B.S.),  Business Administration 1985  – 1988 Activities and Societies:  Sigma Chi Fraternity ,  Active in Charitable events Homestead High School University of Phoenix Master’s Degree,  Organizational Management 1996  – 1998 University of Phoenix Master’s Degree,  Organizational Management 1996  – 1998 University of Phoenix Master’s Degree,  Organizational Management 1996  – 1998 California State Polytechnic University-Pomona Bachelor of Science (B.S.),  Business Administration 1985  – 1988 Activities and Societies:  Sigma Chi Fraternity ,  Active in Charitable events California State Polytechnic University-Pomona Bachelor of Science (B.S.),  Business Administration 1985  – 1988 Activities and Societies:  Sigma Chi Fraternity ,  Active in Charitable events California State Polytechnic University-Pomona Bachelor of Science (B.S.),  Business Administration 1985  – 1988 Activities and Societies:  Sigma Chi Fraternity ,  Active in Charitable events Homestead High School Homestead High School Homestead High School Honors & Awards Networker of the Year Lake Oswego Chamber of Commerce and the Lake Oswego Review Newspaper March 2013 Networker of the Year award voted on by the business community of Lake Oswego, Oregon awarded at Oswego Lake Country Club, March 8, 2013 Additional Honors & Awards Divisional Recognition Award, Intel Corporation, Embedded Intel Architecture Division \nGroup Recognition Award, Intel Corporation, Digital Health Group \nTeam Award, Intel Corporation, Industry Leadership Programs Networker of the Year Lake Oswego Chamber of Commerce and the Lake Oswego Review Newspaper March 2013 Networker of the Year award voted on by the business community of Lake Oswego, Oregon awarded at Oswego Lake Country Club, March 8, 2013 Networker of the Year Lake Oswego Chamber of Commerce and the Lake Oswego Review Newspaper March 2013 Networker of the Year award voted on by the business community of Lake Oswego, Oregon awarded at Oswego Lake Country Club, March 8, 2013 Networker of the Year Lake Oswego Chamber of Commerce and the Lake Oswego Review Newspaper March 2013 Networker of the Year award voted on by the business community of Lake Oswego, Oregon awarded at Oswego Lake Country Club, March 8, 2013 Additional Honors & Awards Divisional Recognition Award, Intel Corporation, Embedded Intel Architecture Division \nGroup Recognition Award, Intel Corporation, Digital Health Group \nTeam Award, Intel Corporation, Industry Leadership Programs Additional Honors & Awards Divisional Recognition Award, Intel Corporation, Embedded Intel Architecture Division \nGroup Recognition Award, Intel Corporation, Digital Health Group \nTeam Award, Intel Corporation, Industry Leadership Programs Additional Honors & Awards Divisional Recognition Award, Intel Corporation, Embedded Intel Architecture Division \nGroup Recognition Award, Intel Corporation, Digital Health Group \nTeam Award, Intel Corporation, Industry Leadership Programs ", "Summary 20+ years of leadership in business operations and program management, product marketing and corporate finance. Currently managing NPI Business Operations team responsible for product ramps and life cycle management of Qualcomm baseband (MSM), RF and peripheral chipset products. Product and Customer Program Manager during launch of Centrino’s Wi-Fi component for Centrino Mobile Technology. Proven ability to leverage various program management, marketing, finance and operations experiences coupled with an MBA education to effectively manage technical, complex, multi-national development and post-launch programs. \n \nSpecialties: Sales Operations, Product Marketing, Customer Management, Program Management, Strategic Partnerships, Project Management, Operations and Supplier Management, Finance Summary 20+ years of leadership in business operations and program management, product marketing and corporate finance. Currently managing NPI Business Operations team responsible for product ramps and life cycle management of Qualcomm baseband (MSM), RF and peripheral chipset products. Product and Customer Program Manager during launch of Centrino’s Wi-Fi component for Centrino Mobile Technology. Proven ability to leverage various program management, marketing, finance and operations experiences coupled with an MBA education to effectively manage technical, complex, multi-national development and post-launch programs. \n \nSpecialties: Sales Operations, Product Marketing, Customer Management, Program Management, Strategic Partnerships, Project Management, Operations and Supplier Management, Finance 20+ years of leadership in business operations and program management, product marketing and corporate finance. Currently managing NPI Business Operations team responsible for product ramps and life cycle management of Qualcomm baseband (MSM), RF and peripheral chipset products. Product and Customer Program Manager during launch of Centrino’s Wi-Fi component for Centrino Mobile Technology. Proven ability to leverage various program management, marketing, finance and operations experiences coupled with an MBA education to effectively manage technical, complex, multi-national development and post-launch programs. \n \nSpecialties: Sales Operations, Product Marketing, Customer Management, Program Management, Strategic Partnerships, Project Management, Operations and Supplier Management, Finance 20+ years of leadership in business operations and program management, product marketing and corporate finance. Currently managing NPI Business Operations team responsible for product ramps and life cycle management of Qualcomm baseband (MSM), RF and peripheral chipset products. Product and Customer Program Manager during launch of Centrino’s Wi-Fi component for Centrino Mobile Technology. Proven ability to leverage various program management, marketing, finance and operations experiences coupled with an MBA education to effectively manage technical, complex, multi-national development and post-launch programs. \n \nSpecialties: Sales Operations, Product Marketing, Customer Management, Program Management, Strategic Partnerships, Project Management, Operations and Supplier Management, Finance Experience Manager, QCT Sales Operations Qualcomm 2008  – Present (7 years) Greater San Diego Area Director, Programs Powercast Corporation 2007  –  2008  (1 year) Greater San Diego Area - Program Managed Powercast’s first ever revenue product with on-time release under tight constraints while coordinating external requirements and deliveries between partners and end customer.  \n- Created product launch processes and product quality standards for future product releases.  \n- Developed and led wireless power demo development plan for CES2008 by leading multi-site effort. Successful showing at CES helped enable 2nd round of funding. Senior Marketing Manager Toshiba America Electronic Components 2006  –  2007  (1 year) Orange County, California Area Managed TAEC Power Semiconductor business in the Americas with P&L and marketing ownership by actively promoting products directly to customers and by managing a network of sales reps and distributors. \n- Directed and managed the Power Semiconductor Business Development Team in growing market segment share. \n- Monitored and managed the development of business plans, product lifecycles, Marcom, Trade shows, and positioning of Toshiba’s Power Discrete products within the industry base. \nProduct release announcements included: \nhttp://www.eetasia.com/ART_8800438807_1034362_NP_26843abf.HTM \nhttp://www.toshiba.com/taec/news/press_releases/2007/powr_07_465.jsp Senior Marketing Manager Intel Corporation - Server Platform Group 2005  –  2006  (1 year) Orange County, California Area Managed Itanium and Xeon Chipset products for 2008-2011. Managed OEM customer relationships for server product team. Responsibilities included single point of contact for all product related Xeon MP and Itanium product questions/issues and synchronized on OEM designs plans to guide time to market platform launches. \n- Calibrated with top Itanium OEM design teams and drove design changes into 2008 chipset that resulted in several new chipset design wins, thereby doubling expected market share over current Itanium chipset. \n- Partnered with platform planning and chipset architects to influence next generation Xeon Chipset design features based on customer knowledge, competitive landscape and industry trends meeting OEM expectations. Strategic Alliances Manager Gateway 2004  –  2005  (1 year) Orange County, California Area Managed strategic alliances with key suppliers (Intel, Microsoft, ATI) and partners (Google, Napster) to develop joint marketing programs, enforce MDA/MDF compliance and ensure maximum funding and rebate opportunities. \n- Owned strategic partnership with Intel including strategic funding, marketing programs, Intel Inside compliance, and alliance programs which optimize over $40M annual in funding/rebates and joint marketing. \n- Investigated, analyzed and recommended strategic partnership with search engines partners for Gateway pre-installs and incremental bounty generation opportunities which led to lucrative alliance with Google. Marketing Program Manager Intel Corporation - Wireless Network Group 2003  –  2004  (1 year) Greater San Diego Area Product Marketing Manager for Centrino Wireless Mini-PCI and PROset wireless configuration software. Executed ramp of Centrino 802.11bg wireless product line and managed enhanced PROset software update for product line. Managed Tier-1 OEM customer base in North America and APAC including Dell, HP, Gateway, Acer and Samsung for 802.11b product line. \n- Recognized for innovative restructuring of 802.11b software point release program by partnering with program management to deliver production version ahead of plan and meet top customer’s aggressive launch date. \n- Successfully planned and managed several major hardware modifications to revenue products across all Centrino OEMs utilizing proactive customer letters, quality data, samples distribution and SKU management. \n- Co-created and presented Centrino wireless product roadmap plans to customer management teams and drove feedback to internal development teams to influence product planning and drive strategic release cycles. Operations Program Manager Intel Corporation - Intel Communications Group 2000  –  2003  (3 years) Greater San Diego Area Managed local operations team in the development, validation, implementation and production of Intel NetStructure Load Balancer hardware platform. Managed contract manufacturers to ensure on time fulfillment. \n- Overcame various roadblocks and pulled in schedule to support launch of eight SKUs on time within a one-month span and over 20 SKUs for Intel and OEMs. Oversaw doubling of system volumes in one year. \n- Partnered with OEM customers to project manage customization efforts based on RFQ requirements for Load Balancer product line. Effectively managed operations team to successfully launch customized products for tier-1 customer, meeting launch schedules during dot.com ramp under aggressive deadlines. Senior Business Analyst Intel Corporation, Logistics Systems and Programs 1999  –  2000  (1 year) Phoenix, Arizona Area Managed product lifecycles of several internal shipping systems by driving customer requirements from various Intel sites and support groups. Project managed programmers, validation and training teams as well as implemented software and trained on-site at U.S, Ireland, Israel, and Puerto Rico logistics sites. \n- Project lead for Logistic Systems Support of Intel’s On-line Retail Center (ORC). Selected as key member of the outsourcing team for vendor evaluation of tier-1 electronics distributors in support of ORC ramp-up. \n- Facilitated functional design of a new tracking system, which partnered with an outside vendor. Coordinated analysis and resolution of gaps between Intel and vendor, created success metrics for implementation and co-wrote functional spec on internal system integration. Senior Financial Analyst Intel Corporation, Assembly/Test Manufacturing 1995  –  1999  (4 years) Phoenix, Arizona Area Performed ROI/NPV analyses within Intel’s international factory network, which concluded with recommendations to senior management. Analyzed over $250M of opportunities and influenced implementation of projects that were expected to save Intel over $45M through four years. Served as group consolidator for Intel's SPG group from 1995-1997. \n- Lead analyst in which radical cost reduction activity was evaluated for CPU products. Utilized multi-national cost team for standardizing financial cost methods for new manufacturing process and implemented over $100M in cost-cutting projects across four production sites. \n- Received Divisional Recognition Award for results in defining, developing and implementing a cross-functional team focused on equipment spares manufacturing, engineering and materials management. Resulted in reducing Spares Days of Inventory from 350 to 139 days and saved over $20.5M. \n- Consolidated and analyzed financial data for $2B business unit. Results were presented to Group Controller and General Manager for strategic decision-making and for updates to Intel CFO and CEO. \n- Recognition award from senior marketing manager for financial analysis of marketing web technical documentation program which saved Intel an estimated $500K. Financial Analyst/Project Coordinator AT&T / Lucent Technologies 1992  –  1995  (3 years) Greater New York City Area - Coordinated successful implementation of new telecommunications service bill verification process for large businesses between billing system analysts, project managers, and bill verification line group. \n- Budgeted, planned, and analyzed financial data and results for Chief Information Officer Organization ($200M annual budget) and presented data with spending recommendations to management. \n- Streamlined close analysis process by developing paperless process of converting raw data to analysis models. The new method reduced monthly close process time by 3 to 4 hours per person. \n- Member of AT&T Professional Development Program Manager, QCT Sales Operations Qualcomm 2008  – Present (7 years) Greater San Diego Area Manager, QCT Sales Operations Qualcomm 2008  – Present (7 years) Greater San Diego Area Director, Programs Powercast Corporation 2007  –  2008  (1 year) Greater San Diego Area - Program Managed Powercast’s first ever revenue product with on-time release under tight constraints while coordinating external requirements and deliveries between partners and end customer.  \n- Created product launch processes and product quality standards for future product releases.  \n- Developed and led wireless power demo development plan for CES2008 by leading multi-site effort. Successful showing at CES helped enable 2nd round of funding. Director, Programs Powercast Corporation 2007  –  2008  (1 year) Greater San Diego Area - Program Managed Powercast’s first ever revenue product with on-time release under tight constraints while coordinating external requirements and deliveries between partners and end customer.  \n- Created product launch processes and product quality standards for future product releases.  \n- Developed and led wireless power demo development plan for CES2008 by leading multi-site effort. Successful showing at CES helped enable 2nd round of funding. Senior Marketing Manager Toshiba America Electronic Components 2006  –  2007  (1 year) Orange County, California Area Managed TAEC Power Semiconductor business in the Americas with P&L and marketing ownership by actively promoting products directly to customers and by managing a network of sales reps and distributors. \n- Directed and managed the Power Semiconductor Business Development Team in growing market segment share. \n- Monitored and managed the development of business plans, product lifecycles, Marcom, Trade shows, and positioning of Toshiba’s Power Discrete products within the industry base. \nProduct release announcements included: \nhttp://www.eetasia.com/ART_8800438807_1034362_NP_26843abf.HTM \nhttp://www.toshiba.com/taec/news/press_releases/2007/powr_07_465.jsp Senior Marketing Manager Toshiba America Electronic Components 2006  –  2007  (1 year) Orange County, California Area Managed TAEC Power Semiconductor business in the Americas with P&L and marketing ownership by actively promoting products directly to customers and by managing a network of sales reps and distributors. \n- Directed and managed the Power Semiconductor Business Development Team in growing market segment share. \n- Monitored and managed the development of business plans, product lifecycles, Marcom, Trade shows, and positioning of Toshiba’s Power Discrete products within the industry base. \nProduct release announcements included: \nhttp://www.eetasia.com/ART_8800438807_1034362_NP_26843abf.HTM \nhttp://www.toshiba.com/taec/news/press_releases/2007/powr_07_465.jsp Senior Marketing Manager Intel Corporation - Server Platform Group 2005  –  2006  (1 year) Orange County, California Area Managed Itanium and Xeon Chipset products for 2008-2011. Managed OEM customer relationships for server product team. Responsibilities included single point of contact for all product related Xeon MP and Itanium product questions/issues and synchronized on OEM designs plans to guide time to market platform launches. \n- Calibrated with top Itanium OEM design teams and drove design changes into 2008 chipset that resulted in several new chipset design wins, thereby doubling expected market share over current Itanium chipset. \n- Partnered with platform planning and chipset architects to influence next generation Xeon Chipset design features based on customer knowledge, competitive landscape and industry trends meeting OEM expectations. Senior Marketing Manager Intel Corporation - Server Platform Group 2005  –  2006  (1 year) Orange County, California Area Managed Itanium and Xeon Chipset products for 2008-2011. Managed OEM customer relationships for server product team. Responsibilities included single point of contact for all product related Xeon MP and Itanium product questions/issues and synchronized on OEM designs plans to guide time to market platform launches. \n- Calibrated with top Itanium OEM design teams and drove design changes into 2008 chipset that resulted in several new chipset design wins, thereby doubling expected market share over current Itanium chipset. \n- Partnered with platform planning and chipset architects to influence next generation Xeon Chipset design features based on customer knowledge, competitive landscape and industry trends meeting OEM expectations. Strategic Alliances Manager Gateway 2004  –  2005  (1 year) Orange County, California Area Managed strategic alliances with key suppliers (Intel, Microsoft, ATI) and partners (Google, Napster) to develop joint marketing programs, enforce MDA/MDF compliance and ensure maximum funding and rebate opportunities. \n- Owned strategic partnership with Intel including strategic funding, marketing programs, Intel Inside compliance, and alliance programs which optimize over $40M annual in funding/rebates and joint marketing. \n- Investigated, analyzed and recommended strategic partnership with search engines partners for Gateway pre-installs and incremental bounty generation opportunities which led to lucrative alliance with Google. Strategic Alliances Manager Gateway 2004  –  2005  (1 year) Orange County, California Area Managed strategic alliances with key suppliers (Intel, Microsoft, ATI) and partners (Google, Napster) to develop joint marketing programs, enforce MDA/MDF compliance and ensure maximum funding and rebate opportunities. \n- Owned strategic partnership with Intel including strategic funding, marketing programs, Intel Inside compliance, and alliance programs which optimize over $40M annual in funding/rebates and joint marketing. \n- Investigated, analyzed and recommended strategic partnership with search engines partners for Gateway pre-installs and incremental bounty generation opportunities which led to lucrative alliance with Google. Marketing Program Manager Intel Corporation - Wireless Network Group 2003  –  2004  (1 year) Greater San Diego Area Product Marketing Manager for Centrino Wireless Mini-PCI and PROset wireless configuration software. Executed ramp of Centrino 802.11bg wireless product line and managed enhanced PROset software update for product line. Managed Tier-1 OEM customer base in North America and APAC including Dell, HP, Gateway, Acer and Samsung for 802.11b product line. \n- Recognized for innovative restructuring of 802.11b software point release program by partnering with program management to deliver production version ahead of plan and meet top customer’s aggressive launch date. \n- Successfully planned and managed several major hardware modifications to revenue products across all Centrino OEMs utilizing proactive customer letters, quality data, samples distribution and SKU management. \n- Co-created and presented Centrino wireless product roadmap plans to customer management teams and drove feedback to internal development teams to influence product planning and drive strategic release cycles. Marketing Program Manager Intel Corporation - Wireless Network Group 2003  –  2004  (1 year) Greater San Diego Area Product Marketing Manager for Centrino Wireless Mini-PCI and PROset wireless configuration software. Executed ramp of Centrino 802.11bg wireless product line and managed enhanced PROset software update for product line. Managed Tier-1 OEM customer base in North America and APAC including Dell, HP, Gateway, Acer and Samsung for 802.11b product line. \n- Recognized for innovative restructuring of 802.11b software point release program by partnering with program management to deliver production version ahead of plan and meet top customer’s aggressive launch date. \n- Successfully planned and managed several major hardware modifications to revenue products across all Centrino OEMs utilizing proactive customer letters, quality data, samples distribution and SKU management. \n- Co-created and presented Centrino wireless product roadmap plans to customer management teams and drove feedback to internal development teams to influence product planning and drive strategic release cycles. Operations Program Manager Intel Corporation - Intel Communications Group 2000  –  2003  (3 years) Greater San Diego Area Managed local operations team in the development, validation, implementation and production of Intel NetStructure Load Balancer hardware platform. Managed contract manufacturers to ensure on time fulfillment. \n- Overcame various roadblocks and pulled in schedule to support launch of eight SKUs on time within a one-month span and over 20 SKUs for Intel and OEMs. Oversaw doubling of system volumes in one year. \n- Partnered with OEM customers to project manage customization efforts based on RFQ requirements for Load Balancer product line. Effectively managed operations team to successfully launch customized products for tier-1 customer, meeting launch schedules during dot.com ramp under aggressive deadlines. Operations Program Manager Intel Corporation - Intel Communications Group 2000  –  2003  (3 years) Greater San Diego Area Managed local operations team in the development, validation, implementation and production of Intel NetStructure Load Balancer hardware platform. Managed contract manufacturers to ensure on time fulfillment. \n- Overcame various roadblocks and pulled in schedule to support launch of eight SKUs on time within a one-month span and over 20 SKUs for Intel and OEMs. Oversaw doubling of system volumes in one year. \n- Partnered with OEM customers to project manage customization efforts based on RFQ requirements for Load Balancer product line. Effectively managed operations team to successfully launch customized products for tier-1 customer, meeting launch schedules during dot.com ramp under aggressive deadlines. Senior Business Analyst Intel Corporation, Logistics Systems and Programs 1999  –  2000  (1 year) Phoenix, Arizona Area Managed product lifecycles of several internal shipping systems by driving customer requirements from various Intel sites and support groups. Project managed programmers, validation and training teams as well as implemented software and trained on-site at U.S, Ireland, Israel, and Puerto Rico logistics sites. \n- Project lead for Logistic Systems Support of Intel’s On-line Retail Center (ORC). Selected as key member of the outsourcing team for vendor evaluation of tier-1 electronics distributors in support of ORC ramp-up. \n- Facilitated functional design of a new tracking system, which partnered with an outside vendor. Coordinated analysis and resolution of gaps between Intel and vendor, created success metrics for implementation and co-wrote functional spec on internal system integration. Senior Business Analyst Intel Corporation, Logistics Systems and Programs 1999  –  2000  (1 year) Phoenix, Arizona Area Managed product lifecycles of several internal shipping systems by driving customer requirements from various Intel sites and support groups. Project managed programmers, validation and training teams as well as implemented software and trained on-site at U.S, Ireland, Israel, and Puerto Rico logistics sites. \n- Project lead for Logistic Systems Support of Intel’s On-line Retail Center (ORC). Selected as key member of the outsourcing team for vendor evaluation of tier-1 electronics distributors in support of ORC ramp-up. \n- Facilitated functional design of a new tracking system, which partnered with an outside vendor. Coordinated analysis and resolution of gaps between Intel and vendor, created success metrics for implementation and co-wrote functional spec on internal system integration. Senior Financial Analyst Intel Corporation, Assembly/Test Manufacturing 1995  –  1999  (4 years) Phoenix, Arizona Area Performed ROI/NPV analyses within Intel’s international factory network, which concluded with recommendations to senior management. Analyzed over $250M of opportunities and influenced implementation of projects that were expected to save Intel over $45M through four years. Served as group consolidator for Intel's SPG group from 1995-1997. \n- Lead analyst in which radical cost reduction activity was evaluated for CPU products. Utilized multi-national cost team for standardizing financial cost methods for new manufacturing process and implemented over $100M in cost-cutting projects across four production sites. \n- Received Divisional Recognition Award for results in defining, developing and implementing a cross-functional team focused on equipment spares manufacturing, engineering and materials management. Resulted in reducing Spares Days of Inventory from 350 to 139 days and saved over $20.5M. \n- Consolidated and analyzed financial data for $2B business unit. Results were presented to Group Controller and General Manager for strategic decision-making and for updates to Intel CFO and CEO. \n- Recognition award from senior marketing manager for financial analysis of marketing web technical documentation program which saved Intel an estimated $500K. Senior Financial Analyst Intel Corporation, Assembly/Test Manufacturing 1995  –  1999  (4 years) Phoenix, Arizona Area Performed ROI/NPV analyses within Intel’s international factory network, which concluded with recommendations to senior management. Analyzed over $250M of opportunities and influenced implementation of projects that were expected to save Intel over $45M through four years. Served as group consolidator for Intel's SPG group from 1995-1997. \n- Lead analyst in which radical cost reduction activity was evaluated for CPU products. Utilized multi-national cost team for standardizing financial cost methods for new manufacturing process and implemented over $100M in cost-cutting projects across four production sites. \n- Received Divisional Recognition Award for results in defining, developing and implementing a cross-functional team focused on equipment spares manufacturing, engineering and materials management. Resulted in reducing Spares Days of Inventory from 350 to 139 days and saved over $20.5M. \n- Consolidated and analyzed financial data for $2B business unit. Results were presented to Group Controller and General Manager for strategic decision-making and for updates to Intel CFO and CEO. \n- Recognition award from senior marketing manager for financial analysis of marketing web technical documentation program which saved Intel an estimated $500K. Financial Analyst/Project Coordinator AT&T / Lucent Technologies 1992  –  1995  (3 years) Greater New York City Area - Coordinated successful implementation of new telecommunications service bill verification process for large businesses between billing system analysts, project managers, and bill verification line group. \n- Budgeted, planned, and analyzed financial data and results for Chief Information Officer Organization ($200M annual budget) and presented data with spending recommendations to management. \n- Streamlined close analysis process by developing paperless process of converting raw data to analysis models. The new method reduced monthly close process time by 3 to 4 hours per person. \n- Member of AT&T Professional Development Program Financial Analyst/Project Coordinator AT&T / Lucent Technologies 1992  –  1995  (3 years) Greater New York City Area - Coordinated successful implementation of new telecommunications service bill verification process for large businesses between billing system analysts, project managers, and bill verification line group. \n- Budgeted, planned, and analyzed financial data and results for Chief Information Officer Organization ($200M annual budget) and presented data with spending recommendations to management. \n- Streamlined close analysis process by developing paperless process of converting raw data to analysis models. The new method reduced monthly close process time by 3 to 4 hours per person. \n- Member of AT&T Professional Development Program Skills Cross-functional Team... Strategic Partnerships Strategy Wireless Semiconductors CRM Product Marketing Program Management Telecommunications Skills  Cross-functional Team... Strategic Partnerships Strategy Wireless Semiconductors CRM Product Marketing Program Management Telecommunications Cross-functional Team... Strategic Partnerships Strategy Wireless Semiconductors CRM Product Marketing Program Management Telecommunications Cross-functional Team... Strategic Partnerships Strategy Wireless Semiconductors CRM Product Marketing Program Management Telecommunications Education Arizona State University MBA 1999 Penn State University BS,  Finance 1988  – 1992 Activities and Societies:  Delta Sigma Pi Business Fraternity AI DuPont Arizona State University MBA 1999 Arizona State University MBA 1999 Arizona State University MBA 1999 Penn State University BS,  Finance 1988  – 1992 Activities and Societies:  Delta Sigma Pi Business Fraternity Penn State University BS,  Finance 1988  – 1992 Activities and Societies:  Delta Sigma Pi Business Fraternity Penn State University BS,  Finance 1988  – 1992 Activities and Societies:  Delta Sigma Pi Business Fraternity AI DuPont AI DuPont AI DuPont Honors & Awards ", "Summary HILIGHTS \n(1) Strong technical, operational and business experience \n• Obtained first class honors degree in Mechanical Engineering from Universiti Malaya.  \n• Started career in engineering with Hewlett-Packard/ Agilent Technologies. Set up new production line for LED technology, established quality processes, trained new engineers.  \n• Obtained MBA from Universiti Sains Malaysia; thesis on strategic alliance in the IT industry.  \n• Embarked on a challenging career with Dell and held various roles from program management, product marketing and business development.  \n• Held senior management roles in Intel for customer and partner alliance, business development and product management.  \n \n(2) Customer focused and business partnerships \n• Recognized for resolving customer escalation in Hewlett-Packard; awarded “CEO Best Customer Satisfaction” \n• Championed third party product reviews; Dell bagged ICT Singapore’s “2004 Best Home PC Award” and PC.com Malaysia’s “2003 Best Home PC Award” by PC.Com  \n• Managed Intel’s current client accounts and established new client pipeline for Asia and Europe. Achieved new business acquisitions in Asia, built new technical and business competencies for organization.  \n \n(3) Results driven leadership and team collaboration  \n• Awarded “Outstanding Performance” for the flawless launch of seven new Dell systems within 6 months and “Most Valuable Player” for exceeding revenue and margin for two consecutive quarters. \n• Achieved “Total Customer Experience Award” for leading cross functional team from engineering, quality and technical support in reducing warranty cost. \n• Worked effectively with virtual team members and leaders from Americas, EMEA and Asia. \n \nSpecialties: Senior executive influencing, growing business through partnering w/3rd party, building business case, talent building Summary HILIGHTS \n(1) Strong technical, operational and business experience \n• Obtained first class honors degree in Mechanical Engineering from Universiti Malaya.  \n• Started career in engineering with Hewlett-Packard/ Agilent Technologies. Set up new production line for LED technology, established quality processes, trained new engineers.  \n• Obtained MBA from Universiti Sains Malaysia; thesis on strategic alliance in the IT industry.  \n• Embarked on a challenging career with Dell and held various roles from program management, product marketing and business development.  \n• Held senior management roles in Intel for customer and partner alliance, business development and product management.  \n \n(2) Customer focused and business partnerships \n• Recognized for resolving customer escalation in Hewlett-Packard; awarded “CEO Best Customer Satisfaction” \n• Championed third party product reviews; Dell bagged ICT Singapore’s “2004 Best Home PC Award” and PC.com Malaysia’s “2003 Best Home PC Award” by PC.Com  \n• Managed Intel’s current client accounts and established new client pipeline for Asia and Europe. Achieved new business acquisitions in Asia, built new technical and business competencies for organization.  \n \n(3) Results driven leadership and team collaboration  \n• Awarded “Outstanding Performance” for the flawless launch of seven new Dell systems within 6 months and “Most Valuable Player” for exceeding revenue and margin for two consecutive quarters. \n• Achieved “Total Customer Experience Award” for leading cross functional team from engineering, quality and technical support in reducing warranty cost. \n• Worked effectively with virtual team members and leaders from Americas, EMEA and Asia. \n \nSpecialties: Senior executive influencing, growing business through partnering w/3rd party, building business case, talent building HILIGHTS \n(1) Strong technical, operational and business experience \n• Obtained first class honors degree in Mechanical Engineering from Universiti Malaya.  \n• Started career in engineering with Hewlett-Packard/ Agilent Technologies. Set up new production line for LED technology, established quality processes, trained new engineers.  \n• Obtained MBA from Universiti Sains Malaysia; thesis on strategic alliance in the IT industry.  \n• Embarked on a challenging career with Dell and held various roles from program management, product marketing and business development.  \n• Held senior management roles in Intel for customer and partner alliance, business development and product management.  \n \n(2) Customer focused and business partnerships \n• Recognized for resolving customer escalation in Hewlett-Packard; awarded “CEO Best Customer Satisfaction” \n• Championed third party product reviews; Dell bagged ICT Singapore’s “2004 Best Home PC Award” and PC.com Malaysia’s “2003 Best Home PC Award” by PC.Com  \n• Managed Intel’s current client accounts and established new client pipeline for Asia and Europe. Achieved new business acquisitions in Asia, built new technical and business competencies for organization.  \n \n(3) Results driven leadership and team collaboration  \n• Awarded “Outstanding Performance” for the flawless launch of seven new Dell systems within 6 months and “Most Valuable Player” for exceeding revenue and margin for two consecutive quarters. \n• Achieved “Total Customer Experience Award” for leading cross functional team from engineering, quality and technical support in reducing warranty cost. \n• Worked effectively with virtual team members and leaders from Americas, EMEA and Asia. \n \nSpecialties: Senior executive influencing, growing business through partnering w/3rd party, building business case, talent building HILIGHTS \n(1) Strong technical, operational and business experience \n• Obtained first class honors degree in Mechanical Engineering from Universiti Malaya.  \n• Started career in engineering with Hewlett-Packard/ Agilent Technologies. Set up new production line for LED technology, established quality processes, trained new engineers.  \n• Obtained MBA from Universiti Sains Malaysia; thesis on strategic alliance in the IT industry.  \n• Embarked on a challenging career with Dell and held various roles from program management, product marketing and business development.  \n• Held senior management roles in Intel for customer and partner alliance, business development and product management.  \n \n(2) Customer focused and business partnerships \n• Recognized for resolving customer escalation in Hewlett-Packard; awarded “CEO Best Customer Satisfaction” \n• Championed third party product reviews; Dell bagged ICT Singapore’s “2004 Best Home PC Award” and PC.com Malaysia’s “2003 Best Home PC Award” by PC.Com  \n• Managed Intel’s current client accounts and established new client pipeline for Asia and Europe. Achieved new business acquisitions in Asia, built new technical and business competencies for organization.  \n \n(3) Results driven leadership and team collaboration  \n• Awarded “Outstanding Performance” for the flawless launch of seven new Dell systems within 6 months and “Most Valuable Player” for exceeding revenue and margin for two consecutive quarters. \n• Achieved “Total Customer Experience Award” for leading cross functional team from engineering, quality and technical support in reducing warranty cost. \n• Worked effectively with virtual team members and leaders from Americas, EMEA and Asia. \n \nSpecialties: Senior executive influencing, growing business through partnering w/3rd party, building business case, talent building Skills Talent Management Product Marketing Product Management Go-to-market Strategy Cross-functional Team... Competitive Analysis Program Management Business Development Semiconductors Product Development Product Launch Business Strategy Channel New Business Development Talent Acquisition Strategic Partnerships Multi-channel Marketing Marketing Strategy Vendor Management Account Management Management Solution Selling Channel Partners Business Planning Strategy Business Intelligence Integrated Marketing Leadership Market Research Partner Management Segmentation See 16+     See less Skills  Talent Management Product Marketing Product Management Go-to-market Strategy Cross-functional Team... Competitive Analysis Program Management Business Development Semiconductors Product Development Product Launch Business Strategy Channel New Business Development Talent Acquisition Strategic Partnerships Multi-channel Marketing Marketing Strategy Vendor Management Account Management Management Solution Selling Channel Partners Business Planning Strategy Business Intelligence Integrated Marketing Leadership Market Research Partner Management Segmentation See 16+     See less Talent Management Product Marketing Product Management Go-to-market Strategy Cross-functional Team... Competitive Analysis Program Management Business Development Semiconductors Product Development Product Launch Business Strategy Channel New Business Development Talent Acquisition Strategic Partnerships Multi-channel Marketing Marketing Strategy Vendor Management Account Management Management Solution Selling Channel Partners Business Planning Strategy Business Intelligence Integrated Marketing Leadership Market Research Partner Management Segmentation See 16+     See less Talent Management Product Marketing Product Management Go-to-market Strategy Cross-functional Team... Competitive Analysis Program Management Business Development Semiconductors Product Development Product Launch Business Strategy Channel New Business Development Talent Acquisition Strategic Partnerships Multi-channel Marketing Marketing Strategy Vendor Management Account Management Management Solution Selling Channel Partners Business Planning Strategy Business Intelligence Integrated Marketing Leadership Market Research Partner Management Segmentation See 16+     See less Education Universiti Sains Malaysia MBA 1997  – 1999 B.Eng 1990  – 1994 Universiti Sains Malaysia MBA 1997  – 1999 Universiti Sains Malaysia MBA 1997  – 1999 Universiti Sains Malaysia MBA 1997  – 1999 B.Eng 1990  – 1994 B.Eng 1990  – 1994 B.Eng 1990  – 1994 ", "Experience Senior Marketing Manager Intel Corporation Senior Marketing Manager Intel Corporation Senior Marketing Manager Intel Corporation ", "Skills Product Marketing Go-to-market Strategy Blogging Strategic Partnerships Marketing Product Management Demand Generation Multi-channel Marketing Marketing Strategy Program Management Cross-functional Team... Competitive Analysis Lead Generation Integrated Marketing Product Launch Marketing Communications B2B Marketing Strategy See 3+     See less Skills  Product Marketing Go-to-market Strategy Blogging Strategic Partnerships Marketing Product Management Demand Generation Multi-channel Marketing Marketing Strategy Program Management Cross-functional Team... Competitive Analysis Lead Generation Integrated Marketing Product Launch Marketing Communications B2B Marketing Strategy See 3+     See less Product Marketing Go-to-market Strategy Blogging Strategic Partnerships Marketing Product Management Demand Generation Multi-channel Marketing Marketing Strategy Program Management Cross-functional Team... Competitive Analysis Lead Generation Integrated Marketing Product Launch Marketing Communications B2B Marketing Strategy See 3+     See less Product Marketing Go-to-market Strategy Blogging Strategic Partnerships Marketing Product Management Demand Generation Multi-channel Marketing Marketing Strategy Program Management Cross-functional Team... Competitive Analysis Lead Generation Integrated Marketing Product Launch Marketing Communications B2B Marketing Strategy See 3+     See less ", "Summary Enthusiastic member in leadership track with 15+ years of well-rounded experience and proven track record in a broad range of roles: Businesss Development, Product Development, Program Management, Marketing, and Engineering.  \n \nStrong communication and influencing skills at all levels of the organization. Excellent presentation skills in both English and Chinese. \n \nInspired to work in leadership positions that call for strong strategic thinking, critical decision making, and teamwork skills. \n \nSpecialties:  \nBusiness Development/ \nProduct Development/  \nProgram Management/ \nProduct Marketing/ \nProduct Engineering/ \nPeople and Team Management/ Summary Enthusiastic member in leadership track with 15+ years of well-rounded experience and proven track record in a broad range of roles: Businesss Development, Product Development, Program Management, Marketing, and Engineering.  \n \nStrong communication and influencing skills at all levels of the organization. Excellent presentation skills in both English and Chinese. \n \nInspired to work in leadership positions that call for strong strategic thinking, critical decision making, and teamwork skills. \n \nSpecialties:  \nBusiness Development/ \nProduct Development/  \nProgram Management/ \nProduct Marketing/ \nProduct Engineering/ \nPeople and Team Management/ Enthusiastic member in leadership track with 15+ years of well-rounded experience and proven track record in a broad range of roles: Businesss Development, Product Development, Program Management, Marketing, and Engineering.  \n \nStrong communication and influencing skills at all levels of the organization. Excellent presentation skills in both English and Chinese. \n \nInspired to work in leadership positions that call for strong strategic thinking, critical decision making, and teamwork skills. \n \nSpecialties:  \nBusiness Development/ \nProduct Development/  \nProgram Management/ \nProduct Marketing/ \nProduct Engineering/ \nPeople and Team Management/ Enthusiastic member in leadership track with 15+ years of well-rounded experience and proven track record in a broad range of roles: Businesss Development, Product Development, Program Management, Marketing, and Engineering.  \n \nStrong communication and influencing skills at all levels of the organization. Excellent presentation skills in both English and Chinese. \n \nInspired to work in leadership positions that call for strong strategic thinking, critical decision making, and teamwork skills. \n \nSpecialties:  \nBusiness Development/ \nProduct Development/  \nProgram Management/ \nProduct Marketing/ \nProduct Engineering/ \nPeople and Team Management/ Experience Senior Director of Business Development, Mobile Communication Group Intel Corporation December 2013  – Present (1 year 9 months) San Francisco Bay Area •\tIdentify and evaluate new strategic business and product opportunities to ensure profitable growth for mobile business unit by working with ODM's, OEM's, carriers, distributors, and retailers. \n•\tDevelop the customer engagement strategy and business cases that support business objectives by partnering with sales team, marketing team, and engineering team.  \n•\tPlan ODM product roadmap with broad range of competitive product offerings across all product segments to meet customer needs and to intercept customer roadmaps. \n•\tOversee engagement at major multinational ODM customers from design-in to product launch by ensuring optimal support at all phases of product life cycle. Senior Platform & Product Manager, Mobile Communication Group Intel Corporation October 2011  –  November 2013  (2 years 2 months) Santa Clara • Led and managed platform/product development and execution, from program kickoff to launch; \n• Oversaw all aspects of program to meet business requirements: feature, cost, schedule, and quality; \n• Led SOW & NRE negotiation with ODM partners and managed JDM partner relationship;  \n• Managed form factor reference design and vertical product design in very startup environment; \n• Managed cross functional teams to execute ODM factory builds; \n• Managed all platform/product communications and made timely execution decisions. Senior Marketing Manager Intel Corporation August 2009  –  September 2011  (2 years 2 months) Santa Clara, CA •\tBuilt a comprehensive volume forecast model and business model for one of the latest technology's commercial applications. \n•\tConducted a case study on Iconic consumer product and their impact on the company and the industry.  \n•\tWorked with both channel retail marketing team and segment marketing team to design and implement the strategy of igniting DIY high-end market in China. \n•\tDelivered solid results in scaling out the DIY high-end retail store project. The number of stores expanded six folds during the eight months period with improved product mix for higher margin.  \n•\tCrafted enterprise tablet selling guide with cross-functional groups and trained the field sales on how to engage OEM’s and IT managers.  \n•\tLed the gaming segment team to craft the strategy playbook for winning gaming segment on X-86 based tablet. Product Development Manager, Mobile Device Division Motorola July 2006  –  July 2009  (3 years 1 month) Libertyville, Illinois •\tLed an EE team to simultaneously develop a family of three mobile phone products. Managed team and individual priorities to meet all critical milestones, and to meet the target product launch date.  \n•\tLed the team through product development cycle by clearly communicating goals and expectations. Motivated and supported team members on a daily basis. Evaluated team member performance and provided quarterly feedback to improve team and individual productivity.  \n•\tInitiated and maintained effective communication between the hardware, software, and mechanical teams to resolve conflicts and to negotiate best design tradeoffs under multi-dimensional constraints.  \n•\tInterfaced with vendors and internal supply chain to qualify second source parts for the key components in the product. Mitigated risk on primary supplier’s output fluctuations and guaranteed timely product delivery to customers. \n•\tIdentified business opportunity for new mobile phone features and presented compelling business cases to senior management team. Proposed new features helped increasing product premium. Team Lead, Radio Frequency Team Motorola January 2003  –  June 2006  (3 years 6 months) Libertyville, Illinois Senior Staff Electrical Engineer Motorola June 1998  –  December 2002  (4 years 7 months) Libertyville, Illinois \n \nOne patent on dual band dual mode power amplifier granted by the U.S. Patent Office in 2002. (Co-authored with Pete Nanni and Eric Midlock). Senior Director of Business Development, Mobile Communication Group Intel Corporation December 2013  – Present (1 year 9 months) San Francisco Bay Area •\tIdentify and evaluate new strategic business and product opportunities to ensure profitable growth for mobile business unit by working with ODM's, OEM's, carriers, distributors, and retailers. \n•\tDevelop the customer engagement strategy and business cases that support business objectives by partnering with sales team, marketing team, and engineering team.  \n•\tPlan ODM product roadmap with broad range of competitive product offerings across all product segments to meet customer needs and to intercept customer roadmaps. \n•\tOversee engagement at major multinational ODM customers from design-in to product launch by ensuring optimal support at all phases of product life cycle. Senior Director of Business Development, Mobile Communication Group Intel Corporation December 2013  – Present (1 year 9 months) San Francisco Bay Area •\tIdentify and evaluate new strategic business and product opportunities to ensure profitable growth for mobile business unit by working with ODM's, OEM's, carriers, distributors, and retailers. \n•\tDevelop the customer engagement strategy and business cases that support business objectives by partnering with sales team, marketing team, and engineering team.  \n•\tPlan ODM product roadmap with broad range of competitive product offerings across all product segments to meet customer needs and to intercept customer roadmaps. \n•\tOversee engagement at major multinational ODM customers from design-in to product launch by ensuring optimal support at all phases of product life cycle. Senior Platform & Product Manager, Mobile Communication Group Intel Corporation October 2011  –  November 2013  (2 years 2 months) Santa Clara • Led and managed platform/product development and execution, from program kickoff to launch; \n• Oversaw all aspects of program to meet business requirements: feature, cost, schedule, and quality; \n• Led SOW & NRE negotiation with ODM partners and managed JDM partner relationship;  \n• Managed form factor reference design and vertical product design in very startup environment; \n• Managed cross functional teams to execute ODM factory builds; \n• Managed all platform/product communications and made timely execution decisions. Senior Platform & Product Manager, Mobile Communication Group Intel Corporation October 2011  –  November 2013  (2 years 2 months) Santa Clara • Led and managed platform/product development and execution, from program kickoff to launch; \n• Oversaw all aspects of program to meet business requirements: feature, cost, schedule, and quality; \n• Led SOW & NRE negotiation with ODM partners and managed JDM partner relationship;  \n• Managed form factor reference design and vertical product design in very startup environment; \n• Managed cross functional teams to execute ODM factory builds; \n• Managed all platform/product communications and made timely execution decisions. Senior Marketing Manager Intel Corporation August 2009  –  September 2011  (2 years 2 months) Santa Clara, CA •\tBuilt a comprehensive volume forecast model and business model for one of the latest technology's commercial applications. \n•\tConducted a case study on Iconic consumer product and their impact on the company and the industry.  \n•\tWorked with both channel retail marketing team and segment marketing team to design and implement the strategy of igniting DIY high-end market in China. \n•\tDelivered solid results in scaling out the DIY high-end retail store project. The number of stores expanded six folds during the eight months period with improved product mix for higher margin.  \n•\tCrafted enterprise tablet selling guide with cross-functional groups and trained the field sales on how to engage OEM’s and IT managers.  \n•\tLed the gaming segment team to craft the strategy playbook for winning gaming segment on X-86 based tablet. Senior Marketing Manager Intel Corporation August 2009  –  September 2011  (2 years 2 months) Santa Clara, CA •\tBuilt a comprehensive volume forecast model and business model for one of the latest technology's commercial applications. \n•\tConducted a case study on Iconic consumer product and their impact on the company and the industry.  \n•\tWorked with both channel retail marketing team and segment marketing team to design and implement the strategy of igniting DIY high-end market in China. \n•\tDelivered solid results in scaling out the DIY high-end retail store project. The number of stores expanded six folds during the eight months period with improved product mix for higher margin.  \n•\tCrafted enterprise tablet selling guide with cross-functional groups and trained the field sales on how to engage OEM’s and IT managers.  \n•\tLed the gaming segment team to craft the strategy playbook for winning gaming segment on X-86 based tablet. Product Development Manager, Mobile Device Division Motorola July 2006  –  July 2009  (3 years 1 month) Libertyville, Illinois •\tLed an EE team to simultaneously develop a family of three mobile phone products. Managed team and individual priorities to meet all critical milestones, and to meet the target product launch date.  \n•\tLed the team through product development cycle by clearly communicating goals and expectations. Motivated and supported team members on a daily basis. Evaluated team member performance and provided quarterly feedback to improve team and individual productivity.  \n•\tInitiated and maintained effective communication between the hardware, software, and mechanical teams to resolve conflicts and to negotiate best design tradeoffs under multi-dimensional constraints.  \n•\tInterfaced with vendors and internal supply chain to qualify second source parts for the key components in the product. Mitigated risk on primary supplier’s output fluctuations and guaranteed timely product delivery to customers. \n•\tIdentified business opportunity for new mobile phone features and presented compelling business cases to senior management team. Proposed new features helped increasing product premium. Product Development Manager, Mobile Device Division Motorola July 2006  –  July 2009  (3 years 1 month) Libertyville, Illinois •\tLed an EE team to simultaneously develop a family of three mobile phone products. Managed team and individual priorities to meet all critical milestones, and to meet the target product launch date.  \n•\tLed the team through product development cycle by clearly communicating goals and expectations. Motivated and supported team members on a daily basis. Evaluated team member performance and provided quarterly feedback to improve team and individual productivity.  \n•\tInitiated and maintained effective communication between the hardware, software, and mechanical teams to resolve conflicts and to negotiate best design tradeoffs under multi-dimensional constraints.  \n•\tInterfaced with vendors and internal supply chain to qualify second source parts for the key components in the product. Mitigated risk on primary supplier’s output fluctuations and guaranteed timely product delivery to customers. \n•\tIdentified business opportunity for new mobile phone features and presented compelling business cases to senior management team. Proposed new features helped increasing product premium. Team Lead, Radio Frequency Team Motorola January 2003  –  June 2006  (3 years 6 months) Libertyville, Illinois Team Lead, Radio Frequency Team Motorola January 2003  –  June 2006  (3 years 6 months) Libertyville, Illinois Senior Staff Electrical Engineer Motorola June 1998  –  December 2002  (4 years 7 months) Libertyville, Illinois \n \nOne patent on dual band dual mode power amplifier granted by the U.S. Patent Office in 2002. (Co-authored with Pete Nanni and Eric Midlock). Senior Staff Electrical Engineer Motorola June 1998  –  December 2002  (4 years 7 months) Libertyville, Illinois \n \nOne patent on dual band dual mode power amplifier granted by the U.S. Patent Office in 2002. (Co-authored with Pete Nanni and Eric Midlock). Languages English Native or bilingual proficiency Chinese Native or bilingual proficiency English Native or bilingual proficiency Chinese Native or bilingual proficiency English Native or bilingual proficiency Chinese Native or bilingual proficiency Native or bilingual proficiency Native or bilingual proficiency Skills Product Marketing Product Development Product Life Cycle... Marketing Strategy Strategic Planning Mobile Product Management Product Lifecycle... Mobile Devices Competitive Analysis Strategy Cross-functional Team... Product Launch Program Management Go-to-market Strategy Wireless Strategic Partnerships Embedded Systems RF Engineering Management Semiconductors Management Start-ups Leadership Enterprise Software SoC See 11+     See less Skills  Product Marketing Product Development Product Life Cycle... Marketing Strategy Strategic Planning Mobile Product Management Product Lifecycle... Mobile Devices Competitive Analysis Strategy Cross-functional Team... Product Launch Program Management Go-to-market Strategy Wireless Strategic Partnerships Embedded Systems RF Engineering Management Semiconductors Management Start-ups Leadership Enterprise Software SoC See 11+     See less Product Marketing Product Development Product Life Cycle... Marketing Strategy Strategic Planning Mobile Product Management Product Lifecycle... Mobile Devices Competitive Analysis Strategy Cross-functional Team... Product Launch Program Management Go-to-market Strategy Wireless Strategic Partnerships Embedded Systems RF Engineering Management Semiconductors Management Start-ups Leadership Enterprise Software SoC See 11+     See less Product Marketing Product Development Product Life Cycle... Marketing Strategy Strategic Planning Mobile Product Management Product Lifecycle... Mobile Devices Competitive Analysis Strategy Cross-functional Team... Product Launch Program Management Go-to-market Strategy Wireless Strategic Partnerships Embedded Systems RF Engineering Management Semiconductors Management Start-ups Leadership Enterprise Software SoC See 11+     See less Education The University of Chicago Booth School of Business MBA,  Marketing Management , Economics,  and General Management 2006  – 2009 Graduated with honor. Activities and Societies:  Beta Gamma Sigma ,  Chicago Consulting Club ,  and Admissions Committee Cornell University MS,  Electrical Engineering 1996  – 1998 Master Thesis: Parallel Plate Waveguide Power Combiner at 8GHz.  \nMerit based Teaching assistantship in Quantum Mechanics, Solid State Devices, and Microwave Circuits classes. Southeast University BS,  Electrical Engineering 1990  – 1994 Graduation Thesis: High efficiency class-C power amplifier. (Awarded best graudation thesis of the year in Microwave Lab.) \nSecond place in International Mathematical Modeling Contest 1993. Activities and Societies:  Debate Team ,  Track and Field Team ,  Mathematics club ,  and Physics club. Nantong Middle School 南通中学 1987  – 1990 Activities and Societies:  Track and Field Team ,  Mathematics club ,  Physics club ,  and Chemistry club. The University of Chicago Booth School of Business MBA,  Marketing Management , Economics,  and General Management 2006  – 2009 Graduated with honor. Activities and Societies:  Beta Gamma Sigma ,  Chicago Consulting Club ,  and Admissions Committee The University of Chicago Booth School of Business MBA,  Marketing Management , Economics,  and General Management 2006  – 2009 Graduated with honor. Activities and Societies:  Beta Gamma Sigma ,  Chicago Consulting Club ,  and Admissions Committee The University of Chicago Booth School of Business MBA,  Marketing Management , Economics,  and General Management 2006  – 2009 Graduated with honor. Activities and Societies:  Beta Gamma Sigma ,  Chicago Consulting Club ,  and Admissions Committee Cornell University MS,  Electrical Engineering 1996  – 1998 Master Thesis: Parallel Plate Waveguide Power Combiner at 8GHz.  \nMerit based Teaching assistantship in Quantum Mechanics, Solid State Devices, and Microwave Circuits classes. Cornell University MS,  Electrical Engineering 1996  – 1998 Master Thesis: Parallel Plate Waveguide Power Combiner at 8GHz.  \nMerit based Teaching assistantship in Quantum Mechanics, Solid State Devices, and Microwave Circuits classes. Cornell University MS,  Electrical Engineering 1996  – 1998 Master Thesis: Parallel Plate Waveguide Power Combiner at 8GHz.  \nMerit based Teaching assistantship in Quantum Mechanics, Solid State Devices, and Microwave Circuits classes. Southeast University BS,  Electrical Engineering 1990  – 1994 Graduation Thesis: High efficiency class-C power amplifier. (Awarded best graudation thesis of the year in Microwave Lab.) \nSecond place in International Mathematical Modeling Contest 1993. Activities and Societies:  Debate Team ,  Track and Field Team ,  Mathematics club ,  and Physics club. Southeast University BS,  Electrical Engineering 1990  – 1994 Graduation Thesis: High efficiency class-C power amplifier. (Awarded best graudation thesis of the year in Microwave Lab.) \nSecond place in International Mathematical Modeling Contest 1993. Activities and Societies:  Debate Team ,  Track and Field Team ,  Mathematics club ,  and Physics club. Southeast University BS,  Electrical Engineering 1990  – 1994 Graduation Thesis: High efficiency class-C power amplifier. (Awarded best graudation thesis of the year in Microwave Lab.) \nSecond place in International Mathematical Modeling Contest 1993. Activities and Societies:  Debate Team ,  Track and Field Team ,  Mathematics club ,  and Physics club. Nantong Middle School 南通中学 1987  – 1990 Activities and Societies:  Track and Field Team ,  Mathematics club ,  Physics club ,  and Chemistry club. Nantong Middle School 南通中学 1987  – 1990 Activities and Societies:  Track and Field Team ,  Mathematics club ,  Physics club ,  and Chemistry club. Nantong Middle School 南通中学 1987  – 1990 Activities and Societies:  Track and Field Team ,  Mathematics club ,  Physics club ,  and Chemistry club. Honors & Awards Additional Honors & Awards Graduated from Chicago Booth with Honors. \nSecond place in International Mathematical Modeling Contest 1993. \nOne patent on dual band dual mode power amplifier granted by the U.S. Patent Office in 2002. Additional Honors & Awards Graduated from Chicago Booth with Honors. \nSecond place in International Mathematical Modeling Contest 1993. \nOne patent on dual band dual mode power amplifier granted by the U.S. Patent Office in 2002. Additional Honors & Awards Graduated from Chicago Booth with Honors. \nSecond place in International Mathematical Modeling Contest 1993. \nOne patent on dual band dual mode power amplifier granted by the U.S. Patent Office in 2002. Additional Honors & Awards Graduated from Chicago Booth with Honors. \nSecond place in International Mathematical Modeling Contest 1993. \nOne patent on dual band dual mode power amplifier granted by the U.S. Patent Office in 2002. ", "Summary Over 12 years experience in translating business objectives into world-class marketing campaigns that achieve superior results and maximum ROI. Strong leader and collaborative team player adept at devising strategic plans, implementing those plans and measuring for results with keen attention-to-detail and exemplary follow-through. Proven ability to manage multi-faceted projects, conflicting priorities, cross-functional teams and creative agencies across global and organizational boundaries in highly-matrixed, fast-paced environments – on time and under budget. Gifted writer with the ability to translate complex subjects into compelling messages that resonate with target audiences. Extraordinary work ethic and commitment to exceeding expectations. Specialties:Smart Strategy \nResearch & Analysis • Positioning • Value Propositions • Marketing Plans • Worldwide Experience \n \nInnovative Tactics \nBranding • Messaging • Co-Branding/Messaging • PR • Advertising • Photo Shoots • Direct Mail • Sales Collateral, Promotions & Training • Technical Literature • Success Stories • Web • Social Media • Events • Videos • Podcasts • Interactive Tools \n \nChannels & Partners \nDirect • Distributors • OEMs • Independent Software & Hardware Vendors Summary Over 12 years experience in translating business objectives into world-class marketing campaigns that achieve superior results and maximum ROI. Strong leader and collaborative team player adept at devising strategic plans, implementing those plans and measuring for results with keen attention-to-detail and exemplary follow-through. Proven ability to manage multi-faceted projects, conflicting priorities, cross-functional teams and creative agencies across global and organizational boundaries in highly-matrixed, fast-paced environments – on time and under budget. Gifted writer with the ability to translate complex subjects into compelling messages that resonate with target audiences. Extraordinary work ethic and commitment to exceeding expectations. Specialties:Smart Strategy \nResearch & Analysis • Positioning • Value Propositions • Marketing Plans • Worldwide Experience \n \nInnovative Tactics \nBranding • Messaging • Co-Branding/Messaging • PR • Advertising • Photo Shoots • Direct Mail • Sales Collateral, Promotions & Training • Technical Literature • Success Stories • Web • Social Media • Events • Videos • Podcasts • Interactive Tools \n \nChannels & Partners \nDirect • Distributors • OEMs • Independent Software & Hardware Vendors Over 12 years experience in translating business objectives into world-class marketing campaigns that achieve superior results and maximum ROI. Strong leader and collaborative team player adept at devising strategic plans, implementing those plans and measuring for results with keen attention-to-detail and exemplary follow-through. Proven ability to manage multi-faceted projects, conflicting priorities, cross-functional teams and creative agencies across global and organizational boundaries in highly-matrixed, fast-paced environments – on time and under budget. Gifted writer with the ability to translate complex subjects into compelling messages that resonate with target audiences. Extraordinary work ethic and commitment to exceeding expectations. Specialties:Smart Strategy \nResearch & Analysis • Positioning • Value Propositions • Marketing Plans • Worldwide Experience \n \nInnovative Tactics \nBranding • Messaging • Co-Branding/Messaging • PR • Advertising • Photo Shoots • Direct Mail • Sales Collateral, Promotions & Training • Technical Literature • Success Stories • Web • Social Media • Events • Videos • Podcasts • Interactive Tools \n \nChannels & Partners \nDirect • Distributors • OEMs • Independent Software & Hardware Vendors Over 12 years experience in translating business objectives into world-class marketing campaigns that achieve superior results and maximum ROI. Strong leader and collaborative team player adept at devising strategic plans, implementing those plans and measuring for results with keen attention-to-detail and exemplary follow-through. Proven ability to manage multi-faceted projects, conflicting priorities, cross-functional teams and creative agencies across global and organizational boundaries in highly-matrixed, fast-paced environments – on time and under budget. Gifted writer with the ability to translate complex subjects into compelling messages that resonate with target audiences. Extraordinary work ethic and commitment to exceeding expectations. Specialties:Smart Strategy \nResearch & Analysis • Positioning • Value Propositions • Marketing Plans • Worldwide Experience \n \nInnovative Tactics \nBranding • Messaging • Co-Branding/Messaging • PR • Advertising • Photo Shoots • Direct Mail • Sales Collateral, Promotions & Training • Technical Literature • Success Stories • Web • Social Media • Events • Videos • Podcasts • Interactive Tools \n \nChannels & Partners \nDirect • Distributors • OEMs • Independent Software & Hardware Vendors Honors & Awards Additional Honors & Awards Division Recognition Award – Intel Corporation \n \nTechnical Society of Communications – Local, National and International Awards – Oscilloscope Selection Guide \n \nTechnical Society of Communications – Local Award – TDS3000B Series Oscilloscope Troubleshooting Guide Additional Honors & Awards Division Recognition Award – Intel Corporation \n \nTechnical Society of Communications – Local, National and International Awards – Oscilloscope Selection Guide \n \nTechnical Society of Communications – Local Award – TDS3000B Series Oscilloscope Troubleshooting Guide Additional Honors & Awards Division Recognition Award – Intel Corporation \n \nTechnical Society of Communications – Local, National and International Awards – Oscilloscope Selection Guide \n \nTechnical Society of Communications – Local Award – TDS3000B Series Oscilloscope Troubleshooting Guide Additional Honors & Awards Division Recognition Award – Intel Corporation \n \nTechnical Society of Communications – Local, National and International Awards – Oscilloscope Selection Guide \n \nTechnical Society of Communications – Local Award – TDS3000B Series Oscilloscope Troubleshooting Guide ", "Skills Competitive Analysis Marketing Strategy Pricing Program Management Pricing Strategy Strategy Product Marketing Product Management Marketing Management Strategic Planning Strategic Partnerships Product Development Semiconductors Cross-functional Team... Social Media Marketing Business Development See 2+     See less Skills  Competitive Analysis Marketing Strategy Pricing Program Management Pricing Strategy Strategy Product Marketing Product Management Marketing Management Strategic Planning Strategic Partnerships Product Development Semiconductors Cross-functional Team... Social Media Marketing Business Development See 2+     See less Competitive Analysis Marketing Strategy Pricing Program Management Pricing Strategy Strategy Product Marketing Product Management Marketing Management Strategic Planning Strategic Partnerships Product Development Semiconductors Cross-functional Team... Social Media Marketing Business Development See 2+     See less Competitive Analysis Marketing Strategy Pricing Program Management Pricing Strategy Strategy Product Marketing Product Management Marketing Management Strategic Planning Strategic Partnerships Product Development Semiconductors Cross-functional Team... Social Media Marketing Business Development See 2+     See less ", "Summary Seasoned executive leader and strategic planner with extensive experience orchestrating marketing, communications, and strategic planning operations for leading organizations within the enterprise software and hardware industries.  \n \nImpact corporate performance through skillful development, management, and implementation of marketing communications and strategies that address market, product and service requirements.  \n \nCultivate profitable relationships by leveraging expert communication skills that facilitate collaborative and mutually beneficial negotiations.  \n \nContribute to business development and generate new revenue streams through identification and pursuit of strategic business opportunities. Specialties:Executive and Marketing Communications • Strategic Market Planning • Product Launch • Market Assessment/Penetration • Negotiations • Keynote Presentations • Vendor Relations \nBusiness Development • Target Marketing Summary Seasoned executive leader and strategic planner with extensive experience orchestrating marketing, communications, and strategic planning operations for leading organizations within the enterprise software and hardware industries.  \n \nImpact corporate performance through skillful development, management, and implementation of marketing communications and strategies that address market, product and service requirements.  \n \nCultivate profitable relationships by leveraging expert communication skills that facilitate collaborative and mutually beneficial negotiations.  \n \nContribute to business development and generate new revenue streams through identification and pursuit of strategic business opportunities. Specialties:Executive and Marketing Communications • Strategic Market Planning • Product Launch • Market Assessment/Penetration • Negotiations • Keynote Presentations • Vendor Relations \nBusiness Development • Target Marketing Seasoned executive leader and strategic planner with extensive experience orchestrating marketing, communications, and strategic planning operations for leading organizations within the enterprise software and hardware industries.  \n \nImpact corporate performance through skillful development, management, and implementation of marketing communications and strategies that address market, product and service requirements.  \n \nCultivate profitable relationships by leveraging expert communication skills that facilitate collaborative and mutually beneficial negotiations.  \n \nContribute to business development and generate new revenue streams through identification and pursuit of strategic business opportunities. Specialties:Executive and Marketing Communications • Strategic Market Planning • Product Launch • Market Assessment/Penetration • Negotiations • Keynote Presentations • Vendor Relations \nBusiness Development • Target Marketing Seasoned executive leader and strategic planner with extensive experience orchestrating marketing, communications, and strategic planning operations for leading organizations within the enterprise software and hardware industries.  \n \nImpact corporate performance through skillful development, management, and implementation of marketing communications and strategies that address market, product and service requirements.  \n \nCultivate profitable relationships by leveraging expert communication skills that facilitate collaborative and mutually beneficial negotiations.  \n \nContribute to business development and generate new revenue streams through identification and pursuit of strategic business opportunities. Specialties:Executive and Marketing Communications • Strategic Market Planning • Product Launch • Market Assessment/Penetration • Negotiations • Keynote Presentations • Vendor Relations \nBusiness Development • Target Marketing Experience Senior Executive Communications Manager - Office of the President Lexmark International, Inc. March 2012  –  March 2015  (3 years 1 month) Sr. Manager, Executive Communications - Office of the Senior Vice President - Engineering Cisco Systems April 2010  –  March 2012  (2 years) Executive Communications Manager - Office of the CTO Sun Microsystems February 2007  –  December 2009  (2 years 11 months) Play an instrumental role in the effective and strategic communication of information by corporate executives, primarily Chief Technology Officer and Executive Vice President – Research and Development. Research information and develop/prepare presentations delivered in special events in addition to communications delivered to a wide range of external audiences. Lead creation of new corporate messaging, narrative and communications strategies and secured approval from executive sponsors and business unit stakeholders. Function as liaison between CTO and trade/business press and industry analysts.  \n \nSupply expert counsel to executives and support to optimize key message distribution in public, press, and business platforms. Administer all aspects of speechwriting, blogging, and briefings as well as creation of feature articles and documents for special projects/assignments. Facilitate communications with diverse groups, including Executive Communications, Global Communications, Corporate Marketing, and additional business units internally/externally. \n \nOperational Highlights: \n•\tSuccessfully fueled attainment of numerous speaking roles, feature articles, and programs that boosted CTO’s exposure and evangelized his message platform through establishment of highly effective communication strategies. \n•\tEnhanced communications by continuously maintaining high levels of creativity while ensuring consistency in the areas of themes and messages focused on boosting audience relevance. \n•\tChallenged with and succeeded in creating special communication strategies for executive management training, new product launch, and global executive presentations. \n•\tTransformed SMI corporate-level messaging from company- to customer-centric, successfully elevating client satisfaction and experience. Senior Marketing Manager Intel Corporation 1996  –  2006  (10 years) Collected & evaluated market data for end customers of new server products or industry initiatives. Conducted market research, interviewing potential customers. Prepared marketing communication strategies & targeted messages, which served as a template driving development of outbound mktg. campaigns & field sales tools. Liaised with Product Management, Outbound & Campaign Mktg Mgmt. as well as Sales Mgmt. to promote communications & message consistency across all mktg. & sales channels. Delivered internal presentations to ensure strategy compliance & external presentations to determine strategy efficacy. \n \n• Spearheaded 2 global research projects. Conducted Global Server Product primary qualitative research prior to development of mktg. & message communication strategies. Developed key objectives for research deliverables, research content, & methodology. Delivered data-driven information by preparing research summaries and tangible action items. \n• Developed a mktg. messaging & program strategy for Intel’s role in the virtualization initiative stack in order to achieve market leader recognition for this technology. Collaborated in aligning industry-wide messaging with end user content for field sales, global geographies & Original Equipment Manufacturers (OEMs). Cultivated partnerships with leading virtualization software vendors. Successfully shifted focus away from actual Intel technology to Intel’s leading role in providing a complete solution to end-users. Presented with Divisional Recognition Award. \n• Strategically positioned the world’s first quad-core server processors with OEMs & end-users. Achieved by developing communication strategies that conveyed consistent messages up the executive ladder through keynote speeches. \n• Ensured consistency across all market touch points by instating an enterprise datacenter mktg. communication/messaging hierarchy & playbook from which to develop all outbound mktg., campaign, sales & partner program communications. Platform and Initiative Manager, Enterprise Software Enabling Intel Corporation 1999  –  2004  (5 years) Developed Independent Software Vendor (ISV) enabling strategies to support Intel Architecture (IA) enterprise server platforms & technology initiatives. Identified programs & resources to successfully deliver competitive software for IA server platforms & technologies. Designed ISV specific marketing content to transmit IA platform/technology & business and Intel partnership value. \n \nAnalyzed emerging markets in China and Russia to define programs for enabling 3rd-party software. Conducted 1-on-1 interviews with business, government, education & associations leaders to obtain 1st-hand knowledge on role of PC & server technology in their operations and markets. Collected data regarding key technology partners & market leaders.  \n \n• Spearheaded development of software market requirements, plans & solutions, including Operating Systems, middleware, tools & applications. Attained over 400 project design agreements with global software companies for numerous new Intel products & technologies, including over 100 project agreements for Intel’s high-end server product for which no software existed prior to product rollout. Launched software & applications supporting nearly 12 new Intel server products in 6 years. \n• Facilitated rapid initiation of high impact programs by delivering comprehensive assessment of the Russian & Chinese markets, including strategies & key targets for locally executed enabling teams & programs. Obtained Divisional Recognition Award. \n• Prepared bi-annual 5-year roadmaps aligning software development & solutions to support new platform & technology features & uses. \n• Delivered annual 3-year product line business plans that delineated key objectives, identified competitive threats & provided project & resource portfolios to attain business objectives. \n• Developed effective strategies & plans for competitive differentiation by analyzing industry partner relationships & obtaining their input on efficacy of Intel strategies & business models. Industry Initiative Program Manager Intel Corporation 1998  –  1999  (1 year) Headed a server manufacturer industry initiative to identify, standardize & commoditize non-proprietary server hardware components. Targeted the reduction of design & manufacturing costs as well as the cutback of design lead times for better time-to-market delivery of products at more competitive prices. Indirectly oversaw a team of senior design engineers that identified & developed specifications for individual server hardware components. Recruited members and served as Chair for an industry task force comprised of senior engineering representatives from IBM, HP, Dell, Fujitsu, SGI, Hitachi and EMC who reviewed & ratified industry-standard specifications for agreed upon server hardware components. Negotiated with global server vendors to develop products based on industry standard specifications. \n \n• Contributed to a market share growth of over 80% in a 4-year timeframe by developing a widely supported standard high volume server with Intel architecture. \n• Collaborated with a diverse group of OEMs (i.e. IBM, HP, Dell) in an internal organizational matrix structure. Drove the development & implementation of a market-segmented array of open industry server component specifications despite no line authority over spec authors. Facilitated the broad & rapid availability of Server System Infrastructure (SSI) compliant products in the marketplace. Leveraged effective networking skills to establish a solid Independent Hardware Vendor (IHV) base of support. \n• Built profitable relationships with over 10 multi-national OEMs & over 50 server hardware component vendors committed to supporting & delivering products using the industry-standard designs. \n• Successfully spearheaded a matrix team of senior design engineers to develop over 20 industry standards for server hardware components. \n• Received Divisional Recognition Award for successfully delivering the first global industry-standard design initiative for server manufacturers & their component vendors. Engineering Program Manager Intel Corporation 1996  –  1998  (2 years) Concurrently managed 6 server platforms. Internalized requirements from component product development teams. Prepared overall project plans including program engineering and new product introduction milestone and deliverable schedules. Defined team goals, achieving team buy-in. Established team member functions and expectations. Resolved team conflict issues and instituted a decision making process. \n \n• Skillfully specified, designed (with vendor), and validated 3 simultaneous server platforms in 4 months by leading 2 specifically created engineering design teams. Helped company recover from a previous product delivery slip. \n• Attained Intel product delivery needs and product cost objectives by successfully negotiating product design and production delivery schedules with vendors and partnering with Commodity Management to negotiate product unit costs.  \n• Developed and implemented a formal new product introduction (NPI) process for power subsystem. Established best practices for ideal power subsystem design, evaluation plans, and schedules. Obtained both internal and external engineering staffs’ agreement for process plans and schedules. Senior Executive Communications Manager - Office of the President Lexmark International, Inc. March 2012  –  March 2015  (3 years 1 month) Senior Executive Communications Manager - Office of the President Lexmark International, Inc. March 2012  –  March 2015  (3 years 1 month) Sr. Manager, Executive Communications - Office of the Senior Vice President - Engineering Cisco Systems April 2010  –  March 2012  (2 years) Sr. Manager, Executive Communications - Office of the Senior Vice President - Engineering Cisco Systems April 2010  –  March 2012  (2 years) Executive Communications Manager - Office of the CTO Sun Microsystems February 2007  –  December 2009  (2 years 11 months) Play an instrumental role in the effective and strategic communication of information by corporate executives, primarily Chief Technology Officer and Executive Vice President – Research and Development. Research information and develop/prepare presentations delivered in special events in addition to communications delivered to a wide range of external audiences. Lead creation of new corporate messaging, narrative and communications strategies and secured approval from executive sponsors and business unit stakeholders. Function as liaison between CTO and trade/business press and industry analysts.  \n \nSupply expert counsel to executives and support to optimize key message distribution in public, press, and business platforms. Administer all aspects of speechwriting, blogging, and briefings as well as creation of feature articles and documents for special projects/assignments. Facilitate communications with diverse groups, including Executive Communications, Global Communications, Corporate Marketing, and additional business units internally/externally. \n \nOperational Highlights: \n•\tSuccessfully fueled attainment of numerous speaking roles, feature articles, and programs that boosted CTO’s exposure and evangelized his message platform through establishment of highly effective communication strategies. \n•\tEnhanced communications by continuously maintaining high levels of creativity while ensuring consistency in the areas of themes and messages focused on boosting audience relevance. \n•\tChallenged with and succeeded in creating special communication strategies for executive management training, new product launch, and global executive presentations. \n•\tTransformed SMI corporate-level messaging from company- to customer-centric, successfully elevating client satisfaction and experience. Executive Communications Manager - Office of the CTO Sun Microsystems February 2007  –  December 2009  (2 years 11 months) Play an instrumental role in the effective and strategic communication of information by corporate executives, primarily Chief Technology Officer and Executive Vice President – Research and Development. Research information and develop/prepare presentations delivered in special events in addition to communications delivered to a wide range of external audiences. Lead creation of new corporate messaging, narrative and communications strategies and secured approval from executive sponsors and business unit stakeholders. Function as liaison between CTO and trade/business press and industry analysts.  \n \nSupply expert counsel to executives and support to optimize key message distribution in public, press, and business platforms. Administer all aspects of speechwriting, blogging, and briefings as well as creation of feature articles and documents for special projects/assignments. Facilitate communications with diverse groups, including Executive Communications, Global Communications, Corporate Marketing, and additional business units internally/externally. \n \nOperational Highlights: \n•\tSuccessfully fueled attainment of numerous speaking roles, feature articles, and programs that boosted CTO’s exposure and evangelized his message platform through establishment of highly effective communication strategies. \n•\tEnhanced communications by continuously maintaining high levels of creativity while ensuring consistency in the areas of themes and messages focused on boosting audience relevance. \n•\tChallenged with and succeeded in creating special communication strategies for executive management training, new product launch, and global executive presentations. \n•\tTransformed SMI corporate-level messaging from company- to customer-centric, successfully elevating client satisfaction and experience. Senior Marketing Manager Intel Corporation 1996  –  2006  (10 years) Collected & evaluated market data for end customers of new server products or industry initiatives. Conducted market research, interviewing potential customers. Prepared marketing communication strategies & targeted messages, which served as a template driving development of outbound mktg. campaigns & field sales tools. Liaised with Product Management, Outbound & Campaign Mktg Mgmt. as well as Sales Mgmt. to promote communications & message consistency across all mktg. & sales channels. Delivered internal presentations to ensure strategy compliance & external presentations to determine strategy efficacy. \n \n• Spearheaded 2 global research projects. Conducted Global Server Product primary qualitative research prior to development of mktg. & message communication strategies. Developed key objectives for research deliverables, research content, & methodology. Delivered data-driven information by preparing research summaries and tangible action items. \n• Developed a mktg. messaging & program strategy for Intel’s role in the virtualization initiative stack in order to achieve market leader recognition for this technology. Collaborated in aligning industry-wide messaging with end user content for field sales, global geographies & Original Equipment Manufacturers (OEMs). Cultivated partnerships with leading virtualization software vendors. Successfully shifted focus away from actual Intel technology to Intel’s leading role in providing a complete solution to end-users. Presented with Divisional Recognition Award. \n• Strategically positioned the world’s first quad-core server processors with OEMs & end-users. Achieved by developing communication strategies that conveyed consistent messages up the executive ladder through keynote speeches. \n• Ensured consistency across all market touch points by instating an enterprise datacenter mktg. communication/messaging hierarchy & playbook from which to develop all outbound mktg., campaign, sales & partner program communications. Senior Marketing Manager Intel Corporation 1996  –  2006  (10 years) Collected & evaluated market data for end customers of new server products or industry initiatives. Conducted market research, interviewing potential customers. Prepared marketing communication strategies & targeted messages, which served as a template driving development of outbound mktg. campaigns & field sales tools. Liaised with Product Management, Outbound & Campaign Mktg Mgmt. as well as Sales Mgmt. to promote communications & message consistency across all mktg. & sales channels. Delivered internal presentations to ensure strategy compliance & external presentations to determine strategy efficacy. \n \n• Spearheaded 2 global research projects. Conducted Global Server Product primary qualitative research prior to development of mktg. & message communication strategies. Developed key objectives for research deliverables, research content, & methodology. Delivered data-driven information by preparing research summaries and tangible action items. \n• Developed a mktg. messaging & program strategy for Intel’s role in the virtualization initiative stack in order to achieve market leader recognition for this technology. Collaborated in aligning industry-wide messaging with end user content for field sales, global geographies & Original Equipment Manufacturers (OEMs). Cultivated partnerships with leading virtualization software vendors. Successfully shifted focus away from actual Intel technology to Intel’s leading role in providing a complete solution to end-users. Presented with Divisional Recognition Award. \n• Strategically positioned the world’s first quad-core server processors with OEMs & end-users. Achieved by developing communication strategies that conveyed consistent messages up the executive ladder through keynote speeches. \n• Ensured consistency across all market touch points by instating an enterprise datacenter mktg. communication/messaging hierarchy & playbook from which to develop all outbound mktg., campaign, sales & partner program communications. Platform and Initiative Manager, Enterprise Software Enabling Intel Corporation 1999  –  2004  (5 years) Developed Independent Software Vendor (ISV) enabling strategies to support Intel Architecture (IA) enterprise server platforms & technology initiatives. Identified programs & resources to successfully deliver competitive software for IA server platforms & technologies. Designed ISV specific marketing content to transmit IA platform/technology & business and Intel partnership value. \n \nAnalyzed emerging markets in China and Russia to define programs for enabling 3rd-party software. Conducted 1-on-1 interviews with business, government, education & associations leaders to obtain 1st-hand knowledge on role of PC & server technology in their operations and markets. Collected data regarding key technology partners & market leaders.  \n \n• Spearheaded development of software market requirements, plans & solutions, including Operating Systems, middleware, tools & applications. Attained over 400 project design agreements with global software companies for numerous new Intel products & technologies, including over 100 project agreements for Intel’s high-end server product for which no software existed prior to product rollout. Launched software & applications supporting nearly 12 new Intel server products in 6 years. \n• Facilitated rapid initiation of high impact programs by delivering comprehensive assessment of the Russian & Chinese markets, including strategies & key targets for locally executed enabling teams & programs. Obtained Divisional Recognition Award. \n• Prepared bi-annual 5-year roadmaps aligning software development & solutions to support new platform & technology features & uses. \n• Delivered annual 3-year product line business plans that delineated key objectives, identified competitive threats & provided project & resource portfolios to attain business objectives. \n• Developed effective strategies & plans for competitive differentiation by analyzing industry partner relationships & obtaining their input on efficacy of Intel strategies & business models. Platform and Initiative Manager, Enterprise Software Enabling Intel Corporation 1999  –  2004  (5 years) Developed Independent Software Vendor (ISV) enabling strategies to support Intel Architecture (IA) enterprise server platforms & technology initiatives. Identified programs & resources to successfully deliver competitive software for IA server platforms & technologies. Designed ISV specific marketing content to transmit IA platform/technology & business and Intel partnership value. \n \nAnalyzed emerging markets in China and Russia to define programs for enabling 3rd-party software. Conducted 1-on-1 interviews with business, government, education & associations leaders to obtain 1st-hand knowledge on role of PC & server technology in their operations and markets. Collected data regarding key technology partners & market leaders.  \n \n• Spearheaded development of software market requirements, plans & solutions, including Operating Systems, middleware, tools & applications. Attained over 400 project design agreements with global software companies for numerous new Intel products & technologies, including over 100 project agreements for Intel’s high-end server product for which no software existed prior to product rollout. Launched software & applications supporting nearly 12 new Intel server products in 6 years. \n• Facilitated rapid initiation of high impact programs by delivering comprehensive assessment of the Russian & Chinese markets, including strategies & key targets for locally executed enabling teams & programs. Obtained Divisional Recognition Award. \n• Prepared bi-annual 5-year roadmaps aligning software development & solutions to support new platform & technology features & uses. \n• Delivered annual 3-year product line business plans that delineated key objectives, identified competitive threats & provided project & resource portfolios to attain business objectives. \n• Developed effective strategies & plans for competitive differentiation by analyzing industry partner relationships & obtaining their input on efficacy of Intel strategies & business models. Industry Initiative Program Manager Intel Corporation 1998  –  1999  (1 year) Headed a server manufacturer industry initiative to identify, standardize & commoditize non-proprietary server hardware components. Targeted the reduction of design & manufacturing costs as well as the cutback of design lead times for better time-to-market delivery of products at more competitive prices. Indirectly oversaw a team of senior design engineers that identified & developed specifications for individual server hardware components. Recruited members and served as Chair for an industry task force comprised of senior engineering representatives from IBM, HP, Dell, Fujitsu, SGI, Hitachi and EMC who reviewed & ratified industry-standard specifications for agreed upon server hardware components. Negotiated with global server vendors to develop products based on industry standard specifications. \n \n• Contributed to a market share growth of over 80% in a 4-year timeframe by developing a widely supported standard high volume server with Intel architecture. \n• Collaborated with a diverse group of OEMs (i.e. IBM, HP, Dell) in an internal organizational matrix structure. Drove the development & implementation of a market-segmented array of open industry server component specifications despite no line authority over spec authors. Facilitated the broad & rapid availability of Server System Infrastructure (SSI) compliant products in the marketplace. Leveraged effective networking skills to establish a solid Independent Hardware Vendor (IHV) base of support. \n• Built profitable relationships with over 10 multi-national OEMs & over 50 server hardware component vendors committed to supporting & delivering products using the industry-standard designs. \n• Successfully spearheaded a matrix team of senior design engineers to develop over 20 industry standards for server hardware components. \n• Received Divisional Recognition Award for successfully delivering the first global industry-standard design initiative for server manufacturers & their component vendors. Industry Initiative Program Manager Intel Corporation 1998  –  1999  (1 year) Headed a server manufacturer industry initiative to identify, standardize & commoditize non-proprietary server hardware components. Targeted the reduction of design & manufacturing costs as well as the cutback of design lead times for better time-to-market delivery of products at more competitive prices. Indirectly oversaw a team of senior design engineers that identified & developed specifications for individual server hardware components. Recruited members and served as Chair for an industry task force comprised of senior engineering representatives from IBM, HP, Dell, Fujitsu, SGI, Hitachi and EMC who reviewed & ratified industry-standard specifications for agreed upon server hardware components. Negotiated with global server vendors to develop products based on industry standard specifications. \n \n• Contributed to a market share growth of over 80% in a 4-year timeframe by developing a widely supported standard high volume server with Intel architecture. \n• Collaborated with a diverse group of OEMs (i.e. IBM, HP, Dell) in an internal organizational matrix structure. Drove the development & implementation of a market-segmented array of open industry server component specifications despite no line authority over spec authors. Facilitated the broad & rapid availability of Server System Infrastructure (SSI) compliant products in the marketplace. Leveraged effective networking skills to establish a solid Independent Hardware Vendor (IHV) base of support. \n• Built profitable relationships with over 10 multi-national OEMs & over 50 server hardware component vendors committed to supporting & delivering products using the industry-standard designs. \n• Successfully spearheaded a matrix team of senior design engineers to develop over 20 industry standards for server hardware components. \n• Received Divisional Recognition Award for successfully delivering the first global industry-standard design initiative for server manufacturers & their component vendors. Engineering Program Manager Intel Corporation 1996  –  1998  (2 years) Concurrently managed 6 server platforms. Internalized requirements from component product development teams. Prepared overall project plans including program engineering and new product introduction milestone and deliverable schedules. Defined team goals, achieving team buy-in. Established team member functions and expectations. Resolved team conflict issues and instituted a decision making process. \n \n• Skillfully specified, designed (with vendor), and validated 3 simultaneous server platforms in 4 months by leading 2 specifically created engineering design teams. Helped company recover from a previous product delivery slip. \n• Attained Intel product delivery needs and product cost objectives by successfully negotiating product design and production delivery schedules with vendors and partnering with Commodity Management to negotiate product unit costs.  \n• Developed and implemented a formal new product introduction (NPI) process for power subsystem. Established best practices for ideal power subsystem design, evaluation plans, and schedules. Obtained both internal and external engineering staffs’ agreement for process plans and schedules. Engineering Program Manager Intel Corporation 1996  –  1998  (2 years) Concurrently managed 6 server platforms. Internalized requirements from component product development teams. Prepared overall project plans including program engineering and new product introduction milestone and deliverable schedules. Defined team goals, achieving team buy-in. Established team member functions and expectations. Resolved team conflict issues and instituted a decision making process. \n \n• Skillfully specified, designed (with vendor), and validated 3 simultaneous server platforms in 4 months by leading 2 specifically created engineering design teams. Helped company recover from a previous product delivery slip. \n• Attained Intel product delivery needs and product cost objectives by successfully negotiating product design and production delivery schedules with vendors and partnering with Commodity Management to negotiate product unit costs.  \n• Developed and implemented a formal new product introduction (NPI) process for power subsystem. Established best practices for ideal power subsystem design, evaluation plans, and schedules. Obtained both internal and external engineering staffs’ agreement for process plans and schedules. Skills Messaging Analyst Relations Strategic Partnerships Marketing Strategy Program Management Cross-functional Team... Marketing Communications Integrated Marketing Go-to-market Strategy Competitive Analysis Strategic Communications Corporate Communications Enterprise Software Product Development Strategic Planning Business Development Leadership Product Launch Strategy Market Research Marketing Management Business Planning See 8+     See less Skills  Messaging Analyst Relations Strategic Partnerships Marketing Strategy Program Management Cross-functional Team... Marketing Communications Integrated Marketing Go-to-market Strategy Competitive Analysis Strategic Communications Corporate Communications Enterprise Software Product Development Strategic Planning Business Development Leadership Product Launch Strategy Market Research Marketing Management Business Planning See 8+     See less Messaging Analyst Relations Strategic Partnerships Marketing Strategy Program Management Cross-functional Team... Marketing Communications Integrated Marketing Go-to-market Strategy Competitive Analysis Strategic Communications Corporate Communications Enterprise Software Product Development Strategic Planning Business Development Leadership Product Launch Strategy Market Research Marketing Management Business Planning See 8+     See less Messaging Analyst Relations Strategic Partnerships Marketing Strategy Program Management Cross-functional Team... Marketing Communications Integrated Marketing Go-to-market Strategy Competitive Analysis Strategic Communications Corporate Communications Enterprise Software Product Development Strategic Planning Business Development Leadership Product Launch Strategy Market Research Marketing Management Business Planning See 8+     See less Education University of Utah - David Eccles School of Business B.A.,  Marketing M. B. A. Coursework University of Utah - David Eccles School of Business B.A.,  Marketing M. B. A. Coursework University of Utah - David Eccles School of Business B.A.,  Marketing M. B. A. Coursework University of Utah - David Eccles School of Business B.A.,  Marketing M. B. A. Coursework Honors & Awards Additional Honors & Awards Graduate - Center for Creative Leadership Additional Honors & Awards Graduate - Center for Creative Leadership Additional Honors & Awards Graduate - Center for Creative Leadership Additional Honors & Awards Graduate - Center for Creative Leadership ", "Summary Mary is an accomplished, results-driven marketing manager with over 20 years of experience in the high-tech industry. She is skilled at developing sales and marketing programs to grow revenues.  \nShe excels at building and influencing relationships, as well as developing and implementing strategies to meet business goals. In addition, Mary was the founder of a small business that now employs over 13 people with an annual budget of over $1m/year. How many people can say they successfully started their own business? Check it out: www.arcoirisschool dot org Summary Mary is an accomplished, results-driven marketing manager with over 20 years of experience in the high-tech industry. She is skilled at developing sales and marketing programs to grow revenues.  \nShe excels at building and influencing relationships, as well as developing and implementing strategies to meet business goals. In addition, Mary was the founder of a small business that now employs over 13 people with an annual budget of over $1m/year. How many people can say they successfully started their own business? Check it out: www.arcoirisschool dot org Mary is an accomplished, results-driven marketing manager with over 20 years of experience in the high-tech industry. She is skilled at developing sales and marketing programs to grow revenues.  \nShe excels at building and influencing relationships, as well as developing and implementing strategies to meet business goals. In addition, Mary was the founder of a small business that now employs over 13 people with an annual budget of over $1m/year. How many people can say they successfully started their own business? Check it out: www.arcoirisschool dot org Mary is an accomplished, results-driven marketing manager with over 20 years of experience in the high-tech industry. She is skilled at developing sales and marketing programs to grow revenues.  \nShe excels at building and influencing relationships, as well as developing and implementing strategies to meet business goals. In addition, Mary was the founder of a small business that now employs over 13 people with an annual budget of over $1m/year. How many people can say they successfully started their own business? Check it out: www.arcoirisschool dot org Experience Marketing Manager Intel Corporation 2014  – Present (1 year) Portland, Oregon Area Project Manager in the Digital Marketing & Media group. Updating Intel’s Social Media guidelines, playbook and training courses. Helping to implement new listening and moderating social media platform globally. Marketing Project Manager Intel Corporation January 2010  –  December 2013  (4 years) Portland, Oregon Area Strategic Procurement Manager Hewlett-Packard (HP) June 2007  –  November 2009  (2 years 6 months) Senior Marketing Manager Intel Corporation 1989  –  2006  (17 years) Capital Equipment Commodity Manager Intel Corporation 1989  –  2006  (17 years) Procurement Manager Intel Corporation 1989  –  2006  (17 years) Inventory Analyst Apple Computer 1988  –  1988  (less than a year) Ambassador of Goodwill Biwako Kisen; Kyoto, Japan 1985  –  1986  (1 year) Marketing Manager Intel Corporation 2014  – Present (1 year) Portland, Oregon Area Project Manager in the Digital Marketing & Media group. Updating Intel’s Social Media guidelines, playbook and training courses. Helping to implement new listening and moderating social media platform globally. Marketing Manager Intel Corporation 2014  – Present (1 year) Portland, Oregon Area Project Manager in the Digital Marketing & Media group. Updating Intel’s Social Media guidelines, playbook and training courses. Helping to implement new listening and moderating social media platform globally. Marketing Project Manager Intel Corporation January 2010  –  December 2013  (4 years) Portland, Oregon Area Marketing Project Manager Intel Corporation January 2010  –  December 2013  (4 years) Portland, Oregon Area Strategic Procurement Manager Hewlett-Packard (HP) June 2007  –  November 2009  (2 years 6 months) Strategic Procurement Manager Hewlett-Packard (HP) June 2007  –  November 2009  (2 years 6 months) Senior Marketing Manager Intel Corporation 1989  –  2006  (17 years) Senior Marketing Manager Intel Corporation 1989  –  2006  (17 years) Capital Equipment Commodity Manager Intel Corporation 1989  –  2006  (17 years) Capital Equipment Commodity Manager Intel Corporation 1989  –  2006  (17 years) Procurement Manager Intel Corporation 1989  –  2006  (17 years) Procurement Manager Intel Corporation 1989  –  2006  (17 years) Inventory Analyst Apple Computer 1988  –  1988  (less than a year) Inventory Analyst Apple Computer 1988  –  1988  (less than a year) Ambassador of Goodwill Biwako Kisen; Kyoto, Japan 1985  –  1986  (1 year) Ambassador of Goodwill Biwako Kisen; Kyoto, Japan 1985  –  1986  (1 year) Skills SharePoint Strategic Thinking Cross-functional Team... Program Management Supply Management Vendor Management Strategic Sourcing Product Management Supply Chain Management Strategy Process Improvement Contract Negotiation Management Procurement Start-ups Strategic Planning Forecasting Manufacturing Supply Chain Change Management CRM Budgets Negotiation Purchasing Training Strategic Partnerships Leadership Marketing Lean Manufacturing Project Planning Digital Marketing Business Strategy Go-to-market Strategy Integrated Marketing Operations Management Marketing Management Team Leadership Business Development Sourcing Contract Management Product Marketing Business Process... Competitive Analysis Multi-channel Marketing Product Development Direct Marketing Outsourcing Six Sigma Semiconductors Sales See 35+     See less Skills  SharePoint Strategic Thinking Cross-functional Team... Program Management Supply Management Vendor Management Strategic Sourcing Product Management Supply Chain Management Strategy Process Improvement Contract Negotiation Management Procurement Start-ups Strategic Planning Forecasting Manufacturing Supply Chain Change Management CRM Budgets Negotiation Purchasing Training Strategic Partnerships Leadership Marketing Lean Manufacturing Project Planning Digital Marketing Business Strategy Go-to-market Strategy Integrated Marketing Operations Management Marketing Management Team Leadership Business Development Sourcing Contract Management Product Marketing Business Process... Competitive Analysis Multi-channel Marketing Product Development Direct Marketing Outsourcing Six Sigma Semiconductors Sales See 35+     See less SharePoint Strategic Thinking Cross-functional Team... Program Management Supply Management Vendor Management Strategic Sourcing Product Management Supply Chain Management Strategy Process Improvement Contract Negotiation Management Procurement Start-ups Strategic Planning Forecasting Manufacturing Supply Chain Change Management CRM Budgets Negotiation Purchasing Training Strategic Partnerships Leadership Marketing Lean Manufacturing Project Planning Digital Marketing Business Strategy Go-to-market Strategy Integrated Marketing Operations Management Marketing Management Team Leadership Business Development Sourcing Contract Management Product Marketing Business Process... Competitive Analysis Multi-channel Marketing Product Development Direct Marketing Outsourcing Six Sigma Semiconductors Sales See 35+     See less SharePoint Strategic Thinking Cross-functional Team... Program Management Supply Management Vendor Management Strategic Sourcing Product Management Supply Chain Management Strategy Process Improvement Contract Negotiation Management Procurement Start-ups Strategic Planning Forecasting Manufacturing Supply Chain Change Management CRM Budgets Negotiation Purchasing Training Strategic Partnerships Leadership Marketing Lean Manufacturing Project Planning Digital Marketing Business Strategy Go-to-market Strategy Integrated Marketing Operations Management Marketing Management Team Leadership Business Development Sourcing Contract Management Product Marketing Business Process... Competitive Analysis Multi-channel Marketing Product Development Direct Marketing Outsourcing Six Sigma Semiconductors Sales See 35+     See less Education Santa Clara University MBA,  International Bus. 1993 Michigan State University BA,  Supply Chain Management 1984  – 1989 Okemos High School Santa Clara University MBA,  International Bus. 1993 Santa Clara University MBA,  International Bus. 1993 Santa Clara University MBA,  International Bus. 1993 Michigan State University BA,  Supply Chain Management 1984  – 1989 Michigan State University BA,  Supply Chain Management 1984  – 1989 Michigan State University BA,  Supply Chain Management 1984  – 1989 Okemos High School Okemos High School Okemos High School Honors & Awards Additional Honors & Awards - Nominated for the 2004 New Mexico Governor’s Award - recognizes women for outstanding community leadership, advocacy for positive change for women and families, and leadership in their careers. \n- Intel Divisional Recognition Award for developing and implementing worldwide continuous improvement procedures. \n- Intel Divisional Recognition Award for vendor design improvements Additional Honors & Awards - Nominated for the 2004 New Mexico Governor’s Award - recognizes women for outstanding community leadership, advocacy for positive change for women and families, and leadership in their careers. \n- Intel Divisional Recognition Award for developing and implementing worldwide continuous improvement procedures. \n- Intel Divisional Recognition Award for vendor design improvements Additional Honors & Awards - Nominated for the 2004 New Mexico Governor’s Award - recognizes women for outstanding community leadership, advocacy for positive change for women and families, and leadership in their careers. \n- Intel Divisional Recognition Award for developing and implementing worldwide continuous improvement procedures. \n- Intel Divisional Recognition Award for vendor design improvements Additional Honors & Awards - Nominated for the 2004 New Mexico Governor’s Award - recognizes women for outstanding community leadership, advocacy for positive change for women and families, and leadership in their careers. \n- Intel Divisional Recognition Award for developing and implementing worldwide continuous improvement procedures. \n- Intel Divisional Recognition Award for vendor design improvements ", "Summary Dedicated business and technology leader reaches beyond job scope to lead cross-functional teams that generate innovative alliance strategies, new market verticals, product improvements, and increased sales. Leverages engineering and project management expertise to collaborate with diverse stakeholders, grasp key business drivers, and drive strategic process enhancements. Summary Dedicated business and technology leader reaches beyond job scope to lead cross-functional teams that generate innovative alliance strategies, new market verticals, product improvements, and increased sales. Leverages engineering and project management expertise to collaborate with diverse stakeholders, grasp key business drivers, and drive strategic process enhancements. Dedicated business and technology leader reaches beyond job scope to lead cross-functional teams that generate innovative alliance strategies, new market verticals, product improvements, and increased sales. Leverages engineering and project management expertise to collaborate with diverse stakeholders, grasp key business drivers, and drive strategic process enhancements. Dedicated business and technology leader reaches beyond job scope to lead cross-functional teams that generate innovative alliance strategies, new market verticals, product improvements, and increased sales. Leverages engineering and project management expertise to collaborate with diverse stakeholders, grasp key business drivers, and drive strategic process enhancements. Experience Market Development Manager Intel Corporation August 2013  – Present (2 years 1 month) Santa Clara, CA Responsible for growing the adoption of Ethernet, computing and storage products used in client (corporate, consumer and mobile), server and specific embedded applications. Is the primary interface to the sales channel by providing product, pricing, and positioning information to rapidly move these opportunities through the Design Win/sales cycle. Being engaged with key accounts throughout the discovery, evaluation, negotiation, and closing phases of the Design Win process and help resolve customer issues. Senior Marketing Manager Intel Corporation June 2013  –  August 2013  (3 months) Folsom, CA Led team of marketers to scale and promote Intel products and technologies for Enterprise Cloud security, API management and Hadoop Big Data distribution. Managed the product portfolio for Intel Expressway Security Gateway, Intel Expressway API Manager and Intel Expressway Tokenization Broker. Business and Services Manager Intel Corporation August 2010  –  July 2013  (3 years) Folsom, CA Built and led Intel’s Private Cloud Service comprised of a cross-functional engineers, field sales, business analysts and technical writers that support technical sales and roadmap alliance for new Hybrid Cloud technology, software defined networking, new market Disaster Recovery Product and enterprise storage & networking devices.  \n \n- On-boarded value-add partners to expand Channel and sell to opportunities. Managed business development plan, roadmap alignment and external sales engineer training with ISVs, HOEMs and MNCs. \n \n- Established sales development plans and technology alliance in partnership with $MM revenue companies representing health care, printing, SMB, remote management and monitoring, and backup and disaster recovery industries. Senior Technical Marketing Engineer Intel 2005  –  August 2010  (5 years) Folsom, CA Tasked with enabling new industry technology, Intel architecture adoption and ecosystem readiness with partners; creating go to market plan that resulted in 10X Channel server processor business growth and worldwide TAM expansion.  \n \n- Technical lead for 50+ Xeon processors and server platform launches. Supported many sales wins such as a new market with iCafe in PRC and the win back of high-value EMEA customer, leading to lucrative HPC sale. \n \n- Chosen to work overseas in the People’s Republic of China as the Intel Field Application Engineer throughout 2008. Design Engineer Cascade Systems Technology 2000  –  2005  (5 years) Hillsboro, OR Cultivated project management and engineering design talents; managed 20+ projects that created products including industrial machine controllers, medical devices, battery testers, digital lighting, and processor test tools. Market Development Manager Intel Corporation August 2013  – Present (2 years 1 month) Santa Clara, CA Responsible for growing the adoption of Ethernet, computing and storage products used in client (corporate, consumer and mobile), server and specific embedded applications. Is the primary interface to the sales channel by providing product, pricing, and positioning information to rapidly move these opportunities through the Design Win/sales cycle. Being engaged with key accounts throughout the discovery, evaluation, negotiation, and closing phases of the Design Win process and help resolve customer issues. Market Development Manager Intel Corporation August 2013  – Present (2 years 1 month) Santa Clara, CA Responsible for growing the adoption of Ethernet, computing and storage products used in client (corporate, consumer and mobile), server and specific embedded applications. Is the primary interface to the sales channel by providing product, pricing, and positioning information to rapidly move these opportunities through the Design Win/sales cycle. Being engaged with key accounts throughout the discovery, evaluation, negotiation, and closing phases of the Design Win process and help resolve customer issues. Senior Marketing Manager Intel Corporation June 2013  –  August 2013  (3 months) Folsom, CA Led team of marketers to scale and promote Intel products and technologies for Enterprise Cloud security, API management and Hadoop Big Data distribution. Managed the product portfolio for Intel Expressway Security Gateway, Intel Expressway API Manager and Intel Expressway Tokenization Broker. Senior Marketing Manager Intel Corporation June 2013  –  August 2013  (3 months) Folsom, CA Led team of marketers to scale and promote Intel products and technologies for Enterprise Cloud security, API management and Hadoop Big Data distribution. Managed the product portfolio for Intel Expressway Security Gateway, Intel Expressway API Manager and Intel Expressway Tokenization Broker. Business and Services Manager Intel Corporation August 2010  –  July 2013  (3 years) Folsom, CA Built and led Intel’s Private Cloud Service comprised of a cross-functional engineers, field sales, business analysts and technical writers that support technical sales and roadmap alliance for new Hybrid Cloud technology, software defined networking, new market Disaster Recovery Product and enterprise storage & networking devices.  \n \n- On-boarded value-add partners to expand Channel and sell to opportunities. Managed business development plan, roadmap alignment and external sales engineer training with ISVs, HOEMs and MNCs. \n \n- Established sales development plans and technology alliance in partnership with $MM revenue companies representing health care, printing, SMB, remote management and monitoring, and backup and disaster recovery industries. Business and Services Manager Intel Corporation August 2010  –  July 2013  (3 years) Folsom, CA Built and led Intel’s Private Cloud Service comprised of a cross-functional engineers, field sales, business analysts and technical writers that support technical sales and roadmap alliance for new Hybrid Cloud technology, software defined networking, new market Disaster Recovery Product and enterprise storage & networking devices.  \n \n- On-boarded value-add partners to expand Channel and sell to opportunities. Managed business development plan, roadmap alignment and external sales engineer training with ISVs, HOEMs and MNCs. \n \n- Established sales development plans and technology alliance in partnership with $MM revenue companies representing health care, printing, SMB, remote management and monitoring, and backup and disaster recovery industries. Senior Technical Marketing Engineer Intel 2005  –  August 2010  (5 years) Folsom, CA Tasked with enabling new industry technology, Intel architecture adoption and ecosystem readiness with partners; creating go to market plan that resulted in 10X Channel server processor business growth and worldwide TAM expansion.  \n \n- Technical lead for 50+ Xeon processors and server platform launches. Supported many sales wins such as a new market with iCafe in PRC and the win back of high-value EMEA customer, leading to lucrative HPC sale. \n \n- Chosen to work overseas in the People’s Republic of China as the Intel Field Application Engineer throughout 2008. Senior Technical Marketing Engineer Intel 2005  –  August 2010  (5 years) Folsom, CA Tasked with enabling new industry technology, Intel architecture adoption and ecosystem readiness with partners; creating go to market plan that resulted in 10X Channel server processor business growth and worldwide TAM expansion.  \n \n- Technical lead for 50+ Xeon processors and server platform launches. Supported many sales wins such as a new market with iCafe in PRC and the win back of high-value EMEA customer, leading to lucrative HPC sale. \n \n- Chosen to work overseas in the People’s Republic of China as the Intel Field Application Engineer throughout 2008. Design Engineer Cascade Systems Technology 2000  –  2005  (5 years) Hillsboro, OR Cultivated project management and engineering design talents; managed 20+ projects that created products including industrial machine controllers, medical devices, battery testers, digital lighting, and processor test tools. Design Engineer Cascade Systems Technology 2000  –  2005  (5 years) Hillsboro, OR Cultivated project management and engineering design talents; managed 20+ projects that created products including industrial machine controllers, medical devices, battery testers, digital lighting, and processor test tools. Skills Semiconductors SoC ASIC Processors Embedded Systems Intel IC Go-to-market Strategy Product Management Product Marketing Wireless Cross-functional Team... Cloud Computing Product Development Competitive Analysis People Development Hybrid Cloud Virtualization Storage Area Networks Software Defined... OpenStack Direct team management GPU Networking Business Development Sales Channel... Technical Marketing Disaster Recovery Security Strategy Business Alliances Computer Architecture High Performance... Mobile Devices Debugging Storage See 21+     See less Skills  Semiconductors SoC ASIC Processors Embedded Systems Intel IC Go-to-market Strategy Product Management Product Marketing Wireless Cross-functional Team... Cloud Computing Product Development Competitive Analysis People Development Hybrid Cloud Virtualization Storage Area Networks Software Defined... OpenStack Direct team management GPU Networking Business Development Sales Channel... Technical Marketing Disaster Recovery Security Strategy Business Alliances Computer Architecture High Performance... Mobile Devices Debugging Storage See 21+     See less Semiconductors SoC ASIC Processors Embedded Systems Intel IC Go-to-market Strategy Product Management Product Marketing Wireless Cross-functional Team... Cloud Computing Product Development Competitive Analysis People Development Hybrid Cloud Virtualization Storage Area Networks Software Defined... OpenStack Direct team management GPU Networking Business Development Sales Channel... Technical Marketing Disaster Recovery Security Strategy Business Alliances Computer Architecture High Performance... Mobile Devices Debugging Storage See 21+     See less Semiconductors SoC ASIC Processors Embedded Systems Intel IC Go-to-market Strategy Product Management Product Marketing Wireless Cross-functional Team... Cloud Computing Product Development Competitive Analysis People Development Hybrid Cloud Virtualization Storage Area Networks Software Defined... OpenStack Direct team management GPU Networking Business Development Sales Channel... Technical Marketing Disaster Recovery Security Strategy Business Alliances Computer Architecture High Performance... Mobile Devices Debugging Storage See 21+     See less Education Oregon State University BS,  Electrical Engineering 1997  – 2001 Oregon State University BS,  Electrical Engineering 1997  – 2001 Oregon State University BS,  Electrical Engineering 1997  – 2001 Oregon State University BS,  Electrical Engineering 1997  – 2001 ", "Languages English English English Skills Agile Project Management Program Management IT Strategy Enterprise Software Vendor Management Cloud Computing Project Portfolio... Business Process... Product Management Agile Methodologies Cross-functional Team... Business Intelligence Enterprise Architecture IT Management Analytics Requirements Analysis Infrastructure Six Sigma Marketing Strategy Network Engineering Active Directory Windows Server Virtualization Strategic Leadership Technical Leadership Security Business Process... Management ITIL Strategy Integration Leadership SaaS Product Development Software Development Software Project... See 21+     See less Skills  Agile Project Management Program Management IT Strategy Enterprise Software Vendor Management Cloud Computing Project Portfolio... Business Process... Product Management Agile Methodologies Cross-functional Team... Business Intelligence Enterprise Architecture IT Management Analytics Requirements Analysis Infrastructure Six Sigma Marketing Strategy Network Engineering Active Directory Windows Server Virtualization Strategic Leadership Technical Leadership Security Business Process... Management ITIL Strategy Integration Leadership SaaS Product Development Software Development Software Project... See 21+     See less Agile Project Management Program Management IT Strategy Enterprise Software Vendor Management Cloud Computing Project Portfolio... Business Process... Product Management Agile Methodologies Cross-functional Team... Business Intelligence Enterprise Architecture IT Management Analytics Requirements Analysis Infrastructure Six Sigma Marketing Strategy Network Engineering Active Directory Windows Server Virtualization Strategic Leadership Technical Leadership Security Business Process... Management ITIL Strategy Integration Leadership SaaS Product Development Software Development Software Project... See 21+     See less Agile Project Management Program Management IT Strategy Enterprise Software Vendor Management Cloud Computing Project Portfolio... Business Process... Product Management Agile Methodologies Cross-functional Team... Business Intelligence Enterprise Architecture IT Management Analytics Requirements Analysis Infrastructure Six Sigma Marketing Strategy Network Engineering Active Directory Windows Server Virtualization Strategic Leadership Technical Leadership Security Business Process... Management ITIL Strategy Integration Leadership SaaS Product Development Software Development Software Project... See 21+     See less Honors & Awards ", "Skills Product Marketing Go-to-market Strategy Product Management Strategic Partnerships Competitive Analysis Marketing Strategy Skills  Product Marketing Go-to-market Strategy Product Management Strategic Partnerships Competitive Analysis Marketing Strategy Product Marketing Go-to-market Strategy Product Management Strategic Partnerships Competitive Analysis Marketing Strategy Product Marketing Go-to-market Strategy Product Management Strategic Partnerships Competitive Analysis Marketing Strategy ", "Experience Senior Marketing Manager Intel Corporation 1996  – Present (19 years) Marketing Manager Sequent 1988  –  1996  (8 years) Senior Marketing Manager Intel Corporation 1996  – Present (19 years) Senior Marketing Manager Intel Corporation 1996  – Present (19 years) Marketing Manager Sequent 1988  –  1996  (8 years) Marketing Manager Sequent 1988  –  1996  (8 years) Skills Go-to-market Strategy Demand Generation Cloud Computing Product Marketing Product Management Sales Enablement Lead Generation Enterprise Software Strategic Partnerships Multi-channel Marketing Business Alliances Start-ups Skills  Go-to-market Strategy Demand Generation Cloud Computing Product Marketing Product Management Sales Enablement Lead Generation Enterprise Software Strategic Partnerships Multi-channel Marketing Business Alliances Start-ups Go-to-market Strategy Demand Generation Cloud Computing Product Marketing Product Management Sales Enablement Lead Generation Enterprise Software Strategic Partnerships Multi-channel Marketing Business Alliances Start-ups Go-to-market Strategy Demand Generation Cloud Computing Product Marketing Product Management Sales Enablement Lead Generation Enterprise Software Strategic Partnerships Multi-channel Marketing Business Alliances Start-ups ", "Languages English, Spanish, French English, Spanish, French English, Spanish, French Skills Public Relations Corporate Communications Strategic Partnerships Product Marketing Online Marketing Multi-channel Marketing Copywriting Lead Generation Integrated Marketing Digital Media Marketing Management Marketing Communications Start-ups Social Media Marketing Press Releases Marketing Leadership Media Relations Market Planning Web Design Management Email Marketing Internal Communications Product Development Marketing Strategy Brand Development Business Strategy SEO Digital Marketing Advertising Market Research Online Advertising Product Management Strategy Cross-functional Team... Product Launch Social Media Competitive Analysis Strategic Planning Program Management See 25+     See less Skills  Public Relations Corporate Communications Strategic Partnerships Product Marketing Online Marketing Multi-channel Marketing Copywriting Lead Generation Integrated Marketing Digital Media Marketing Management Marketing Communications Start-ups Social Media Marketing Press Releases Marketing Leadership Media Relations Market Planning Web Design Management Email Marketing Internal Communications Product Development Marketing Strategy Brand Development Business Strategy SEO Digital Marketing Advertising Market Research Online Advertising Product Management Strategy Cross-functional Team... Product Launch Social Media Competitive Analysis Strategic Planning Program Management See 25+     See less Public Relations Corporate Communications Strategic Partnerships Product Marketing Online Marketing Multi-channel Marketing Copywriting Lead Generation Integrated Marketing Digital Media Marketing Management Marketing Communications Start-ups Social Media Marketing Press Releases Marketing Leadership Media Relations Market Planning Web Design Management Email Marketing Internal Communications Product Development Marketing Strategy Brand Development Business Strategy SEO Digital Marketing Advertising Market Research Online Advertising Product Management Strategy Cross-functional Team... Product Launch Social Media Competitive Analysis Strategic Planning Program Management See 25+     See less Public Relations Corporate Communications Strategic Partnerships Product Marketing Online Marketing Multi-channel Marketing Copywriting Lead Generation Integrated Marketing Digital Media Marketing Management Marketing Communications Start-ups Social Media Marketing Press Releases Marketing Leadership Media Relations Market Planning Web Design Management Email Marketing Internal Communications Product Development Marketing Strategy Brand Development Business Strategy SEO Digital Marketing Advertising Market Research Online Advertising Product Management Strategy Cross-functional Team... Product Launch Social Media Competitive Analysis Strategic Planning Program Management See 25+     See less ", "Languages Spanish Spanish Spanish Skills Cloud Computing High Performance... Enterprise Software Strategic Partnerships Product Management Business Alliances Account Management New Business Development SaaS Management Business Development Go-to-market Strategy Pre-sales Product Marketing Solution Selling Skills  Cloud Computing High Performance... Enterprise Software Strategic Partnerships Product Management Business Alliances Account Management New Business Development SaaS Management Business Development Go-to-market Strategy Pre-sales Product Marketing Solution Selling Cloud Computing High Performance... Enterprise Software Strategic Partnerships Product Management Business Alliances Account Management New Business Development SaaS Management Business Development Go-to-market Strategy Pre-sales Product Marketing Solution Selling Cloud Computing High Performance... Enterprise Software Strategic Partnerships Product Management Business Alliances Account Management New Business Development SaaS Management Business Development Go-to-market Strategy Pre-sales Product Marketing Solution Selling "]}