{"position": "Senior Digital Design Engineer", "company": "Intel Corporation", "profiles": ["Experience Senior Digital Design Engineer Intel Corporation July 2013  – Present (2 years 2 months) Chandler, AZ Senior Digital Design Engineer Fujitsu Semicondutor Limited (FSWP) June 2010  –  July 2013  (3 years 2 months) Senior Digital Design Engineer Fujitsu Microelectronics Limited April 2009  –  June 2010  (1 year 3 months) Digital Design Engineer Freescale Semiconductor June 2005  –  April 2009  (3 years 11 months) Senior Digital Design Engineer Intel Corporation July 2013  – Present (2 years 2 months) Chandler, AZ Senior Digital Design Engineer Intel Corporation July 2013  – Present (2 years 2 months) Chandler, AZ Senior Digital Design Engineer Fujitsu Semicondutor Limited (FSWP) June 2010  –  July 2013  (3 years 2 months) Senior Digital Design Engineer Fujitsu Semicondutor Limited (FSWP) June 2010  –  July 2013  (3 years 2 months) Senior Digital Design Engineer Fujitsu Microelectronics Limited April 2009  –  June 2010  (1 year 3 months) Senior Digital Design Engineer Fujitsu Microelectronics Limited April 2009  –  June 2010  (1 year 3 months) Digital Design Engineer Freescale Semiconductor June 2005  –  April 2009  (3 years 11 months) Digital Design Engineer Freescale Semiconductor June 2005  –  April 2009  (3 years 11 months) Languages English Native or bilingual proficiency Hindi Native or bilingual proficiency Gujarati Native or bilingual proficiency Malayalam Native or bilingual proficiency English Native or bilingual proficiency Hindi Native or bilingual proficiency Gujarati Native or bilingual proficiency Malayalam Native or bilingual proficiency English Native or bilingual proficiency Hindi Native or bilingual proficiency Gujarati Native or bilingual proficiency Malayalam Native or bilingual proficiency Native or bilingual proficiency Native or bilingual proficiency Native or bilingual proficiency Native or bilingual proficiency Skills IC Mixed Signal SoC Verilog Analog Circuit Design ASIC Static Timing Analysis CMOS Integrated Circuit... RTL design VLSI Embedded Systems Skills  IC Mixed Signal SoC Verilog Analog Circuit Design ASIC Static Timing Analysis CMOS Integrated Circuit... RTL design VLSI Embedded Systems IC Mixed Signal SoC Verilog Analog Circuit Design ASIC Static Timing Analysis CMOS Integrated Circuit... RTL design VLSI Embedded Systems IC Mixed Signal SoC Verilog Analog Circuit Design ASIC Static Timing Analysis CMOS Integrated Circuit... RTL design VLSI Embedded Systems Education University of Arizona Master of Science,  Electrical and Computer Engineering 2002  – 2005 Gujarat University Bachelor of Engineering,  Electronics and Communication Engineering 1998  – 2002 University of Arizona Master of Science,  Electrical and Computer Engineering 2002  – 2005 University of Arizona Master of Science,  Electrical and Computer Engineering 2002  – 2005 University of Arizona Master of Science,  Electrical and Computer Engineering 2002  – 2005 Gujarat University Bachelor of Engineering,  Electronics and Communication Engineering 1998  – 2002 Gujarat University Bachelor of Engineering,  Electronics and Communication Engineering 1998  – 2002 Gujarat University Bachelor of Engineering,  Electronics and Communication Engineering 1998  – 2002 ", "Experience Solutions Engineer Imagination Technologies June 2014  – Present (1 year 3 months) San Francisco Bay Area Drive and execute technical pre-sales strategies for Imagination’s MIPS Micro-controller and Processor products portfolio for all North America accounts. \n \nWork closely with customers and the internal global Business development/Marketing in understanding the industry trends, customer and competitor landscape. \n \nWork closely with corporate clients, field sales engineers, local account managers as well as colleagues from the global business development, technology marketing and segment marketing teams.  \n \nLead brainstorming sessions with sales force and customers in the conceptualization of new products.\t Senior Program Manager Intel Corporation January 2013  –  May 2014  (1 year 5 months) San Francisco Bay Area Led team a taskforce of select engineers in an integration effort between cross functional teams to make schedule adjustments and mitigate dependencies to deliver projects three months in advance. \n \nDeveloped a training program on basics of every design process in the project development cycle and improved re-allocation of resources improving idle engineering time and scheduling flexibility between projects by 15%. Senior Digital Design Engineer Intel Corporation August 2010  –  January 2013  (2 years 6 months) San Francisco Bay Area Owned the execution of a key portion of the Knight’s Landing project design for the next generation of High-Performance servers. Introduced methodologies for complex designs with more than 1M gates. \n \nResponsible for RTL design, Synthesis, Floorplanning of the design unit and integration into the Full-Chip. Led the verification environment development and delivered on the design of a cache memory controller for Broadwell integrated graphics chip with 30% higher performance \n \nWorked as a part of the team designing the L3 cache for the next generation integrated graphics chip. Designed a pipelined hardware unit to facilitate graphics execution units to access the Shared Local Memory (Scratch pad) portion of the cache to facilitate GPGPU applications. Digital Design Engineer Cirrus Logic Inc May 2008  –  April 2011  (3 years) Influenced management and led the upgrade of design systems from Verilog to industry standard System Verilog, resulting in a 30-40% reduction in development time on future projects due to increased reuse and portability. \n \nCollaborated with external tool vendors and internal application engineers to develop a customer demo model of the design, saving 6 months in re-design effort. This led to early design wins and customer commitment to the product. \n \nDesigned a digital controller for LED lighting. Designed a Delta Sigma Test bit stream generator to generate different test sine wave frequencies to calibrate, self-test and to validate the data path of our seismic data acquisition system. \n \nCreated System models using System verilog and AMS for analog blocks in a mixed signal chip. ASIC Verification Intern Intel February 2008  –  May 2008  (4 months) Owned the verification of interconnect for the South Bridge for an SOC. \n \nResponsibilities included writing and executing the verification testplan, construction of verification environments, writing tests, interacting with external vendor and running regressions. \n \nGained exposure to various protocols like AHB, APB, OCP etc. Solutions Engineer Imagination Technologies June 2014  – Present (1 year 3 months) San Francisco Bay Area Drive and execute technical pre-sales strategies for Imagination’s MIPS Micro-controller and Processor products portfolio for all North America accounts. \n \nWork closely with customers and the internal global Business development/Marketing in understanding the industry trends, customer and competitor landscape. \n \nWork closely with corporate clients, field sales engineers, local account managers as well as colleagues from the global business development, technology marketing and segment marketing teams.  \n \nLead brainstorming sessions with sales force and customers in the conceptualization of new products.\t Solutions Engineer Imagination Technologies June 2014  – Present (1 year 3 months) San Francisco Bay Area Drive and execute technical pre-sales strategies for Imagination’s MIPS Micro-controller and Processor products portfolio for all North America accounts. \n \nWork closely with customers and the internal global Business development/Marketing in understanding the industry trends, customer and competitor landscape. \n \nWork closely with corporate clients, field sales engineers, local account managers as well as colleagues from the global business development, technology marketing and segment marketing teams.  \n \nLead brainstorming sessions with sales force and customers in the conceptualization of new products.\t Senior Program Manager Intel Corporation January 2013  –  May 2014  (1 year 5 months) San Francisco Bay Area Led team a taskforce of select engineers in an integration effort between cross functional teams to make schedule adjustments and mitigate dependencies to deliver projects three months in advance. \n \nDeveloped a training program on basics of every design process in the project development cycle and improved re-allocation of resources improving idle engineering time and scheduling flexibility between projects by 15%. Senior Program Manager Intel Corporation January 2013  –  May 2014  (1 year 5 months) San Francisco Bay Area Led team a taskforce of select engineers in an integration effort between cross functional teams to make schedule adjustments and mitigate dependencies to deliver projects three months in advance. \n \nDeveloped a training program on basics of every design process in the project development cycle and improved re-allocation of resources improving idle engineering time and scheduling flexibility between projects by 15%. Senior Digital Design Engineer Intel Corporation August 2010  –  January 2013  (2 years 6 months) San Francisco Bay Area Owned the execution of a key portion of the Knight’s Landing project design for the next generation of High-Performance servers. Introduced methodologies for complex designs with more than 1M gates. \n \nResponsible for RTL design, Synthesis, Floorplanning of the design unit and integration into the Full-Chip. Led the verification environment development and delivered on the design of a cache memory controller for Broadwell integrated graphics chip with 30% higher performance \n \nWorked as a part of the team designing the L3 cache for the next generation integrated graphics chip. Designed a pipelined hardware unit to facilitate graphics execution units to access the Shared Local Memory (Scratch pad) portion of the cache to facilitate GPGPU applications. Senior Digital Design Engineer Intel Corporation August 2010  –  January 2013  (2 years 6 months) San Francisco Bay Area Owned the execution of a key portion of the Knight’s Landing project design for the next generation of High-Performance servers. Introduced methodologies for complex designs with more than 1M gates. \n \nResponsible for RTL design, Synthesis, Floorplanning of the design unit and integration into the Full-Chip. Led the verification environment development and delivered on the design of a cache memory controller for Broadwell integrated graphics chip with 30% higher performance \n \nWorked as a part of the team designing the L3 cache for the next generation integrated graphics chip. Designed a pipelined hardware unit to facilitate graphics execution units to access the Shared Local Memory (Scratch pad) portion of the cache to facilitate GPGPU applications. Digital Design Engineer Cirrus Logic Inc May 2008  –  April 2011  (3 years) Influenced management and led the upgrade of design systems from Verilog to industry standard System Verilog, resulting in a 30-40% reduction in development time on future projects due to increased reuse and portability. \n \nCollaborated with external tool vendors and internal application engineers to develop a customer demo model of the design, saving 6 months in re-design effort. This led to early design wins and customer commitment to the product. \n \nDesigned a digital controller for LED lighting. Designed a Delta Sigma Test bit stream generator to generate different test sine wave frequencies to calibrate, self-test and to validate the data path of our seismic data acquisition system. \n \nCreated System models using System verilog and AMS for analog blocks in a mixed signal chip. Digital Design Engineer Cirrus Logic Inc May 2008  –  April 2011  (3 years) Influenced management and led the upgrade of design systems from Verilog to industry standard System Verilog, resulting in a 30-40% reduction in development time on future projects due to increased reuse and portability. \n \nCollaborated with external tool vendors and internal application engineers to develop a customer demo model of the design, saving 6 months in re-design effort. This led to early design wins and customer commitment to the product. \n \nDesigned a digital controller for LED lighting. Designed a Delta Sigma Test bit stream generator to generate different test sine wave frequencies to calibrate, self-test and to validate the data path of our seismic data acquisition system. \n \nCreated System models using System verilog and AMS for analog blocks in a mixed signal chip. ASIC Verification Intern Intel February 2008  –  May 2008  (4 months) Owned the verification of interconnect for the South Bridge for an SOC. \n \nResponsibilities included writing and executing the verification testplan, construction of verification environments, writing tests, interacting with external vendor and running regressions. \n \nGained exposure to various protocols like AHB, APB, OCP etc. ASIC Verification Intern Intel February 2008  –  May 2008  (4 months) Owned the verification of interconnect for the South Bridge for an SOC. \n \nResponsibilities included writing and executing the verification testplan, construction of verification environments, writing tests, interacting with external vendor and running regressions. \n \nGained exposure to various protocols like AHB, APB, OCP etc. Languages English Hindi Kannada English Hindi Kannada English Hindi Kannada Skills Verilog SoC ASIC Computer Architecture RTL design SystemVerilog Functional Verification IC Computer Graphics Integrated Circuit... Logic Synthesis Microprocessors Digital Signal... Mixed Signal Semiconductors Analog VLSI Product Management Product Marketing Competitive Analysis Solution Selling See 6+     See less Skills  Verilog SoC ASIC Computer Architecture RTL design SystemVerilog Functional Verification IC Computer Graphics Integrated Circuit... Logic Synthesis Microprocessors Digital Signal... Mixed Signal Semiconductors Analog VLSI Product Management Product Marketing Competitive Analysis Solution Selling See 6+     See less Verilog SoC ASIC Computer Architecture RTL design SystemVerilog Functional Verification IC Computer Graphics Integrated Circuit... Logic Synthesis Microprocessors Digital Signal... Mixed Signal Semiconductors Analog VLSI Product Management Product Marketing Competitive Analysis Solution Selling See 6+     See less Verilog SoC ASIC Computer Architecture RTL design SystemVerilog Functional Verification IC Computer Graphics Integrated Circuit... Logic Synthesis Microprocessors Digital Signal... Mixed Signal Semiconductors Analog VLSI Product Management Product Marketing Competitive Analysis Solution Selling See 6+     See less Education University of California, Berkeley, Haas School of Business Master of Business Administration (M.B.A.),  Business Administration and Management , General 2014  – 2017 Arizona State University Masters of Science,  Electrical Engineering 2006  – 2008 Specialization: Mixed Signal IC design BMS College of Engineering Bachelor,  Engineering; Electrical and Electronics engineering 2002  – 2006 Visvesvaraya Technological University Bachelor of Engineering,  Electrical Engineering 2002  – 2006 University of California, Berkeley, Haas School of Business Master of Business Administration (M.B.A.),  Business Administration and Management , General 2014  – 2017 University of California, Berkeley, Haas School of Business Master of Business Administration (M.B.A.),  Business Administration and Management , General 2014  – 2017 University of California, Berkeley, Haas School of Business Master of Business Administration (M.B.A.),  Business Administration and Management , General 2014  – 2017 Arizona State University Masters of Science,  Electrical Engineering 2006  – 2008 Specialization: Mixed Signal IC design Arizona State University Masters of Science,  Electrical Engineering 2006  – 2008 Specialization: Mixed Signal IC design Arizona State University Masters of Science,  Electrical Engineering 2006  – 2008 Specialization: Mixed Signal IC design BMS College of Engineering Bachelor,  Engineering; Electrical and Electronics engineering 2002  – 2006 BMS College of Engineering Bachelor,  Engineering; Electrical and Electronics engineering 2002  – 2006 BMS College of Engineering Bachelor,  Engineering; Electrical and Electronics engineering 2002  – 2006 Visvesvaraya Technological University Bachelor of Engineering,  Electrical Engineering 2002  – 2006 Visvesvaraya Technological University Bachelor of Engineering,  Electrical Engineering 2002  – 2006 Visvesvaraya Technological University Bachelor of Engineering,  Electrical Engineering 2002  – 2006 Honors & Awards Additional Honors & Awards National Talent Search Scholar Additional Honors & Awards National Talent Search Scholar Additional Honors & Awards National Talent Search Scholar Additional Honors & Awards National Talent Search Scholar ", "Experience Senior Digital Design Engineer Intel Corporation July 2011  – Present (4 years 2 months) FPGA Design Engineer Intune Networks October 2008  –  June 2011  (2 years 9 months) Ireland Digital Design Engineer Xilinx August 2007  –  September 2008  (1 year 2 months) Ireland Senior Digital Design Engineer Intel Corporation July 2011  – Present (4 years 2 months) Senior Digital Design Engineer Intel Corporation July 2011  – Present (4 years 2 months) FPGA Design Engineer Intune Networks October 2008  –  June 2011  (2 years 9 months) Ireland FPGA Design Engineer Intune Networks October 2008  –  June 2011  (2 years 9 months) Ireland Digital Design Engineer Xilinx August 2007  –  September 2008  (1 year 2 months) Ireland Digital Design Engineer Xilinx August 2007  –  September 2008  (1 year 2 months) Ireland Skills ASIC Integrated Circuit... FPGA SoC Verilog VHDL Skills  ASIC Integrated Circuit... FPGA SoC Verilog VHDL ASIC Integrated Circuit... FPGA SoC Verilog VHDL ASIC Integrated Circuit... FPGA SoC Verilog VHDL Education Università degli Studi di Padova Microelectronics,  Electronics Engineering Università degli Studi di Padova Microelectronics,  Electronics Engineering Università degli Studi di Padova Microelectronics,  Electronics Engineering Università degli Studi di Padova Microelectronics,  Electronics Engineering ", "Experience Senior Digital Design Engineer Intel Corporation November 2014  – Present (10 months) Munich Area, Germany Digital Design Technical Lead ELSYS Eastern Europe March 2013  –  October 2014  (1 year 8 months) Serbia IP development team lead Texas Instruments - Elsys Eastern Europe April 2011  –  June 2013  (2 years 3 months) Serbia Leading a team of up to 12 design and verification engineers responsible of: \n•\tMIPI UNIPRO 1.41 IP development \n•\tDevelopment and verification of JEDEC UFS \n•\tMaintenance and customer support for legacy modules (DSI, CSI2, CSI3) Design Lead - IP development Texas Instruments - HDL Design House November 2007  –  March 2011  (3 years 5 months) MIPI UNIRPRO protocol development and implementation \n•\tTI representative in MIPI UNIPRO working group \n•\tUNIPRO 1.4 IP functional specification \n•\tUNIPRO PIE (Processor Interface Emulation) IP functional specification \nMIPI UNIPRO IP implementations for a series of UNIPRO versions (D-PHY and M-PHY based): \n•\tFull micro-architecture development, design partitioning and task assignment \n•\tInternal design reviews, verification reviews and intra-team support \n•\tRTL development and full front-end design flow (lint, CDC, synthesis, equivalence check, ATPG) Project manager - ASIC design and verification for wireless applications Texas Instruments - HDL Design House June 2006  –  October 2007  (1 year 5 months) Managing a team of 20 ASIC design and verification engineers that worked on: \n•\tFull development and verification of DSI (Display serial interface) \n•\tFull development and verification of CSI2 (Camera serial interface) \n•\tDevelopment and verification of a connectivity module for Chip 2 Chip communication (D2D) \n•\tMaintenance and customer support for emulation modules (DMLED, ICEPICK) \n•\tVerification of power management unit (PRCM) \n•\tVerification of interconnect modules (L3 and L4 OCP interconnect) Quality management consultant HDL Design House December 2005  –  December 2006  (1 year 1 month) Organization, implementation and development of QMS and ISMS. \nCertified auditor for ISO 9001 and ISO 27001 standards. civil service Civil Service September 2005  –  May 2006  (9 months) Mandatory civil service SoC design verification engineer Texas Instruments - HDL Design House December 2004  –  September 2005  (10 months) Nice Area, France SoC verification of on-chip debug architecture for an OMAP platform \n• Verification of emulation and trace peripherals \n• Verification of power, reset and clock management features \n• Development of test-cases in C/asm code executed on ARM/DSP processors \n• JTAG sequence programming in TCL Junior design engineer HDL Design House May 2004  –  November 2004  (7 months) VITAL functional models of Flash memories and SmartMedia cards Senior Digital Design Engineer Intel Corporation November 2014  – Present (10 months) Munich Area, Germany Senior Digital Design Engineer Intel Corporation November 2014  – Present (10 months) Munich Area, Germany Digital Design Technical Lead ELSYS Eastern Europe March 2013  –  October 2014  (1 year 8 months) Serbia Digital Design Technical Lead ELSYS Eastern Europe March 2013  –  October 2014  (1 year 8 months) Serbia IP development team lead Texas Instruments - Elsys Eastern Europe April 2011  –  June 2013  (2 years 3 months) Serbia Leading a team of up to 12 design and verification engineers responsible of: \n•\tMIPI UNIPRO 1.41 IP development \n•\tDevelopment and verification of JEDEC UFS \n•\tMaintenance and customer support for legacy modules (DSI, CSI2, CSI3) IP development team lead Texas Instruments - Elsys Eastern Europe April 2011  –  June 2013  (2 years 3 months) Serbia Leading a team of up to 12 design and verification engineers responsible of: \n•\tMIPI UNIPRO 1.41 IP development \n•\tDevelopment and verification of JEDEC UFS \n•\tMaintenance and customer support for legacy modules (DSI, CSI2, CSI3) Design Lead - IP development Texas Instruments - HDL Design House November 2007  –  March 2011  (3 years 5 months) MIPI UNIRPRO protocol development and implementation \n•\tTI representative in MIPI UNIPRO working group \n•\tUNIPRO 1.4 IP functional specification \n•\tUNIPRO PIE (Processor Interface Emulation) IP functional specification \nMIPI UNIPRO IP implementations for a series of UNIPRO versions (D-PHY and M-PHY based): \n•\tFull micro-architecture development, design partitioning and task assignment \n•\tInternal design reviews, verification reviews and intra-team support \n•\tRTL development and full front-end design flow (lint, CDC, synthesis, equivalence check, ATPG) Design Lead - IP development Texas Instruments - HDL Design House November 2007  –  March 2011  (3 years 5 months) MIPI UNIRPRO protocol development and implementation \n•\tTI representative in MIPI UNIPRO working group \n•\tUNIPRO 1.4 IP functional specification \n•\tUNIPRO PIE (Processor Interface Emulation) IP functional specification \nMIPI UNIPRO IP implementations for a series of UNIPRO versions (D-PHY and M-PHY based): \n•\tFull micro-architecture development, design partitioning and task assignment \n•\tInternal design reviews, verification reviews and intra-team support \n•\tRTL development and full front-end design flow (lint, CDC, synthesis, equivalence check, ATPG) Project manager - ASIC design and verification for wireless applications Texas Instruments - HDL Design House June 2006  –  October 2007  (1 year 5 months) Managing a team of 20 ASIC design and verification engineers that worked on: \n•\tFull development and verification of DSI (Display serial interface) \n•\tFull development and verification of CSI2 (Camera serial interface) \n•\tDevelopment and verification of a connectivity module for Chip 2 Chip communication (D2D) \n•\tMaintenance and customer support for emulation modules (DMLED, ICEPICK) \n•\tVerification of power management unit (PRCM) \n•\tVerification of interconnect modules (L3 and L4 OCP interconnect) Project manager - ASIC design and verification for wireless applications Texas Instruments - HDL Design House June 2006  –  October 2007  (1 year 5 months) Managing a team of 20 ASIC design and verification engineers that worked on: \n•\tFull development and verification of DSI (Display serial interface) \n•\tFull development and verification of CSI2 (Camera serial interface) \n•\tDevelopment and verification of a connectivity module for Chip 2 Chip communication (D2D) \n•\tMaintenance and customer support for emulation modules (DMLED, ICEPICK) \n•\tVerification of power management unit (PRCM) \n•\tVerification of interconnect modules (L3 and L4 OCP interconnect) Quality management consultant HDL Design House December 2005  –  December 2006  (1 year 1 month) Organization, implementation and development of QMS and ISMS. \nCertified auditor for ISO 9001 and ISO 27001 standards. Quality management consultant HDL Design House December 2005  –  December 2006  (1 year 1 month) Organization, implementation and development of QMS and ISMS. \nCertified auditor for ISO 9001 and ISO 27001 standards. civil service Civil Service September 2005  –  May 2006  (9 months) Mandatory civil service civil service Civil Service September 2005  –  May 2006  (9 months) Mandatory civil service SoC design verification engineer Texas Instruments - HDL Design House December 2004  –  September 2005  (10 months) Nice Area, France SoC verification of on-chip debug architecture for an OMAP platform \n• Verification of emulation and trace peripherals \n• Verification of power, reset and clock management features \n• Development of test-cases in C/asm code executed on ARM/DSP processors \n• JTAG sequence programming in TCL SoC design verification engineer Texas Instruments - HDL Design House December 2004  –  September 2005  (10 months) Nice Area, France SoC verification of on-chip debug architecture for an OMAP platform \n• Verification of emulation and trace peripherals \n• Verification of power, reset and clock management features \n• Development of test-cases in C/asm code executed on ARM/DSP processors \n• JTAG sequence programming in TCL Junior design engineer HDL Design House May 2004  –  November 2004  (7 months) VITAL functional models of Flash memories and SmartMedia cards Junior design engineer HDL Design House May 2004  –  November 2004  (7 months) VITAL functional models of Flash memories and SmartMedia cards Skills ASIC SoC Verilog RTL design VHDL FPGA Team Leadership Power Management Debugging ModelSim Embedded Systems Processors Functional Verification ARM Skills  ASIC SoC Verilog RTL design VHDL FPGA Team Leadership Power Management Debugging ModelSim Embedded Systems Processors Functional Verification ARM ASIC SoC Verilog RTL design VHDL FPGA Team Leadership Power Management Debugging ModelSim Embedded Systems Processors Functional Verification ARM ASIC SoC Verilog RTL design VHDL FPGA Team Leadership Power Management Debugging ModelSim Embedded Systems Processors Functional Verification ARM Education University of Belgrade MSc,  Computer Engineering 1997  – 2004 Honored as best graduate student of the Computer Science Department. \nGPA: 9.88 (max 10) University of Belgrade MSc,  Computer Engineering 1997  – 2004 Honored as best graduate student of the Computer Science Department. \nGPA: 9.88 (max 10) University of Belgrade MSc,  Computer Engineering 1997  – 2004 Honored as best graduate student of the Computer Science Department. \nGPA: 9.88 (max 10) University of Belgrade MSc,  Computer Engineering 1997  – 2004 Honored as best graduate student of the Computer Science Department. \nGPA: 9.88 (max 10) ", "Experience Senior Digital Design Engineer Intel Corporation January 2014  – Present (1 year 8 months) Ireland Principal FPGA Engineer Intune Networks February 2008  –  January 2014  (6 years) Dublin Intune is an Irish startup which has developed a distributed Ethernet Switch using novel Optical Burst technology. Responsible for specification and design of complex FPGA based subsystems. Product Design Engineer Ircona July 2006  –  February 2008  (1 year 8 months) Ircona is a design services company delivering HW and FPGA based solutions to a variety of Telecom customers. Product Design Engineer Stratus Technologies September 2000  –  July 2006  (5 years 11 months) Design of IA-32 and PA-RISC based fault tolerant servers. Senior Digital Design Engineer Intel Corporation January 2014  – Present (1 year 8 months) Ireland Senior Digital Design Engineer Intel Corporation January 2014  – Present (1 year 8 months) Ireland Principal FPGA Engineer Intune Networks February 2008  –  January 2014  (6 years) Dublin Intune is an Irish startup which has developed a distributed Ethernet Switch using novel Optical Burst technology. Responsible for specification and design of complex FPGA based subsystems. Principal FPGA Engineer Intune Networks February 2008  –  January 2014  (6 years) Dublin Intune is an Irish startup which has developed a distributed Ethernet Switch using novel Optical Burst technology. Responsible for specification and design of complex FPGA based subsystems. Product Design Engineer Ircona July 2006  –  February 2008  (1 year 8 months) Ircona is a design services company delivering HW and FPGA based solutions to a variety of Telecom customers. Product Design Engineer Ircona July 2006  –  February 2008  (1 year 8 months) Ircona is a design services company delivering HW and FPGA based solutions to a variety of Telecom customers. Product Design Engineer Stratus Technologies September 2000  –  July 2006  (5 years 11 months) Design of IA-32 and PA-RISC based fault tolerant servers. Product Design Engineer Stratus Technologies September 2000  –  July 2006  (5 years 11 months) Design of IA-32 and PA-RISC based fault tolerant servers. Skills VHDL Verilog Network Architecture FPGA System Architecture RTL design EDA Xilinx Ethernet Debugging TCL ASIC Hardware Architecture SoC Skills  VHDL Verilog Network Architecture FPGA System Architecture RTL design EDA Xilinx Ethernet Debugging TCL ASIC Hardware Architecture SoC VHDL Verilog Network Architecture FPGA System Architecture RTL design EDA Xilinx Ethernet Debugging TCL ASIC Hardware Architecture SoC VHDL Verilog Network Architecture FPGA System Architecture RTL design EDA Xilinx Ethernet Debugging TCL ASIC Hardware Architecture SoC Education Dublin City University MENG,  Electronic Systems 2007  – 2008 Dublin City University BENG,  Electronic Engineering 1996  – 2000 Dublin City University MENG,  Electronic Systems 2007  – 2008 Dublin City University MENG,  Electronic Systems 2007  – 2008 Dublin City University MENG,  Electronic Systems 2007  – 2008 Dublin City University BENG,  Electronic Engineering 1996  – 2000 Dublin City University BENG,  Electronic Engineering 1996  – 2000 Dublin City University BENG,  Electronic Engineering 1996  – 2000 "]}