{"position": "Senior Internal Auditor", "company": "IBM", "profiles": ["Skills Negotiation Portuguese Spanish International Relations English SAP Strategic Planning Team Leadership Microsoft Excel Business Strategy Financial Analysis Latin America Auditing Finance Internal Audit Business Process Project Management Contract Management ERP See 4+     See less Skills  Negotiation Portuguese Spanish International Relations English SAP Strategic Planning Team Leadership Microsoft Excel Business Strategy Financial Analysis Latin America Auditing Finance Internal Audit Business Process Project Management Contract Management ERP See 4+     See less Negotiation Portuguese Spanish International Relations English SAP Strategic Planning Team Leadership Microsoft Excel Business Strategy Financial Analysis Latin America Auditing Finance Internal Audit Business Process Project Management Contract Management ERP See 4+     See less Negotiation Portuguese Spanish International Relations English SAP Strategic Planning Team Leadership Microsoft Excel Business Strategy Financial Analysis Latin America Auditing Finance Internal Audit Business Process Project Management Contract Management ERP See 4+     See less ", "Experience IBM Business Partners – Western and Central Europe (Senior Business Controls Analyst) IBM January 2008  –  March 2012  (4 years 3 months) Mobile * Developed and enforced SOX testing requirements for financial and operational compliance across Europe.  \n* Led business controls reviews with participants from other countries to assure compliance with contractual terms and conditions, incentive plans, dispute resolution, and disbursements. Reviewed transactions for financial compliance with a major focus on revenue recognition. \n* Provided ongoing guidance to management for process enhancements, measurements, and issues. \n* Implemented key controls in the customer fulfillment center and the disbursement centers in central Europe. \n* Tracked and validated that the proper actions were implemented as the result of corporate audits and business controls reviews. \n* Participated in business controls reviews in South Africa, Japan, China, Israel, and Dubai. \n* Acquired an in-depth knowledge of the distribution channel. 2003 – 2007: Corporate Internal Audit (Senior Internal Auditor) IBM January 2003  –  December 2007  (5 years) Mobile * Led and executed internal audits for the following processes: \n \nCustomer Fulfillment – A/R, returns/warranty, billings, credit management, order management, separation of duties (physical access and system access to SAP), contract management, solution design and delivery, import/export requirements, distribution, inventory control, and cash management. \nAccounting – revenue recognition, provisions, accruals, deferrals, ledger controls, asset controls, bank reconciliations, write-offs, and valuation. \nCustomer Financing – credit analysis and credit limits. \nMedical Plans – eligibility, contract management, management of the trusts at the financial institutions, and disbursements. \nIntegrated Product Development – compliance with corporate procedures.  \nSecurity – access, emergency procedures, badge controls. \nPurchasing – Order management, accounts payable, receipt of goods and services. \n \n* Improved audit programs for the aforementioned processes. \n* Assisted in developing a risk-based audit plan for assigned locations. Other Experience IBM February 2000  –  December 2002  (2 years 11 months) Poughkeepsie, New York •\tCost Accounting and Inventory Control Manager – managed personal responsible for developing product cost for mainframe computers, reconciling physical versus ledger inventory, optimizing inventory levels, and provided assurance that amount recorded on the ledger was accurate and conservative. \n \n•\tBusiness Controls oversight for manufacturing, development, procurement, distribution, and export/import. Responsible for conducting reviews, performing self-assessments, monitoring measurements, and validated that the proper controls were in place when processes were changed or added. Prepared the management team for corporate audits. IBM Business Partners – Western and Central Europe (Senior Business Controls Analyst) IBM January 2008  –  March 2012  (4 years 3 months) Mobile * Developed and enforced SOX testing requirements for financial and operational compliance across Europe.  \n* Led business controls reviews with participants from other countries to assure compliance with contractual terms and conditions, incentive plans, dispute resolution, and disbursements. Reviewed transactions for financial compliance with a major focus on revenue recognition. \n* Provided ongoing guidance to management for process enhancements, measurements, and issues. \n* Implemented key controls in the customer fulfillment center and the disbursement centers in central Europe. \n* Tracked and validated that the proper actions were implemented as the result of corporate audits and business controls reviews. \n* Participated in business controls reviews in South Africa, Japan, China, Israel, and Dubai. \n* Acquired an in-depth knowledge of the distribution channel. IBM Business Partners – Western and Central Europe (Senior Business Controls Analyst) IBM January 2008  –  March 2012  (4 years 3 months) Mobile * Developed and enforced SOX testing requirements for financial and operational compliance across Europe.  \n* Led business controls reviews with participants from other countries to assure compliance with contractual terms and conditions, incentive plans, dispute resolution, and disbursements. Reviewed transactions for financial compliance with a major focus on revenue recognition. \n* Provided ongoing guidance to management for process enhancements, measurements, and issues. \n* Implemented key controls in the customer fulfillment center and the disbursement centers in central Europe. \n* Tracked and validated that the proper actions were implemented as the result of corporate audits and business controls reviews. \n* Participated in business controls reviews in South Africa, Japan, China, Israel, and Dubai. \n* Acquired an in-depth knowledge of the distribution channel. 2003 – 2007: Corporate Internal Audit (Senior Internal Auditor) IBM January 2003  –  December 2007  (5 years) Mobile * Led and executed internal audits for the following processes: \n \nCustomer Fulfillment – A/R, returns/warranty, billings, credit management, order management, separation of duties (physical access and system access to SAP), contract management, solution design and delivery, import/export requirements, distribution, inventory control, and cash management. \nAccounting – revenue recognition, provisions, accruals, deferrals, ledger controls, asset controls, bank reconciliations, write-offs, and valuation. \nCustomer Financing – credit analysis and credit limits. \nMedical Plans – eligibility, contract management, management of the trusts at the financial institutions, and disbursements. \nIntegrated Product Development – compliance with corporate procedures.  \nSecurity – access, emergency procedures, badge controls. \nPurchasing – Order management, accounts payable, receipt of goods and services. \n \n* Improved audit programs for the aforementioned processes. \n* Assisted in developing a risk-based audit plan for assigned locations. 2003 – 2007: Corporate Internal Audit (Senior Internal Auditor) IBM January 2003  –  December 2007  (5 years) Mobile * Led and executed internal audits for the following processes: \n \nCustomer Fulfillment – A/R, returns/warranty, billings, credit management, order management, separation of duties (physical access and system access to SAP), contract management, solution design and delivery, import/export requirements, distribution, inventory control, and cash management. \nAccounting – revenue recognition, provisions, accruals, deferrals, ledger controls, asset controls, bank reconciliations, write-offs, and valuation. \nCustomer Financing – credit analysis and credit limits. \nMedical Plans – eligibility, contract management, management of the trusts at the financial institutions, and disbursements. \nIntegrated Product Development – compliance with corporate procedures.  \nSecurity – access, emergency procedures, badge controls. \nPurchasing – Order management, accounts payable, receipt of goods and services. \n \n* Improved audit programs for the aforementioned processes. \n* Assisted in developing a risk-based audit plan for assigned locations. Other Experience IBM February 2000  –  December 2002  (2 years 11 months) Poughkeepsie, New York •\tCost Accounting and Inventory Control Manager – managed personal responsible for developing product cost for mainframe computers, reconciling physical versus ledger inventory, optimizing inventory levels, and provided assurance that amount recorded on the ledger was accurate and conservative. \n \n•\tBusiness Controls oversight for manufacturing, development, procurement, distribution, and export/import. Responsible for conducting reviews, performing self-assessments, monitoring measurements, and validated that the proper controls were in place when processes were changed or added. Prepared the management team for corporate audits. Other Experience IBM February 2000  –  December 2002  (2 years 11 months) Poughkeepsie, New York •\tCost Accounting and Inventory Control Manager – managed personal responsible for developing product cost for mainframe computers, reconciling physical versus ledger inventory, optimizing inventory levels, and provided assurance that amount recorded on the ledger was accurate and conservative. \n \n•\tBusiness Controls oversight for manufacturing, development, procurement, distribution, and export/import. Responsible for conducting reviews, performing self-assessments, monitoring measurements, and validated that the proper controls were in place when processes were changed or added. Prepared the management team for corporate audits. Skills Internal Controls Accounts Payable Auditing Internal Audit SAP Accounting Finance Access Cost Accounting Revenue Recognition Management Sarbanes-Oxley Financial Audits Business Process... Microsoft Excel Sarbanes-Oxley Act Forecasting Analysis Financial Analysis Financial Reporting Analytics Project Management Procurement Corporate Finance Process Improvement Variance Analysis Business Analysis Business Process Risk Management Financial Accounting Cash Management IT Audit Fraud Financial Forecasting CISA US GAAP Managerial Finance Consolidation ERP Operational Risk... Fixed Assets Enterprise Risk... Payments Strategic Financial... Due Diligence Financial Modeling Hyperion Enterprise Budgets See 33+     See less Skills  Internal Controls Accounts Payable Auditing Internal Audit SAP Accounting Finance Access Cost Accounting Revenue Recognition Management Sarbanes-Oxley Financial Audits Business Process... Microsoft Excel Sarbanes-Oxley Act Forecasting Analysis Financial Analysis Financial Reporting Analytics Project Management Procurement Corporate Finance Process Improvement Variance Analysis Business Analysis Business Process Risk Management Financial Accounting Cash Management IT Audit Fraud Financial Forecasting CISA US GAAP Managerial Finance Consolidation ERP Operational Risk... Fixed Assets Enterprise Risk... Payments Strategic Financial... Due Diligence Financial Modeling Hyperion Enterprise Budgets See 33+     See less Internal Controls Accounts Payable Auditing Internal Audit SAP Accounting Finance Access Cost Accounting Revenue Recognition Management Sarbanes-Oxley Financial Audits Business Process... Microsoft Excel Sarbanes-Oxley Act Forecasting Analysis Financial Analysis Financial Reporting Analytics Project Management Procurement Corporate Finance Process Improvement Variance Analysis Business Analysis Business Process Risk Management Financial Accounting Cash Management IT Audit Fraud Financial Forecasting CISA US GAAP Managerial Finance Consolidation ERP Operational Risk... Fixed Assets Enterprise Risk... Payments Strategic Financial... Due Diligence Financial Modeling Hyperion Enterprise Budgets See 33+     See less Internal Controls Accounts Payable Auditing Internal Audit SAP Accounting Finance Access Cost Accounting Revenue Recognition Management Sarbanes-Oxley Financial Audits Business Process... Microsoft Excel Sarbanes-Oxley Act Forecasting Analysis Financial Analysis Financial Reporting Analytics Project Management Procurement Corporate Finance Process Improvement Variance Analysis Business Analysis Business Process Risk Management Financial Accounting Cash Management IT Audit Fraud Financial Forecasting CISA US GAAP Managerial Finance Consolidation ERP Operational Risk... Fixed Assets Enterprise Risk... Payments Strategic Financial... Due Diligence Financial Modeling Hyperion Enterprise Budgets See 33+     See less Education Pace University-Pleasantville/Briarcliff Campus Bachelor of Business Administration (B.B.A.),  Accounting and Finance 1973  – 1977 Pace University-Pleasantville/Briarcliff Campus Bachelor of Business Administration (B.B.A.),  Accounting and Finance 1973  – 1977 Pace University-Pleasantville/Briarcliff Campus Bachelor of Business Administration (B.B.A.),  Accounting and Finance 1973  – 1977 Pace University-Pleasantville/Briarcliff Campus Bachelor of Business Administration (B.B.A.),  Accounting and Finance 1973  – 1977 Honors & Awards Additional Honors & Awards Certified Internal Auditor Additional Honors & Awards Certified Internal Auditor Additional Honors & Awards Certified Internal Auditor Additional Honors & Awards Certified Internal Auditor ", "Experience Director, Revenue Recognition, Technical Accounting and Oversight Philips Healthcare October 2014  – Present (11 months) Andover, MA Manager, Finance - Revenue Assurance / Revenue Accounting RSA The Security Division of EMC October 2011  –  October 2014  (3 years 1 month) Senior Revenue Analyst - Revenue Assurance RSA The Security Division of EMC June 2010  –  October 2011  (1 year 5 months) Senior Internal Auditor IBM December 2006  –  June 2010  (3 years 7 months) Financial Analyst IBM June 2002  –  November 2006  (4 years 6 months) Director, Revenue Recognition, Technical Accounting and Oversight Philips Healthcare October 2014  – Present (11 months) Andover, MA Director, Revenue Recognition, Technical Accounting and Oversight Philips Healthcare October 2014  – Present (11 months) Andover, MA Manager, Finance - Revenue Assurance / Revenue Accounting RSA The Security Division of EMC October 2011  –  October 2014  (3 years 1 month) Manager, Finance - Revenue Assurance / Revenue Accounting RSA The Security Division of EMC October 2011  –  October 2014  (3 years 1 month) Senior Revenue Analyst - Revenue Assurance RSA The Security Division of EMC June 2010  –  October 2011  (1 year 5 months) Senior Revenue Analyst - Revenue Assurance RSA The Security Division of EMC June 2010  –  October 2011  (1 year 5 months) Senior Internal Auditor IBM December 2006  –  June 2010  (3 years 7 months) Senior Internal Auditor IBM December 2006  –  June 2010  (3 years 7 months) Financial Analyst IBM June 2002  –  November 2006  (4 years 6 months) Financial Analyst IBM June 2002  –  November 2006  (4 years 6 months) Skills SOX Revenue Recognition Revenue Forecasting Internal Audit Internal Controls Business Process Design Business Process... Governance Revenue Assurance Hyperion Enterprise Business Analysis Sarbanes-Oxley Act Finance Essbase Sarbanes-Oxley Consolidation Forecasting Financial Analysis Hyperion Accounting Management Process Improvement See 7+     See less Skills  SOX Revenue Recognition Revenue Forecasting Internal Audit Internal Controls Business Process Design Business Process... Governance Revenue Assurance Hyperion Enterprise Business Analysis Sarbanes-Oxley Act Finance Essbase Sarbanes-Oxley Consolidation Forecasting Financial Analysis Hyperion Accounting Management Process Improvement See 7+     See less SOX Revenue Recognition Revenue Forecasting Internal Audit Internal Controls Business Process Design Business Process... Governance Revenue Assurance Hyperion Enterprise Business Analysis Sarbanes-Oxley Act Finance Essbase Sarbanes-Oxley Consolidation Forecasting Financial Analysis Hyperion Accounting Management Process Improvement See 7+     See less SOX Revenue Recognition Revenue Forecasting Internal Audit Internal Controls Business Process Design Business Process... Governance Revenue Assurance Hyperion Enterprise Business Analysis Sarbanes-Oxley Act Finance Essbase Sarbanes-Oxley Consolidation Forecasting Financial Analysis Hyperion Accounting Management Process Improvement See 7+     See less Education Rutgers University-New Brunswick 1998  – 2002 Rutgers University-New Brunswick 1998  – 2002 Rutgers University-New Brunswick 1998  – 2002 Rutgers University-New Brunswick 1998  – 2002 ", "Summary I am a Business Continuity professional and a member of the BCI since 1996 with skills in Business Continuity, Operational and IT Risk Management, Information Security, Disaster Recovery, Health & Safety and Auditing. Since 1995 I have provided advice and guidance to many organisations in developing and managing their business continuity arrangements. I develop 'fit for purpose' and resilient capabilities to reduce the impact of severe loss or reputation within these organisations. Through regular exercising and testing the organisations have been assured of the possible actions during a disruption. Carrying out business impact analysis and identifying threats I have laid the foundations for robust planning frameworks and resiliency.  \nI develop and implement business continuity capabilities and align these to current International Standards.  \n \nThe following are a summary of my achievements: \nManaging crises. \n \nDevelop and run Business Impact Analysis and Risk Assessment process. \n \nDisaster Recovery and Business Continuity rehearsing through pre-planned scenarios agreed with the client. (One with S1 Corporation was filmed and resulted in a recovery time of 34 minutes without any Data Loss). \n \nPhysical and Information Security gap analysis reviews based on ISO27001 and implementing remedial actions.  \n \nRaised awareness of both Information Security and Business Continuity within the workplace using a combination of my own techniques and scenarios.  \n \nImplemented business processes and operational procedures in line with ISO27001, BS25999, ISO20000 (IT Service Management) and most recently ISO22301. \n \nBCM Exercise, Awareness and Maintenance development and delivery. \n \nIn House & Third Party Recovery Site Development and Delivery. \n \nCrisis and Incident Management Development, Gap Analysis and benchmarking. \n \nBusiness Continuity Audit and Gap Analysis. \n \nNegotiated Contracts and Service Level Agreements. Specialties:Business Continuity and Information Security expert. \nRisk Manager. \nBS25999 Lead Auditor. \nExperienced Internal Auditor. \nVolunteer Ranger encompassing Countryside and Woodland Management for the Southdowns National Park. Summary I am a Business Continuity professional and a member of the BCI since 1996 with skills in Business Continuity, Operational and IT Risk Management, Information Security, Disaster Recovery, Health & Safety and Auditing. Since 1995 I have provided advice and guidance to many organisations in developing and managing their business continuity arrangements. I develop 'fit for purpose' and resilient capabilities to reduce the impact of severe loss or reputation within these organisations. Through regular exercising and testing the organisations have been assured of the possible actions during a disruption. Carrying out business impact analysis and identifying threats I have laid the foundations for robust planning frameworks and resiliency.  \nI develop and implement business continuity capabilities and align these to current International Standards.  \n \nThe following are a summary of my achievements: \nManaging crises. \n \nDevelop and run Business Impact Analysis and Risk Assessment process. \n \nDisaster Recovery and Business Continuity rehearsing through pre-planned scenarios agreed with the client. (One with S1 Corporation was filmed and resulted in a recovery time of 34 minutes without any Data Loss). \n \nPhysical and Information Security gap analysis reviews based on ISO27001 and implementing remedial actions.  \n \nRaised awareness of both Information Security and Business Continuity within the workplace using a combination of my own techniques and scenarios.  \n \nImplemented business processes and operational procedures in line with ISO27001, BS25999, ISO20000 (IT Service Management) and most recently ISO22301. \n \nBCM Exercise, Awareness and Maintenance development and delivery. \n \nIn House & Third Party Recovery Site Development and Delivery. \n \nCrisis and Incident Management Development, Gap Analysis and benchmarking. \n \nBusiness Continuity Audit and Gap Analysis. \n \nNegotiated Contracts and Service Level Agreements. Specialties:Business Continuity and Information Security expert. \nRisk Manager. \nBS25999 Lead Auditor. \nExperienced Internal Auditor. \nVolunteer Ranger encompassing Countryside and Woodland Management for the Southdowns National Park. I am a Business Continuity professional and a member of the BCI since 1996 with skills in Business Continuity, Operational and IT Risk Management, Information Security, Disaster Recovery, Health & Safety and Auditing. Since 1995 I have provided advice and guidance to many organisations in developing and managing their business continuity arrangements. I develop 'fit for purpose' and resilient capabilities to reduce the impact of severe loss or reputation within these organisations. Through regular exercising and testing the organisations have been assured of the possible actions during a disruption. Carrying out business impact analysis and identifying threats I have laid the foundations for robust planning frameworks and resiliency.  \nI develop and implement business continuity capabilities and align these to current International Standards.  \n \nThe following are a summary of my achievements: \nManaging crises. \n \nDevelop and run Business Impact Analysis and Risk Assessment process. \n \nDisaster Recovery and Business Continuity rehearsing through pre-planned scenarios agreed with the client. (One with S1 Corporation was filmed and resulted in a recovery time of 34 minutes without any Data Loss). \n \nPhysical and Information Security gap analysis reviews based on ISO27001 and implementing remedial actions.  \n \nRaised awareness of both Information Security and Business Continuity within the workplace using a combination of my own techniques and scenarios.  \n \nImplemented business processes and operational procedures in line with ISO27001, BS25999, ISO20000 (IT Service Management) and most recently ISO22301. \n \nBCM Exercise, Awareness and Maintenance development and delivery. \n \nIn House & Third Party Recovery Site Development and Delivery. \n \nCrisis and Incident Management Development, Gap Analysis and benchmarking. \n \nBusiness Continuity Audit and Gap Analysis. \n \nNegotiated Contracts and Service Level Agreements. Specialties:Business Continuity and Information Security expert. \nRisk Manager. \nBS25999 Lead Auditor. \nExperienced Internal Auditor. \nVolunteer Ranger encompassing Countryside and Woodland Management for the Southdowns National Park. I am a Business Continuity professional and a member of the BCI since 1996 with skills in Business Continuity, Operational and IT Risk Management, Information Security, Disaster Recovery, Health & Safety and Auditing. Since 1995 I have provided advice and guidance to many organisations in developing and managing their business continuity arrangements. I develop 'fit for purpose' and resilient capabilities to reduce the impact of severe loss or reputation within these organisations. Through regular exercising and testing the organisations have been assured of the possible actions during a disruption. Carrying out business impact analysis and identifying threats I have laid the foundations for robust planning frameworks and resiliency.  \nI develop and implement business continuity capabilities and align these to current International Standards.  \n \nThe following are a summary of my achievements: \nManaging crises. \n \nDevelop and run Business Impact Analysis and Risk Assessment process. \n \nDisaster Recovery and Business Continuity rehearsing through pre-planned scenarios agreed with the client. (One with S1 Corporation was filmed and resulted in a recovery time of 34 minutes without any Data Loss). \n \nPhysical and Information Security gap analysis reviews based on ISO27001 and implementing remedial actions.  \n \nRaised awareness of both Information Security and Business Continuity within the workplace using a combination of my own techniques and scenarios.  \n \nImplemented business processes and operational procedures in line with ISO27001, BS25999, ISO20000 (IT Service Management) and most recently ISO22301. \n \nBCM Exercise, Awareness and Maintenance development and delivery. \n \nIn House & Third Party Recovery Site Development and Delivery. \n \nCrisis and Incident Management Development, Gap Analysis and benchmarking. \n \nBusiness Continuity Audit and Gap Analysis. \n \nNegotiated Contracts and Service Level Agreements. Specialties:Business Continuity and Information Security expert. \nRisk Manager. \nBS25999 Lead Auditor. \nExperienced Internal Auditor. \nVolunteer Ranger encompassing Countryside and Woodland Management for the Southdowns National Park. Experience Senior Security Consultant (BC & DR) Capita IT Professional Services July 2013  – Present (2 years 2 months) Home Based Provide advice and support on all matters concerning Business Continuity and Service Continuity (Disaster Recovery) implementation and improvements with clients. Specifically responsible for the planning, managing and reporting on various exercising and testing to increase the resilience of clients when disruptive events occur. Also provide expertise in the process for new bids that the company are engaged on towards Business Continuity. \n \nAttended and passed ISO22301 Lead Auditor Exam in November 2014 BC & DR Consultant Capita IT Services January 2013  –  June 2013  (6 months) Home based A permanent role that is in two parts: \n1. Provide advice and support to clients concerning their DR capability and specifically, plan, manage and report on DR tests; \n2. Provide advice and support for new bids that require proposals on BC / DR implementation.  \n \nAlso manage the various resilience programmes on client sites to ensure timely response to disruptive events. Senior Consultant Independent Risk Consultant May 2012  –  December 2012  (8 months) CLANFIELD, NEAR PORTSMOUTH Researching and updating my skills and experience in line with ISO22301. \nEvaluating new software tools to promote to small and medium sized businesses as a low cost solution for their own Business Continuity solutions. Senior Business Continuity Consultant MTN Communications Ltd - Nigeria March 2011  –  May 2012  (1 year 3 months) Nigeria Provided assistance in the development of the Business Continuity capability for MTN Nigeria. \nCompleted Business Impact Analysis exercise in 5 locations across Lagos and their respective Risk Assessments. Managed the online Risk Management tool for the outcome of the BC Risk Assessment. Developed the BC Plan template and obtained stakeholder sign-off from business units for their respective plans. Produced the various presentations in readiness for the employee awareness campaign covering the companies Gold, Silver and Bronze strategy and individual requirements should an incident be declared. \nBenchmarking using latest Standards. Business Continuity Consultant at Serco Welfare to Work Serco November 2010  –  February 2011  (4 months) Business Continuity Consultant \nMaintaining the BC Capability for the current Flexible New Deal. Updating BC Plans for the regional offices to ensure they address BS25999 and the new Serco Management System. Planning and co-ordinating exercises, carrying out awareness sessions and generally keeping the organisation up to date with new developments concerning Civil Contingencies and London Prepared. Advising on Risk mitigations and Health & Safety measures, thereby increasing their resilience toward incidents. Business Continuity Consultant at Barclays Cycle Hire Serco April 2010  –  October 2010  (7 months) Business Continuity Consultant \nSerco won the prestigious contract to develop the Barclays Cycle Hire scheme for TfL.  \nIn 10 weeks since 'go live' 1million journeys had been taken by members of the scheme. \nI developed the BC Capability across the 3 sites, carried out exercises and developed the awareness campaign. \nI provided hands-on assistance to the Operations Team during the successful launch and ‘go live’ of the Cycle Hire scheme in Central London. I developed a business continuity framework, consistent with BS25999, resilient and effective during exercises and which was successful as a training and awareness centre piece. The status of the business continuity capability and associated strategies, were regularly discussed with the customer and a continual improvement programme developed. Business Continuity Manager Independent Safeguarding Authority May 2009  –  April 2010  (1 year) Darlington, United Kingdom The ISA was introducing the processes to protect Children and Vulnerable Adults. \nI developed and implemented the Business Continuity programme in line with BS25999 to ensure the authority could manage the effects of a disruption with minimal interruption. This included the Policy, Strategy, Plans and an Awareness campaign to begin the process of building resilience through exercising. I also facilitated the BIA process and fed the results into the overall strategy to promote the use of a work area recovery site and provided the crisis team with regular awareness sessions and scenarios to improve the business continuity process in the event of a disruption. Business Continuity Consultant Visa February 2009  –  March 2009  (2 months) Paddington, London This was a short assignment to design, implement and run the company's annual Business Continuity exercise, including consolidating the issues and improvements for the 'lessons learnt' and follow up. Interim Business Continuity Manager Aon April 2008  –  January 2009  (10 months) Interim Business Continuity Manager based in London. \nMaintained the BC capability while a permanent employee was found. Business Continuity Contractor Transport for London February 2007  –  January 2008  (1 year) Interim BC Manager working in 'Streets' that are responsible for ensuring the red routes in London remained open at all times. \nDeveloped the BC response and carried out BIA across the organisation. Facilitated exercises at recovery sites and managed real life incident. BC Analyst Royal & Sun Alliance August 2006  –  December 2006  (5 months) I developed the project plan and the subsequent on site co-ordination of their work area recovery exercise at two of their recovery sites. Carried out awareness sessions to review and update the organisations business impact requirements and business recovery plans. Reviewed their requirements for pandemic ‘flu and developed a template document to begin roll out. Facilitated the company’s involvement with the 2006 Market Wide Exercise and updated business continuity plans as appropriate. Business Continuity Consultant Visa December 2005  –  July 2006  (8 months) I was responsible for the development and subsequent roll-out of the Business Continuity disciplines across the organisation in UK. Carried out updates on Plans and Business Impact Analysis to ensure they aligned with ‘best practice’. Facilitated discussion meetings to maintain awareness across the organisation. Developed Testing and Rehearsal regime to highlight any weaknesses and follow up with strict action plans to update documentation. Provide advice and guidance as directed by Head of CM on business continuity or disaster recovery matters. Conducted a full Business Impact Analysis across the organisation. Business Continuity Consultant Visor Consultants (UK) Ltd July 2005  –  December 2005  (6 months) I was responsible for helping clients to decide on the measures they would need to implement the Business Continuity Institutes ‘best practice’ guidelines. Carried out reviews of clients to determine course of action and tasks to be implemented. Business Continuity Consultant Royal & Sun Alliance April 2004  –  July 2005  (1 year 4 months) As the in-house subject matter expert at the 2nd biggest insurance company, I was responsible for the development and subsequent roll out of Disaster Recovery (DR) and Business Continuity (BC) capabilities for the head office and regional global offices. Business Continuity Consultant Department of Enterprise, Trade & Employment October 2003  –  April 2004  (7 months) Dublin Based in Dublin I implemented and designed the 17 Plans required for an Irish Government department. Reviewed the level of Information Security and advised managers on ways to improve their security and lower the risk of business interruptions. Consultant Visor Consultants (UK) Ltd January 2003  –  October 2003  (10 months) Evaluated Business Continuity software as a pre-requisite to recommending options to small and medium sized businesses for implementing their own plans. Prepared the Business Continuity road show for Business Link Wessex, and took part in the presentations to potential clients. Interim Information Security Manager, London Congestion Charge Capita July 2002  –  December 2002  (6 months) Capita was developing the London Congestion Scheme for TfL. Based in Coventry. \n \nI was responsible for the implementation of the Information Security policies across the new site in Coventry and to prepare the client for BS 7799 certification. \nI carried out a gap analysis and an in-depth Information Security review. From the findings I developed procedures to mitigate the risk of fraud and unauthorised changes, installed new badge access system and Close Circuit TV and carried out the associated awareness and training campaign. Senior Business Operations Manager (Permanent) S1 Corporation July 2000  –  April 2002  (1 year 10 months) Farnborough, UK S1 (one of the largest providers of Internet Banking solutions) provided the opportunity to increase my skills to include H&S, ITIL and General Management skills. \nI was responsible for the full implementation of Business Continuity at their new site in Farnborough and of their customers who chose S1 to host their services, (Zurich Financial Services being one of their customers). \nI developed and implemented the Business Continuity and Disaster Recovery Plans and carried out rehearsals to provide confidence to our customers that they were fit for purpose and resilient. Provided our clients with a recovery time of 34 minutes, with No Data Loss. (Platforms included EMC and UNIX).  \nI carried out risk assessments, negotiated the terms and conditions of the Service Level Agreement for the services to be provided by our Business Recovery supplier and implemented the Health & Safety work council. Vice President Institute of Information Security 2000  –  2001  (1 year) The Institute was formed to provide like minded professionals with a forum to discuss Information Security matters. With the help of great speakers the forums became a mecca for networking and discussing issues and solutions to all. \n \nThe forums were not possible without the kindness of our hosts, large prestigious corporations who knew the benefits of such an Institute. Business Continuity Consultant TC Group February 1999  –  March 2000  (1 year 2 months) I was the principal consultant on the company’s Risk Management team and responsible for bringing new risk based business to the group. Disaster Recovery Consultant Legal & General 1997  –  1999  (2 years) Maintained the DR capability at their Head Office in Surrey. Carried out the 'life cycle' processes across 11 sites that were IBM AS400 based and the Cardiff European Call Centre of the year. Consolidated the AS400 contracts into 1 manageable contract with the service provider thus saving the company approximately £500k. Used the new contract as the basis for new BC exercises to test the organisations resilience. Disaster Recovery Consultant Securicor Cellular Services 1996  –  1996  (less than a year) Developed the DR capability in the Head Office at Redhill for this telecommunications company which was the forerunner to O2. \nOnce implemented I carried out the testing to prove it was 'fit for purpose'. Senior Internal Auditor IBM 1974  –  1994  (20 years) Paris Area, France Based in Paris, France (from 1990 to 1993) I carried out Internal Audits across all of IBM EMEA including Environmental, Financial and IT audits during this time and four as Auditor in Charge. \n \nBetween 1988 and 1990, I was the Senior Information Security and Disaster Recovery Professional responsible for the roll out of IBM's Information Security process to 400 staff in Portsmouth, England. \n \nPrior to 1988, I held many roles in IT starting as Computer Operator in 1974, and Senior Analyst in 1988. Senior Security Consultant (BC & DR) Capita IT Professional Services July 2013  – Present (2 years 2 months) Home Based Provide advice and support on all matters concerning Business Continuity and Service Continuity (Disaster Recovery) implementation and improvements with clients. Specifically responsible for the planning, managing and reporting on various exercising and testing to increase the resilience of clients when disruptive events occur. Also provide expertise in the process for new bids that the company are engaged on towards Business Continuity. \n \nAttended and passed ISO22301 Lead Auditor Exam in November 2014 Senior Security Consultant (BC & DR) Capita IT Professional Services July 2013  – Present (2 years 2 months) Home Based Provide advice and support on all matters concerning Business Continuity and Service Continuity (Disaster Recovery) implementation and improvements with clients. Specifically responsible for the planning, managing and reporting on various exercising and testing to increase the resilience of clients when disruptive events occur. Also provide expertise in the process for new bids that the company are engaged on towards Business Continuity. \n \nAttended and passed ISO22301 Lead Auditor Exam in November 2014 BC & DR Consultant Capita IT Services January 2013  –  June 2013  (6 months) Home based A permanent role that is in two parts: \n1. Provide advice and support to clients concerning their DR capability and specifically, plan, manage and report on DR tests; \n2. Provide advice and support for new bids that require proposals on BC / DR implementation.  \n \nAlso manage the various resilience programmes on client sites to ensure timely response to disruptive events. BC & DR Consultant Capita IT Services January 2013  –  June 2013  (6 months) Home based A permanent role that is in two parts: \n1. Provide advice and support to clients concerning their DR capability and specifically, plan, manage and report on DR tests; \n2. Provide advice and support for new bids that require proposals on BC / DR implementation.  \n \nAlso manage the various resilience programmes on client sites to ensure timely response to disruptive events. Senior Consultant Independent Risk Consultant May 2012  –  December 2012  (8 months) CLANFIELD, NEAR PORTSMOUTH Researching and updating my skills and experience in line with ISO22301. \nEvaluating new software tools to promote to small and medium sized businesses as a low cost solution for their own Business Continuity solutions. Senior Consultant Independent Risk Consultant May 2012  –  December 2012  (8 months) CLANFIELD, NEAR PORTSMOUTH Researching and updating my skills and experience in line with ISO22301. \nEvaluating new software tools to promote to small and medium sized businesses as a low cost solution for their own Business Continuity solutions. Senior Business Continuity Consultant MTN Communications Ltd - Nigeria March 2011  –  May 2012  (1 year 3 months) Nigeria Provided assistance in the development of the Business Continuity capability for MTN Nigeria. \nCompleted Business Impact Analysis exercise in 5 locations across Lagos and their respective Risk Assessments. Managed the online Risk Management tool for the outcome of the BC Risk Assessment. Developed the BC Plan template and obtained stakeholder sign-off from business units for their respective plans. Produced the various presentations in readiness for the employee awareness campaign covering the companies Gold, Silver and Bronze strategy and individual requirements should an incident be declared. \nBenchmarking using latest Standards. Senior Business Continuity Consultant MTN Communications Ltd - Nigeria March 2011  –  May 2012  (1 year 3 months) Nigeria Provided assistance in the development of the Business Continuity capability for MTN Nigeria. \nCompleted Business Impact Analysis exercise in 5 locations across Lagos and their respective Risk Assessments. Managed the online Risk Management tool for the outcome of the BC Risk Assessment. Developed the BC Plan template and obtained stakeholder sign-off from business units for their respective plans. Produced the various presentations in readiness for the employee awareness campaign covering the companies Gold, Silver and Bronze strategy and individual requirements should an incident be declared. \nBenchmarking using latest Standards. Business Continuity Consultant at Serco Welfare to Work Serco November 2010  –  February 2011  (4 months) Business Continuity Consultant \nMaintaining the BC Capability for the current Flexible New Deal. Updating BC Plans for the regional offices to ensure they address BS25999 and the new Serco Management System. Planning and co-ordinating exercises, carrying out awareness sessions and generally keeping the organisation up to date with new developments concerning Civil Contingencies and London Prepared. Advising on Risk mitigations and Health & Safety measures, thereby increasing their resilience toward incidents. Business Continuity Consultant at Serco Welfare to Work Serco November 2010  –  February 2011  (4 months) Business Continuity Consultant \nMaintaining the BC Capability for the current Flexible New Deal. Updating BC Plans for the regional offices to ensure they address BS25999 and the new Serco Management System. Planning and co-ordinating exercises, carrying out awareness sessions and generally keeping the organisation up to date with new developments concerning Civil Contingencies and London Prepared. Advising on Risk mitigations and Health & Safety measures, thereby increasing their resilience toward incidents. Business Continuity Consultant at Barclays Cycle Hire Serco April 2010  –  October 2010  (7 months) Business Continuity Consultant \nSerco won the prestigious contract to develop the Barclays Cycle Hire scheme for TfL.  \nIn 10 weeks since 'go live' 1million journeys had been taken by members of the scheme. \nI developed the BC Capability across the 3 sites, carried out exercises and developed the awareness campaign. \nI provided hands-on assistance to the Operations Team during the successful launch and ‘go live’ of the Cycle Hire scheme in Central London. I developed a business continuity framework, consistent with BS25999, resilient and effective during exercises and which was successful as a training and awareness centre piece. The status of the business continuity capability and associated strategies, were regularly discussed with the customer and a continual improvement programme developed. Business Continuity Consultant at Barclays Cycle Hire Serco April 2010  –  October 2010  (7 months) Business Continuity Consultant \nSerco won the prestigious contract to develop the Barclays Cycle Hire scheme for TfL.  \nIn 10 weeks since 'go live' 1million journeys had been taken by members of the scheme. \nI developed the BC Capability across the 3 sites, carried out exercises and developed the awareness campaign. \nI provided hands-on assistance to the Operations Team during the successful launch and ‘go live’ of the Cycle Hire scheme in Central London. I developed a business continuity framework, consistent with BS25999, resilient and effective during exercises and which was successful as a training and awareness centre piece. The status of the business continuity capability and associated strategies, were regularly discussed with the customer and a continual improvement programme developed. Business Continuity Manager Independent Safeguarding Authority May 2009  –  April 2010  (1 year) Darlington, United Kingdom The ISA was introducing the processes to protect Children and Vulnerable Adults. \nI developed and implemented the Business Continuity programme in line with BS25999 to ensure the authority could manage the effects of a disruption with minimal interruption. This included the Policy, Strategy, Plans and an Awareness campaign to begin the process of building resilience through exercising. I also facilitated the BIA process and fed the results into the overall strategy to promote the use of a work area recovery site and provided the crisis team with regular awareness sessions and scenarios to improve the business continuity process in the event of a disruption. Business Continuity Manager Independent Safeguarding Authority May 2009  –  April 2010  (1 year) Darlington, United Kingdom The ISA was introducing the processes to protect Children and Vulnerable Adults. \nI developed and implemented the Business Continuity programme in line with BS25999 to ensure the authority could manage the effects of a disruption with minimal interruption. This included the Policy, Strategy, Plans and an Awareness campaign to begin the process of building resilience through exercising. I also facilitated the BIA process and fed the results into the overall strategy to promote the use of a work area recovery site and provided the crisis team with regular awareness sessions and scenarios to improve the business continuity process in the event of a disruption. Business Continuity Consultant Visa February 2009  –  March 2009  (2 months) Paddington, London This was a short assignment to design, implement and run the company's annual Business Continuity exercise, including consolidating the issues and improvements for the 'lessons learnt' and follow up. Business Continuity Consultant Visa February 2009  –  March 2009  (2 months) Paddington, London This was a short assignment to design, implement and run the company's annual Business Continuity exercise, including consolidating the issues and improvements for the 'lessons learnt' and follow up. Interim Business Continuity Manager Aon April 2008  –  January 2009  (10 months) Interim Business Continuity Manager based in London. \nMaintained the BC capability while a permanent employee was found. Interim Business Continuity Manager Aon April 2008  –  January 2009  (10 months) Interim Business Continuity Manager based in London. \nMaintained the BC capability while a permanent employee was found. Business Continuity Contractor Transport for London February 2007  –  January 2008  (1 year) Interim BC Manager working in 'Streets' that are responsible for ensuring the red routes in London remained open at all times. \nDeveloped the BC response and carried out BIA across the organisation. Facilitated exercises at recovery sites and managed real life incident. Business Continuity Contractor Transport for London February 2007  –  January 2008  (1 year) Interim BC Manager working in 'Streets' that are responsible for ensuring the red routes in London remained open at all times. \nDeveloped the BC response and carried out BIA across the organisation. Facilitated exercises at recovery sites and managed real life incident. BC Analyst Royal & Sun Alliance August 2006  –  December 2006  (5 months) I developed the project plan and the subsequent on site co-ordination of their work area recovery exercise at two of their recovery sites. Carried out awareness sessions to review and update the organisations business impact requirements and business recovery plans. Reviewed their requirements for pandemic ‘flu and developed a template document to begin roll out. Facilitated the company’s involvement with the 2006 Market Wide Exercise and updated business continuity plans as appropriate. BC Analyst Royal & Sun Alliance August 2006  –  December 2006  (5 months) I developed the project plan and the subsequent on site co-ordination of their work area recovery exercise at two of their recovery sites. Carried out awareness sessions to review and update the organisations business impact requirements and business recovery plans. Reviewed their requirements for pandemic ‘flu and developed a template document to begin roll out. Facilitated the company’s involvement with the 2006 Market Wide Exercise and updated business continuity plans as appropriate. Business Continuity Consultant Visa December 2005  –  July 2006  (8 months) I was responsible for the development and subsequent roll-out of the Business Continuity disciplines across the organisation in UK. Carried out updates on Plans and Business Impact Analysis to ensure they aligned with ‘best practice’. Facilitated discussion meetings to maintain awareness across the organisation. Developed Testing and Rehearsal regime to highlight any weaknesses and follow up with strict action plans to update documentation. Provide advice and guidance as directed by Head of CM on business continuity or disaster recovery matters. Conducted a full Business Impact Analysis across the organisation. Business Continuity Consultant Visa December 2005  –  July 2006  (8 months) I was responsible for the development and subsequent roll-out of the Business Continuity disciplines across the organisation in UK. Carried out updates on Plans and Business Impact Analysis to ensure they aligned with ‘best practice’. Facilitated discussion meetings to maintain awareness across the organisation. Developed Testing and Rehearsal regime to highlight any weaknesses and follow up with strict action plans to update documentation. Provide advice and guidance as directed by Head of CM on business continuity or disaster recovery matters. Conducted a full Business Impact Analysis across the organisation. Business Continuity Consultant Visor Consultants (UK) Ltd July 2005  –  December 2005  (6 months) I was responsible for helping clients to decide on the measures they would need to implement the Business Continuity Institutes ‘best practice’ guidelines. Carried out reviews of clients to determine course of action and tasks to be implemented. Business Continuity Consultant Visor Consultants (UK) Ltd July 2005  –  December 2005  (6 months) I was responsible for helping clients to decide on the measures they would need to implement the Business Continuity Institutes ‘best practice’ guidelines. Carried out reviews of clients to determine course of action and tasks to be implemented. Business Continuity Consultant Royal & Sun Alliance April 2004  –  July 2005  (1 year 4 months) As the in-house subject matter expert at the 2nd biggest insurance company, I was responsible for the development and subsequent roll out of Disaster Recovery (DR) and Business Continuity (BC) capabilities for the head office and regional global offices. Business Continuity Consultant Royal & Sun Alliance April 2004  –  July 2005  (1 year 4 months) As the in-house subject matter expert at the 2nd biggest insurance company, I was responsible for the development and subsequent roll out of Disaster Recovery (DR) and Business Continuity (BC) capabilities for the head office and regional global offices. Business Continuity Consultant Department of Enterprise, Trade & Employment October 2003  –  April 2004  (7 months) Dublin Based in Dublin I implemented and designed the 17 Plans required for an Irish Government department. Reviewed the level of Information Security and advised managers on ways to improve their security and lower the risk of business interruptions. Business Continuity Consultant Department of Enterprise, Trade & Employment October 2003  –  April 2004  (7 months) Dublin Based in Dublin I implemented and designed the 17 Plans required for an Irish Government department. Reviewed the level of Information Security and advised managers on ways to improve their security and lower the risk of business interruptions. Consultant Visor Consultants (UK) Ltd January 2003  –  October 2003  (10 months) Evaluated Business Continuity software as a pre-requisite to recommending options to small and medium sized businesses for implementing their own plans. Prepared the Business Continuity road show for Business Link Wessex, and took part in the presentations to potential clients. Consultant Visor Consultants (UK) Ltd January 2003  –  October 2003  (10 months) Evaluated Business Continuity software as a pre-requisite to recommending options to small and medium sized businesses for implementing their own plans. Prepared the Business Continuity road show for Business Link Wessex, and took part in the presentations to potential clients. Interim Information Security Manager, London Congestion Charge Capita July 2002  –  December 2002  (6 months) Capita was developing the London Congestion Scheme for TfL. Based in Coventry. \n \nI was responsible for the implementation of the Information Security policies across the new site in Coventry and to prepare the client for BS 7799 certification. \nI carried out a gap analysis and an in-depth Information Security review. From the findings I developed procedures to mitigate the risk of fraud and unauthorised changes, installed new badge access system and Close Circuit TV and carried out the associated awareness and training campaign. Interim Information Security Manager, London Congestion Charge Capita July 2002  –  December 2002  (6 months) Capita was developing the London Congestion Scheme for TfL. Based in Coventry. \n \nI was responsible for the implementation of the Information Security policies across the new site in Coventry and to prepare the client for BS 7799 certification. \nI carried out a gap analysis and an in-depth Information Security review. From the findings I developed procedures to mitigate the risk of fraud and unauthorised changes, installed new badge access system and Close Circuit TV and carried out the associated awareness and training campaign. Senior Business Operations Manager (Permanent) S1 Corporation July 2000  –  April 2002  (1 year 10 months) Farnborough, UK S1 (one of the largest providers of Internet Banking solutions) provided the opportunity to increase my skills to include H&S, ITIL and General Management skills. \nI was responsible for the full implementation of Business Continuity at their new site in Farnborough and of their customers who chose S1 to host their services, (Zurich Financial Services being one of their customers). \nI developed and implemented the Business Continuity and Disaster Recovery Plans and carried out rehearsals to provide confidence to our customers that they were fit for purpose and resilient. Provided our clients with a recovery time of 34 minutes, with No Data Loss. (Platforms included EMC and UNIX).  \nI carried out risk assessments, negotiated the terms and conditions of the Service Level Agreement for the services to be provided by our Business Recovery supplier and implemented the Health & Safety work council. Senior Business Operations Manager (Permanent) S1 Corporation July 2000  –  April 2002  (1 year 10 months) Farnborough, UK S1 (one of the largest providers of Internet Banking solutions) provided the opportunity to increase my skills to include H&S, ITIL and General Management skills. \nI was responsible for the full implementation of Business Continuity at their new site in Farnborough and of their customers who chose S1 to host their services, (Zurich Financial Services being one of their customers). \nI developed and implemented the Business Continuity and Disaster Recovery Plans and carried out rehearsals to provide confidence to our customers that they were fit for purpose and resilient. Provided our clients with a recovery time of 34 minutes, with No Data Loss. (Platforms included EMC and UNIX).  \nI carried out risk assessments, negotiated the terms and conditions of the Service Level Agreement for the services to be provided by our Business Recovery supplier and implemented the Health & Safety work council. Vice President Institute of Information Security 2000  –  2001  (1 year) The Institute was formed to provide like minded professionals with a forum to discuss Information Security matters. With the help of great speakers the forums became a mecca for networking and discussing issues and solutions to all. \n \nThe forums were not possible without the kindness of our hosts, large prestigious corporations who knew the benefits of such an Institute. Vice President Institute of Information Security 2000  –  2001  (1 year) The Institute was formed to provide like minded professionals with a forum to discuss Information Security matters. With the help of great speakers the forums became a mecca for networking and discussing issues and solutions to all. \n \nThe forums were not possible without the kindness of our hosts, large prestigious corporations who knew the benefits of such an Institute. Business Continuity Consultant TC Group February 1999  –  March 2000  (1 year 2 months) I was the principal consultant on the company’s Risk Management team and responsible for bringing new risk based business to the group. Business Continuity Consultant TC Group February 1999  –  March 2000  (1 year 2 months) I was the principal consultant on the company’s Risk Management team and responsible for bringing new risk based business to the group. Disaster Recovery Consultant Legal & General 1997  –  1999  (2 years) Maintained the DR capability at their Head Office in Surrey. Carried out the 'life cycle' processes across 11 sites that were IBM AS400 based and the Cardiff European Call Centre of the year. Consolidated the AS400 contracts into 1 manageable contract with the service provider thus saving the company approximately £500k. Used the new contract as the basis for new BC exercises to test the organisations resilience. Disaster Recovery Consultant Legal & General 1997  –  1999  (2 years) Maintained the DR capability at their Head Office in Surrey. Carried out the 'life cycle' processes across 11 sites that were IBM AS400 based and the Cardiff European Call Centre of the year. Consolidated the AS400 contracts into 1 manageable contract with the service provider thus saving the company approximately £500k. Used the new contract as the basis for new BC exercises to test the organisations resilience. Disaster Recovery Consultant Securicor Cellular Services 1996  –  1996  (less than a year) Developed the DR capability in the Head Office at Redhill for this telecommunications company which was the forerunner to O2. \nOnce implemented I carried out the testing to prove it was 'fit for purpose'. Disaster Recovery Consultant Securicor Cellular Services 1996  –  1996  (less than a year) Developed the DR capability in the Head Office at Redhill for this telecommunications company which was the forerunner to O2. \nOnce implemented I carried out the testing to prove it was 'fit for purpose'. Senior Internal Auditor IBM 1974  –  1994  (20 years) Paris Area, France Based in Paris, France (from 1990 to 1993) I carried out Internal Audits across all of IBM EMEA including Environmental, Financial and IT audits during this time and four as Auditor in Charge. \n \nBetween 1988 and 1990, I was the Senior Information Security and Disaster Recovery Professional responsible for the roll out of IBM's Information Security process to 400 staff in Portsmouth, England. \n \nPrior to 1988, I held many roles in IT starting as Computer Operator in 1974, and Senior Analyst in 1988. Senior Internal Auditor IBM 1974  –  1994  (20 years) Paris Area, France Based in Paris, France (from 1990 to 1993) I carried out Internal Audits across all of IBM EMEA including Environmental, Financial and IT audits during this time and four as Auditor in Charge. \n \nBetween 1988 and 1990, I was the Senior Information Security and Disaster Recovery Professional responsible for the roll out of IBM's Information Security process to 400 staff in Portsmouth, England. \n \nPrior to 1988, I held many roles in IT starting as Computer Operator in 1974, and Senior Analyst in 1988. Skills Business Continuity Business Continuity... Disaster Recovery ISO 22301 Risk Assessment Incident Management BS25999 Risk Management Information Security Crisis Management Information Security... ISO 27001 Security ITIL Operational Risk IT Audit Internal Audit Business Impact Analysis Vulnerability Assessment Policy Risk Mitigation Enterprise Risk... Governance IT Service Management Project Management Physical Security Service Delivery Risk Analysis Business Resilience Data Center Operational Risk... Management Strategy Business Process Contract Management Financial Risk Security Audits Project Planning Service Level Agreements SDLC BCM Stakeholder Management Security Awareness IT Strategy Computer Security Information Technology Training Contingency Planning Service Level Management Change Management See 35+     See less Skills  Business Continuity Business Continuity... Disaster Recovery ISO 22301 Risk Assessment Incident Management BS25999 Risk Management Information Security Crisis Management Information Security... ISO 27001 Security ITIL Operational Risk IT Audit Internal Audit Business Impact Analysis Vulnerability Assessment Policy Risk Mitigation Enterprise Risk... Governance IT Service Management Project Management Physical Security Service Delivery Risk Analysis Business Resilience Data Center Operational Risk... Management Strategy Business Process Contract Management Financial Risk Security Audits Project Planning Service Level Agreements SDLC BCM Stakeholder Management Security Awareness IT Strategy Computer Security Information Technology Training Contingency Planning Service Level Management Change Management See 35+     See less Business Continuity Business Continuity... Disaster Recovery ISO 22301 Risk Assessment Incident Management BS25999 Risk Management Information Security Crisis Management Information Security... ISO 27001 Security ITIL Operational Risk IT Audit Internal Audit Business Impact Analysis Vulnerability Assessment Policy Risk Mitigation Enterprise Risk... Governance IT Service Management Project Management Physical Security Service Delivery Risk Analysis Business Resilience Data Center Operational Risk... Management Strategy Business Process Contract Management Financial Risk Security Audits Project Planning Service Level Agreements SDLC BCM Stakeholder Management Security Awareness IT Strategy Computer Security Information Technology Training Contingency Planning Service Level Management Change Management See 35+     See less Business Continuity Business Continuity... Disaster Recovery ISO 22301 Risk Assessment Incident Management BS25999 Risk Management Information Security Crisis Management Information Security... ISO 27001 Security ITIL Operational Risk IT Audit Internal Audit Business Impact Analysis Vulnerability Assessment Policy Risk Mitigation Enterprise Risk... Governance IT Service Management Project Management Physical Security Service Delivery Risk Analysis Business Resilience Data Center Operational Risk... Management Strategy Business Process Contract Management Financial Risk Security Audits Project Planning Service Level Agreements SDLC BCM Stakeholder Management Security Awareness IT Strategy Computer Security Information Technology Training Contingency Planning Service Level Management Change Management See 35+     See less Education Certified ISO22301 Lead Auditor 2014  – 2014 Certified BS25999 Lead Auditor 2008  – 2008 Chichester College OND in Business Studies, A levels, O Levels 1968  – 1971 T S Mercury (www.tsmercury.com) Nautical 1966  – 1968 School closed one year before I completed studies. Activities and Societies:  Grammar School with a Nautical flavour. One year reduction in apprenticeship with Shipping Line on completion of 3 year course. Professional member of the British Computing Society Activities and Societies:  June 2011 Professional member of the Business Continuity Institute Activities and Societies:  September 1996 Certified ISO22301 Lead Auditor 2014  – 2014 Certified ISO22301 Lead Auditor 2014  – 2014 Certified ISO22301 Lead Auditor 2014  – 2014 Certified BS25999 Lead Auditor 2008  – 2008 Certified BS25999 Lead Auditor 2008  – 2008 Certified BS25999 Lead Auditor 2008  – 2008 Chichester College OND in Business Studies, A levels, O Levels 1968  – 1971 Chichester College OND in Business Studies, A levels, O Levels 1968  – 1971 Chichester College OND in Business Studies, A levels, O Levels 1968  – 1971 T S Mercury (www.tsmercury.com) Nautical 1966  – 1968 School closed one year before I completed studies. Activities and Societies:  Grammar School with a Nautical flavour. One year reduction in apprenticeship with Shipping Line on completion of 3 year course. T S Mercury (www.tsmercury.com) Nautical 1966  – 1968 School closed one year before I completed studies. Activities and Societies:  Grammar School with a Nautical flavour. One year reduction in apprenticeship with Shipping Line on completion of 3 year course. T S Mercury (www.tsmercury.com) Nautical 1966  – 1968 School closed one year before I completed studies. Activities and Societies:  Grammar School with a Nautical flavour. One year reduction in apprenticeship with Shipping Line on completion of 3 year course. Professional member of the British Computing Society Activities and Societies:  June 2011 Professional member of the British Computing Society Activities and Societies:  June 2011 Professional member of the British Computing Society Activities and Societies:  June 2011 Professional member of the Business Continuity Institute Activities and Societies:  September 1996 Professional member of the Business Continuity Institute Activities and Societies:  September 1996 Professional member of the Business Continuity Institute Activities and Societies:  September 1996 Honors & Awards Additional Honors & Awards MBCI  \nMBCS Additional Honors & Awards MBCI  \nMBCS Additional Honors & Awards MBCI  \nMBCS Additional Honors & Awards MBCI  \nMBCS ", "Summary An accomplished Content Development & e-Publishing Professional with significant 8.6 years of experience acquired in diverse areas encompassing course content development, project management, customer engagement, quality, reporting & documentation and people management. \n \nExpert in providing tactical e-learning solutions using strong knowledge of all phases of the Content Development Life Cycle including Study, Analysis, Content Design, Deployment, Integration and Implementation \n \nExperienced in designing and conducting training programs and workshops for different levels of participants; possess keen business acumen in analyzing and understanding business requirements, customer-value maximization and developing new business processes and revenue streams. \n \nArticulate communicator, skilled at collaborating with Project Teams including Designers, Content Developers, Graphic Designers, and Subject Matter Experts etc.; interfacing with clients and deploying technology to build successful solutions for Clients \n \nSeasoned professional with a unique blend of Managerial, Technical, Functional and Qualitative skills, proficient in inducing swift project ramp up to ensure committed project delivery with strict compliance to quality systems/procedures. \n Summary An accomplished Content Development & e-Publishing Professional with significant 8.6 years of experience acquired in diverse areas encompassing course content development, project management, customer engagement, quality, reporting & documentation and people management. \n \nExpert in providing tactical e-learning solutions using strong knowledge of all phases of the Content Development Life Cycle including Study, Analysis, Content Design, Deployment, Integration and Implementation \n \nExperienced in designing and conducting training programs and workshops for different levels of participants; possess keen business acumen in analyzing and understanding business requirements, customer-value maximization and developing new business processes and revenue streams. \n \nArticulate communicator, skilled at collaborating with Project Teams including Designers, Content Developers, Graphic Designers, and Subject Matter Experts etc.; interfacing with clients and deploying technology to build successful solutions for Clients \n \nSeasoned professional with a unique blend of Managerial, Technical, Functional and Qualitative skills, proficient in inducing swift project ramp up to ensure committed project delivery with strict compliance to quality systems/procedures. \n An accomplished Content Development & e-Publishing Professional with significant 8.6 years of experience acquired in diverse areas encompassing course content development, project management, customer engagement, quality, reporting & documentation and people management. \n \nExpert in providing tactical e-learning solutions using strong knowledge of all phases of the Content Development Life Cycle including Study, Analysis, Content Design, Deployment, Integration and Implementation \n \nExperienced in designing and conducting training programs and workshops for different levels of participants; possess keen business acumen in analyzing and understanding business requirements, customer-value maximization and developing new business processes and revenue streams. \n \nArticulate communicator, skilled at collaborating with Project Teams including Designers, Content Developers, Graphic Designers, and Subject Matter Experts etc.; interfacing with clients and deploying technology to build successful solutions for Clients \n \nSeasoned professional with a unique blend of Managerial, Technical, Functional and Qualitative skills, proficient in inducing swift project ramp up to ensure committed project delivery with strict compliance to quality systems/procedures. \n An accomplished Content Development & e-Publishing Professional with significant 8.6 years of experience acquired in diverse areas encompassing course content development, project management, customer engagement, quality, reporting & documentation and people management. \n \nExpert in providing tactical e-learning solutions using strong knowledge of all phases of the Content Development Life Cycle including Study, Analysis, Content Design, Deployment, Integration and Implementation \n \nExperienced in designing and conducting training programs and workshops for different levels of participants; possess keen business acumen in analyzing and understanding business requirements, customer-value maximization and developing new business processes and revenue streams. \n \nArticulate communicator, skilled at collaborating with Project Teams including Designers, Content Developers, Graphic Designers, and Subject Matter Experts etc.; interfacing with clients and deploying technology to build successful solutions for Clients \n \nSeasoned professional with a unique blend of Managerial, Technical, Functional and Qualitative skills, proficient in inducing swift project ramp up to ensure committed project delivery with strict compliance to quality systems/procedures. \n Experience Assistant Professor Sikkim Manipal University September 2012  – Present (3 years) Bangalore As a Content Developer & Analyst: \nArea: Retail Management & Marketing Management. \n \n Assistant Professor Sikkim Manipal University September 2012  – Present (3 years) Bangalore As a Content Developer & Analyst: \nArea: Retail Management & Marketing Management. \n \n Assistant Professor Sikkim Manipal University September 2012  – Present (3 years) Bangalore As a Content Developer & Analyst: \nArea: Retail Management & Marketing Management. \n \n Languages   Skills Soft Skills Marketing Management Team Management Market Research CRM Organizational Behavior Sales Training Instructional Design Research Performance Management E-Learning Retail Organizational... Business Strategy Business Development Strategic Planning See 2+     See less Skills  Soft Skills Marketing Management Team Management Market Research CRM Organizational Behavior Sales Training Instructional Design Research Performance Management E-Learning Retail Organizational... Business Strategy Business Development Strategic Planning See 2+     See less Soft Skills Marketing Management Team Management Market Research CRM Organizational Behavior Sales Training Instructional Design Research Performance Management E-Learning Retail Organizational... Business Strategy Business Development Strategic Planning See 2+     See less Soft Skills Marketing Management Team Management Market Research CRM Organizational Behavior Sales Training Instructional Design Research Performance Management E-Learning Retail Organizational... Business Strategy Business Development Strategic Planning See 2+     See less Education Punjab Technical University Master of Business Administration (MBA),  Marketing Management 2005  – 2007 Activities and Societies:  Management Club & PRO from the college Karnataka State Open University Master of Commerce,  Accounting and Finance 2006  – 2008 Punjab Technical University Master of Business Administration (MBA),  Marketing Management 2005  – 2007 Activities and Societies:  Management Club & PRO from the college Punjab Technical University Master of Business Administration (MBA),  Marketing Management 2005  – 2007 Activities and Societies:  Management Club & PRO from the college Punjab Technical University Master of Business Administration (MBA),  Marketing Management 2005  – 2007 Activities and Societies:  Management Club & PRO from the college Karnataka State Open University Master of Commerce,  Accounting and Finance 2006  – 2008 Karnataka State Open University Master of Commerce,  Accounting and Finance 2006  – 2008 Karnataka State Open University Master of Commerce,  Accounting and Finance 2006  – 2008 Honors & Awards ", "Summary Finance professional with 4 years as a CFO and 14+ years of internal audit, investigations, compliance experience. Broad process experience in IT industry in emerging growth markets. Strong and tailored communication ability across all organizational levels, missions, and cultures. Summary Finance professional with 4 years as a CFO and 14+ years of internal audit, investigations, compliance experience. Broad process experience in IT industry in emerging growth markets. Strong and tailored communication ability across all organizational levels, missions, and cultures. Finance professional with 4 years as a CFO and 14+ years of internal audit, investigations, compliance experience. Broad process experience in IT industry in emerging growth markets. Strong and tailored communication ability across all organizational levels, missions, and cultures. Finance professional with 4 years as a CFO and 14+ years of internal audit, investigations, compliance experience. Broad process experience in IT industry in emerging growth markets. Strong and tailored communication ability across all organizational levels, missions, and cultures. Experience Chief Financial Officer - IBM Egypt IBM August 2014  – Present (1 year 1 month) Cairo, Egypt Chief Financial Officer – IBM Philippines IBM May 2010  –  July 2014  (4 years 3 months) Manila, Philippines Audit Manager IBM - Greater China / Korea IBM December 2009  –  April 2010  (5 months) Beijing, China Investigation Manager Asia Pacific Region IBM March 2006  –  November 2009  (3 years 9 months) Beijing, China Internal Audit Area Manager IBM September 2005  –  February 2006  (6 months) Beijing, China Senior Business Senior Controls Analyst IBM - Global Business Services - Asia Pacific May 2003  –  August 2005  (2 years 4 months) Mobile in Asia and New York Senior Businss Controls Analyst - Due Dilligence and Emerging Markets IBM January 2001  –  April 2003  (2 years 4 months) Asia and United States Senior Internal Audit Team Leader IBM October 1999  –  December 2000  (1 year 3 months) United States Senior Internal Auditor IBM January 1996  –  September 1999  (3 years 9 months) United States Other - Various finance systems roles, University lecturer IBM May 1989  –  1994  (5 years) Greater New York City Area Chief Financial Officer - IBM Egypt IBM August 2014  – Present (1 year 1 month) Cairo, Egypt Chief Financial Officer - IBM Egypt IBM August 2014  – Present (1 year 1 month) Cairo, Egypt Chief Financial Officer – IBM Philippines IBM May 2010  –  July 2014  (4 years 3 months) Manila, Philippines Chief Financial Officer – IBM Philippines IBM May 2010  –  July 2014  (4 years 3 months) Manila, Philippines Audit Manager IBM - Greater China / Korea IBM December 2009  –  April 2010  (5 months) Beijing, China Audit Manager IBM - Greater China / Korea IBM December 2009  –  April 2010  (5 months) Beijing, China Investigation Manager Asia Pacific Region IBM March 2006  –  November 2009  (3 years 9 months) Beijing, China Investigation Manager Asia Pacific Region IBM March 2006  –  November 2009  (3 years 9 months) Beijing, China Internal Audit Area Manager IBM September 2005  –  February 2006  (6 months) Beijing, China Internal Audit Area Manager IBM September 2005  –  February 2006  (6 months) Beijing, China Senior Business Senior Controls Analyst IBM - Global Business Services - Asia Pacific May 2003  –  August 2005  (2 years 4 months) Mobile in Asia and New York Senior Business Senior Controls Analyst IBM - Global Business Services - Asia Pacific May 2003  –  August 2005  (2 years 4 months) Mobile in Asia and New York Senior Businss Controls Analyst - Due Dilligence and Emerging Markets IBM January 2001  –  April 2003  (2 years 4 months) Asia and United States Senior Businss Controls Analyst - Due Dilligence and Emerging Markets IBM January 2001  –  April 2003  (2 years 4 months) Asia and United States Senior Internal Audit Team Leader IBM October 1999  –  December 2000  (1 year 3 months) United States Senior Internal Audit Team Leader IBM October 1999  –  December 2000  (1 year 3 months) United States Senior Internal Auditor IBM January 1996  –  September 1999  (3 years 9 months) United States Senior Internal Auditor IBM January 1996  –  September 1999  (3 years 9 months) United States Other - Various finance systems roles, University lecturer IBM May 1989  –  1994  (5 years) Greater New York City Area Other - Various finance systems roles, University lecturer IBM May 1989  –  1994  (5 years) Greater New York City Area Languages English Native or bilingual proficiency Russian Full professional proficiency English Native or bilingual proficiency Russian Full professional proficiency English Native or bilingual proficiency Russian Full professional proficiency Native or bilingual proficiency Full professional proficiency Skills Internal Controls Internal Audit Auditing Enterprise Risk... Finance CPA Risk Management Investigation Outsourcing CFOs Accounting CMA Certified Fraud Examiner Management Sarbanes-Oxley Act Managerial Finance Team Management CFM CFE CIA Audit Risk Managment Risk Assessment Compliance Internal Investigations Business Analysis Business Process... Leadership See 13+     See less Skills  Internal Controls Internal Audit Auditing Enterprise Risk... Finance CPA Risk Management Investigation Outsourcing CFOs Accounting CMA Certified Fraud Examiner Management Sarbanes-Oxley Act Managerial Finance Team Management CFM CFE CIA Audit Risk Managment Risk Assessment Compliance Internal Investigations Business Analysis Business Process... Leadership See 13+     See less Internal Controls Internal Audit Auditing Enterprise Risk... Finance CPA Risk Management Investigation Outsourcing CFOs Accounting CMA Certified Fraud Examiner Management Sarbanes-Oxley Act Managerial Finance Team Management CFM CFE CIA Audit Risk Managment Risk Assessment Compliance Internal Investigations Business Analysis Business Process... Leadership See 13+     See less Internal Controls Internal Audit Auditing Enterprise Risk... Finance CPA Risk Management Investigation Outsourcing CFOs Accounting CMA Certified Fraud Examiner Management Sarbanes-Oxley Act Managerial Finance Team Management CFM CFE CIA Audit Risk Managment Risk Assessment Compliance Internal Investigations Business Analysis Business Process... Leadership See 13+     See less Education Bernard M Baruch College, City University of New York Master of Business Administration (MBA) 1992  – 1994 Bernard M Baruch College, City University of New York Bachelor of Business Administration (BBA),  Accounting 1987  – 1989 Bernard M Baruch College, City University of New York Master of Business Administration (MBA) 1992  – 1994 Bernard M Baruch College, City University of New York Master of Business Administration (MBA) 1992  – 1994 Bernard M Baruch College, City University of New York Master of Business Administration (MBA) 1992  – 1994 Bernard M Baruch College, City University of New York Bachelor of Business Administration (BBA),  Accounting 1987  – 1989 Bernard M Baruch College, City University of New York Bachelor of Business Administration (BBA),  Accounting 1987  – 1989 Bernard M Baruch College, City University of New York Bachelor of Business Administration (BBA),  Accounting 1987  – 1989 ", "Experience Project Office Manager IBM May 2012  – Present (3 years 4 months) Wilmington, Delaware Responsible for leading contract management functions for an IBM Global Technology Services account in Wilmington DE. Supervise work activities for Contract Management Services Resources. This includes maintaining in-depth knowledge of the account and working on new business opportunities. In addition, recognize complex issues, analyze the situation, and provide recommendations and implement solutions as required. In addition, continue to ensure compliance to business control requirements and positive audit posture for the account. Senior Compliance Manager IBM June 2010  –  May 2012  (2 years) South Africa -Kenya Responsible for leading a team in Johannesburg, South Africa and Nairobi, Kenya to ensure compliance to developed and maintained IBM processes and IBM/customer agreements. Test requirements were developed to track compliance of the processes. Weekly and monthly results were provided and reviewed with the executive management teams. Continued assistance was provided to the project and management teams in identifying, assessing, and addressing project risks, issues, and process challenges. An additional responsibility was the primary interface for Corporate Audits and other business controls reviews Senior Internal Auditor IBM May 2008  –  May 2010  (2 years 1 month) Austin TX Responsible for developing and deploying operational and billing processes for a newly established customer in Austin, Texas. Determining areas of risks and ensuring established controls are in place to minimize exposures. Also, completing continued assessments of processes to provide recommendations of improvements and/or enhancements as changes occur. In addition, working with senior executive team to highlight emerging risks and provide recommendations to eliminate risks for identified concerns. Internal Audit Investigator IBM September 2004  –  May 2008  (3 years 9 months) Raleigh NC Responsible for investigating potential fraud issues or unethical behavior that were committed by IBM employees. Completed an analysis and strategy for each investigation and exercised due professional care in the performance of interviews. Provided a conclusion of the investigation in a report format that was supported with evidence that was relevant, competent and sufficient to the investigation. Also, collaborated with General Counsel/Human Resources of recommended action if fraud issues or unethical behavior were identified. Investigation assignments included Asia, Europe, and Latin America. Team Leader for Internal Audit IBM January 2003  –  September 2004  (1 year 9 months) Raleigh NC Responsible for leading and the successful completion of audit engagements. Provided independent validation of the integrity of IBM’s internal controls. Evaluated processes to ensure controls were followed, identified areas of deficiency, and recommended improvements and/or enhancements as appropriate. Provided guidance in managing risks globally. This included assurance to IBM stakeholders regarding IBM’s financial reporting, compliance with laws and regulations, and effective and efficient operations. Audit assignments included Europe and Latin America. Project Office Manager IBM May 2012  – Present (3 years 4 months) Wilmington, Delaware Responsible for leading contract management functions for an IBM Global Technology Services account in Wilmington DE. Supervise work activities for Contract Management Services Resources. This includes maintaining in-depth knowledge of the account and working on new business opportunities. In addition, recognize complex issues, analyze the situation, and provide recommendations and implement solutions as required. In addition, continue to ensure compliance to business control requirements and positive audit posture for the account. Project Office Manager IBM May 2012  – Present (3 years 4 months) Wilmington, Delaware Responsible for leading contract management functions for an IBM Global Technology Services account in Wilmington DE. Supervise work activities for Contract Management Services Resources. This includes maintaining in-depth knowledge of the account and working on new business opportunities. In addition, recognize complex issues, analyze the situation, and provide recommendations and implement solutions as required. In addition, continue to ensure compliance to business control requirements and positive audit posture for the account. Senior Compliance Manager IBM June 2010  –  May 2012  (2 years) South Africa -Kenya Responsible for leading a team in Johannesburg, South Africa and Nairobi, Kenya to ensure compliance to developed and maintained IBM processes and IBM/customer agreements. Test requirements were developed to track compliance of the processes. Weekly and monthly results were provided and reviewed with the executive management teams. Continued assistance was provided to the project and management teams in identifying, assessing, and addressing project risks, issues, and process challenges. An additional responsibility was the primary interface for Corporate Audits and other business controls reviews Senior Compliance Manager IBM June 2010  –  May 2012  (2 years) South Africa -Kenya Responsible for leading a team in Johannesburg, South Africa and Nairobi, Kenya to ensure compliance to developed and maintained IBM processes and IBM/customer agreements. Test requirements were developed to track compliance of the processes. Weekly and monthly results were provided and reviewed with the executive management teams. Continued assistance was provided to the project and management teams in identifying, assessing, and addressing project risks, issues, and process challenges. An additional responsibility was the primary interface for Corporate Audits and other business controls reviews Senior Internal Auditor IBM May 2008  –  May 2010  (2 years 1 month) Austin TX Responsible for developing and deploying operational and billing processes for a newly established customer in Austin, Texas. Determining areas of risks and ensuring established controls are in place to minimize exposures. Also, completing continued assessments of processes to provide recommendations of improvements and/or enhancements as changes occur. In addition, working with senior executive team to highlight emerging risks and provide recommendations to eliminate risks for identified concerns. Senior Internal Auditor IBM May 2008  –  May 2010  (2 years 1 month) Austin TX Responsible for developing and deploying operational and billing processes for a newly established customer in Austin, Texas. Determining areas of risks and ensuring established controls are in place to minimize exposures. Also, completing continued assessments of processes to provide recommendations of improvements and/or enhancements as changes occur. In addition, working with senior executive team to highlight emerging risks and provide recommendations to eliminate risks for identified concerns. Internal Audit Investigator IBM September 2004  –  May 2008  (3 years 9 months) Raleigh NC Responsible for investigating potential fraud issues or unethical behavior that were committed by IBM employees. Completed an analysis and strategy for each investigation and exercised due professional care in the performance of interviews. Provided a conclusion of the investigation in a report format that was supported with evidence that was relevant, competent and sufficient to the investigation. Also, collaborated with General Counsel/Human Resources of recommended action if fraud issues or unethical behavior were identified. Investigation assignments included Asia, Europe, and Latin America. Internal Audit Investigator IBM September 2004  –  May 2008  (3 years 9 months) Raleigh NC Responsible for investigating potential fraud issues or unethical behavior that were committed by IBM employees. Completed an analysis and strategy for each investigation and exercised due professional care in the performance of interviews. Provided a conclusion of the investigation in a report format that was supported with evidence that was relevant, competent and sufficient to the investigation. Also, collaborated with General Counsel/Human Resources of recommended action if fraud issues or unethical behavior were identified. Investigation assignments included Asia, Europe, and Latin America. Team Leader for Internal Audit IBM January 2003  –  September 2004  (1 year 9 months) Raleigh NC Responsible for leading and the successful completion of audit engagements. Provided independent validation of the integrity of IBM’s internal controls. Evaluated processes to ensure controls were followed, identified areas of deficiency, and recommended improvements and/or enhancements as appropriate. Provided guidance in managing risks globally. This included assurance to IBM stakeholders regarding IBM’s financial reporting, compliance with laws and regulations, and effective and efficient operations. Audit assignments included Europe and Latin America. Team Leader for Internal Audit IBM January 2003  –  September 2004  (1 year 9 months) Raleigh NC Responsible for leading and the successful completion of audit engagements. Provided independent validation of the integrity of IBM’s internal controls. Evaluated processes to ensure controls were followed, identified areas of deficiency, and recommended improvements and/or enhancements as appropriate. Provided guidance in managing risks globally. This included assurance to IBM stakeholders regarding IBM’s financial reporting, compliance with laws and regulations, and effective and efficient operations. Audit assignments included Europe and Latin America. Education University of Delaware 1995  – 1999 Utica College MBA in Fraud Management University of Delaware 1995  – 1999 University of Delaware 1995  – 1999 University of Delaware 1995  – 1999 Utica College MBA in Fraud Management Utica College MBA in Fraud Management Utica College MBA in Fraud Management ", "Experience Managing Director Tag Worldwide May 2013  – Present (2 years 4 months) Greater New York City Area • Accountability for client services and operations for print management and procurement services for Tag: Strategic Sourcing business in the US and Canada. \n• Lead executive responsible for existing and new business - P&L oversight, operations, client satisfaction and relationship management. Vice President, Vendor Operations Williams Lea May 2011  –  May 2013  (2 years 1 month) Greater New York City Area •\tLead sourcing executive for Business Process Outsourcer providing world class supply chain outsourcing services in the US, Canada, Mexico, and South America. \n•\tAccountability for sourcing decisions and vendor relationships for procurement of print and printed materials in support of client businesses. Scope includes management of a team of twenty sourcing and analytics professionals. Vice President, Finance Williams Lea March 2008  –  May 2011  (3 years 3 months) Greater New York City Area •\tLead financial executive for Business Process Outsourcer providing world class supply chain outsourcing services in the US, Canada, Mexico, and South America. \n•\tFinancial and commercial accountability for division managing over $500MM of print and packaging spend on behalf of commercial clients in the retail, financial services, publishing and media, and consumer packaged goods industries. Scope includes management of a team of ten financial professionals. \n•\tDesigned commercial models and negotiated legal and financial terms on new deals. \n•\tParticipated on the Unsecured Creditors Committee for the Reader’s Digest bankruptcy matter, securing 100% cure payment on the firm’s outstanding claims. \n•\tThrough intense focus on collections and design of more favorable contract terms, reduced Days Sales Outstanding (DSO) from an average over 70 in 2009 to a 2010 run rate below 45.  \n•\tConsistently over-delivering monthly EBITDA targets and 2010 cost reduction goals, positioned the firm to exceed its annual financial targets in 2010. Project Executive IBM January 2007  –  March 2008  (1 year 3 months) Greater New York City Area •\tPromoted in January 2007 to project executive with overall responsibility for IBM’s Finance and Accounting (F&A) outsourcing contract with Unilever North America, including profit and loss ownership, delivery quality, and customer satisfaction.  \n•\tOperational accountability for IBM’s delivery of F&A services (general accounting, management and financial reporting, accounts payable, and time and expense report processing) including more than 150 people working in the United States, Canada, and India. Operational budget in excess of $14MM. Act as outsourced Director of Finance for Controllers of three major business units within Unilever North America. \n•\tAchieved 2007 unqualified audit opinions on delivery controls (IBM’s external SAS70 audit) and from Unilever’s external audit firm.  \n•\tDrove a 50% increase in customer satisfaction from 2006 to 2007 through intense focus on quality of IBM’s finance and accounting outsourcing services. Enhanced customer satisfaction allowed IBM to sign new services in excess of $1MM. Client Finance Manager IBM August 2004  –  January 2007  (2 years 6 months) Greater New York City Area •\tResponsible for all financial aspects of multi-million dollar business transformation outsourcing (BTO) deals including price determination, project costing, business case analysis, approval of financial terms & conditions, and client negotiations. Average deal size approximately $100MM to $150MM in total value. \n•\tCommunicate financial concepts to and negotiate contract terms with IBM executives and client senior management. Acted as interface between IBM leadership and client program management to achieve closure on BTO engagements. \n•\tActively involved in the design of approximately twenty BTO engagements with aggregate consideration of over $2 billion. Trusted member of solution sales team.  \n•\tAdvise business development executives on all financial implications of deal construction. Ensure that engagement teams adhere to internal financial guidelines and comply with generally accepted accounting principles and business controls. \n•\tUtilized financial tools, processes, and methodologies as lead associate on four successful outsourcing engagements with global financial services, industrial products, and transportation firms - total contract value in excess of a combined $420MM. Financial Intern IBM May 2003  –  August 2003  (4 months) Greater New York City Area •\tAssisted in the formulation of the business plan to transform IBM’s accounts payable and fixed asset accounting functions to low-cost locations and automated processes. Implementation resulted in significant savings to IBM. \n•\tConsolidated financial information on the portfolio of worldwide BTO deals. Modeled the impact of outstanding customer proposals on IBM’s worldwide financial results. Analyzed wide range of financial and legal issues. Senior Financial Analyst Web Methods September 2001  –  August 2002  (1 year) Fairfax, VA •\tReported, forecasted, and analyzed all financial statements for public software company with $240MM in annual revenues. Collaborated with CFO and Controller to prepare key operating metrics, financial results, and management discussion and analysis for quarterly earnings announcements and SEC filings. \n•\tLeveraged internal audit and controls background to implement and manage controls for F&A processes for the firm - processes included revenue and cost recognition, accounts payable and receivable, and ledger reconciliation. Performed periodic assessments of the company’s controls posture; reported conclusions and recommendations to CEO and CFO. \n•\tRedesigned and upgraded company’s internal and competitive valuation models resulting in improved clarity on long- and medium-term business plans. Specific valuation approaches included discounted cash flow and comparable analysis. \n•\tOversaw fiscal budgeting, forecasting, and target-setting for three worldwide subsidiaries with $150MM+ in annual SG&A. Focused on expense reductions in areas such as travel expenses, IT spending, marketing, and property costs. Manager, Financial Planning and Analysis Winstar Communications November 1999  –  September 2001  (1 year 11 months) Washington D.C. Metro Area •\tLed cross-functional and cross-organizational teams to identify merger and acquisition targets in Europe, Asia, and the Americas. Specific responsibilities included consultation and collaboration with investment banks and target company senior management, acquisition due diligence, and negotiation of deal structure. Played a central role in the evaluation of three international acquisitions with aggregate consideration of over $160MM. \n•\tConstructed detailed business models for presentation to executives, banks, and private investors for evaluation of multi- million dollar new business ventures. Created valuation models for participation in government-run license auctions in the United Kingdom, Argentina, and Peru. \n•\tReengineered collections and revenue recognition processes during bankruptcy. Created weekly cash collections and revenue reconciliation reports for CEO and lending institutions. Senior Internal Auditor IBM May 1998  –  November 1999  (1 year 7 months) Washington D.C. Metro Area •\tLed financial and operational audit teams in internal audits of IBM Global Services, the fastest growing and highest risk business unit within the firm. Passed all four parts of Certified Internal Auditor (CIA) exam on first attempt in 1999. \n•\tEvaluated the quality and effectiveness of controls during the design and delivery phases of several of IBM’s Information Technology Strategic Outsourcing (ITSO) contracts. Recommended multiple process improvements to Project Executives.  \n•\tManaged entire audit engagements, including a team of five to ten auditors; devised integrated audit approach to identify exposures in critical business processes. Financial Analyst IBM February 1995  –  May 1998  (3 years 4 months) Greater New York City Area •\tManaged financial planning and business controls processes for headquarters functions in IBM’s Server Division. \n•\tControlled $100MM SG&A budget; developed annual budgets; reviewed periodic forecasts with Corporate Finance. Sales Associate Dorian Drake International July 1993  –  February 1995  (1 year 8 months) Greater New York City Area Managing Director Tag Worldwide May 2013  – Present (2 years 4 months) Greater New York City Area • Accountability for client services and operations for print management and procurement services for Tag: Strategic Sourcing business in the US and Canada. \n• Lead executive responsible for existing and new business - P&L oversight, operations, client satisfaction and relationship management. Managing Director Tag Worldwide May 2013  – Present (2 years 4 months) Greater New York City Area • Accountability for client services and operations for print management and procurement services for Tag: Strategic Sourcing business in the US and Canada. \n• Lead executive responsible for existing and new business - P&L oversight, operations, client satisfaction and relationship management. Vice President, Vendor Operations Williams Lea May 2011  –  May 2013  (2 years 1 month) Greater New York City Area •\tLead sourcing executive for Business Process Outsourcer providing world class supply chain outsourcing services in the US, Canada, Mexico, and South America. \n•\tAccountability for sourcing decisions and vendor relationships for procurement of print and printed materials in support of client businesses. Scope includes management of a team of twenty sourcing and analytics professionals. Vice President, Vendor Operations Williams Lea May 2011  –  May 2013  (2 years 1 month) Greater New York City Area •\tLead sourcing executive for Business Process Outsourcer providing world class supply chain outsourcing services in the US, Canada, Mexico, and South America. \n•\tAccountability for sourcing decisions and vendor relationships for procurement of print and printed materials in support of client businesses. Scope includes management of a team of twenty sourcing and analytics professionals. Vice President, Finance Williams Lea March 2008  –  May 2011  (3 years 3 months) Greater New York City Area •\tLead financial executive for Business Process Outsourcer providing world class supply chain outsourcing services in the US, Canada, Mexico, and South America. \n•\tFinancial and commercial accountability for division managing over $500MM of print and packaging spend on behalf of commercial clients in the retail, financial services, publishing and media, and consumer packaged goods industries. Scope includes management of a team of ten financial professionals. \n•\tDesigned commercial models and negotiated legal and financial terms on new deals. \n•\tParticipated on the Unsecured Creditors Committee for the Reader’s Digest bankruptcy matter, securing 100% cure payment on the firm’s outstanding claims. \n•\tThrough intense focus on collections and design of more favorable contract terms, reduced Days Sales Outstanding (DSO) from an average over 70 in 2009 to a 2010 run rate below 45.  \n•\tConsistently over-delivering monthly EBITDA targets and 2010 cost reduction goals, positioned the firm to exceed its annual financial targets in 2010. Vice President, Finance Williams Lea March 2008  –  May 2011  (3 years 3 months) Greater New York City Area •\tLead financial executive for Business Process Outsourcer providing world class supply chain outsourcing services in the US, Canada, Mexico, and South America. \n•\tFinancial and commercial accountability for division managing over $500MM of print and packaging spend on behalf of commercial clients in the retail, financial services, publishing and media, and consumer packaged goods industries. Scope includes management of a team of ten financial professionals. \n•\tDesigned commercial models and negotiated legal and financial terms on new deals. \n•\tParticipated on the Unsecured Creditors Committee for the Reader’s Digest bankruptcy matter, securing 100% cure payment on the firm’s outstanding claims. \n•\tThrough intense focus on collections and design of more favorable contract terms, reduced Days Sales Outstanding (DSO) from an average over 70 in 2009 to a 2010 run rate below 45.  \n•\tConsistently over-delivering monthly EBITDA targets and 2010 cost reduction goals, positioned the firm to exceed its annual financial targets in 2010. Project Executive IBM January 2007  –  March 2008  (1 year 3 months) Greater New York City Area •\tPromoted in January 2007 to project executive with overall responsibility for IBM’s Finance and Accounting (F&A) outsourcing contract with Unilever North America, including profit and loss ownership, delivery quality, and customer satisfaction.  \n•\tOperational accountability for IBM’s delivery of F&A services (general accounting, management and financial reporting, accounts payable, and time and expense report processing) including more than 150 people working in the United States, Canada, and India. Operational budget in excess of $14MM. Act as outsourced Director of Finance for Controllers of three major business units within Unilever North America. \n•\tAchieved 2007 unqualified audit opinions on delivery controls (IBM’s external SAS70 audit) and from Unilever’s external audit firm.  \n•\tDrove a 50% increase in customer satisfaction from 2006 to 2007 through intense focus on quality of IBM’s finance and accounting outsourcing services. Enhanced customer satisfaction allowed IBM to sign new services in excess of $1MM. Project Executive IBM January 2007  –  March 2008  (1 year 3 months) Greater New York City Area •\tPromoted in January 2007 to project executive with overall responsibility for IBM’s Finance and Accounting (F&A) outsourcing contract with Unilever North America, including profit and loss ownership, delivery quality, and customer satisfaction.  \n•\tOperational accountability for IBM’s delivery of F&A services (general accounting, management and financial reporting, accounts payable, and time and expense report processing) including more than 150 people working in the United States, Canada, and India. Operational budget in excess of $14MM. Act as outsourced Director of Finance for Controllers of three major business units within Unilever North America. \n•\tAchieved 2007 unqualified audit opinions on delivery controls (IBM’s external SAS70 audit) and from Unilever’s external audit firm.  \n•\tDrove a 50% increase in customer satisfaction from 2006 to 2007 through intense focus on quality of IBM’s finance and accounting outsourcing services. Enhanced customer satisfaction allowed IBM to sign new services in excess of $1MM. Client Finance Manager IBM August 2004  –  January 2007  (2 years 6 months) Greater New York City Area •\tResponsible for all financial aspects of multi-million dollar business transformation outsourcing (BTO) deals including price determination, project costing, business case analysis, approval of financial terms & conditions, and client negotiations. Average deal size approximately $100MM to $150MM in total value. \n•\tCommunicate financial concepts to and negotiate contract terms with IBM executives and client senior management. Acted as interface between IBM leadership and client program management to achieve closure on BTO engagements. \n•\tActively involved in the design of approximately twenty BTO engagements with aggregate consideration of over $2 billion. Trusted member of solution sales team.  \n•\tAdvise business development executives on all financial implications of deal construction. Ensure that engagement teams adhere to internal financial guidelines and comply with generally accepted accounting principles and business controls. \n•\tUtilized financial tools, processes, and methodologies as lead associate on four successful outsourcing engagements with global financial services, industrial products, and transportation firms - total contract value in excess of a combined $420MM. Client Finance Manager IBM August 2004  –  January 2007  (2 years 6 months) Greater New York City Area •\tResponsible for all financial aspects of multi-million dollar business transformation outsourcing (BTO) deals including price determination, project costing, business case analysis, approval of financial terms & conditions, and client negotiations. Average deal size approximately $100MM to $150MM in total value. \n•\tCommunicate financial concepts to and negotiate contract terms with IBM executives and client senior management. Acted as interface between IBM leadership and client program management to achieve closure on BTO engagements. \n•\tActively involved in the design of approximately twenty BTO engagements with aggregate consideration of over $2 billion. Trusted member of solution sales team.  \n•\tAdvise business development executives on all financial implications of deal construction. Ensure that engagement teams adhere to internal financial guidelines and comply with generally accepted accounting principles and business controls. \n•\tUtilized financial tools, processes, and methodologies as lead associate on four successful outsourcing engagements with global financial services, industrial products, and transportation firms - total contract value in excess of a combined $420MM. Financial Intern IBM May 2003  –  August 2003  (4 months) Greater New York City Area •\tAssisted in the formulation of the business plan to transform IBM’s accounts payable and fixed asset accounting functions to low-cost locations and automated processes. Implementation resulted in significant savings to IBM. \n•\tConsolidated financial information on the portfolio of worldwide BTO deals. Modeled the impact of outstanding customer proposals on IBM’s worldwide financial results. Analyzed wide range of financial and legal issues. Financial Intern IBM May 2003  –  August 2003  (4 months) Greater New York City Area •\tAssisted in the formulation of the business plan to transform IBM’s accounts payable and fixed asset accounting functions to low-cost locations and automated processes. Implementation resulted in significant savings to IBM. \n•\tConsolidated financial information on the portfolio of worldwide BTO deals. Modeled the impact of outstanding customer proposals on IBM’s worldwide financial results. Analyzed wide range of financial and legal issues. Senior Financial Analyst Web Methods September 2001  –  August 2002  (1 year) Fairfax, VA •\tReported, forecasted, and analyzed all financial statements for public software company with $240MM in annual revenues. Collaborated with CFO and Controller to prepare key operating metrics, financial results, and management discussion and analysis for quarterly earnings announcements and SEC filings. \n•\tLeveraged internal audit and controls background to implement and manage controls for F&A processes for the firm - processes included revenue and cost recognition, accounts payable and receivable, and ledger reconciliation. Performed periodic assessments of the company’s controls posture; reported conclusions and recommendations to CEO and CFO. \n•\tRedesigned and upgraded company’s internal and competitive valuation models resulting in improved clarity on long- and medium-term business plans. Specific valuation approaches included discounted cash flow and comparable analysis. \n•\tOversaw fiscal budgeting, forecasting, and target-setting for three worldwide subsidiaries with $150MM+ in annual SG&A. Focused on expense reductions in areas such as travel expenses, IT spending, marketing, and property costs. Senior Financial Analyst Web Methods September 2001  –  August 2002  (1 year) Fairfax, VA •\tReported, forecasted, and analyzed all financial statements for public software company with $240MM in annual revenues. Collaborated with CFO and Controller to prepare key operating metrics, financial results, and management discussion and analysis for quarterly earnings announcements and SEC filings. \n•\tLeveraged internal audit and controls background to implement and manage controls for F&A processes for the firm - processes included revenue and cost recognition, accounts payable and receivable, and ledger reconciliation. Performed periodic assessments of the company’s controls posture; reported conclusions and recommendations to CEO and CFO. \n•\tRedesigned and upgraded company’s internal and competitive valuation models resulting in improved clarity on long- and medium-term business plans. Specific valuation approaches included discounted cash flow and comparable analysis. \n•\tOversaw fiscal budgeting, forecasting, and target-setting for three worldwide subsidiaries with $150MM+ in annual SG&A. Focused on expense reductions in areas such as travel expenses, IT spending, marketing, and property costs. Manager, Financial Planning and Analysis Winstar Communications November 1999  –  September 2001  (1 year 11 months) Washington D.C. Metro Area •\tLed cross-functional and cross-organizational teams to identify merger and acquisition targets in Europe, Asia, and the Americas. Specific responsibilities included consultation and collaboration with investment banks and target company senior management, acquisition due diligence, and negotiation of deal structure. Played a central role in the evaluation of three international acquisitions with aggregate consideration of over $160MM. \n•\tConstructed detailed business models for presentation to executives, banks, and private investors for evaluation of multi- million dollar new business ventures. Created valuation models for participation in government-run license auctions in the United Kingdom, Argentina, and Peru. \n•\tReengineered collections and revenue recognition processes during bankruptcy. Created weekly cash collections and revenue reconciliation reports for CEO and lending institutions. Manager, Financial Planning and Analysis Winstar Communications November 1999  –  September 2001  (1 year 11 months) Washington D.C. Metro Area •\tLed cross-functional and cross-organizational teams to identify merger and acquisition targets in Europe, Asia, and the Americas. Specific responsibilities included consultation and collaboration with investment banks and target company senior management, acquisition due diligence, and negotiation of deal structure. Played a central role in the evaluation of three international acquisitions with aggregate consideration of over $160MM. \n•\tConstructed detailed business models for presentation to executives, banks, and private investors for evaluation of multi- million dollar new business ventures. Created valuation models for participation in government-run license auctions in the United Kingdom, Argentina, and Peru. \n•\tReengineered collections and revenue recognition processes during bankruptcy. Created weekly cash collections and revenue reconciliation reports for CEO and lending institutions. Senior Internal Auditor IBM May 1998  –  November 1999  (1 year 7 months) Washington D.C. Metro Area •\tLed financial and operational audit teams in internal audits of IBM Global Services, the fastest growing and highest risk business unit within the firm. Passed all four parts of Certified Internal Auditor (CIA) exam on first attempt in 1999. \n•\tEvaluated the quality and effectiveness of controls during the design and delivery phases of several of IBM’s Information Technology Strategic Outsourcing (ITSO) contracts. Recommended multiple process improvements to Project Executives.  \n•\tManaged entire audit engagements, including a team of five to ten auditors; devised integrated audit approach to identify exposures in critical business processes. Senior Internal Auditor IBM May 1998  –  November 1999  (1 year 7 months) Washington D.C. Metro Area •\tLed financial and operational audit teams in internal audits of IBM Global Services, the fastest growing and highest risk business unit within the firm. Passed all four parts of Certified Internal Auditor (CIA) exam on first attempt in 1999. \n•\tEvaluated the quality and effectiveness of controls during the design and delivery phases of several of IBM’s Information Technology Strategic Outsourcing (ITSO) contracts. Recommended multiple process improvements to Project Executives.  \n•\tManaged entire audit engagements, including a team of five to ten auditors; devised integrated audit approach to identify exposures in critical business processes. Financial Analyst IBM February 1995  –  May 1998  (3 years 4 months) Greater New York City Area •\tManaged financial planning and business controls processes for headquarters functions in IBM’s Server Division. \n•\tControlled $100MM SG&A budget; developed annual budgets; reviewed periodic forecasts with Corporate Finance. Financial Analyst IBM February 1995  –  May 1998  (3 years 4 months) Greater New York City Area •\tManaged financial planning and business controls processes for headquarters functions in IBM’s Server Division. \n•\tControlled $100MM SG&A budget; developed annual budgets; reviewed periodic forecasts with Corporate Finance. Sales Associate Dorian Drake International July 1993  –  February 1995  (1 year 8 months) Greater New York City Area Sales Associate Dorian Drake International July 1993  –  February 1995  (1 year 8 months) Greater New York City Area Education Georgetown University - The McDonough School of Business MBA,  Finance 2002  – 2004 Gettysburg College BA,  Management 1989  – 1993 Georgetown University - The McDonough School of Business MBA,  Finance 2002  – 2004 Georgetown University - The McDonough School of Business MBA,  Finance 2002  – 2004 Georgetown University - The McDonough School of Business MBA,  Finance 2002  – 2004 Gettysburg College BA,  Management 1989  – 1993 Gettysburg College BA,  Management 1989  – 1993 Gettysburg College BA,  Management 1989  – 1993 ", "Summary I am looking for professional opportunities in the third sector in the European Economic Community. I have persistent and hard working personality with youthful dynamics. Summary I am looking for professional opportunities in the third sector in the European Economic Community. I have persistent and hard working personality with youthful dynamics. I am looking for professional opportunities in the third sector in the European Economic Community. I have persistent and hard working personality with youthful dynamics. I am looking for professional opportunities in the third sector in the European Economic Community. I have persistent and hard working personality with youthful dynamics. Experience Auditor International Business Machines January 2009  – Present (6 years 8 months) Contract reviews, monthly invoice analysis, customised IT security documents, reporting, presentations, result rating student EPHEC 2013  –  2014  (1 year) student EPHEC 2013  –  2014  (1 year) Senior Internal Auditor IBM January 2009  –  August 2013  (4 years 8 months) Hungary ●Complete contract review \n●financial, IT security and asset management related compliance testing \n●rating creation and presentation \n●process improvement \n●report to the board of executives Logistics Lidl Hu March 2007  –  December 2008  (1 year 10 months) LIDL western-hungary Logistics Centre LIDL Magyarország February 2006  –  October 2008  (2 years 9 months) Returned goods supervisor \n● Receipt of returned goods \n● Bookkeeping \n● Organize of recycling \n● Managing three storekeepers Auditor International Business Machines January 2009  – Present (6 years 8 months) Contract reviews, monthly invoice analysis, customised IT security documents, reporting, presentations, result rating Auditor International Business Machines January 2009  – Present (6 years 8 months) Contract reviews, monthly invoice analysis, customised IT security documents, reporting, presentations, result rating student EPHEC 2013  –  2014  (1 year) student EPHEC 2013  –  2014  (1 year) student EPHEC 2013  –  2014  (1 year) student EPHEC 2013  –  2014  (1 year) Senior Internal Auditor IBM January 2009  –  August 2013  (4 years 8 months) Hungary ●Complete contract review \n●financial, IT security and asset management related compliance testing \n●rating creation and presentation \n●process improvement \n●report to the board of executives Senior Internal Auditor IBM January 2009  –  August 2013  (4 years 8 months) Hungary ●Complete contract review \n●financial, IT security and asset management related compliance testing \n●rating creation and presentation \n●process improvement \n●report to the board of executives Logistics Lidl Hu March 2007  –  December 2008  (1 year 10 months) Logistics Lidl Hu March 2007  –  December 2008  (1 year 10 months) LIDL western-hungary Logistics Centre LIDL Magyarország February 2006  –  October 2008  (2 years 9 months) Returned goods supervisor \n● Receipt of returned goods \n● Bookkeeping \n● Organize of recycling \n● Managing three storekeepers LIDL western-hungary Logistics Centre LIDL Magyarország February 2006  –  October 2008  (2 years 9 months) Returned goods supervisor \n● Receipt of returned goods \n● Bookkeeping \n● Organize of recycling \n● Managing three storekeepers Languages English English English Skills Sarbanes-Oxley Act Financial Reporting Auditing Internal Audit Internal Controls SAP Financial Analysis Accounting Business Analysis IT Audit Consolidation Financial Accounting Business Process... Process Improvement SAP R/3 Business Process See 1+     See less Skills  Sarbanes-Oxley Act Financial Reporting Auditing Internal Audit Internal Controls SAP Financial Analysis Accounting Business Analysis IT Audit Consolidation Financial Accounting Business Process... Process Improvement SAP R/3 Business Process See 1+     See less Sarbanes-Oxley Act Financial Reporting Auditing Internal Audit Internal Controls SAP Financial Analysis Accounting Business Analysis IT Audit Consolidation Financial Accounting Business Process... Process Improvement SAP R/3 Business Process See 1+     See less Sarbanes-Oxley Act Financial Reporting Auditing Internal Audit Internal Controls SAP Financial Analysis Accounting Business Analysis IT Audit Consolidation Financial Accounting Business Process... Process Improvement SAP R/3 Business Process See 1+     See less Education Ecole Pratique Hautes Etudes Commerciales (EPHEC) Bachelor of Business Administration (BBA),  International Business/Trade/Commerce , summa cum laude 2013  – 2014 Activities and Societies:  Supply Chain orientation practical team Széchényi István Egyetem International Management,  International Business , Trade, and Tax Law 2011  – 2014 Selected presenter at Tudásmenedzsment Központ - PwC innovation competition - IT and Marketing in the near future - intelligent data processing Activities and Societies:  2013 PwC idea competition ,  Tudásmenedzsment Központ Győr SZE Kodolányi János Highschool High School Degree,  matriculation 2002  – 2004 Activities and Societies:  Student Council - honorable member Ecole Pratique Hautes Etudes Commerciales (EPHEC) Bachelor of Business Administration (BBA),  International Business/Trade/Commerce , summa cum laude 2013  – 2014 Activities and Societies:  Supply Chain orientation practical team Ecole Pratique Hautes Etudes Commerciales (EPHEC) Bachelor of Business Administration (BBA),  International Business/Trade/Commerce , summa cum laude 2013  – 2014 Activities and Societies:  Supply Chain orientation practical team Ecole Pratique Hautes Etudes Commerciales (EPHEC) Bachelor of Business Administration (BBA),  International Business/Trade/Commerce , summa cum laude 2013  – 2014 Activities and Societies:  Supply Chain orientation practical team Széchényi István Egyetem International Management,  International Business , Trade, and Tax Law 2011  – 2014 Selected presenter at Tudásmenedzsment Központ - PwC innovation competition - IT and Marketing in the near future - intelligent data processing Activities and Societies:  2013 PwC idea competition ,  Tudásmenedzsment Központ Győr SZE Széchényi István Egyetem International Management,  International Business , Trade, and Tax Law 2011  – 2014 Selected presenter at Tudásmenedzsment Központ - PwC innovation competition - IT and Marketing in the near future - intelligent data processing Activities and Societies:  2013 PwC idea competition ,  Tudásmenedzsment Központ Győr SZE Széchényi István Egyetem International Management,  International Business , Trade, and Tax Law 2011  – 2014 Selected presenter at Tudásmenedzsment Központ - PwC innovation competition - IT and Marketing in the near future - intelligent data processing Activities and Societies:  2013 PwC idea competition ,  Tudásmenedzsment Központ Győr SZE Kodolányi János Highschool High School Degree,  matriculation 2002  – 2004 Activities and Societies:  Student Council - honorable member Kodolányi János Highschool High School Degree,  matriculation 2002  – 2004 Activities and Societies:  Student Council - honorable member Kodolányi János Highschool High School Degree,  matriculation 2002  – 2004 Activities and Societies:  Student Council - honorable member ", "Experience Senior Internal Auditor IBM Senior Internal Auditor IBM Senior Internal Auditor IBM ", "Summary An effective leader with strong communication, analytical, relationship management and co-ordination skills. Certified Project Management Professional from Project Management Institute,USA Summary An effective leader with strong communication, analytical, relationship management and co-ordination skills. Certified Project Management Professional from Project Management Institute,USA An effective leader with strong communication, analytical, relationship management and co-ordination skills. Certified Project Management Professional from Project Management Institute,USA An effective leader with strong communication, analytical, relationship management and co-ordination skills. Certified Project Management Professional from Project Management Institute,USA Experience Asst. Project Mangager Standard Chartered Bank November 2010  – Present (4 years 10 months) Project Management Skills \n-Requirement analysis \n-Project scheduling and analysis \n-Effort Estimation \n-Technology selection \n-Resource administration \n-Risk and Issue Management \n-Project Execution \n-Team Management \n-Project Co-ordination and Status Tracking \n-Delivery /Technical support \n \nSDLC Planning and Co-ordination \n \n-Gap Analysis \n-Process Management \n-Software Design & Development \n-Software Testing & Validation \n-Change Management Initiation \n-Quality Assurance & Compliance \n \nAs a Project Delivery Line Manager my role is to manage in-line Project Managers delivering IT Infrastructure projects across various portfolios . \nManaging diverse teams supporting multiple applications across several business units and directing each of these complex multi-site projects from inception to production implementation \nAcquire budget approval for the project cost \nManaging all aspects of projects, including providing overall guidance and direction to the project and overseeing financial management activities \nBalancing scope, schedule, budget, quality, and risks and making adjustments as and when necessary \nMeasuring and monitoring project progress at clearly defined points (key project milestones) and ensuring that the project is delivered on time, within budget, and that it met or exceeded stakeholder expectations \nManaging stakeholder relationships and representing the project team at stakeholder meetings and working as a primary interface between the team and the customers on all project related matters \nDefining roles and expectations of each of the team members and establishing processes for a timely feedback and conducting performance reviews Senior Internal Auditor IBM India Pvt. Ltd. January 2008  –  October 2010  (2 years 10 months) Ensure early identification and escalation of risks, issues, trends to relevant stakeholders \n• Adopt an anticipatory approach to risk \n• Delivery of the agreed audit plan for the country / region as assigned \n• Understanding the key audit issues and escalating any significant audit findings that remain unresolved \n• Help to develop an annual audit plan; Ensure plan meets the Group & Audit Committee’s expectations \n• Carry out the department’s audits, to ensure departmental mandate and business goals are met and that professional standards are maintained at all times. \n• Execute audit and assurance assignments to provide independent, objective assessments \n• Build relationships with leaders across the country to understand issues and identify areas for improvement for the organisation as a whole. \n• Share best practice to improve the control environment; make recommendations to Country Head of Audit SAP FI Accountant Accenture October 2005  –  December 2007  (2 years 3 months) Project and Role Description  \nWith the three brands, BMW, MINI and Rolls-Royce Motor Cars, the BMW Group has its sights set firmly on the premium sector of the international automobile market. To achieve its aims, the company knows how to deploy its strengths with an efficiency that is unmatched in the automotive industry. The strategic objective is clearly defined: The BMW Group is the leading provider of premium products and premium services for individual mobility. \n \nThe BMW SAP Project is at the heart of BMW's strategic agenda. BMW has decided to consolidate its entire supplier landscape in IT operations. Besides significant cost savings, BMW expects to achieve higher quality services through reliable, industrialized operations performed by the most capable partners in the marketplace. High quality services at low cost are the basis for BMW's IT to create value for the BMW business organization and contribute to the continuing success of the BMW Group. \n \nTeam Lead - SAP (FICO), BMW SAO Project with the roles & responsibilities summarized below: \n \n- Responsible for Service Delivery of SAP-FICO applications of BMW. \n- Responsibility includes Knowledge Transfer from BMW to Offshore resources, adherence to SLAs, Handling Client escalations, Review of Solution Quality, Resource Utilization, etc. \n- Actively involved in resolution of Incident Management tickets, Problem Management Tickets and Estimations for Change Requests for SAP-FICO. \n- Preparation of Accenture AO Metrics, Resource Utilization, Vacation Plans, Performance Assessments Treasury Analyst Barclays Capital July 2004  –  September 2005  (1 year 3 months) Performed analysis of all daily and non-daily financial treasury operations activities. \nParticipated in cross-functional finance projects as necessary. \nAssisted in developing and performing according to personal goals, objectives and annual account abilities. \nWorked closely with business customers to identify, prioritize and document business requirements. \nPerformed treasury operational functions such as cash management, cash forecasting, interest rate monitoring and forecasting, capital funding and financial derivative analyses. \nPrepared daily/monthly treasury journal entries and upload into SAP G/L System. Asst. Project Mangager Standard Chartered Bank November 2010  – Present (4 years 10 months) Project Management Skills \n-Requirement analysis \n-Project scheduling and analysis \n-Effort Estimation \n-Technology selection \n-Resource administration \n-Risk and Issue Management \n-Project Execution \n-Team Management \n-Project Co-ordination and Status Tracking \n-Delivery /Technical support \n \nSDLC Planning and Co-ordination \n \n-Gap Analysis \n-Process Management \n-Software Design & Development \n-Software Testing & Validation \n-Change Management Initiation \n-Quality Assurance & Compliance \n \nAs a Project Delivery Line Manager my role is to manage in-line Project Managers delivering IT Infrastructure projects across various portfolios . \nManaging diverse teams supporting multiple applications across several business units and directing each of these complex multi-site projects from inception to production implementation \nAcquire budget approval for the project cost \nManaging all aspects of projects, including providing overall guidance and direction to the project and overseeing financial management activities \nBalancing scope, schedule, budget, quality, and risks and making adjustments as and when necessary \nMeasuring and monitoring project progress at clearly defined points (key project milestones) and ensuring that the project is delivered on time, within budget, and that it met or exceeded stakeholder expectations \nManaging stakeholder relationships and representing the project team at stakeholder meetings and working as a primary interface between the team and the customers on all project related matters \nDefining roles and expectations of each of the team members and establishing processes for a timely feedback and conducting performance reviews Asst. Project Mangager Standard Chartered Bank November 2010  – Present (4 years 10 months) Project Management Skills \n-Requirement analysis \n-Project scheduling and analysis \n-Effort Estimation \n-Technology selection \n-Resource administration \n-Risk and Issue Management \n-Project Execution \n-Team Management \n-Project Co-ordination and Status Tracking \n-Delivery /Technical support \n \nSDLC Planning and Co-ordination \n \n-Gap Analysis \n-Process Management \n-Software Design & Development \n-Software Testing & Validation \n-Change Management Initiation \n-Quality Assurance & Compliance \n \nAs a Project Delivery Line Manager my role is to manage in-line Project Managers delivering IT Infrastructure projects across various portfolios . \nManaging diverse teams supporting multiple applications across several business units and directing each of these complex multi-site projects from inception to production implementation \nAcquire budget approval for the project cost \nManaging all aspects of projects, including providing overall guidance and direction to the project and overseeing financial management activities \nBalancing scope, schedule, budget, quality, and risks and making adjustments as and when necessary \nMeasuring and monitoring project progress at clearly defined points (key project milestones) and ensuring that the project is delivered on time, within budget, and that it met or exceeded stakeholder expectations \nManaging stakeholder relationships and representing the project team at stakeholder meetings and working as a primary interface between the team and the customers on all project related matters \nDefining roles and expectations of each of the team members and establishing processes for a timely feedback and conducting performance reviews Senior Internal Auditor IBM India Pvt. Ltd. January 2008  –  October 2010  (2 years 10 months) Ensure early identification and escalation of risks, issues, trends to relevant stakeholders \n• Adopt an anticipatory approach to risk \n• Delivery of the agreed audit plan for the country / region as assigned \n• Understanding the key audit issues and escalating any significant audit findings that remain unresolved \n• Help to develop an annual audit plan; Ensure plan meets the Group & Audit Committee’s expectations \n• Carry out the department’s audits, to ensure departmental mandate and business goals are met and that professional standards are maintained at all times. \n• Execute audit and assurance assignments to provide independent, objective assessments \n• Build relationships with leaders across the country to understand issues and identify areas for improvement for the organisation as a whole. \n• Share best practice to improve the control environment; make recommendations to Country Head of Audit Senior Internal Auditor IBM India Pvt. Ltd. January 2008  –  October 2010  (2 years 10 months) Ensure early identification and escalation of risks, issues, trends to relevant stakeholders \n• Adopt an anticipatory approach to risk \n• Delivery of the agreed audit plan for the country / region as assigned \n• Understanding the key audit issues and escalating any significant audit findings that remain unresolved \n• Help to develop an annual audit plan; Ensure plan meets the Group & Audit Committee’s expectations \n• Carry out the department’s audits, to ensure departmental mandate and business goals are met and that professional standards are maintained at all times. \n• Execute audit and assurance assignments to provide independent, objective assessments \n• Build relationships with leaders across the country to understand issues and identify areas for improvement for the organisation as a whole. \n• Share best practice to improve the control environment; make recommendations to Country Head of Audit SAP FI Accountant Accenture October 2005  –  December 2007  (2 years 3 months) Project and Role Description  \nWith the three brands, BMW, MINI and Rolls-Royce Motor Cars, the BMW Group has its sights set firmly on the premium sector of the international automobile market. To achieve its aims, the company knows how to deploy its strengths with an efficiency that is unmatched in the automotive industry. The strategic objective is clearly defined: The BMW Group is the leading provider of premium products and premium services for individual mobility. \n \nThe BMW SAP Project is at the heart of BMW's strategic agenda. BMW has decided to consolidate its entire supplier landscape in IT operations. Besides significant cost savings, BMW expects to achieve higher quality services through reliable, industrialized operations performed by the most capable partners in the marketplace. High quality services at low cost are the basis for BMW's IT to create value for the BMW business organization and contribute to the continuing success of the BMW Group. \n \nTeam Lead - SAP (FICO), BMW SAO Project with the roles & responsibilities summarized below: \n \n- Responsible for Service Delivery of SAP-FICO applications of BMW. \n- Responsibility includes Knowledge Transfer from BMW to Offshore resources, adherence to SLAs, Handling Client escalations, Review of Solution Quality, Resource Utilization, etc. \n- Actively involved in resolution of Incident Management tickets, Problem Management Tickets and Estimations for Change Requests for SAP-FICO. \n- Preparation of Accenture AO Metrics, Resource Utilization, Vacation Plans, Performance Assessments SAP FI Accountant Accenture October 2005  –  December 2007  (2 years 3 months) Project and Role Description  \nWith the three brands, BMW, MINI and Rolls-Royce Motor Cars, the BMW Group has its sights set firmly on the premium sector of the international automobile market. To achieve its aims, the company knows how to deploy its strengths with an efficiency that is unmatched in the automotive industry. The strategic objective is clearly defined: The BMW Group is the leading provider of premium products and premium services for individual mobility. \n \nThe BMW SAP Project is at the heart of BMW's strategic agenda. BMW has decided to consolidate its entire supplier landscape in IT operations. Besides significant cost savings, BMW expects to achieve higher quality services through reliable, industrialized operations performed by the most capable partners in the marketplace. High quality services at low cost are the basis for BMW's IT to create value for the BMW business organization and contribute to the continuing success of the BMW Group. \n \nTeam Lead - SAP (FICO), BMW SAO Project with the roles & responsibilities summarized below: \n \n- Responsible for Service Delivery of SAP-FICO applications of BMW. \n- Responsibility includes Knowledge Transfer from BMW to Offshore resources, adherence to SLAs, Handling Client escalations, Review of Solution Quality, Resource Utilization, etc. \n- Actively involved in resolution of Incident Management tickets, Problem Management Tickets and Estimations for Change Requests for SAP-FICO. \n- Preparation of Accenture AO Metrics, Resource Utilization, Vacation Plans, Performance Assessments Treasury Analyst Barclays Capital July 2004  –  September 2005  (1 year 3 months) Performed analysis of all daily and non-daily financial treasury operations activities. \nParticipated in cross-functional finance projects as necessary. \nAssisted in developing and performing according to personal goals, objectives and annual account abilities. \nWorked closely with business customers to identify, prioritize and document business requirements. \nPerformed treasury operational functions such as cash management, cash forecasting, interest rate monitoring and forecasting, capital funding and financial derivative analyses. \nPrepared daily/monthly treasury journal entries and upload into SAP G/L System. Treasury Analyst Barclays Capital July 2004  –  September 2005  (1 year 3 months) Performed analysis of all daily and non-daily financial treasury operations activities. \nParticipated in cross-functional finance projects as necessary. \nAssisted in developing and performing according to personal goals, objectives and annual account abilities. \nWorked closely with business customers to identify, prioritize and document business requirements. \nPerformed treasury operational functions such as cash management, cash forecasting, interest rate monitoring and forecasting, capital funding and financial derivative analyses. \nPrepared daily/monthly treasury journal entries and upload into SAP G/L System. Education Delhi University M.Com,  (Banking & Accounting) IGNOU M.Phill (Economics) ISACA (U.S.A) CISA (Certified Information System Auditor) Indian Statistical Institute, Delhi Six Sigma Green Belt Project Management Institute (U.S.A) Project Managemant Professional Sikkim Manipal Institute of Technologies MBA Finance,  Finance ,  International Economics The Institute of Internal Auditors (IIA) U.S.A Certified Internal Auditors (CIA) Delhi University M.Com,  (Banking & Accounting) Delhi University M.Com,  (Banking & Accounting) Delhi University M.Com,  (Banking & Accounting) IGNOU M.Phill (Economics) IGNOU M.Phill (Economics) IGNOU M.Phill (Economics) ISACA (U.S.A) CISA (Certified Information System Auditor) ISACA (U.S.A) CISA (Certified Information System Auditor) ISACA (U.S.A) CISA (Certified Information System Auditor) Indian Statistical Institute, Delhi Six Sigma Green Belt Indian Statistical Institute, Delhi Six Sigma Green Belt Indian Statistical Institute, Delhi Six Sigma Green Belt Project Management Institute (U.S.A) Project Managemant Professional Project Management Institute (U.S.A) Project Managemant Professional Project Management Institute (U.S.A) Project Managemant Professional Sikkim Manipal Institute of Technologies MBA Finance,  Finance ,  International Economics Sikkim Manipal Institute of Technologies MBA Finance,  Finance ,  International Economics Sikkim Manipal Institute of Technologies MBA Finance,  Finance ,  International Economics The Institute of Internal Auditors (IIA) U.S.A Certified Internal Auditors (CIA) The Institute of Internal Auditors (IIA) U.S.A Certified Internal Auditors (CIA) The Institute of Internal Auditors (IIA) U.S.A Certified Internal Auditors (CIA) ", "Experience Project Executive IBM March 2012  – Present (3 years 6 months) Responsible for managing two outsourcing contracts for companies headquartered in Wilmington, DE and Greenville, SC. This includes maintaining in-depth knowledge of the accounts, completing project management duties, and working on new business opportunities. As well as monitoring the control environment to ensure an overall positive business controls and audit posture are maintained for the accounts. Other responsibilities include identifying improvements in controls, implementing solutions to strengthen the controls environment and improving the operating efficiency of the businesses. Senior Compliance Manager IBM June 2010  –  March 2012  (1 year 10 months) Responsible for leading a team in Johannesburg, South Africa and Nairobi, Kenya to ensure compliance to developed and maintained IBM processes and IBM/customer agreements. Test requirements were developed to track compliance of the processes. Weekly and monthly results were provided and reviewed with the executive management teams. Continued assistance was provided to the project and management teams in identifying, assessing, and addressing project risks, issues, and process challenges. An additional responsibility was the primary interface for Corporate Audits and other business controls reviews. Senior Internal Auditor IBM April 2008  –  May 2010  (2 years 2 months) Austin, Texas Responsible for developing and deploying operational and billing processes for a newly established customer in Austin, Texas. Determining areas of risks and ensuring established controls and documentation are in place to minimize exposures and compliance for Sarbanes Oxley Self-Assessments. Also, completing continued assessments of processes to provide recommendations of improvements and/or enhancements as changes occur. In addition, working with senior executive team to highlight emerging risks and provide recommendations to eliminate risks for identified concerns.  Project Executive IBM March 2012  – Present (3 years 6 months) Responsible for managing two outsourcing contracts for companies headquartered in Wilmington, DE and Greenville, SC. This includes maintaining in-depth knowledge of the accounts, completing project management duties, and working on new business opportunities. As well as monitoring the control environment to ensure an overall positive business controls and audit posture are maintained for the accounts. Other responsibilities include identifying improvements in controls, implementing solutions to strengthen the controls environment and improving the operating efficiency of the businesses. Project Executive IBM March 2012  – Present (3 years 6 months) Responsible for managing two outsourcing contracts for companies headquartered in Wilmington, DE and Greenville, SC. This includes maintaining in-depth knowledge of the accounts, completing project management duties, and working on new business opportunities. As well as monitoring the control environment to ensure an overall positive business controls and audit posture are maintained for the accounts. Other responsibilities include identifying improvements in controls, implementing solutions to strengthen the controls environment and improving the operating efficiency of the businesses. Senior Compliance Manager IBM June 2010  –  March 2012  (1 year 10 months) Responsible for leading a team in Johannesburg, South Africa and Nairobi, Kenya to ensure compliance to developed and maintained IBM processes and IBM/customer agreements. Test requirements were developed to track compliance of the processes. Weekly and monthly results were provided and reviewed with the executive management teams. Continued assistance was provided to the project and management teams in identifying, assessing, and addressing project risks, issues, and process challenges. An additional responsibility was the primary interface for Corporate Audits and other business controls reviews. Senior Compliance Manager IBM June 2010  –  March 2012  (1 year 10 months) Responsible for leading a team in Johannesburg, South Africa and Nairobi, Kenya to ensure compliance to developed and maintained IBM processes and IBM/customer agreements. Test requirements were developed to track compliance of the processes. Weekly and monthly results were provided and reviewed with the executive management teams. Continued assistance was provided to the project and management teams in identifying, assessing, and addressing project risks, issues, and process challenges. An additional responsibility was the primary interface for Corporate Audits and other business controls reviews. Senior Internal Auditor IBM April 2008  –  May 2010  (2 years 2 months) Austin, Texas Responsible for developing and deploying operational and billing processes for a newly established customer in Austin, Texas. Determining areas of risks and ensuring established controls and documentation are in place to minimize exposures and compliance for Sarbanes Oxley Self-Assessments. Also, completing continued assessments of processes to provide recommendations of improvements and/or enhancements as changes occur. In addition, working with senior executive team to highlight emerging risks and provide recommendations to eliminate risks for identified concerns.  Senior Internal Auditor IBM April 2008  –  May 2010  (2 years 2 months) Austin, Texas Responsible for developing and deploying operational and billing processes for a newly established customer in Austin, Texas. Determining areas of risks and ensuring established controls and documentation are in place to minimize exposures and compliance for Sarbanes Oxley Self-Assessments. Also, completing continued assessments of processes to provide recommendations of improvements and/or enhancements as changes occur. In addition, working with senior executive team to highlight emerging risks and provide recommendations to eliminate risks for identified concerns.  Languages   Skills Internal Audit Internal Controls Risk Management Auditing Business Process... IT Audit Accounting Enterprise Risk... Process Improvement Financial Analysis Hyperion Enterprise Financial Reporting Governance CISA Sarbanes-Oxley Act Teamwork See 1+     See less Skills  Internal Audit Internal Controls Risk Management Auditing Business Process... IT Audit Accounting Enterprise Risk... Process Improvement Financial Analysis Hyperion Enterprise Financial Reporting Governance CISA Sarbanes-Oxley Act Teamwork See 1+     See less Internal Audit Internal Controls Risk Management Auditing Business Process... IT Audit Accounting Enterprise Risk... Process Improvement Financial Analysis Hyperion Enterprise Financial Reporting Governance CISA Sarbanes-Oxley Act Teamwork See 1+     See less Internal Audit Internal Controls Risk Management Auditing Business Process... IT Audit Accounting Enterprise Risk... Process Improvement Financial Analysis Hyperion Enterprise Financial Reporting Governance CISA Sarbanes-Oxley Act Teamwork See 1+     See less Education Utica College Master of Business Administration (M.B.A.),  Fraud Management 2004  – 2006 University of Delaware Accounting 1997  – 1999 Utica College Master of Business Administration (M.B.A.),  Fraud Management 2004  – 2006 Utica College Master of Business Administration (M.B.A.),  Fraud Management 2004  – 2006 Utica College Master of Business Administration (M.B.A.),  Fraud Management 2004  – 2006 University of Delaware Accounting 1997  – 1999 University of Delaware Accounting 1997  – 1999 University of Delaware Accounting 1997  – 1999 Honors & Awards ", "Experience Global Security, Compliance and Risk Management DPE IBM France June 2014  – Present (1 year 3 months) Italy, France, US, India and Latin America Senior Internal Auditor IBM France November 2001  –  June 2014  (12 years 8 months) To lead and perform pre audit reviews of the I/S disciplines of Information Technology Services, Disaster Recovery and System Management disciplines across North East and South West Europe including Middle East and Africa on behalf of IBM Senior Management for both Internal and External IBM Services covering Strategic Outsourcing accounts as well as Internal Global Accounts. \nProvide Business Controls IT Risk Management consultancy services to the various External and Internal Service Delivery units of IBM as and when required. \nTake part in the development of IBM’s internal security standards, processes and procedures as and when required. \nInterface with Senior Management at director level or higher, with regards to the results of the IT Risk Management reviews across NE&SW Europe. Information Security Consultant Nortel Networks (UK) November 2000  –  November 2001  (1 year 1 month) Maidenhead To act as Information Security (IS) Consultant on internal and external projects ranging from Enterprise to Carrier based customers in the EMEA region. \nTo act as lead / prime on given projects \nTo produce Work Packages/s for prospective clients \nTo carry out Logical, Procedural, Physical and Personnel Security audits based on BS7799 / ISO 17799 on behalf of Nortel customers in the EMEA region. \nTo implement Information Security Management based systems on behalf on Nortel clients in the EMEA region. \nTo take an active part in new initiatives concerning Information Security in the EMEA region \nTo assist in Penetration testing with other security team colleagues \nTo up sell Security Services to Nortel clients in the EMEA region Senior Information Security Engineer Vodafone May 1999  –  November 2000  (1 year 7 months) Newbury, Berkshire UK To carry out Logical, Procedural, Physical and Personnel Security audits based on BS7799 internally and externally. \nTo act as Information Security (IS) Consultant on internal and external projects e.g. WAP, GPRS, PAYT \nTo take an active part in new initiatives concerning Information Security \nTo take an active part in Vodafone’s PKI initiative \nTo attend various conferences and workshops as when required \nTo review Information Security Standards, Policies and Procedures in Vodafone Limited \nTo liaise with other departments in Vodafone regarding Information Security and Fraud issues \nTo represent Vodafone Ltd at the Information Security Forum Higher Executive Officer HM Customs & Excise February 1994  –  March 1999  (5 years 2 months) Various Various roles related to Audit and Investigation Lecturer Information Technology Oxford College of Further Education September 1988  –  February 1994  (5 years 6 months) Oxford, United Kingdom To act as Course Tutor as and when required \nTo lecture on Information Technology (IT) on various vocational courses \nTo teach programming on various vocational courses \nTo develop various IT curriculum's for the college applicable to courses such as Travel & Tourism, Business Studies et al \nTo take part in various educational projects as and when required \nAct as mentor / adviser to students on various courses Global Security, Compliance and Risk Management DPE IBM France June 2014  – Present (1 year 3 months) Italy, France, US, India and Latin America Global Security, Compliance and Risk Management DPE IBM France June 2014  – Present (1 year 3 months) Italy, France, US, India and Latin America Senior Internal Auditor IBM France November 2001  –  June 2014  (12 years 8 months) To lead and perform pre audit reviews of the I/S disciplines of Information Technology Services, Disaster Recovery and System Management disciplines across North East and South West Europe including Middle East and Africa on behalf of IBM Senior Management for both Internal and External IBM Services covering Strategic Outsourcing accounts as well as Internal Global Accounts. \nProvide Business Controls IT Risk Management consultancy services to the various External and Internal Service Delivery units of IBM as and when required. \nTake part in the development of IBM’s internal security standards, processes and procedures as and when required. \nInterface with Senior Management at director level or higher, with regards to the results of the IT Risk Management reviews across NE&SW Europe. Senior Internal Auditor IBM France November 2001  –  June 2014  (12 years 8 months) To lead and perform pre audit reviews of the I/S disciplines of Information Technology Services, Disaster Recovery and System Management disciplines across North East and South West Europe including Middle East and Africa on behalf of IBM Senior Management for both Internal and External IBM Services covering Strategic Outsourcing accounts as well as Internal Global Accounts. \nProvide Business Controls IT Risk Management consultancy services to the various External and Internal Service Delivery units of IBM as and when required. \nTake part in the development of IBM’s internal security standards, processes and procedures as and when required. \nInterface with Senior Management at director level or higher, with regards to the results of the IT Risk Management reviews across NE&SW Europe. Information Security Consultant Nortel Networks (UK) November 2000  –  November 2001  (1 year 1 month) Maidenhead To act as Information Security (IS) Consultant on internal and external projects ranging from Enterprise to Carrier based customers in the EMEA region. \nTo act as lead / prime on given projects \nTo produce Work Packages/s for prospective clients \nTo carry out Logical, Procedural, Physical and Personnel Security audits based on BS7799 / ISO 17799 on behalf of Nortel customers in the EMEA region. \nTo implement Information Security Management based systems on behalf on Nortel clients in the EMEA region. \nTo take an active part in new initiatives concerning Information Security in the EMEA region \nTo assist in Penetration testing with other security team colleagues \nTo up sell Security Services to Nortel clients in the EMEA region Information Security Consultant Nortel Networks (UK) November 2000  –  November 2001  (1 year 1 month) Maidenhead To act as Information Security (IS) Consultant on internal and external projects ranging from Enterprise to Carrier based customers in the EMEA region. \nTo act as lead / prime on given projects \nTo produce Work Packages/s for prospective clients \nTo carry out Logical, Procedural, Physical and Personnel Security audits based on BS7799 / ISO 17799 on behalf of Nortel customers in the EMEA region. \nTo implement Information Security Management based systems on behalf on Nortel clients in the EMEA region. \nTo take an active part in new initiatives concerning Information Security in the EMEA region \nTo assist in Penetration testing with other security team colleagues \nTo up sell Security Services to Nortel clients in the EMEA region Senior Information Security Engineer Vodafone May 1999  –  November 2000  (1 year 7 months) Newbury, Berkshire UK To carry out Logical, Procedural, Physical and Personnel Security audits based on BS7799 internally and externally. \nTo act as Information Security (IS) Consultant on internal and external projects e.g. WAP, GPRS, PAYT \nTo take an active part in new initiatives concerning Information Security \nTo take an active part in Vodafone’s PKI initiative \nTo attend various conferences and workshops as when required \nTo review Information Security Standards, Policies and Procedures in Vodafone Limited \nTo liaise with other departments in Vodafone regarding Information Security and Fraud issues \nTo represent Vodafone Ltd at the Information Security Forum Senior Information Security Engineer Vodafone May 1999  –  November 2000  (1 year 7 months) Newbury, Berkshire UK To carry out Logical, Procedural, Physical and Personnel Security audits based on BS7799 internally and externally. \nTo act as Information Security (IS) Consultant on internal and external projects e.g. WAP, GPRS, PAYT \nTo take an active part in new initiatives concerning Information Security \nTo take an active part in Vodafone’s PKI initiative \nTo attend various conferences and workshops as when required \nTo review Information Security Standards, Policies and Procedures in Vodafone Limited \nTo liaise with other departments in Vodafone regarding Information Security and Fraud issues \nTo represent Vodafone Ltd at the Information Security Forum Higher Executive Officer HM Customs & Excise February 1994  –  March 1999  (5 years 2 months) Various Various roles related to Audit and Investigation Higher Executive Officer HM Customs & Excise February 1994  –  March 1999  (5 years 2 months) Various Various roles related to Audit and Investigation Lecturer Information Technology Oxford College of Further Education September 1988  –  February 1994  (5 years 6 months) Oxford, United Kingdom To act as Course Tutor as and when required \nTo lecture on Information Technology (IT) on various vocational courses \nTo teach programming on various vocational courses \nTo develop various IT curriculum's for the college applicable to courses such as Travel & Tourism, Business Studies et al \nTo take part in various educational projects as and when required \nAct as mentor / adviser to students on various courses Lecturer Information Technology Oxford College of Further Education September 1988  –  February 1994  (5 years 6 months) Oxford, United Kingdom To act as Course Tutor as and when required \nTo lecture on Information Technology (IT) on various vocational courses \nTo teach programming on various vocational courses \nTo develop various IT curriculum's for the college applicable to courses such as Travel & Tourism, Business Studies et al \nTo take part in various educational projects as and when required \nAct as mentor / adviser to students on various courses Languages French French French Skills Internal Controls Auditing Information Security Internal Audit Security Audits Risk Management Network Security Business Process Governance Business Process... Security Information Security... Information Technology Disaster Recovery Outsourcing IT Service Management ITIL IT Strategy See 3+     See less Skills  Internal Controls Auditing Information Security Internal Audit Security Audits Risk Management Network Security Business Process Governance Business Process... Security Information Security... Information Technology Disaster Recovery Outsourcing IT Service Management ITIL IT Strategy See 3+     See less Internal Controls Auditing Information Security Internal Audit Security Audits Risk Management Network Security Business Process Governance Business Process... Security Information Security... Information Technology Disaster Recovery Outsourcing IT Service Management ITIL IT Strategy See 3+     See less Internal Controls Auditing Information Security Internal Audit Security Audits Risk Management Network Security Business Process Governance Business Process... Security Information Security... Information Technology Disaster Recovery Outsourcing IT Service Management ITIL IT Strategy See 3+     See less Education University of Liverpool Postgraduate Diploma Information Technology,  Computer and Information Systems Security/Information Assurance , Pass 2006  – 2009 Oxford Polytechnic (Oxford Brookes University) Postgraduate Certification in Education (FE),  Lecturing in Further Education , Pass 1991  – 1992 Corona Academy Corona Academy University of Liverpool Postgraduate Diploma Information Technology,  Computer and Information Systems Security/Information Assurance , Pass 2006  – 2009 University of Liverpool Postgraduate Diploma Information Technology,  Computer and Information Systems Security/Information Assurance , Pass 2006  – 2009 University of Liverpool Postgraduate Diploma Information Technology,  Computer and Information Systems Security/Information Assurance , Pass 2006  – 2009 Oxford Polytechnic (Oxford Brookes University) Postgraduate Certification in Education (FE),  Lecturing in Further Education , Pass 1991  – 1992 Oxford Polytechnic (Oxford Brookes University) Postgraduate Certification in Education (FE),  Lecturing in Further Education , Pass 1991  – 1992 Oxford Polytechnic (Oxford Brookes University) Postgraduate Certification in Education (FE),  Lecturing in Further Education , Pass 1991  – 1992 Corona Academy Corona Academy Corona Academy Corona Academy Corona Academy Corona Academy ", "Summary Strong analytical skills with the ability to find the underlying story – developed and authored over 40 industry strategic papers and articles. \nWide experience in presenting conclusions – presented at over 70 conferences around the globe, speaking to hundreds of potential clients and industry analysts about impacts for their businesses or industries. \nGood listener with considerable experience in strategic discussions with C-suite executives – advised many leading banks around the globe on strategic initiatives and required action. \nProven record in opening doors and changing the conversation from sales push to business pull – developed and drove use of highly innovative marketing presentations and tools worldwide successfully engaging new clients and expanding the scope of deals. \nFocus on sustainability and business' value-add to society. Summary Strong analytical skills with the ability to find the underlying story – developed and authored over 40 industry strategic papers and articles. \nWide experience in presenting conclusions – presented at over 70 conferences around the globe, speaking to hundreds of potential clients and industry analysts about impacts for their businesses or industries. \nGood listener with considerable experience in strategic discussions with C-suite executives – advised many leading banks around the globe on strategic initiatives and required action. \nProven record in opening doors and changing the conversation from sales push to business pull – developed and drove use of highly innovative marketing presentations and tools worldwide successfully engaging new clients and expanding the scope of deals. \nFocus on sustainability and business' value-add to society. Strong analytical skills with the ability to find the underlying story – developed and authored over 40 industry strategic papers and articles. \nWide experience in presenting conclusions – presented at over 70 conferences around the globe, speaking to hundreds of potential clients and industry analysts about impacts for their businesses or industries. \nGood listener with considerable experience in strategic discussions with C-suite executives – advised many leading banks around the globe on strategic initiatives and required action. \nProven record in opening doors and changing the conversation from sales push to business pull – developed and drove use of highly innovative marketing presentations and tools worldwide successfully engaging new clients and expanding the scope of deals. \nFocus on sustainability and business' value-add to society. Strong analytical skills with the ability to find the underlying story – developed and authored over 40 industry strategic papers and articles. \nWide experience in presenting conclusions – presented at over 70 conferences around the globe, speaking to hundreds of potential clients and industry analysts about impacts for their businesses or industries. \nGood listener with considerable experience in strategic discussions with C-suite executives – advised many leading banks around the globe on strategic initiatives and required action. \nProven record in opening doors and changing the conversation from sales push to business pull – developed and drove use of highly innovative marketing presentations and tools worldwide successfully engaging new clients and expanding the scope of deals. \nFocus on sustainability and business' value-add to society. Experience Senior Consultant Aidenvironment April 2015  – Present (5 months) Amsterdam Aidenvironment is a value-driven, independent, not-for-profit consultancy addressing sustainability issues. Program Manager, Supply Chain Finance - International Sustainable Development Windesheim University of Applied Sciences 2014  – Present (1 year) Fostering adoption of Supply Chain Finance to strengthen links between developing countries with international markets: identifying relevant characteristics, measuring financial needs and performance and identifying scalable models. Consultant Sustainable Banking Strategy & Industry Research Independent 2013  – Present (2 years) Committed to making financial services more socially relevant. Providing management advice and facilitated thinking on the basis of worldwide industry experience. Research into Sustainable Banking - increasing the value add to society of financial services.  \nEngagements include: proposal for a new institute for applied technology (research into high transparency banking, an incubator for financial services start-ups and an executive education program); strategic advice for a start-up retail cooperative bank; strategic advice for a start-up corporate bank. Global Leader Banking IBM Center for Applied Insights 2010  –  2014  (4 years) Global Principal responsible for the Banking industry. Through the integration of deep industry and analytical expertise, the CAI charts the course to new value for clients developing targeted intellectual property with tangible outcomes. Global Leader Banking IBM Institute for Business Value 2005  –  2010  (5 years) Global Principal responsible for the Banking Industry. Through fact-based research, the IBV provides leading edge thought leadership and practical insights for business executives. Senior Strategy Consultant IBM 1994  –  2004  (10 years) Netherlands/Global Business Strategy and IT Strategy Consulting in the Financial Services industries. Also responsible for Global Business Strategy and IT Strategy Education. Business Developer IBM 1987  –  1993  (6 years) Netherlands Business Development for new products and services in the Financial Services industries - in particular Banking Information Framework (Enterprise Data and Process Models) and Dealing Room Platforms. Senior Internal Auditor IBM 1985  –  1986  (1 year) Netherlands Responsible for internal audit and setting up the EDP Audit function. Manager EDP Audit Ernst & Young 1983  –  1985  (2 years) Netherlands/Europe Manager EDP Audit. Also resonsible for EDP Audit Education across Europe. Manager EDP Audit Ernst & Young 1977  –  1983  (6 years) South Africa Initially Auditor. Later Manager EDP Audit and responsible for EDP Audit Education across Southern Africa. Senior Consultant Aidenvironment April 2015  – Present (5 months) Amsterdam Aidenvironment is a value-driven, independent, not-for-profit consultancy addressing sustainability issues. Senior Consultant Aidenvironment April 2015  – Present (5 months) Amsterdam Aidenvironment is a value-driven, independent, not-for-profit consultancy addressing sustainability issues. Program Manager, Supply Chain Finance - International Sustainable Development Windesheim University of Applied Sciences 2014  – Present (1 year) Fostering adoption of Supply Chain Finance to strengthen links between developing countries with international markets: identifying relevant characteristics, measuring financial needs and performance and identifying scalable models. Program Manager, Supply Chain Finance - International Sustainable Development Windesheim University of Applied Sciences 2014  – Present (1 year) Fostering adoption of Supply Chain Finance to strengthen links between developing countries with international markets: identifying relevant characteristics, measuring financial needs and performance and identifying scalable models. Consultant Sustainable Banking Strategy & Industry Research Independent 2013  – Present (2 years) Committed to making financial services more socially relevant. Providing management advice and facilitated thinking on the basis of worldwide industry experience. Research into Sustainable Banking - increasing the value add to society of financial services.  \nEngagements include: proposal for a new institute for applied technology (research into high transparency banking, an incubator for financial services start-ups and an executive education program); strategic advice for a start-up retail cooperative bank; strategic advice for a start-up corporate bank. Consultant Sustainable Banking Strategy & Industry Research Independent 2013  – Present (2 years) Committed to making financial services more socially relevant. Providing management advice and facilitated thinking on the basis of worldwide industry experience. Research into Sustainable Banking - increasing the value add to society of financial services.  \nEngagements include: proposal for a new institute for applied technology (research into high transparency banking, an incubator for financial services start-ups and an executive education program); strategic advice for a start-up retail cooperative bank; strategic advice for a start-up corporate bank. Global Leader Banking IBM Center for Applied Insights 2010  –  2014  (4 years) Global Principal responsible for the Banking industry. Through the integration of deep industry and analytical expertise, the CAI charts the course to new value for clients developing targeted intellectual property with tangible outcomes. Global Leader Banking IBM Center for Applied Insights 2010  –  2014  (4 years) Global Principal responsible for the Banking industry. Through the integration of deep industry and analytical expertise, the CAI charts the course to new value for clients developing targeted intellectual property with tangible outcomes. Global Leader Banking IBM Institute for Business Value 2005  –  2010  (5 years) Global Principal responsible for the Banking Industry. Through fact-based research, the IBV provides leading edge thought leadership and practical insights for business executives. Global Leader Banking IBM Institute for Business Value 2005  –  2010  (5 years) Global Principal responsible for the Banking Industry. Through fact-based research, the IBV provides leading edge thought leadership and practical insights for business executives. Senior Strategy Consultant IBM 1994  –  2004  (10 years) Netherlands/Global Business Strategy and IT Strategy Consulting in the Financial Services industries. Also responsible for Global Business Strategy and IT Strategy Education. Senior Strategy Consultant IBM 1994  –  2004  (10 years) Netherlands/Global Business Strategy and IT Strategy Consulting in the Financial Services industries. Also responsible for Global Business Strategy and IT Strategy Education. Business Developer IBM 1987  –  1993  (6 years) Netherlands Business Development for new products and services in the Financial Services industries - in particular Banking Information Framework (Enterprise Data and Process Models) and Dealing Room Platforms. Business Developer IBM 1987  –  1993  (6 years) Netherlands Business Development for new products and services in the Financial Services industries - in particular Banking Information Framework (Enterprise Data and Process Models) and Dealing Room Platforms. Senior Internal Auditor IBM 1985  –  1986  (1 year) Netherlands Responsible for internal audit and setting up the EDP Audit function. Senior Internal Auditor IBM 1985  –  1986  (1 year) Netherlands Responsible for internal audit and setting up the EDP Audit function. Manager EDP Audit Ernst & Young 1983  –  1985  (2 years) Netherlands/Europe Manager EDP Audit. Also resonsible for EDP Audit Education across Europe. Manager EDP Audit Ernst & Young 1983  –  1985  (2 years) Netherlands/Europe Manager EDP Audit. Also resonsible for EDP Audit Education across Europe. Manager EDP Audit Ernst & Young 1977  –  1983  (6 years) South Africa Initially Auditor. Later Manager EDP Audit and responsible for EDP Audit Education across Southern Africa. Manager EDP Audit Ernst & Young 1977  –  1983  (6 years) South Africa Initially Auditor. Later Manager EDP Audit and responsible for EDP Audit Education across Southern Africa. Languages   Skills Management Consulting IT Strategy Business Transformation Change Management Outsourcing Business Analysis Business Process... Business Strategy Program Management IT Service Management Business Intelligence Strategy Business Process Business Development Leadership Process Improvement Management Business Process Design Team Leadership Business Case Analytics Financial Services Cross-functional Team... Thought Leadership Enterprise Software Analysis Organizational Design Banking Consulting Governance Requirements Analysis Risk Management Process Engineering Business Process... Project Portfolio... PMO Executive Management CRM Integration IT Management Vendor Management See 26+     See less Skills  Management Consulting IT Strategy Business Transformation Change Management Outsourcing Business Analysis Business Process... Business Strategy Program Management IT Service Management Business Intelligence Strategy Business Process Business Development Leadership Process Improvement Management Business Process Design Team Leadership Business Case Analytics Financial Services Cross-functional Team... Thought Leadership Enterprise Software Analysis Organizational Design Banking Consulting Governance Requirements Analysis Risk Management Process Engineering Business Process... Project Portfolio... PMO Executive Management CRM Integration IT Management Vendor Management See 26+     See less Management Consulting IT Strategy Business Transformation Change Management Outsourcing Business Analysis Business Process... Business Strategy Program Management IT Service Management Business Intelligence Strategy Business Process Business Development Leadership Process Improvement Management Business Process Design Team Leadership Business Case Analytics Financial Services Cross-functional Team... Thought Leadership Enterprise Software Analysis Organizational Design Banking Consulting Governance Requirements Analysis Risk Management Process Engineering Business Process... Project Portfolio... PMO Executive Management CRM Integration IT Management Vendor Management See 26+     See less Management Consulting IT Strategy Business Transformation Change Management Outsourcing Business Analysis Business Process... Business Strategy Program Management IT Service Management Business Intelligence Strategy Business Process Business Development Leadership Process Improvement Management Business Process Design Team Leadership Business Case Analytics Financial Services Cross-functional Team... Thought Leadership Enterprise Software Analysis Organizational Design Banking Consulting Governance Requirements Analysis Risk Management Process Engineering Business Process... Project Portfolio... PMO Executive Management CRM Integration IT Management Vendor Management See 26+     See less Education University of Michigan (Ann Arbor, USA) & Erasmus University (Rotterdam, Netherlands)' Master of Business Administration / Master of Business Informatics 1992  – 1993 Prize for best student and for \"outstanding dedication, leadership and performance during the Executive MBA/MBI programme\". University of Cape Town Bachelor of Commerce (Honours),  Business Data Processing 1984  – 1985 Public Accountants and Auditors Board Final Qualifying Examination for Chartered Accountant (South Africa) 1978  – 1978 University of Cape Town Certificate in the Theory of Accounting 1977  – 1977 University of Cape Town Bachelor of Commerce (B.Comm.) 1974  – 1976 Diocesan College (Cape Town) Secondary School , First Class Pass - distinction in Mathematics 1970  – 1973 Activities and Societies:  House Prefect University of Michigan (Ann Arbor, USA) & Erasmus University (Rotterdam, Netherlands)' Master of Business Administration / Master of Business Informatics 1992  – 1993 Prize for best student and for \"outstanding dedication, leadership and performance during the Executive MBA/MBI programme\". University of Michigan (Ann Arbor, USA) & Erasmus University (Rotterdam, Netherlands)' Master of Business Administration / Master of Business Informatics 1992  – 1993 Prize for best student and for \"outstanding dedication, leadership and performance during the Executive MBA/MBI programme\". University of Michigan (Ann Arbor, USA) & Erasmus University (Rotterdam, Netherlands)' Master of Business Administration / Master of Business Informatics 1992  – 1993 Prize for best student and for \"outstanding dedication, leadership and performance during the Executive MBA/MBI programme\". University of Cape Town Bachelor of Commerce (Honours),  Business Data Processing 1984  – 1985 University of Cape Town Bachelor of Commerce (Honours),  Business Data Processing 1984  – 1985 University of Cape Town Bachelor of Commerce (Honours),  Business Data Processing 1984  – 1985 Public Accountants and Auditors Board Final Qualifying Examination for Chartered Accountant (South Africa) 1978  – 1978 Public Accountants and Auditors Board Final Qualifying Examination for Chartered Accountant (South Africa) 1978  – 1978 Public Accountants and Auditors Board Final Qualifying Examination for Chartered Accountant (South Africa) 1978  – 1978 University of Cape Town Certificate in the Theory of Accounting 1977  – 1977 University of Cape Town Certificate in the Theory of Accounting 1977  – 1977 University of Cape Town Certificate in the Theory of Accounting 1977  – 1977 University of Cape Town Bachelor of Commerce (B.Comm.) 1974  – 1976 University of Cape Town Bachelor of Commerce (B.Comm.) 1974  – 1976 University of Cape Town Bachelor of Commerce (B.Comm.) 1974  – 1976 Diocesan College (Cape Town) Secondary School , First Class Pass - distinction in Mathematics 1970  – 1973 Activities and Societies:  House Prefect Diocesan College (Cape Town) Secondary School , First Class Pass - distinction in Mathematics 1970  – 1973 Activities and Societies:  House Prefect Diocesan College (Cape Town) Secondary School , First Class Pass - distinction in Mathematics 1970  – 1973 Activities and Societies:  House Prefect ", "Summary During six years time with IBM Cheryl has held various audit and accounting positions across IBM brands. She led multiple challenging audits that identified control deficiencies and improved the effectiveness of risk management in IBM worldwide tax, pension, and accounting operations including IBM Global Finance, Brazil Indirect Tax, South Korea Income Tax, and Japan Pension Asset. Cheryl also led accounting transitions and consolidation projects.Cheryl is CPA certified. Cheryl graduated from Indiana University with a master degree in Accounting while she worked full time as an internal auditor for Indianapolis Retirement Fund. She also had interned in two of the big four public accounting firms while she was in collage. Summary During six years time with IBM Cheryl has held various audit and accounting positions across IBM brands. She led multiple challenging audits that identified control deficiencies and improved the effectiveness of risk management in IBM worldwide tax, pension, and accounting operations including IBM Global Finance, Brazil Indirect Tax, South Korea Income Tax, and Japan Pension Asset. Cheryl also led accounting transitions and consolidation projects.Cheryl is CPA certified. Cheryl graduated from Indiana University with a master degree in Accounting while she worked full time as an internal auditor for Indianapolis Retirement Fund. She also had interned in two of the big four public accounting firms while she was in collage. During six years time with IBM Cheryl has held various audit and accounting positions across IBM brands. She led multiple challenging audits that identified control deficiencies and improved the effectiveness of risk management in IBM worldwide tax, pension, and accounting operations including IBM Global Finance, Brazil Indirect Tax, South Korea Income Tax, and Japan Pension Asset. Cheryl also led accounting transitions and consolidation projects.Cheryl is CPA certified. Cheryl graduated from Indiana University with a master degree in Accounting while she worked full time as an internal auditor for Indianapolis Retirement Fund. She also had interned in two of the big four public accounting firms while she was in collage. During six years time with IBM Cheryl has held various audit and accounting positions across IBM brands. She led multiple challenging audits that identified control deficiencies and improved the effectiveness of risk management in IBM worldwide tax, pension, and accounting operations including IBM Global Finance, Brazil Indirect Tax, South Korea Income Tax, and Japan Pension Asset. Cheryl also led accounting transitions and consolidation projects.Cheryl is CPA certified. Cheryl graduated from Indiana University with a master degree in Accounting while she worked full time as an internal auditor for Indianapolis Retirement Fund. She also had interned in two of the big four public accounting firms while she was in collage. Experience Internal Auditor Goldman Sachs June 2015  – Present (3 months) Greater New York City Area Assistant Vice President, Internal Audit GE Capital March 2015  – Present (6 months) Greater New York City Area Senior Internal Auditor IBM July 2012  – Present (3 years 2 months) International travelling •\tLeads and performs engagements in international audits on tax, pension and finance accounting processes while coordinating with local management to ensure the success and thorough completion of risk assurance projects. \n•\tPerforms analysis of business objectives and processes in order to determine areas of potential operational and financial risk and recommends remediation procedures for identified risks. \n•\tProvides independent and objective consulting activities to add value and improve an organization’s operations. \n•\tImproves and executes test strategies to assess the effectiveness of internal controls and measurements. \n•\tPresents executive summaries of audit findings to corporate senior management. \n•\tCollaborates with Internal Audit Intelligence Technology Team to implement data analytics and improves audit efficiencies. Cost Accountant IBM July 2011  –  June 2012  (1 year) RTP Performs monthly cost variance analysis of IBM’s global manufacturing sites to minimize cost of goods sold and are responsible for maintaining current pricing of hundreds of IBM products Balance Sheet/Income Expense Accountant- HR, Marketing and CIO IBM May 2010  –  July 2011  (1 year 3 months) RTP World-wide contact for the Globally Integrated Support Function divisions of HR, Marketing and the CIO Office \nHead focal point for the creation of IBM's CIO office expense tower Balance Sheet/Income Expense Accountant-Microelectronics IBM September 2009  –  April 2010  (8 months) RTP Applied Generally Accepted Accounting Principles with a focus on accounts payables , accounts receivables, bonus/compensation accruals, amortization, deferred income, and income recognition \nPrepared monthly balance sheet reconciliations to explain operational balances using ledger backups Internal Auditor Indianapolis Public Employee Retirement Fund June 2008  –  February 2009  (9 months) Indianapolis, Indiana Area Analyzed member accounts to ensure they receive proper fund distribution and ensuring that they match plan provisions and participant elections External Auditor Deloitte January 2006  –  May 2006  (5 months) Assisted 5 teams with audit of major accounts, including Wal-Mart, UPS, John Deere, Murata Electronics Company \nPrepared accounts payable, accounts receivable, bank reconciliations, expenses and voucher testing  \nPerformed analytical review of audit documents and reviewed client accounting, operating procedures and systems of internal control Internal Auditor Goldman Sachs June 2015  – Present (3 months) Greater New York City Area Internal Auditor Goldman Sachs June 2015  – Present (3 months) Greater New York City Area Assistant Vice President, Internal Audit GE Capital March 2015  – Present (6 months) Greater New York City Area Assistant Vice President, Internal Audit GE Capital March 2015  – Present (6 months) Greater New York City Area Senior Internal Auditor IBM July 2012  – Present (3 years 2 months) International travelling •\tLeads and performs engagements in international audits on tax, pension and finance accounting processes while coordinating with local management to ensure the success and thorough completion of risk assurance projects. \n•\tPerforms analysis of business objectives and processes in order to determine areas of potential operational and financial risk and recommends remediation procedures for identified risks. \n•\tProvides independent and objective consulting activities to add value and improve an organization’s operations. \n•\tImproves and executes test strategies to assess the effectiveness of internal controls and measurements. \n•\tPresents executive summaries of audit findings to corporate senior management. \n•\tCollaborates with Internal Audit Intelligence Technology Team to implement data analytics and improves audit efficiencies. Senior Internal Auditor IBM July 2012  – Present (3 years 2 months) International travelling •\tLeads and performs engagements in international audits on tax, pension and finance accounting processes while coordinating with local management to ensure the success and thorough completion of risk assurance projects. \n•\tPerforms analysis of business objectives and processes in order to determine areas of potential operational and financial risk and recommends remediation procedures for identified risks. \n•\tProvides independent and objective consulting activities to add value and improve an organization’s operations. \n•\tImproves and executes test strategies to assess the effectiveness of internal controls and measurements. \n•\tPresents executive summaries of audit findings to corporate senior management. \n•\tCollaborates with Internal Audit Intelligence Technology Team to implement data analytics and improves audit efficiencies. Cost Accountant IBM July 2011  –  June 2012  (1 year) RTP Performs monthly cost variance analysis of IBM’s global manufacturing sites to minimize cost of goods sold and are responsible for maintaining current pricing of hundreds of IBM products Cost Accountant IBM July 2011  –  June 2012  (1 year) RTP Performs monthly cost variance analysis of IBM’s global manufacturing sites to minimize cost of goods sold and are responsible for maintaining current pricing of hundreds of IBM products Balance Sheet/Income Expense Accountant- HR, Marketing and CIO IBM May 2010  –  July 2011  (1 year 3 months) RTP World-wide contact for the Globally Integrated Support Function divisions of HR, Marketing and the CIO Office \nHead focal point for the creation of IBM's CIO office expense tower Balance Sheet/Income Expense Accountant- HR, Marketing and CIO IBM May 2010  –  July 2011  (1 year 3 months) RTP World-wide contact for the Globally Integrated Support Function divisions of HR, Marketing and the CIO Office \nHead focal point for the creation of IBM's CIO office expense tower Balance Sheet/Income Expense Accountant-Microelectronics IBM September 2009  –  April 2010  (8 months) RTP Applied Generally Accepted Accounting Principles with a focus on accounts payables , accounts receivables, bonus/compensation accruals, amortization, deferred income, and income recognition \nPrepared monthly balance sheet reconciliations to explain operational balances using ledger backups Balance Sheet/Income Expense Accountant-Microelectronics IBM September 2009  –  April 2010  (8 months) RTP Applied Generally Accepted Accounting Principles with a focus on accounts payables , accounts receivables, bonus/compensation accruals, amortization, deferred income, and income recognition \nPrepared monthly balance sheet reconciliations to explain operational balances using ledger backups Internal Auditor Indianapolis Public Employee Retirement Fund June 2008  –  February 2009  (9 months) Indianapolis, Indiana Area Analyzed member accounts to ensure they receive proper fund distribution and ensuring that they match plan provisions and participant elections Internal Auditor Indianapolis Public Employee Retirement Fund June 2008  –  February 2009  (9 months) Indianapolis, Indiana Area Analyzed member accounts to ensure they receive proper fund distribution and ensuring that they match plan provisions and participant elections External Auditor Deloitte January 2006  –  May 2006  (5 months) Assisted 5 teams with audit of major accounts, including Wal-Mart, UPS, John Deere, Murata Electronics Company \nPrepared accounts payable, accounts receivable, bank reconciliations, expenses and voucher testing  \nPerformed analytical review of audit documents and reviewed client accounting, operating procedures and systems of internal control External Auditor Deloitte January 2006  –  May 2006  (5 months) Assisted 5 teams with audit of major accounts, including Wal-Mart, UPS, John Deere, Murata Electronics Company \nPrepared accounts payable, accounts receivable, bank reconciliations, expenses and voucher testing  \nPerformed analytical review of audit documents and reviewed client accounting, operating procedures and systems of internal control Languages Chinese Chinese Chinese Skills CPA Licensed Accounting Microsoft Excel Financial Reporting Forecasting Cost Accounting Business Analytics Internal Controls US GAAP Internal Audit Hyperion Enterprise General Ledger Auditing Revenue Recognition Accounts Receivable Variance Analysis Sarbanes-Oxley Act Financial Accounting GAAP Account Reconciliation Accruals Accounts Payable Consolidation SAP Financial Analysis Financial Statements Essbase Sarbanes-Oxley See 13+     See less Skills  CPA Licensed Accounting Microsoft Excel Financial Reporting Forecasting Cost Accounting Business Analytics Internal Controls US GAAP Internal Audit Hyperion Enterprise General Ledger Auditing Revenue Recognition Accounts Receivable Variance Analysis Sarbanes-Oxley Act Financial Accounting GAAP Account Reconciliation Accruals Accounts Payable Consolidation SAP Financial Analysis Financial Statements Essbase Sarbanes-Oxley See 13+     See less CPA Licensed Accounting Microsoft Excel Financial Reporting Forecasting Cost Accounting Business Analytics Internal Controls US GAAP Internal Audit Hyperion Enterprise General Ledger Auditing Revenue Recognition Accounts Receivable Variance Analysis Sarbanes-Oxley Act Financial Accounting GAAP Account Reconciliation Accruals Accounts Payable Consolidation SAP Financial Analysis Financial Statements Essbase Sarbanes-Oxley See 13+     See less CPA Licensed Accounting Microsoft Excel Financial Reporting Forecasting Cost Accounting Business Analytics Internal Controls US GAAP Internal Audit Hyperion Enterprise General Ledger Auditing Revenue Recognition Accounts Receivable Variance Analysis Sarbanes-Oxley Act Financial Accounting GAAP Account Reconciliation Accruals Accounts Payable Consolidation SAP Financial Analysis Financial Statements Essbase Sarbanes-Oxley See 13+     See less Education Indiana University Bloomington Master's degree,  Accounting , 3.67 2008  – 2009 Indiana University Bloomington Master's degree,  Accounting , 3.67 2008  – 2009 Indiana University Bloomington Master's degree,  Accounting , 3.67 2008  – 2009 Indiana University Bloomington Master's degree,  Accounting , 3.67 2008  – 2009 ", "Experience Senior Internal Auditor IBM 2001  – Present (14 years) Senior Internal Auditor IBM 2001  – Present (14 years) Senior Internal Auditor IBM 2001  – Present (14 years) Education Wabash College Bachelor's degree,  Economics 1972  – 1976 Wabash College Bachelor's degree,  Economics 1972  – 1976 Wabash College Bachelor's degree,  Economics 1972  – 1976 Wabash College Bachelor's degree,  Economics 1972  – 1976 ", "Summary I am a professional with an outstanding and interesting career built over 23 years with different roles in Audit and Finance with 11 years with management positions Internal Audit in the mining industry, 4 years as Manager Administration and Finance in the industrial sector, 3 years as senior internal auditor at IBM and 5 years as senior external auditor with PriceWaterhouseCoopers. Summary I am a professional with an outstanding and interesting career built over 23 years with different roles in Audit and Finance with 11 years with management positions Internal Audit in the mining industry, 4 years as Manager Administration and Finance in the industrial sector, 3 years as senior internal auditor at IBM and 5 years as senior external auditor with PriceWaterhouseCoopers. I am a professional with an outstanding and interesting career built over 23 years with different roles in Audit and Finance with 11 years with management positions Internal Audit in the mining industry, 4 years as Manager Administration and Finance in the industrial sector, 3 years as senior internal auditor at IBM and 5 years as senior external auditor with PriceWaterhouseCoopers. I am a professional with an outstanding and interesting career built over 23 years with different roles in Audit and Finance with 11 years with management positions Internal Audit in the mining industry, 4 years as Manager Administration and Finance in the industrial sector, 3 years as senior internal auditor at IBM and 5 years as senior external auditor with PriceWaterhouseCoopers. Experience Manager, Accounting & Finance Barrick Gold Corporation October 2014  – Present (11 months) Santo Domingo, Republica Dominicana •\tLead the Accounting and Finance department to provide all required services to the operations and other functional departments. \n \n•\tSupervise the effective and proper use of financial systems (Oracle, Hyperion). \n \n•\tComplete timely the month-end close process, including general ledger, income statement, accounts receivable, accounts payable, payroll, bank reconciliations and variance analysis activities. \n \n•\tComplete the financial reporting process including account analysis and reconciliation.  \n \n•\tProduce accurate and timely financial statements, as required.  \n \n•\tEnsure proper planning of payments to suppliers, employees or third parties, following the criteria established by the company in order to meet payment obligations timely.  \n \n•\tOptimize cash flows. \n \n•\tManage all banking relationships, including payments, movements and transfers, letters, bonds, etc. \n \n•\tCoordinate work and relationships with internal and external auditors, as well as provide all possible assistance to enable them to carry out their work efficiently. \n•\tManage operational data to ensure data integrity and accuracy.  \n \n•\tManage financial system hardware and software applications.  \n \n•\tPromote fraud prevention and risk mitigation.  \n \n•\tFunction as Internal Controls owner for key financial processes.  \n \n•\tAssist in special projects as necessary.  \n Principal Internal Auditor Xstrata April 2007  –  May 2013  (6 years 2 months) Santiago de Chile Principal Internal Auditor with leading roles of the audits provided by Xstrata Audit Service to the South American Operations and Projects located (Chile, Peru, Argentina and Colombia) and the Zinc Europe Operations located in (Spain, Germany and UK).  \nReviews are mainly focused in: Project Management, Risk Management, Fraud Examination, Asset Management, Community Relations, Contract and Cost Management, IT, Capital Expenditure/Post Expenditure, Treasury, Supply-Inventory and Logistic, Financial Management,  \nMarketing and Sales. Director Internal Audit Falcondo Xstrata Nickel - former Falconbridge Dominicana January 2002  –  March 2007  (5 years 3 months) Bonao, Dominican Republic Responsible for planning and supervision of the internal audit at Falcondo which Main activities consisted in developing a flexible annual audit plan using an appropriate risk-based methodology, including risk or control weaknesses concerns identified by the senior management and coordinating investigations of suspected fraudulent activities within the organization. Leader of the Falconbridge Corporate Internal Audit Team to perform SOX reviews to ensure compliance of the Sarbanes-Oxley Act Section 404 for the operations located in South America from 2003 to 2006. Manager, Accounting & Finance Barrick Gold Corporation October 2014  – Present (11 months) Santo Domingo, Republica Dominicana •\tLead the Accounting and Finance department to provide all required services to the operations and other functional departments. \n \n•\tSupervise the effective and proper use of financial systems (Oracle, Hyperion). \n \n•\tComplete timely the month-end close process, including general ledger, income statement, accounts receivable, accounts payable, payroll, bank reconciliations and variance analysis activities. \n \n•\tComplete the financial reporting process including account analysis and reconciliation.  \n \n•\tProduce accurate and timely financial statements, as required.  \n \n•\tEnsure proper planning of payments to suppliers, employees or third parties, following the criteria established by the company in order to meet payment obligations timely.  \n \n•\tOptimize cash flows. \n \n•\tManage all banking relationships, including payments, movements and transfers, letters, bonds, etc. \n \n•\tCoordinate work and relationships with internal and external auditors, as well as provide all possible assistance to enable them to carry out their work efficiently. \n•\tManage operational data to ensure data integrity and accuracy.  \n \n•\tManage financial system hardware and software applications.  \n \n•\tPromote fraud prevention and risk mitigation.  \n \n•\tFunction as Internal Controls owner for key financial processes.  \n \n•\tAssist in special projects as necessary.  \n Manager, Accounting & Finance Barrick Gold Corporation October 2014  – Present (11 months) Santo Domingo, Republica Dominicana •\tLead the Accounting and Finance department to provide all required services to the operations and other functional departments. \n \n•\tSupervise the effective and proper use of financial systems (Oracle, Hyperion). \n \n•\tComplete timely the month-end close process, including general ledger, income statement, accounts receivable, accounts payable, payroll, bank reconciliations and variance analysis activities. \n \n•\tComplete the financial reporting process including account analysis and reconciliation.  \n \n•\tProduce accurate and timely financial statements, as required.  \n \n•\tEnsure proper planning of payments to suppliers, employees or third parties, following the criteria established by the company in order to meet payment obligations timely.  \n \n•\tOptimize cash flows. \n \n•\tManage all banking relationships, including payments, movements and transfers, letters, bonds, etc. \n \n•\tCoordinate work and relationships with internal and external auditors, as well as provide all possible assistance to enable them to carry out their work efficiently. \n•\tManage operational data to ensure data integrity and accuracy.  \n \n•\tManage financial system hardware and software applications.  \n \n•\tPromote fraud prevention and risk mitigation.  \n \n•\tFunction as Internal Controls owner for key financial processes.  \n \n•\tAssist in special projects as necessary.  \n Principal Internal Auditor Xstrata April 2007  –  May 2013  (6 years 2 months) Santiago de Chile Principal Internal Auditor with leading roles of the audits provided by Xstrata Audit Service to the South American Operations and Projects located (Chile, Peru, Argentina and Colombia) and the Zinc Europe Operations located in (Spain, Germany and UK).  \nReviews are mainly focused in: Project Management, Risk Management, Fraud Examination, Asset Management, Community Relations, Contract and Cost Management, IT, Capital Expenditure/Post Expenditure, Treasury, Supply-Inventory and Logistic, Financial Management,  \nMarketing and Sales. Principal Internal Auditor Xstrata April 2007  –  May 2013  (6 years 2 months) Santiago de Chile Principal Internal Auditor with leading roles of the audits provided by Xstrata Audit Service to the South American Operations and Projects located (Chile, Peru, Argentina and Colombia) and the Zinc Europe Operations located in (Spain, Germany and UK).  \nReviews are mainly focused in: Project Management, Risk Management, Fraud Examination, Asset Management, Community Relations, Contract and Cost Management, IT, Capital Expenditure/Post Expenditure, Treasury, Supply-Inventory and Logistic, Financial Management,  \nMarketing and Sales. Director Internal Audit Falcondo Xstrata Nickel - former Falconbridge Dominicana January 2002  –  March 2007  (5 years 3 months) Bonao, Dominican Republic Responsible for planning and supervision of the internal audit at Falcondo which Main activities consisted in developing a flexible annual audit plan using an appropriate risk-based methodology, including risk or control weaknesses concerns identified by the senior management and coordinating investigations of suspected fraudulent activities within the organization. Leader of the Falconbridge Corporate Internal Audit Team to perform SOX reviews to ensure compliance of the Sarbanes-Oxley Act Section 404 for the operations located in South America from 2003 to 2006. Director Internal Audit Falcondo Xstrata Nickel - former Falconbridge Dominicana January 2002  –  March 2007  (5 years 3 months) Bonao, Dominican Republic Responsible for planning and supervision of the internal audit at Falcondo which Main activities consisted in developing a flexible annual audit plan using an appropriate risk-based methodology, including risk or control weaknesses concerns identified by the senior management and coordinating investigations of suspected fraudulent activities within the organization. Leader of the Falconbridge Corporate Internal Audit Team to perform SOX reviews to ensure compliance of the Sarbanes-Oxley Act Section 404 for the operations located in South America from 2003 to 2006. Languages Español Inglés Español Inglés Español Inglés Skills Spanish-English Design & Implementation... Operational Risk... Project Management -... Financial Audits Internal Audit Business Process... Ley Sarbanes-Oxley Informes financieros Gestión de riesgos Gerencia de finanzas Control interno Contabilidad financiera Contabilidad Auditorías internas Evaluación de riesgos Mejora de procesos de... Normas Internacionales... Planificación... Minería Análisis financiero Auditorías contables Accounting Auditorías Microsoft Office Financial Reporting See 11+     See less Skills  Spanish-English Design & Implementation... Operational Risk... Project Management -... Financial Audits Internal Audit Business Process... Ley Sarbanes-Oxley Informes financieros Gestión de riesgos Gerencia de finanzas Control interno Contabilidad financiera Contabilidad Auditorías internas Evaluación de riesgos Mejora de procesos de... Normas Internacionales... Planificación... Minería Análisis financiero Auditorías contables Accounting Auditorías Microsoft Office Financial Reporting See 11+     See less Spanish-English Design & Implementation... Operational Risk... Project Management -... Financial Audits Internal Audit Business Process... Ley Sarbanes-Oxley Informes financieros Gestión de riesgos Gerencia de finanzas Control interno Contabilidad financiera Contabilidad Auditorías internas Evaluación de riesgos Mejora de procesos de... Normas Internacionales... Planificación... Minería Análisis financiero Auditorías contables Accounting Auditorías Microsoft Office Financial Reporting See 11+     See less Spanish-English Design & Implementation... Operational Risk... Project Management -... Financial Audits Internal Audit Business Process... Ley Sarbanes-Oxley Informes financieros Gestión de riesgos Gerencia de finanzas Control interno Contabilidad financiera Contabilidad Auditorías internas Evaluación de riesgos Mejora de procesos de... Normas Internacionales... Planificación... Minería Análisis financiero Auditorías contables Accounting Auditorías Microsoft Office Financial Reporting See 11+     See less Education Instituto Tecnologico de Santo Domingo - INTEC Master of Business Administration (M.B.A.),  Corporate finanace 1995  – 1998 Instituto Tecnologico de Santo Domingo - INTEC Bachelor's degree,  Accounting and Auditing 1987  – 1991 Instituto Tecnologico de Santo Domingo - INTEC Master of Business Administration (M.B.A.),  Corporate finanace 1995  – 1998 Instituto Tecnologico de Santo Domingo - INTEC Master of Business Administration (M.B.A.),  Corporate finanace 1995  – 1998 Instituto Tecnologico de Santo Domingo - INTEC Master of Business Administration (M.B.A.),  Corporate finanace 1995  – 1998 Instituto Tecnologico de Santo Domingo - INTEC Bachelor's degree,  Accounting and Auditing 1987  – 1991 Instituto Tecnologico de Santo Domingo - INTEC Bachelor's degree,  Accounting and Auditing 1987  – 1991 Instituto Tecnologico de Santo Domingo - INTEC Bachelor's degree,  Accounting and Auditing 1987  – 1991 ", "Summary Enjoying life and keen to give back to the community by being involved in politics and representing UKIP in local borough, county and national elections. \n \nCurrently UKIP Havant Branch Chairman and representing UKIP in Havant Borough Council as one of the councillors on Hayling Island. Was UKIP parliamentary candidate for Havant, gaining 20% of the vote and coming 2nd (from 4th in the 010 General Election). \n \nOther interests include:  \n \n* Technology which should be encouraged and used to improve efficiency \n* Computing - I build my own computers from parts and have a 10Gb LAN with 26TB NAS storage \n* Driving - Always liked driving and enjoy my orange BMW M3. \n* Swimming - Need to keep active and fit, so I'm down the pool 2-3 times a week \n* Pop-concerts - Enjoy all kinds of popular music and going to arena and other concerts \n* Photography - particularly videoing music concerts \n \nFinally believe in being honest and true, what you see it what you get. Summary Enjoying life and keen to give back to the community by being involved in politics and representing UKIP in local borough, county and national elections. \n \nCurrently UKIP Havant Branch Chairman and representing UKIP in Havant Borough Council as one of the councillors on Hayling Island. Was UKIP parliamentary candidate for Havant, gaining 20% of the vote and coming 2nd (from 4th in the 010 General Election). \n \nOther interests include:  \n \n* Technology which should be encouraged and used to improve efficiency \n* Computing - I build my own computers from parts and have a 10Gb LAN with 26TB NAS storage \n* Driving - Always liked driving and enjoy my orange BMW M3. \n* Swimming - Need to keep active and fit, so I'm down the pool 2-3 times a week \n* Pop-concerts - Enjoy all kinds of popular music and going to arena and other concerts \n* Photography - particularly videoing music concerts \n \nFinally believe in being honest and true, what you see it what you get. Enjoying life and keen to give back to the community by being involved in politics and representing UKIP in local borough, county and national elections. \n \nCurrently UKIP Havant Branch Chairman and representing UKIP in Havant Borough Council as one of the councillors on Hayling Island. Was UKIP parliamentary candidate for Havant, gaining 20% of the vote and coming 2nd (from 4th in the 010 General Election). \n \nOther interests include:  \n \n* Technology which should be encouraged and used to improve efficiency \n* Computing - I build my own computers from parts and have a 10Gb LAN with 26TB NAS storage \n* Driving - Always liked driving and enjoy my orange BMW M3. \n* Swimming - Need to keep active and fit, so I'm down the pool 2-3 times a week \n* Pop-concerts - Enjoy all kinds of popular music and going to arena and other concerts \n* Photography - particularly videoing music concerts \n \nFinally believe in being honest and true, what you see it what you get. Enjoying life and keen to give back to the community by being involved in politics and representing UKIP in local borough, county and national elections. \n \nCurrently UKIP Havant Branch Chairman and representing UKIP in Havant Borough Council as one of the councillors on Hayling Island. Was UKIP parliamentary candidate for Havant, gaining 20% of the vote and coming 2nd (from 4th in the 010 General Election). \n \nOther interests include:  \n \n* Technology which should be encouraged and used to improve efficiency \n* Computing - I build my own computers from parts and have a 10Gb LAN with 26TB NAS storage \n* Driving - Always liked driving and enjoy my orange BMW M3. \n* Swimming - Need to keep active and fit, so I'm down the pool 2-3 times a week \n* Pop-concerts - Enjoy all kinds of popular music and going to arena and other concerts \n* Photography - particularly videoing music concerts \n \nFinally believe in being honest and true, what you see it what you get. Experience UKIP Havant Branch Chairman and Prospective Parliamentary Candidate UKIP Havant 2010  – Present (5 years) Havant Currently a UKIP Councillor on Havant Borough Council representing the Hayling East Ward. \n \nJoined UKIP in 2010 and was elected Branch Treasurer in 2012; passed the Parliamentary Candidate Selection process in 2013 and was elected Havant Branch Chairman and adopted as the PPC in February 2014, and came second in the 2015 General Election.. \n \nI believe in honesty, integrity and helping giving others an opportunity to do what they aspire to in life.  \n \nI passionately believe in UKIP policies that will make Britain a better and fairer place while rewarding those that contribute to our country whilst providing a safety net for those who have fallen on hard times. Mergers, Acquisitions and Integrations Specialist IBM 2000  –  2009  (9 years) Responsible for integrating the financial processes and systems of newly acquired companies into the IBM organisation. Made full use of business, personal soft skills, and computer skills to migrate systems; develop processes and transfer systems data in an efficient manner with full integrity. Had MOD security clearance for some roles.  \nDuring this role I gained extensive experience in the running of companies having turnovers form £1 million to £100 million in computer hardware, software, services and education. \nThis role covered all aspects of integration planning with me providing guidance on all share purchase, goodwill, and trade transfer accounting entries across the UK and Europe. During this time, I participated in integration planning workshops in the UK, Netherlands, Germany and Ireland. \nPart of my role was to train integration accountants both within the UK and across Europe and liaise on a regular basis with the world-wide integration centre in the USA. \n \nACHIEVEMENTS \n• Represented IBM UK for Integration activity to CFOs and CEOs of acquired companies.  \n• Managed the integration of fifteen different companies into the IBM organisation.  \n• Developed and had executed Trade Transfer and Share Purchase agreements in conjunction with the Legal and Tax departments. \n• Managed the migration of fixed assets, payroll, personal expenses, purchasing, accounts payable, project cost accounting, invoicing, and billing applications and processes for acquisitions with annual turnovers from £1 million to £100 million.  \n• Participated in due diligence activities on potential acquisitions. \n• Transferred the Payroll and HR records from IBM for 600 employees and received a commendation of the EMEA HR Director of the company.  \n• Recognised as the mergers and acquisitions subject matter expert Finance expert on data extraction, analysis and interpretation. Senior Internal Auditor IBM 1986  –  2005  (19 years) Managed UK company audit teams covering manufacturing, development, marketing and head office administrative functions. Audited treasury, leasing, financial accounting, general accounting, cost accounting, purchasing, accounts payable, billing, accounts receivable, VAT, payroll, fixed assets, contract management, systems outsourcing, materials logistics processes, fraud and marketing administrative processes.  \nMade extensive use of computer audit tools, including statistical sampling. Performed complex audit analysis covering all financial and administrative processes. Had excellent findings and assisted senior management in resolving problems. Wrote and presented audit reports to management and company directors. Always focused on \"Value Add\". \n \nACHIEVEMENTS  \n• Designed, developed and implemented electronic audit work papers.  \n• Developed systems access controls programs.  \n• Initiated improvements to company mainframe systems access controls.  \n• Planned audits; wrote recommendations in audit reports; and presented to senior management. Tax Accountant IBM 1999  –  1999  (less than a year) Responsible for supporting the Tax Department for Inland Revenue and HM Customs & Excise Investigations.  \n \nACHIEVEMENTS \n• Worked with Information Systems to recover and analyse system records for Inland Revenue and HMC&E investigations and do avoid financial penalties. Accounting Controls Expert IBM 1995  –  1998  (3 years) Member of the Chief Accountant's management team. Responsible for IBM UK Accounting Controls covering revenue, cost, expense and balance sheet and I&E accounting standards. Operated as a trouble-shooter and performed company wide investigations and projects into improving controls. \n \nACHIEVEMENTS \n• Designed, developed and implemented enhanced account ownership and reconciliation standards.  \n• Developed database interrogation programs to assure accounting controls.  \n• Pioneer in encouraging the use of new technology to improve productivity. Fixed Assets Group Leader IBM 1983  –  1986  (3 years) Supervised a staff of three. Responsible for the correct accounting for fixed assets of £100 million and implementing a new fixed assets system with changed processes. Improved data integrity and implemented productivity improvements. Led the manufacturing capital allowances maximisation project. Expertise on fixed assets system sought from 1987 to 1994. \n \nACHIEVEMENTS  \n• Converted assets to a new fixed assets system.  \n• Re-engineering the fixed assets accounting process. Manufacturing Systems and Sales Group Leader IBM 1979  –  1983  (4 years) Supervised a staff of three. Responsible for the logistics, costing and invoicing processes (£200 million per annum). Supported the development and enhancement of major and minor systems enhancements. Responsible for the accurate costing of manufactured products and variance control.  \n \nACHIEVEMENTS  \n• Simplified and improved control over cost accounting process.  \n• Managed a major integrity improvement exercise. Trainee Accountant EMI Records 1976  –  1979  (3 years) Produced monthly profit and loss account and balance sheet. Prepared budgets and forecasts for the record manufacturing operations. Maintained all EMI Records mainframe financial models. Developed financial models as required by finance and operations management. Maintained the manual fixed assets register; prepared monthly financial statements; and reconciled supplier statements. Performed basic financial accounting; prepared the monthly profit and loss account and balance sheet; prepared the VAT Return; and reconciled the company bank accounts. Electronics Develiopment Engineer Thorn EMI Electronics 1974  –  1976  (2 years) Assisted in telecommunication equipment design and development; wrote programs for electronic test equipment. This work led to a major contract being awarded by the Post Office. Electronics Develiopment Engineer Racal Milgo 1972  –  1974  (2 years) Electronics development engineer. Assisted in the design of test equipment and liaised with customers. Had MOD security clearance. UKIP Havant Branch Chairman and Prospective Parliamentary Candidate UKIP Havant 2010  – Present (5 years) Havant Currently a UKIP Councillor on Havant Borough Council representing the Hayling East Ward. \n \nJoined UKIP in 2010 and was elected Branch Treasurer in 2012; passed the Parliamentary Candidate Selection process in 2013 and was elected Havant Branch Chairman and adopted as the PPC in February 2014, and came second in the 2015 General Election.. \n \nI believe in honesty, integrity and helping giving others an opportunity to do what they aspire to in life.  \n \nI passionately believe in UKIP policies that will make Britain a better and fairer place while rewarding those that contribute to our country whilst providing a safety net for those who have fallen on hard times. UKIP Havant Branch Chairman and Prospective Parliamentary Candidate UKIP Havant 2010  – Present (5 years) Havant Currently a UKIP Councillor on Havant Borough Council representing the Hayling East Ward. \n \nJoined UKIP in 2010 and was elected Branch Treasurer in 2012; passed the Parliamentary Candidate Selection process in 2013 and was elected Havant Branch Chairman and adopted as the PPC in February 2014, and came second in the 2015 General Election.. \n \nI believe in honesty, integrity and helping giving others an opportunity to do what they aspire to in life.  \n \nI passionately believe in UKIP policies that will make Britain a better and fairer place while rewarding those that contribute to our country whilst providing a safety net for those who have fallen on hard times. Mergers, Acquisitions and Integrations Specialist IBM 2000  –  2009  (9 years) Responsible for integrating the financial processes and systems of newly acquired companies into the IBM organisation. Made full use of business, personal soft skills, and computer skills to migrate systems; develop processes and transfer systems data in an efficient manner with full integrity. Had MOD security clearance for some roles.  \nDuring this role I gained extensive experience in the running of companies having turnovers form £1 million to £100 million in computer hardware, software, services and education. \nThis role covered all aspects of integration planning with me providing guidance on all share purchase, goodwill, and trade transfer accounting entries across the UK and Europe. During this time, I participated in integration planning workshops in the UK, Netherlands, Germany and Ireland. \nPart of my role was to train integration accountants both within the UK and across Europe and liaise on a regular basis with the world-wide integration centre in the USA. \n \nACHIEVEMENTS \n• Represented IBM UK for Integration activity to CFOs and CEOs of acquired companies.  \n• Managed the integration of fifteen different companies into the IBM organisation.  \n• Developed and had executed Trade Transfer and Share Purchase agreements in conjunction with the Legal and Tax departments. \n• Managed the migration of fixed assets, payroll, personal expenses, purchasing, accounts payable, project cost accounting, invoicing, and billing applications and processes for acquisitions with annual turnovers from £1 million to £100 million.  \n• Participated in due diligence activities on potential acquisitions. \n• Transferred the Payroll and HR records from IBM for 600 employees and received a commendation of the EMEA HR Director of the company.  \n• Recognised as the mergers and acquisitions subject matter expert Finance expert on data extraction, analysis and interpretation. Mergers, Acquisitions and Integrations Specialist IBM 2000  –  2009  (9 years) Responsible for integrating the financial processes and systems of newly acquired companies into the IBM organisation. Made full use of business, personal soft skills, and computer skills to migrate systems; develop processes and transfer systems data in an efficient manner with full integrity. Had MOD security clearance for some roles.  \nDuring this role I gained extensive experience in the running of companies having turnovers form £1 million to £100 million in computer hardware, software, services and education. \nThis role covered all aspects of integration planning with me providing guidance on all share purchase, goodwill, and trade transfer accounting entries across the UK and Europe. During this time, I participated in integration planning workshops in the UK, Netherlands, Germany and Ireland. \nPart of my role was to train integration accountants both within the UK and across Europe and liaise on a regular basis with the world-wide integration centre in the USA. \n \nACHIEVEMENTS \n• Represented IBM UK for Integration activity to CFOs and CEOs of acquired companies.  \n• Managed the integration of fifteen different companies into the IBM organisation.  \n• Developed and had executed Trade Transfer and Share Purchase agreements in conjunction with the Legal and Tax departments. \n• Managed the migration of fixed assets, payroll, personal expenses, purchasing, accounts payable, project cost accounting, invoicing, and billing applications and processes for acquisitions with annual turnovers from £1 million to £100 million.  \n• Participated in due diligence activities on potential acquisitions. \n• Transferred the Payroll and HR records from IBM for 600 employees and received a commendation of the EMEA HR Director of the company.  \n• Recognised as the mergers and acquisitions subject matter expert Finance expert on data extraction, analysis and interpretation. Senior Internal Auditor IBM 1986  –  2005  (19 years) Managed UK company audit teams covering manufacturing, development, marketing and head office administrative functions. Audited treasury, leasing, financial accounting, general accounting, cost accounting, purchasing, accounts payable, billing, accounts receivable, VAT, payroll, fixed assets, contract management, systems outsourcing, materials logistics processes, fraud and marketing administrative processes.  \nMade extensive use of computer audit tools, including statistical sampling. Performed complex audit analysis covering all financial and administrative processes. Had excellent findings and assisted senior management in resolving problems. Wrote and presented audit reports to management and company directors. Always focused on \"Value Add\". \n \nACHIEVEMENTS  \n• Designed, developed and implemented electronic audit work papers.  \n• Developed systems access controls programs.  \n• Initiated improvements to company mainframe systems access controls.  \n• Planned audits; wrote recommendations in audit reports; and presented to senior management. Senior Internal Auditor IBM 1986  –  2005  (19 years) Managed UK company audit teams covering manufacturing, development, marketing and head office administrative functions. Audited treasury, leasing, financial accounting, general accounting, cost accounting, purchasing, accounts payable, billing, accounts receivable, VAT, payroll, fixed assets, contract management, systems outsourcing, materials logistics processes, fraud and marketing administrative processes.  \nMade extensive use of computer audit tools, including statistical sampling. Performed complex audit analysis covering all financial and administrative processes. Had excellent findings and assisted senior management in resolving problems. Wrote and presented audit reports to management and company directors. Always focused on \"Value Add\". \n \nACHIEVEMENTS  \n• Designed, developed and implemented electronic audit work papers.  \n• Developed systems access controls programs.  \n• Initiated improvements to company mainframe systems access controls.  \n• Planned audits; wrote recommendations in audit reports; and presented to senior management. Tax Accountant IBM 1999  –  1999  (less than a year) Responsible for supporting the Tax Department for Inland Revenue and HM Customs & Excise Investigations.  \n \nACHIEVEMENTS \n• Worked with Information Systems to recover and analyse system records for Inland Revenue and HMC&E investigations and do avoid financial penalties. Tax Accountant IBM 1999  –  1999  (less than a year) Responsible for supporting the Tax Department for Inland Revenue and HM Customs & Excise Investigations.  \n \nACHIEVEMENTS \n• Worked with Information Systems to recover and analyse system records for Inland Revenue and HMC&E investigations and do avoid financial penalties. Accounting Controls Expert IBM 1995  –  1998  (3 years) Member of the Chief Accountant's management team. Responsible for IBM UK Accounting Controls covering revenue, cost, expense and balance sheet and I&E accounting standards. Operated as a trouble-shooter and performed company wide investigations and projects into improving controls. \n \nACHIEVEMENTS \n• Designed, developed and implemented enhanced account ownership and reconciliation standards.  \n• Developed database interrogation programs to assure accounting controls.  \n• Pioneer in encouraging the use of new technology to improve productivity. Accounting Controls Expert IBM 1995  –  1998  (3 years) Member of the Chief Accountant's management team. Responsible for IBM UK Accounting Controls covering revenue, cost, expense and balance sheet and I&E accounting standards. Operated as a trouble-shooter and performed company wide investigations and projects into improving controls. \n \nACHIEVEMENTS \n• Designed, developed and implemented enhanced account ownership and reconciliation standards.  \n• Developed database interrogation programs to assure accounting controls.  \n• Pioneer in encouraging the use of new technology to improve productivity. Fixed Assets Group Leader IBM 1983  –  1986  (3 years) Supervised a staff of three. Responsible for the correct accounting for fixed assets of £100 million and implementing a new fixed assets system with changed processes. Improved data integrity and implemented productivity improvements. Led the manufacturing capital allowances maximisation project. Expertise on fixed assets system sought from 1987 to 1994. \n \nACHIEVEMENTS  \n• Converted assets to a new fixed assets system.  \n• Re-engineering the fixed assets accounting process. Fixed Assets Group Leader IBM 1983  –  1986  (3 years) Supervised a staff of three. Responsible for the correct accounting for fixed assets of £100 million and implementing a new fixed assets system with changed processes. Improved data integrity and implemented productivity improvements. Led the manufacturing capital allowances maximisation project. Expertise on fixed assets system sought from 1987 to 1994. \n \nACHIEVEMENTS  \n• Converted assets to a new fixed assets system.  \n• Re-engineering the fixed assets accounting process. Manufacturing Systems and Sales Group Leader IBM 1979  –  1983  (4 years) Supervised a staff of three. Responsible for the logistics, costing and invoicing processes (£200 million per annum). Supported the development and enhancement of major and minor systems enhancements. Responsible for the accurate costing of manufactured products and variance control.  \n \nACHIEVEMENTS  \n• Simplified and improved control over cost accounting process.  \n• Managed a major integrity improvement exercise. Manufacturing Systems and Sales Group Leader IBM 1979  –  1983  (4 years) Supervised a staff of three. Responsible for the logistics, costing and invoicing processes (£200 million per annum). Supported the development and enhancement of major and minor systems enhancements. Responsible for the accurate costing of manufactured products and variance control.  \n \nACHIEVEMENTS  \n• Simplified and improved control over cost accounting process.  \n• Managed a major integrity improvement exercise. Trainee Accountant EMI Records 1976  –  1979  (3 years) Produced monthly profit and loss account and balance sheet. Prepared budgets and forecasts for the record manufacturing operations. Maintained all EMI Records mainframe financial models. Developed financial models as required by finance and operations management. Maintained the manual fixed assets register; prepared monthly financial statements; and reconciled supplier statements. Performed basic financial accounting; prepared the monthly profit and loss account and balance sheet; prepared the VAT Return; and reconciled the company bank accounts. Trainee Accountant EMI Records 1976  –  1979  (3 years) Produced monthly profit and loss account and balance sheet. Prepared budgets and forecasts for the record manufacturing operations. Maintained all EMI Records mainframe financial models. Developed financial models as required by finance and operations management. Maintained the manual fixed assets register; prepared monthly financial statements; and reconciled supplier statements. Performed basic financial accounting; prepared the monthly profit and loss account and balance sheet; prepared the VAT Return; and reconciled the company bank accounts. Electronics Develiopment Engineer Thorn EMI Electronics 1974  –  1976  (2 years) Assisted in telecommunication equipment design and development; wrote programs for electronic test equipment. This work led to a major contract being awarded by the Post Office. Electronics Develiopment Engineer Thorn EMI Electronics 1974  –  1976  (2 years) Assisted in telecommunication equipment design and development; wrote programs for electronic test equipment. This work led to a major contract being awarded by the Post Office. Electronics Develiopment Engineer Racal Milgo 1972  –  1974  (2 years) Electronics development engineer. Assisted in the design of test equipment and liaised with customers. Had MOD security clearance. Electronics Develiopment Engineer Racal Milgo 1972  –  1974  (2 years) Electronics development engineer. Assisted in the design of test equipment and liaised with customers. Had MOD security clearance. Skills Forecasting Process Improvement Accounting Team Leadership Skills  Forecasting Process Improvement Accounting Team Leadership Forecasting Process Improvement Accounting Team Leadership Forecasting Process Improvement Accounting Team Leadership Education University of Southampton BSc (Hons),  Electronics 1969  – 1972 Final year project was to write a dissertation on the vibration modes of a barium titanate transducer. University of Southampton BSc (Hons),  Electronics 1969  – 1972 Final year project was to write a dissertation on the vibration modes of a barium titanate transducer. University of Southampton BSc (Hons),  Electronics 1969  – 1972 Final year project was to write a dissertation on the vibration modes of a barium titanate transducer. University of Southampton BSc (Hons),  Electronics 1969  – 1972 Final year project was to write a dissertation on the vibration modes of a barium titanate transducer. ", "Summary Specialties:CIA, CISA Summary Specialties:CIA, CISA Specialties:CIA, CISA Specialties:CIA, CISA Experience Senior Internal Auditor IBM October 1977  – Present (37 years 11 months) Owner Lube Dudes, Inc. 2001  –  2006  (5 years) Senior Internal Auditor IBM October 1977  – Present (37 years 11 months) Senior Internal Auditor IBM October 1977  – Present (37 years 11 months) Owner Lube Dudes, Inc. 2001  –  2006  (5 years) Owner Lube Dudes, Inc. 2001  –  2006  (5 years) Skills Sarbanes-Oxley Act Internal Audit Internal Controls IT Audit Enterprise Risk... Auditing Sarbanes-Oxley Business Process... US GAAP Governance Financial Audits Financial Reporting Business Process Risk Management Managerial Finance Risk Assessment CISA Financial Risk Process Improvement Accounting Financial Analysis Global Mobility Order to Cash Expenses Human Resources See 10+     See less Skills  Sarbanes-Oxley Act Internal Audit Internal Controls IT Audit Enterprise Risk... Auditing Sarbanes-Oxley Business Process... US GAAP Governance Financial Audits Financial Reporting Business Process Risk Management Managerial Finance Risk Assessment CISA Financial Risk Process Improvement Accounting Financial Analysis Global Mobility Order to Cash Expenses Human Resources See 10+     See less Sarbanes-Oxley Act Internal Audit Internal Controls IT Audit Enterprise Risk... Auditing Sarbanes-Oxley Business Process... US GAAP Governance Financial Audits Financial Reporting Business Process Risk Management Managerial Finance Risk Assessment CISA Financial Risk Process Improvement Accounting Financial Analysis Global Mobility Order to Cash Expenses Human Resources See 10+     See less Sarbanes-Oxley Act Internal Audit Internal Controls IT Audit Enterprise Risk... Auditing Sarbanes-Oxley Business Process... US GAAP Governance Financial Audits Financial Reporting Business Process Risk Management Managerial Finance Risk Assessment CISA Financial Risk Process Improvement Accounting Financial Analysis Global Mobility Order to Cash Expenses Human Resources See 10+     See less Education Marymount Manhattan College BA,  Business 1994  – 1997 IBM Systems Research Institute - Tarrytown, NY Finance , General 1985  – 1986 Marymount Manhattan College BA,  Business 1994  – 1997 Marymount Manhattan College BA,  Business 1994  – 1997 Marymount Manhattan College BA,  Business 1994  – 1997 IBM Systems Research Institute - Tarrytown, NY Finance , General 1985  – 1986 IBM Systems Research Institute - Tarrytown, NY Finance , General 1985  – 1986 IBM Systems Research Institute - Tarrytown, NY Finance , General 1985  – 1986 "]}