{"position": "Senior Hardware Engineer", "company": "Google", "profiles": ["Experience Hardware Engineer Google June 2008  – Present (7 years 2 months) Test Engineering Manager McAfee January 2007  –  May 2008  (1 year 5 months) DVT/HALT Project Manager McAfee October 2005  –  December 2006  (1 year 3 months) Hardware Engineer Brocade May 2000  –  October 2005  (5 years 6 months) Hardware Engineer 3Com December 1995  –  May 2000  (4 years 6 months) (Open) 1 recommendation Dalton Victor Test Lead at Kumu Networks Dave was my first mentor after college. He is a very intelligent, personable and patient teacher. Dave also has natural leadership abilities. View Hardware Engineer Google June 2008  – Present (7 years 2 months) Hardware Engineer Google June 2008  – Present (7 years 2 months) Test Engineering Manager McAfee January 2007  –  May 2008  (1 year 5 months) Test Engineering Manager McAfee January 2007  –  May 2008  (1 year 5 months) DVT/HALT Project Manager McAfee October 2005  –  December 2006  (1 year 3 months) DVT/HALT Project Manager McAfee October 2005  –  December 2006  (1 year 3 months) Hardware Engineer Brocade May 2000  –  October 2005  (5 years 6 months) Hardware Engineer Brocade May 2000  –  October 2005  (5 years 6 months) Hardware Engineer 3Com December 1995  –  May 2000  (4 years 6 months) (Open) 1 recommendation Dalton Victor Test Lead at Kumu Networks Dave was my first mentor after college. He is a very intelligent, personable and patient teacher. Dave also has natural leadership abilities. View Hardware Engineer 3Com December 1995  –  May 2000  (4 years 6 months) (Open) 1 recommendation Dalton Victor Test Lead at Kumu Networks Dave was my first mentor after college. He is a very intelligent, personable and patient teacher. Dave also has natural leadership abilities. View Skills Skills     ", "Summary Hardware Engineer at Google. Experience in digital circuit design, FPGA emulation, computer architecture, non-volatile memory-based storage architectures, and embedded systems. \n \nWhile at UCSD, my research interests focused on the hardware/software co-design of scalable systems for solving large-scale, data-intensive applications. With that goal, my research targeted two possible architectural solutions. The first solution was to build storage devices that leverage -- in both the hardware and software layers -- the potential of emerging non-volatile memories. The second solution was to design and build an FPGA-based cluster that supports highly-threaded processing elements, a low-latency interconnect, and tightly-coupled access to large amounts of memory. Summary Hardware Engineer at Google. Experience in digital circuit design, FPGA emulation, computer architecture, non-volatile memory-based storage architectures, and embedded systems. \n \nWhile at UCSD, my research interests focused on the hardware/software co-design of scalable systems for solving large-scale, data-intensive applications. With that goal, my research targeted two possible architectural solutions. The first solution was to build storage devices that leverage -- in both the hardware and software layers -- the potential of emerging non-volatile memories. The second solution was to design and build an FPGA-based cluster that supports highly-threaded processing elements, a low-latency interconnect, and tightly-coupled access to large amounts of memory. Hardware Engineer at Google. Experience in digital circuit design, FPGA emulation, computer architecture, non-volatile memory-based storage architectures, and embedded systems. \n \nWhile at UCSD, my research interests focused on the hardware/software co-design of scalable systems for solving large-scale, data-intensive applications. With that goal, my research targeted two possible architectural solutions. The first solution was to build storage devices that leverage -- in both the hardware and software layers -- the potential of emerging non-volatile memories. The second solution was to design and build an FPGA-based cluster that supports highly-threaded processing elements, a low-latency interconnect, and tightly-coupled access to large amounts of memory. Hardware Engineer at Google. Experience in digital circuit design, FPGA emulation, computer architecture, non-volatile memory-based storage architectures, and embedded systems. \n \nWhile at UCSD, my research interests focused on the hardware/software co-design of scalable systems for solving large-scale, data-intensive applications. With that goal, my research targeted two possible architectural solutions. The first solution was to build storage devices that leverage -- in both the hardware and software layers -- the potential of emerging non-volatile memories. The second solution was to design and build an FPGA-based cluster that supports highly-threaded processing elements, a low-latency interconnect, and tightly-coupled access to large amounts of memory. Experience Hardware Engineer Google June 2013  – Present (2 years 2 months) Mountain View, CA Designing systems to support Google's mission to organize the world's information and make it universally accessible and useful. Graduate Research Assistant University of California at San Diego September 2010  –  June 2013  (2 years 10 months) Validating NAND flash memory power and latency models for SLC and MLC chips. Discovering and exploiting flash memory characteristics to improve solid-state disk performance. Developing an improved flash memory test bench for further research opportunities. Designing a high-performance flash controller for use in embedded systems and large storage arrays. (Open) 3 projects MacroScope Evaluating an FPGA-based cluster for solving data-intensive applications. The cluster consists of 32 FPGAs connected with a... View MARS Added hardware support for implementing novel atomic write primitive in a next-generation solid-state drive based on... View Ming II Developed a flexible flash memory test bench for further research opportunities. Designed the flash controller in FPGA... View Platforms Engineering Intern Google June 2011  –  September 2011  (4 months) Mountain View, CA Extended functionality of built-in self-test module for on-board DRAM. Developed, validated, and verified an SMBus slave module for host communication. Added support for CRC calculation in a high-performance storage system. Optimizations to storage system improved throughput by up to 3.72%. Student Technical Assistant MIT Lincoln Laboratory March 2010  –  August 2010  (6 months) Developed high-performance and customizable digital signal processing algorithms for FPGAs. Designed software tools to allow easy customization and generation of hardware implementations. Project Coordinator The Church of Jesus Christ of Latter-day Saints January 2010  –  February 2010  (2 months) Assisted Project Managers in working directly with customers in identifying requirements and setting expectations to maintain a high level of customer trust and confidence. Tracked and reported on project schedule, scope and budget aspects. Built and maintained project and operational reports. Teaching Assistant Brigham Young University November 2009  –  December 2009  (2 months) Updated and defined interface for operating system design class project. Designing operating system to mirror true functionality, including separation of kernel and user modes. Developing reference solution for test benches. Hardware Engineer Intern National Instruments June 2009  –  August 2009  (3 months) Received own assignment to design an in-house circuit board used to test PXI-Express signals. Generated, proposed, and selected concept alternatives. Performed research on alternative parts including meeting with representatives from major chip manufacturers. Designed board using Computer-Aided Design schematic tool. Assisted Layout Engineer with board stack-up, placement, and routing. Verified functionality of another board through comprehensive signal integrity tests. Repair Technician Vantage Controls January 2008  –  August 2008  (8 months) Diagnosed damaged circuit boards by reading schematics and testing. Repaired damaged circuit boards through part replacement and soldering. Wrote and compiled comprehensive board testing and repair manuals. Research Assistant Brigham Young University November 2006  –  October 2007  (1 year) Research Assistant – Brigham Young University, Chemistry Dept. \nPerformed simulations and testing of Virtual ChemLab and Virtual Physical Science, a virtual laboratory software tools developed by Dr. Brian Woodfield at BYU to assist students in laboratory experience. Wrote comprehensive help files and manuals for Virtual ChemLab and Virtual Physical Science Hardware Engineer Google June 2013  – Present (2 years 2 months) Mountain View, CA Designing systems to support Google's mission to organize the world's information and make it universally accessible and useful. Hardware Engineer Google June 2013  – Present (2 years 2 months) Mountain View, CA Designing systems to support Google's mission to organize the world's information and make it universally accessible and useful. Graduate Research Assistant University of California at San Diego September 2010  –  June 2013  (2 years 10 months) Validating NAND flash memory power and latency models for SLC and MLC chips. Discovering and exploiting flash memory characteristics to improve solid-state disk performance. Developing an improved flash memory test bench for further research opportunities. Designing a high-performance flash controller for use in embedded systems and large storage arrays. (Open) 3 projects MacroScope Evaluating an FPGA-based cluster for solving data-intensive applications. The cluster consists of 32 FPGAs connected with a... View MARS Added hardware support for implementing novel atomic write primitive in a next-generation solid-state drive based on... View Ming II Developed a flexible flash memory test bench for further research opportunities. Designed the flash controller in FPGA... View Graduate Research Assistant University of California at San Diego September 2010  –  June 2013  (2 years 10 months) Validating NAND flash memory power and latency models for SLC and MLC chips. Discovering and exploiting flash memory characteristics to improve solid-state disk performance. Developing an improved flash memory test bench for further research opportunities. Designing a high-performance flash controller for use in embedded systems and large storage arrays. (Open) 3 projects MacroScope Evaluating an FPGA-based cluster for solving data-intensive applications. The cluster consists of 32 FPGAs connected with a... View MARS Added hardware support for implementing novel atomic write primitive in a next-generation solid-state drive based on... View Ming II Developed a flexible flash memory test bench for further research opportunities. Designed the flash controller in FPGA... View Platforms Engineering Intern Google June 2011  –  September 2011  (4 months) Mountain View, CA Extended functionality of built-in self-test module for on-board DRAM. Developed, validated, and verified an SMBus slave module for host communication. Added support for CRC calculation in a high-performance storage system. Optimizations to storage system improved throughput by up to 3.72%. Platforms Engineering Intern Google June 2011  –  September 2011  (4 months) Mountain View, CA Extended functionality of built-in self-test module for on-board DRAM. Developed, validated, and verified an SMBus slave module for host communication. Added support for CRC calculation in a high-performance storage system. Optimizations to storage system improved throughput by up to 3.72%. Student Technical Assistant MIT Lincoln Laboratory March 2010  –  August 2010  (6 months) Developed high-performance and customizable digital signal processing algorithms for FPGAs. Designed software tools to allow easy customization and generation of hardware implementations. Student Technical Assistant MIT Lincoln Laboratory March 2010  –  August 2010  (6 months) Developed high-performance and customizable digital signal processing algorithms for FPGAs. Designed software tools to allow easy customization and generation of hardware implementations. Project Coordinator The Church of Jesus Christ of Latter-day Saints January 2010  –  February 2010  (2 months) Assisted Project Managers in working directly with customers in identifying requirements and setting expectations to maintain a high level of customer trust and confidence. Tracked and reported on project schedule, scope and budget aspects. Built and maintained project and operational reports. Project Coordinator The Church of Jesus Christ of Latter-day Saints January 2010  –  February 2010  (2 months) Assisted Project Managers in working directly with customers in identifying requirements and setting expectations to maintain a high level of customer trust and confidence. Tracked and reported on project schedule, scope and budget aspects. Built and maintained project and operational reports. Teaching Assistant Brigham Young University November 2009  –  December 2009  (2 months) Updated and defined interface for operating system design class project. Designing operating system to mirror true functionality, including separation of kernel and user modes. Developing reference solution for test benches. Teaching Assistant Brigham Young University November 2009  –  December 2009  (2 months) Updated and defined interface for operating system design class project. Designing operating system to mirror true functionality, including separation of kernel and user modes. Developing reference solution for test benches. Hardware Engineer Intern National Instruments June 2009  –  August 2009  (3 months) Received own assignment to design an in-house circuit board used to test PXI-Express signals. Generated, proposed, and selected concept alternatives. Performed research on alternative parts including meeting with representatives from major chip manufacturers. Designed board using Computer-Aided Design schematic tool. Assisted Layout Engineer with board stack-up, placement, and routing. Verified functionality of another board through comprehensive signal integrity tests. Hardware Engineer Intern National Instruments June 2009  –  August 2009  (3 months) Received own assignment to design an in-house circuit board used to test PXI-Express signals. Generated, proposed, and selected concept alternatives. Performed research on alternative parts including meeting with representatives from major chip manufacturers. Designed board using Computer-Aided Design schematic tool. Assisted Layout Engineer with board stack-up, placement, and routing. Verified functionality of another board through comprehensive signal integrity tests. Repair Technician Vantage Controls January 2008  –  August 2008  (8 months) Diagnosed damaged circuit boards by reading schematics and testing. Repaired damaged circuit boards through part replacement and soldering. Wrote and compiled comprehensive board testing and repair manuals. Repair Technician Vantage Controls January 2008  –  August 2008  (8 months) Diagnosed damaged circuit boards by reading schematics and testing. Repaired damaged circuit boards through part replacement and soldering. Wrote and compiled comprehensive board testing and repair manuals. Research Assistant Brigham Young University November 2006  –  October 2007  (1 year) Research Assistant – Brigham Young University, Chemistry Dept. \nPerformed simulations and testing of Virtual ChemLab and Virtual Physical Science, a virtual laboratory software tools developed by Dr. Brian Woodfield at BYU to assist students in laboratory experience. Wrote comprehensive help files and manuals for Virtual ChemLab and Virtual Physical Science Research Assistant Brigham Young University November 2006  –  October 2007  (1 year) Research Assistant – Brigham Young University, Chemistry Dept. \nPerformed simulations and testing of Virtual ChemLab and Virtual Physical Science, a virtual laboratory software tools developed by Dr. Brian Woodfield at BYU to assist students in laboratory experience. Wrote comprehensive help files and manuals for Virtual ChemLab and Virtual Physical Science Languages English Native or bilingual proficiency Spanish Professional working proficiency English Native or bilingual proficiency Spanish Professional working proficiency English Native or bilingual proficiency Spanish Professional working proficiency Native or bilingual proficiency Professional working proficiency Skills Top Skills 14 Computer Architecture 7 Verilog 7 FPGA 6 Embedded Systems 5 Programming 4 VHDL 4 C 3 C++ 3 Simulations 1 Xilinx ISE Trevor also knows about... 0 Digital System Design 0 FPGA prototyping 0 Altera Quartus 0 NAND Flash 0 Flash Drives 0 UVM 0 SystemVerilog 0 Digital IC Design 0 Static Timing Analysis 0 ARM Cortex-M3 0 Vim 0 NCSim 0 Eagle Scout Skills  Top Skills 14 Computer Architecture 7 Verilog 7 FPGA 6 Embedded Systems 5 Programming 4 VHDL 4 C 3 C++ 3 Simulations 1 Xilinx ISE Trevor also knows about... 0 Digital System Design 0 FPGA prototyping 0 Altera Quartus 0 NAND Flash 0 Flash Drives 0 UVM 0 SystemVerilog 0 Digital IC Design 0 Static Timing Analysis 0 ARM Cortex-M3 0 Vim 0 NCSim 0 Eagle Scout Top Skills 14 Computer Architecture 7 Verilog 7 FPGA 6 Embedded Systems 5 Programming 4 VHDL 4 C 3 C++ 3 Simulations 1 Xilinx ISE Trevor also knows about... 0 Digital System Design 0 FPGA prototyping 0 Altera Quartus 0 NAND Flash 0 Flash Drives 0 UVM 0 SystemVerilog 0 Digital IC Design 0 Static Timing Analysis 0 ARM Cortex-M3 0 Vim 0 NCSim 0 Eagle Scout Top Skills 14 Computer Architecture 7 Verilog 7 FPGA 6 Embedded Systems 5 Programming 4 VHDL 4 C 3 C++ 3 Simulations 1 Xilinx ISE Trevor also knows about... 0 Digital System Design 0 FPGA prototyping 0 Altera Quartus 0 NAND Flash 0 Flash Drives 0 UVM 0 SystemVerilog 0 Digital IC Design 0 Static Timing Analysis 0 ARM Cortex-M3 0 Vim 0 NCSim 0 Eagle Scout                     0 Digital System Design 0 FPGA prototyping 0 Altera Quartus 0 NAND Flash 0 Flash Drives 0 UVM 0 SystemVerilog 0 Digital IC Design 0 Static Timing Analysis 0 ARM Cortex-M3 0 Vim 0 NCSim 0 Eagle Scout Education University of California, San Diego Master of Science (MS),  Computer Engineering , 4.0 2010  – 2013 Activities and Societies:  Non-Volatile Systems Laboratory (Open) 8 courses Advanced Computer Architecture Advanced Parallel Architectures Advanced Microarchitecture Principles of Database Systems Advanced Compiler Design Principles of Programming Languages Operating Systems Algorithms and Analysis See more Brigham Young University Bachelor of Science (BS),  Computer Engineering , 3.92 2003  – 2009 Activities and Societies:  Eta Kappa Nu ,  Tau Beta Pi ,  Phi Kappa Phi ,  Golden Key (Open) 1 course Multiprocessor Programming and Verification See more University of California, San Diego Master of Science (MS),  Computer Engineering , 4.0 2010  – 2013 Activities and Societies:  Non-Volatile Systems Laboratory (Open) 8 courses Advanced Computer Architecture Advanced Parallel Architectures Advanced Microarchitecture Principles of Database Systems Advanced Compiler Design Principles of Programming Languages Operating Systems Algorithms and Analysis See more University of California, San Diego Master of Science (MS),  Computer Engineering , 4.0 2010  – 2013 Activities and Societies:  Non-Volatile Systems Laboratory (Open) 8 courses Advanced Computer Architecture Advanced Parallel Architectures Advanced Microarchitecture Principles of Database Systems Advanced Compiler Design Principles of Programming Languages Operating Systems Algorithms and Analysis See more University of California, San Diego Master of Science (MS),  Computer Engineering , 4.0 2010  – 2013 Activities and Societies:  Non-Volatile Systems Laboratory (Open) 8 courses Advanced Computer Architecture Advanced Parallel Architectures Advanced Microarchitecture Principles of Database Systems Advanced Compiler Design Principles of Programming Languages Operating Systems Algorithms and Analysis See more Brigham Young University Bachelor of Science (BS),  Computer Engineering , 3.92 2003  – 2009 Activities and Societies:  Eta Kappa Nu ,  Tau Beta Pi ,  Phi Kappa Phi ,  Golden Key (Open) 1 course Multiprocessor Programming and Verification See more Brigham Young University Bachelor of Science (BS),  Computer Engineering , 3.92 2003  – 2009 Activities and Societies:  Eta Kappa Nu ,  Tau Beta Pi ,  Phi Kappa Phi ,  Golden Key (Open) 1 course Multiprocessor Programming and Verification See more Brigham Young University Bachelor of Science (BS),  Computer Engineering , 3.92 2003  – 2009 Activities and Societies:  Eta Kappa Nu ,  Tau Beta Pi ,  Phi Kappa Phi ,  Golden Key (Open) 1 course Multiprocessor Programming and Verification See more Honors & Awards ", "Experience Hardware Engineer Google August 2014  – Present (1 year) Portland, Oregon Area Senior Platform Engineer NVIDIA June 2010  –  May 2014  (4 years) Beaverton, OR Platform Engineering Manager NVIDIA July 2006  –  June 2010  (4 years) Beaverton, OR Senior Platform Engineer NVIDIA July 2001  –  July 2006  (5 years 1 month) Beaverton, OR (Open) 1 recommendation Dave Landolf Board, FPGA, Firmware Design Engineer Jerry is a great board/system design engineer. I have seen him work through some very complex product specification situations involving multiple internal and external teams across geographic locations with outstanding results. He is also a natural... View Lead Hardware Engineer Intel Corporation January 2000  –  July 2001  (1 year 7 months) Hillsboro, OR Staff Hardware Engineer Intel Corporation January 1998  –  January 2000  (2 years 1 month) Hillsboro, OR Hardware Engineer Intel Corporation May 1995  –  January 1998  (2 years 9 months) Hillsboro, OR Hardware Engineer Google August 2014  – Present (1 year) Portland, Oregon Area Hardware Engineer Google August 2014  – Present (1 year) Portland, Oregon Area Senior Platform Engineer NVIDIA June 2010  –  May 2014  (4 years) Beaverton, OR Senior Platform Engineer NVIDIA June 2010  –  May 2014  (4 years) Beaverton, OR Platform Engineering Manager NVIDIA July 2006  –  June 2010  (4 years) Beaverton, OR Platform Engineering Manager NVIDIA July 2006  –  June 2010  (4 years) Beaverton, OR Senior Platform Engineer NVIDIA July 2001  –  July 2006  (5 years 1 month) Beaverton, OR (Open) 1 recommendation Dave Landolf Board, FPGA, Firmware Design Engineer Jerry is a great board/system design engineer. I have seen him work through some very complex product specification situations involving multiple internal and external teams across geographic locations with outstanding results. He is also a natural... View Senior Platform Engineer NVIDIA July 2001  –  July 2006  (5 years 1 month) Beaverton, OR (Open) 1 recommendation Dave Landolf Board, FPGA, Firmware Design Engineer Jerry is a great board/system design engineer. I have seen him work through some very complex product specification situations involving multiple internal and external teams across geographic locations with outstanding results. He is also a natural... View Lead Hardware Engineer Intel Corporation January 2000  –  July 2001  (1 year 7 months) Hillsboro, OR Lead Hardware Engineer Intel Corporation January 2000  –  July 2001  (1 year 7 months) Hillsboro, OR Staff Hardware Engineer Intel Corporation January 1998  –  January 2000  (2 years 1 month) Hillsboro, OR Staff Hardware Engineer Intel Corporation January 1998  –  January 2000  (2 years 1 month) Hillsboro, OR Hardware Engineer Intel Corporation May 1995  –  January 1998  (2 years 9 months) Hillsboro, OR Hardware Engineer Intel Corporation May 1995  –  January 1998  (2 years 9 months) Hillsboro, OR Skills Top Skills 14 Hardware 12 Debugging 10 Processors 10 Computer Architecture 9 PCIe 5 ASIC 5 Hardware Architecture 4 SoC 4 Signal Integrity 4 ARM Jerry also knows about... 4 Microprocessors 2 X86 2 PCB design 1 USB Skills  Top Skills 14 Hardware 12 Debugging 10 Processors 10 Computer Architecture 9 PCIe 5 ASIC 5 Hardware Architecture 4 SoC 4 Signal Integrity 4 ARM Jerry also knows about... 4 Microprocessors 2 X86 2 PCB design 1 USB Top Skills 14 Hardware 12 Debugging 10 Processors 10 Computer Architecture 9 PCIe 5 ASIC 5 Hardware Architecture 4 SoC 4 Signal Integrity 4 ARM Jerry also knows about... 4 Microprocessors 2 X86 2 PCB design 1 USB Top Skills 14 Hardware 12 Debugging 10 Processors 10 Computer Architecture 9 PCIe 5 ASIC 5 Hardware Architecture 4 SoC 4 Signal Integrity 4 ARM Jerry also knows about... 4 Microprocessors 2 X86 2 PCB design 1 USB                     4 Microprocessors 2 X86 2 PCB design 1 USB Education University of Portland BSEE University of Portland BSEE University of Portland BSEE University of Portland BSEE ", "Summary Eager participant in the relentless advancing world of technology \nI get my kicks seeing products I am involved in hit the market. \nOver 15 years of experience in mixed signal electronics system design. \nFluent in Mandarin and several Chinese dialects. \n \nSpecialties: \nBringing products from concept to the shelves in six months, or less.  \nManaging multicultural/cross-pacific system development effort. \nSystem integration in large multinational organization. Working in teams separated by functional groups, departments, geological locations, time-zones and cultures. \nTaking a product through its definition, design, development, engineering and production phase. \nAudio hardware implementation in noisy & space constraint systems. \nDesigning for high volume, steep ramp rate production. \nManaging vendor relationships. \nSOC System verification. \nSystem EMC issues. PCB layout. \nSystem architecture, partitioning, floorplanning. Summary Eager participant in the relentless advancing world of technology \nI get my kicks seeing products I am involved in hit the market. \nOver 15 years of experience in mixed signal electronics system design. \nFluent in Mandarin and several Chinese dialects. \n \nSpecialties: \nBringing products from concept to the shelves in six months, or less.  \nManaging multicultural/cross-pacific system development effort. \nSystem integration in large multinational organization. Working in teams separated by functional groups, departments, geological locations, time-zones and cultures. \nTaking a product through its definition, design, development, engineering and production phase. \nAudio hardware implementation in noisy & space constraint systems. \nDesigning for high volume, steep ramp rate production. \nManaging vendor relationships. \nSOC System verification. \nSystem EMC issues. PCB layout. \nSystem architecture, partitioning, floorplanning. Eager participant in the relentless advancing world of technology \nI get my kicks seeing products I am involved in hit the market. \nOver 15 years of experience in mixed signal electronics system design. \nFluent in Mandarin and several Chinese dialects. \n \nSpecialties: \nBringing products from concept to the shelves in six months, or less.  \nManaging multicultural/cross-pacific system development effort. \nSystem integration in large multinational organization. Working in teams separated by functional groups, departments, geological locations, time-zones and cultures. \nTaking a product through its definition, design, development, engineering and production phase. \nAudio hardware implementation in noisy & space constraint systems. \nDesigning for high volume, steep ramp rate production. \nManaging vendor relationships. \nSOC System verification. \nSystem EMC issues. PCB layout. \nSystem architecture, partitioning, floorplanning. Eager participant in the relentless advancing world of technology \nI get my kicks seeing products I am involved in hit the market. \nOver 15 years of experience in mixed signal electronics system design. \nFluent in Mandarin and several Chinese dialects. \n \nSpecialties: \nBringing products from concept to the shelves in six months, or less.  \nManaging multicultural/cross-pacific system development effort. \nSystem integration in large multinational organization. Working in teams separated by functional groups, departments, geological locations, time-zones and cultures. \nTaking a product through its definition, design, development, engineering and production phase. \nAudio hardware implementation in noisy & space constraint systems. \nDesigning for high volume, steep ramp rate production. \nManaging vendor relationships. \nSOC System verification. \nSystem EMC issues. PCB layout. \nSystem architecture, partitioning, floorplanning. Experience Staff Hardware Engineer Google November 2010  – Present (4 years 9 months) Mountain View, California Audio hardware architecture & roadmap for portable and embedded systems. \nConsumer audio systems design & development. \nWork with OEM, ODM, CM on integration of ChromeOS device audio subsystems. \nBuild out acoustic/audio development/validation infrastructure. \nDevelop manufacturing test infrastructure. \nProvide advisory guidance on audio features to product managers. \nMake great sound in tiny systems; Chromebook Pixel, Chromebooks Senior Audio Hardware Engineer Apple Inc September 2004  –  October 2010  (6 years 2 months) Design, develop & integrate audio into Macintosh portables (MacBook, MacBook Pro, MacBook Air), Apple TV & iPad1/2. \nCo-develop portable/low-power audio solutions with multiple audio component manufacturers. \nIntegrate audio hardware solutions into portable systems, squeezing maximum audio performance out of minimum cost. \nPioneered use of Class-D speaker amps in Apple products. \nPlan and mitigate system ground/return paths, audio RF susceptibility issues. \nManaging vendor &/vs contract manufacturer issues. \nConsult on production line audio test setup in China. \nTrain and oversee line engineers in failure analysis of audio subsystem at China contract manufacturer. \nDevelop audio subsystems roadmap for Macs. (Open) 2 recommendations Jason Liu Camera EPM at Apple Leng is very friendly yet very professional at his work. He is well capable of handling multiple tasks under pressure and... View Skip Orvis Head of Systems Development at Caeden, Inc. Leng's ability to multitask and re-prioritize on the fly makes him perfect for his role as a cross-functional design... View Senior Hardware Engineer Apple Computer September 2004  –  October 2010  (6 years 2 months) Audio subsystems Embedded Hardware Manager Creative Labs January 2001  –  September 2004  (3 years 9 months) Design and develop reference solution for external soundblaster SOC. \nDesign and develop verification platform for Soundblaster X-FI DSP/SOC. \nDeveloped and documented reference solution for X-Fi. \nWork with multi-cultural engineering teams stretching across the Pacific. \nManage embedded systems hardware verification & development group. (Open) 1 recommendation Pieris Berreitter Director of Electrical Engineering at Fitbit It's a rare treat to work with someone with such a warm and energetic personality. Leng is truly a great guy and a sharp engineer. View Design Engineer American Predator Corp (Corvalent) October 1998  –  December 2001  (3 years 3 months) Design Intel based motherboards that goes into mission critical embedded systems. eg x-ray, dialysis, cat scan machines, slot machines, industrial controllers. \nWork with Intel to design Pentium CPU's into form factors without reference designs, NLX, Full sized AT cards etc. \nWorked with and solved EMI/ESD issues in designs. \nWorked on signal integrity, high speed signal issues. Engineering Assistant Creative Technology Ltd 1993  –  1996  (3 years) Captured schematics. \nLaid out printed circuit boards for CDROM optical drives \nPrototype & build bring-ups. \nWorked with operations to set up pilot production line for CDROM drives. \nAssist engineers with FCC and compliance scans. (Open) 1 recommendation Mun Sing Loh Staff CAD Engineer I known Leng for more than 10 years. He is very discipline and serious about his work. Most of all, he is a very helpful and sharp person. View Technical Officer Singapore Polytechnic 1992  –  1993  (1 year) Manage the Singapore Polytechnic robotics lab. \nWorked with the robotics team to prepare for competition. \nDesigned and developed servo controller circuits for robotics team projects. Repairer Bosch Group May 1991  –  July 1991  (3 months) Worked in automotive radio production line. \nTroubleshoot and repair defective Blaupunkt radio. Staff Hardware Engineer Google November 2010  – Present (4 years 9 months) Mountain View, California Audio hardware architecture & roadmap for portable and embedded systems. \nConsumer audio systems design & development. \nWork with OEM, ODM, CM on integration of ChromeOS device audio subsystems. \nBuild out acoustic/audio development/validation infrastructure. \nDevelop manufacturing test infrastructure. \nProvide advisory guidance on audio features to product managers. \nMake great sound in tiny systems; Chromebook Pixel, Chromebooks Staff Hardware Engineer Google November 2010  – Present (4 years 9 months) Mountain View, California Audio hardware architecture & roadmap for portable and embedded systems. \nConsumer audio systems design & development. \nWork with OEM, ODM, CM on integration of ChromeOS device audio subsystems. \nBuild out acoustic/audio development/validation infrastructure. \nDevelop manufacturing test infrastructure. \nProvide advisory guidance on audio features to product managers. \nMake great sound in tiny systems; Chromebook Pixel, Chromebooks Senior Audio Hardware Engineer Apple Inc September 2004  –  October 2010  (6 years 2 months) Design, develop & integrate audio into Macintosh portables (MacBook, MacBook Pro, MacBook Air), Apple TV & iPad1/2. \nCo-develop portable/low-power audio solutions with multiple audio component manufacturers. \nIntegrate audio hardware solutions into portable systems, squeezing maximum audio performance out of minimum cost. \nPioneered use of Class-D speaker amps in Apple products. \nPlan and mitigate system ground/return paths, audio RF susceptibility issues. \nManaging vendor &/vs contract manufacturer issues. \nConsult on production line audio test setup in China. \nTrain and oversee line engineers in failure analysis of audio subsystem at China contract manufacturer. \nDevelop audio subsystems roadmap for Macs. (Open) 2 recommendations Jason Liu Camera EPM at Apple Leng is very friendly yet very professional at his work. He is well capable of handling multiple tasks under pressure and... View Skip Orvis Head of Systems Development at Caeden, Inc. Leng's ability to multitask and re-prioritize on the fly makes him perfect for his role as a cross-functional design... View Senior Audio Hardware Engineer Apple Inc September 2004  –  October 2010  (6 years 2 months) Design, develop & integrate audio into Macintosh portables (MacBook, MacBook Pro, MacBook Air), Apple TV & iPad1/2. \nCo-develop portable/low-power audio solutions with multiple audio component manufacturers. \nIntegrate audio hardware solutions into portable systems, squeezing maximum audio performance out of minimum cost. \nPioneered use of Class-D speaker amps in Apple products. \nPlan and mitigate system ground/return paths, audio RF susceptibility issues. \nManaging vendor &/vs contract manufacturer issues. \nConsult on production line audio test setup in China. \nTrain and oversee line engineers in failure analysis of audio subsystem at China contract manufacturer. \nDevelop audio subsystems roadmap for Macs. (Open) 2 recommendations Jason Liu Camera EPM at Apple Leng is very friendly yet very professional at his work. He is well capable of handling multiple tasks under pressure and... View Skip Orvis Head of Systems Development at Caeden, Inc. Leng's ability to multitask and re-prioritize on the fly makes him perfect for his role as a cross-functional design... View Senior Hardware Engineer Apple Computer September 2004  –  October 2010  (6 years 2 months) Audio subsystems Senior Hardware Engineer Apple Computer September 2004  –  October 2010  (6 years 2 months) Audio subsystems Embedded Hardware Manager Creative Labs January 2001  –  September 2004  (3 years 9 months) Design and develop reference solution for external soundblaster SOC. \nDesign and develop verification platform for Soundblaster X-FI DSP/SOC. \nDeveloped and documented reference solution for X-Fi. \nWork with multi-cultural engineering teams stretching across the Pacific. \nManage embedded systems hardware verification & development group. (Open) 1 recommendation Pieris Berreitter Director of Electrical Engineering at Fitbit It's a rare treat to work with someone with such a warm and energetic personality. Leng is truly a great guy and a sharp engineer. View Embedded Hardware Manager Creative Labs January 2001  –  September 2004  (3 years 9 months) Design and develop reference solution for external soundblaster SOC. \nDesign and develop verification platform for Soundblaster X-FI DSP/SOC. \nDeveloped and documented reference solution for X-Fi. \nWork with multi-cultural engineering teams stretching across the Pacific. \nManage embedded systems hardware verification & development group. (Open) 1 recommendation Pieris Berreitter Director of Electrical Engineering at Fitbit It's a rare treat to work with someone with such a warm and energetic personality. Leng is truly a great guy and a sharp engineer. View Design Engineer American Predator Corp (Corvalent) October 1998  –  December 2001  (3 years 3 months) Design Intel based motherboards that goes into mission critical embedded systems. eg x-ray, dialysis, cat scan machines, slot machines, industrial controllers. \nWork with Intel to design Pentium CPU's into form factors without reference designs, NLX, Full sized AT cards etc. \nWorked with and solved EMI/ESD issues in designs. \nWorked on signal integrity, high speed signal issues. Design Engineer American Predator Corp (Corvalent) October 1998  –  December 2001  (3 years 3 months) Design Intel based motherboards that goes into mission critical embedded systems. eg x-ray, dialysis, cat scan machines, slot machines, industrial controllers. \nWork with Intel to design Pentium CPU's into form factors without reference designs, NLX, Full sized AT cards etc. \nWorked with and solved EMI/ESD issues in designs. \nWorked on signal integrity, high speed signal issues. Engineering Assistant Creative Technology Ltd 1993  –  1996  (3 years) Captured schematics. \nLaid out printed circuit boards for CDROM optical drives \nPrototype & build bring-ups. \nWorked with operations to set up pilot production line for CDROM drives. \nAssist engineers with FCC and compliance scans. (Open) 1 recommendation Mun Sing Loh Staff CAD Engineer I known Leng for more than 10 years. He is very discipline and serious about his work. Most of all, he is a very helpful and sharp person. View Engineering Assistant Creative Technology Ltd 1993  –  1996  (3 years) Captured schematics. \nLaid out printed circuit boards for CDROM optical drives \nPrototype & build bring-ups. \nWorked with operations to set up pilot production line for CDROM drives. \nAssist engineers with FCC and compliance scans. (Open) 1 recommendation Mun Sing Loh Staff CAD Engineer I known Leng for more than 10 years. He is very discipline and serious about his work. Most of all, he is a very helpful and sharp person. View Technical Officer Singapore Polytechnic 1992  –  1993  (1 year) Manage the Singapore Polytechnic robotics lab. \nWorked with the robotics team to prepare for competition. \nDesigned and developed servo controller circuits for robotics team projects. Technical Officer Singapore Polytechnic 1992  –  1993  (1 year) Manage the Singapore Polytechnic robotics lab. \nWorked with the robotics team to prepare for competition. \nDesigned and developed servo controller circuits for robotics team projects. Repairer Bosch Group May 1991  –  July 1991  (3 months) Worked in automotive radio production line. \nTroubleshoot and repair defective Blaupunkt radio. Repairer Bosch Group May 1991  –  July 1991  (3 months) Worked in automotive radio production line. \nTroubleshoot and repair defective Blaupunkt radio. Languages English Mandarin Hokkien Malay Cantonese Teochew English Mandarin Hokkien Malay Cantonese Teochew English Mandarin Hokkien Malay Cantonese Teochew Skills Top Skills 92 Embedded Systems 75 Hardware Architecture 66 Electronics 53 Hardware 52 PCB design 39 Testing 36 Debugging 26 System Architecture 24 Consumer Electronics 21 Digital Signal... Leng also knows about... 18 Semiconductors 16 PCB Design 15 SoC 14 Processors 13 Audio Engineering 12 Sound 12 Cross-functional Team... 10 ASIC 9 Integration 8 Engineering 8 ARM 7 Analog 6 RF 6 Manufacturing 5 Embedded Software 4 Audio hardware 4 FPGA 4 System Design 3 EMC design 3 Floorplanning 2 Vendor Relationships 1 Systems Design See 7+     See less Skills  Top Skills 92 Embedded Systems 75 Hardware Architecture 66 Electronics 53 Hardware 52 PCB design 39 Testing 36 Debugging 26 System Architecture 24 Consumer Electronics 21 Digital Signal... Leng also knows about... 18 Semiconductors 16 PCB Design 15 SoC 14 Processors 13 Audio Engineering 12 Sound 12 Cross-functional Team... 10 ASIC 9 Integration 8 Engineering 8 ARM 7 Analog 6 RF 6 Manufacturing 5 Embedded Software 4 Audio hardware 4 FPGA 4 System Design 3 EMC design 3 Floorplanning 2 Vendor Relationships 1 Systems Design See 7+     See less Top Skills 92 Embedded Systems 75 Hardware Architecture 66 Electronics 53 Hardware 52 PCB design 39 Testing 36 Debugging 26 System Architecture 24 Consumer Electronics 21 Digital Signal... Leng also knows about... 18 Semiconductors 16 PCB Design 15 SoC 14 Processors 13 Audio Engineering 12 Sound 12 Cross-functional Team... 10 ASIC 9 Integration 8 Engineering 8 ARM 7 Analog 6 RF 6 Manufacturing 5 Embedded Software 4 Audio hardware 4 FPGA 4 System Design 3 EMC design 3 Floorplanning 2 Vendor Relationships 1 Systems Design See 7+     See less Top Skills 92 Embedded Systems 75 Hardware Architecture 66 Electronics 53 Hardware 52 PCB design 39 Testing 36 Debugging 26 System Architecture 24 Consumer Electronics 21 Digital Signal... Leng also knows about... 18 Semiconductors 16 PCB Design 15 SoC 14 Processors 13 Audio Engineering 12 Sound 12 Cross-functional Team... 10 ASIC 9 Integration 8 Engineering 8 ARM 7 Analog 6 RF 6 Manufacturing 5 Embedded Software 4 Audio hardware 4 FPGA 4 System Design 3 EMC design 3 Floorplanning 2 Vendor Relationships 1 Systems Design See 7+     See less                     18 Semiconductors 16 PCB Design 15 SoC 14 Processors 13 Audio Engineering 12 Sound 12 Cross-functional Team... 10 ASIC 9 Integration 8 Engineering 8 ARM 7 Analog 6 RF 6 Manufacturing 5 Embedded Software 4 Audio hardware 4 FPGA 4 System Design 3 EMC design 3 Floorplanning 2 Vendor Relationships 1 Systems Design Education The University of Manchester B. Eng (Hons),  Electronics 1996  – 1998 Webmaster Activities and Societies:  Singapore Student Society of Manchester ,  Malaysian Student Society of Manchester The University of Manchester B.Eng,  Electronics 1996  – 1998 Electronics Engineering Activities and Societies:  Student society ,  ftp site hosting ,  webmaster Singapore Polytechnic Assoc Degree,  Electronics & Communication 1989  – 1992 Team leader for robotics group. Activities and Societies:  Robotics Team ,  Obstacle Avoidance Robot group. Tunku Abdul Rahman Technical Institute Senior High,  Mechanical 1988  – 1989 Secretary/Scribe (Scout), President (Electronics Society), Treasurer (Computer Club) Activities and Societies:  Scout ,  Electronics Club ,  Computer Club ,  School Choir Chung Ling High School Junior High 1984  – 1987 Patrol Leader, Computer Society Editor/Secretary Activities and Societies:  Scout ,  Computer Society Kong Min Main School Elementary school 1977  – 1983 Activities and Societies:  Cub scout ,  School band. The University of Manchester B. Eng (Hons),  Electronics 1996  – 1998 Webmaster Activities and Societies:  Singapore Student Society of Manchester ,  Malaysian Student Society of Manchester The University of Manchester B. Eng (Hons),  Electronics 1996  – 1998 Webmaster Activities and Societies:  Singapore Student Society of Manchester ,  Malaysian Student Society of Manchester The University of Manchester B. Eng (Hons),  Electronics 1996  – 1998 Webmaster Activities and Societies:  Singapore Student Society of Manchester ,  Malaysian Student Society of Manchester The University of Manchester B.Eng,  Electronics 1996  – 1998 Electronics Engineering Activities and Societies:  Student society ,  ftp site hosting ,  webmaster The University of Manchester B.Eng,  Electronics 1996  – 1998 Electronics Engineering Activities and Societies:  Student society ,  ftp site hosting ,  webmaster The University of Manchester B.Eng,  Electronics 1996  – 1998 Electronics Engineering Activities and Societies:  Student society ,  ftp site hosting ,  webmaster Singapore Polytechnic Assoc Degree,  Electronics & Communication 1989  – 1992 Team leader for robotics group. Activities and Societies:  Robotics Team ,  Obstacle Avoidance Robot group. Singapore Polytechnic Assoc Degree,  Electronics & Communication 1989  – 1992 Team leader for robotics group. Activities and Societies:  Robotics Team ,  Obstacle Avoidance Robot group. Singapore Polytechnic Assoc Degree,  Electronics & Communication 1989  – 1992 Team leader for robotics group. Activities and Societies:  Robotics Team ,  Obstacle Avoidance Robot group. Tunku Abdul Rahman Technical Institute Senior High,  Mechanical 1988  – 1989 Secretary/Scribe (Scout), President (Electronics Society), Treasurer (Computer Club) Activities and Societies:  Scout ,  Electronics Club ,  Computer Club ,  School Choir Tunku Abdul Rahman Technical Institute Senior High,  Mechanical 1988  – 1989 Secretary/Scribe (Scout), President (Electronics Society), Treasurer (Computer Club) Activities and Societies:  Scout ,  Electronics Club ,  Computer Club ,  School Choir Tunku Abdul Rahman Technical Institute Senior High,  Mechanical 1988  – 1989 Secretary/Scribe (Scout), President (Electronics Society), Treasurer (Computer Club) Activities and Societies:  Scout ,  Electronics Club ,  Computer Club ,  School Choir Chung Ling High School Junior High 1984  – 1987 Patrol Leader, Computer Society Editor/Secretary Activities and Societies:  Scout ,  Computer Society Chung Ling High School Junior High 1984  – 1987 Patrol Leader, Computer Society Editor/Secretary Activities and Societies:  Scout ,  Computer Society Chung Ling High School Junior High 1984  – 1987 Patrol Leader, Computer Society Editor/Secretary Activities and Societies:  Scout ,  Computer Society Kong Min Main School Elementary school 1977  – 1983 Activities and Societies:  Cub scout ,  School band. Kong Min Main School Elementary school 1977  – 1983 Activities and Societies:  Cub scout ,  School band. Kong Min Main School Elementary school 1977  – 1983 Activities and Societies:  Cub scout ,  School band. ", "Summary A results-oriented Hardware Engineer and Manager, with a proven track record of leading diverse development teams and delivering high quality designs. Two years of technical management and eight years of team leadership experience. \nA well-organized, effective communicator who thrives in a collaborative team environment. Talent for optimizing work flows for quality and efficiency.  \nStrengths include: \n-- Technical Management \n-- Project Management \n-- High-Speed Board Design \n-- Signal Integrity \n-- System Architecture \n-- High Availability Design \n-- Ethernet, TCP/IP, SONET \n-- Video and Voice Systems \n-- FPGA Design Summary A results-oriented Hardware Engineer and Manager, with a proven track record of leading diverse development teams and delivering high quality designs. Two years of technical management and eight years of team leadership experience. \nA well-organized, effective communicator who thrives in a collaborative team environment. Talent for optimizing work flows for quality and efficiency.  \nStrengths include: \n-- Technical Management \n-- Project Management \n-- High-Speed Board Design \n-- Signal Integrity \n-- System Architecture \n-- High Availability Design \n-- Ethernet, TCP/IP, SONET \n-- Video and Voice Systems \n-- FPGA Design A results-oriented Hardware Engineer and Manager, with a proven track record of leading diverse development teams and delivering high quality designs. Two years of technical management and eight years of team leadership experience. \nA well-organized, effective communicator who thrives in a collaborative team environment. Talent for optimizing work flows for quality and efficiency.  \nStrengths include: \n-- Technical Management \n-- Project Management \n-- High-Speed Board Design \n-- Signal Integrity \n-- System Architecture \n-- High Availability Design \n-- Ethernet, TCP/IP, SONET \n-- Video and Voice Systems \n-- FPGA Design A results-oriented Hardware Engineer and Manager, with a proven track record of leading diverse development teams and delivering high quality designs. Two years of technical management and eight years of team leadership experience. \nA well-organized, effective communicator who thrives in a collaborative team environment. Talent for optimizing work flows for quality and efficiency.  \nStrengths include: \n-- Technical Management \n-- Project Management \n-- High-Speed Board Design \n-- Signal Integrity \n-- System Architecture \n-- High Availability Design \n-- Ethernet, TCP/IP, SONET \n-- Video and Voice Systems \n-- FPGA Design Experience Senior Hardware Engineer Google October 2012  – Present (2 years 10 months) Manager, Hardware Engineering Cisco Systems December 2010  –  September 2012  (1 year 10 months) Responsible for development and sustaining activities for all of the Media Experience and Analytics Business Unit’s hardware deliverables, including the MXE-5600 modular chassis platform and multiple Intel-based appliance platforms. (Open) 1 recommendation Chuck Byers System Architect and Modular Platform Expert Mike and I worked together as colleagues during the architecture, development and evolutionary planning phases of the Media Experience Engine 5600. He is one of the strongest hardware professionals I have encountered. He has exceptional... View Technical Leader, Hardware Engineering Cisco Systems January 2008  –  December 2010  (3 years) Joined small startup-like Business Unit to architect, design and deliver the new MXE-5600 Media Processing Platform. (Open) 1 recommendation David Pearson Director, Lamp Engineering at Soraa Mike reported to me at Ditech Networks, and joined my team at Cisco shortly after my move there. During those ten years, Mike progressed from a top-notch individual contributor to a seasoned and professional leader. He has repeatedly demonstrated... View Principal Hardware Engineer Ditech Networks / Altamar Networks August 2000  –  January 2008  (7 years 6 months) Adaptable team member serving, as needed, the roles of project manager, architect and board designer. Senior Hardware Engineer Atmosphere Networks March 1999  –  July 2000  (1 year 5 months) Quickly became a valuable contributor to an international hardware development team. Senior Research & Development Engineer Space Systems / Loral October 1993  –  March 1999  (5 years 6 months) Rapidly promoted to position of responsibility for the specification, design, and testing of digital circuits for use in satellite processor subsystems. Senior Hardware Engineer Google October 2012  – Present (2 years 10 months) Senior Hardware Engineer Google October 2012  – Present (2 years 10 months) Manager, Hardware Engineering Cisco Systems December 2010  –  September 2012  (1 year 10 months) Responsible for development and sustaining activities for all of the Media Experience and Analytics Business Unit’s hardware deliverables, including the MXE-5600 modular chassis platform and multiple Intel-based appliance platforms. (Open) 1 recommendation Chuck Byers System Architect and Modular Platform Expert Mike and I worked together as colleagues during the architecture, development and evolutionary planning phases of the Media Experience Engine 5600. He is one of the strongest hardware professionals I have encountered. He has exceptional... View Manager, Hardware Engineering Cisco Systems December 2010  –  September 2012  (1 year 10 months) Responsible for development and sustaining activities for all of the Media Experience and Analytics Business Unit’s hardware deliverables, including the MXE-5600 modular chassis platform and multiple Intel-based appliance platforms. (Open) 1 recommendation Chuck Byers System Architect and Modular Platform Expert Mike and I worked together as colleagues during the architecture, development and evolutionary planning phases of the Media Experience Engine 5600. He is one of the strongest hardware professionals I have encountered. He has exceptional... View Technical Leader, Hardware Engineering Cisco Systems January 2008  –  December 2010  (3 years) Joined small startup-like Business Unit to architect, design and deliver the new MXE-5600 Media Processing Platform. (Open) 1 recommendation David Pearson Director, Lamp Engineering at Soraa Mike reported to me at Ditech Networks, and joined my team at Cisco shortly after my move there. During those ten years, Mike progressed from a top-notch individual contributor to a seasoned and professional leader. He has repeatedly demonstrated... View Technical Leader, Hardware Engineering Cisco Systems January 2008  –  December 2010  (3 years) Joined small startup-like Business Unit to architect, design and deliver the new MXE-5600 Media Processing Platform. (Open) 1 recommendation David Pearson Director, Lamp Engineering at Soraa Mike reported to me at Ditech Networks, and joined my team at Cisco shortly after my move there. During those ten years, Mike progressed from a top-notch individual contributor to a seasoned and professional leader. He has repeatedly demonstrated... View Principal Hardware Engineer Ditech Networks / Altamar Networks August 2000  –  January 2008  (7 years 6 months) Adaptable team member serving, as needed, the roles of project manager, architect and board designer. Principal Hardware Engineer Ditech Networks / Altamar Networks August 2000  –  January 2008  (7 years 6 months) Adaptable team member serving, as needed, the roles of project manager, architect and board designer. Senior Hardware Engineer Atmosphere Networks March 1999  –  July 2000  (1 year 5 months) Quickly became a valuable contributor to an international hardware development team. Senior Hardware Engineer Atmosphere Networks March 1999  –  July 2000  (1 year 5 months) Quickly became a valuable contributor to an international hardware development team. Senior Research & Development Engineer Space Systems / Loral October 1993  –  March 1999  (5 years 6 months) Rapidly promoted to position of responsibility for the specification, design, and testing of digital circuits for use in satellite processor subsystems. Senior Research & Development Engineer Space Systems / Loral October 1993  –  March 1999  (5 years 6 months) Rapidly promoted to position of responsibility for the specification, design, and testing of digital circuits for use in satellite processor subsystems. Skills Top Skills 25 Hardware 21 FPGA 18 System Architecture 17 Embedded Systems 10 Ethernet 10 Signal Integrity 9 Product Development 7 Firmware 7 Telecommunications 6 Digital Signal... Mike also knows about... 5 TCP/IP 4 TCL 4 VoIP 4 Hardware Architecture 3 Perl 3 Technical Leadership 3 Engineering Management 3 Embedded Software 2 ATCA 2 PCB design 2 Video Conferencing 1 Switches 1 Offshore Outsourcing 0 ATM networks 0 AMC Skills  Top Skills 25 Hardware 21 FPGA 18 System Architecture 17 Embedded Systems 10 Ethernet 10 Signal Integrity 9 Product Development 7 Firmware 7 Telecommunications 6 Digital Signal... Mike also knows about... 5 TCP/IP 4 TCL 4 VoIP 4 Hardware Architecture 3 Perl 3 Technical Leadership 3 Engineering Management 3 Embedded Software 2 ATCA 2 PCB design 2 Video Conferencing 1 Switches 1 Offshore Outsourcing 0 ATM networks 0 AMC Top Skills 25 Hardware 21 FPGA 18 System Architecture 17 Embedded Systems 10 Ethernet 10 Signal Integrity 9 Product Development 7 Firmware 7 Telecommunications 6 Digital Signal... Mike also knows about... 5 TCP/IP 4 TCL 4 VoIP 4 Hardware Architecture 3 Perl 3 Technical Leadership 3 Engineering Management 3 Embedded Software 2 ATCA 2 PCB design 2 Video Conferencing 1 Switches 1 Offshore Outsourcing 0 ATM networks 0 AMC Top Skills 25 Hardware 21 FPGA 18 System Architecture 17 Embedded Systems 10 Ethernet 10 Signal Integrity 9 Product Development 7 Firmware 7 Telecommunications 6 Digital Signal... Mike also knows about... 5 TCP/IP 4 TCL 4 VoIP 4 Hardware Architecture 3 Perl 3 Technical Leadership 3 Engineering Management 3 Embedded Software 2 ATCA 2 PCB design 2 Video Conferencing 1 Switches 1 Offshore Outsourcing 0 ATM networks 0 AMC                     5 TCP/IP 4 TCL 4 VoIP 4 Hardware Architecture 3 Perl 3 Technical Leadership 3 Engineering Management 3 Embedded Software 2 ATCA 2 PCB design 2 Video Conferencing 1 Switches 1 Offshore Outsourcing 0 ATM networks 0 AMC Education California Polytechnic State University-San Luis Obispo BSEE Santa Clara University MSEE California Polytechnic State University-San Luis Obispo BSEE California Polytechnic State University-San Luis Obispo BSEE California Polytechnic State University-San Luis Obispo BSEE Santa Clara University MSEE Santa Clara University MSEE Santa Clara University MSEE ", "Experience Hardware Engineer Google February 2014  – Present (1 year 6 months) Hardware Engineer Intel Corporation May 2012  –  February 2014  (1 year 10 months) Hardware Engineer Cray Inc. November 2008  –  May 2012  (3 years 7 months) Austin, Texas Area MTS Design Engineer Advanced Micro Devices November 2005  –  November 2008  (3 years 1 month) Hardware Engineer Cray Inc. February 1999  –  October 2005  (6 years 9 months) Hardware Engineer Google February 2014  – Present (1 year 6 months) Hardware Engineer Google February 2014  – Present (1 year 6 months) Hardware Engineer Intel Corporation May 2012  –  February 2014  (1 year 10 months) Hardware Engineer Intel Corporation May 2012  –  February 2014  (1 year 10 months) Hardware Engineer Cray Inc. November 2008  –  May 2012  (3 years 7 months) Austin, Texas Area Hardware Engineer Cray Inc. November 2008  –  May 2012  (3 years 7 months) Austin, Texas Area MTS Design Engineer Advanced Micro Devices November 2005  –  November 2008  (3 years 1 month) MTS Design Engineer Advanced Micro Devices November 2005  –  November 2008  (3 years 1 month) Hardware Engineer Cray Inc. February 1999  –  October 2005  (6 years 9 months) Hardware Engineer Cray Inc. February 1999  –  October 2005  (6 years 9 months) Skills Top Skills 9 Verilog 6 SystemVerilog 5 Computer Architecture 5 Hardware 4 ASIC 3 Functional Verification 3 Microprocessors 2 Hardware Architecture 2 Logic Design 1 High Performance... Jack also knows about... 1 Debugging 1 Processors 1 SoC 1 RTL design 1 FPGA Skills  Top Skills 9 Verilog 6 SystemVerilog 5 Computer Architecture 5 Hardware 4 ASIC 3 Functional Verification 3 Microprocessors 2 Hardware Architecture 2 Logic Design 1 High Performance... Jack also knows about... 1 Debugging 1 Processors 1 SoC 1 RTL design 1 FPGA Top Skills 9 Verilog 6 SystemVerilog 5 Computer Architecture 5 Hardware 4 ASIC 3 Functional Verification 3 Microprocessors 2 Hardware Architecture 2 Logic Design 1 High Performance... Jack also knows about... 1 Debugging 1 Processors 1 SoC 1 RTL design 1 FPGA Top Skills 9 Verilog 6 SystemVerilog 5 Computer Architecture 5 Hardware 4 ASIC 3 Functional Verification 3 Microprocessors 2 Hardware Architecture 2 Logic Design 1 High Performance... Jack also knows about... 1 Debugging 1 Processors 1 SoC 1 RTL design 1 FPGA                     1 Debugging 1 Processors 1 SoC 1 RTL design 1 FPGA Education University of Illinois at Urbana-Champaign Computer Engineering University of Illinois at Urbana-Champaign Computer Engineering University of Illinois at Urbana-Champaign Computer Engineering University of Illinois at Urbana-Champaign Computer Engineering ", "Experience Staff Network Engineer Google September 2011  – Present (3 years 11 months) Mountain View, CA Network architecture and design (datacenter, metro and long-haul) \nOptical interconnect/transport technology innovation \nStrategic planning and business case analysis Senior Network Engineer Google March 2010  –  September 2011  (1 year 7 months) Mountain View, CA Network architecture \nMetro area network design \nDatacenter network design \nNetwork innovations (Open) 1 recommendation Vijay Gill Cloud Services, Distributed Systems, and Infrastructure Engineering Wendy was one of the best \"fast learners\" I've ever had the opportunity to work with. She came into the network architecture group from her previous group where she was testing optics and in a few months was a key component of the network... View Network Engineer Google July 2009  –  March 2010  (9 months) Mountain View Metro-area network design and qualification \nOptical long-haul network design and planning Hardware Engineer Google September 2008  –  July 2009  (11 months) Mountain View, CA Digital system design \nhigh-speed signaling design \noptical interconnect design Staff Network Engineer Google September 2011  – Present (3 years 11 months) Mountain View, CA Network architecture and design (datacenter, metro and long-haul) \nOptical interconnect/transport technology innovation \nStrategic planning and business case analysis Staff Network Engineer Google September 2011  – Present (3 years 11 months) Mountain View, CA Network architecture and design (datacenter, metro and long-haul) \nOptical interconnect/transport technology innovation \nStrategic planning and business case analysis Senior Network Engineer Google March 2010  –  September 2011  (1 year 7 months) Mountain View, CA Network architecture \nMetro area network design \nDatacenter network design \nNetwork innovations (Open) 1 recommendation Vijay Gill Cloud Services, Distributed Systems, and Infrastructure Engineering Wendy was one of the best \"fast learners\" I've ever had the opportunity to work with. She came into the network architecture group from her previous group where she was testing optics and in a few months was a key component of the network... View Senior Network Engineer Google March 2010  –  September 2011  (1 year 7 months) Mountain View, CA Network architecture \nMetro area network design \nDatacenter network design \nNetwork innovations (Open) 1 recommendation Vijay Gill Cloud Services, Distributed Systems, and Infrastructure Engineering Wendy was one of the best \"fast learners\" I've ever had the opportunity to work with. She came into the network architecture group from her previous group where she was testing optics and in a few months was a key component of the network... View Network Engineer Google July 2009  –  March 2010  (9 months) Mountain View Metro-area network design and qualification \nOptical long-haul network design and planning Network Engineer Google July 2009  –  March 2010  (9 months) Mountain View Metro-area network design and qualification \nOptical long-haul network design and planning Hardware Engineer Google September 2008  –  July 2009  (11 months) Mountain View, CA Digital system design \nhigh-speed signaling design \noptical interconnect design Hardware Engineer Google September 2008  –  July 2009  (11 months) Mountain View, CA Digital system design \nhigh-speed signaling design \noptical interconnect design Skills Top Skills 14 Network Design 12 Network Architecture 10 Data Center 6 Optical Fiber 5 Optical Communications 5 Hardware 4 Networking 4 Cloud Computing 3 Semiconductors 3 Ethernet Wendy Xiaoxue also knows about... 3 IP 2 Architecture 2 Testing 2 Product Management 2 Routing 1 Data Center Architecture 1 Systems Engineering Skills  Top Skills 14 Network Design 12 Network Architecture 10 Data Center 6 Optical Fiber 5 Optical Communications 5 Hardware 4 Networking 4 Cloud Computing 3 Semiconductors 3 Ethernet Wendy Xiaoxue also knows about... 3 IP 2 Architecture 2 Testing 2 Product Management 2 Routing 1 Data Center Architecture 1 Systems Engineering Top Skills 14 Network Design 12 Network Architecture 10 Data Center 6 Optical Fiber 5 Optical Communications 5 Hardware 4 Networking 4 Cloud Computing 3 Semiconductors 3 Ethernet Wendy Xiaoxue also knows about... 3 IP 2 Architecture 2 Testing 2 Product Management 2 Routing 1 Data Center Architecture 1 Systems Engineering Top Skills 14 Network Design 12 Network Architecture 10 Data Center 6 Optical Fiber 5 Optical Communications 5 Hardware 4 Networking 4 Cloud Computing 3 Semiconductors 3 Ethernet Wendy Xiaoxue also knows about... 3 IP 2 Architecture 2 Testing 2 Product Management 2 Routing 1 Data Center Architecture 1 Systems Engineering                     3 IP 2 Architecture 2 Testing 2 Product Management 2 Routing 1 Data Center Architecture 1 Systems Engineering Education UC Berkeley PhD,  EE 2003  – 2008 Activities and Societies:  IEEE Photonics Society ,  OSA Student Chapter lead ,  WICSE Peking University BS,  Electronics 1999  – 2003 UC Berkeley PhD,  EE 2003  – 2008 Activities and Societies:  IEEE Photonics Society ,  OSA Student Chapter lead ,  WICSE UC Berkeley PhD,  EE 2003  – 2008 Activities and Societies:  IEEE Photonics Society ,  OSA Student Chapter lead ,  WICSE UC Berkeley PhD,  EE 2003  – 2008 Activities and Societies:  IEEE Photonics Society ,  OSA Student Chapter lead ,  WICSE Peking University BS,  Electronics 1999  – 2003 Peking University BS,  Electronics 1999  – 2003 Peking University BS,  Electronics 1999  – 2003 ", "Summary Goals: I'm fascinated by waves, be they RF, Microwave, Optical, or acoustic. --and the development of hardware for making detailed observations and manipulations of those waves. From sensor to display, and from bits to waves and back, I'm enthusiastically seeking active engagement in the development of new tools.  \n \nMy professional background is widely varied, including these more recent experiences: \n-- Software defined radio implementation in FPGA fabric, using higher order languages (Synopsis SynplifyDSP, Xilinx System Generator, Matlab/Simulink) \n-- Extensive development of automated test hardware and software in a hi-rel development lab environment, using LabView and Matlab \n-- Communication Systems and Hardware development, including link budget analyses, hardware modeling, and laboratory test \n \nI'm especially interested in the development of hardware for unique installation environments, e.g., in space, at sea, or at extreme polar latitudes. \n \nAreas that I would like to further explore include the development of radar, sonar, or GPS hardware, and or the analysis and processing of the signals involved in such hardware. Specialties:-- Matlab/Simulink Expert with 20 years experience in hardware development, simulation, and physical modeling \n-- RF/Microwave Design \n-- Comm/DSP algorithm implementation in FPGA hardware using HOL tools such as SynplifyDSP and Xilinx System Generator, including Hardware-in-the-Loop development \n-- RF/Microwave/Digital Laboratory test & automation using Labview and/or Matlab Summary Goals: I'm fascinated by waves, be they RF, Microwave, Optical, or acoustic. --and the development of hardware for making detailed observations and manipulations of those waves. From sensor to display, and from bits to waves and back, I'm enthusiastically seeking active engagement in the development of new tools.  \n \nMy professional background is widely varied, including these more recent experiences: \n-- Software defined radio implementation in FPGA fabric, using higher order languages (Synopsis SynplifyDSP, Xilinx System Generator, Matlab/Simulink) \n-- Extensive development of automated test hardware and software in a hi-rel development lab environment, using LabView and Matlab \n-- Communication Systems and Hardware development, including link budget analyses, hardware modeling, and laboratory test \n \nI'm especially interested in the development of hardware for unique installation environments, e.g., in space, at sea, or at extreme polar latitudes. \n \nAreas that I would like to further explore include the development of radar, sonar, or GPS hardware, and or the analysis and processing of the signals involved in such hardware. Specialties:-- Matlab/Simulink Expert with 20 years experience in hardware development, simulation, and physical modeling \n-- RF/Microwave Design \n-- Comm/DSP algorithm implementation in FPGA hardware using HOL tools such as SynplifyDSP and Xilinx System Generator, including Hardware-in-the-Loop development \n-- RF/Microwave/Digital Laboratory test & automation using Labview and/or Matlab Goals: I'm fascinated by waves, be they RF, Microwave, Optical, or acoustic. --and the development of hardware for making detailed observations and manipulations of those waves. From sensor to display, and from bits to waves and back, I'm enthusiastically seeking active engagement in the development of new tools.  \n \nMy professional background is widely varied, including these more recent experiences: \n-- Software defined radio implementation in FPGA fabric, using higher order languages (Synopsis SynplifyDSP, Xilinx System Generator, Matlab/Simulink) \n-- Extensive development of automated test hardware and software in a hi-rel development lab environment, using LabView and Matlab \n-- Communication Systems and Hardware development, including link budget analyses, hardware modeling, and laboratory test \n \nI'm especially interested in the development of hardware for unique installation environments, e.g., in space, at sea, or at extreme polar latitudes. \n \nAreas that I would like to further explore include the development of radar, sonar, or GPS hardware, and or the analysis and processing of the signals involved in such hardware. Specialties:-- Matlab/Simulink Expert with 20 years experience in hardware development, simulation, and physical modeling \n-- RF/Microwave Design \n-- Comm/DSP algorithm implementation in FPGA hardware using HOL tools such as SynplifyDSP and Xilinx System Generator, including Hardware-in-the-Loop development \n-- RF/Microwave/Digital Laboratory test & automation using Labview and/or Matlab Goals: I'm fascinated by waves, be they RF, Microwave, Optical, or acoustic. --and the development of hardware for making detailed observations and manipulations of those waves. From sensor to display, and from bits to waves and back, I'm enthusiastically seeking active engagement in the development of new tools.  \n \nMy professional background is widely varied, including these more recent experiences: \n-- Software defined radio implementation in FPGA fabric, using higher order languages (Synopsis SynplifyDSP, Xilinx System Generator, Matlab/Simulink) \n-- Extensive development of automated test hardware and software in a hi-rel development lab environment, using LabView and Matlab \n-- Communication Systems and Hardware development, including link budget analyses, hardware modeling, and laboratory test \n \nI'm especially interested in the development of hardware for unique installation environments, e.g., in space, at sea, or at extreme polar latitudes. \n \nAreas that I would like to further explore include the development of radar, sonar, or GPS hardware, and or the analysis and processing of the signals involved in such hardware. Specialties:-- Matlab/Simulink Expert with 20 years experience in hardware development, simulation, and physical modeling \n-- RF/Microwave Design \n-- Comm/DSP algorithm implementation in FPGA hardware using HOL tools such as SynplifyDSP and Xilinx System Generator, including Hardware-in-the-Loop development \n-- RF/Microwave/Digital Laboratory test & automation using Labview and/or Matlab Experience Sr. Hardware Engineer Google [x] July 2015  – Present (1 month) Sr. Hardware Engineer at Google[x] Hardware Test Engineer Google [x] January 2014  –  June 2015  (1 year 6 months) Mountain View, CA Hardware Test Engineer at Google[x] Hardware Engineer SEAKR Engineering November 2010  –  August 2013  (2 years 10 months) Centennial, CO -- Development of communications system algorithms, and their implementation in FPGA fabric, using Matlab, Simulink, and System Generator, including hardware-in-the-loop simulation. \n-- Test hardware/software development for satellite communications hardware, using a combination of FPGA hardware, National Instruments PXIe gear including Vector Signal Analyzers/Generators, and LabView. \n-- Development of custom FPGA hardware algorithms for test signal generation and capture, in support of flight hardware test DSP/Systems Engineer SAIC June 2007  –  January 2011  (3 years 8 months) -- Developed and implemented software defined radio algorithms in FPGA fabric, for hi-rel environments \n-- Followed the hardware through build, test, and delivery, assuming the role of hardware test lead \n-- Developed an extensive automated test suite for delivering consistent and repeatable hardware performance and verification measurements \n-- Performed extensive post-test analysis and data reduction of the large data sets produced by the hardware testing process, for customer presentation (Open) 1 recommendation Rand Ringwald Chief Engineer, RF Systems at SAIC On a recent space Hi-Rel development program at SAIC, Jon contributed enormously to our success. Jon solved diverse technical challenges and provided deliverables using his skills in RF, RTL Coding, communications systems analysis and simulation,... View Sr. Electrical Engineer Lockheed-Martin November 2003  –  May 2007  (3 years 7 months) -- DSP algorithm implementation in FPGA fabric \n-- Development and automation of laboratory test hardware, systems. Hardware test procedure development and implementation, including post-test results analysis \n-- Communications hardware and physical systems modeling in Matlab, Simulink, and Orcad Pspice \n-- Design, review, and revision of communications hardware at the PCB level Technical Staff Member Jet Propulsion Laboratory August 2000  –  September 2003  (3 years 2 months) RF/Microwave design & analysis position, involved with a wide variety of communication systems & projects. Sr. Communications Technician Raytheon Polar Services Co. August 2001  –  November 2002  (1 year 4 months) Winter-over Satellite communications technician responsible for maintenance and upkeep of satellite ground terminal equipment (Marisat, GOES, Iridium, TDRS) at the Amundsen-Scott South Pole Station. Additionally, responsible for all radio & telephone installations & equipment on the station, including wireless LAN links to surrounding field camps. Sr. Hardware Engineer Google [x] July 2015  – Present (1 month) Sr. Hardware Engineer at Google[x] Sr. Hardware Engineer Google [x] July 2015  – Present (1 month) Sr. Hardware Engineer at Google[x] Hardware Test Engineer Google [x] January 2014  –  June 2015  (1 year 6 months) Mountain View, CA Hardware Test Engineer at Google[x] Hardware Test Engineer Google [x] January 2014  –  June 2015  (1 year 6 months) Mountain View, CA Hardware Test Engineer at Google[x] Hardware Engineer SEAKR Engineering November 2010  –  August 2013  (2 years 10 months) Centennial, CO -- Development of communications system algorithms, and their implementation in FPGA fabric, using Matlab, Simulink, and System Generator, including hardware-in-the-loop simulation. \n-- Test hardware/software development for satellite communications hardware, using a combination of FPGA hardware, National Instruments PXIe gear including Vector Signal Analyzers/Generators, and LabView. \n-- Development of custom FPGA hardware algorithms for test signal generation and capture, in support of flight hardware test Hardware Engineer SEAKR Engineering November 2010  –  August 2013  (2 years 10 months) Centennial, CO -- Development of communications system algorithms, and their implementation in FPGA fabric, using Matlab, Simulink, and System Generator, including hardware-in-the-loop simulation. \n-- Test hardware/software development for satellite communications hardware, using a combination of FPGA hardware, National Instruments PXIe gear including Vector Signal Analyzers/Generators, and LabView. \n-- Development of custom FPGA hardware algorithms for test signal generation and capture, in support of flight hardware test DSP/Systems Engineer SAIC June 2007  –  January 2011  (3 years 8 months) -- Developed and implemented software defined radio algorithms in FPGA fabric, for hi-rel environments \n-- Followed the hardware through build, test, and delivery, assuming the role of hardware test lead \n-- Developed an extensive automated test suite for delivering consistent and repeatable hardware performance and verification measurements \n-- Performed extensive post-test analysis and data reduction of the large data sets produced by the hardware testing process, for customer presentation (Open) 1 recommendation Rand Ringwald Chief Engineer, RF Systems at SAIC On a recent space Hi-Rel development program at SAIC, Jon contributed enormously to our success. Jon solved diverse technical challenges and provided deliverables using his skills in RF, RTL Coding, communications systems analysis and simulation,... View DSP/Systems Engineer SAIC June 2007  –  January 2011  (3 years 8 months) -- Developed and implemented software defined radio algorithms in FPGA fabric, for hi-rel environments \n-- Followed the hardware through build, test, and delivery, assuming the role of hardware test lead \n-- Developed an extensive automated test suite for delivering consistent and repeatable hardware performance and verification measurements \n-- Performed extensive post-test analysis and data reduction of the large data sets produced by the hardware testing process, for customer presentation (Open) 1 recommendation Rand Ringwald Chief Engineer, RF Systems at SAIC On a recent space Hi-Rel development program at SAIC, Jon contributed enormously to our success. Jon solved diverse technical challenges and provided deliverables using his skills in RF, RTL Coding, communications systems analysis and simulation,... View Sr. Electrical Engineer Lockheed-Martin November 2003  –  May 2007  (3 years 7 months) -- DSP algorithm implementation in FPGA fabric \n-- Development and automation of laboratory test hardware, systems. Hardware test procedure development and implementation, including post-test results analysis \n-- Communications hardware and physical systems modeling in Matlab, Simulink, and Orcad Pspice \n-- Design, review, and revision of communications hardware at the PCB level Sr. Electrical Engineer Lockheed-Martin November 2003  –  May 2007  (3 years 7 months) -- DSP algorithm implementation in FPGA fabric \n-- Development and automation of laboratory test hardware, systems. Hardware test procedure development and implementation, including post-test results analysis \n-- Communications hardware and physical systems modeling in Matlab, Simulink, and Orcad Pspice \n-- Design, review, and revision of communications hardware at the PCB level Technical Staff Member Jet Propulsion Laboratory August 2000  –  September 2003  (3 years 2 months) RF/Microwave design & analysis position, involved with a wide variety of communication systems & projects. Technical Staff Member Jet Propulsion Laboratory August 2000  –  September 2003  (3 years 2 months) RF/Microwave design & analysis position, involved with a wide variety of communication systems & projects. Sr. Communications Technician Raytheon Polar Services Co. August 2001  –  November 2002  (1 year 4 months) Winter-over Satellite communications technician responsible for maintenance and upkeep of satellite ground terminal equipment (Marisat, GOES, Iridium, TDRS) at the Amundsen-Scott South Pole Station. Additionally, responsible for all radio & telephone installations & equipment on the station, including wireless LAN links to surrounding field camps. Sr. Communications Technician Raytheon Polar Services Co. August 2001  –  November 2002  (1 year 4 months) Winter-over Satellite communications technician responsible for maintenance and upkeep of satellite ground terminal equipment (Marisat, GOES, Iridium, TDRS) at the Amundsen-Scott South Pole Station. Additionally, responsible for all radio & telephone installations & equipment on the station, including wireless LAN links to surrounding field camps. Skills Top Skills 27 Digital Signal... 19 FPGA 17 Matlab 14 RF 13 Testing 11 Labview 10 Systems Engineering 10 Simulations 7 Communication Systems 4 PCB Design Jonathan also knows about... 3 Simulink 2 Software Defined Radio 2 Verilog 2 Sensors 2 Electrical Engineering 1 Synplify DSP 1 Security Clearance 1 VHDL 1 Digital Signal... 1 PCB design 1 Xilinx 1 Hardware 1 Test Equipment 1 Embedded Systems 1 LabVIEW 0 DSP 0 Xilinx System Generator 0 STK 0 Network Analyzer 0 Spectrum Analyzer 0 Algorithms See 6+     See less Skills  Top Skills 27 Digital Signal... 19 FPGA 17 Matlab 14 RF 13 Testing 11 Labview 10 Systems Engineering 10 Simulations 7 Communication Systems 4 PCB Design Jonathan also knows about... 3 Simulink 2 Software Defined Radio 2 Verilog 2 Sensors 2 Electrical Engineering 1 Synplify DSP 1 Security Clearance 1 VHDL 1 Digital Signal... 1 PCB design 1 Xilinx 1 Hardware 1 Test Equipment 1 Embedded Systems 1 LabVIEW 0 DSP 0 Xilinx System Generator 0 STK 0 Network Analyzer 0 Spectrum Analyzer 0 Algorithms See 6+     See less Top Skills 27 Digital Signal... 19 FPGA 17 Matlab 14 RF 13 Testing 11 Labview 10 Systems Engineering 10 Simulations 7 Communication Systems 4 PCB Design Jonathan also knows about... 3 Simulink 2 Software Defined Radio 2 Verilog 2 Sensors 2 Electrical Engineering 1 Synplify DSP 1 Security Clearance 1 VHDL 1 Digital Signal... 1 PCB design 1 Xilinx 1 Hardware 1 Test Equipment 1 Embedded Systems 1 LabVIEW 0 DSP 0 Xilinx System Generator 0 STK 0 Network Analyzer 0 Spectrum Analyzer 0 Algorithms See 6+     See less Top Skills 27 Digital Signal... 19 FPGA 17 Matlab 14 RF 13 Testing 11 Labview 10 Systems Engineering 10 Simulations 7 Communication Systems 4 PCB Design Jonathan also knows about... 3 Simulink 2 Software Defined Radio 2 Verilog 2 Sensors 2 Electrical Engineering 1 Synplify DSP 1 Security Clearance 1 VHDL 1 Digital Signal... 1 PCB design 1 Xilinx 1 Hardware 1 Test Equipment 1 Embedded Systems 1 LabVIEW 0 DSP 0 Xilinx System Generator 0 STK 0 Network Analyzer 0 Spectrum Analyzer 0 Algorithms See 6+     See less                     3 Simulink 2 Software Defined Radio 2 Verilog 2 Sensors 2 Electrical Engineering 1 Synplify DSP 1 Security Clearance 1 VHDL 1 Digital Signal... 1 PCB design 1 Xilinx 1 Hardware 1 Test Equipment 1 Embedded Systems 1 LabVIEW 0 DSP 0 Xilinx System Generator 0 STK 0 Network Analyzer 0 Spectrum Analyzer 0 Algorithms Education University of Michigan MSEng,  Electrical Engineering 1998  – 2000 (Open) 6 courses Classical Optics Classical Electrodynamics Microwave Measurements Fourier Optics Optical Waves in Crystals Visual and Infrared Remote Sensing See more Michigan Technological University BS,  Electrical Engineering 1990  – 1994 University of Michigan MSEng,  Electrical Engineering 1998  – 2000 (Open) 6 courses Classical Optics Classical Electrodynamics Microwave Measurements Fourier Optics Optical Waves in Crystals Visual and Infrared Remote Sensing See more University of Michigan MSEng,  Electrical Engineering 1998  – 2000 (Open) 6 courses Classical Optics Classical Electrodynamics Microwave Measurements Fourier Optics Optical Waves in Crystals Visual and Infrared Remote Sensing See more University of Michigan MSEng,  Electrical Engineering 1998  – 2000 (Open) 6 courses Classical Optics Classical Electrodynamics Microwave Measurements Fourier Optics Optical Waves in Crystals Visual and Infrared Remote Sensing See more Michigan Technological University BS,  Electrical Engineering 1990  – 1994 Michigan Technological University BS,  Electrical Engineering 1990  – 1994 Michigan Technological University BS,  Electrical Engineering 1990  – 1994 ", "Experience Hardware Engineer Amazon June 2015  – Present (2 months) San Francisco Bay Area Senior Hardware Engineer Google[X] April 2012  –  May 2015  (3 years 2 months) Mountain View, California Lead audio and acoustic engineer at Project Glass.  \n- Defined audio architecture for Glass device with SOC and codec vendors. \n- Set up automated key phrase detection system. \n- Worked with research institutes and universities to explore new methods to deliver audio for wearable computing devices. \n- Helped other Google groups in acoustic transducer specification, acoustic design, electroacoustic testing system design and transducer production line audition. Hardware Engineer Google[X] 2010  –  May 2012  (2 years) Mountain View, California - Proposed and prototyped the bone conduction technology in Google Glass. \n- Built audio testing lab at Google[X] for measuring bone and air conduction acoustic transducers. \n- Worked with acoustic transducer suppliers to design, mass produce and test the bone conduction transducer for Google Glass. \n- Worked with Google reliability engineers, electroplating and painting suppliers in China to improve the reliability performance of bone conduction transducer for Glass. \n- Set up automated testing system for speech recognition test speech intelligibility tests for Google Glass. Analog ASIC Design Engineer Philips Healthcare November 2006  –  April 2010  (3 years 6 months) Bothell, WA - Schematic capture and layout for the low noise amplifier and switched capacitor circuits for Philips 2D array ultrasound probes. \n- Performed the simulation of LNA plus acoustic transducer to meet the system SNR specifications. \n- Tested the fabricated probes for timing and signal integrity for the 2D array probe. Hardware Engineer Amazon June 2015  – Present (2 months) San Francisco Bay Area Hardware Engineer Amazon June 2015  – Present (2 months) San Francisco Bay Area Senior Hardware Engineer Google[X] April 2012  –  May 2015  (3 years 2 months) Mountain View, California Lead audio and acoustic engineer at Project Glass.  \n- Defined audio architecture for Glass device with SOC and codec vendors. \n- Set up automated key phrase detection system. \n- Worked with research institutes and universities to explore new methods to deliver audio for wearable computing devices. \n- Helped other Google groups in acoustic transducer specification, acoustic design, electroacoustic testing system design and transducer production line audition. Senior Hardware Engineer Google[X] April 2012  –  May 2015  (3 years 2 months) Mountain View, California Lead audio and acoustic engineer at Project Glass.  \n- Defined audio architecture for Glass device with SOC and codec vendors. \n- Set up automated key phrase detection system. \n- Worked with research institutes and universities to explore new methods to deliver audio for wearable computing devices. \n- Helped other Google groups in acoustic transducer specification, acoustic design, electroacoustic testing system design and transducer production line audition. Hardware Engineer Google[X] 2010  –  May 2012  (2 years) Mountain View, California - Proposed and prototyped the bone conduction technology in Google Glass. \n- Built audio testing lab at Google[X] for measuring bone and air conduction acoustic transducers. \n- Worked with acoustic transducer suppliers to design, mass produce and test the bone conduction transducer for Google Glass. \n- Worked with Google reliability engineers, electroplating and painting suppliers in China to improve the reliability performance of bone conduction transducer for Glass. \n- Set up automated testing system for speech recognition test speech intelligibility tests for Google Glass. Hardware Engineer Google[X] 2010  –  May 2012  (2 years) Mountain View, California - Proposed and prototyped the bone conduction technology in Google Glass. \n- Built audio testing lab at Google[X] for measuring bone and air conduction acoustic transducers. \n- Worked with acoustic transducer suppliers to design, mass produce and test the bone conduction transducer for Google Glass. \n- Worked with Google reliability engineers, electroplating and painting suppliers in China to improve the reliability performance of bone conduction transducer for Glass. \n- Set up automated testing system for speech recognition test speech intelligibility tests for Google Glass. Analog ASIC Design Engineer Philips Healthcare November 2006  –  April 2010  (3 years 6 months) Bothell, WA - Schematic capture and layout for the low noise amplifier and switched capacitor circuits for Philips 2D array ultrasound probes. \n- Performed the simulation of LNA plus acoustic transducer to meet the system SNR specifications. \n- Tested the fabricated probes for timing and signal integrity for the 2D array probe. Analog ASIC Design Engineer Philips Healthcare November 2006  –  April 2010  (3 years 6 months) Bothell, WA - Schematic capture and layout for the low noise amplifier and switched capacitor circuits for Philips 2D array ultrasound probes. \n- Performed the simulation of LNA plus acoustic transducer to meet the system SNR specifications. \n- Tested the fabricated probes for timing and signal integrity for the 2D array probe. Languages Chinese Native or bilingual proficiency English Full professional proficiency Chinese Native or bilingual proficiency English Full professional proficiency Chinese Native or bilingual proficiency English Full professional proficiency Native or bilingual proficiency Full professional proficiency Skills Top Skills 25 Simulations 21 Algorithms 16 Testing 14 Digital Signal... 13 Perl 11 Python 10 Semiconductors 10 Matlab 8 Machine Learning 8 Mobile Devices Jianchun also knows about... 8 Analog 8 Electronics 6 Acoustics 5 Acoustic Measurement 5 Acoustic Modeling 5 Sensors 4 Hardware 3 Verilog 3 Physics 3 Embedded Systems 1 Biochemistry 1 Molecular Biology 0 Physiology of hearing 0 Production line... 0 Polymer Chemistry 0 Surface Chemistry 0 Electrochemistry 0 Electroplating 0 MEMS 0 Microfabrication 0 Analog Circuit Design See 6+     See less Skills  Top Skills 25 Simulations 21 Algorithms 16 Testing 14 Digital Signal... 13 Perl 11 Python 10 Semiconductors 10 Matlab 8 Machine Learning 8 Mobile Devices Jianchun also knows about... 8 Analog 8 Electronics 6 Acoustics 5 Acoustic Measurement 5 Acoustic Modeling 5 Sensors 4 Hardware 3 Verilog 3 Physics 3 Embedded Systems 1 Biochemistry 1 Molecular Biology 0 Physiology of hearing 0 Production line... 0 Polymer Chemistry 0 Surface Chemistry 0 Electrochemistry 0 Electroplating 0 MEMS 0 Microfabrication 0 Analog Circuit Design See 6+     See less Top Skills 25 Simulations 21 Algorithms 16 Testing 14 Digital Signal... 13 Perl 11 Python 10 Semiconductors 10 Matlab 8 Machine Learning 8 Mobile Devices Jianchun also knows about... 8 Analog 8 Electronics 6 Acoustics 5 Acoustic Measurement 5 Acoustic Modeling 5 Sensors 4 Hardware 3 Verilog 3 Physics 3 Embedded Systems 1 Biochemistry 1 Molecular Biology 0 Physiology of hearing 0 Production line... 0 Polymer Chemistry 0 Surface Chemistry 0 Electrochemistry 0 Electroplating 0 MEMS 0 Microfabrication 0 Analog Circuit Design See 6+     See less Top Skills 25 Simulations 21 Algorithms 16 Testing 14 Digital Signal... 13 Perl 11 Python 10 Semiconductors 10 Matlab 8 Machine Learning 8 Mobile Devices Jianchun also knows about... 8 Analog 8 Electronics 6 Acoustics 5 Acoustic Measurement 5 Acoustic Modeling 5 Sensors 4 Hardware 3 Verilog 3 Physics 3 Embedded Systems 1 Biochemistry 1 Molecular Biology 0 Physiology of hearing 0 Production line... 0 Polymer Chemistry 0 Surface Chemistry 0 Electrochemistry 0 Electroplating 0 MEMS 0 Microfabrication 0 Analog Circuit Design See 6+     See less                     8 Analog 8 Electronics 6 Acoustics 5 Acoustic Measurement 5 Acoustic Modeling 5 Sensors 4 Hardware 3 Verilog 3 Physics 3 Embedded Systems 1 Biochemistry 1 Molecular Biology 0 Physiology of hearing 0 Production line... 0 Polymer Chemistry 0 Surface Chemistry 0 Electrochemistry 0 Electroplating 0 MEMS 0 Microfabrication 0 Analog Circuit Design Education University of Washington Doctor of Philosophy (Ph.D.),  Electrical and Electronics Engineering 2001  – 2006 East China University of Science and Technology MS,  Biochemical Engineering 1993  – 1996 North China University of Technology BSEE,  Instrumentation 1989  – 1993 University of Washington Doctor of Philosophy (Ph.D.),  Electrical and Electronics Engineering 2001  – 2006 University of Washington Doctor of Philosophy (Ph.D.),  Electrical and Electronics Engineering 2001  – 2006 University of Washington Doctor of Philosophy (Ph.D.),  Electrical and Electronics Engineering 2001  – 2006 East China University of Science and Technology MS,  Biochemical Engineering 1993  – 1996 East China University of Science and Technology MS,  Biochemical Engineering 1993  – 1996 East China University of Science and Technology MS,  Biochemical Engineering 1993  – 1996 North China University of Technology BSEE,  Instrumentation 1989  – 1993 North China University of Technology BSEE,  Instrumentation 1989  – 1993 North China University of Technology BSEE,  Instrumentation 1989  – 1993 ", "Skills Top Skills 9 Ethernet 8 Firmware 8 Embedded Systems 6 FPGA 4 Verilog 3 ASIC 2 Fibre Channel 1 I2C 1 Board Bring-up 1 Storage Mike also knows about... 0 Logic Analyzer 0 SystemVerilog 0 Switches Skills  Top Skills 9 Ethernet 8 Firmware 8 Embedded Systems 6 FPGA 4 Verilog 3 ASIC 2 Fibre Channel 1 I2C 1 Board Bring-up 1 Storage Mike also knows about... 0 Logic Analyzer 0 SystemVerilog 0 Switches Top Skills 9 Ethernet 8 Firmware 8 Embedded Systems 6 FPGA 4 Verilog 3 ASIC 2 Fibre Channel 1 I2C 1 Board Bring-up 1 Storage Mike also knows about... 0 Logic Analyzer 0 SystemVerilog 0 Switches Top Skills 9 Ethernet 8 Firmware 8 Embedded Systems 6 FPGA 4 Verilog 3 ASIC 2 Fibre Channel 1 I2C 1 Board Bring-up 1 Storage Mike also knows about... 0 Logic Analyzer 0 SystemVerilog 0 Switches                     0 Logic Analyzer 0 SystemVerilog 0 Switches ", "Summary Electrical Engineering professional with 17+ years of experience in ASIC design and verification, Emulation and proto-typing. Proven leader with excellent communication skills, true team player. \n \nSpecialties: Emulation/Silicon proto-typing, various IO technologies, computer architecture and memory sub-systems. Summary Electrical Engineering professional with 17+ years of experience in ASIC design and verification, Emulation and proto-typing. Proven leader with excellent communication skills, true team player. \n \nSpecialties: Emulation/Silicon proto-typing, various IO technologies, computer architecture and memory sub-systems. Electrical Engineering professional with 17+ years of experience in ASIC design and verification, Emulation and proto-typing. Proven leader with excellent communication skills, true team player. \n \nSpecialties: Emulation/Silicon proto-typing, various IO technologies, computer architecture and memory sub-systems. Electrical Engineering professional with 17+ years of experience in ASIC design and verification, Emulation and proto-typing. Proven leader with excellent communication skills, true team player. \n \nSpecialties: Emulation/Silicon proto-typing, various IO technologies, computer architecture and memory sub-systems. Experience Sr Hardware Engineer Google August 2014  – Present (1 year) Mountain View Building cool stuff. Director of Engineering, Hardware emulation Stealth startup November 2011  –  August 2014  (2 years 10 months) Build and lead two small teams in a technical hands-on manner to design and develop transaction based emulation co-simulation platforms to validate complex SoC’s. Manage vendor relationships. Perform purchase and upgrade planning. Liaison with application engineers to resolve emulator hardware and tool problems and integrate and bring-up 3rd party solutions (speed-bridges, transactors, soft-models, virtual devices, etc).  \n \nWork cross functionally towards successful bring-up of various software platforms and drivers. Senior Hardware Engineer NVIDIA Corp. July 2004  –  November 2011  (7 years 5 months) Handheld devices, low power design, chip-set technologies. Leading a team of engineers to successfully map Nvidia's cpu design to an FPGA system. Tasks include system design, design mapping/partitioning, fpga compiles, timing closure, lab setup, scheduling, mentoring. \n \nTools include Synplify Premier, Certify, Xilinx ISE, identify, HAPS54/64, verilog, perl, excel. Hardware Engineer SUN Microsystems June 1997  –  July 2004  (7 years 2 months) Technical Lead on design of next-generation cache controller for high-end UltraSparc processor families (Open) 1 recommendation Terrence Barr Senior Technologist and Senior Principal Product Manager I've known Koen for years. He is an analytic thinker, knows his stuff, and brings passion and dedication to everything he does. Plus, he's a great guy. View Sr Hardware Engineer Google August 2014  – Present (1 year) Mountain View Building cool stuff. Sr Hardware Engineer Google August 2014  – Present (1 year) Mountain View Building cool stuff. Director of Engineering, Hardware emulation Stealth startup November 2011  –  August 2014  (2 years 10 months) Build and lead two small teams in a technical hands-on manner to design and develop transaction based emulation co-simulation platforms to validate complex SoC’s. Manage vendor relationships. Perform purchase and upgrade planning. Liaison with application engineers to resolve emulator hardware and tool problems and integrate and bring-up 3rd party solutions (speed-bridges, transactors, soft-models, virtual devices, etc).  \n \nWork cross functionally towards successful bring-up of various software platforms and drivers. Director of Engineering, Hardware emulation Stealth startup November 2011  –  August 2014  (2 years 10 months) Build and lead two small teams in a technical hands-on manner to design and develop transaction based emulation co-simulation platforms to validate complex SoC’s. Manage vendor relationships. Perform purchase and upgrade planning. Liaison with application engineers to resolve emulator hardware and tool problems and integrate and bring-up 3rd party solutions (speed-bridges, transactors, soft-models, virtual devices, etc).  \n \nWork cross functionally towards successful bring-up of various software platforms and drivers. Senior Hardware Engineer NVIDIA Corp. July 2004  –  November 2011  (7 years 5 months) Handheld devices, low power design, chip-set technologies. Leading a team of engineers to successfully map Nvidia's cpu design to an FPGA system. Tasks include system design, design mapping/partitioning, fpga compiles, timing closure, lab setup, scheduling, mentoring. \n \nTools include Synplify Premier, Certify, Xilinx ISE, identify, HAPS54/64, verilog, perl, excel. Senior Hardware Engineer NVIDIA Corp. July 2004  –  November 2011  (7 years 5 months) Handheld devices, low power design, chip-set technologies. Leading a team of engineers to successfully map Nvidia's cpu design to an FPGA system. Tasks include system design, design mapping/partitioning, fpga compiles, timing closure, lab setup, scheduling, mentoring. \n \nTools include Synplify Premier, Certify, Xilinx ISE, identify, HAPS54/64, verilog, perl, excel. Hardware Engineer SUN Microsystems June 1997  –  July 2004  (7 years 2 months) Technical Lead on design of next-generation cache controller for high-end UltraSparc processor families (Open) 1 recommendation Terrence Barr Senior Technologist and Senior Principal Product Manager I've known Koen for years. He is an analytic thinker, knows his stuff, and brings passion and dedication to everything he does. Plus, he's a great guy. View Hardware Engineer SUN Microsystems June 1997  –  July 2004  (7 years 2 months) Technical Lead on design of next-generation cache controller for high-end UltraSparc processor families (Open) 1 recommendation Terrence Barr Senior Technologist and Senior Principal Product Manager I've known Koen for years. He is an analytic thinker, knows his stuff, and brings passion and dedication to everything he does. Plus, he's a great guy. View Languages German Dutch German Dutch German Dutch Skills Top Skills 22 ASIC 20 Verilog 14 FPGA 12 SoC 7 Processors 6 RTL design 6 SystemVerilog 5 Hardware Architecture 4 Hardware 3 Low-power Design Koen also knows about... 3 Perl 3 Emulation 2 Timing Closure 2 Xilinx ISE 2 RTL Design 1 Debugging Skills  Top Skills 22 ASIC 20 Verilog 14 FPGA 12 SoC 7 Processors 6 RTL design 6 SystemVerilog 5 Hardware Architecture 4 Hardware 3 Low-power Design Koen also knows about... 3 Perl 3 Emulation 2 Timing Closure 2 Xilinx ISE 2 RTL Design 1 Debugging Top Skills 22 ASIC 20 Verilog 14 FPGA 12 SoC 7 Processors 6 RTL design 6 SystemVerilog 5 Hardware Architecture 4 Hardware 3 Low-power Design Koen also knows about... 3 Perl 3 Emulation 2 Timing Closure 2 Xilinx ISE 2 RTL Design 1 Debugging Top Skills 22 ASIC 20 Verilog 14 FPGA 12 SoC 7 Processors 6 RTL design 6 SystemVerilog 5 Hardware Architecture 4 Hardware 3 Low-power Design Koen also knows about... 3 Perl 3 Emulation 2 Timing Closure 2 Xilinx ISE 2 RTL Design 1 Debugging                     3 Perl 3 Emulation 2 Timing Closure 2 Xilinx ISE 2 RTL Design 1 Debugging Education University of Twente MSEE,  Electrical Engineering Masters 1989  – 1996 University of Twente MSEE,  Electrical Engineering Masters 1989  – 1996 University of Twente MSEE,  Electrical Engineering Masters 1989  – 1996 University of Twente MSEE,  Electrical Engineering Masters 1989  – 1996 ", "Experience Staff Hardware Engineer Google May 2014  – Present (1 year 3 months) Staff Hardware Engineer Google May 2014  – Present (1 year 3 months) Staff Hardware Engineer Google May 2014  – Present (1 year 3 months) Skills Top Skills 22 Fiber Optics 18 Optical Fiber 17 Photonics 14 Optics 14 DWDM 8 Semiconductors 7 Optical Communications 6 Simulations 6 Optoelectronics 4 Telecommunications Xiangjun also knows about... 2 Systems Engineering 2 Optical Engineering 1 FTTx Skills  Top Skills 22 Fiber Optics 18 Optical Fiber 17 Photonics 14 Optics 14 DWDM 8 Semiconductors 7 Optical Communications 6 Simulations 6 Optoelectronics 4 Telecommunications Xiangjun also knows about... 2 Systems Engineering 2 Optical Engineering 1 FTTx Top Skills 22 Fiber Optics 18 Optical Fiber 17 Photonics 14 Optics 14 DWDM 8 Semiconductors 7 Optical Communications 6 Simulations 6 Optoelectronics 4 Telecommunications Xiangjun also knows about... 2 Systems Engineering 2 Optical Engineering 1 FTTx Top Skills 22 Fiber Optics 18 Optical Fiber 17 Photonics 14 Optics 14 DWDM 8 Semiconductors 7 Optical Communications 6 Simulations 6 Optoelectronics 4 Telecommunications Xiangjun also knows about... 2 Systems Engineering 2 Optical Engineering 1 FTTx                     2 Systems Engineering 2 Optical Engineering 1 FTTx Education University of Maryland Baltimore County Doctor of Philosophy (PhD) 1996  – 2005 Huazhong University of Science and Technology BS University of Maryland Baltimore County Doctor of Philosophy (PhD) 1996  – 2005 University of Maryland Baltimore County Doctor of Philosophy (PhD) 1996  – 2005 University of Maryland Baltimore County Doctor of Philosophy (PhD) 1996  – 2005 Huazhong University of Science and Technology BS Huazhong University of Science and Technology BS Huazhong University of Science and Technology BS ", "Experience Hardware Engineer Google[x] October 2014  – Present (10 months) Mountain View, CA Project Loon Autolauncher Edit Hardware Engineer Google June 2014  –  October 2014  (5 months) Mountain View Google Access, internet for everybody Lead Engineer on the Linduino Linear Technology June 2013  –  June 2014  (1 year 1 month) Milpitas Head of the LTC Linduino Project, LTC's version of the Arduino that includes a fully isolated power supply to protect USB ports while working with high powered applications. \n \nLinduino Project provides example firmware code for various LTC products, giving customers a head start when using LTC parts.  \n \nSelect and manage Linduino Projects to showcase LTC products and capabilities. Write and revise contributed firmware to be included in Linduino Firmware Library. (Open) 1 project Linduino Linduino Project provides example firmware code for various LTC products, giving customers a head start when using LTC parts.  View Applications Engineer Linear Technology June 2007  –  June 2014  (7 years 1 month) Supported customers on mixed signal products, specialize in high resolution mixed signal products as well as battery management systems. (Open) 2 recommendations James Mahoney President at Helos Aviation Technologies LLC Leo Chen is a Very creative Engineer with Quick ideas who then follows up with working prototypes! Leo reaches optimal... View Hamza Afzal Applications Engineer at Linear Technology During his time at LTC Leo was a mentor, an inspiration and a friend. The guy is super smart and a bundle of energy. He... View Lab Supervisor Berkeley ESG 2006  –  2007  (1 year) Hardware Engineer Google[x] October 2014  – Present (10 months) Mountain View, CA Project Loon Autolauncher Edit Hardware Engineer Google[x] October 2014  – Present (10 months) Mountain View, CA Project Loon Autolauncher Edit Autolauncher Edit Autolauncher Edit Autolauncher  Autolauncher  Hardware Engineer Google June 2014  –  October 2014  (5 months) Mountain View Google Access, internet for everybody Hardware Engineer Google June 2014  –  October 2014  (5 months) Mountain View Google Access, internet for everybody Lead Engineer on the Linduino Linear Technology June 2013  –  June 2014  (1 year 1 month) Milpitas Head of the LTC Linduino Project, LTC's version of the Arduino that includes a fully isolated power supply to protect USB ports while working with high powered applications. \n \nLinduino Project provides example firmware code for various LTC products, giving customers a head start when using LTC parts.  \n \nSelect and manage Linduino Projects to showcase LTC products and capabilities. Write and revise contributed firmware to be included in Linduino Firmware Library. (Open) 1 project Linduino Linduino Project provides example firmware code for various LTC products, giving customers a head start when using LTC parts.  View Lead Engineer on the Linduino Linear Technology June 2013  –  June 2014  (1 year 1 month) Milpitas Head of the LTC Linduino Project, LTC's version of the Arduino that includes a fully isolated power supply to protect USB ports while working with high powered applications. \n \nLinduino Project provides example firmware code for various LTC products, giving customers a head start when using LTC parts.  \n \nSelect and manage Linduino Projects to showcase LTC products and capabilities. Write and revise contributed firmware to be included in Linduino Firmware Library. (Open) 1 project Linduino Linduino Project provides example firmware code for various LTC products, giving customers a head start when using LTC parts.  View Applications Engineer Linear Technology June 2007  –  June 2014  (7 years 1 month) Supported customers on mixed signal products, specialize in high resolution mixed signal products as well as battery management systems. (Open) 2 recommendations James Mahoney President at Helos Aviation Technologies LLC Leo Chen is a Very creative Engineer with Quick ideas who then follows up with working prototypes! Leo reaches optimal... View Hamza Afzal Applications Engineer at Linear Technology During his time at LTC Leo was a mentor, an inspiration and a friend. The guy is super smart and a bundle of energy. He... View Applications Engineer Linear Technology June 2007  –  June 2014  (7 years 1 month) Supported customers on mixed signal products, specialize in high resolution mixed signal products as well as battery management systems. (Open) 2 recommendations James Mahoney President at Helos Aviation Technologies LLC Leo Chen is a Very creative Engineer with Quick ideas who then follows up with working prototypes! Leo reaches optimal... View Hamza Afzal Applications Engineer at Linear Technology During his time at LTC Leo was a mentor, an inspiration and a friend. The guy is super smart and a bundle of energy. He... View Lab Supervisor Berkeley ESG 2006  –  2007  (1 year) Lab Supervisor Berkeley ESG 2006  –  2007  (1 year) Languages English Native or bilingual proficiency Chinese Limited working proficiency English Native or bilingual proficiency Chinese Limited working proficiency English Native or bilingual proficiency Chinese Limited working proficiency Native or bilingual proficiency Limited working proficiency Skills Top Skills 12 Mixed Signal 10 Analog Circuit Design 9 Analog 4 Embedded C 4 Product Engineering 4 Power Management 4 Firmware 4 Semiconductor Industry 3 IC 3 ASIC Leo also knows about... 2 Battery Management... 2 Power Electronics 2 Semiconductors 1 CMOS 1 Visual C# 1 USB 1 Circuit Design 1 Electrical Engineering Skills  Top Skills 12 Mixed Signal 10 Analog Circuit Design 9 Analog 4 Embedded C 4 Product Engineering 4 Power Management 4 Firmware 4 Semiconductor Industry 3 IC 3 ASIC Leo also knows about... 2 Battery Management... 2 Power Electronics 2 Semiconductors 1 CMOS 1 Visual C# 1 USB 1 Circuit Design 1 Electrical Engineering Top Skills 12 Mixed Signal 10 Analog Circuit Design 9 Analog 4 Embedded C 4 Product Engineering 4 Power Management 4 Firmware 4 Semiconductor Industry 3 IC 3 ASIC Leo also knows about... 2 Battery Management... 2 Power Electronics 2 Semiconductors 1 CMOS 1 Visual C# 1 USB 1 Circuit Design 1 Electrical Engineering Top Skills 12 Mixed Signal 10 Analog Circuit Design 9 Analog 4 Embedded C 4 Product Engineering 4 Power Management 4 Firmware 4 Semiconductor Industry 3 IC 3 ASIC Leo also knows about... 2 Battery Management... 2 Power Electronics 2 Semiconductors 1 CMOS 1 Visual C# 1 USB 1 Circuit Design 1 Electrical Engineering                     2 Battery Management... 2 Power Electronics 2 Semiconductors 1 CMOS 1 Visual C# 1 USB 1 Circuit Design 1 Electrical Engineering Education University of California, Berkeley BS,  EECS 2003  – 2007 Undergraduate TA \nMember of ESG, helped maintain and run various labs in Cory Hall \nSubmitted proposal to NSF and received $10,000 for research on Aquatic Robotics Activities and Societies:  Cal Robotics Club\nESG University of California, Berkeley BS,  EECS 2003  – 2007 Undergraduate TA \nMember of ESG, helped maintain and run various labs in Cory Hall \nSubmitted proposal to NSF and received $10,000 for research on Aquatic Robotics Activities and Societies:  Cal Robotics Club\nESG University of California, Berkeley BS,  EECS 2003  – 2007 Undergraduate TA \nMember of ESG, helped maintain and run various labs in Cory Hall \nSubmitted proposal to NSF and received $10,000 for research on Aquatic Robotics Activities and Societies:  Cal Robotics Club\nESG University of California, Berkeley BS,  EECS 2003  – 2007 Undergraduate TA \nMember of ESG, helped maintain and run various labs in Cory Hall \nSubmitted proposal to NSF and received $10,000 for research on Aquatic Robotics Activities and Societies:  Cal Robotics Club\nESG ", "Experience Staff Hardware Engineer Google[x] December 2013  – Present (1 year 8 months) EE Team Lead on Project Loon. Hardware Engineer Google[x] March 2013  –  December 2013  (10 months) EE Lead on Project Loon. Electrical Engineer Entanglement Technologies November 2012  –  March 2013  (5 months) San Francisco Bay Area Systems Engineering Consultant Cobham Sensor Systems October 2011  –  October 2012  (1 year 1 month) Design of high current, low voltage power supplies \nSystem design and bring up of radio platform with ARM DM3730 processor and Altera FPGA \nLi-Ion battery charger design \nLinux kernel configuration, custom device drivers and u-boot configuration (Open) 1 recommendation Laurent Perraud Abside Networks, Inc. Tyler is a remarkably sharp system engineer who combines a wide technical span (signal processing, embedded system design, manufacturing debug) with an acute attention to details. Creative in the design phase and fast paced in the debugging/problem... View Co-founder and Lead Embedded Systems Engineer BioMimetic Systems Inc November 2006  –  January 2012  (5 years 3 months) Led hardware team in developing a low-power acoustic sensor platform for gunshot detection and vehicle tracking for DARPA \nDesigned multiple generations of PCBs that contained ARM processors, FPGAs, DSPs, low-noise audio inputs, MEMS sensors, interconnects and firmware \nTranslated floating point signal processing models to fixed point in Verilog and C \nOwned FPGA design and implementation with Xilinx Virtex4, Virtex5, and Spartan6 devices. \nManaged vendor selection, testing, BOM tracking and manufacturing schedules \n9-axis MEMS orientation sensor design and code for tracking movement and spatial orientation. Component Design Engineer Intel Corporation April 2004  –  October 2006  (2 years 7 months) Micro-architecture validation of i7 architecture memory and interconnect \nOwned logic validation of Pentium 4 Memory Unit \nDeveloped software tools for validation automation Research Assistant Boston University VLSI LAB January 2002  –  March 2004  (2 years 3 months) Developed a smart acoustic sensor for DARPA \nDesign, submission and test of digital asynchronous IC for acoustic feature extraction \n \n \n \nSpecific Skills and Projects: \n \nAcoustic Gunshot Detector: Developed Matlab signal processing models, modeled algorithms and translated to fixed-point implementations in Verilog and implemented algorithms in a Xilinx FPGA. Designed embedded system with OMAP3503 and Spartan6 FPGA, 3-axis gyro, 3-axis accelerometer, u-blox GPS and high-bandwidth recording interface. Laid out PCBs in Altium Designer and managed process of manufacturing and assembly. Lead board bring up, Linux configuration and custom ARM to FPGA interface and driver. Wrote low-level C routines to optimize software performance. Multiple generations of systems were fielded by various groups in the US Military for evaluation. \n \n \nHardware Knowledge: FPGA and SoC prototyping and board bring up - PCB design and layout with Altium, Orcad & Mentor tools – USB, Serial, SPI, Ethernet, I2C, Wishbone, Bluetooth, and WiFi communication interfaces - Power supply design and low-noise analog design and layout - DFM and environmental testing - Custom driver development for hardware – Lab tools and equipment  \n \nSoftware Languages and Tools: C, Matlab, Ruby, Perl, Java, TCL, Verilog and VHDL programming languages - Altium Designer, Mentor, Xilinx ISE, Altium Quartus design software – Linux and Microsoft Operating Systems - Microsoft Office productivity tools Staff Hardware Engineer Google[x] December 2013  – Present (1 year 8 months) EE Team Lead on Project Loon. Staff Hardware Engineer Google[x] December 2013  – Present (1 year 8 months) EE Team Lead on Project Loon. Hardware Engineer Google[x] March 2013  –  December 2013  (10 months) EE Lead on Project Loon. Hardware Engineer Google[x] March 2013  –  December 2013  (10 months) EE Lead on Project Loon. Electrical Engineer Entanglement Technologies November 2012  –  March 2013  (5 months) San Francisco Bay Area Electrical Engineer Entanglement Technologies November 2012  –  March 2013  (5 months) San Francisco Bay Area Systems Engineering Consultant Cobham Sensor Systems October 2011  –  October 2012  (1 year 1 month) Design of high current, low voltage power supplies \nSystem design and bring up of radio platform with ARM DM3730 processor and Altera FPGA \nLi-Ion battery charger design \nLinux kernel configuration, custom device drivers and u-boot configuration (Open) 1 recommendation Laurent Perraud Abside Networks, Inc. Tyler is a remarkably sharp system engineer who combines a wide technical span (signal processing, embedded system design, manufacturing debug) with an acute attention to details. Creative in the design phase and fast paced in the debugging/problem... View Systems Engineering Consultant Cobham Sensor Systems October 2011  –  October 2012  (1 year 1 month) Design of high current, low voltage power supplies \nSystem design and bring up of radio platform with ARM DM3730 processor and Altera FPGA \nLi-Ion battery charger design \nLinux kernel configuration, custom device drivers and u-boot configuration (Open) 1 recommendation Laurent Perraud Abside Networks, Inc. Tyler is a remarkably sharp system engineer who combines a wide technical span (signal processing, embedded system design, manufacturing debug) with an acute attention to details. Creative in the design phase and fast paced in the debugging/problem... View Co-founder and Lead Embedded Systems Engineer BioMimetic Systems Inc November 2006  –  January 2012  (5 years 3 months) Led hardware team in developing a low-power acoustic sensor platform for gunshot detection and vehicle tracking for DARPA \nDesigned multiple generations of PCBs that contained ARM processors, FPGAs, DSPs, low-noise audio inputs, MEMS sensors, interconnects and firmware \nTranslated floating point signal processing models to fixed point in Verilog and C \nOwned FPGA design and implementation with Xilinx Virtex4, Virtex5, and Spartan6 devices. \nManaged vendor selection, testing, BOM tracking and manufacturing schedules \n9-axis MEMS orientation sensor design and code for tracking movement and spatial orientation. Co-founder and Lead Embedded Systems Engineer BioMimetic Systems Inc November 2006  –  January 2012  (5 years 3 months) Led hardware team in developing a low-power acoustic sensor platform for gunshot detection and vehicle tracking for DARPA \nDesigned multiple generations of PCBs that contained ARM processors, FPGAs, DSPs, low-noise audio inputs, MEMS sensors, interconnects and firmware \nTranslated floating point signal processing models to fixed point in Verilog and C \nOwned FPGA design and implementation with Xilinx Virtex4, Virtex5, and Spartan6 devices. \nManaged vendor selection, testing, BOM tracking and manufacturing schedules \n9-axis MEMS orientation sensor design and code for tracking movement and spatial orientation. Component Design Engineer Intel Corporation April 2004  –  October 2006  (2 years 7 months) Micro-architecture validation of i7 architecture memory and interconnect \nOwned logic validation of Pentium 4 Memory Unit \nDeveloped software tools for validation automation Component Design Engineer Intel Corporation April 2004  –  October 2006  (2 years 7 months) Micro-architecture validation of i7 architecture memory and interconnect \nOwned logic validation of Pentium 4 Memory Unit \nDeveloped software tools for validation automation Research Assistant Boston University VLSI LAB January 2002  –  March 2004  (2 years 3 months) Developed a smart acoustic sensor for DARPA \nDesign, submission and test of digital asynchronous IC for acoustic feature extraction \n \n \n \nSpecific Skills and Projects: \n \nAcoustic Gunshot Detector: Developed Matlab signal processing models, modeled algorithms and translated to fixed-point implementations in Verilog and implemented algorithms in a Xilinx FPGA. Designed embedded system with OMAP3503 and Spartan6 FPGA, 3-axis gyro, 3-axis accelerometer, u-blox GPS and high-bandwidth recording interface. Laid out PCBs in Altium Designer and managed process of manufacturing and assembly. Lead board bring up, Linux configuration and custom ARM to FPGA interface and driver. Wrote low-level C routines to optimize software performance. Multiple generations of systems were fielded by various groups in the US Military for evaluation. \n \n \nHardware Knowledge: FPGA and SoC prototyping and board bring up - PCB design and layout with Altium, Orcad & Mentor tools – USB, Serial, SPI, Ethernet, I2C, Wishbone, Bluetooth, and WiFi communication interfaces - Power supply design and low-noise analog design and layout - DFM and environmental testing - Custom driver development for hardware – Lab tools and equipment  \n \nSoftware Languages and Tools: C, Matlab, Ruby, Perl, Java, TCL, Verilog and VHDL programming languages - Altium Designer, Mentor, Xilinx ISE, Altium Quartus design software – Linux and Microsoft Operating Systems - Microsoft Office productivity tools Research Assistant Boston University VLSI LAB January 2002  –  March 2004  (2 years 3 months) Developed a smart acoustic sensor for DARPA \nDesign, submission and test of digital asynchronous IC for acoustic feature extraction \n \n \n \nSpecific Skills and Projects: \n \nAcoustic Gunshot Detector: Developed Matlab signal processing models, modeled algorithms and translated to fixed-point implementations in Verilog and implemented algorithms in a Xilinx FPGA. Designed embedded system with OMAP3503 and Spartan6 FPGA, 3-axis gyro, 3-axis accelerometer, u-blox GPS and high-bandwidth recording interface. Laid out PCBs in Altium Designer and managed process of manufacturing and assembly. Lead board bring up, Linux configuration and custom ARM to FPGA interface and driver. Wrote low-level C routines to optimize software performance. Multiple generations of systems were fielded by various groups in the US Military for evaluation. \n \n \nHardware Knowledge: FPGA and SoC prototyping and board bring up - PCB design and layout with Altium, Orcad & Mentor tools – USB, Serial, SPI, Ethernet, I2C, Wishbone, Bluetooth, and WiFi communication interfaces - Power supply design and low-noise analog design and layout - DFM and environmental testing - Custom driver development for hardware – Lab tools and equipment  \n \nSoftware Languages and Tools: C, Matlab, Ruby, Perl, Java, TCL, Verilog and VHDL programming languages - Altium Designer, Mentor, Xilinx ISE, Altium Quartus design software – Linux and Microsoft Operating Systems - Microsoft Office productivity tools Languages Spanish Spanish Spanish Skills Top Skills 29 Embedded Systems 17 Verilog 15 FPGA 9 PCB design 8 Matlab 8 C++ 7 Engineering 7 VHDL 7 Linux 6 Signal Processing Tyler also knows about... 6 Electronics 6 Sensors 5 System Design 5 C 5 Debugging 5 ARM 3 Biomedical Engineering 3 USB 3 Ethernet 2 Software Development 2 I2C 1 Python 1 Analog 1 Programming 1 Kernel Debugging 1 Validation 0 Digital Audio 0 Audio Engineering 0 FPGA prototyping 0 CPLD 0 Sensor Fusion 0 Power Supplies 0 OMAP See 8+     See less Skills  Top Skills 29 Embedded Systems 17 Verilog 15 FPGA 9 PCB design 8 Matlab 8 C++ 7 Engineering 7 VHDL 7 Linux 6 Signal Processing Tyler also knows about... 6 Electronics 6 Sensors 5 System Design 5 C 5 Debugging 5 ARM 3 Biomedical Engineering 3 USB 3 Ethernet 2 Software Development 2 I2C 1 Python 1 Analog 1 Programming 1 Kernel Debugging 1 Validation 0 Digital Audio 0 Audio Engineering 0 FPGA prototyping 0 CPLD 0 Sensor Fusion 0 Power Supplies 0 OMAP See 8+     See less Top Skills 29 Embedded Systems 17 Verilog 15 FPGA 9 PCB design 8 Matlab 8 C++ 7 Engineering 7 VHDL 7 Linux 6 Signal Processing Tyler also knows about... 6 Electronics 6 Sensors 5 System Design 5 C 5 Debugging 5 ARM 3 Biomedical Engineering 3 USB 3 Ethernet 2 Software Development 2 I2C 1 Python 1 Analog 1 Programming 1 Kernel Debugging 1 Validation 0 Digital Audio 0 Audio Engineering 0 FPGA prototyping 0 CPLD 0 Sensor Fusion 0 Power Supplies 0 OMAP See 8+     See less Top Skills 29 Embedded Systems 17 Verilog 15 FPGA 9 PCB design 8 Matlab 8 C++ 7 Engineering 7 VHDL 7 Linux 6 Signal Processing Tyler also knows about... 6 Electronics 6 Sensors 5 System Design 5 C 5 Debugging 5 ARM 3 Biomedical Engineering 3 USB 3 Ethernet 2 Software Development 2 I2C 1 Python 1 Analog 1 Programming 1 Kernel Debugging 1 Validation 0 Digital Audio 0 Audio Engineering 0 FPGA prototyping 0 CPLD 0 Sensor Fusion 0 Power Supplies 0 OMAP See 8+     See less                     6 Electronics 6 Sensors 5 System Design 5 C 5 Debugging 5 ARM 3 Biomedical Engineering 3 USB 3 Ethernet 2 Software Development 2 I2C 1 Python 1 Analog 1 Programming 1 Kernel Debugging 1 Validation 0 Digital Audio 0 Audio Engineering 0 FPGA prototyping 0 CPLD 0 Sensor Fusion 0 Power Supplies 0 OMAP Education Boston University MS,  Electrical Engineering; VLSI circuits 2003  – 2004 Worked in the VLSI research lab under Professor Allyn Hubbard. Boston University Bachelor's degree,  Computer Systems Engineering 1999  – 2003 La Center High School 1996  – 1999 Boston University MS,  Electrical Engineering; VLSI circuits 2003  – 2004 Worked in the VLSI research lab under Professor Allyn Hubbard. Boston University MS,  Electrical Engineering; VLSI circuits 2003  – 2004 Worked in the VLSI research lab under Professor Allyn Hubbard. Boston University MS,  Electrical Engineering; VLSI circuits 2003  – 2004 Worked in the VLSI research lab under Professor Allyn Hubbard. Boston University Bachelor's degree,  Computer Systems Engineering 1999  – 2003 Boston University Bachelor's degree,  Computer Systems Engineering 1999  – 2003 Boston University Bachelor's degree,  Computer Systems Engineering 1999  – 2003 La Center High School 1996  – 1999 La Center High School 1996  – 1999 La Center High School 1996  – 1999 ", "Experience Senior Physicist and Electrical Engineer Google [x], Google Life Sciences November 2014  – Present (9 months) Physicist and Electrical Engineer Google [x] May 2013  –  November 2014  (1 year 7 months) Consulting Hardware Engineer Google [x] October 2012  –  May 2013  (8 months) Senior Physicist and Electrical Engineer Google [x], Google Life Sciences November 2014  – Present (9 months) Senior Physicist and Electrical Engineer Google [x], Google Life Sciences November 2014  – Present (9 months) Physicist and Electrical Engineer Google [x] May 2013  –  November 2014  (1 year 7 months) Physicist and Electrical Engineer Google [x] May 2013  –  November 2014  (1 year 7 months) Consulting Hardware Engineer Google [x] October 2012  –  May 2013  (8 months) Consulting Hardware Engineer Google [x] October 2012  –  May 2013  (8 months) Languages English Hebrew English Hebrew English Hebrew Skills Top Skills 8 Physics 7 Solar Energy 5 Nanotechnology 5 Optics 4 LaTeX 3 Renewable Energy 3 Characterization 3 Quantum Optics 3 Matlab 3 R&D Eden also knows about... 2 Materials Science 2 Simulations 1 Mathematical Modeling 1 Mathematica 1 Numerical Analysis 1 Scientific Computing 1 Algorithms 1 Research 0 Theoretical Physics 0 Quantum Field Theory 0 Radiative Cooling 0 Heat Transfer 0 Grant Writing 0 TikZ/PGF Plots 0 Signal Processing 0 Machine Learning 0 Monte Carlo Simulation 0 Semiconductors 0 Applied Mathematics 0 Optimization 0 Digital Signal... 0 Modeling 0 Hyperspectral Imaging 0 Electrical Engineering 0 C++ 0 Python See 11+     See less Skills  Top Skills 8 Physics 7 Solar Energy 5 Nanotechnology 5 Optics 4 LaTeX 3 Renewable Energy 3 Characterization 3 Quantum Optics 3 Matlab 3 R&D Eden also knows about... 2 Materials Science 2 Simulations 1 Mathematical Modeling 1 Mathematica 1 Numerical Analysis 1 Scientific Computing 1 Algorithms 1 Research 0 Theoretical Physics 0 Quantum Field Theory 0 Radiative Cooling 0 Heat Transfer 0 Grant Writing 0 TikZ/PGF Plots 0 Signal Processing 0 Machine Learning 0 Monte Carlo Simulation 0 Semiconductors 0 Applied Mathematics 0 Optimization 0 Digital Signal... 0 Modeling 0 Hyperspectral Imaging 0 Electrical Engineering 0 C++ 0 Python See 11+     See less Top Skills 8 Physics 7 Solar Energy 5 Nanotechnology 5 Optics 4 LaTeX 3 Renewable Energy 3 Characterization 3 Quantum Optics 3 Matlab 3 R&D Eden also knows about... 2 Materials Science 2 Simulations 1 Mathematical Modeling 1 Mathematica 1 Numerical Analysis 1 Scientific Computing 1 Algorithms 1 Research 0 Theoretical Physics 0 Quantum Field Theory 0 Radiative Cooling 0 Heat Transfer 0 Grant Writing 0 TikZ/PGF Plots 0 Signal Processing 0 Machine Learning 0 Monte Carlo Simulation 0 Semiconductors 0 Applied Mathematics 0 Optimization 0 Digital Signal... 0 Modeling 0 Hyperspectral Imaging 0 Electrical Engineering 0 C++ 0 Python See 11+     See less Top Skills 8 Physics 7 Solar Energy 5 Nanotechnology 5 Optics 4 LaTeX 3 Renewable Energy 3 Characterization 3 Quantum Optics 3 Matlab 3 R&D Eden also knows about... 2 Materials Science 2 Simulations 1 Mathematical Modeling 1 Mathematica 1 Numerical Analysis 1 Scientific Computing 1 Algorithms 1 Research 0 Theoretical Physics 0 Quantum Field Theory 0 Radiative Cooling 0 Heat Transfer 0 Grant Writing 0 TikZ/PGF Plots 0 Signal Processing 0 Machine Learning 0 Monte Carlo Simulation 0 Semiconductors 0 Applied Mathematics 0 Optimization 0 Digital Signal... 0 Modeling 0 Hyperspectral Imaging 0 Electrical Engineering 0 C++ 0 Python See 11+     See less                     2 Materials Science 2 Simulations 1 Mathematical Modeling 1 Mathematica 1 Numerical Analysis 1 Scientific Computing 1 Algorithms 1 Research 0 Theoretical Physics 0 Quantum Field Theory 0 Radiative Cooling 0 Heat Transfer 0 Grant Writing 0 TikZ/PGF Plots 0 Signal Processing 0 Machine Learning 0 Monte Carlo Simulation 0 Semiconductors 0 Applied Mathematics 0 Optimization 0 Digital Signal... 0 Modeling 0 Hyperspectral Imaging 0 Electrical Engineering 0 C++ 0 Python Education Stanford University PhD,  Applied Physics 2006  – 2012 Theoretical Quantum Optics and Nanophotonics: \n1) Few-photon light-matter interaction \n2) Dissipation in Quantum Optics \n3) Thermal emission of light from nanostructured materials \n4) Solar Thermophotovoltaics \n5) Radiative Cooling Activities and Societies:  OSA/SPIE; Stanford University Committee on Research (Open) 1 honor or award William R. and Sara Hart Kimball Stanford Graduate Fellowship View Tel Aviv University BS,  Physics 2002  – 2006 Magna Cum Laude (Open) 3 honors and awards Dean's award for academic excellency View Dean's award for academic excellency View Dean's award for academic excellency View Tel Aviv University BS,  Electrical Engineering 2002  – 2006 Stanford University PhD,  Applied Physics 2006  – 2012 Theoretical Quantum Optics and Nanophotonics: \n1) Few-photon light-matter interaction \n2) Dissipation in Quantum Optics \n3) Thermal emission of light from nanostructured materials \n4) Solar Thermophotovoltaics \n5) Radiative Cooling Activities and Societies:  OSA/SPIE; Stanford University Committee on Research (Open) 1 honor or award William R. and Sara Hart Kimball Stanford Graduate Fellowship View Stanford University PhD,  Applied Physics 2006  – 2012 Theoretical Quantum Optics and Nanophotonics: \n1) Few-photon light-matter interaction \n2) Dissipation in Quantum Optics \n3) Thermal emission of light from nanostructured materials \n4) Solar Thermophotovoltaics \n5) Radiative Cooling Activities and Societies:  OSA/SPIE; Stanford University Committee on Research (Open) 1 honor or award William R. and Sara Hart Kimball Stanford Graduate Fellowship View Stanford University PhD,  Applied Physics 2006  – 2012 Theoretical Quantum Optics and Nanophotonics: \n1) Few-photon light-matter interaction \n2) Dissipation in Quantum Optics \n3) Thermal emission of light from nanostructured materials \n4) Solar Thermophotovoltaics \n5) Radiative Cooling Activities and Societies:  OSA/SPIE; Stanford University Committee on Research (Open) 1 honor or award William R. and Sara Hart Kimball Stanford Graduate Fellowship View Tel Aviv University BS,  Physics 2002  – 2006 Magna Cum Laude (Open) 3 honors and awards Dean's award for academic excellency View Dean's award for academic excellency View Dean's award for academic excellency View Tel Aviv University BS,  Physics 2002  – 2006 Magna Cum Laude (Open) 3 honors and awards Dean's award for academic excellency View Dean's award for academic excellency View Dean's award for academic excellency View Tel Aviv University BS,  Physics 2002  – 2006 Magna Cum Laude (Open) 3 honors and awards Dean's award for academic excellency View Dean's award for academic excellency View Dean's award for academic excellency View Tel Aviv University BS,  Electrical Engineering 2002  – 2006 Tel Aviv University BS,  Electrical Engineering 2002  – 2006 Tel Aviv University BS,  Electrical Engineering 2002  – 2006 Honors & Awards William R. and Sara Hart Kimball Stanford Graduate Fellowship Stanford University September 2008 Dean's award for academic excellency Dean of the Faculty of Exact Sciences 2002 Dean's award for academic excellency Dean of the Faculty of Exact Sciences 2003 Dean's award for academic excellency Dean of the Faculty of Exact Sciences 2004 Additional Honors & Awards Stanford Graduate Fellowship (SGF) William R. and Sara Hart Kimball Stanford Graduate Fellowship Stanford University September 2008 William R. and Sara Hart Kimball Stanford Graduate Fellowship Stanford University September 2008 William R. and Sara Hart Kimball Stanford Graduate Fellowship Stanford University September 2008 Dean's award for academic excellency Dean of the Faculty of Exact Sciences 2002 Dean's award for academic excellency Dean of the Faculty of Exact Sciences 2002 Dean's award for academic excellency Dean of the Faculty of Exact Sciences 2002 Dean's award for academic excellency Dean of the Faculty of Exact Sciences 2003 Dean's award for academic excellency Dean of the Faculty of Exact Sciences 2003 Dean's award for academic excellency Dean of the Faculty of Exact Sciences 2003 Dean's award for academic excellency Dean of the Faculty of Exact Sciences 2004 Dean's award for academic excellency Dean of the Faculty of Exact Sciences 2004 Dean's award for academic excellency Dean of the Faculty of Exact Sciences 2004 Additional Honors & Awards Stanford Graduate Fellowship (SGF) Additional Honors & Awards Stanford Graduate Fellowship (SGF) Additional Honors & Awards Stanford Graduate Fellowship (SGF) ", "Summary Highly interested on each project, good comprehension, good interpersonal relationship, familiar with USB, Ethernet, cable modem PHY layer, DC-DC power, DDR3, Flash, Battery pack unit, wireless test and Hardware design process development Summary Highly interested on each project, good comprehension, good interpersonal relationship, familiar with USB, Ethernet, cable modem PHY layer, DC-DC power, DDR3, Flash, Battery pack unit, wireless test and Hardware design process development Highly interested on each project, good comprehension, good interpersonal relationship, familiar with USB, Ethernet, cable modem PHY layer, DC-DC power, DDR3, Flash, Battery pack unit, wireless test and Hardware design process development Highly interested on each project, good comprehension, good interpersonal relationship, familiar with USB, Ethernet, cable modem PHY layer, DC-DC power, DDR3, Flash, Battery pack unit, wireless test and Hardware design process development Experience Senior Hardware Engineer ARRIS December 2012  – Present (2 years 8 months) Team leads of Cable Modem Project, Set-top-Box project team Senior Hardware Engineer Google August 2011  –  December 2012  (1 year 5 months) Team leads of Cable Modem Project Senior Hardware Engineer Motorola April 2008  –  August 2011  (3 years 5 months) Team leads of Cable Modem Project Hardware Engineer PRETEC January 2006  –  June 2007  (1 year 6 months) Project Leader of USB, SDIO related models Senior Hardware Engineer ARRIS December 2012  – Present (2 years 8 months) Team leads of Cable Modem Project, Set-top-Box project team Senior Hardware Engineer ARRIS December 2012  – Present (2 years 8 months) Team leads of Cable Modem Project, Set-top-Box project team Senior Hardware Engineer Google August 2011  –  December 2012  (1 year 5 months) Team leads of Cable Modem Project Senior Hardware Engineer Google August 2011  –  December 2012  (1 year 5 months) Team leads of Cable Modem Project Senior Hardware Engineer Motorola April 2008  –  August 2011  (3 years 5 months) Team leads of Cable Modem Project Senior Hardware Engineer Motorola April 2008  –  August 2011  (3 years 5 months) Team leads of Cable Modem Project Hardware Engineer PRETEC January 2006  –  June 2007  (1 year 6 months) Project Leader of USB, SDIO related models Hardware Engineer PRETEC January 2006  –  June 2007  (1 year 6 months) Project Leader of USB, SDIO related models Languages English Professional working proficiency Chinese Full professional proficiency English Professional working proficiency Chinese Full professional proficiency English Professional working proficiency Chinese Full professional proficiency Professional working proficiency Full professional proficiency Skills Top Skills 1 Design for Manufacturing 0 EMC compliance 0 PCB layout design 0 Cadence Schematic... 0 Microsoft Office Jason also knows about... 0 Allegro 0 Labview 0 Spectrum Analyzer 0 Network Analyzer 0 Project Scope... 0 BOM management 0 High Speed Interfaces 0 Manufacturing... 0 Battery Charger 0 SoC 0 VoIP 0 Wireless Networking 0 USB 0 Flash Memory 0 SDIO 0 OrCAD Capture CIS 0 Cadence See 2+     See less Skills  Top Skills 1 Design for Manufacturing 0 EMC compliance 0 PCB layout design 0 Cadence Schematic... 0 Microsoft Office Jason also knows about... 0 Allegro 0 Labview 0 Spectrum Analyzer 0 Network Analyzer 0 Project Scope... 0 BOM management 0 High Speed Interfaces 0 Manufacturing... 0 Battery Charger 0 SoC 0 VoIP 0 Wireless Networking 0 USB 0 Flash Memory 0 SDIO 0 OrCAD Capture CIS 0 Cadence See 2+     See less Top Skills 1 Design for Manufacturing 0 EMC compliance 0 PCB layout design 0 Cadence Schematic... 0 Microsoft Office Jason also knows about... 0 Allegro 0 Labview 0 Spectrum Analyzer 0 Network Analyzer 0 Project Scope... 0 BOM management 0 High Speed Interfaces 0 Manufacturing... 0 Battery Charger 0 SoC 0 VoIP 0 Wireless Networking 0 USB 0 Flash Memory 0 SDIO 0 OrCAD Capture CIS 0 Cadence See 2+     See less Top Skills 1 Design for Manufacturing 0 EMC compliance 0 PCB layout design 0 Cadence Schematic... 0 Microsoft Office Jason also knows about... 0 Allegro 0 Labview 0 Spectrum Analyzer 0 Network Analyzer 0 Project Scope... 0 BOM management 0 High Speed Interfaces 0 Manufacturing... 0 Battery Charger 0 SoC 0 VoIP 0 Wireless Networking 0 USB 0 Flash Memory 0 SDIO 0 OrCAD Capture CIS 0 Cadence See 2+     See less           0 Allegro 0 Labview 0 Spectrum Analyzer 0 Network Analyzer 0 Project Scope... 0 BOM management 0 High Speed Interfaces 0 Manufacturing... 0 Battery Charger 0 SoC 0 VoIP 0 Wireless Networking 0 USB 0 Flash Memory 0 SDIO 0 OrCAD Capture CIS 0 Cadence Education National Tsing Hua University Master's degree,  Electrical ,  Electronics and Communications Engineering 2003  – 2005 National Tsing Hua University Master's degree,  Electrical ,  Electronics and Communications Engineering 2003  – 2005 National Tsing Hua University Master's degree,  Electrical ,  Electronics and Communications Engineering 2003  – 2005 National Tsing Hua University Master's degree,  Electrical ,  Electronics and Communications Engineering 2003  – 2005 ", "Skills Top Skills 19 Cross-functional Team... 14 Digital Media 13 Digital Strategy 11 Project Management 11 Management 10 Online Advertising 5 Business Strategy 5 Advertising 5 Digital Marketing 4 Product Management Sandy also knows about... 3 Strategy 3 Process Improvement 2 Change Management 2 Google Adwords 1 Product Launch 1 Marketing 1 Online Marketing 0 Team Management 0 Display Advertising 0 Troubleshooting Skills  Top Skills 19 Cross-functional Team... 14 Digital Media 13 Digital Strategy 11 Project Management 11 Management 10 Online Advertising 5 Business Strategy 5 Advertising 5 Digital Marketing 4 Product Management Sandy also knows about... 3 Strategy 3 Process Improvement 2 Change Management 2 Google Adwords 1 Product Launch 1 Marketing 1 Online Marketing 0 Team Management 0 Display Advertising 0 Troubleshooting Top Skills 19 Cross-functional Team... 14 Digital Media 13 Digital Strategy 11 Project Management 11 Management 10 Online Advertising 5 Business Strategy 5 Advertising 5 Digital Marketing 4 Product Management Sandy also knows about... 3 Strategy 3 Process Improvement 2 Change Management 2 Google Adwords 1 Product Launch 1 Marketing 1 Online Marketing 0 Team Management 0 Display Advertising 0 Troubleshooting Top Skills 19 Cross-functional Team... 14 Digital Media 13 Digital Strategy 11 Project Management 11 Management 10 Online Advertising 5 Business Strategy 5 Advertising 5 Digital Marketing 4 Product Management Sandy also knows about... 3 Strategy 3 Process Improvement 2 Change Management 2 Google Adwords 1 Product Launch 1 Marketing 1 Online Marketing 0 Team Management 0 Display Advertising 0 Troubleshooting                     3 Strategy 3 Process Improvement 2 Change Management 2 Google Adwords 1 Product Launch 1 Marketing 1 Online Marketing 0 Team Management 0 Display Advertising 0 Troubleshooting ", "Languages English Native or bilingual proficiency Chinese Limited working proficiency German Limited working proficiency English Native or bilingual proficiency Chinese Limited working proficiency German Limited working proficiency English Native or bilingual proficiency Chinese Limited working proficiency German Limited working proficiency Native or bilingual proficiency Limited working proficiency Limited working proficiency Skills Top Skills 8 Software Development 6 C 6 Databases 5 C++ 4 Matlab 3 Python 3 Java 2 Signal Processing 2 Web Development 2 Algorithms Aaron also knows about... 2 Computer Science 1 Verilog 1 Network Administration 1 Microsoft Office 0 Unix 0 PHP 0 Microsoft Excel 0 PowerPoint 0 Microsoft Word 0 Photoshop 0 Customer Service 0 HTML 0 Social Media 0 Windows 0 SQL 0 Perl 0 Teamwork 0 Mac OS X 0 English 0 Public Speaking 0 Research 0 Circuit Design 0 Machine Learning 0 Computer Hardware 0 FPGA 0 Medical Devices 0 Network Security 0 Android Development 0 Medical Imaging 0 Image Processing See 15+     See less Skills  Top Skills 8 Software Development 6 C 6 Databases 5 C++ 4 Matlab 3 Python 3 Java 2 Signal Processing 2 Web Development 2 Algorithms Aaron also knows about... 2 Computer Science 1 Verilog 1 Network Administration 1 Microsoft Office 0 Unix 0 PHP 0 Microsoft Excel 0 PowerPoint 0 Microsoft Word 0 Photoshop 0 Customer Service 0 HTML 0 Social Media 0 Windows 0 SQL 0 Perl 0 Teamwork 0 Mac OS X 0 English 0 Public Speaking 0 Research 0 Circuit Design 0 Machine Learning 0 Computer Hardware 0 FPGA 0 Medical Devices 0 Network Security 0 Android Development 0 Medical Imaging 0 Image Processing See 15+     See less Top Skills 8 Software Development 6 C 6 Databases 5 C++ 4 Matlab 3 Python 3 Java 2 Signal Processing 2 Web Development 2 Algorithms Aaron also knows about... 2 Computer Science 1 Verilog 1 Network Administration 1 Microsoft Office 0 Unix 0 PHP 0 Microsoft Excel 0 PowerPoint 0 Microsoft Word 0 Photoshop 0 Customer Service 0 HTML 0 Social Media 0 Windows 0 SQL 0 Perl 0 Teamwork 0 Mac OS X 0 English 0 Public Speaking 0 Research 0 Circuit Design 0 Machine Learning 0 Computer Hardware 0 FPGA 0 Medical Devices 0 Network Security 0 Android Development 0 Medical Imaging 0 Image Processing See 15+     See less Top Skills 8 Software Development 6 C 6 Databases 5 C++ 4 Matlab 3 Python 3 Java 2 Signal Processing 2 Web Development 2 Algorithms Aaron also knows about... 2 Computer Science 1 Verilog 1 Network Administration 1 Microsoft Office 0 Unix 0 PHP 0 Microsoft Excel 0 PowerPoint 0 Microsoft Word 0 Photoshop 0 Customer Service 0 HTML 0 Social Media 0 Windows 0 SQL 0 Perl 0 Teamwork 0 Mac OS X 0 English 0 Public Speaking 0 Research 0 Circuit Design 0 Machine Learning 0 Computer Hardware 0 FPGA 0 Medical Devices 0 Network Security 0 Android Development 0 Medical Imaging 0 Image Processing See 15+     See less                     2 Computer Science 1 Verilog 1 Network Administration 1 Microsoft Office 0 Unix 0 PHP 0 Microsoft Excel 0 PowerPoint 0 Microsoft Word 0 Photoshop 0 Customer Service 0 HTML 0 Social Media 0 Windows 0 SQL 0 Perl 0 Teamwork 0 Mac OS X 0 English 0 Public Speaking 0 Research 0 Circuit Design 0 Machine Learning 0 Computer Hardware 0 FPGA 0 Medical Devices 0 Network Security 0 Android Development 0 Medical Imaging 0 Image Processing Honors & Awards ", "Experience Hardware Engineer Google December 2013  – Present (1 year 8 months) Power engineer for consumer electronics, including adapter, battery management and POL. Hardware Engineer Google May 2011  –  December 2013  (2 years 8 months) Power Engineer for data center, power architecture and power capping Sr. Application Engineer Monolithic Power Systems May 2009  –  May 2011  (2 years 1 month) Define controller and design DC/DC converters Electrical Engineer Celestica Power Supply Division (Presently Murata Power Solutions) June 2003  –  August 2003  (3 months) Hardware Engineer Google December 2013  – Present (1 year 8 months) Power engineer for consumer electronics, including adapter, battery management and POL. Hardware Engineer Google December 2013  – Present (1 year 8 months) Power engineer for consumer electronics, including adapter, battery management and POL. Hardware Engineer Google May 2011  –  December 2013  (2 years 8 months) Power Engineer for data center, power architecture and power capping Hardware Engineer Google May 2011  –  December 2013  (2 years 8 months) Power Engineer for data center, power architecture and power capping Sr. Application Engineer Monolithic Power Systems May 2009  –  May 2011  (2 years 1 month) Define controller and design DC/DC converters Sr. Application Engineer Monolithic Power Systems May 2009  –  May 2011  (2 years 1 month) Define controller and design DC/DC converters Electrical Engineer Celestica Power Supply Division (Presently Murata Power Solutions) June 2003  –  August 2003  (3 months) Electrical Engineer Celestica Power Supply Division (Presently Murata Power Solutions) June 2003  –  August 2003  (3 months) Skills 38 Power Supplies 28 Analog 23 Power Electronics 21 Power Management Skills  38 Power Supplies 28 Analog 23 Power Electronics 21 Power Management 38 Power Supplies 28 Analog 23 Power Electronics 21 Power Management 38 Power Supplies 28 Analog 23 Power Electronics 21 Power Management         Education Virginia Polytechnic Institute and State University Ph.D,  Power Electronics 2004  – 2009 University of Idaho Ph.D.,  Power Electronics 2003  – 2004 South China University of Technology M.S.,  Power Electronics 2000  – 2003 Xi'an Jiaotong University B.S. 1994  – 1998 Virginia Polytechnic Institute and State University Ph.D,  Power Electronics 2004  – 2009 Virginia Polytechnic Institute and State University Ph.D,  Power Electronics 2004  – 2009 Virginia Polytechnic Institute and State University Ph.D,  Power Electronics 2004  – 2009 University of Idaho Ph.D.,  Power Electronics 2003  – 2004 University of Idaho Ph.D.,  Power Electronics 2003  – 2004 University of Idaho Ph.D.,  Power Electronics 2003  – 2004 South China University of Technology M.S.,  Power Electronics 2000  – 2003 South China University of Technology M.S.,  Power Electronics 2000  – 2003 South China University of Technology M.S.,  Power Electronics 2000  – 2003 Xi'an Jiaotong University B.S. 1994  – 1998 Xi'an Jiaotong University B.S. 1994  – 1998 Xi'an Jiaotong University B.S. 1994  – 1998 ", "Summary Currently working in Google's Platforms group, which develops hardware for Google's data centers. As Google considers its data centers to be an important competitive advantage, most of the information is highly confidential. \n \nIf you want to join Google and you don't know me, do NOT send me a connection request. I can't help you if I don't know you. You are better off just submitting your resume online. If I do know you, then I will definitely help as much as I can. \n \nPreviously, founded Indra Networks, which developed compression and encryption accelerators for SSDs, backup servers / appliances, Virtual Tape LIbraries (VTLs), Web load balancers, etc. \n \nBefore that, I spent 13 years at Hewlett Packard in hardware R&D. This included extensive experience in graphics, multimedia and system architecture. My present interests are in hardware acceleration of storage and networking applications. \n \nSpecialties: NAND flash for storage, ASIC/FPGA design, hardware acceleration of software algorithms, system architecture Summary Currently working in Google's Platforms group, which develops hardware for Google's data centers. As Google considers its data centers to be an important competitive advantage, most of the information is highly confidential. \n \nIf you want to join Google and you don't know me, do NOT send me a connection request. I can't help you if I don't know you. You are better off just submitting your resume online. If I do know you, then I will definitely help as much as I can. \n \nPreviously, founded Indra Networks, which developed compression and encryption accelerators for SSDs, backup servers / appliances, Virtual Tape LIbraries (VTLs), Web load balancers, etc. \n \nBefore that, I spent 13 years at Hewlett Packard in hardware R&D. This included extensive experience in graphics, multimedia and system architecture. My present interests are in hardware acceleration of storage and networking applications. \n \nSpecialties: NAND flash for storage, ASIC/FPGA design, hardware acceleration of software algorithms, system architecture Currently working in Google's Platforms group, which develops hardware for Google's data centers. As Google considers its data centers to be an important competitive advantage, most of the information is highly confidential. \n \nIf you want to join Google and you don't know me, do NOT send me a connection request. I can't help you if I don't know you. You are better off just submitting your resume online. If I do know you, then I will definitely help as much as I can. \n \nPreviously, founded Indra Networks, which developed compression and encryption accelerators for SSDs, backup servers / appliances, Virtual Tape LIbraries (VTLs), Web load balancers, etc. \n \nBefore that, I spent 13 years at Hewlett Packard in hardware R&D. This included extensive experience in graphics, multimedia and system architecture. My present interests are in hardware acceleration of storage and networking applications. \n \nSpecialties: NAND flash for storage, ASIC/FPGA design, hardware acceleration of software algorithms, system architecture Currently working in Google's Platforms group, which develops hardware for Google's data centers. As Google considers its data centers to be an important competitive advantage, most of the information is highly confidential. \n \nIf you want to join Google and you don't know me, do NOT send me a connection request. I can't help you if I don't know you. You are better off just submitting your resume online. If I do know you, then I will definitely help as much as I can. \n \nPreviously, founded Indra Networks, which developed compression and encryption accelerators for SSDs, backup servers / appliances, Virtual Tape LIbraries (VTLs), Web load balancers, etc. \n \nBefore that, I spent 13 years at Hewlett Packard in hardware R&D. This included extensive experience in graphics, multimedia and system architecture. My present interests are in hardware acceleration of storage and networking applications. \n \nSpecialties: NAND flash for storage, ASIC/FPGA design, hardware acceleration of software algorithms, system architecture Experience Staff Hardware Engineer Google September 2013  – Present (1 year 11 months) Mountain View, CA Architecture and design of hardware products for Google's datacenters. \n \nGoogle's representative on NVM Express organization. CEO / CTO Indra Networks, Inc. August 2012  –  August 2013  (1 year 1 month) Sr. Hardware Engineer Google, Inc. December 2011  –  August 2012  (9 months) Mountain View, CA Architecture and design of hardware infrastructure for Google's datacenters. Founder & CEO Indra Networks January 2001  –  November 2011  (10 years 11 months) (Open) 2 recommendations Sandeep Marode Lead Engineer/Technologist (FPGA & Firmware ) at GE Oil & Gas It was the best experience working at Indra Networks under Monish. He always inspires a lot to everyone working under his... View Amar Agnihotri Manager, Hardware Design Group at Virident Systems, Inc. I started my career with Indra Networks. I reported directly to Monish. Learned lot of good design practices while working... View President Ascent Software February 1998  –  December 2000  (2 years 11 months) Engineer / Scientist Hewlett Packard Company October 1984  –  January 1998  (13 years 4 months) Staff Hardware Engineer Google September 2013  – Present (1 year 11 months) Mountain View, CA Architecture and design of hardware products for Google's datacenters. \n \nGoogle's representative on NVM Express organization. Staff Hardware Engineer Google September 2013  – Present (1 year 11 months) Mountain View, CA Architecture and design of hardware products for Google's datacenters. \n \nGoogle's representative on NVM Express organization. CEO / CTO Indra Networks, Inc. August 2012  –  August 2013  (1 year 1 month) CEO / CTO Indra Networks, Inc. August 2012  –  August 2013  (1 year 1 month) Sr. Hardware Engineer Google, Inc. December 2011  –  August 2012  (9 months) Mountain View, CA Architecture and design of hardware infrastructure for Google's datacenters. Sr. Hardware Engineer Google, Inc. December 2011  –  August 2012  (9 months) Mountain View, CA Architecture and design of hardware infrastructure for Google's datacenters. Founder & CEO Indra Networks January 2001  –  November 2011  (10 years 11 months) (Open) 2 recommendations Sandeep Marode Lead Engineer/Technologist (FPGA & Firmware ) at GE Oil & Gas It was the best experience working at Indra Networks under Monish. He always inspires a lot to everyone working under his... View Amar Agnihotri Manager, Hardware Design Group at Virident Systems, Inc. I started my career with Indra Networks. I reported directly to Monish. Learned lot of good design practices while working... View Founder & CEO Indra Networks January 2001  –  November 2011  (10 years 11 months) (Open) 2 recommendations Sandeep Marode Lead Engineer/Technologist (FPGA & Firmware ) at GE Oil & Gas It was the best experience working at Indra Networks under Monish. He always inspires a lot to everyone working under his... View Amar Agnihotri Manager, Hardware Design Group at Virident Systems, Inc. I started my career with Indra Networks. I reported directly to Monish. Learned lot of good design practices while working... View President Ascent Software February 1998  –  December 2000  (2 years 11 months) President Ascent Software February 1998  –  December 2000  (2 years 11 months) Engineer / Scientist Hewlett Packard Company October 1984  –  January 1998  (13 years 4 months) Engineer / Scientist Hewlett Packard Company October 1984  –  January 1998  (13 years 4 months) Languages Hindi Gujarati Hindi Gujarati Hindi Gujarati Skills 12 System Architecture 12 FPGA 9 Hardware Architecture 8 ASIC 5 Debugging 4 Verilog 4 Device Drivers 1 Hardware Development Skills  12 System Architecture 12 FPGA 9 Hardware Architecture 8 ASIC 5 Debugging 4 Verilog 4 Device Drivers 1 Hardware Development 12 System Architecture 12 FPGA 9 Hardware Architecture 8 ASIC 5 Debugging 4 Verilog 4 Device Drivers 1 Hardware Development 12 System Architecture 12 FPGA 9 Hardware Architecture 8 ASIC 5 Debugging 4 Verilog 4 Device Drivers 1 Hardware Development                 Education Stanford University Master of Science,  Electrical Engineering 1988  – 1989 Texas A&M University BSEE,  Electrical Engineering 1981  – 1984 Stanford University Master of Science,  Electrical Engineering 1988  – 1989 Stanford University Master of Science,  Electrical Engineering 1988  – 1989 Stanford University Master of Science,  Electrical Engineering 1988  – 1989 Texas A&M University BSEE,  Electrical Engineering 1981  – 1984 Texas A&M University BSEE,  Electrical Engineering 1981  – 1984 Texas A&M University BSEE,  Electrical Engineering 1981  – 1984 ", "Experience Hardware Engineer Google June 2015  – Present (2 months) Mountain View, CA Hardware Engineer Hewlett Packard April 2013  –  June 2015  (2 years 3 months) Fremont, CA Senior Hardware Engineer Lockheed Martin July 2001  –  March 2013  (11 years 9 months) Hardware Engineer Applied Signal Technology 1998  –  2001  (3 years) Hardware Engineer Larus 1995  –  1998  (3 years) Hardware Engineer Google June 2015  – Present (2 months) Mountain View, CA Hardware Engineer Google June 2015  – Present (2 months) Mountain View, CA Hardware Engineer Hewlett Packard April 2013  –  June 2015  (2 years 3 months) Fremont, CA Hardware Engineer Hewlett Packard April 2013  –  June 2015  (2 years 3 months) Fremont, CA Senior Hardware Engineer Lockheed Martin July 2001  –  March 2013  (11 years 9 months) Senior Hardware Engineer Lockheed Martin July 2001  –  March 2013  (11 years 9 months) Hardware Engineer Applied Signal Technology 1998  –  2001  (3 years) Hardware Engineer Applied Signal Technology 1998  –  2001  (3 years) Hardware Engineer Larus 1995  –  1998  (3 years) Hardware Engineer Larus 1995  –  1998  (3 years) Skills Top Skills 22 Hardware 21 Systems Engineering 18 System Architecture 12 Engineering Management 10 Embedded Systems 10 FPGA 8 Hardware Architecture 7 Integration 7 Testing 5 Requirements Management Greg also knows about... 4 Earned Value Management 4 System Design 4 Program Management 3 Simulations 3 Systems Design 2 Aerospace Skills  Top Skills 22 Hardware 21 Systems Engineering 18 System Architecture 12 Engineering Management 10 Embedded Systems 10 FPGA 8 Hardware Architecture 7 Integration 7 Testing 5 Requirements Management Greg also knows about... 4 Earned Value Management 4 System Design 4 Program Management 3 Simulations 3 Systems Design 2 Aerospace Top Skills 22 Hardware 21 Systems Engineering 18 System Architecture 12 Engineering Management 10 Embedded Systems 10 FPGA 8 Hardware Architecture 7 Integration 7 Testing 5 Requirements Management Greg also knows about... 4 Earned Value Management 4 System Design 4 Program Management 3 Simulations 3 Systems Design 2 Aerospace Top Skills 22 Hardware 21 Systems Engineering 18 System Architecture 12 Engineering Management 10 Embedded Systems 10 FPGA 8 Hardware Architecture 7 Integration 7 Testing 5 Requirements Management Greg also knows about... 4 Earned Value Management 4 System Design 4 Program Management 3 Simulations 3 Systems Design 2 Aerospace                     4 Earned Value Management 4 System Design 4 Program Management 3 Simulations 3 Systems Design 2 Aerospace Education California State University-Sacramento BSEE,  Electrical and Electronics Engineering 1982  – 1986 California State University-Sacramento BSEE,  Electrical and Electronics Engineering 1982  – 1986 California State University-Sacramento BSEE,  Electrical and Electronics Engineering 1982  – 1986 California State University-Sacramento BSEE,  Electrical and Electronics Engineering 1982  – 1986 ", "Summary Highly motivated, multi-tasked and detail-oriented Quality Engineering Professional with strong technical skills and management experiences. Exceptional team builder and spearhead with extensive lean manufacturing experiences of new product development, project launching and post-production environment for Medical, Automotive, Green and Consumer product. Adaptable self-starter and dedicated mentor with a proven track record of initiating & managing cross-functional collaboration and leading Product Quality Engineer / Supplier Quality Engineer to achieve quality goal and desired company’s objectives. Specialties:APQP, Quality Assurance Planning, Qualification Protocol, DFM, Design Review, GD&T, MSA, Checking Aid Design and Development, Inspection System Development, QFD, DFMEA, PFMEA, Control Plan, PPAP, SPC, Process Window Study, Super DOE, Six Sigma, Supply-Chain Management, IQ/OQ/PQ, Process Validation, TPS, NPI, Kaizen, ISO9001, ISO13485, TS16949, Internal Auditor, Risk Management, Resource Management, Yield Improvement, Goal and Objectives, Hoshin-Kanri, Visual Management, Problem Solving Summary Highly motivated, multi-tasked and detail-oriented Quality Engineering Professional with strong technical skills and management experiences. Exceptional team builder and spearhead with extensive lean manufacturing experiences of new product development, project launching and post-production environment for Medical, Automotive, Green and Consumer product. Adaptable self-starter and dedicated mentor with a proven track record of initiating & managing cross-functional collaboration and leading Product Quality Engineer / Supplier Quality Engineer to achieve quality goal and desired company’s objectives. Specialties:APQP, Quality Assurance Planning, Qualification Protocol, DFM, Design Review, GD&T, MSA, Checking Aid Design and Development, Inspection System Development, QFD, DFMEA, PFMEA, Control Plan, PPAP, SPC, Process Window Study, Super DOE, Six Sigma, Supply-Chain Management, IQ/OQ/PQ, Process Validation, TPS, NPI, Kaizen, ISO9001, ISO13485, TS16949, Internal Auditor, Risk Management, Resource Management, Yield Improvement, Goal and Objectives, Hoshin-Kanri, Visual Management, Problem Solving Highly motivated, multi-tasked and detail-oriented Quality Engineering Professional with strong technical skills and management experiences. Exceptional team builder and spearhead with extensive lean manufacturing experiences of new product development, project launching and post-production environment for Medical, Automotive, Green and Consumer product. Adaptable self-starter and dedicated mentor with a proven track record of initiating & managing cross-functional collaboration and leading Product Quality Engineer / Supplier Quality Engineer to achieve quality goal and desired company’s objectives. Specialties:APQP, Quality Assurance Planning, Qualification Protocol, DFM, Design Review, GD&T, MSA, Checking Aid Design and Development, Inspection System Development, QFD, DFMEA, PFMEA, Control Plan, PPAP, SPC, Process Window Study, Super DOE, Six Sigma, Supply-Chain Management, IQ/OQ/PQ, Process Validation, TPS, NPI, Kaizen, ISO9001, ISO13485, TS16949, Internal Auditor, Risk Management, Resource Management, Yield Improvement, Goal and Objectives, Hoshin-Kanri, Visual Management, Problem Solving Highly motivated, multi-tasked and detail-oriented Quality Engineering Professional with strong technical skills and management experiences. Exceptional team builder and spearhead with extensive lean manufacturing experiences of new product development, project launching and post-production environment for Medical, Automotive, Green and Consumer product. Adaptable self-starter and dedicated mentor with a proven track record of initiating & managing cross-functional collaboration and leading Product Quality Engineer / Supplier Quality Engineer to achieve quality goal and desired company’s objectives. Specialties:APQP, Quality Assurance Planning, Qualification Protocol, DFM, Design Review, GD&T, MSA, Checking Aid Design and Development, Inspection System Development, QFD, DFMEA, PFMEA, Control Plan, PPAP, SPC, Process Window Study, Super DOE, Six Sigma, Supply-Chain Management, IQ/OQ/PQ, Process Validation, TPS, NPI, Kaizen, ISO9001, ISO13485, TS16949, Internal Auditor, Risk Management, Resource Management, Yield Improvement, Goal and Objectives, Hoshin-Kanri, Visual Management, Problem Solving Experience Staff Hardware Engineer Google May 2014  – Present (1 year 3 months) Japan Supplier Development & Quality \nAdvanced Technology Research \nGoogle [X] Senior Hardware Engineer Google December 2012  –  May 2014  (1 year 6 months) Mountain View, CA Supplier Development & Quality Engineering \nGoogle Glass - Google [X] Supply Chain Quality Assurance Tesla Motors March 2012  –  November 2012  (9 months) Palo Alto, CA Model S - Body & Exterior - Supplier Quality Engineering Senior Manager, Quality Engineering Plastikon Industries May 2011  –  March 2012  (11 months) Quality Develoment, Project Management - Interior & Exterior, Solar & Medical product Injection molding (Open) 5 recommendations, including: Ciaran Keane Plastics Tooling Engineer at Apple I would like to recommend Daisuke as a very competent manager whom I have worked with for a number of years on a range of... View Mike Friddle Tooling Manager at Inplast Industries I Have had the honor to work side by side on the Plastikon Engineering Management team with Daisuke.\nHe is a very goal... View 3 more recommendations Quality Engineering Manager / Engineering Manager Plastikon Industries May 2006  –  May 2011  (5 years 1 month) Quality Develoment, Project Management - Interior & Exterior, Solar & Medical product Injection molding \n \nQuality Develoment - Interior & Exterior Injection molding product for 2008 Toyota Corolla (Open) 1 recommendation Marisa Richardson Senior Manager, Program Management Office at Thermo Fisher Scientific During my assignment as Production Manager, Kashi-san was a tremendous resource and mentor, supporting the manufacturing floor in problem solving quality issues and finding kaizen opportunities using a systematic / PDCA-style approach. He has a work... View Senior Manufacturing & Supplier Quality Engineer Hino Motors (Toyota Body Maker) November 2004  –  May 2006  (1 year 7 months) Vehicle Quality and Supplier Quality development - Exterior, Body and Paint Quality for 2006 Toyota FJ Cruiser Senior Manufacturing & Supplier Quality Engineer Toyota Motor Corporation November 2002  –  October 2004  (2 years) Vehicle Quality and Supplier Quality development - Exterior, Body and Paint Quality for 2004 Toyota Tacoma (Nummi and TMMBC) (Open) 3 recommendations, including: Terry Lee Assistant Manager Quality Engineering at Toyota Motor Manufacturing Texas I met Kashihara-san in Japan while working on the Toyota Tacoma Project in 2002. He worked as a quality specialist... View Dat (Doug) Lam Head of Product Quality, Life Science Mass Spectrometry at Thermo Fisher Scientific Daisuke was one of my key Toyota support leaders when I was directing the launch of the 2008 Tacoma Truck New Model project... View 1 more recommendation Manufacturing & Supplier Quality Engineer Hino Motors (Toyota Body Maker) April 1999  –  October 2002  (3 years 7 months) Vehicle Quality and Supplier Quality development - Exterior, Body and Paint Quality for Toyota 4 Runner, Hilux and Dyna/Dutro Staff Hardware Engineer Google May 2014  – Present (1 year 3 months) Japan Supplier Development & Quality \nAdvanced Technology Research \nGoogle [X] Staff Hardware Engineer Google May 2014  – Present (1 year 3 months) Japan Supplier Development & Quality \nAdvanced Technology Research \nGoogle [X] Senior Hardware Engineer Google December 2012  –  May 2014  (1 year 6 months) Mountain View, CA Supplier Development & Quality Engineering \nGoogle Glass - Google [X] Senior Hardware Engineer Google December 2012  –  May 2014  (1 year 6 months) Mountain View, CA Supplier Development & Quality Engineering \nGoogle Glass - Google [X] Supply Chain Quality Assurance Tesla Motors March 2012  –  November 2012  (9 months) Palo Alto, CA Model S - Body & Exterior - Supplier Quality Engineering Supply Chain Quality Assurance Tesla Motors March 2012  –  November 2012  (9 months) Palo Alto, CA Model S - Body & Exterior - Supplier Quality Engineering Senior Manager, Quality Engineering Plastikon Industries May 2011  –  March 2012  (11 months) Quality Develoment, Project Management - Interior & Exterior, Solar & Medical product Injection molding (Open) 5 recommendations, including: Ciaran Keane Plastics Tooling Engineer at Apple I would like to recommend Daisuke as a very competent manager whom I have worked with for a number of years on a range of... View Mike Friddle Tooling Manager at Inplast Industries I Have had the honor to work side by side on the Plastikon Engineering Management team with Daisuke.\nHe is a very goal... View 3 more recommendations Senior Manager, Quality Engineering Plastikon Industries May 2011  –  March 2012  (11 months) Quality Develoment, Project Management - Interior & Exterior, Solar & Medical product Injection molding (Open) 5 recommendations, including: Ciaran Keane Plastics Tooling Engineer at Apple I would like to recommend Daisuke as a very competent manager whom I have worked with for a number of years on a range of... View Mike Friddle Tooling Manager at Inplast Industries I Have had the honor to work side by side on the Plastikon Engineering Management team with Daisuke.\nHe is a very goal... View 3 more recommendations Quality Engineering Manager / Engineering Manager Plastikon Industries May 2006  –  May 2011  (5 years 1 month) Quality Develoment, Project Management - Interior & Exterior, Solar & Medical product Injection molding \n \nQuality Develoment - Interior & Exterior Injection molding product for 2008 Toyota Corolla (Open) 1 recommendation Marisa Richardson Senior Manager, Program Management Office at Thermo Fisher Scientific During my assignment as Production Manager, Kashi-san was a tremendous resource and mentor, supporting the manufacturing floor in problem solving quality issues and finding kaizen opportunities using a systematic / PDCA-style approach. He has a work... View Quality Engineering Manager / Engineering Manager Plastikon Industries May 2006  –  May 2011  (5 years 1 month) Quality Develoment, Project Management - Interior & Exterior, Solar & Medical product Injection molding \n \nQuality Develoment - Interior & Exterior Injection molding product for 2008 Toyota Corolla (Open) 1 recommendation Marisa Richardson Senior Manager, Program Management Office at Thermo Fisher Scientific During my assignment as Production Manager, Kashi-san was a tremendous resource and mentor, supporting the manufacturing floor in problem solving quality issues and finding kaizen opportunities using a systematic / PDCA-style approach. He has a work... View Senior Manufacturing & Supplier Quality Engineer Hino Motors (Toyota Body Maker) November 2004  –  May 2006  (1 year 7 months) Vehicle Quality and Supplier Quality development - Exterior, Body and Paint Quality for 2006 Toyota FJ Cruiser Senior Manufacturing & Supplier Quality Engineer Hino Motors (Toyota Body Maker) November 2004  –  May 2006  (1 year 7 months) Vehicle Quality and Supplier Quality development - Exterior, Body and Paint Quality for 2006 Toyota FJ Cruiser Senior Manufacturing & Supplier Quality Engineer Toyota Motor Corporation November 2002  –  October 2004  (2 years) Vehicle Quality and Supplier Quality development - Exterior, Body and Paint Quality for 2004 Toyota Tacoma (Nummi and TMMBC) (Open) 3 recommendations, including: Terry Lee Assistant Manager Quality Engineering at Toyota Motor Manufacturing Texas I met Kashihara-san in Japan while working on the Toyota Tacoma Project in 2002. He worked as a quality specialist... View Dat (Doug) Lam Head of Product Quality, Life Science Mass Spectrometry at Thermo Fisher Scientific Daisuke was one of my key Toyota support leaders when I was directing the launch of the 2008 Tacoma Truck New Model project... View 1 more recommendation Senior Manufacturing & Supplier Quality Engineer Toyota Motor Corporation November 2002  –  October 2004  (2 years) Vehicle Quality and Supplier Quality development - Exterior, Body and Paint Quality for 2004 Toyota Tacoma (Nummi and TMMBC) (Open) 3 recommendations, including: Terry Lee Assistant Manager Quality Engineering at Toyota Motor Manufacturing Texas I met Kashihara-san in Japan while working on the Toyota Tacoma Project in 2002. He worked as a quality specialist... View Dat (Doug) Lam Head of Product Quality, Life Science Mass Spectrometry at Thermo Fisher Scientific Daisuke was one of my key Toyota support leaders when I was directing the launch of the 2008 Tacoma Truck New Model project... View 1 more recommendation Manufacturing & Supplier Quality Engineer Hino Motors (Toyota Body Maker) April 1999  –  October 2002  (3 years 7 months) Vehicle Quality and Supplier Quality development - Exterior, Body and Paint Quality for Toyota 4 Runner, Hilux and Dyna/Dutro Manufacturing & Supplier Quality Engineer Hino Motors (Toyota Body Maker) April 1999  –  October 2002  (3 years 7 months) Vehicle Quality and Supplier Quality development - Exterior, Body and Paint Quality for Toyota 4 Runner, Hilux and Dyna/Dutro Languages   Skills Top Skills 34 Kaizen 33 SPC 31 Lean Manufacturing 29 Six Sigma 18 PPAP 15 Continuous Improvement 15 Manufacturing 12 Toyota Production System 11 APQP 10 Quality System Daisuke also knows about... 9 Product Development 8 Cross-functional Team... 7 JIT 6 Design for Manufacturing 5 Problem Solving 5 Automotive 3 TS16949 3 Injection Molding 3 Engineering Management 3 FMEA 2 PFMEA 1 Supply Chain Management 1 Fixture Design 1 Hoshin Kanri 1 Minitab 1 Engineering 1 Quality Management 1 ISO 1 5S 1 Quality Assurance 1 Quality Control 1 Root Cause Analysis 1 TQM 1 Kanban 1 Iso 9000 0 DFMEA 0 GD&T 0 IQ/OQ/PQ 0 Design Review 0 NPI Management 0 Value Engineering 0 Risk Assessment 0 Measurement System... 0 Super DOE 0 QMS audit 0 Process/Product audit 0 Logical Approach 0 Visual Management 0 Risk Management 0 Resource Management See 25+     See less Skills  Top Skills 34 Kaizen 33 SPC 31 Lean Manufacturing 29 Six Sigma 18 PPAP 15 Continuous Improvement 15 Manufacturing 12 Toyota Production System 11 APQP 10 Quality System Daisuke also knows about... 9 Product Development 8 Cross-functional Team... 7 JIT 6 Design for Manufacturing 5 Problem Solving 5 Automotive 3 TS16949 3 Injection Molding 3 Engineering Management 3 FMEA 2 PFMEA 1 Supply Chain Management 1 Fixture Design 1 Hoshin Kanri 1 Minitab 1 Engineering 1 Quality Management 1 ISO 1 5S 1 Quality Assurance 1 Quality Control 1 Root Cause Analysis 1 TQM 1 Kanban 1 Iso 9000 0 DFMEA 0 GD&T 0 IQ/OQ/PQ 0 Design Review 0 NPI Management 0 Value Engineering 0 Risk Assessment 0 Measurement System... 0 Super DOE 0 QMS audit 0 Process/Product audit 0 Logical Approach 0 Visual Management 0 Risk Management 0 Resource Management See 25+     See less Top Skills 34 Kaizen 33 SPC 31 Lean Manufacturing 29 Six Sigma 18 PPAP 15 Continuous Improvement 15 Manufacturing 12 Toyota Production System 11 APQP 10 Quality System Daisuke also knows about... 9 Product Development 8 Cross-functional Team... 7 JIT 6 Design for Manufacturing 5 Problem Solving 5 Automotive 3 TS16949 3 Injection Molding 3 Engineering Management 3 FMEA 2 PFMEA 1 Supply Chain Management 1 Fixture Design 1 Hoshin Kanri 1 Minitab 1 Engineering 1 Quality Management 1 ISO 1 5S 1 Quality Assurance 1 Quality Control 1 Root Cause Analysis 1 TQM 1 Kanban 1 Iso 9000 0 DFMEA 0 GD&T 0 IQ/OQ/PQ 0 Design Review 0 NPI Management 0 Value Engineering 0 Risk Assessment 0 Measurement System... 0 Super DOE 0 QMS audit 0 Process/Product audit 0 Logical Approach 0 Visual Management 0 Risk Management 0 Resource Management See 25+     See less Top Skills 34 Kaizen 33 SPC 31 Lean Manufacturing 29 Six Sigma 18 PPAP 15 Continuous Improvement 15 Manufacturing 12 Toyota Production System 11 APQP 10 Quality System Daisuke also knows about... 9 Product Development 8 Cross-functional Team... 7 JIT 6 Design for Manufacturing 5 Problem Solving 5 Automotive 3 TS16949 3 Injection Molding 3 Engineering Management 3 FMEA 2 PFMEA 1 Supply Chain Management 1 Fixture Design 1 Hoshin Kanri 1 Minitab 1 Engineering 1 Quality Management 1 ISO 1 5S 1 Quality Assurance 1 Quality Control 1 Root Cause Analysis 1 TQM 1 Kanban 1 Iso 9000 0 DFMEA 0 GD&T 0 IQ/OQ/PQ 0 Design Review 0 NPI Management 0 Value Engineering 0 Risk Assessment 0 Measurement System... 0 Super DOE 0 QMS audit 0 Process/Product audit 0 Logical Approach 0 Visual Management 0 Risk Management 0 Resource Management See 25+     See less                     9 Product Development 8 Cross-functional Team... 7 JIT 6 Design for Manufacturing 5 Problem Solving 5 Automotive 3 TS16949 3 Injection Molding 3 Engineering Management 3 FMEA 2 PFMEA 1 Supply Chain Management 1 Fixture Design 1 Hoshin Kanri 1 Minitab 1 Engineering 1 Quality Management 1 ISO 1 5S 1 Quality Assurance 1 Quality Control 1 Root Cause Analysis 1 TQM 1 Kanban 1 Iso 9000 0 DFMEA 0 GD&T 0 IQ/OQ/PQ 0 Design Review 0 NPI Management 0 Value Engineering 0 Risk Assessment 0 Measurement System... 0 Super DOE 0 QMS audit 0 Process/Product audit 0 Logical Approach 0 Visual Management 0 Risk Management 0 Resource Management Education Tokyo Metropolitan Institute of Technology Master,  Mechanical Engineering ,  Fluid Dynamics 1997  – 1999 Tokyo Metropolitan Institute of Technology Bachelor,  Mechanical Engineering 1993  – 1997 Tokyo Metropolitan Institute of Technology Master,  Mechanical Engineering ,  Fluid Dynamics 1997  – 1999 Tokyo Metropolitan Institute of Technology Master,  Mechanical Engineering ,  Fluid Dynamics 1997  – 1999 Tokyo Metropolitan Institute of Technology Master,  Mechanical Engineering ,  Fluid Dynamics 1997  – 1999 Tokyo Metropolitan Institute of Technology Bachelor,  Mechanical Engineering 1993  – 1997 Tokyo Metropolitan Institute of Technology Bachelor,  Mechanical Engineering 1993  – 1997 Tokyo Metropolitan Institute of Technology Bachelor,  Mechanical Engineering 1993  – 1997 Honors & Awards "]}