{"position": "Senior Engineering Program Manager", "company": "Intel Corporation", "profiles": ["Summary Lead Engineer for the industry leader in semiconductor computing products with skills and experience that quickly transfer to engineering innovations across a broad spectrum of industries. An accomplished senior engineer and published researcher with a history of combining academic knowledge with creative engineering process application, strong leadership, and project management skills to successfully deliver results in progressively complex environments such as Intel Corporation and NASA. High-achiever with excellent communication and influencing skills that have led to strategic engineering process changes that exceeded project expectations and requirements. \n \nI believe my rare combination of attributes help me enable companies such that I can uniquely: \n \n•\tDrive innovations for the organization with my deep technical background, \n•\tGrow the people and organization through leadership and strategic thinking, \n•\tand apply my \"operational excellence\" brand to make the organization run faster, cheaper,  \nand more effectively - then continue to add value by creating systems that work. \n \nI invite you to contact me so that I can add value and guide your people and efforts to be successful technically, organizationally, and operationally! Summary Lead Engineer for the industry leader in semiconductor computing products with skills and experience that quickly transfer to engineering innovations across a broad spectrum of industries. An accomplished senior engineer and published researcher with a history of combining academic knowledge with creative engineering process application, strong leadership, and project management skills to successfully deliver results in progressively complex environments such as Intel Corporation and NASA. High-achiever with excellent communication and influencing skills that have led to strategic engineering process changes that exceeded project expectations and requirements. \n \nI believe my rare combination of attributes help me enable companies such that I can uniquely: \n \n•\tDrive innovations for the organization with my deep technical background, \n•\tGrow the people and organization through leadership and strategic thinking, \n•\tand apply my \"operational excellence\" brand to make the organization run faster, cheaper,  \nand more effectively - then continue to add value by creating systems that work. \n \nI invite you to contact me so that I can add value and guide your people and efforts to be successful technically, organizationally, and operationally! Lead Engineer for the industry leader in semiconductor computing products with skills and experience that quickly transfer to engineering innovations across a broad spectrum of industries. An accomplished senior engineer and published researcher with a history of combining academic knowledge with creative engineering process application, strong leadership, and project management skills to successfully deliver results in progressively complex environments such as Intel Corporation and NASA. High-achiever with excellent communication and influencing skills that have led to strategic engineering process changes that exceeded project expectations and requirements. \n \nI believe my rare combination of attributes help me enable companies such that I can uniquely: \n \n•\tDrive innovations for the organization with my deep technical background, \n•\tGrow the people and organization through leadership and strategic thinking, \n•\tand apply my \"operational excellence\" brand to make the organization run faster, cheaper,  \nand more effectively - then continue to add value by creating systems that work. \n \nI invite you to contact me so that I can add value and guide your people and efforts to be successful technically, organizationally, and operationally! Lead Engineer for the industry leader in semiconductor computing products with skills and experience that quickly transfer to engineering innovations across a broad spectrum of industries. An accomplished senior engineer and published researcher with a history of combining academic knowledge with creative engineering process application, strong leadership, and project management skills to successfully deliver results in progressively complex environments such as Intel Corporation and NASA. High-achiever with excellent communication and influencing skills that have led to strategic engineering process changes that exceeded project expectations and requirements. \n \nI believe my rare combination of attributes help me enable companies such that I can uniquely: \n \n•\tDrive innovations for the organization with my deep technical background, \n•\tGrow the people and organization through leadership and strategic thinking, \n•\tand apply my \"operational excellence\" brand to make the organization run faster, cheaper,  \nand more effectively - then continue to add value by creating systems that work. \n \nI invite you to contact me so that I can add value and guide your people and efforts to be successful technically, organizationally, and operationally! Experience Systems Engineering and Integration Lead (Thermal-Mechanical Integration) Intel Corporation April 2014  – Present (1 year 5 months) Hillsboro, Oregon • Leads a rapidly growing team of thermal and mechanical design engineers on cooling solutions for a \"high performance computing product\" (e.g. supercomputers and unique computing structures). \n \n• Manages systems design integration (including scheduling, planning, and setting and driving technical design strategy) for thermal solutions for product engineering of high performance computing applications. \n \n• Manages and tracks budget for design solutions and relays cost to upper management for financial planning by key decision makers. Performs headcount tracking and projection and provides input to upper management on resource needs. \n \n• Interfaces with extra-departmental teams for cross-functional expertise and systems integration with thermal-mechanical design solutions. Manages relationships with parts suppliers to fabricate design solutions on-time and within budget. Site Leader, Oregon MAPS (Skills-based Volunteering) Intel Corporation May 2012  – Present (3 years 4 months) Hillsboro, Oregon Mentoring and Planning Services (MAPS) coordinator for Oregon and southern Washington. Responsible for building relationships with the executive leadership and \"frontline\" employees of nonprofit entities. Recruits, selects, and coordinates the activities of volunteer project teams from Intel's vast pool of experts.  \n \nCorey has overseen the application of over 1100 professional volunteer service hours (equivalent to >$110,000 in consultation rendered) across 40 Intel volunteers and 18 engagements with the local community. \n \nMAPS is a unique skills-based volunteer program, designed to help Intel employees share their skills, experience, knowledge and expertise with non-profit organizations, educational or governmental, through limited engagement mentoring. Owner, CEO, and Consultant FROSTFIRE TECHNOLOGIES, LLC. November 2011  – Present (3 years 10 months) Texas FROSTFIRETECH's strives to use modeling, simulation, and business process excellence to help our customers predict business operational trends and natural phenomena to enable corporate and academic professionals make key decisions that will reduce time/cost, develop or inmprove products, or perform groundbreaking research. \n \nCurrent Projects: Providing consulting services for ongoing academic studies in the realm of solid propellant performance modeling.  \n \nAspiring to develop government and commercial relationships to provide scientific and professional services involving modeling, simulation and process-oriented improvements of business and technical systems. Systems Engineering Strategist Intel Corporation May 2013  –  April 2014  (1 year) Hillsboro, Oregon • Driving pathfinding efforts to define and implement systems engineering in quality across the Intel enterprise to increase integration, drive lower cost, and improve development times. \n \n• Program manages product change notification systems with ~1 million notifications per year across 70,000 external customers to drive success in the Intel Customer Excellence Program. \n \n• Developing knowledge transfer systems for design quality issues to be proliferated across multiple product teams. Uses system to ensure design solutions are effectively shared and actions tracked to implementation. \n \n• Manages account with APQC (American Productivity and Quality Center) for benchmarking and process framework analysis to improve business and technical processes. Captures and proliferates learnings through exchange with other senior leaders at partner companies. Operations Manager & Senior Engineering Program Manager Intel Corporation August 2011  –  May 2013  (1 year 10 months) Hillsboro, Oregon • Develops and manages operational improvements for an engineering organization of ~150 direct employees and contract workers and ~$30 million in core resources and funding from other departments. Practices \"Kaizen\" approach with small innovations that lead to savings in time and effort as well as \"bigger idea, bigger risk\" contributions that lead to innovative paradigm shifts for the systems, processes, and people of the department. \n \n• Program manages a suite of quality systems for product development utilized across the Intel enterprise and spanning ~100 projects within 18 subprograms (information systems, processes, and governing documentation). Re-imagined program to drive growth to include new customers and business opportunities. Directs and develops a team of business analysts, tech leads, developers, and project managers across 4 company sites in the United States and Costa Rica. \n \n• Improves quality and reliability across the Intel business using Lean Six Sigma methodologies for cross-functional customers. Combines quality methods and principles with technical knowledge to drive strategic improvements, such as aligning department systems and methods to be more effective and efficient. Researcher Petersen Research Group at Texas A&M University August 2008  –  December 2011  (3 years 5 months) College Station, Texas Developed models to predict solid propellant combustion performance (enhanced and anomalous burning trends) with various nanoparticle additive formulations. Integrated models with a high-pressure burning chamber model to simulate thermodynamic effects observed during actual laboratory experiments. Utilized sub-scale and larger-scale tests with specific chemical formulations to validate model predictions. \n \nDesigned and built laboratory plumbing systems for high-pressure, high-temperature devices. Produced technical drawings and interfaced with parts manufacturers on cost, supply, and standards issues. \n \nAbout the Petersen Research Group: (originally at the University of Central Florida in Orlando, FL) Specializing in the study of combustion, gas dynamics and propulsion. We conduct experiments and analyses on reacting flows, chemical kinetics, and shock waves for applications ranging from advanced propellants and rockets to optical diagnostics and gas turbine engines. \n \nWebsite: http://petersengroup.tamu.edu/index.html Lead Engineer / Project Manager United Space Alliance August 2004  –  August 2011  (7 years 1 month) Houston, Texas Area • Led teams of 15-20 cross-functional, entry-level to senior-level engineers performing engineering design and analysis for 13 safe and successful Space Shuttle missions. Led teams with strong attention to detail and praise-worthy communication practices between the team, government representatives, and other companies. Delivered over 20 presentations at program-level NASA reviews ranging from engineering design and analysis changes to mission status. \n• Supervised the group’s technical and professional performance as the technical group lead. Used best hiring practices to personally recruit, select, train, and mentor new high-performing engineers to lead other design and analysis teams.  \n• Identified risks and impacts to shuttle systems as a department representative, team lead, and subject matter expert. Acted accountably for the safety of systems, technical requirements management, and quality of design for multiple project teams. \n• Led a Six-Sigma team that reduced process lead-time for performing engineering design and analysis from 20 to 5 working days. Exceeded NASA officials’ goals to complete analysis within two months and bring the process time down to 1 week. Completed the project a full 4 months before other project teams. \n \n• Applied in-depth knowledge of proprietary models to analyze Space Shuttle abort performance. Used models and knowledge of Space Shuttle systems to assess impacts to performance. Co-developed work-arounds and improvements to models for unique mission situations, system configuration, engineering constraints, and customer requirements.  \n• Applied systematic approach to developing and improving the processes, techniques and procedures for the creation of new or substantially improved methods or products for Space Shuttle mission design. Science and Technology Manager Minority Economic Empowerment Group 2009  –  2010  (1 year) Owner/Freelance Illustrator SKYFIRE STUDIOS January 2005  –  December 2009  (5 years) A multi-media comics company in the planning phase and being structured. Currently providing freelance illustration services. Researcher Petersen Research Group at the University of Central Florida August 2003  –  December 2007  (4 years 5 months) Orlando, Florida Area Developed and improved 1-D and 2-D models for heat transfer calculations. Studied thermal integrity in a high-pressure, high-temperature gas dynamics characterization device. Worked with other research universities to predict and enhance heat transfer. Developed simplified equations that predict thermal boundary layer growth and average temperature loss over time in the device. \n \nDesigned and built laboratory plumbing systems for high-pressure, high-temperature devices. Produced technical drawings and interfaced with parts manufacturers on cost, supply, and standards issues. \n \nAbout the Petersen Research Group: Specializing in the study of combustion, gas dynamics and propulsion. We conduct experiments and analyses on reacting flows, chemical kinetics, and shock waves for applications ranging from advanced propellants and rockets to optical diagnostics and gas turbine engines. \n \nWebsite: http://petersengroup.tamu.edu/index.html Systems Engineering and Integration Lead (Thermal-Mechanical Integration) Intel Corporation April 2014  – Present (1 year 5 months) Hillsboro, Oregon • Leads a rapidly growing team of thermal and mechanical design engineers on cooling solutions for a \"high performance computing product\" (e.g. supercomputers and unique computing structures). \n \n• Manages systems design integration (including scheduling, planning, and setting and driving technical design strategy) for thermal solutions for product engineering of high performance computing applications. \n \n• Manages and tracks budget for design solutions and relays cost to upper management for financial planning by key decision makers. Performs headcount tracking and projection and provides input to upper management on resource needs. \n \n• Interfaces with extra-departmental teams for cross-functional expertise and systems integration with thermal-mechanical design solutions. Manages relationships with parts suppliers to fabricate design solutions on-time and within budget. Systems Engineering and Integration Lead (Thermal-Mechanical Integration) Intel Corporation April 2014  – Present (1 year 5 months) Hillsboro, Oregon • Leads a rapidly growing team of thermal and mechanical design engineers on cooling solutions for a \"high performance computing product\" (e.g. supercomputers and unique computing structures). \n \n• Manages systems design integration (including scheduling, planning, and setting and driving technical design strategy) for thermal solutions for product engineering of high performance computing applications. \n \n• Manages and tracks budget for design solutions and relays cost to upper management for financial planning by key decision makers. Performs headcount tracking and projection and provides input to upper management on resource needs. \n \n• Interfaces with extra-departmental teams for cross-functional expertise and systems integration with thermal-mechanical design solutions. Manages relationships with parts suppliers to fabricate design solutions on-time and within budget. Site Leader, Oregon MAPS (Skills-based Volunteering) Intel Corporation May 2012  – Present (3 years 4 months) Hillsboro, Oregon Mentoring and Planning Services (MAPS) coordinator for Oregon and southern Washington. Responsible for building relationships with the executive leadership and \"frontline\" employees of nonprofit entities. Recruits, selects, and coordinates the activities of volunteer project teams from Intel's vast pool of experts.  \n \nCorey has overseen the application of over 1100 professional volunteer service hours (equivalent to >$110,000 in consultation rendered) across 40 Intel volunteers and 18 engagements with the local community. \n \nMAPS is a unique skills-based volunteer program, designed to help Intel employees share their skills, experience, knowledge and expertise with non-profit organizations, educational or governmental, through limited engagement mentoring. Site Leader, Oregon MAPS (Skills-based Volunteering) Intel Corporation May 2012  – Present (3 years 4 months) Hillsboro, Oregon Mentoring and Planning Services (MAPS) coordinator for Oregon and southern Washington. Responsible for building relationships with the executive leadership and \"frontline\" employees of nonprofit entities. Recruits, selects, and coordinates the activities of volunteer project teams from Intel's vast pool of experts.  \n \nCorey has overseen the application of over 1100 professional volunteer service hours (equivalent to >$110,000 in consultation rendered) across 40 Intel volunteers and 18 engagements with the local community. \n \nMAPS is a unique skills-based volunteer program, designed to help Intel employees share their skills, experience, knowledge and expertise with non-profit organizations, educational or governmental, through limited engagement mentoring. Owner, CEO, and Consultant FROSTFIRE TECHNOLOGIES, LLC. November 2011  – Present (3 years 10 months) Texas FROSTFIRETECH's strives to use modeling, simulation, and business process excellence to help our customers predict business operational trends and natural phenomena to enable corporate and academic professionals make key decisions that will reduce time/cost, develop or inmprove products, or perform groundbreaking research. \n \nCurrent Projects: Providing consulting services for ongoing academic studies in the realm of solid propellant performance modeling.  \n \nAspiring to develop government and commercial relationships to provide scientific and professional services involving modeling, simulation and process-oriented improvements of business and technical systems. Owner, CEO, and Consultant FROSTFIRE TECHNOLOGIES, LLC. November 2011  – Present (3 years 10 months) Texas FROSTFIRETECH's strives to use modeling, simulation, and business process excellence to help our customers predict business operational trends and natural phenomena to enable corporate and academic professionals make key decisions that will reduce time/cost, develop or inmprove products, or perform groundbreaking research. \n \nCurrent Projects: Providing consulting services for ongoing academic studies in the realm of solid propellant performance modeling.  \n \nAspiring to develop government and commercial relationships to provide scientific and professional services involving modeling, simulation and process-oriented improvements of business and technical systems. Systems Engineering Strategist Intel Corporation May 2013  –  April 2014  (1 year) Hillsboro, Oregon • Driving pathfinding efforts to define and implement systems engineering in quality across the Intel enterprise to increase integration, drive lower cost, and improve development times. \n \n• Program manages product change notification systems with ~1 million notifications per year across 70,000 external customers to drive success in the Intel Customer Excellence Program. \n \n• Developing knowledge transfer systems for design quality issues to be proliferated across multiple product teams. Uses system to ensure design solutions are effectively shared and actions tracked to implementation. \n \n• Manages account with APQC (American Productivity and Quality Center) for benchmarking and process framework analysis to improve business and technical processes. Captures and proliferates learnings through exchange with other senior leaders at partner companies. Systems Engineering Strategist Intel Corporation May 2013  –  April 2014  (1 year) Hillsboro, Oregon • Driving pathfinding efforts to define and implement systems engineering in quality across the Intel enterprise to increase integration, drive lower cost, and improve development times. \n \n• Program manages product change notification systems with ~1 million notifications per year across 70,000 external customers to drive success in the Intel Customer Excellence Program. \n \n• Developing knowledge transfer systems for design quality issues to be proliferated across multiple product teams. Uses system to ensure design solutions are effectively shared and actions tracked to implementation. \n \n• Manages account with APQC (American Productivity and Quality Center) for benchmarking and process framework analysis to improve business and technical processes. Captures and proliferates learnings through exchange with other senior leaders at partner companies. Operations Manager & Senior Engineering Program Manager Intel Corporation August 2011  –  May 2013  (1 year 10 months) Hillsboro, Oregon • Develops and manages operational improvements for an engineering organization of ~150 direct employees and contract workers and ~$30 million in core resources and funding from other departments. Practices \"Kaizen\" approach with small innovations that lead to savings in time and effort as well as \"bigger idea, bigger risk\" contributions that lead to innovative paradigm shifts for the systems, processes, and people of the department. \n \n• Program manages a suite of quality systems for product development utilized across the Intel enterprise and spanning ~100 projects within 18 subprograms (information systems, processes, and governing documentation). Re-imagined program to drive growth to include new customers and business opportunities. Directs and develops a team of business analysts, tech leads, developers, and project managers across 4 company sites in the United States and Costa Rica. \n \n• Improves quality and reliability across the Intel business using Lean Six Sigma methodologies for cross-functional customers. Combines quality methods and principles with technical knowledge to drive strategic improvements, such as aligning department systems and methods to be more effective and efficient. Operations Manager & Senior Engineering Program Manager Intel Corporation August 2011  –  May 2013  (1 year 10 months) Hillsboro, Oregon • Develops and manages operational improvements for an engineering organization of ~150 direct employees and contract workers and ~$30 million in core resources and funding from other departments. Practices \"Kaizen\" approach with small innovations that lead to savings in time and effort as well as \"bigger idea, bigger risk\" contributions that lead to innovative paradigm shifts for the systems, processes, and people of the department. \n \n• Program manages a suite of quality systems for product development utilized across the Intel enterprise and spanning ~100 projects within 18 subprograms (information systems, processes, and governing documentation). Re-imagined program to drive growth to include new customers and business opportunities. Directs and develops a team of business analysts, tech leads, developers, and project managers across 4 company sites in the United States and Costa Rica. \n \n• Improves quality and reliability across the Intel business using Lean Six Sigma methodologies for cross-functional customers. Combines quality methods and principles with technical knowledge to drive strategic improvements, such as aligning department systems and methods to be more effective and efficient. Researcher Petersen Research Group at Texas A&M University August 2008  –  December 2011  (3 years 5 months) College Station, Texas Developed models to predict solid propellant combustion performance (enhanced and anomalous burning trends) with various nanoparticle additive formulations. Integrated models with a high-pressure burning chamber model to simulate thermodynamic effects observed during actual laboratory experiments. Utilized sub-scale and larger-scale tests with specific chemical formulations to validate model predictions. \n \nDesigned and built laboratory plumbing systems for high-pressure, high-temperature devices. Produced technical drawings and interfaced with parts manufacturers on cost, supply, and standards issues. \n \nAbout the Petersen Research Group: (originally at the University of Central Florida in Orlando, FL) Specializing in the study of combustion, gas dynamics and propulsion. We conduct experiments and analyses on reacting flows, chemical kinetics, and shock waves for applications ranging from advanced propellants and rockets to optical diagnostics and gas turbine engines. \n \nWebsite: http://petersengroup.tamu.edu/index.html Researcher Petersen Research Group at Texas A&M University August 2008  –  December 2011  (3 years 5 months) College Station, Texas Developed models to predict solid propellant combustion performance (enhanced and anomalous burning trends) with various nanoparticle additive formulations. Integrated models with a high-pressure burning chamber model to simulate thermodynamic effects observed during actual laboratory experiments. Utilized sub-scale and larger-scale tests with specific chemical formulations to validate model predictions. \n \nDesigned and built laboratory plumbing systems for high-pressure, high-temperature devices. Produced technical drawings and interfaced with parts manufacturers on cost, supply, and standards issues. \n \nAbout the Petersen Research Group: (originally at the University of Central Florida in Orlando, FL) Specializing in the study of combustion, gas dynamics and propulsion. We conduct experiments and analyses on reacting flows, chemical kinetics, and shock waves for applications ranging from advanced propellants and rockets to optical diagnostics and gas turbine engines. \n \nWebsite: http://petersengroup.tamu.edu/index.html Lead Engineer / Project Manager United Space Alliance August 2004  –  August 2011  (7 years 1 month) Houston, Texas Area • Led teams of 15-20 cross-functional, entry-level to senior-level engineers performing engineering design and analysis for 13 safe and successful Space Shuttle missions. Led teams with strong attention to detail and praise-worthy communication practices between the team, government representatives, and other companies. Delivered over 20 presentations at program-level NASA reviews ranging from engineering design and analysis changes to mission status. \n• Supervised the group’s technical and professional performance as the technical group lead. Used best hiring practices to personally recruit, select, train, and mentor new high-performing engineers to lead other design and analysis teams.  \n• Identified risks and impacts to shuttle systems as a department representative, team lead, and subject matter expert. Acted accountably for the safety of systems, technical requirements management, and quality of design for multiple project teams. \n• Led a Six-Sigma team that reduced process lead-time for performing engineering design and analysis from 20 to 5 working days. Exceeded NASA officials’ goals to complete analysis within two months and bring the process time down to 1 week. Completed the project a full 4 months before other project teams. \n \n• Applied in-depth knowledge of proprietary models to analyze Space Shuttle abort performance. Used models and knowledge of Space Shuttle systems to assess impacts to performance. Co-developed work-arounds and improvements to models for unique mission situations, system configuration, engineering constraints, and customer requirements.  \n• Applied systematic approach to developing and improving the processes, techniques and procedures for the creation of new or substantially improved methods or products for Space Shuttle mission design. Lead Engineer / Project Manager United Space Alliance August 2004  –  August 2011  (7 years 1 month) Houston, Texas Area • Led teams of 15-20 cross-functional, entry-level to senior-level engineers performing engineering design and analysis for 13 safe and successful Space Shuttle missions. Led teams with strong attention to detail and praise-worthy communication practices between the team, government representatives, and other companies. Delivered over 20 presentations at program-level NASA reviews ranging from engineering design and analysis changes to mission status. \n• Supervised the group’s technical and professional performance as the technical group lead. Used best hiring practices to personally recruit, select, train, and mentor new high-performing engineers to lead other design and analysis teams.  \n• Identified risks and impacts to shuttle systems as a department representative, team lead, and subject matter expert. Acted accountably for the safety of systems, technical requirements management, and quality of design for multiple project teams. \n• Led a Six-Sigma team that reduced process lead-time for performing engineering design and analysis from 20 to 5 working days. Exceeded NASA officials’ goals to complete analysis within two months and bring the process time down to 1 week. Completed the project a full 4 months before other project teams. \n \n• Applied in-depth knowledge of proprietary models to analyze Space Shuttle abort performance. Used models and knowledge of Space Shuttle systems to assess impacts to performance. Co-developed work-arounds and improvements to models for unique mission situations, system configuration, engineering constraints, and customer requirements.  \n• Applied systematic approach to developing and improving the processes, techniques and procedures for the creation of new or substantially improved methods or products for Space Shuttle mission design. Science and Technology Manager Minority Economic Empowerment Group 2009  –  2010  (1 year) Science and Technology Manager Minority Economic Empowerment Group 2009  –  2010  (1 year) Owner/Freelance Illustrator SKYFIRE STUDIOS January 2005  –  December 2009  (5 years) A multi-media comics company in the planning phase and being structured. Currently providing freelance illustration services. Owner/Freelance Illustrator SKYFIRE STUDIOS January 2005  –  December 2009  (5 years) A multi-media comics company in the planning phase and being structured. Currently providing freelance illustration services. Researcher Petersen Research Group at the University of Central Florida August 2003  –  December 2007  (4 years 5 months) Orlando, Florida Area Developed and improved 1-D and 2-D models for heat transfer calculations. Studied thermal integrity in a high-pressure, high-temperature gas dynamics characterization device. Worked with other research universities to predict and enhance heat transfer. Developed simplified equations that predict thermal boundary layer growth and average temperature loss over time in the device. \n \nDesigned and built laboratory plumbing systems for high-pressure, high-temperature devices. Produced technical drawings and interfaced with parts manufacturers on cost, supply, and standards issues. \n \nAbout the Petersen Research Group: Specializing in the study of combustion, gas dynamics and propulsion. We conduct experiments and analyses on reacting flows, chemical kinetics, and shock waves for applications ranging from advanced propellants and rockets to optical diagnostics and gas turbine engines. \n \nWebsite: http://petersengroup.tamu.edu/index.html Researcher Petersen Research Group at the University of Central Florida August 2003  –  December 2007  (4 years 5 months) Orlando, Florida Area Developed and improved 1-D and 2-D models for heat transfer calculations. Studied thermal integrity in a high-pressure, high-temperature gas dynamics characterization device. Worked with other research universities to predict and enhance heat transfer. Developed simplified equations that predict thermal boundary layer growth and average temperature loss over time in the device. \n \nDesigned and built laboratory plumbing systems for high-pressure, high-temperature devices. Produced technical drawings and interfaced with parts manufacturers on cost, supply, and standards issues. \n \nAbout the Petersen Research Group: Specializing in the study of combustion, gas dynamics and propulsion. We conduct experiments and analyses on reacting flows, chemical kinetics, and shock waves for applications ranging from advanced propellants and rockets to optical diagnostics and gas turbine engines. \n \nWebsite: http://petersengroup.tamu.edu/index.html Languages   Skills Integration Engineering Systems Engineering Cross-functional Team... Engineering Management Matlab Fortran MS Project Microsoft Office Pro Engineer MathCAD Python FrameMaker Analysis Tecplot I-DEAS Wordperfect Software Documentation Apple OS See 4+     See less Skills  Integration Engineering Systems Engineering Cross-functional Team... Engineering Management Matlab Fortran MS Project Microsoft Office Pro Engineer MathCAD Python FrameMaker Analysis Tecplot I-DEAS Wordperfect Software Documentation Apple OS See 4+     See less Integration Engineering Systems Engineering Cross-functional Team... Engineering Management Matlab Fortran MS Project Microsoft Office Pro Engineer MathCAD Python FrameMaker Analysis Tecplot I-DEAS Wordperfect Software Documentation Apple OS See 4+     See less Integration Engineering Systems Engineering Cross-functional Team... Engineering Management Matlab Fortran MS Project Microsoft Office Pro Engineer MathCAD Python FrameMaker Analysis Tecplot I-DEAS Wordperfect Software Documentation Apple OS See 4+     See less Education Texas A&M University Doctor of Philosophy,  Mechanical Engineering 2008  – 2011 University of Central Florida Master of Science,  Mechanical Engineering , Thermal and Fluid Sciences 2004  – 2007 University of Central Florida Bachelor of Science,  Aerospace Engineering 2001  – 2004 Activities and Societies:  Sigma Gamma Tau (National Honor Society in Aerospace Engineering) DePauw University N/A,  Engineering 1999  – 2001 Texas A&M University Doctor of Philosophy,  Mechanical Engineering 2008  – 2011 Texas A&M University Doctor of Philosophy,  Mechanical Engineering 2008  – 2011 Texas A&M University Doctor of Philosophy,  Mechanical Engineering 2008  – 2011 University of Central Florida Master of Science,  Mechanical Engineering , Thermal and Fluid Sciences 2004  – 2007 University of Central Florida Master of Science,  Mechanical Engineering , Thermal and Fluid Sciences 2004  – 2007 University of Central Florida Master of Science,  Mechanical Engineering , Thermal and Fluid Sciences 2004  – 2007 University of Central Florida Bachelor of Science,  Aerospace Engineering 2001  – 2004 Activities and Societies:  Sigma Gamma Tau (National Honor Society in Aerospace Engineering) University of Central Florida Bachelor of Science,  Aerospace Engineering 2001  – 2004 Activities and Societies:  Sigma Gamma Tau (National Honor Society in Aerospace Engineering) University of Central Florida Bachelor of Science,  Aerospace Engineering 2001  – 2004 Activities and Societies:  Sigma Gamma Tau (National Honor Society in Aerospace Engineering) DePauw University N/A,  Engineering 1999  – 2001 DePauw University N/A,  Engineering 1999  – 2001 DePauw University N/A,  Engineering 1999  – 2001 Honors & Awards Additional Honors & Awards UNITED SPACE ALLIANCE: \n• Quest Certificate of Appreciation for Development of a New Production Architecture (Jan 2011) \n• Certificate of Appreciation for Support of Space Shuttle Mission STS-131 (Nov 2010) \n• Quest Performance Award for Leading Lean Six Sigma Constellation Analysis Team (Sep 2009) \n• Certificate of Appreciation For International Space Station Crew Expansion Support (Sep 2009) \n• Certificate of Appreciation for Integration Activities for Space Shuttle Mission STS-125 (Apr 2009) \n• On-the-Spot-Award for Mission Integration Activities / Project Leadership (Feb 2009) \n• Quest Performance Award for Integration Activties / Project Leadership (Apr 2008) \n• United Space Alliance Flight Design and Dynamics Division Employee of the Month (Sep 2007) \n• On-the-Spot-Award for Mission Integration Activities / Project Leadership (Dec 2006) \n• Certificate of Appreciation for Return to Flight Activities Following Columbia Accident (Dec 2005) Additional Honors & Awards UNITED SPACE ALLIANCE: \n• Quest Certificate of Appreciation for Development of a New Production Architecture (Jan 2011) \n• Certificate of Appreciation for Support of Space Shuttle Mission STS-131 (Nov 2010) \n• Quest Performance Award for Leading Lean Six Sigma Constellation Analysis Team (Sep 2009) \n• Certificate of Appreciation For International Space Station Crew Expansion Support (Sep 2009) \n• Certificate of Appreciation for Integration Activities for Space Shuttle Mission STS-125 (Apr 2009) \n• On-the-Spot-Award for Mission Integration Activities / Project Leadership (Feb 2009) \n• Quest Performance Award for Integration Activties / Project Leadership (Apr 2008) \n• United Space Alliance Flight Design and Dynamics Division Employee of the Month (Sep 2007) \n• On-the-Spot-Award for Mission Integration Activities / Project Leadership (Dec 2006) \n• Certificate of Appreciation for Return to Flight Activities Following Columbia Accident (Dec 2005) Additional Honors & Awards UNITED SPACE ALLIANCE: \n• Quest Certificate of Appreciation for Development of a New Production Architecture (Jan 2011) \n• Certificate of Appreciation for Support of Space Shuttle Mission STS-131 (Nov 2010) \n• Quest Performance Award for Leading Lean Six Sigma Constellation Analysis Team (Sep 2009) \n• Certificate of Appreciation For International Space Station Crew Expansion Support (Sep 2009) \n• Certificate of Appreciation for Integration Activities for Space Shuttle Mission STS-125 (Apr 2009) \n• On-the-Spot-Award for Mission Integration Activities / Project Leadership (Feb 2009) \n• Quest Performance Award for Integration Activties / Project Leadership (Apr 2008) \n• United Space Alliance Flight Design and Dynamics Division Employee of the Month (Sep 2007) \n• On-the-Spot-Award for Mission Integration Activities / Project Leadership (Dec 2006) \n• Certificate of Appreciation for Return to Flight Activities Following Columbia Accident (Dec 2005) Additional Honors & Awards UNITED SPACE ALLIANCE: \n• Quest Certificate of Appreciation for Development of a New Production Architecture (Jan 2011) \n• Certificate of Appreciation for Support of Space Shuttle Mission STS-131 (Nov 2010) \n• Quest Performance Award for Leading Lean Six Sigma Constellation Analysis Team (Sep 2009) \n• Certificate of Appreciation For International Space Station Crew Expansion Support (Sep 2009) \n• Certificate of Appreciation for Integration Activities for Space Shuttle Mission STS-125 (Apr 2009) \n• On-the-Spot-Award for Mission Integration Activities / Project Leadership (Feb 2009) \n• Quest Performance Award for Integration Activties / Project Leadership (Apr 2008) \n• United Space Alliance Flight Design and Dynamics Division Employee of the Month (Sep 2007) \n• On-the-Spot-Award for Mission Integration Activities / Project Leadership (Dec 2006) \n• Certificate of Appreciation for Return to Flight Activities Following Columbia Accident (Dec 2005) ", "Summary -\t17 years work experience in telecommunication industry, Rich experience on setting up and leading a team to achieve the company’s goal. \n-\tAbundant knowledge (SW, EE, ME etc.) on mobile device, Familiar with R&D life-cycle/ production procedure/Quality Standard of mobile devices \n-\t10 years experience of programs management in telecom industry. Expert in Risk management. Time management, Cost management, Quality management, Familiar with different products life cycle  \n-\t3 years experience on organization process improvement and PPQA (Product and Process Quality Assurance) according the CMMI and 6-Sigma theory and method.  \n-\t4 years experience in Telecommunication software development, Familiar with embeds system. \n-\tExtensive experience of working with OEM/ODM supplier/customer and international cross-functional teams for Telecom products R&D. \n-\tPMP (Project Management Professional) certified. Summary -\t17 years work experience in telecommunication industry, Rich experience on setting up and leading a team to achieve the company’s goal. \n-\tAbundant knowledge (SW, EE, ME etc.) on mobile device, Familiar with R&D life-cycle/ production procedure/Quality Standard of mobile devices \n-\t10 years experience of programs management in telecom industry. Expert in Risk management. Time management, Cost management, Quality management, Familiar with different products life cycle  \n-\t3 years experience on organization process improvement and PPQA (Product and Process Quality Assurance) according the CMMI and 6-Sigma theory and method.  \n-\t4 years experience in Telecommunication software development, Familiar with embeds system. \n-\tExtensive experience of working with OEM/ODM supplier/customer and international cross-functional teams for Telecom products R&D. \n-\tPMP (Project Management Professional) certified. -\t17 years work experience in telecommunication industry, Rich experience on setting up and leading a team to achieve the company’s goal. \n-\tAbundant knowledge (SW, EE, ME etc.) on mobile device, Familiar with R&D life-cycle/ production procedure/Quality Standard of mobile devices \n-\t10 years experience of programs management in telecom industry. Expert in Risk management. Time management, Cost management, Quality management, Familiar with different products life cycle  \n-\t3 years experience on organization process improvement and PPQA (Product and Process Quality Assurance) according the CMMI and 6-Sigma theory and method.  \n-\t4 years experience in Telecommunication software development, Familiar with embeds system. \n-\tExtensive experience of working with OEM/ODM supplier/customer and international cross-functional teams for Telecom products R&D. \n-\tPMP (Project Management Professional) certified. -\t17 years work experience in telecommunication industry, Rich experience on setting up and leading a team to achieve the company’s goal. \n-\tAbundant knowledge (SW, EE, ME etc.) on mobile device, Familiar with R&D life-cycle/ production procedure/Quality Standard of mobile devices \n-\t10 years experience of programs management in telecom industry. Expert in Risk management. Time management, Cost management, Quality management, Familiar with different products life cycle  \n-\t3 years experience on organization process improvement and PPQA (Product and Process Quality Assurance) according the CMMI and 6-Sigma theory and method.  \n-\t4 years experience in Telecommunication software development, Familiar with embeds system. \n-\tExtensive experience of working with OEM/ODM supplier/customer and international cross-functional teams for Telecom products R&D. \n-\tPMP (Project Management Professional) certified. Experience Senior Engineering Program Manager Intel Corporation December 2012  – Present (2 years 9 months) Responsibilities:  \n- Responsible Engineering program management of Master Reference Design for Intel Mobile SOC platforms.  \n- Driving over all execution of the high quality, competitive Turnkey solutions for Intel spanning smartphones, tablets, and phablets.  \n- Leading the cross-function team and ensure the project team could develop and scale highly cost and supply chain optimized Turnkey solution  Senior Program Manager Motorola Mobile Devices May 2009  –  September 2012  (3 years 5 months) Shanghai,China -\tManaging OEM/ODM suppliers to on quality, on time and on cost launch products.  \n-\tResponsible for managing a cross-functional team and also responsible for planning, coordinating and driving the global launch of Companion Products per roadmaps planned in conjunction with category Product Line Managers.  \n-\tResponsible for delivery of products on schedule, with high quality, as well as developing and enhancing the related program management processes for continuous improvement. Senior Product Manager Shanghai Zhongrui Technology Co.Ltd December 2005  –  April 2009  (3 years 5 months) Shanghai,China - Responsible for System Requirement Design.  \n- Responsible for all team member’s performance appraisal as a project leader  \n- Responsible for Project status monitoring and control, Quality control, Cost down, Risk management  \n- Account management, Communicate with customer and ensure the product design and production will fully meet customer demands. Project Manager ZTE October 2004  –  November 2005  (1 year 2 months) Shanghai,China - Leading the project members develop the product, coordinate and manage the resource needed by the project working  \n- Break down and trace the Project Plan. Ensure the Project schedule and quality, and as well as cost control  \n- Project experience: JRC PHS Handset project PPQA Manager ZTE July 2002  –  October 2004  (2 years 4 months) Shanghai,China - Setting up software quality assurance system and establishing the institute’s strategy of the develop-quality in the ZTE handsets division.  \n- Leading and managing QA team and Material Engineers team. \n- Review the project ‘s QA plan and audit the QA reports  \n- Participate in making and reviewing the EPG’s plans 、standards and rules Software Engineer ZTE January 1999  –  June 2002  (3 years 6 months) Shanghai,China - Responsible for ZXPCS CSC module SW detailed design \n- SW team task assignment and reviewer. Research Specialist Staff AVIC Shanghai Aeronautical Measurement-Controlling Research Institute July 1998  –  December 1998  (6 months) Shanghai,China -\tSW/HW design/develop on embed system Senior Engineering Program Manager Intel Corporation December 2012  – Present (2 years 9 months) Responsibilities:  \n- Responsible Engineering program management of Master Reference Design for Intel Mobile SOC platforms.  \n- Driving over all execution of the high quality, competitive Turnkey solutions for Intel spanning smartphones, tablets, and phablets.  \n- Leading the cross-function team and ensure the project team could develop and scale highly cost and supply chain optimized Turnkey solution  Senior Engineering Program Manager Intel Corporation December 2012  – Present (2 years 9 months) Responsibilities:  \n- Responsible Engineering program management of Master Reference Design for Intel Mobile SOC platforms.  \n- Driving over all execution of the high quality, competitive Turnkey solutions for Intel spanning smartphones, tablets, and phablets.  \n- Leading the cross-function team and ensure the project team could develop and scale highly cost and supply chain optimized Turnkey solution  Senior Program Manager Motorola Mobile Devices May 2009  –  September 2012  (3 years 5 months) Shanghai,China -\tManaging OEM/ODM suppliers to on quality, on time and on cost launch products.  \n-\tResponsible for managing a cross-functional team and also responsible for planning, coordinating and driving the global launch of Companion Products per roadmaps planned in conjunction with category Product Line Managers.  \n-\tResponsible for delivery of products on schedule, with high quality, as well as developing and enhancing the related program management processes for continuous improvement. Senior Program Manager Motorola Mobile Devices May 2009  –  September 2012  (3 years 5 months) Shanghai,China -\tManaging OEM/ODM suppliers to on quality, on time and on cost launch products.  \n-\tResponsible for managing a cross-functional team and also responsible for planning, coordinating and driving the global launch of Companion Products per roadmaps planned in conjunction with category Product Line Managers.  \n-\tResponsible for delivery of products on schedule, with high quality, as well as developing and enhancing the related program management processes for continuous improvement. Senior Product Manager Shanghai Zhongrui Technology Co.Ltd December 2005  –  April 2009  (3 years 5 months) Shanghai,China - Responsible for System Requirement Design.  \n- Responsible for all team member’s performance appraisal as a project leader  \n- Responsible for Project status monitoring and control, Quality control, Cost down, Risk management  \n- Account management, Communicate with customer and ensure the product design and production will fully meet customer demands. Senior Product Manager Shanghai Zhongrui Technology Co.Ltd December 2005  –  April 2009  (3 years 5 months) Shanghai,China - Responsible for System Requirement Design.  \n- Responsible for all team member’s performance appraisal as a project leader  \n- Responsible for Project status monitoring and control, Quality control, Cost down, Risk management  \n- Account management, Communicate with customer and ensure the product design and production will fully meet customer demands. Project Manager ZTE October 2004  –  November 2005  (1 year 2 months) Shanghai,China - Leading the project members develop the product, coordinate and manage the resource needed by the project working  \n- Break down and trace the Project Plan. Ensure the Project schedule and quality, and as well as cost control  \n- Project experience: JRC PHS Handset project Project Manager ZTE October 2004  –  November 2005  (1 year 2 months) Shanghai,China - Leading the project members develop the product, coordinate and manage the resource needed by the project working  \n- Break down and trace the Project Plan. Ensure the Project schedule and quality, and as well as cost control  \n- Project experience: JRC PHS Handset project PPQA Manager ZTE July 2002  –  October 2004  (2 years 4 months) Shanghai,China - Setting up software quality assurance system and establishing the institute’s strategy of the develop-quality in the ZTE handsets division.  \n- Leading and managing QA team and Material Engineers team. \n- Review the project ‘s QA plan and audit the QA reports  \n- Participate in making and reviewing the EPG’s plans 、standards and rules PPQA Manager ZTE July 2002  –  October 2004  (2 years 4 months) Shanghai,China - Setting up software quality assurance system and establishing the institute’s strategy of the develop-quality in the ZTE handsets division.  \n- Leading and managing QA team and Material Engineers team. \n- Review the project ‘s QA plan and audit the QA reports  \n- Participate in making and reviewing the EPG’s plans 、standards and rules Software Engineer ZTE January 1999  –  June 2002  (3 years 6 months) Shanghai,China - Responsible for ZXPCS CSC module SW detailed design \n- SW team task assignment and reviewer. Software Engineer ZTE January 1999  –  June 2002  (3 years 6 months) Shanghai,China - Responsible for ZXPCS CSC module SW detailed design \n- SW team task assignment and reviewer. Research Specialist Staff AVIC Shanghai Aeronautical Measurement-Controlling Research Institute July 1998  –  December 1998  (6 months) Shanghai,China -\tSW/HW design/develop on embed system Research Specialist Staff AVIC Shanghai Aeronautical Measurement-Controlling Research Institute July 1998  –  December 1998  (6 months) Shanghai,China -\tSW/HW design/develop on embed system Languages English Full professional proficiency Mandarin Native or bilingual proficiency English Full professional proficiency Mandarin Native or bilingual proficiency English Full professional proficiency Mandarin Native or bilingual proficiency Full professional proficiency Native or bilingual proficiency Skills Program Management Product Management CMMI Six Sigma PMP Product R&D Quality Assurance Interviews HDLC Q.931 UML V5.2 DFSS Embedded Systems PowerPC SDL VxWorks ISDN ClearCase ClearQuest RequisitePro GPIO SIM Monte Carlo Simulation Pertmaster Software Development Telecommunications Cross-functional Team... Mobile Devices Management Product Development Wireless See 17+     See less Skills  Program Management Product Management CMMI Six Sigma PMP Product R&D Quality Assurance Interviews HDLC Q.931 UML V5.2 DFSS Embedded Systems PowerPC SDL VxWorks ISDN ClearCase ClearQuest RequisitePro GPIO SIM Monte Carlo Simulation Pertmaster Software Development Telecommunications Cross-functional Team... Mobile Devices Management Product Development Wireless See 17+     See less Program Management Product Management CMMI Six Sigma PMP Product R&D Quality Assurance Interviews HDLC Q.931 UML V5.2 DFSS Embedded Systems PowerPC SDL VxWorks ISDN ClearCase ClearQuest RequisitePro GPIO SIM Monte Carlo Simulation Pertmaster Software Development Telecommunications Cross-functional Team... Mobile Devices Management Product Development Wireless See 17+     See less Program Management Product Management CMMI Six Sigma PMP Product R&D Quality Assurance Interviews HDLC Q.931 UML V5.2 DFSS Embedded Systems PowerPC SDL VxWorks ISDN ClearCase ClearQuest RequisitePro GPIO SIM Monte Carlo Simulation Pertmaster Software Development Telecommunications Cross-functional Team... Mobile Devices Management Product Development Wireless See 17+     See less Education Nanjing University of Aeronautics and Astronautics Bachelor,  Automatic Controll 1994  – 1998 Activities and Societies:  National University electronic competition:National second prize Nanjing University of Aeronautics and Astronautics Bachelor,  Automatic Controll 1994  – 1998 Activities and Societies:  National University electronic competition:National second prize Nanjing University of Aeronautics and Astronautics Bachelor,  Automatic Controll 1994  – 1998 Activities and Societies:  National University electronic competition:National second prize Nanjing University of Aeronautics and Astronautics Bachelor,  Automatic Controll 1994  – 1998 Activities and Societies:  National University electronic competition:National second prize Honors & Awards Additional Honors & Awards Awarded National second prize in National University electronic competition 1997 Additional Honors & Awards Awarded National second prize in National University electronic competition 1997 Additional Honors & Awards Awarded National second prize in National University electronic competition 1997 Additional Honors & Awards Awarded National second prize in National University electronic competition 1997 "]}