{"position": "Senior Software Engineer", "company": "Intel Corporation", "profiles": ["Summary Specialties:- Digital signal processing, Adaptive filter theory, Neural networks, machine learning, optimization theory, image processing and its applications to communications, classification, pattern recognition and computer vision. \n- Automation toward CAD tools for nano scale mask image/pattern metrology Summary Specialties:- Digital signal processing, Adaptive filter theory, Neural networks, machine learning, optimization theory, image processing and its applications to communications, classification, pattern recognition and computer vision. \n- Automation toward CAD tools for nano scale mask image/pattern metrology Specialties:- Digital signal processing, Adaptive filter theory, Neural networks, machine learning, optimization theory, image processing and its applications to communications, classification, pattern recognition and computer vision. \n- Automation toward CAD tools for nano scale mask image/pattern metrology Specialties:- Digital signal processing, Adaptive filter theory, Neural networks, machine learning, optimization theory, image processing and its applications to communications, classification, pattern recognition and computer vision. \n- Automation toward CAD tools for nano scale mask image/pattern metrology Experience Senior Software Engineer Intel Corporation October 2013  – Present (1 year 11 months) Santa Clara, CA ISP(Image Signal Processing) FW development for Imaging IP in Atom SoC Senior Software Engineer Intel Corporation August 2012  –  October 2013  (1 year 3 months) Sata Clara, CA Audio DSP FW/SW development for Intel Atom SoC Process TD Engineer Intel Corporation October 2007  –  August 2012  (4 years 11 months) Metrology Group at IMO \n-SW/automation for mask metrology with Nano scale image/pattern analysis. Research Assistant Computational NeuroEngineering Lab (Univ. of Florida) June 2004  –  August 2007  (3 years 3 months) Worked as a Research Assistant during my PhD study at the Univ. of Florida. \n• Research on nonlinear correlation filters with new similarity measure function (Correntropy) for image recognition (face and biometric verification ) \n• Semi-supervised learning algorithm for a new classification with unlabeled data based on entropy information \n• Information theoretic learning for prediction, nonlinear system identification and beamforming Sr. Research Engineer Digital Media Lab. at LG Electronics (Seoul, Korea) July 1997  –  July 2003  (6 years 1 month) Signal processing S/W design for optical storage AV systems. \n•SW/Firmware for Audio CD recorder \n•Embeded system SW for MPEG 2 codec for DVD recorder  \n•PC interface/File system SW for optical storage device (APATI, SCSI, USB, IEEE1394) Senior Software Engineer Intel Corporation October 2013  – Present (1 year 11 months) Santa Clara, CA ISP(Image Signal Processing) FW development for Imaging IP in Atom SoC Senior Software Engineer Intel Corporation October 2013  – Present (1 year 11 months) Santa Clara, CA ISP(Image Signal Processing) FW development for Imaging IP in Atom SoC Senior Software Engineer Intel Corporation August 2012  –  October 2013  (1 year 3 months) Sata Clara, CA Audio DSP FW/SW development for Intel Atom SoC Senior Software Engineer Intel Corporation August 2012  –  October 2013  (1 year 3 months) Sata Clara, CA Audio DSP FW/SW development for Intel Atom SoC Process TD Engineer Intel Corporation October 2007  –  August 2012  (4 years 11 months) Metrology Group at IMO \n-SW/automation for mask metrology with Nano scale image/pattern analysis. Process TD Engineer Intel Corporation October 2007  –  August 2012  (4 years 11 months) Metrology Group at IMO \n-SW/automation for mask metrology with Nano scale image/pattern analysis. Research Assistant Computational NeuroEngineering Lab (Univ. of Florida) June 2004  –  August 2007  (3 years 3 months) Worked as a Research Assistant during my PhD study at the Univ. of Florida. \n• Research on nonlinear correlation filters with new similarity measure function (Correntropy) for image recognition (face and biometric verification ) \n• Semi-supervised learning algorithm for a new classification with unlabeled data based on entropy information \n• Information theoretic learning for prediction, nonlinear system identification and beamforming Research Assistant Computational NeuroEngineering Lab (Univ. of Florida) June 2004  –  August 2007  (3 years 3 months) Worked as a Research Assistant during my PhD study at the Univ. of Florida. \n• Research on nonlinear correlation filters with new similarity measure function (Correntropy) for image recognition (face and biometric verification ) \n• Semi-supervised learning algorithm for a new classification with unlabeled data based on entropy information \n• Information theoretic learning for prediction, nonlinear system identification and beamforming Sr. Research Engineer Digital Media Lab. at LG Electronics (Seoul, Korea) July 1997  –  July 2003  (6 years 1 month) Signal processing S/W design for optical storage AV systems. \n•SW/Firmware for Audio CD recorder \n•Embeded system SW for MPEG 2 codec for DVD recorder  \n•PC interface/File system SW for optical storage device (APATI, SCSI, USB, IEEE1394) Sr. Research Engineer Digital Media Lab. at LG Electronics (Seoul, Korea) July 1997  –  July 2003  (6 years 1 month) Signal processing S/W design for optical storage AV systems. \n•SW/Firmware for Audio CD recorder \n•Embeded system SW for MPEG 2 codec for DVD recorder  \n•PC interface/File system SW for optical storage device (APATI, SCSI, USB, IEEE1394) Skills Machine Learning Neural Networks Signal Processing Pattern Recognition Optimization Image Processing Matlab Perl C++ C Shell Scripting DSP Semiconductor... Embedded Systems Digital Signal... Digital Signal... See 1+     See less Skills  Machine Learning Neural Networks Signal Processing Pattern Recognition Optimization Image Processing Matlab Perl C++ C Shell Scripting DSP Semiconductor... Embedded Systems Digital Signal... Digital Signal... See 1+     See less Machine Learning Neural Networks Signal Processing Pattern Recognition Optimization Image Processing Matlab Perl C++ C Shell Scripting DSP Semiconductor... Embedded Systems Digital Signal... Digital Signal... See 1+     See less Machine Learning Neural Networks Signal Processing Pattern Recognition Optimization Image Processing Matlab Perl C++ C Shell Scripting DSP Semiconductor... Embedded Systems Digital Signal... Digital Signal... See 1+     See less Education University of Florida Ph.D,  Electrical and Computer Engineering 2003  – 2007 Dissertation: The Correntropy MACE filter for Image Recognition Activities and Societies:  Research Assistant at the Computational NeuroEngineering Lab (Advisor: Dr. Jose Principe) University of Florida Ph.D,  Electrical and Computer Engineering 2003  – 2007 Dissertation: The Correntropy MACE filter for Image Recognition Activities and Societies:  Research Assistant at the Computational NeuroEngineering Lab (Advisor: Dr. Jose Principe) University of Florida Ph.D,  Electrical and Computer Engineering 2003  – 2007 Dissertation: The Correntropy MACE filter for Image Recognition Activities and Societies:  Research Assistant at the Computational NeuroEngineering Lab (Advisor: Dr. Jose Principe) University of Florida Ph.D,  Electrical and Computer Engineering 2003  – 2007 Dissertation: The Correntropy MACE filter for Image Recognition Activities and Societies:  Research Assistant at the Computational NeuroEngineering Lab (Advisor: Dr. Jose Principe) ", "Experience Senior Software Engineer Intel Corporation October 2014  – Present (11 months) Leading Software Engineer Samsung February 2014  –  October 2014  (9 months) Senior Software Engineer Intel Corporation April 2011  –  November 2013  (2 years 8 months) Moscow, Russian Federation Software Engineer Intel Corporation July 2007  –  April 2011  (3 years 10 months) Moscow, Russian Federation Undergraduate Intern Technical Intel Corporation June 2006  –  July 2007  (1 year 2 months) Moscow, Russian Federation Senior Software Engineer Intel Corporation October 2014  – Present (11 months) Senior Software Engineer Intel Corporation October 2014  – Present (11 months) Leading Software Engineer Samsung February 2014  –  October 2014  (9 months) Leading Software Engineer Samsung February 2014  –  October 2014  (9 months) Senior Software Engineer Intel Corporation April 2011  –  November 2013  (2 years 8 months) Moscow, Russian Federation Senior Software Engineer Intel Corporation April 2011  –  November 2013  (2 years 8 months) Moscow, Russian Federation Software Engineer Intel Corporation July 2007  –  April 2011  (3 years 10 months) Moscow, Russian Federation Software Engineer Intel Corporation July 2007  –  April 2011  (3 years 10 months) Moscow, Russian Federation Undergraduate Intern Technical Intel Corporation June 2006  –  July 2007  (1 year 2 months) Moscow, Russian Federation Undergraduate Intern Technical Intel Corporation June 2006  –  July 2007  (1 year 2 months) Moscow, Russian Federation Education Lomonosov Moscow State University (MSU) Mathematics and Computer Science 2003  – 2008 Lomonosov Moscow State University (MSU) Mathematics and Computer Science 2003  – 2008 Lomonosov Moscow State University (MSU) Mathematics and Computer Science 2003  – 2008 Lomonosov Moscow State University (MSU) Mathematics and Computer Science 2003  – 2008 ", "Skills Debugging Multithreading Software Engineering C++ Software Design Software Development GPU Intel Object Oriented Design C Computer Architecture System Architecture Perl C# Device Drivers Direct3D Certified Scrum Master... Android Development Python Test Driven Development Digital Video Digital Audio See 7+     See less Skills  Debugging Multithreading Software Engineering C++ Software Design Software Development GPU Intel Object Oriented Design C Computer Architecture System Architecture Perl C# Device Drivers Direct3D Certified Scrum Master... Android Development Python Test Driven Development Digital Video Digital Audio See 7+     See less Debugging Multithreading Software Engineering C++ Software Design Software Development GPU Intel Object Oriented Design C Computer Architecture System Architecture Perl C# Device Drivers Direct3D Certified Scrum Master... Android Development Python Test Driven Development Digital Video Digital Audio See 7+     See less Debugging Multithreading Software Engineering C++ Software Design Software Development GPU Intel Object Oriented Design C Computer Architecture System Architecture Perl C# Device Drivers Direct3D Certified Scrum Master... Android Development Python Test Driven Development Digital Video Digital Audio See 7+     See less ", "Summary Experienced software developer. Developed software for 22 years with Intel Corporation, plus previous experience developing software for voice mail systems, hydroelectric power systems, solid rocket fuel production systems, and oil field services products. \n \nDeveloped software at the application level, device driver stack level, and embedded firmware level, along with interfacing with SQL databases for information storage and retrieval. \n \nUtilized many development environments. Implemented software in C# in the Microsoft Visual Studio 2005/08/10/12 .NET environment for 8 years; prior experience in C++, C, Perl, Python, Fortran, Basic, and assembly language under Windows, Linux, and DOS. \n \nAlso an experienced videographer, video producer, photographer, and audio engineer. Summary Experienced software developer. Developed software for 22 years with Intel Corporation, plus previous experience developing software for voice mail systems, hydroelectric power systems, solid rocket fuel production systems, and oil field services products. \n \nDeveloped software at the application level, device driver stack level, and embedded firmware level, along with interfacing with SQL databases for information storage and retrieval. \n \nUtilized many development environments. Implemented software in C# in the Microsoft Visual Studio 2005/08/10/12 .NET environment for 8 years; prior experience in C++, C, Perl, Python, Fortran, Basic, and assembly language under Windows, Linux, and DOS. \n \nAlso an experienced videographer, video producer, photographer, and audio engineer. Experienced software developer. Developed software for 22 years with Intel Corporation, plus previous experience developing software for voice mail systems, hydroelectric power systems, solid rocket fuel production systems, and oil field services products. \n \nDeveloped software at the application level, device driver stack level, and embedded firmware level, along with interfacing with SQL databases for information storage and retrieval. \n \nUtilized many development environments. Implemented software in C# in the Microsoft Visual Studio 2005/08/10/12 .NET environment for 8 years; prior experience in C++, C, Perl, Python, Fortran, Basic, and assembly language under Windows, Linux, and DOS. \n \nAlso an experienced videographer, video producer, photographer, and audio engineer. Experienced software developer. Developed software for 22 years with Intel Corporation, plus previous experience developing software for voice mail systems, hydroelectric power systems, solid rocket fuel production systems, and oil field services products. \n \nDeveloped software at the application level, device driver stack level, and embedded firmware level, along with interfacing with SQL databases for information storage and retrieval. \n \nUtilized many development environments. Implemented software in C# in the Microsoft Visual Studio 2005/08/10/12 .NET environment for 8 years; prior experience in C++, C, Perl, Python, Fortran, Basic, and assembly language under Windows, Linux, and DOS. \n \nAlso an experienced videographer, video producer, photographer, and audio engineer. Experience Senior Software Engineer SambaSafety August 2014  – Present (1 year 1 month) Rancho Cordova, CA Computer Information Science Adjunct Professor Folsom Lake College August 2013  – Present (2 years 1 month) Folsom, CA \tPart-time (evenings) Fall 2013 – Exploring Computer Environments & the Internet \n\tPart-time (web based) Spring 2014 – Exploring Computer Environments & the Internet Senior Software Engineer Intel Corporation April 2013  –  December 2013  (9 months) Folsom, CA Human Resources Onboarding Group – Folsom Site NEO (New Employee Orientation) Coordinator, developed Blue Room website expansion for Asia new hires (from acceptance until NEO) in On24 environment. Senior Software Engineer Intel Corporation August 2012  –  April 2013  (9 months) Folsom, CA Developed both application and driver software for System Validation of Intel processors using C in Linux environment. \n \nDeveloped Rocket (a proprietary test development/execution environment) plug-ins that called firmware drivers to test CSME (Converged Security and Manageability Engine) hardware. \n \nDeveloped CSME firmware drivers for a variety of secure hardware facilities. \n \nWorked closely with hardware designers and lab validation engineers to determine software requirements and specifications Senior Software Engineer Intel Corporation July 1994  –  August 2012  (18 years 2 months) Folsom, CA Managed small teams of 3 to 5 engineers. \n \nDeveloped software for Compatibility and System Validation (CV and SV) of Intel processors and chipsets in Visual Studio development environment, and Perl scripts and Lira under Linux to parse the RTL (Verilog, System Verilog) to determine hardware infrastructure. \n \nUtilized .NET, Distributed Component Object Model (DCOM), and Win32 subsystems. \n \nReceived Divisional Recognition Award for creating NoaView tool for validating Sandy Bridge and Ivy Bridge processors (Intel® Core™ Gen2 and Gen3 processors). \n \nTools developed ranged from automation of validation test procedures, creation of synthetic tests, to utilities that route 200k+ internal silicon signals to 18 external pins to aid in debug. \n \nDelivered automated CV test execution with environment verification and test results data collection exported to SQL database for subsequent data mining. Senior Software Engineer Intel Corporation August 1991  –  July 1994  (3 years) Folsom, CA Developed BIOS, firmware, and driver software for the Communications Product Division supporting the new PCMCIA (Personal Computer Memory Card International Association - aka PC Cards) specification using C and assembly language in MS-DOS and Windows environments. \n \nImplemented the very first BIOS software to support PCMCIA cards in time for PCMCIA 1.0 Specification Introduction in Santa Clara. \n \nDeveloped firmware for Motorola 68302 micro-controller based laptop fax-modem cards. \n \nDeveloped ODI (Open Data-link Interface) and NDIS (Network Driver Interface Specification) drivers for laptop LAN cards. \n \nWorked with hardware design engineers to detect and resolve hardware and software issues using hardware ICEs (in-circuit emulators), software ICEs, logic analyzers, and oscilloscopes. Senior Software Engineer Genesis Electrionics January 1987  –  August 1991  (4 years 8 months) Rancho Cordova, CA Developed software for voice mail products using C, C++, and assembly language. \n \nRevitalized an aging Motorola 6809 based voice mail product; devised patented firmware that allowed dependable voice detection, enabling the implementation of Automated Attendant product. \n \nMaintained a Motorola 68010 VME based voice mail product; improved the SCSI disk device driver achieving 115% improvement in disk I/O throughput, solved several serial I/O device driver issues, improved phone interface card firmware, and ported patented voice detect algorithm. \n \nWorked closely with Marketing and Customer Service departments to determine software requirements and specifications. Software Engineer Atkinson System Technologies June 1984  –  January 1987  (2 years 8 months) Sacramento, CA Successfully reclaimed a failing SCADA (Supervisory Control and Data Acquisition) project by completing a Power Control System for the City of Ketchikan, Alaska, that controlled the operation of 9 remote hydroelectric power stations and the power distribution system. Software implemented in Fortran and assembly language on HP minicomputers and Z80 based remote units. \n \nMember of two man team that designed and implemented a solid rocket fuel production control system for Aerojet General, on time and under budget. Control system was comprised of an HP minicomputer and several industrial terminals. Senior Software Engineer SambaSafety August 2014  – Present (1 year 1 month) Rancho Cordova, CA Senior Software Engineer SambaSafety August 2014  – Present (1 year 1 month) Rancho Cordova, CA Computer Information Science Adjunct Professor Folsom Lake College August 2013  – Present (2 years 1 month) Folsom, CA \tPart-time (evenings) Fall 2013 – Exploring Computer Environments & the Internet \n\tPart-time (web based) Spring 2014 – Exploring Computer Environments & the Internet Computer Information Science Adjunct Professor Folsom Lake College August 2013  – Present (2 years 1 month) Folsom, CA \tPart-time (evenings) Fall 2013 – Exploring Computer Environments & the Internet \n\tPart-time (web based) Spring 2014 – Exploring Computer Environments & the Internet Senior Software Engineer Intel Corporation April 2013  –  December 2013  (9 months) Folsom, CA Human Resources Onboarding Group – Folsom Site NEO (New Employee Orientation) Coordinator, developed Blue Room website expansion for Asia new hires (from acceptance until NEO) in On24 environment. Senior Software Engineer Intel Corporation April 2013  –  December 2013  (9 months) Folsom, CA Human Resources Onboarding Group – Folsom Site NEO (New Employee Orientation) Coordinator, developed Blue Room website expansion for Asia new hires (from acceptance until NEO) in On24 environment. Senior Software Engineer Intel Corporation August 2012  –  April 2013  (9 months) Folsom, CA Developed both application and driver software for System Validation of Intel processors using C in Linux environment. \n \nDeveloped Rocket (a proprietary test development/execution environment) plug-ins that called firmware drivers to test CSME (Converged Security and Manageability Engine) hardware. \n \nDeveloped CSME firmware drivers for a variety of secure hardware facilities. \n \nWorked closely with hardware designers and lab validation engineers to determine software requirements and specifications Senior Software Engineer Intel Corporation August 2012  –  April 2013  (9 months) Folsom, CA Developed both application and driver software for System Validation of Intel processors using C in Linux environment. \n \nDeveloped Rocket (a proprietary test development/execution environment) plug-ins that called firmware drivers to test CSME (Converged Security and Manageability Engine) hardware. \n \nDeveloped CSME firmware drivers for a variety of secure hardware facilities. \n \nWorked closely with hardware designers and lab validation engineers to determine software requirements and specifications Senior Software Engineer Intel Corporation July 1994  –  August 2012  (18 years 2 months) Folsom, CA Managed small teams of 3 to 5 engineers. \n \nDeveloped software for Compatibility and System Validation (CV and SV) of Intel processors and chipsets in Visual Studio development environment, and Perl scripts and Lira under Linux to parse the RTL (Verilog, System Verilog) to determine hardware infrastructure. \n \nUtilized .NET, Distributed Component Object Model (DCOM), and Win32 subsystems. \n \nReceived Divisional Recognition Award for creating NoaView tool for validating Sandy Bridge and Ivy Bridge processors (Intel® Core™ Gen2 and Gen3 processors). \n \nTools developed ranged from automation of validation test procedures, creation of synthetic tests, to utilities that route 200k+ internal silicon signals to 18 external pins to aid in debug. \n \nDelivered automated CV test execution with environment verification and test results data collection exported to SQL database for subsequent data mining. Senior Software Engineer Intel Corporation July 1994  –  August 2012  (18 years 2 months) Folsom, CA Managed small teams of 3 to 5 engineers. \n \nDeveloped software for Compatibility and System Validation (CV and SV) of Intel processors and chipsets in Visual Studio development environment, and Perl scripts and Lira under Linux to parse the RTL (Verilog, System Verilog) to determine hardware infrastructure. \n \nUtilized .NET, Distributed Component Object Model (DCOM), and Win32 subsystems. \n \nReceived Divisional Recognition Award for creating NoaView tool for validating Sandy Bridge and Ivy Bridge processors (Intel® Core™ Gen2 and Gen3 processors). \n \nTools developed ranged from automation of validation test procedures, creation of synthetic tests, to utilities that route 200k+ internal silicon signals to 18 external pins to aid in debug. \n \nDelivered automated CV test execution with environment verification and test results data collection exported to SQL database for subsequent data mining. Senior Software Engineer Intel Corporation August 1991  –  July 1994  (3 years) Folsom, CA Developed BIOS, firmware, and driver software for the Communications Product Division supporting the new PCMCIA (Personal Computer Memory Card International Association - aka PC Cards) specification using C and assembly language in MS-DOS and Windows environments. \n \nImplemented the very first BIOS software to support PCMCIA cards in time for PCMCIA 1.0 Specification Introduction in Santa Clara. \n \nDeveloped firmware for Motorola 68302 micro-controller based laptop fax-modem cards. \n \nDeveloped ODI (Open Data-link Interface) and NDIS (Network Driver Interface Specification) drivers for laptop LAN cards. \n \nWorked with hardware design engineers to detect and resolve hardware and software issues using hardware ICEs (in-circuit emulators), software ICEs, logic analyzers, and oscilloscopes. Senior Software Engineer Intel Corporation August 1991  –  July 1994  (3 years) Folsom, CA Developed BIOS, firmware, and driver software for the Communications Product Division supporting the new PCMCIA (Personal Computer Memory Card International Association - aka PC Cards) specification using C and assembly language in MS-DOS and Windows environments. \n \nImplemented the very first BIOS software to support PCMCIA cards in time for PCMCIA 1.0 Specification Introduction in Santa Clara. \n \nDeveloped firmware for Motorola 68302 micro-controller based laptop fax-modem cards. \n \nDeveloped ODI (Open Data-link Interface) and NDIS (Network Driver Interface Specification) drivers for laptop LAN cards. \n \nWorked with hardware design engineers to detect and resolve hardware and software issues using hardware ICEs (in-circuit emulators), software ICEs, logic analyzers, and oscilloscopes. Senior Software Engineer Genesis Electrionics January 1987  –  August 1991  (4 years 8 months) Rancho Cordova, CA Developed software for voice mail products using C, C++, and assembly language. \n \nRevitalized an aging Motorola 6809 based voice mail product; devised patented firmware that allowed dependable voice detection, enabling the implementation of Automated Attendant product. \n \nMaintained a Motorola 68010 VME based voice mail product; improved the SCSI disk device driver achieving 115% improvement in disk I/O throughput, solved several serial I/O device driver issues, improved phone interface card firmware, and ported patented voice detect algorithm. \n \nWorked closely with Marketing and Customer Service departments to determine software requirements and specifications. Senior Software Engineer Genesis Electrionics January 1987  –  August 1991  (4 years 8 months) Rancho Cordova, CA Developed software for voice mail products using C, C++, and assembly language. \n \nRevitalized an aging Motorola 6809 based voice mail product; devised patented firmware that allowed dependable voice detection, enabling the implementation of Automated Attendant product. \n \nMaintained a Motorola 68010 VME based voice mail product; improved the SCSI disk device driver achieving 115% improvement in disk I/O throughput, solved several serial I/O device driver issues, improved phone interface card firmware, and ported patented voice detect algorithm. \n \nWorked closely with Marketing and Customer Service departments to determine software requirements and specifications. Software Engineer Atkinson System Technologies June 1984  –  January 1987  (2 years 8 months) Sacramento, CA Successfully reclaimed a failing SCADA (Supervisory Control and Data Acquisition) project by completing a Power Control System for the City of Ketchikan, Alaska, that controlled the operation of 9 remote hydroelectric power stations and the power distribution system. Software implemented in Fortran and assembly language on HP minicomputers and Z80 based remote units. \n \nMember of two man team that designed and implemented a solid rocket fuel production control system for Aerojet General, on time and under budget. Control system was comprised of an HP minicomputer and several industrial terminals. Software Engineer Atkinson System Technologies June 1984  –  January 1987  (2 years 8 months) Sacramento, CA Successfully reclaimed a failing SCADA (Supervisory Control and Data Acquisition) project by completing a Power Control System for the City of Ketchikan, Alaska, that controlled the operation of 9 remote hydroelectric power stations and the power distribution system. Software implemented in Fortran and assembly language on HP minicomputers and Z80 based remote units. \n \nMember of two man team that designed and implemented a solid rocket fuel production control system for Aerojet General, on time and under budget. Control system was comprised of an HP minicomputer and several industrial terminals. Skills Device Drivers Embedded Systems Embedded Software Firmware Perl Verilog Intel Semiconductors C Software Engineering Computer Architecture Testing Hardware C++ Distributed Systems Linux See 1+     See less Skills  Device Drivers Embedded Systems Embedded Software Firmware Perl Verilog Intel Semiconductors C Software Engineering Computer Architecture Testing Hardware C++ Distributed Systems Linux See 1+     See less Device Drivers Embedded Systems Embedded Software Firmware Perl Verilog Intel Semiconductors C Software Engineering Computer Architecture Testing Hardware C++ Distributed Systems Linux See 1+     See less Device Drivers Embedded Systems Embedded Software Firmware Perl Verilog Intel Semiconductors C Software Engineering Computer Architecture Testing Hardware C++ Distributed Systems Linux See 1+     See less Education Sacramento City College Associate's Degree,  Mathematics and Science California State University-Sacramento Bachelor's Degree,  Computer Science Activities and Societies:  Institute of Electrical and Electronics Engineers - Computer Society California State University-Sacramento Master's Degree,  Computer Science Activities and Societies:  Upsilon Pi Epsilon International Honor Society Sacramento City College Associate's Degree,  Mathematics and Science Sacramento City College Associate's Degree,  Mathematics and Science Sacramento City College Associate's Degree,  Mathematics and Science California State University-Sacramento Bachelor's Degree,  Computer Science Activities and Societies:  Institute of Electrical and Electronics Engineers - Computer Society California State University-Sacramento Bachelor's Degree,  Computer Science Activities and Societies:  Institute of Electrical and Electronics Engineers - Computer Society California State University-Sacramento Bachelor's Degree,  Computer Science Activities and Societies:  Institute of Electrical and Electronics Engineers - Computer Society California State University-Sacramento Master's Degree,  Computer Science Activities and Societies:  Upsilon Pi Epsilon International Honor Society California State University-Sacramento Master's Degree,  Computer Science Activities and Societies:  Upsilon Pi Epsilon International Honor Society California State University-Sacramento Master's Degree,  Computer Science Activities and Societies:  Upsilon Pi Epsilon International Honor Society ", "Summary Talented, bright and versatile software engineer with 21 years of experience. Worked 17 years at two industry-leading computing firms where I was frequently rated in the top two categories on employee performance reviews. Fast-learning self-starter with excellent analytical and problem  \nsolving skills. Expertise in many facets of software engineering including: architecture, development, validation, test automation and documentation. Experience in requirements gathering, defining test strategies, developing test plans, and building and executing manual/automated test cases. Summary Talented, bright and versatile software engineer with 21 years of experience. Worked 17 years at two industry-leading computing firms where I was frequently rated in the top two categories on employee performance reviews. Fast-learning self-starter with excellent analytical and problem  \nsolving skills. Expertise in many facets of software engineering including: architecture, development, validation, test automation and documentation. Experience in requirements gathering, defining test strategies, developing test plans, and building and executing manual/automated test cases. Talented, bright and versatile software engineer with 21 years of experience. Worked 17 years at two industry-leading computing firms where I was frequently rated in the top two categories on employee performance reviews. Fast-learning self-starter with excellent analytical and problem  \nsolving skills. Expertise in many facets of software engineering including: architecture, development, validation, test automation and documentation. Experience in requirements gathering, defining test strategies, developing test plans, and building and executing manual/automated test cases. Talented, bright and versatile software engineer with 21 years of experience. Worked 17 years at two industry-leading computing firms where I was frequently rated in the top two categories on employee performance reviews. Fast-learning self-starter with excellent analytical and problem  \nsolving skills. Expertise in many facets of software engineering including: architecture, development, validation, test automation and documentation. Experience in requirements gathering, defining test strategies, developing test plans, and building and executing manual/automated test cases. Experience Senior Software Engineer/Analog Engineer Intel Corporation July 2011  –  December 2012  (1 year 6 months) DuPont, WA Developer - “Intel Margining Tool” (written in C) \nDelivered high quality chipset margining tool for Sharkbay (Haswell) Platforms \nLeveraged extensive SW Engineering experience to produce tool used to perform voltage and timing margining for PEG & DMI links and on PCH receiver side for DMI, PCIe, SATA and USB3 links \n \nDeveloper - Intel's PseudoSim Tool (written in MATLAB) \nWorked w/ cross-site International Team (Malaysia, India, WA, OR) to deliver high-quality tool \nWrote code for GUI. Responsible for processing and accepting data files \nWrote full and detailed documentation for the tool and rewrote all documentation for associated tool \nMentored/assisted RCG in coding tool distribution/installation program. Performed Code Review Senior BIOS Engineer Intel Corporation June 2009  –  June 2011  (2 years 1 month) DuPont, WA Developer of C-based/Tiano BIOS on Intel's flagship Itanium & Xeon multiprocessor server platforms \nDelivered high quality BIOSs.  \nLeveraged extensive Eval experience to implement good test strategies and create good test practices and test sets for BIOS & other teams \n \nBromolow (Xeon) BIOS: \n Static Boot Ordering Feature – Defined requirements for this new feature \nImplemented the feature by writing C-code & Writing 27 pages of docs. \nCreated detailed flow charts of Dynamic Boot Order & Static Boot Order features \n Mentored & assisted RCG in coding the Signed Capsule BIOS feature and Performed Code Review \n \nCraterLake (Itanium2 Enterprise-Class Multiprocessor Server) BIOS: \n Fixed numerous bugs for PRQ & post-PRQ BIOS releases \n Joined Eval effort in lab to get BIOSs tested & delivered early. \nWrote excellent, detailed bug reports. Senior Software Engineer Intel Corporation January 2007  –  May 2009  (2 years 5 months) DuPont, WA BIOS Developer \nDeveloped Assembly-based BIOSs on Advanced Xeon MP Servers in the Dell/Intel Joint Innovation Center (the \"JIC\") \nExcelled as a BIOS Engineer– specializing in complex areas: Power States, SMI & Error Handling \nSkills: assembly language programming, knowledge of BIOS dev tools such as version control, build tools, Bug Tracking tools & BIOS Eval tests \nRefined, streamlined, documented & disseminated information on effective BIOS Dev. processes \nCreated BIOS Release BKM doc defining steps required to build & release official Dell BIOS \n \nBIOS Lead– Dunnington (DUN) processor enablement \nCreated 15 BIOSs for release: supporting Dell, Intel Eval teams & other teams \nLed effort implementing new processor CC3 power savings. \nProvided BIOS support for Intel top executive's demo to the press \n1st person to successfully make power measurements for DUN/Catamount \nCreated custom BIOS workarounds to support boards not ready for DUN \nMerged Code: integrated & enabled new Dell BIOS Code, microcode updates & MRC updates \n \nLead for Catamount BIOS Sustaining \nCreated, tested & distributed 24 Tigerton Processor BIOSs \nMerged Dell Code– including critical MLK (Mid-Life Kicker) BIOS, Bug-Fixes, Hot Issues \nCode Check-ins to Dimensions, transition from Dimensions to SVN code repository \nCoordinated w/ Dell & Intel Teams \nExceptional support to the Dell BIOS team – providing detailed analysis of customer issues \nUtilized extensive BIOS Eval expertise to create Test Strategy Doc & create & execute UT test cases \n \nMcCave BIOS \nParticipated in Bring-Up (initial power-on and first-boot to OS of first-produced hardware) \n1st to run a system with max cores & memory – which I demonstrated to management in the lab \nNumerous Code Reviews \n \nBITS Manager for the JIC \nSuperb job of managing BITS (Dell's Bug reporting & tracking tool) \nLiaison with Dell – successfully representing the JIC w/ important external customer. \nCreated work orders at Dell & followed-through Dell to implement them Senior Software Engineer Intel Corporation January 2006  –  December 2006  (1 year) DuPont, WA Developer Sr SW Engineer – Automation Team: Developing Automation SW for BIOS Eval \nAutomated BIOS Eval tests: \n• Created 2 automated BIOS test programs \n• Wrote 10K Lines of Python Code. Gathered requirements, planned, designed, architected, developed, implemented, tested, documented, demonstrated, & taught use of Automation SW. \n \nBIOS Evaluation Expert: \nVolunteered for: \n• Document Inspection: Instrumental in driving adoption of & teaching of Doc Inspection in multiple platforms/groups. 2nd-level manager praised: \nGreat work supporting our “shift left” strategy... We held our 1st formal document inspection for BIOS EPS leveraging Ian’s certification & discovered 219 defects. Previous reviews were significantly less formal & we’d have been lucky to find 1/4 of these… we just prevented >165 EPS defects along with likely 165 SW defects: total=330!\" \n• FoxCove: Reviewed SOW, PIP, POP – and provided corrections and feedback to relevant teams  \n• As recognized BIOS Eval expert I Participated on DFT team & created BIOS Eval requirements \n• Performed review of MCA & FBDIMM Memory Error Handling BIOS Code \n• Created TCL for BIOS Eval (456 lines). Additionally, Created 552 lines of tests. \n• UEFI: Provided feedback & corrections to the UEFI team on the UEFI docs. \n• Taught Escapes Analysis, BKMs & other BIOS Eval processes to FirmWare & BIOS Eval teams \n• Enterprise Validation Task force: Represented BIOS & FW Eval teams; Interfaced with QRE. \n• Validation SW Collaboration Team – represented BIOS & FW Eval teams. \nIMPACT to Intel: A better functioning BIOS Eval team, better cross-team communication, better team cooperation, less buggy products. Senior Software Engineer Intel Corporation January 2003  –  December 2005  (3 years) DuPont, WA Team Lead - BIOS Eval Team \nTest planning, development, execution & reporting for Intel's Leading Itanium 2 & Xeon Enterprise-Class MP servers \nGreatly improved quality of BIOS Eval. Created 65 page BKMs doc: detailed instructions on Running test sets, Writing good bug reports, proper level of detail, Verifying bugs, Writing Good Test Procedures, Running tests on systems w/ different HW revisions. Trained 16 people \n \nIndia \n• 6 weeks in India Jump-starting new BIOS Eval team \n• Taught various specs, role-modeled Intel values & led their first test run \n \n2 Itanium & 3 Xeon Servers (2 Blade Servers) \n185 BIOS Eval Test Runs on 10 versions of procs \n• Working independently in highly competent & reliable manner, consistently met aggressive schedule pull-ins with on-time delivery \n• Effectively led cross-site team w/ 2x a week Coordination meeting w/ India & Oregon BIOS Eval teams \n• Reported status to stakeholders & Balanced priorities while leading 3-4 projects \n• Coordinated w/ tools team in India on testware creation & modification \n• Dell Lab Tour: Represented Intel BIOS Eval & led Dell Management tour and inspection\t• Validation Prog Manager said “Ian is one of the shining stars of the Tiger program!” \n• Completed Test Plan & Test Sets w/ >1300 manual & thousands of automated tests \n• Provided IBM & Dell (VIP customers) w/ quality products \n \nIBM \n• Excellent job of creating & presenting to IBM management presentation on BIOS Eval at Intel \n• Created & Presented Lab Demo: Error Injection, PERR/SERR testing, Predictive Failure Altering, Event Logging, POST Error Testing, Management Module \n• IBM Feedback: “Ian's presentation was informative, enthusiastic and surprisingly entertaining” \n• Impressed IBM reps w/ Depth & Breadth of Intel’s BIOS Eval \n \nProcess Improvements \n• Analyzed all BIOS bugs & implemented improvements. Moved tests w/ higher failure rates to run earlier in eval cycles \n• Made significant improvements to test sets for faster, more efficient eval cycles Senior Software Engineer Intel Corporation October 2001  –  December 2002  (1 year 3 months) DuPont, WA BIOS Validation Engineer / Software Engineer \nBIOS Eval of Itanium & Xeon-based Enterprise-Class Multiprocessor Servers \n \nLed BIOS Eval on Intel's most important Itanium Servers: the Enterprise-class MP Tiger-4 & Tiger-2 Servers \nTiger-4 with Itanium® 2 & Madison procs BIOS Validation Test Runs– Working independently in a highly competent & reliable manner, I consistently led a group of test engineers to met the BIOS Validation Test Run deadlines in a very aggressive schedule.  \n \nIA-64 Test Sets & Procedures— Throughout the year I made improvements to the T4/T2 Test Sets & Procedures – which resulted in significantly better test coverage, greater confidence in the functionality & improved quality of all our tests on Itanium-based platforms. \n \nRecognized expert in MCA (Machine Check Architecture) \n• Created Intel's first MCA Test Plan & Test Sets \n• MCA Task Force: Active member throughout the year. My BIOS Eval MCA Test Plan & Test Sets being the first created were used by other groups as the basis for creating their test plans. \n• Role-modeled the Intel value \"Pay Attention to Detail\" in the creation of the four MCA Test Sets w/ detailed steps for Error Injection Procedures, Verification Procedures & Expected Results. \n• Role-modeled Intel value “Excel at Customer Satisfaction” by always making Customer Satisfaction my #1 priority. Whenever presented with a customer error or issue , I immediately dedicated all available resources to finding a solution. Additionally, I always approach my job with an eye to improving the experience of our customers – both OEMs & end-users. Value to Intel is a good customer experience, a boost to our vendor of choice rating & increased sales. Senior Software Engineer Intel Corporation February 2000  –  October 2001  (1 year 9 months) Riverton, UT Developer of Remote Management SW for “eMail Station” & “NetStructure” Servers \n Coded in C, C++, JavaScript, HTML, Perl, and PHP: \n Discovered, Fixed & Verified fixes for 1000 errors in 1st generation eMail Station UI pages \n Volunteered for and Performed a detailed Code Review of over 30,000 lines of C and C++ \n Created & Modified UI pages for 2nd gen. eMail Station & the “Storefront Appliance“ Software Engineer Novell October 1995  –  February 2000  (4 years 5 months) Provo, Utah - Rated in the Highest Category on Employee Performance Reviews 2½ of my final 3 years \n- Rated One of Novell's Top Validation Engineers - Set Record for most bugs found & reported in one year during my 1st year - Broke that record two years later \n- Highly Praised by developers and managers for writing excellent, detailed bug reports including description of the bug, background info, setup & minimum steps to reproduce it \n- Architected & Wrote (C) an Automated Testing Engine for login/logout tests of NetWare clients \n- Program operates as a service under Windows NT & Windows 98 and 95 where it imitates interactive users by passing keystrokes to any window—even Windows NT Secure Desktop \n- Created new scripting language “I” for writing the tests—including support for header files, libraries, subroutines, loops, local & global variables, math & logic operations, etc. \n- Managed team of 5 engineers to deliver ahead of schedule—even finishing “stretch goals” \n- Developer of the NW Client GUI Login code – Maintained code, fixed bugs & added new features \n- Wrote & Executed Test Plans and logged detailed bug reports for four major products Software Engineer Center for Atmospheric & Space Science September 1991  –  October 1995  (4 years 2 months) Logan, UT SW Engineer / Principal Research Technician \n Wrote, Maintained & Documented data analysis programs (Coding in C, Fortran, Basic and IDL) \n Created and coded 3D compression program to compress semi-noisy data with elliptical symmetry \n Managed the lab computers and the lab network (WinNT, Win3.11, Unix & DOS) \n- Selected and Installed hardware & software for lab computers (14 PCs, 1 DecStation) \n- Wrote Unix shell scripts to aid in administration of the DecStation \n Integrated data acquisition hardware and software with scientific instruments \n Initiated & Maintained computerized remote control system for instruments at a remote observatory Software Engineer Surface Physics Lab, Utah State University September 1990  –  September 1991  (1 year 1 month) Logan, UT Software Engineer/Research Technician, Logan, UT, 1990 - 1991 \n Modified data manipulation progs (Fortran & Forth)  Selected/Installed HW for lab computer system \n Developed SW to analyze experimental data for investigation of Pons and Fleischmann's Cold Fusion claims for the Utah State Energy Board Software Developer River Software July 1989  –  September 1990  (1 year 3 months) Reston. VA Designed a GUI Macintosh word processor specifically for writing movie scripts \nWrote all the code \nCreated and executed all required tests  \nDeveloped two Beta versions and the Release 1.0 version of the \"Script Processor\" \nWrote extensive documentation and help files Senior Software Engineer/Analog Engineer Intel Corporation July 2011  –  December 2012  (1 year 6 months) DuPont, WA Developer - “Intel Margining Tool” (written in C) \nDelivered high quality chipset margining tool for Sharkbay (Haswell) Platforms \nLeveraged extensive SW Engineering experience to produce tool used to perform voltage and timing margining for PEG & DMI links and on PCH receiver side for DMI, PCIe, SATA and USB3 links \n \nDeveloper - Intel's PseudoSim Tool (written in MATLAB) \nWorked w/ cross-site International Team (Malaysia, India, WA, OR) to deliver high-quality tool \nWrote code for GUI. Responsible for processing and accepting data files \nWrote full and detailed documentation for the tool and rewrote all documentation for associated tool \nMentored/assisted RCG in coding tool distribution/installation program. Performed Code Review Senior Software Engineer/Analog Engineer Intel Corporation July 2011  –  December 2012  (1 year 6 months) DuPont, WA Developer - “Intel Margining Tool” (written in C) \nDelivered high quality chipset margining tool for Sharkbay (Haswell) Platforms \nLeveraged extensive SW Engineering experience to produce tool used to perform voltage and timing margining for PEG & DMI links and on PCH receiver side for DMI, PCIe, SATA and USB3 links \n \nDeveloper - Intel's PseudoSim Tool (written in MATLAB) \nWorked w/ cross-site International Team (Malaysia, India, WA, OR) to deliver high-quality tool \nWrote code for GUI. Responsible for processing and accepting data files \nWrote full and detailed documentation for the tool and rewrote all documentation for associated tool \nMentored/assisted RCG in coding tool distribution/installation program. Performed Code Review Senior BIOS Engineer Intel Corporation June 2009  –  June 2011  (2 years 1 month) DuPont, WA Developer of C-based/Tiano BIOS on Intel's flagship Itanium & Xeon multiprocessor server platforms \nDelivered high quality BIOSs.  \nLeveraged extensive Eval experience to implement good test strategies and create good test practices and test sets for BIOS & other teams \n \nBromolow (Xeon) BIOS: \n Static Boot Ordering Feature – Defined requirements for this new feature \nImplemented the feature by writing C-code & Writing 27 pages of docs. \nCreated detailed flow charts of Dynamic Boot Order & Static Boot Order features \n Mentored & assisted RCG in coding the Signed Capsule BIOS feature and Performed Code Review \n \nCraterLake (Itanium2 Enterprise-Class Multiprocessor Server) BIOS: \n Fixed numerous bugs for PRQ & post-PRQ BIOS releases \n Joined Eval effort in lab to get BIOSs tested & delivered early. \nWrote excellent, detailed bug reports. Senior BIOS Engineer Intel Corporation June 2009  –  June 2011  (2 years 1 month) DuPont, WA Developer of C-based/Tiano BIOS on Intel's flagship Itanium & Xeon multiprocessor server platforms \nDelivered high quality BIOSs.  \nLeveraged extensive Eval experience to implement good test strategies and create good test practices and test sets for BIOS & other teams \n \nBromolow (Xeon) BIOS: \n Static Boot Ordering Feature – Defined requirements for this new feature \nImplemented the feature by writing C-code & Writing 27 pages of docs. \nCreated detailed flow charts of Dynamic Boot Order & Static Boot Order features \n Mentored & assisted RCG in coding the Signed Capsule BIOS feature and Performed Code Review \n \nCraterLake (Itanium2 Enterprise-Class Multiprocessor Server) BIOS: \n Fixed numerous bugs for PRQ & post-PRQ BIOS releases \n Joined Eval effort in lab to get BIOSs tested & delivered early. \nWrote excellent, detailed bug reports. Senior Software Engineer Intel Corporation January 2007  –  May 2009  (2 years 5 months) DuPont, WA BIOS Developer \nDeveloped Assembly-based BIOSs on Advanced Xeon MP Servers in the Dell/Intel Joint Innovation Center (the \"JIC\") \nExcelled as a BIOS Engineer– specializing in complex areas: Power States, SMI & Error Handling \nSkills: assembly language programming, knowledge of BIOS dev tools such as version control, build tools, Bug Tracking tools & BIOS Eval tests \nRefined, streamlined, documented & disseminated information on effective BIOS Dev. processes \nCreated BIOS Release BKM doc defining steps required to build & release official Dell BIOS \n \nBIOS Lead– Dunnington (DUN) processor enablement \nCreated 15 BIOSs for release: supporting Dell, Intel Eval teams & other teams \nLed effort implementing new processor CC3 power savings. \nProvided BIOS support for Intel top executive's demo to the press \n1st person to successfully make power measurements for DUN/Catamount \nCreated custom BIOS workarounds to support boards not ready for DUN \nMerged Code: integrated & enabled new Dell BIOS Code, microcode updates & MRC updates \n \nLead for Catamount BIOS Sustaining \nCreated, tested & distributed 24 Tigerton Processor BIOSs \nMerged Dell Code– including critical MLK (Mid-Life Kicker) BIOS, Bug-Fixes, Hot Issues \nCode Check-ins to Dimensions, transition from Dimensions to SVN code repository \nCoordinated w/ Dell & Intel Teams \nExceptional support to the Dell BIOS team – providing detailed analysis of customer issues \nUtilized extensive BIOS Eval expertise to create Test Strategy Doc & create & execute UT test cases \n \nMcCave BIOS \nParticipated in Bring-Up (initial power-on and first-boot to OS of first-produced hardware) \n1st to run a system with max cores & memory – which I demonstrated to management in the lab \nNumerous Code Reviews \n \nBITS Manager for the JIC \nSuperb job of managing BITS (Dell's Bug reporting & tracking tool) \nLiaison with Dell – successfully representing the JIC w/ important external customer. \nCreated work orders at Dell & followed-through Dell to implement them Senior Software Engineer Intel Corporation January 2007  –  May 2009  (2 years 5 months) DuPont, WA BIOS Developer \nDeveloped Assembly-based BIOSs on Advanced Xeon MP Servers in the Dell/Intel Joint Innovation Center (the \"JIC\") \nExcelled as a BIOS Engineer– specializing in complex areas: Power States, SMI & Error Handling \nSkills: assembly language programming, knowledge of BIOS dev tools such as version control, build tools, Bug Tracking tools & BIOS Eval tests \nRefined, streamlined, documented & disseminated information on effective BIOS Dev. processes \nCreated BIOS Release BKM doc defining steps required to build & release official Dell BIOS \n \nBIOS Lead– Dunnington (DUN) processor enablement \nCreated 15 BIOSs for release: supporting Dell, Intel Eval teams & other teams \nLed effort implementing new processor CC3 power savings. \nProvided BIOS support for Intel top executive's demo to the press \n1st person to successfully make power measurements for DUN/Catamount \nCreated custom BIOS workarounds to support boards not ready for DUN \nMerged Code: integrated & enabled new Dell BIOS Code, microcode updates & MRC updates \n \nLead for Catamount BIOS Sustaining \nCreated, tested & distributed 24 Tigerton Processor BIOSs \nMerged Dell Code– including critical MLK (Mid-Life Kicker) BIOS, Bug-Fixes, Hot Issues \nCode Check-ins to Dimensions, transition from Dimensions to SVN code repository \nCoordinated w/ Dell & Intel Teams \nExceptional support to the Dell BIOS team – providing detailed analysis of customer issues \nUtilized extensive BIOS Eval expertise to create Test Strategy Doc & create & execute UT test cases \n \nMcCave BIOS \nParticipated in Bring-Up (initial power-on and first-boot to OS of first-produced hardware) \n1st to run a system with max cores & memory – which I demonstrated to management in the lab \nNumerous Code Reviews \n \nBITS Manager for the JIC \nSuperb job of managing BITS (Dell's Bug reporting & tracking tool) \nLiaison with Dell – successfully representing the JIC w/ important external customer. \nCreated work orders at Dell & followed-through Dell to implement them Senior Software Engineer Intel Corporation January 2006  –  December 2006  (1 year) DuPont, WA Developer Sr SW Engineer – Automation Team: Developing Automation SW for BIOS Eval \nAutomated BIOS Eval tests: \n• Created 2 automated BIOS test programs \n• Wrote 10K Lines of Python Code. Gathered requirements, planned, designed, architected, developed, implemented, tested, documented, demonstrated, & taught use of Automation SW. \n \nBIOS Evaluation Expert: \nVolunteered for: \n• Document Inspection: Instrumental in driving adoption of & teaching of Doc Inspection in multiple platforms/groups. 2nd-level manager praised: \nGreat work supporting our “shift left” strategy... We held our 1st formal document inspection for BIOS EPS leveraging Ian’s certification & discovered 219 defects. Previous reviews were significantly less formal & we’d have been lucky to find 1/4 of these… we just prevented >165 EPS defects along with likely 165 SW defects: total=330!\" \n• FoxCove: Reviewed SOW, PIP, POP – and provided corrections and feedback to relevant teams  \n• As recognized BIOS Eval expert I Participated on DFT team & created BIOS Eval requirements \n• Performed review of MCA & FBDIMM Memory Error Handling BIOS Code \n• Created TCL for BIOS Eval (456 lines). Additionally, Created 552 lines of tests. \n• UEFI: Provided feedback & corrections to the UEFI team on the UEFI docs. \n• Taught Escapes Analysis, BKMs & other BIOS Eval processes to FirmWare & BIOS Eval teams \n• Enterprise Validation Task force: Represented BIOS & FW Eval teams; Interfaced with QRE. \n• Validation SW Collaboration Team – represented BIOS & FW Eval teams. \nIMPACT to Intel: A better functioning BIOS Eval team, better cross-team communication, better team cooperation, less buggy products. Senior Software Engineer Intel Corporation January 2006  –  December 2006  (1 year) DuPont, WA Developer Sr SW Engineer – Automation Team: Developing Automation SW for BIOS Eval \nAutomated BIOS Eval tests: \n• Created 2 automated BIOS test programs \n• Wrote 10K Lines of Python Code. Gathered requirements, planned, designed, architected, developed, implemented, tested, documented, demonstrated, & taught use of Automation SW. \n \nBIOS Evaluation Expert: \nVolunteered for: \n• Document Inspection: Instrumental in driving adoption of & teaching of Doc Inspection in multiple platforms/groups. 2nd-level manager praised: \nGreat work supporting our “shift left” strategy... We held our 1st formal document inspection for BIOS EPS leveraging Ian’s certification & discovered 219 defects. Previous reviews were significantly less formal & we’d have been lucky to find 1/4 of these… we just prevented >165 EPS defects along with likely 165 SW defects: total=330!\" \n• FoxCove: Reviewed SOW, PIP, POP – and provided corrections and feedback to relevant teams  \n• As recognized BIOS Eval expert I Participated on DFT team & created BIOS Eval requirements \n• Performed review of MCA & FBDIMM Memory Error Handling BIOS Code \n• Created TCL for BIOS Eval (456 lines). Additionally, Created 552 lines of tests. \n• UEFI: Provided feedback & corrections to the UEFI team on the UEFI docs. \n• Taught Escapes Analysis, BKMs & other BIOS Eval processes to FirmWare & BIOS Eval teams \n• Enterprise Validation Task force: Represented BIOS & FW Eval teams; Interfaced with QRE. \n• Validation SW Collaboration Team – represented BIOS & FW Eval teams. \nIMPACT to Intel: A better functioning BIOS Eval team, better cross-team communication, better team cooperation, less buggy products. Senior Software Engineer Intel Corporation January 2003  –  December 2005  (3 years) DuPont, WA Team Lead - BIOS Eval Team \nTest planning, development, execution & reporting for Intel's Leading Itanium 2 & Xeon Enterprise-Class MP servers \nGreatly improved quality of BIOS Eval. Created 65 page BKMs doc: detailed instructions on Running test sets, Writing good bug reports, proper level of detail, Verifying bugs, Writing Good Test Procedures, Running tests on systems w/ different HW revisions. Trained 16 people \n \nIndia \n• 6 weeks in India Jump-starting new BIOS Eval team \n• Taught various specs, role-modeled Intel values & led their first test run \n \n2 Itanium & 3 Xeon Servers (2 Blade Servers) \n185 BIOS Eval Test Runs on 10 versions of procs \n• Working independently in highly competent & reliable manner, consistently met aggressive schedule pull-ins with on-time delivery \n• Effectively led cross-site team w/ 2x a week Coordination meeting w/ India & Oregon BIOS Eval teams \n• Reported status to stakeholders & Balanced priorities while leading 3-4 projects \n• Coordinated w/ tools team in India on testware creation & modification \n• Dell Lab Tour: Represented Intel BIOS Eval & led Dell Management tour and inspection\t• Validation Prog Manager said “Ian is one of the shining stars of the Tiger program!” \n• Completed Test Plan & Test Sets w/ >1300 manual & thousands of automated tests \n• Provided IBM & Dell (VIP customers) w/ quality products \n \nIBM \n• Excellent job of creating & presenting to IBM management presentation on BIOS Eval at Intel \n• Created & Presented Lab Demo: Error Injection, PERR/SERR testing, Predictive Failure Altering, Event Logging, POST Error Testing, Management Module \n• IBM Feedback: “Ian's presentation was informative, enthusiastic and surprisingly entertaining” \n• Impressed IBM reps w/ Depth & Breadth of Intel’s BIOS Eval \n \nProcess Improvements \n• Analyzed all BIOS bugs & implemented improvements. Moved tests w/ higher failure rates to run earlier in eval cycles \n• Made significant improvements to test sets for faster, more efficient eval cycles Senior Software Engineer Intel Corporation January 2003  –  December 2005  (3 years) DuPont, WA Team Lead - BIOS Eval Team \nTest planning, development, execution & reporting for Intel's Leading Itanium 2 & Xeon Enterprise-Class MP servers \nGreatly improved quality of BIOS Eval. Created 65 page BKMs doc: detailed instructions on Running test sets, Writing good bug reports, proper level of detail, Verifying bugs, Writing Good Test Procedures, Running tests on systems w/ different HW revisions. Trained 16 people \n \nIndia \n• 6 weeks in India Jump-starting new BIOS Eval team \n• Taught various specs, role-modeled Intel values & led their first test run \n \n2 Itanium & 3 Xeon Servers (2 Blade Servers) \n185 BIOS Eval Test Runs on 10 versions of procs \n• Working independently in highly competent & reliable manner, consistently met aggressive schedule pull-ins with on-time delivery \n• Effectively led cross-site team w/ 2x a week Coordination meeting w/ India & Oregon BIOS Eval teams \n• Reported status to stakeholders & Balanced priorities while leading 3-4 projects \n• Coordinated w/ tools team in India on testware creation & modification \n• Dell Lab Tour: Represented Intel BIOS Eval & led Dell Management tour and inspection\t• Validation Prog Manager said “Ian is one of the shining stars of the Tiger program!” \n• Completed Test Plan & Test Sets w/ >1300 manual & thousands of automated tests \n• Provided IBM & Dell (VIP customers) w/ quality products \n \nIBM \n• Excellent job of creating & presenting to IBM management presentation on BIOS Eval at Intel \n• Created & Presented Lab Demo: Error Injection, PERR/SERR testing, Predictive Failure Altering, Event Logging, POST Error Testing, Management Module \n• IBM Feedback: “Ian's presentation was informative, enthusiastic and surprisingly entertaining” \n• Impressed IBM reps w/ Depth & Breadth of Intel’s BIOS Eval \n \nProcess Improvements \n• Analyzed all BIOS bugs & implemented improvements. Moved tests w/ higher failure rates to run earlier in eval cycles \n• Made significant improvements to test sets for faster, more efficient eval cycles Senior Software Engineer Intel Corporation October 2001  –  December 2002  (1 year 3 months) DuPont, WA BIOS Validation Engineer / Software Engineer \nBIOS Eval of Itanium & Xeon-based Enterprise-Class Multiprocessor Servers \n \nLed BIOS Eval on Intel's most important Itanium Servers: the Enterprise-class MP Tiger-4 & Tiger-2 Servers \nTiger-4 with Itanium® 2 & Madison procs BIOS Validation Test Runs– Working independently in a highly competent & reliable manner, I consistently led a group of test engineers to met the BIOS Validation Test Run deadlines in a very aggressive schedule.  \n \nIA-64 Test Sets & Procedures— Throughout the year I made improvements to the T4/T2 Test Sets & Procedures – which resulted in significantly better test coverage, greater confidence in the functionality & improved quality of all our tests on Itanium-based platforms. \n \nRecognized expert in MCA (Machine Check Architecture) \n• Created Intel's first MCA Test Plan & Test Sets \n• MCA Task Force: Active member throughout the year. My BIOS Eval MCA Test Plan & Test Sets being the first created were used by other groups as the basis for creating their test plans. \n• Role-modeled the Intel value \"Pay Attention to Detail\" in the creation of the four MCA Test Sets w/ detailed steps for Error Injection Procedures, Verification Procedures & Expected Results. \n• Role-modeled Intel value “Excel at Customer Satisfaction” by always making Customer Satisfaction my #1 priority. Whenever presented with a customer error or issue , I immediately dedicated all available resources to finding a solution. Additionally, I always approach my job with an eye to improving the experience of our customers – both OEMs & end-users. Value to Intel is a good customer experience, a boost to our vendor of choice rating & increased sales. Senior Software Engineer Intel Corporation October 2001  –  December 2002  (1 year 3 months) DuPont, WA BIOS Validation Engineer / Software Engineer \nBIOS Eval of Itanium & Xeon-based Enterprise-Class Multiprocessor Servers \n \nLed BIOS Eval on Intel's most important Itanium Servers: the Enterprise-class MP Tiger-4 & Tiger-2 Servers \nTiger-4 with Itanium® 2 & Madison procs BIOS Validation Test Runs– Working independently in a highly competent & reliable manner, I consistently led a group of test engineers to met the BIOS Validation Test Run deadlines in a very aggressive schedule.  \n \nIA-64 Test Sets & Procedures— Throughout the year I made improvements to the T4/T2 Test Sets & Procedures – which resulted in significantly better test coverage, greater confidence in the functionality & improved quality of all our tests on Itanium-based platforms. \n \nRecognized expert in MCA (Machine Check Architecture) \n• Created Intel's first MCA Test Plan & Test Sets \n• MCA Task Force: Active member throughout the year. My BIOS Eval MCA Test Plan & Test Sets being the first created were used by other groups as the basis for creating their test plans. \n• Role-modeled the Intel value \"Pay Attention to Detail\" in the creation of the four MCA Test Sets w/ detailed steps for Error Injection Procedures, Verification Procedures & Expected Results. \n• Role-modeled Intel value “Excel at Customer Satisfaction” by always making Customer Satisfaction my #1 priority. Whenever presented with a customer error or issue , I immediately dedicated all available resources to finding a solution. Additionally, I always approach my job with an eye to improving the experience of our customers – both OEMs & end-users. Value to Intel is a good customer experience, a boost to our vendor of choice rating & increased sales. Senior Software Engineer Intel Corporation February 2000  –  October 2001  (1 year 9 months) Riverton, UT Developer of Remote Management SW for “eMail Station” & “NetStructure” Servers \n Coded in C, C++, JavaScript, HTML, Perl, and PHP: \n Discovered, Fixed & Verified fixes for 1000 errors in 1st generation eMail Station UI pages \n Volunteered for and Performed a detailed Code Review of over 30,000 lines of C and C++ \n Created & Modified UI pages for 2nd gen. eMail Station & the “Storefront Appliance“ Senior Software Engineer Intel Corporation February 2000  –  October 2001  (1 year 9 months) Riverton, UT Developer of Remote Management SW for “eMail Station” & “NetStructure” Servers \n Coded in C, C++, JavaScript, HTML, Perl, and PHP: \n Discovered, Fixed & Verified fixes for 1000 errors in 1st generation eMail Station UI pages \n Volunteered for and Performed a detailed Code Review of over 30,000 lines of C and C++ \n Created & Modified UI pages for 2nd gen. eMail Station & the “Storefront Appliance“ Software Engineer Novell October 1995  –  February 2000  (4 years 5 months) Provo, Utah - Rated in the Highest Category on Employee Performance Reviews 2½ of my final 3 years \n- Rated One of Novell's Top Validation Engineers - Set Record for most bugs found & reported in one year during my 1st year - Broke that record two years later \n- Highly Praised by developers and managers for writing excellent, detailed bug reports including description of the bug, background info, setup & minimum steps to reproduce it \n- Architected & Wrote (C) an Automated Testing Engine for login/logout tests of NetWare clients \n- Program operates as a service under Windows NT & Windows 98 and 95 where it imitates interactive users by passing keystrokes to any window—even Windows NT Secure Desktop \n- Created new scripting language “I” for writing the tests—including support for header files, libraries, subroutines, loops, local & global variables, math & logic operations, etc. \n- Managed team of 5 engineers to deliver ahead of schedule—even finishing “stretch goals” \n- Developer of the NW Client GUI Login code – Maintained code, fixed bugs & added new features \n- Wrote & Executed Test Plans and logged detailed bug reports for four major products Software Engineer Novell October 1995  –  February 2000  (4 years 5 months) Provo, Utah - Rated in the Highest Category on Employee Performance Reviews 2½ of my final 3 years \n- Rated One of Novell's Top Validation Engineers - Set Record for most bugs found & reported in one year during my 1st year - Broke that record two years later \n- Highly Praised by developers and managers for writing excellent, detailed bug reports including description of the bug, background info, setup & minimum steps to reproduce it \n- Architected & Wrote (C) an Automated Testing Engine for login/logout tests of NetWare clients \n- Program operates as a service under Windows NT & Windows 98 and 95 where it imitates interactive users by passing keystrokes to any window—even Windows NT Secure Desktop \n- Created new scripting language “I” for writing the tests—including support for header files, libraries, subroutines, loops, local & global variables, math & logic operations, etc. \n- Managed team of 5 engineers to deliver ahead of schedule—even finishing “stretch goals” \n- Developer of the NW Client GUI Login code – Maintained code, fixed bugs & added new features \n- Wrote & Executed Test Plans and logged detailed bug reports for four major products Software Engineer Center for Atmospheric & Space Science September 1991  –  October 1995  (4 years 2 months) Logan, UT SW Engineer / Principal Research Technician \n Wrote, Maintained & Documented data analysis programs (Coding in C, Fortran, Basic and IDL) \n Created and coded 3D compression program to compress semi-noisy data with elliptical symmetry \n Managed the lab computers and the lab network (WinNT, Win3.11, Unix & DOS) \n- Selected and Installed hardware & software for lab computers (14 PCs, 1 DecStation) \n- Wrote Unix shell scripts to aid in administration of the DecStation \n Integrated data acquisition hardware and software with scientific instruments \n Initiated & Maintained computerized remote control system for instruments at a remote observatory Software Engineer Center for Atmospheric & Space Science September 1991  –  October 1995  (4 years 2 months) Logan, UT SW Engineer / Principal Research Technician \n Wrote, Maintained & Documented data analysis programs (Coding in C, Fortran, Basic and IDL) \n Created and coded 3D compression program to compress semi-noisy data with elliptical symmetry \n Managed the lab computers and the lab network (WinNT, Win3.11, Unix & DOS) \n- Selected and Installed hardware & software for lab computers (14 PCs, 1 DecStation) \n- Wrote Unix shell scripts to aid in administration of the DecStation \n Integrated data acquisition hardware and software with scientific instruments \n Initiated & Maintained computerized remote control system for instruments at a remote observatory Software Engineer Surface Physics Lab, Utah State University September 1990  –  September 1991  (1 year 1 month) Logan, UT Software Engineer/Research Technician, Logan, UT, 1990 - 1991 \n Modified data manipulation progs (Fortran & Forth)  Selected/Installed HW for lab computer system \n Developed SW to analyze experimental data for investigation of Pons and Fleischmann's Cold Fusion claims for the Utah State Energy Board Software Engineer Surface Physics Lab, Utah State University September 1990  –  September 1991  (1 year 1 month) Logan, UT Software Engineer/Research Technician, Logan, UT, 1990 - 1991 \n Modified data manipulation progs (Fortran & Forth)  Selected/Installed HW for lab computer system \n Developed SW to analyze experimental data for investigation of Pons and Fleischmann's Cold Fusion claims for the Utah State Energy Board Software Developer River Software July 1989  –  September 1990  (1 year 3 months) Reston. VA Designed a GUI Macintosh word processor specifically for writing movie scripts \nWrote all the code \nCreated and executed all required tests  \nDeveloped two Beta versions and the Release 1.0 version of the \"Script Processor\" \nWrote extensive documentation and help files Software Developer River Software July 1989  –  September 1990  (1 year 3 months) Reston. VA Designed a GUI Macintosh word processor specifically for writing movie scripts \nWrote all the code \nCreated and executed all required tests  \nDeveloped two Beta versions and the Release 1.0 version of the \"Script Processor\" \nWrote extensive documentation and help files Skills X86 Bios Firmware Perl Debugging Software Engineering Intel Device Drivers Computer Architecture Unix C Processors Testing System Architecture PCIe Skills  X86 Bios Firmware Perl Debugging Software Engineering Intel Device Drivers Computer Architecture Unix C Processors Testing System Architecture PCIe X86 Bios Firmware Perl Debugging Software Engineering Intel Device Drivers Computer Architecture Unix C Processors Testing System Architecture PCIe X86 Bios Firmware Perl Debugging Software Engineering Intel Device Drivers Computer Architecture Unix C Processors Testing System Architecture PCIe Education Utah State University Master's degree,  Physics , 4.00 out of 4.00 1999 Thesis:\tMesospheric (843nm) and Thermospheric (630nm) Results and Improvements to Data Reduction Techniques for the Fabry-Perot Interferometer at the Bear Lake Observatory \n \nGrade Point Average: 4.00 out of 4.00 Activities and Societies:   Computer Science courses: Digital Signal Processing ,  Unix ,  and C Utah State University Bachelor's degree,  Physics , 3.91 out of 4.00 1981  – 1987  Computer Science & EE courses: Fortran Programming, Digital Fundamentals, and Digital Circuits Activities and Societies:   Graduated Magna Cum Laude with a Grade Point Average: 3.91 out of 4.00\n Awarded “The Outstanding Physics Student” award—senior ,  junior & sophomore years\n Awarded the Freshman Chemistry award Utah State University Master's degree,  Physics , 4.00 out of 4.00 1999 Thesis:\tMesospheric (843nm) and Thermospheric (630nm) Results and Improvements to Data Reduction Techniques for the Fabry-Perot Interferometer at the Bear Lake Observatory \n \nGrade Point Average: 4.00 out of 4.00 Activities and Societies:   Computer Science courses: Digital Signal Processing ,  Unix ,  and C Utah State University Master's degree,  Physics , 4.00 out of 4.00 1999 Thesis:\tMesospheric (843nm) and Thermospheric (630nm) Results and Improvements to Data Reduction Techniques for the Fabry-Perot Interferometer at the Bear Lake Observatory \n \nGrade Point Average: 4.00 out of 4.00 Activities and Societies:   Computer Science courses: Digital Signal Processing ,  Unix ,  and C Utah State University Master's degree,  Physics , 4.00 out of 4.00 1999 Thesis:\tMesospheric (843nm) and Thermospheric (630nm) Results and Improvements to Data Reduction Techniques for the Fabry-Perot Interferometer at the Bear Lake Observatory \n \nGrade Point Average: 4.00 out of 4.00 Activities and Societies:   Computer Science courses: Digital Signal Processing ,  Unix ,  and C Utah State University Bachelor's degree,  Physics , 3.91 out of 4.00 1981  – 1987  Computer Science & EE courses: Fortran Programming, Digital Fundamentals, and Digital Circuits Activities and Societies:   Graduated Magna Cum Laude with a Grade Point Average: 3.91 out of 4.00\n Awarded “The Outstanding Physics Student” award—senior ,  junior & sophomore years\n Awarded the Freshman Chemistry award Utah State University Bachelor's degree,  Physics , 3.91 out of 4.00 1981  – 1987  Computer Science & EE courses: Fortran Programming, Digital Fundamentals, and Digital Circuits Activities and Societies:   Graduated Magna Cum Laude with a Grade Point Average: 3.91 out of 4.00\n Awarded “The Outstanding Physics Student” award—senior ,  junior & sophomore years\n Awarded the Freshman Chemistry award Utah State University Bachelor's degree,  Physics , 3.91 out of 4.00 1981  – 1987  Computer Science & EE courses: Fortran Programming, Digital Fundamentals, and Digital Circuits Activities and Societies:   Graduated Magna Cum Laude with a Grade Point Average: 3.91 out of 4.00\n Awarded “The Outstanding Physics Student” award—senior ,  junior & sophomore years\n Awarded the Freshman Chemistry award ", "Skills Embedded Software Linux Wireless Embedded Systems C++ C Software Engineering Debugging Software Development VxWorks Testing System Architecture TCP/IP Distributed Systems Multithreading Software Design Windows Driver... Object Oriented Design Python Agile Methodologies Perl Unix Firmware OOP Algorithms ClearCase See 11+     See less Skills  Embedded Software Linux Wireless Embedded Systems C++ C Software Engineering Debugging Software Development VxWorks Testing System Architecture TCP/IP Distributed Systems Multithreading Software Design Windows Driver... Object Oriented Design Python Agile Methodologies Perl Unix Firmware OOP Algorithms ClearCase See 11+     See less Embedded Software Linux Wireless Embedded Systems C++ C Software Engineering Debugging Software Development VxWorks Testing System Architecture TCP/IP Distributed Systems Multithreading Software Design Windows Driver... Object Oriented Design Python Agile Methodologies Perl Unix Firmware OOP Algorithms ClearCase See 11+     See less Embedded Software Linux Wireless Embedded Systems C++ C Software Engineering Debugging Software Development VxWorks Testing System Architecture TCP/IP Distributed Systems Multithreading Software Design Windows Driver... Object Oriented Design Python Agile Methodologies Perl Unix Firmware OOP Algorithms ClearCase See 11+     See less ", "Summary 15+ years diversified experience in all phases of software development life cycle, design and architecture.  \n \nArea of expertise: Compilers, simulators, performance analysis, co-design, programming models and configurable/retargetable tools for hardware prototyping, OS and applications porting. Summary 15+ years diversified experience in all phases of software development life cycle, design and architecture.  \n \nArea of expertise: Compilers, simulators, performance analysis, co-design, programming models and configurable/retargetable tools for hardware prototyping, OS and applications porting. 15+ years diversified experience in all phases of software development life cycle, design and architecture.  \n \nArea of expertise: Compilers, simulators, performance analysis, co-design, programming models and configurable/retargetable tools for hardware prototyping, OS and applications porting. 15+ years diversified experience in all phases of software development life cycle, design and architecture.  \n \nArea of expertise: Compilers, simulators, performance analysis, co-design, programming models and configurable/retargetable tools for hardware prototyping, OS and applications porting. Experience Senior Software Engineer Intel Corporation, Intel Labs November 2013  – Present (1 year 10 months) Saint Petersburg, Russian Federation Responsibilities: \n\tCode-size optimization in Intel C++ Compiler. \n \nProjects: \n\tInvestigation and implementation of code-size-related optimization opportunities in the official Intel C++ Compiler. Some of my optimizations are included in ICC release 15.0. Senior Software Engineer Intel Corporation, Intel Labs October 2008  –  October 2013  (5 years 1 month) Saint Petersburg, Russian Federation Responsibilities: \n\tDesign and development of the configurable architecture-driven solution for prototyping and programming of extendable ASIP’s. \n \nProjects: \n \n\tNanocore – X86-based micro-controller with extendable ISA. \no\tParticipated in development of ADL – Architecture Description Language meant to encompass structural and semantic properties of the target architecture and produce configuration for every programming and prototyping tool targeting this architecture. \no\tParticipated in multi-back-end ADL compiler (back-end for the C compiler configuration). \no\tRetargeted GCC-LLVM compiler to the Nanocore’s description generated from ADL . \no\tParticipated in porting of VxWorks RTOS to Nanocore. \n \n\tNanoscaleEx – extention of Nanocore project meant to cover wide range of extendable CISC micro-controllers and ASIP’s with a single ADL-driven toolchain. This solution included multi-level simulation, C/C++ compilation, debugging, profiling and profile-driven optimization, RTL generation – all driven by a single architecture description. \no\tHeavily redesigned Clang-LLVM compiler to provide much higher build-time configurability and better usage of architecture description for code optimization. \no\tImplemented ADL back-end for compiler’s configuration. \no\tParticipated in ADL-driven simulator (cycle-accurate, instruction-set and native simulation levels, debugging features). \no\tParticipated in ADL-driven LLVM-based assembler. \no\tPorted and optimized C Library (newlib), C++ library (libcxx) and runtime library (compiler-rt). Implemented system-level runtime interface in library and simulator. \no\tDesigned and maintained build system for the whole project. \no\tHandled communication with internal customers of this solution. Senior Software Engineer Intel Corporation, Intel Labs March 2005  –  September 2008  (3 years 7 months) Saint Petersburg, Russian Federation Responsibilities: \n\tDesign and development of programming tools for embedded DSP-oriented SoC’s (communications, image and speech recognition) \n \nProjects: \n\tData-streaming Programming Language (DPL) – design and compiler of the functional language targeting communication applications and configurable data-streaming embedded architecture. \n\tScalable Communication Core – first Intel multi-radio prototype. Design of the programming model and implementation of the programming technology for application-specific many-core DSP-oriented SoC as whole as well as its sub-cores. This technology has been also applied to image- and speech-recognition prototyping. \no\tCode-generation from DPL to the configurable data-streaming processing element (mapping of the datapath and scheduling of data-streams). \no\tCode-generation for (de)interleaving processing element. \no\tParticipated in code-generation for StackCore – stack based micro-controller. \no\tParticipated in SystemC-based simulation environment. \no\tDevelopment of binary and supplementary programming tools (linkers, debuggers, profilers, etc) \n \n\tMapping and code-generation for the abstract data-streaming machine represented as set of nested graphs for research purposes (implemented in Java). Software Engineer Intel Corporation, Corporate Technology Group, Communication Technology Lab November 2003  –  February 2005  (1 year 4 months) Nizhny Novgorod Region, Russian Federation Responsibilities: \n\tDesign and development of programming tools for embedded hardware and SoC’s \n \nProjects: \n\tReconfigurable Communication Architecture prototype programming technology \n\tESL Simulator of MSA processor \n\tIntegrated Development Environment for heterogeneous data-streaming hardware prototype  \n\tTrace manager - server-client application for storing, viewing and managing large amount of simulation logs. Software Engineer Astrosoft-Development November 2000  –  August 2003  (2 years 10 months) Saint Petersburg, Russian Federation Responsibilities: \n\tCompiler/simulator development \n\tOptimization algorithms development \n\tSoftware performance optimization \n \nProjects: \n\tConfigurable C/C++ compiler for embedded platforms (Cjip microprocessor as usage case). I’ve been involved into both front-end and back-end development, including development of parser, support of templates, high-level and target-specific optimizations. \n\tParser generator based on YACC with support for ambiguous grammars, complex error processing and visual debugging in term of grammar. \n\tOptimization of compiler’s performance \n\tWeb-based (implemented in C#) interpreter and JIT for the proprietary formula-calculation script language. \n\tPorting and 15x performance optimization of SEGA emulator onto TV set top box based on Sparc. Software Developer St.Petersburg State Medical University September 1994  –  October 2000  (6 years 2 months) Saint Petersburg, Russian Federation Responsibilities: \n\tDevelopment and support of HR databases and client applications. (MS SQL Server, FoxPro) \n Senior Software Engineer Intel Corporation, Intel Labs November 2013  – Present (1 year 10 months) Saint Petersburg, Russian Federation Responsibilities: \n\tCode-size optimization in Intel C++ Compiler. \n \nProjects: \n\tInvestigation and implementation of code-size-related optimization opportunities in the official Intel C++ Compiler. Some of my optimizations are included in ICC release 15.0. Senior Software Engineer Intel Corporation, Intel Labs November 2013  – Present (1 year 10 months) Saint Petersburg, Russian Federation Responsibilities: \n\tCode-size optimization in Intel C++ Compiler. \n \nProjects: \n\tInvestigation and implementation of code-size-related optimization opportunities in the official Intel C++ Compiler. Some of my optimizations are included in ICC release 15.0. Senior Software Engineer Intel Corporation, Intel Labs October 2008  –  October 2013  (5 years 1 month) Saint Petersburg, Russian Federation Responsibilities: \n\tDesign and development of the configurable architecture-driven solution for prototyping and programming of extendable ASIP’s. \n \nProjects: \n \n\tNanocore – X86-based micro-controller with extendable ISA. \no\tParticipated in development of ADL – Architecture Description Language meant to encompass structural and semantic properties of the target architecture and produce configuration for every programming and prototyping tool targeting this architecture. \no\tParticipated in multi-back-end ADL compiler (back-end for the C compiler configuration). \no\tRetargeted GCC-LLVM compiler to the Nanocore’s description generated from ADL . \no\tParticipated in porting of VxWorks RTOS to Nanocore. \n \n\tNanoscaleEx – extention of Nanocore project meant to cover wide range of extendable CISC micro-controllers and ASIP’s with a single ADL-driven toolchain. This solution included multi-level simulation, C/C++ compilation, debugging, profiling and profile-driven optimization, RTL generation – all driven by a single architecture description. \no\tHeavily redesigned Clang-LLVM compiler to provide much higher build-time configurability and better usage of architecture description for code optimization. \no\tImplemented ADL back-end for compiler’s configuration. \no\tParticipated in ADL-driven simulator (cycle-accurate, instruction-set and native simulation levels, debugging features). \no\tParticipated in ADL-driven LLVM-based assembler. \no\tPorted and optimized C Library (newlib), C++ library (libcxx) and runtime library (compiler-rt). Implemented system-level runtime interface in library and simulator. \no\tDesigned and maintained build system for the whole project. \no\tHandled communication with internal customers of this solution. Senior Software Engineer Intel Corporation, Intel Labs October 2008  –  October 2013  (5 years 1 month) Saint Petersburg, Russian Federation Responsibilities: \n\tDesign and development of the configurable architecture-driven solution for prototyping and programming of extendable ASIP’s. \n \nProjects: \n \n\tNanocore – X86-based micro-controller with extendable ISA. \no\tParticipated in development of ADL – Architecture Description Language meant to encompass structural and semantic properties of the target architecture and produce configuration for every programming and prototyping tool targeting this architecture. \no\tParticipated in multi-back-end ADL compiler (back-end for the C compiler configuration). \no\tRetargeted GCC-LLVM compiler to the Nanocore’s description generated from ADL . \no\tParticipated in porting of VxWorks RTOS to Nanocore. \n \n\tNanoscaleEx – extention of Nanocore project meant to cover wide range of extendable CISC micro-controllers and ASIP’s with a single ADL-driven toolchain. This solution included multi-level simulation, C/C++ compilation, debugging, profiling and profile-driven optimization, RTL generation – all driven by a single architecture description. \no\tHeavily redesigned Clang-LLVM compiler to provide much higher build-time configurability and better usage of architecture description for code optimization. \no\tImplemented ADL back-end for compiler’s configuration. \no\tParticipated in ADL-driven simulator (cycle-accurate, instruction-set and native simulation levels, debugging features). \no\tParticipated in ADL-driven LLVM-based assembler. \no\tPorted and optimized C Library (newlib), C++ library (libcxx) and runtime library (compiler-rt). Implemented system-level runtime interface in library and simulator. \no\tDesigned and maintained build system for the whole project. \no\tHandled communication with internal customers of this solution. Senior Software Engineer Intel Corporation, Intel Labs March 2005  –  September 2008  (3 years 7 months) Saint Petersburg, Russian Federation Responsibilities: \n\tDesign and development of programming tools for embedded DSP-oriented SoC’s (communications, image and speech recognition) \n \nProjects: \n\tData-streaming Programming Language (DPL) – design and compiler of the functional language targeting communication applications and configurable data-streaming embedded architecture. \n\tScalable Communication Core – first Intel multi-radio prototype. Design of the programming model and implementation of the programming technology for application-specific many-core DSP-oriented SoC as whole as well as its sub-cores. This technology has been also applied to image- and speech-recognition prototyping. \no\tCode-generation from DPL to the configurable data-streaming processing element (mapping of the datapath and scheduling of data-streams). \no\tCode-generation for (de)interleaving processing element. \no\tParticipated in code-generation for StackCore – stack based micro-controller. \no\tParticipated in SystemC-based simulation environment. \no\tDevelopment of binary and supplementary programming tools (linkers, debuggers, profilers, etc) \n \n\tMapping and code-generation for the abstract data-streaming machine represented as set of nested graphs for research purposes (implemented in Java). Senior Software Engineer Intel Corporation, Intel Labs March 2005  –  September 2008  (3 years 7 months) Saint Petersburg, Russian Federation Responsibilities: \n\tDesign and development of programming tools for embedded DSP-oriented SoC’s (communications, image and speech recognition) \n \nProjects: \n\tData-streaming Programming Language (DPL) – design and compiler of the functional language targeting communication applications and configurable data-streaming embedded architecture. \n\tScalable Communication Core – first Intel multi-radio prototype. Design of the programming model and implementation of the programming technology for application-specific many-core DSP-oriented SoC as whole as well as its sub-cores. This technology has been also applied to image- and speech-recognition prototyping. \no\tCode-generation from DPL to the configurable data-streaming processing element (mapping of the datapath and scheduling of data-streams). \no\tCode-generation for (de)interleaving processing element. \no\tParticipated in code-generation for StackCore – stack based micro-controller. \no\tParticipated in SystemC-based simulation environment. \no\tDevelopment of binary and supplementary programming tools (linkers, debuggers, profilers, etc) \n \n\tMapping and code-generation for the abstract data-streaming machine represented as set of nested graphs for research purposes (implemented in Java). Software Engineer Intel Corporation, Corporate Technology Group, Communication Technology Lab November 2003  –  February 2005  (1 year 4 months) Nizhny Novgorod Region, Russian Federation Responsibilities: \n\tDesign and development of programming tools for embedded hardware and SoC’s \n \nProjects: \n\tReconfigurable Communication Architecture prototype programming technology \n\tESL Simulator of MSA processor \n\tIntegrated Development Environment for heterogeneous data-streaming hardware prototype  \n\tTrace manager - server-client application for storing, viewing and managing large amount of simulation logs. Software Engineer Intel Corporation, Corporate Technology Group, Communication Technology Lab November 2003  –  February 2005  (1 year 4 months) Nizhny Novgorod Region, Russian Federation Responsibilities: \n\tDesign and development of programming tools for embedded hardware and SoC’s \n \nProjects: \n\tReconfigurable Communication Architecture prototype programming technology \n\tESL Simulator of MSA processor \n\tIntegrated Development Environment for heterogeneous data-streaming hardware prototype  \n\tTrace manager - server-client application for storing, viewing and managing large amount of simulation logs. Software Engineer Astrosoft-Development November 2000  –  August 2003  (2 years 10 months) Saint Petersburg, Russian Federation Responsibilities: \n\tCompiler/simulator development \n\tOptimization algorithms development \n\tSoftware performance optimization \n \nProjects: \n\tConfigurable C/C++ compiler for embedded platforms (Cjip microprocessor as usage case). I’ve been involved into both front-end and back-end development, including development of parser, support of templates, high-level and target-specific optimizations. \n\tParser generator based on YACC with support for ambiguous grammars, complex error processing and visual debugging in term of grammar. \n\tOptimization of compiler’s performance \n\tWeb-based (implemented in C#) interpreter and JIT for the proprietary formula-calculation script language. \n\tPorting and 15x performance optimization of SEGA emulator onto TV set top box based on Sparc. Software Engineer Astrosoft-Development November 2000  –  August 2003  (2 years 10 months) Saint Petersburg, Russian Federation Responsibilities: \n\tCompiler/simulator development \n\tOptimization algorithms development \n\tSoftware performance optimization \n \nProjects: \n\tConfigurable C/C++ compiler for embedded platforms (Cjip microprocessor as usage case). I’ve been involved into both front-end and back-end development, including development of parser, support of templates, high-level and target-specific optimizations. \n\tParser generator based on YACC with support for ambiguous grammars, complex error processing and visual debugging in term of grammar. \n\tOptimization of compiler’s performance \n\tWeb-based (implemented in C#) interpreter and JIT for the proprietary formula-calculation script language. \n\tPorting and 15x performance optimization of SEGA emulator onto TV set top box based on Sparc. Software Developer St.Petersburg State Medical University September 1994  –  October 2000  (6 years 2 months) Saint Petersburg, Russian Federation Responsibilities: \n\tDevelopment and support of HR databases and client applications. (MS SQL Server, FoxPro) \n Software Developer St.Petersburg State Medical University September 1994  –  October 2000  (6 years 2 months) Saint Petersburg, Russian Federation Responsibilities: \n\tDevelopment and support of HR databases and client applications. (MS SQL Server, FoxPro) \n Languages English Full professional proficiency Japanese Elementary proficiency English Full professional proficiency Japanese Elementary proficiency English Full professional proficiency Japanese Elementary proficiency Full professional proficiency Elementary proficiency Skills Debugging Embedded Software Embedded Systems Device Drivers Shell Scripting Software Engineering VxWorks C++ Microcontrollers ClearCase Multithreading RTOS ARM Computer Architecture SoC Verilog Software Design Algorithms Perl Linux Kernel System Architecture Embedded Linux Firmware USB Embedded C Software Development VHDL Object Oriented Design Digital Signal... GNU Debugger Python TCL Distributed Systems ASIC C Linux FPGA Processors See 23+     See less Skills  Debugging Embedded Software Embedded Systems Device Drivers Shell Scripting Software Engineering VxWorks C++ Microcontrollers ClearCase Multithreading RTOS ARM Computer Architecture SoC Verilog Software Design Algorithms Perl Linux Kernel System Architecture Embedded Linux Firmware USB Embedded C Software Development VHDL Object Oriented Design Digital Signal... GNU Debugger Python TCL Distributed Systems ASIC C Linux FPGA Processors See 23+     See less Debugging Embedded Software Embedded Systems Device Drivers Shell Scripting Software Engineering VxWorks C++ Microcontrollers ClearCase Multithreading RTOS ARM Computer Architecture SoC Verilog Software Design Algorithms Perl Linux Kernel System Architecture Embedded Linux Firmware USB Embedded C Software Development VHDL Object Oriented Design Digital Signal... GNU Debugger Python TCL Distributed Systems ASIC C Linux FPGA Processors See 23+     See less Debugging Embedded Software Embedded Systems Device Drivers Shell Scripting Software Engineering VxWorks C++ Microcontrollers ClearCase Multithreading RTOS ARM Computer Architecture SoC Verilog Software Design Algorithms Perl Linux Kernel System Architecture Embedded Linux Firmware USB Embedded C Software Development VHDL Object Oriented Design Digital Signal... GNU Debugger Python TCL Distributed Systems ASIC C Linux FPGA Processors See 23+     See less Education Peter the Great St.Petersburg Polytechnic University Master's degree,  Applied Mathematics 1994  – 2000 Peter the Great St.Petersburg Polytechnic University Master's degree,  Applied Mathematics 1994  – 2000 Peter the Great St.Petersburg Polytechnic University Master's degree,  Applied Mathematics 1994  – 2000 Peter the Great St.Petersburg Polytechnic University Master's degree,  Applied Mathematics 1994  – 2000 ", "Summary I solve problems. Give me interesting problems to solve, and I'll give you solutions for them. Summary I solve problems. Give me interesting problems to solve, and I'll give you solutions for them. I solve problems. Give me interesting problems to solve, and I'll give you solutions for them. I solve problems. Give me interesting problems to solve, and I'll give you solutions for them. Experience Senior Software Engineer Intel Corporation July 2012  – Present (3 years 2 months) Cape Cod Campus Intel acquired Whamcloud in 2012. \n \nContinued to work on Intel Manager for Lustre (née Chroma) through the end of 2013. Defacto technical team lead while adding key product features (power control management, automatic HA configuration, HSM support, etc). \n \nCurrently working on Intel Cloud Edition for Lustre. Most recently, I've implemented a realtime console for cloud-based Lustre deployments using python, zeromq, node.js, socket.io, and angularjs. \n \nAlso working on other stuff primarily in Go. Really enjoying it for systems programming. Senior Software Engineer Whamcloud, Inc September 2010  –  July 2012  (1 year 11 months) Maine Office Added Lustre 2.x support to LLNL's Lustre Monitoring Tool (LMT). \nBuilt out multi-platform dynamic build/test infrastructure based on Cobbler. \nCurrently working as a Chroma (Whamcloud's Lustre management/monitoring solution) developer. Senior Software Engineer Oracle February 2010  –  September 2010  (8 months) Maine Office Migrated build/test infrastructure to private cloud based on Eucalyptus. Systems Software Engineer Sun Microsystems, Inc. October 2007  –  February 2010  (2 years 5 months) Maine Office Sun Linux HPC Software Stack \n* Build \n* Verification/Validation \n* Project Management \n- Support \n- Interns \n- External relationships Senior Systems Software Engineer Cluster File Systems, Inc. May 2005  –  October 2007  (2 years 6 months) Maine Office Team Lead, QA Infrastructure Development \nResponsible for technical direction and guidance for team members. Served as interface between team and upper management. \n \nLustre Support Engineer \nResponsible for direct interaction with partners and customers. Acted as a liaison between strategic customers and developers. Handled incident response, information gathering, and problem resolution or escalation to senior engineering when necessary. Participated in efforts to improve internal support procedures and infrastructure. Occasional projects involving QA infrastructure and testing, both internally and with key customers/partners. \n \nQA Engineer \nFocus on automated build, regression/performance testing, and cluster management. Handled porting the Lustre testing infrastructure from Linux to other platforms (OS X, Cray XD1/XT3, etc.). Senior Systems Administrator PA Online January 2003  –  April 2005  (2 years 4 months) Harrisburg, Pennsylvania Area * Responsible for departmental purchasing, personnel management, and project management \n* Primary planner and implementor for project to migrate company's IT infrastructure from legacy NT 4.0-based systems to Linux- and Win2k/2k3-based systems \n* Primary planner, implementor, and lead Perl programmer for project to automate dialup and webhosting customer resource provisioning \n* Managed technical aspects of migration from legacy CRM system to BillMax, as well as integration with backend provisioning systems \n* Responsible for day-to-day network and systems operations Senior Systems Administrator Ximian August 2000  –  January 2003  (2 years 6 months) Cambridge/Boston, MA * Responsible for departmental purchasing, personnel management, and project management \n* Contributed to design of and personally built hardware and network infrastructure for Ximian Red-Carpet services (software update services) \n* Implemented hardware-based VPN between office locations and co-located equipment in multiple locations \n* Implemented distributed identification and authentication system using OpenLDAP and MIT Kerberos 5; wrote custom user management tools in Perl \n* Maintained and extended functionality of corporate intranet using PHP, Perl, and PostgreSQL \n* Wrote modular email interface for the Bugzilla bug-tracking system in Perl \n* Wrote csv2vcard, a utility for converting MS Outlook contact information to standard VCard format; csv2vcard is distributed with Ximian Evolution, a popular PIM/Email client for Linux Senior Systems Administrator Focalex April 1999  –  August 2000  (1 year 5 months) Newton, MA * Installed and maintained Oracle 8 as the database used to handle millions of records containing subscription and demographic data for opt-in targeted email advertisement service \n* Co-developed and maintained mod_perl-based website with tens of thousands of daily impressions \n* Wrote Apache modules for database-backed clickthrough tracking \n* Installed and maintained Lyris mailing list software on multiple Solaris hosts Systems Administrator Pennsylvania Online August 1998  –  April 1999  (9 months) Harrisburg, Pennsylvania Area * Wrote utilities to facilitate the transition of 15K email accounts to new email system \n* Migrated RADIUS authentication and billing system from NT to Linux for stability and performance improvements \n* Installed and maintained USR Total Control modem banks \n* Maintained and optimized router configurations \n* Acted as primary point of contact with telecom companies on installation and troubleshooting issues Desktop Support Specialist Penn State Milton S. Hershey Medical Center July 1997  –  August 1998  (1 year 2 months) Hershey, PA * Developed methodology for support of lab workstations \n* Implemented solutions for workstation security and quick system configuration \n* Resolved support issues for Library staff and students Senior Software Engineer Intel Corporation July 2012  – Present (3 years 2 months) Cape Cod Campus Intel acquired Whamcloud in 2012. \n \nContinued to work on Intel Manager for Lustre (née Chroma) through the end of 2013. Defacto technical team lead while adding key product features (power control management, automatic HA configuration, HSM support, etc). \n \nCurrently working on Intel Cloud Edition for Lustre. Most recently, I've implemented a realtime console for cloud-based Lustre deployments using python, zeromq, node.js, socket.io, and angularjs. \n \nAlso working on other stuff primarily in Go. Really enjoying it for systems programming. Senior Software Engineer Intel Corporation July 2012  – Present (3 years 2 months) Cape Cod Campus Intel acquired Whamcloud in 2012. \n \nContinued to work on Intel Manager for Lustre (née Chroma) through the end of 2013. Defacto technical team lead while adding key product features (power control management, automatic HA configuration, HSM support, etc). \n \nCurrently working on Intel Cloud Edition for Lustre. Most recently, I've implemented a realtime console for cloud-based Lustre deployments using python, zeromq, node.js, socket.io, and angularjs. \n \nAlso working on other stuff primarily in Go. Really enjoying it for systems programming. Senior Software Engineer Whamcloud, Inc September 2010  –  July 2012  (1 year 11 months) Maine Office Added Lustre 2.x support to LLNL's Lustre Monitoring Tool (LMT). \nBuilt out multi-platform dynamic build/test infrastructure based on Cobbler. \nCurrently working as a Chroma (Whamcloud's Lustre management/monitoring solution) developer. Senior Software Engineer Whamcloud, Inc September 2010  –  July 2012  (1 year 11 months) Maine Office Added Lustre 2.x support to LLNL's Lustre Monitoring Tool (LMT). \nBuilt out multi-platform dynamic build/test infrastructure based on Cobbler. \nCurrently working as a Chroma (Whamcloud's Lustre management/monitoring solution) developer. Senior Software Engineer Oracle February 2010  –  September 2010  (8 months) Maine Office Migrated build/test infrastructure to private cloud based on Eucalyptus. Senior Software Engineer Oracle February 2010  –  September 2010  (8 months) Maine Office Migrated build/test infrastructure to private cloud based on Eucalyptus. Systems Software Engineer Sun Microsystems, Inc. October 2007  –  February 2010  (2 years 5 months) Maine Office Sun Linux HPC Software Stack \n* Build \n* Verification/Validation \n* Project Management \n- Support \n- Interns \n- External relationships Systems Software Engineer Sun Microsystems, Inc. October 2007  –  February 2010  (2 years 5 months) Maine Office Sun Linux HPC Software Stack \n* Build \n* Verification/Validation \n* Project Management \n- Support \n- Interns \n- External relationships Senior Systems Software Engineer Cluster File Systems, Inc. May 2005  –  October 2007  (2 years 6 months) Maine Office Team Lead, QA Infrastructure Development \nResponsible for technical direction and guidance for team members. Served as interface between team and upper management. \n \nLustre Support Engineer \nResponsible for direct interaction with partners and customers. Acted as a liaison between strategic customers and developers. Handled incident response, information gathering, and problem resolution or escalation to senior engineering when necessary. Participated in efforts to improve internal support procedures and infrastructure. Occasional projects involving QA infrastructure and testing, both internally and with key customers/partners. \n \nQA Engineer \nFocus on automated build, regression/performance testing, and cluster management. Handled porting the Lustre testing infrastructure from Linux to other platforms (OS X, Cray XD1/XT3, etc.). Senior Systems Software Engineer Cluster File Systems, Inc. May 2005  –  October 2007  (2 years 6 months) Maine Office Team Lead, QA Infrastructure Development \nResponsible for technical direction and guidance for team members. Served as interface between team and upper management. \n \nLustre Support Engineer \nResponsible for direct interaction with partners and customers. Acted as a liaison between strategic customers and developers. Handled incident response, information gathering, and problem resolution or escalation to senior engineering when necessary. Participated in efforts to improve internal support procedures and infrastructure. Occasional projects involving QA infrastructure and testing, both internally and with key customers/partners. \n \nQA Engineer \nFocus on automated build, regression/performance testing, and cluster management. Handled porting the Lustre testing infrastructure from Linux to other platforms (OS X, Cray XD1/XT3, etc.). Senior Systems Administrator PA Online January 2003  –  April 2005  (2 years 4 months) Harrisburg, Pennsylvania Area * Responsible for departmental purchasing, personnel management, and project management \n* Primary planner and implementor for project to migrate company's IT infrastructure from legacy NT 4.0-based systems to Linux- and Win2k/2k3-based systems \n* Primary planner, implementor, and lead Perl programmer for project to automate dialup and webhosting customer resource provisioning \n* Managed technical aspects of migration from legacy CRM system to BillMax, as well as integration with backend provisioning systems \n* Responsible for day-to-day network and systems operations Senior Systems Administrator PA Online January 2003  –  April 2005  (2 years 4 months) Harrisburg, Pennsylvania Area * Responsible for departmental purchasing, personnel management, and project management \n* Primary planner and implementor for project to migrate company's IT infrastructure from legacy NT 4.0-based systems to Linux- and Win2k/2k3-based systems \n* Primary planner, implementor, and lead Perl programmer for project to automate dialup and webhosting customer resource provisioning \n* Managed technical aspects of migration from legacy CRM system to BillMax, as well as integration with backend provisioning systems \n* Responsible for day-to-day network and systems operations Senior Systems Administrator Ximian August 2000  –  January 2003  (2 years 6 months) Cambridge/Boston, MA * Responsible for departmental purchasing, personnel management, and project management \n* Contributed to design of and personally built hardware and network infrastructure for Ximian Red-Carpet services (software update services) \n* Implemented hardware-based VPN between office locations and co-located equipment in multiple locations \n* Implemented distributed identification and authentication system using OpenLDAP and MIT Kerberos 5; wrote custom user management tools in Perl \n* Maintained and extended functionality of corporate intranet using PHP, Perl, and PostgreSQL \n* Wrote modular email interface for the Bugzilla bug-tracking system in Perl \n* Wrote csv2vcard, a utility for converting MS Outlook contact information to standard VCard format; csv2vcard is distributed with Ximian Evolution, a popular PIM/Email client for Linux Senior Systems Administrator Ximian August 2000  –  January 2003  (2 years 6 months) Cambridge/Boston, MA * Responsible for departmental purchasing, personnel management, and project management \n* Contributed to design of and personally built hardware and network infrastructure for Ximian Red-Carpet services (software update services) \n* Implemented hardware-based VPN between office locations and co-located equipment in multiple locations \n* Implemented distributed identification and authentication system using OpenLDAP and MIT Kerberos 5; wrote custom user management tools in Perl \n* Maintained and extended functionality of corporate intranet using PHP, Perl, and PostgreSQL \n* Wrote modular email interface for the Bugzilla bug-tracking system in Perl \n* Wrote csv2vcard, a utility for converting MS Outlook contact information to standard VCard format; csv2vcard is distributed with Ximian Evolution, a popular PIM/Email client for Linux Senior Systems Administrator Focalex April 1999  –  August 2000  (1 year 5 months) Newton, MA * Installed and maintained Oracle 8 as the database used to handle millions of records containing subscription and demographic data for opt-in targeted email advertisement service \n* Co-developed and maintained mod_perl-based website with tens of thousands of daily impressions \n* Wrote Apache modules for database-backed clickthrough tracking \n* Installed and maintained Lyris mailing list software on multiple Solaris hosts Senior Systems Administrator Focalex April 1999  –  August 2000  (1 year 5 months) Newton, MA * Installed and maintained Oracle 8 as the database used to handle millions of records containing subscription and demographic data for opt-in targeted email advertisement service \n* Co-developed and maintained mod_perl-based website with tens of thousands of daily impressions \n* Wrote Apache modules for database-backed clickthrough tracking \n* Installed and maintained Lyris mailing list software on multiple Solaris hosts Systems Administrator Pennsylvania Online August 1998  –  April 1999  (9 months) Harrisburg, Pennsylvania Area * Wrote utilities to facilitate the transition of 15K email accounts to new email system \n* Migrated RADIUS authentication and billing system from NT to Linux for stability and performance improvements \n* Installed and maintained USR Total Control modem banks \n* Maintained and optimized router configurations \n* Acted as primary point of contact with telecom companies on installation and troubleshooting issues Systems Administrator Pennsylvania Online August 1998  –  April 1999  (9 months) Harrisburg, Pennsylvania Area * Wrote utilities to facilitate the transition of 15K email accounts to new email system \n* Migrated RADIUS authentication and billing system from NT to Linux for stability and performance improvements \n* Installed and maintained USR Total Control modem banks \n* Maintained and optimized router configurations \n* Acted as primary point of contact with telecom companies on installation and troubleshooting issues Desktop Support Specialist Penn State Milton S. Hershey Medical Center July 1997  –  August 1998  (1 year 2 months) Hershey, PA * Developed methodology for support of lab workstations \n* Implemented solutions for workstation security and quick system configuration \n* Resolved support issues for Library staff and students Desktop Support Specialist Penn State Milton S. Hershey Medical Center July 1997  –  August 1998  (1 year 2 months) Hershey, PA * Developed methodology for support of lab workstations \n* Implemented solutions for workstation security and quick system configuration \n* Resolved support issues for Library staff and students Skills Linux High Performance... Shell Scripting Solaris Bash Distributed Systems Scalability Virtualization Apache Cluster Integration Lustre Python C System Administration SQL Storage File Systems System Architecture Open Source Operating Systems Agile Methodologies Clustering Agile PXE Chef Devops Go See 13+     See less Skills  Linux High Performance... Shell Scripting Solaris Bash Distributed Systems Scalability Virtualization Apache Cluster Integration Lustre Python C System Administration SQL Storage File Systems System Architecture Open Source Operating Systems Agile Methodologies Clustering Agile PXE Chef Devops Go See 13+     See less Linux High Performance... Shell Scripting Solaris Bash Distributed Systems Scalability Virtualization Apache Cluster Integration Lustre Python C System Administration SQL Storage File Systems System Architecture Open Source Operating Systems Agile Methodologies Clustering Agile PXE Chef Devops Go See 13+     See less Linux High Performance... Shell Scripting Solaris Bash Distributed Systems Scalability Virtualization Apache Cluster Integration Lustre Python C System Administration SQL Storage File Systems System Architecture Open Source Operating Systems Agile Methodologies Clustering Agile PXE Chef Devops Go See 13+     See less Education Shippensburg University of Pennsylvania Computer Science 1995  – 1998 Hershey High School 1991  – 1994 Shippensburg University of Pennsylvania Computer Science 1995  – 1998 Shippensburg University of Pennsylvania Computer Science 1995  – 1998 Shippensburg University of Pennsylvania Computer Science 1995  – 1998 Hershey High School 1991  – 1994 Hershey High School 1991  – 1994 Hershey High School 1991  – 1994 ", "Experience Senior Software Engineer Intel Corporation April 2011  – Present (4 years 5 months) Chandler, AZ Predictive Analytics for the Internet of Things Software Engineer at Intel Volt August 2010  –  August 2011  (1 year 1 month) Owner Engineering Job Future September 2009  –  August 2010  (1 year) Senior Software Engineer Consultant, Staff Dell, Incorporated October 2006  –  March 2009  (2 years 6 months) SW Eng'r (Sandia) L&M Technologies November 2004  –  September 2006  (1 year 11 months) Mentee STAR Group, LLC 2001  –  2005  (4 years) Partner Network Lynx January 2000  –  October 2004  (4 years 10 months) Owner Silver Lynx February 1999  –  October 2004  (5 years 9 months) Sr. Embedded Systems Engineer Safe Zone Systems October 1998  –  March 1999  (6 months) Sr. FW Engineer SafeZone Systems 1998  –  1999  (1 year) Integrator / Sr. Firmware Engineer Soligen, Inc. April 1993  –  October 1998  (5 years 7 months) Senior Software Engineer Intel Corporation April 2011  – Present (4 years 5 months) Chandler, AZ Predictive Analytics for the Internet of Things Senior Software Engineer Intel Corporation April 2011  – Present (4 years 5 months) Chandler, AZ Predictive Analytics for the Internet of Things Software Engineer at Intel Volt August 2010  –  August 2011  (1 year 1 month) Software Engineer at Intel Volt August 2010  –  August 2011  (1 year 1 month) Owner Engineering Job Future September 2009  –  August 2010  (1 year) Owner Engineering Job Future September 2009  –  August 2010  (1 year) Senior Software Engineer Consultant, Staff Dell, Incorporated October 2006  –  March 2009  (2 years 6 months) Senior Software Engineer Consultant, Staff Dell, Incorporated October 2006  –  March 2009  (2 years 6 months) SW Eng'r (Sandia) L&M Technologies November 2004  –  September 2006  (1 year 11 months) SW Eng'r (Sandia) L&M Technologies November 2004  –  September 2006  (1 year 11 months) Mentee STAR Group, LLC 2001  –  2005  (4 years) Mentee STAR Group, LLC 2001  –  2005  (4 years) Partner Network Lynx January 2000  –  October 2004  (4 years 10 months) Partner Network Lynx January 2000  –  October 2004  (4 years 10 months) Owner Silver Lynx February 1999  –  October 2004  (5 years 9 months) Owner Silver Lynx February 1999  –  October 2004  (5 years 9 months) Sr. Embedded Systems Engineer Safe Zone Systems October 1998  –  March 1999  (6 months) Sr. Embedded Systems Engineer Safe Zone Systems October 1998  –  March 1999  (6 months) Sr. FW Engineer SafeZone Systems 1998  –  1999  (1 year) Sr. FW Engineer SafeZone Systems 1998  –  1999  (1 year) Integrator / Sr. Firmware Engineer Soligen, Inc. April 1993  –  October 1998  (5 years 7 months) Integrator / Sr. Firmware Engineer Soligen, Inc. April 1993  –  October 1998  (5 years 7 months) Skills creativity programming writing Ruby FreeBSD MySQL C Apache PHP TCP/IP Product Development Linux XML C++ Programming Java Writing Embedded Systems Web Development Perl Software Development Debugging Integration Ruby on Rails System Architecture Cloud Computing Entrepreneurship SQL Distributed Systems Software Engineering Shell Scripting Software Design Object Oriented Design Networking Git Unix Agile Methodologies Embedded Software Subversion Scrum Systems Engineering Open Source Web Services Mobile Applications Web Applications Agile Project Management Testing REST Semiconductors Architectures See 35+     See less Skills  creativity programming writing Ruby FreeBSD MySQL C Apache PHP TCP/IP Product Development Linux XML C++ Programming Java Writing Embedded Systems Web Development Perl Software Development Debugging Integration Ruby on Rails System Architecture Cloud Computing Entrepreneurship SQL Distributed Systems Software Engineering Shell Scripting Software Design Object Oriented Design Networking Git Unix Agile Methodologies Embedded Software Subversion Scrum Systems Engineering Open Source Web Services Mobile Applications Web Applications Agile Project Management Testing REST Semiconductors Architectures See 35+     See less creativity programming writing Ruby FreeBSD MySQL C Apache PHP TCP/IP Product Development Linux XML C++ Programming Java Writing Embedded Systems Web Development Perl Software Development Debugging Integration Ruby on Rails System Architecture Cloud Computing Entrepreneurship SQL Distributed Systems Software Engineering Shell Scripting Software Design Object Oriented Design Networking Git Unix Agile Methodologies Embedded Software Subversion Scrum Systems Engineering Open Source Web Services Mobile Applications Web Applications Agile Project Management Testing REST Semiconductors Architectures See 35+     See less creativity programming writing Ruby FreeBSD MySQL C Apache PHP TCP/IP Product Development Linux XML C++ Programming Java Writing Embedded Systems Web Development Perl Software Development Debugging Integration Ruby on Rails System Architecture Cloud Computing Entrepreneurship SQL Distributed Systems Software Engineering Shell Scripting Software Design Object Oriented Design Networking Git Unix Agile Methodologies Embedded Software Subversion Scrum Systems Engineering Open Source Web Services Mobile Applications Web Applications Agile Project Management Testing REST Semiconductors Architectures See 35+     See less Honors & Awards ", "Summary Specialties:Networking, Linux, Kernel Programming, Performance Engineering, Drivers Development, C, SQL databases Summary Specialties:Networking, Linux, Kernel Programming, Performance Engineering, Drivers Development, C, SQL databases Specialties:Networking, Linux, Kernel Programming, Performance Engineering, Drivers Development, C, SQL databases Specialties:Networking, Linux, Kernel Programming, Performance Engineering, Drivers Development, C, SQL databases Experience Senior Software Engineer Intel Corporation December 2013  – Present (1 year 9 months) Hillsboro, Oregon Software Defined Networks, Network Function Virtualization, Prototyping, OPNFV Senior Software Engineer Intel Corporation September 2011  –  December 2013  (2 years 4 months) Hillsboro, Oregon Upcoming network interfaces driver development, network stack evaluation, Software Defined Networks and Overlay Networks. Senior Software Engineer Intel Corporation April 2008  –  September 2011  (3 years 6 months) Networking, Linux, Kernel Programming Senior Software Engineer Telrock Plc November 2006  –  November 2007  (1 year 1 month) 50% System Administration - 50% J2EE development role. Software Engineer Cognito April 2006  –  November 2006  (8 months) Core network development, reporting tool Software Devloper The Cloud Ltd October 2004  –  March 2006  (1 year 6 months) Author of the in-house RADIUS server, Intranet and Extranet development Systems Developer Claranet Ltd July 2001  –  September 2004  (3 years 3 months) Systems development, maintainer of in-house RADIUS server, billing backend systems, reporting tool R&D Software Engineer Alstom Power November 2000  –  July 2001  (9 months) Embedded development Senior Software Engineer Intel Corporation December 2013  – Present (1 year 9 months) Hillsboro, Oregon Software Defined Networks, Network Function Virtualization, Prototyping, OPNFV Senior Software Engineer Intel Corporation December 2013  – Present (1 year 9 months) Hillsboro, Oregon Software Defined Networks, Network Function Virtualization, Prototyping, OPNFV Senior Software Engineer Intel Corporation September 2011  –  December 2013  (2 years 4 months) Hillsboro, Oregon Upcoming network interfaces driver development, network stack evaluation, Software Defined Networks and Overlay Networks. Senior Software Engineer Intel Corporation September 2011  –  December 2013  (2 years 4 months) Hillsboro, Oregon Upcoming network interfaces driver development, network stack evaluation, Software Defined Networks and Overlay Networks. Senior Software Engineer Intel Corporation April 2008  –  September 2011  (3 years 6 months) Networking, Linux, Kernel Programming Senior Software Engineer Intel Corporation April 2008  –  September 2011  (3 years 6 months) Networking, Linux, Kernel Programming Senior Software Engineer Telrock Plc November 2006  –  November 2007  (1 year 1 month) 50% System Administration - 50% J2EE development role. Senior Software Engineer Telrock Plc November 2006  –  November 2007  (1 year 1 month) 50% System Administration - 50% J2EE development role. Software Engineer Cognito April 2006  –  November 2006  (8 months) Core network development, reporting tool Software Engineer Cognito April 2006  –  November 2006  (8 months) Core network development, reporting tool Software Devloper The Cloud Ltd October 2004  –  March 2006  (1 year 6 months) Author of the in-house RADIUS server, Intranet and Extranet development Software Devloper The Cloud Ltd October 2004  –  March 2006  (1 year 6 months) Author of the in-house RADIUS server, Intranet and Extranet development Systems Developer Claranet Ltd July 2001  –  September 2004  (3 years 3 months) Systems development, maintainer of in-house RADIUS server, billing backend systems, reporting tool Systems Developer Claranet Ltd July 2001  –  September 2004  (3 years 3 months) Systems development, maintainer of in-house RADIUS server, billing backend systems, reporting tool R&D Software Engineer Alstom Power November 2000  –  July 2001  (9 months) Embedded development R&D Software Engineer Alstom Power November 2000  –  July 2001  (9 months) Embedded development Languages Greek Native or bilingual proficiency English Full professional proficiency French Limited working proficiency Greek Native or bilingual proficiency English Full professional proficiency French Limited working proficiency Greek Native or bilingual proficiency English Full professional proficiency French Limited working proficiency Native or bilingual proficiency Full professional proficiency Limited working proficiency Skills C Linux Kernel Programming Networking Performance Engineering Linux Kernel Perl Device Drivers Software Engineering Embedded Systems Software Development TCP/IP C++ Agile Methodologies ClearCase Shell Scripting Embedded Software Debugging Computer Architecture Unix See 5+     See less Skills  C Linux Kernel Programming Networking Performance Engineering Linux Kernel Perl Device Drivers Software Engineering Embedded Systems Software Development TCP/IP C++ Agile Methodologies ClearCase Shell Scripting Embedded Software Debugging Computer Architecture Unix See 5+     See less C Linux Kernel Programming Networking Performance Engineering Linux Kernel Perl Device Drivers Software Engineering Embedded Systems Software Development TCP/IP C++ Agile Methodologies ClearCase Shell Scripting Embedded Software Debugging Computer Architecture Unix See 5+     See less C Linux Kernel Programming Networking Performance Engineering Linux Kernel Perl Device Drivers Software Engineering Embedded Systems Software Development TCP/IP C++ Agile Methodologies ClearCase Shell Scripting Embedded Software Debugging Computer Architecture Unix See 5+     See less Education Staffordshire University MSc,  Electronic Engineering 1999  – 2001 Staffordshire University BEng Hons,  Communications and Signal Processing 1996  – 1999 Staffordshire University MSc,  Electronic Engineering 1999  – 2001 Staffordshire University MSc,  Electronic Engineering 1999  – 2001 Staffordshire University MSc,  Electronic Engineering 1999  – 2001 Staffordshire University BEng Hons,  Communications and Signal Processing 1996  – 1999 Staffordshire University BEng Hons,  Communications and Signal Processing 1996  – 1999 Staffordshire University BEng Hons,  Communications and Signal Processing 1996  – 1999 ", "Experience Senior Software Engineer Intel Corporation January 2012  – Present (3 years 8 months) Phoenix, Arizona Area Senior Software Engineer Intel Corporation October 2005  –  January 2011  (5 years 4 months) Phoenix, Arizona Area Software Engineer Hewlett Packard May 2001  –  October 2005  (4 years 6 months) Boise, Idaho Senior Software Engineer Intel Corporation January 2012  – Present (3 years 8 months) Phoenix, Arizona Area Senior Software Engineer Intel Corporation January 2012  – Present (3 years 8 months) Phoenix, Arizona Area Senior Software Engineer Intel Corporation October 2005  –  January 2011  (5 years 4 months) Phoenix, Arizona Area Senior Software Engineer Intel Corporation October 2005  –  January 2011  (5 years 4 months) Phoenix, Arizona Area Software Engineer Hewlett Packard May 2001  –  October 2005  (4 years 6 months) Boise, Idaho Software Engineer Hewlett Packard May 2001  –  October 2005  (4 years 6 months) Boise, Idaho Skills Software Development C++ ASP.NET Testing Software Engineering HTML 5 Software Project... Agile Methodologies Java Object Oriented Design C Semiconductors Linux Debugging Entrepreneurship C# Embedded Systems SECS/GEM CMMI JavaScript CSS Project Management MySQL Apache 2 Glassfish J2EE Application... NetBeans Object Oriented Software log4j Technical Leadership Web Services Software Design Architecture SOAP .NET Unix SQL Algorithms Cross-functional Team... Programming See 25+     See less Skills  Software Development C++ ASP.NET Testing Software Engineering HTML 5 Software Project... Agile Methodologies Java Object Oriented Design C Semiconductors Linux Debugging Entrepreneurship C# Embedded Systems SECS/GEM CMMI JavaScript CSS Project Management MySQL Apache 2 Glassfish J2EE Application... NetBeans Object Oriented Software log4j Technical Leadership Web Services Software Design Architecture SOAP .NET Unix SQL Algorithms Cross-functional Team... Programming See 25+     See less Software Development C++ ASP.NET Testing Software Engineering HTML 5 Software Project... Agile Methodologies Java Object Oriented Design C Semiconductors Linux Debugging Entrepreneurship C# Embedded Systems SECS/GEM CMMI JavaScript CSS Project Management MySQL Apache 2 Glassfish J2EE Application... NetBeans Object Oriented Software log4j Technical Leadership Web Services Software Design Architecture SOAP .NET Unix SQL Algorithms Cross-functional Team... Programming See 25+     See less Software Development C++ ASP.NET Testing Software Engineering HTML 5 Software Project... Agile Methodologies Java Object Oriented Design C Semiconductors Linux Debugging Entrepreneurship C# Embedded Systems SECS/GEM CMMI JavaScript CSS Project Management MySQL Apache 2 Glassfish J2EE Application... NetBeans Object Oriented Software log4j Technical Leadership Web Services Software Design Architecture SOAP .NET Unix SQL Algorithms Cross-functional Team... Programming See 25+     See less Education Tuskegee University BS 1997  – 2001 Tuskegee University BS 1997  – 2001 Tuskegee University BS 1997  – 2001 Tuskegee University BS 1997  – 2001 ", "Summary Hamid R. Rabiee - Received his BS and MS degrees (with Great Distinction) in Electrical Engineering from CSULB, his EEE degree in Electrical and Computer Engineering from USC, and his PhD in Electrical and Computer Engineering from Purdue University, West Lafayette, USA in 1996. From 1993 to 1996 he was a Member of Technical Staff at AT&T Bell Laboratories. From 1996 to 1999 he worked as a Senior Software Engineer at Intel Corporation. He was also with PSU, OGI and OSU universities as an adjunct professor of Electrical and Computer Engineering from 1996-2000. Since September 2000, he has joined Sharif University of Technology, Tehran, Iran. He is the founder of Sharif University Advanced Information and Communication Technology Research Center (AICT), Advanced Technologies Incubator (SATI), Digital Media Laboratory (DML), and Mobile Value Added Services Laboratory (M-VASL). He is currently a Professor of Computer Engineering at Sharif University of Technology, and the Director of AICT, DML, and M-VASL. He has been the initiator and director of national and international level projects in the context of UNDP International Open Source Network (IOSN) and Iran National ICT Development Plan. Prof. Rabiee has received numerous awards and honors for his Industrial, scientific and academic contributions. He has acted as chairman in a number of national and international conferences, and holds three patents. He is also a Senior Member of IEEE. Summary Hamid R. Rabiee - Received his BS and MS degrees (with Great Distinction) in Electrical Engineering from CSULB, his EEE degree in Electrical and Computer Engineering from USC, and his PhD in Electrical and Computer Engineering from Purdue University, West Lafayette, USA in 1996. From 1993 to 1996 he was a Member of Technical Staff at AT&T Bell Laboratories. From 1996 to 1999 he worked as a Senior Software Engineer at Intel Corporation. He was also with PSU, OGI and OSU universities as an adjunct professor of Electrical and Computer Engineering from 1996-2000. Since September 2000, he has joined Sharif University of Technology, Tehran, Iran. He is the founder of Sharif University Advanced Information and Communication Technology Research Center (AICT), Advanced Technologies Incubator (SATI), Digital Media Laboratory (DML), and Mobile Value Added Services Laboratory (M-VASL). He is currently a Professor of Computer Engineering at Sharif University of Technology, and the Director of AICT, DML, and M-VASL. He has been the initiator and director of national and international level projects in the context of UNDP International Open Source Network (IOSN) and Iran National ICT Development Plan. Prof. Rabiee has received numerous awards and honors for his Industrial, scientific and academic contributions. He has acted as chairman in a number of national and international conferences, and holds three patents. He is also a Senior Member of IEEE. Hamid R. Rabiee - Received his BS and MS degrees (with Great Distinction) in Electrical Engineering from CSULB, his EEE degree in Electrical and Computer Engineering from USC, and his PhD in Electrical and Computer Engineering from Purdue University, West Lafayette, USA in 1996. From 1993 to 1996 he was a Member of Technical Staff at AT&T Bell Laboratories. From 1996 to 1999 he worked as a Senior Software Engineer at Intel Corporation. He was also with PSU, OGI and OSU universities as an adjunct professor of Electrical and Computer Engineering from 1996-2000. Since September 2000, he has joined Sharif University of Technology, Tehran, Iran. He is the founder of Sharif University Advanced Information and Communication Technology Research Center (AICT), Advanced Technologies Incubator (SATI), Digital Media Laboratory (DML), and Mobile Value Added Services Laboratory (M-VASL). He is currently a Professor of Computer Engineering at Sharif University of Technology, and the Director of AICT, DML, and M-VASL. He has been the initiator and director of national and international level projects in the context of UNDP International Open Source Network (IOSN) and Iran National ICT Development Plan. Prof. Rabiee has received numerous awards and honors for his Industrial, scientific and academic contributions. He has acted as chairman in a number of national and international conferences, and holds three patents. He is also a Senior Member of IEEE. Hamid R. Rabiee - Received his BS and MS degrees (with Great Distinction) in Electrical Engineering from CSULB, his EEE degree in Electrical and Computer Engineering from USC, and his PhD in Electrical and Computer Engineering from Purdue University, West Lafayette, USA in 1996. From 1993 to 1996 he was a Member of Technical Staff at AT&T Bell Laboratories. From 1996 to 1999 he worked as a Senior Software Engineer at Intel Corporation. He was also with PSU, OGI and OSU universities as an adjunct professor of Electrical and Computer Engineering from 1996-2000. Since September 2000, he has joined Sharif University of Technology, Tehran, Iran. He is the founder of Sharif University Advanced Information and Communication Technology Research Center (AICT), Advanced Technologies Incubator (SATI), Digital Media Laboratory (DML), and Mobile Value Added Services Laboratory (M-VASL). He is currently a Professor of Computer Engineering at Sharif University of Technology, and the Director of AICT, DML, and M-VASL. He has been the initiator and director of national and international level projects in the context of UNDP International Open Source Network (IOSN) and Iran National ICT Development Plan. Prof. Rabiee has received numerous awards and honors for his Industrial, scientific and academic contributions. He has acted as chairman in a number of national and international conferences, and holds three patents. He is also a Senior Member of IEEE. Experience Professor Sharif University of Technology September 2000  – Present (15 years) Tehran, Iran Received his BS and MS degrees (with Great Distinction) in Electrical Engineering from CSULB, USA, his EEE degree in Electrical and Computer Engineering from USC, USA, and his PhD in Electrical and Computer Engineering from Purdue University, West Lafayette, USA in 1996. From 1993 to 1996 he was a Member of Technical Staff at AT&T Bell Laboratories. From 1996 to 1999 he worked as a Senior Software Engineer at Intel Corporation. He was also with PSU, OGI and OSU universities as an adjunct professor of Electrical and Computer Engineering from 1996-2000. Since September 2000, he has joined Sharif University of Technology, Tehran, Iran. He is the founder of Sharif University Advanced Information and Communication Technology Research Center (AICT), Sharif University Advanced Technologies Incubator (SATI), Sharif Digital Media Laboratory (DML), and Sharif Mobile Value Added Services Laboratory (M-VASL). He is currently a Professor of Computer Engineering at Sharif University of Technology, the Director of AICT, DML, and M-VASL. He has been the initiator and director of national and international level projects in the context of UNDP International Open Source Network (IOSN) and Iran National ICT Development Plan. He has received numerous awards and honors for his Industrial, scientific and academic contributions. He has acted as chairman in a number of national and international conferences, and holds three patents. He is also a Senior Member of IEEE. Consultant MCI 2007  –  February 2015  (8 years) Value Added Services \nService Delivery Platforms \nIP Network Senior Software Engineer Intel Corporation 1996  –  1999  (3 years) Member of Technical Staff AT&T Bell Labs 1993  –  1996  (3 years) Professor Sharif University of Technology September 2000  – Present (15 years) Tehran, Iran Received his BS and MS degrees (with Great Distinction) in Electrical Engineering from CSULB, USA, his EEE degree in Electrical and Computer Engineering from USC, USA, and his PhD in Electrical and Computer Engineering from Purdue University, West Lafayette, USA in 1996. From 1993 to 1996 he was a Member of Technical Staff at AT&T Bell Laboratories. From 1996 to 1999 he worked as a Senior Software Engineer at Intel Corporation. He was also with PSU, OGI and OSU universities as an adjunct professor of Electrical and Computer Engineering from 1996-2000. Since September 2000, he has joined Sharif University of Technology, Tehran, Iran. He is the founder of Sharif University Advanced Information and Communication Technology Research Center (AICT), Sharif University Advanced Technologies Incubator (SATI), Sharif Digital Media Laboratory (DML), and Sharif Mobile Value Added Services Laboratory (M-VASL). He is currently a Professor of Computer Engineering at Sharif University of Technology, the Director of AICT, DML, and M-VASL. He has been the initiator and director of national and international level projects in the context of UNDP International Open Source Network (IOSN) and Iran National ICT Development Plan. He has received numerous awards and honors for his Industrial, scientific and academic contributions. He has acted as chairman in a number of national and international conferences, and holds three patents. He is also a Senior Member of IEEE. Professor Sharif University of Technology September 2000  – Present (15 years) Tehran, Iran Received his BS and MS degrees (with Great Distinction) in Electrical Engineering from CSULB, USA, his EEE degree in Electrical and Computer Engineering from USC, USA, and his PhD in Electrical and Computer Engineering from Purdue University, West Lafayette, USA in 1996. From 1993 to 1996 he was a Member of Technical Staff at AT&T Bell Laboratories. From 1996 to 1999 he worked as a Senior Software Engineer at Intel Corporation. He was also with PSU, OGI and OSU universities as an adjunct professor of Electrical and Computer Engineering from 1996-2000. Since September 2000, he has joined Sharif University of Technology, Tehran, Iran. He is the founder of Sharif University Advanced Information and Communication Technology Research Center (AICT), Sharif University Advanced Technologies Incubator (SATI), Sharif Digital Media Laboratory (DML), and Sharif Mobile Value Added Services Laboratory (M-VASL). He is currently a Professor of Computer Engineering at Sharif University of Technology, the Director of AICT, DML, and M-VASL. He has been the initiator and director of national and international level projects in the context of UNDP International Open Source Network (IOSN) and Iran National ICT Development Plan. He has received numerous awards and honors for his Industrial, scientific and academic contributions. He has acted as chairman in a number of national and international conferences, and holds three patents. He is also a Senior Member of IEEE. Consultant MCI 2007  –  February 2015  (8 years) Value Added Services \nService Delivery Platforms \nIP Network Consultant MCI 2007  –  February 2015  (8 years) Value Added Services \nService Delivery Platforms \nIP Network Senior Software Engineer Intel Corporation 1996  –  1999  (3 years) Senior Software Engineer Intel Corporation 1996  –  1999  (3 years) Member of Technical Staff AT&T Bell Labs 1993  –  1996  (3 years) Member of Technical Staff AT&T Bell Labs 1993  –  1996  (3 years) Languages English Persian Arabic English Persian Arabic English Persian Arabic Skills C++ Matlab Algorithms Software Engineering Linux C Java Programming Artificial Intelligence Research Python Distributed Systems Computer Science Machine Learning Signal Processing Data Mining IP Pattern Recognition See 3+     See less Skills  C++ Matlab Algorithms Software Engineering Linux C Java Programming Artificial Intelligence Research Python Distributed Systems Computer Science Machine Learning Signal Processing Data Mining IP Pattern Recognition See 3+     See less C++ Matlab Algorithms Software Engineering Linux C Java Programming Artificial Intelligence Research Python Distributed Systems Computer Science Machine Learning Signal Processing Data Mining IP Pattern Recognition See 3+     See less C++ Matlab Algorithms Software Engineering Linux C Java Programming Artificial Intelligence Research Python Distributed Systems Computer Science Machine Learning Signal Processing Data Mining IP Pattern Recognition See 3+     See less Education Purdue University Doctor of Philosophy (Ph.D.),  Electrical and Computer Engineering 1991  – 1996 USC EEE,  Electrical and Computer Engineering 1989  – 1991 Purdue University Doctor of Philosophy (Ph.D.),  Electrical and Computer Engineering 1991  – 1996 Purdue University Doctor of Philosophy (Ph.D.),  Electrical and Computer Engineering 1991  – 1996 Purdue University Doctor of Philosophy (Ph.D.),  Electrical and Computer Engineering 1991  – 1996 USC EEE,  Electrical and Computer Engineering 1989  – 1991 USC EEE,  Electrical and Computer Engineering 1989  – 1991 USC EEE,  Electrical and Computer Engineering 1989  – 1991 ", "Summary I am a seasoned Software Engineer that has been designing and developing software since 1995, primarily on the Microsoft stack. I started with Visual C++ 1.0, Visual Basic 3.0 (for Windows) and 1.0 (for DOS), and SQL Server 4.2. \n \nI have followed application development trends from client/server to n-tier to web to mobile to the cloud. Clients started thick, then went thin, then alternated several times between the two. Business logic migrated from stored procedures to COM components to services. Data modeling shifted from 3rd party tools to SQL database diagrams to ORMs. \n \nFor a good part of my career I was very active in the Microsoft certification community. From 1996 to 2010, I passed 32 exams and attained (and re-attained) the major developer and database certifications. In 2004 I became a Microsoft Certified Trainer. From 2005 to 2010, I taught 21 developer and database-oriented classes to 265 students, saving my company $435K. \n \nAfter acquiring vast experience developing enterprise applications and establishing a successful track record of solving complex problems, I am now squarely in the second half of my career. Though I no longer code as often, my project responsibilities have nonetheless increased by managing the project schedule, technical team, customers, and management. \n \nI have been employed by Intel since 2000, and most recently I joined the Internet of Things Group. I am currently part of the development team working on Retail Client Manager (intel.com/rcm), and I am having a lot of fun. I am not looking for any other opportunities at this time. Summary I am a seasoned Software Engineer that has been designing and developing software since 1995, primarily on the Microsoft stack. I started with Visual C++ 1.0, Visual Basic 3.0 (for Windows) and 1.0 (for DOS), and SQL Server 4.2. \n \nI have followed application development trends from client/server to n-tier to web to mobile to the cloud. Clients started thick, then went thin, then alternated several times between the two. Business logic migrated from stored procedures to COM components to services. Data modeling shifted from 3rd party tools to SQL database diagrams to ORMs. \n \nFor a good part of my career I was very active in the Microsoft certification community. From 1996 to 2010, I passed 32 exams and attained (and re-attained) the major developer and database certifications. In 2004 I became a Microsoft Certified Trainer. From 2005 to 2010, I taught 21 developer and database-oriented classes to 265 students, saving my company $435K. \n \nAfter acquiring vast experience developing enterprise applications and establishing a successful track record of solving complex problems, I am now squarely in the second half of my career. Though I no longer code as often, my project responsibilities have nonetheless increased by managing the project schedule, technical team, customers, and management. \n \nI have been employed by Intel since 2000, and most recently I joined the Internet of Things Group. I am currently part of the development team working on Retail Client Manager (intel.com/rcm), and I am having a lot of fun. I am not looking for any other opportunities at this time. I am a seasoned Software Engineer that has been designing and developing software since 1995, primarily on the Microsoft stack. I started with Visual C++ 1.0, Visual Basic 3.0 (for Windows) and 1.0 (for DOS), and SQL Server 4.2. \n \nI have followed application development trends from client/server to n-tier to web to mobile to the cloud. Clients started thick, then went thin, then alternated several times between the two. Business logic migrated from stored procedures to COM components to services. Data modeling shifted from 3rd party tools to SQL database diagrams to ORMs. \n \nFor a good part of my career I was very active in the Microsoft certification community. From 1996 to 2010, I passed 32 exams and attained (and re-attained) the major developer and database certifications. In 2004 I became a Microsoft Certified Trainer. From 2005 to 2010, I taught 21 developer and database-oriented classes to 265 students, saving my company $435K. \n \nAfter acquiring vast experience developing enterprise applications and establishing a successful track record of solving complex problems, I am now squarely in the second half of my career. Though I no longer code as often, my project responsibilities have nonetheless increased by managing the project schedule, technical team, customers, and management. \n \nI have been employed by Intel since 2000, and most recently I joined the Internet of Things Group. I am currently part of the development team working on Retail Client Manager (intel.com/rcm), and I am having a lot of fun. I am not looking for any other opportunities at this time. I am a seasoned Software Engineer that has been designing and developing software since 1995, primarily on the Microsoft stack. I started with Visual C++ 1.0, Visual Basic 3.0 (for Windows) and 1.0 (for DOS), and SQL Server 4.2. \n \nI have followed application development trends from client/server to n-tier to web to mobile to the cloud. Clients started thick, then went thin, then alternated several times between the two. Business logic migrated from stored procedures to COM components to services. Data modeling shifted from 3rd party tools to SQL database diagrams to ORMs. \n \nFor a good part of my career I was very active in the Microsoft certification community. From 1996 to 2010, I passed 32 exams and attained (and re-attained) the major developer and database certifications. In 2004 I became a Microsoft Certified Trainer. From 2005 to 2010, I taught 21 developer and database-oriented classes to 265 students, saving my company $435K. \n \nAfter acquiring vast experience developing enterprise applications and establishing a successful track record of solving complex problems, I am now squarely in the second half of my career. Though I no longer code as often, my project responsibilities have nonetheless increased by managing the project schedule, technical team, customers, and management. \n \nI have been employed by Intel since 2000, and most recently I joined the Internet of Things Group. I am currently part of the development team working on Retail Client Manager (intel.com/rcm), and I am having a lot of fun. I am not looking for any other opportunities at this time. Experience Senior Software Engineer Intel Corporation - Retail Solutions Division (IOTG -> RSD) October 2013  – Present (1 year 11 months) Chandler, Arizona • Part of the development team for Retail Client Manager, Intel's digital content management product. \n• Team Lead for Remote Control capability, which allows browser-based remote management of devices in-band (when the OS is up) and out-of-band through AMT (when the OS is down). Senior Software Engineer Intel Corporation - Design Tools Development (TMG -> ATTD -> Design -> DTD) November 2009  –  October 2013  (4 years) Chandler, Arizona • Repurposed two mature desktop tools for external use by Original Device and Equipment Manufacturers (ODMs and OEMs). The tools validate CAD schematic and layout board files against Intel Platform Design Guidelines and display violations. \n- Architected the solution, managed the projects, and technically led the team comprised of employees and contractors across multiple geographies. Embraced Agile software practices, tracked resources, and reported-out to management regularly. \n- The user interfaces (UIs) are built with ASP.NET MVC 3, AJAX, and jQuery. A file upload control written in Silverlight 5 allows for very large files (hundreds of megabytes) to be uploaded with real-time feedback. The control communicates with multiple Windows Communication Foundation (WCF) 4 services, and uses Entity Framework 4.2 to store files as SQL Server 2008 R2 FILESTREAM data. \n- A managed wrapper, running on multiple application servers, leverages the desktop tools’ enormous CPU-intensive unmanaged code base. \n- Personally developed the queue-based back-end services which connect the tiers. The services are implemented using a manager/worker pattern and are deployed to application servers. They allow asynchronous execution of long-running (several hours) design rule checks, email notifications, and scheduled tasks such as data purging. \n• Chaired technical sharing meetings, oversaw design and code reviews, mentored multiple interns. Recognized outside of group as an expert in Microsoft developer technologies, and sought out by others as a valuable technical resource. \n• Key technologies: ASP.NET, Silverlight with MVVM, jQuery, AJAX, .NET, Windows Communication Foundation (WCF), Entity Framework, LINQ to SQL/XML/Objects, SQL Server \n• Special skills: Agile software development lifecycle (SDLC), asynchronous programming, Windows services guru, managed/unmanaged code integration, server administration Intel U Instructor, Microsoft Developer Technologies Representative Intel Corporation - Multiple training-related groups January 2005  –  April 2010  (5 years 4 months) Chandler, Arizona • Planned, organized, and taught 21 Microsoft courses through Intel U (see full list below) to 265 students which saved Intel $435K. \n• Evangelized internal training and recruited other trainers by presenting the virtues both individually to technical experts (in 1:1s) and various business groups (in staff meetings). \n• Coordinated vendor-led training based on IT demand when my schedule was full. \n• Represented Microsoft developer technologies in the IT Developer Virtual Advisory Team (VAT). \n• Helped define the IT technical training roadmap, forecasted training courses over the next 12-24 months, and specified competencies relevant to IT developers while working within an ever-tightening budget. Technical Lead, Senior Application Developer Intel Corporation - Workflow Platform Services (IT -> CSE -> EIE -> WPS) October 2001  –  October 2009  (8 years 1 month) Chandler, Arizona • Applications developed: Service-oriented architected (SOA) workflow platform, web request systems, many system tools (Windows and web) \n• Key technologies: ASP.NET, .NET, Windows Communication Foundation (WCF), BizTalk Server, ADO.NET, SQL Server \n• Special skills: Agile/Extreme Programming (XP) methodologies, user interface expert, perennial early technology adopter Senior Software Engineer Intel Corporation - Components Automation Systems (TMG -> TME -> CAS) June 2001  –  October 2001  (5 months) Chandler, Arizona • Applications developed: Bulk import utility \n• Technologies: COM, Active Server Pages, XML, XML HTTP, Office Web Components \n• Development tools: Visual Basic 6.0, Visual InterDev 6.0 \n• Database tools: SQL Server 6.5, Access 2000 System Architect, Technical Lead, User Interface Owner, Webmaster, Release Engineer Intel Corporation - EyeOnMarket.com January 2000  –  June 2001  (1 year 6 months) Chandler, Arizona • Applications developed: Highly scalable and available web shopping portal, ad-hoc reports, deployment scripts \n• Technologies: COM, Microsoft Transaction Server, Active Server Pages, XML, XSL, Microsoft Message Queue \n• Development tools: Visual Basic 6.0, Visual InterDev 6.0 \n• Database tools: SQL Server 7.0 Senior Consultant Affiliated Computer Services, Inc. April 1999  –  April 2000  (1 year 1 month) Phoenix, Arizona • Clients: SkyMall Incorporated \n• Roles: Web Developer, Release Engineer \n• Applications developed: Electronic commerce site, call center order entry application, complex deployment scripts \n• Technologies: COM, Microsoft Transaction Server, Active Server Pages, Site Server Commerce Edition \n• Development tools: Visual Basic 6.0, Visual InterDev 6.0, Wise InstallMaster \n• Database tools: SQL Server 7.0 Senior Consulting Analyst Software Synergy Incorporated December 1996  –  April 1999  (2 years 5 months) Phoenix, Arizona • Clients: REZsolutions Incorporated, Avnet Incorporated, InfoPak \n• Roles: Senior Consulting Analyst, Web Developer, Software Contractor, Software Developer \n• Applications developed: Central reservation system, real estate inventory application, INI editor, code checker, query web application, administrative web application \n• Technologies: Active Server Pages, Dynamic HTML, HTML, FrontPage 98, Liquid Motion, Hewlett Packard 95 palmtop PCs, VB add-ins, Java \n• Development tools: Visual Basic 5.0, Visual C++ 5.0, Visual InterDev 6.0, Visual J++ 1.0, Borland C++ \n• Database tools: SQL Server 6.5, Access Software Design Engineer Integrated Information Systems January 1995  –  November 1996  (1 year 11 months) Tempe, Arizona • Clients: New Strategies, Allied Signal, City of Mesa, Super Shuttle \n• Roles: Software Design Engineer, Software Developer \n• Applications developed: Order entry system, call tracking system, inventory tracking system, import utility, backup utility \n• Technologies: DBLIB, Remote Data Objects (RDO), OLE Remote Automation, OLE Automation \n• Development tools: Visual Basic for Windows 3.0/4.0, Visual Basic for DOS 1.0, Visual C++ 4.0, Crystal Reports \n• Database tools: SQL Server 4.2/6.0, Erwin/ERX, Oracle, Lotus Notes Senior Software Engineer Intel Corporation - Retail Solutions Division (IOTG -> RSD) October 2013  – Present (1 year 11 months) Chandler, Arizona • Part of the development team for Retail Client Manager, Intel's digital content management product. \n• Team Lead for Remote Control capability, which allows browser-based remote management of devices in-band (when the OS is up) and out-of-band through AMT (when the OS is down). Senior Software Engineer Intel Corporation - Retail Solutions Division (IOTG -> RSD) October 2013  – Present (1 year 11 months) Chandler, Arizona • Part of the development team for Retail Client Manager, Intel's digital content management product. \n• Team Lead for Remote Control capability, which allows browser-based remote management of devices in-band (when the OS is up) and out-of-band through AMT (when the OS is down). Senior Software Engineer Intel Corporation - Design Tools Development (TMG -> ATTD -> Design -> DTD) November 2009  –  October 2013  (4 years) Chandler, Arizona • Repurposed two mature desktop tools for external use by Original Device and Equipment Manufacturers (ODMs and OEMs). The tools validate CAD schematic and layout board files against Intel Platform Design Guidelines and display violations. \n- Architected the solution, managed the projects, and technically led the team comprised of employees and contractors across multiple geographies. Embraced Agile software practices, tracked resources, and reported-out to management regularly. \n- The user interfaces (UIs) are built with ASP.NET MVC 3, AJAX, and jQuery. A file upload control written in Silverlight 5 allows for very large files (hundreds of megabytes) to be uploaded with real-time feedback. The control communicates with multiple Windows Communication Foundation (WCF) 4 services, and uses Entity Framework 4.2 to store files as SQL Server 2008 R2 FILESTREAM data. \n- A managed wrapper, running on multiple application servers, leverages the desktop tools’ enormous CPU-intensive unmanaged code base. \n- Personally developed the queue-based back-end services which connect the tiers. The services are implemented using a manager/worker pattern and are deployed to application servers. They allow asynchronous execution of long-running (several hours) design rule checks, email notifications, and scheduled tasks such as data purging. \n• Chaired technical sharing meetings, oversaw design and code reviews, mentored multiple interns. Recognized outside of group as an expert in Microsoft developer technologies, and sought out by others as a valuable technical resource. \n• Key technologies: ASP.NET, Silverlight with MVVM, jQuery, AJAX, .NET, Windows Communication Foundation (WCF), Entity Framework, LINQ to SQL/XML/Objects, SQL Server \n• Special skills: Agile software development lifecycle (SDLC), asynchronous programming, Windows services guru, managed/unmanaged code integration, server administration Senior Software Engineer Intel Corporation - Design Tools Development (TMG -> ATTD -> Design -> DTD) November 2009  –  October 2013  (4 years) Chandler, Arizona • Repurposed two mature desktop tools for external use by Original Device and Equipment Manufacturers (ODMs and OEMs). The tools validate CAD schematic and layout board files against Intel Platform Design Guidelines and display violations. \n- Architected the solution, managed the projects, and technically led the team comprised of employees and contractors across multiple geographies. Embraced Agile software practices, tracked resources, and reported-out to management regularly. \n- The user interfaces (UIs) are built with ASP.NET MVC 3, AJAX, and jQuery. A file upload control written in Silverlight 5 allows for very large files (hundreds of megabytes) to be uploaded with real-time feedback. The control communicates with multiple Windows Communication Foundation (WCF) 4 services, and uses Entity Framework 4.2 to store files as SQL Server 2008 R2 FILESTREAM data. \n- A managed wrapper, running on multiple application servers, leverages the desktop tools’ enormous CPU-intensive unmanaged code base. \n- Personally developed the queue-based back-end services which connect the tiers. The services are implemented using a manager/worker pattern and are deployed to application servers. They allow asynchronous execution of long-running (several hours) design rule checks, email notifications, and scheduled tasks such as data purging. \n• Chaired technical sharing meetings, oversaw design and code reviews, mentored multiple interns. Recognized outside of group as an expert in Microsoft developer technologies, and sought out by others as a valuable technical resource. \n• Key technologies: ASP.NET, Silverlight with MVVM, jQuery, AJAX, .NET, Windows Communication Foundation (WCF), Entity Framework, LINQ to SQL/XML/Objects, SQL Server \n• Special skills: Agile software development lifecycle (SDLC), asynchronous programming, Windows services guru, managed/unmanaged code integration, server administration Intel U Instructor, Microsoft Developer Technologies Representative Intel Corporation - Multiple training-related groups January 2005  –  April 2010  (5 years 4 months) Chandler, Arizona • Planned, organized, and taught 21 Microsoft courses through Intel U (see full list below) to 265 students which saved Intel $435K. \n• Evangelized internal training and recruited other trainers by presenting the virtues both individually to technical experts (in 1:1s) and various business groups (in staff meetings). \n• Coordinated vendor-led training based on IT demand when my schedule was full. \n• Represented Microsoft developer technologies in the IT Developer Virtual Advisory Team (VAT). \n• Helped define the IT technical training roadmap, forecasted training courses over the next 12-24 months, and specified competencies relevant to IT developers while working within an ever-tightening budget. Intel U Instructor, Microsoft Developer Technologies Representative Intel Corporation - Multiple training-related groups January 2005  –  April 2010  (5 years 4 months) Chandler, Arizona • Planned, organized, and taught 21 Microsoft courses through Intel U (see full list below) to 265 students which saved Intel $435K. \n• Evangelized internal training and recruited other trainers by presenting the virtues both individually to technical experts (in 1:1s) and various business groups (in staff meetings). \n• Coordinated vendor-led training based on IT demand when my schedule was full. \n• Represented Microsoft developer technologies in the IT Developer Virtual Advisory Team (VAT). \n• Helped define the IT technical training roadmap, forecasted training courses over the next 12-24 months, and specified competencies relevant to IT developers while working within an ever-tightening budget. Technical Lead, Senior Application Developer Intel Corporation - Workflow Platform Services (IT -> CSE -> EIE -> WPS) October 2001  –  October 2009  (8 years 1 month) Chandler, Arizona • Applications developed: Service-oriented architected (SOA) workflow platform, web request systems, many system tools (Windows and web) \n• Key technologies: ASP.NET, .NET, Windows Communication Foundation (WCF), BizTalk Server, ADO.NET, SQL Server \n• Special skills: Agile/Extreme Programming (XP) methodologies, user interface expert, perennial early technology adopter Technical Lead, Senior Application Developer Intel Corporation - Workflow Platform Services (IT -> CSE -> EIE -> WPS) October 2001  –  October 2009  (8 years 1 month) Chandler, Arizona • Applications developed: Service-oriented architected (SOA) workflow platform, web request systems, many system tools (Windows and web) \n• Key technologies: ASP.NET, .NET, Windows Communication Foundation (WCF), BizTalk Server, ADO.NET, SQL Server \n• Special skills: Agile/Extreme Programming (XP) methodologies, user interface expert, perennial early technology adopter Senior Software Engineer Intel Corporation - Components Automation Systems (TMG -> TME -> CAS) June 2001  –  October 2001  (5 months) Chandler, Arizona • Applications developed: Bulk import utility \n• Technologies: COM, Active Server Pages, XML, XML HTTP, Office Web Components \n• Development tools: Visual Basic 6.0, Visual InterDev 6.0 \n• Database tools: SQL Server 6.5, Access 2000 Senior Software Engineer Intel Corporation - Components Automation Systems (TMG -> TME -> CAS) June 2001  –  October 2001  (5 months) Chandler, Arizona • Applications developed: Bulk import utility \n• Technologies: COM, Active Server Pages, XML, XML HTTP, Office Web Components \n• Development tools: Visual Basic 6.0, Visual InterDev 6.0 \n• Database tools: SQL Server 6.5, Access 2000 System Architect, Technical Lead, User Interface Owner, Webmaster, Release Engineer Intel Corporation - EyeOnMarket.com January 2000  –  June 2001  (1 year 6 months) Chandler, Arizona • Applications developed: Highly scalable and available web shopping portal, ad-hoc reports, deployment scripts \n• Technologies: COM, Microsoft Transaction Server, Active Server Pages, XML, XSL, Microsoft Message Queue \n• Development tools: Visual Basic 6.0, Visual InterDev 6.0 \n• Database tools: SQL Server 7.0 System Architect, Technical Lead, User Interface Owner, Webmaster, Release Engineer Intel Corporation - EyeOnMarket.com January 2000  –  June 2001  (1 year 6 months) Chandler, Arizona • Applications developed: Highly scalable and available web shopping portal, ad-hoc reports, deployment scripts \n• Technologies: COM, Microsoft Transaction Server, Active Server Pages, XML, XSL, Microsoft Message Queue \n• Development tools: Visual Basic 6.0, Visual InterDev 6.0 \n• Database tools: SQL Server 7.0 Senior Consultant Affiliated Computer Services, Inc. April 1999  –  April 2000  (1 year 1 month) Phoenix, Arizona • Clients: SkyMall Incorporated \n• Roles: Web Developer, Release Engineer \n• Applications developed: Electronic commerce site, call center order entry application, complex deployment scripts \n• Technologies: COM, Microsoft Transaction Server, Active Server Pages, Site Server Commerce Edition \n• Development tools: Visual Basic 6.0, Visual InterDev 6.0, Wise InstallMaster \n• Database tools: SQL Server 7.0 Senior Consultant Affiliated Computer Services, Inc. April 1999  –  April 2000  (1 year 1 month) Phoenix, Arizona • Clients: SkyMall Incorporated \n• Roles: Web Developer, Release Engineer \n• Applications developed: Electronic commerce site, call center order entry application, complex deployment scripts \n• Technologies: COM, Microsoft Transaction Server, Active Server Pages, Site Server Commerce Edition \n• Development tools: Visual Basic 6.0, Visual InterDev 6.0, Wise InstallMaster \n• Database tools: SQL Server 7.0 Senior Consulting Analyst Software Synergy Incorporated December 1996  –  April 1999  (2 years 5 months) Phoenix, Arizona • Clients: REZsolutions Incorporated, Avnet Incorporated, InfoPak \n• Roles: Senior Consulting Analyst, Web Developer, Software Contractor, Software Developer \n• Applications developed: Central reservation system, real estate inventory application, INI editor, code checker, query web application, administrative web application \n• Technologies: Active Server Pages, Dynamic HTML, HTML, FrontPage 98, Liquid Motion, Hewlett Packard 95 palmtop PCs, VB add-ins, Java \n• Development tools: Visual Basic 5.0, Visual C++ 5.0, Visual InterDev 6.0, Visual J++ 1.0, Borland C++ \n• Database tools: SQL Server 6.5, Access Senior Consulting Analyst Software Synergy Incorporated December 1996  –  April 1999  (2 years 5 months) Phoenix, Arizona • Clients: REZsolutions Incorporated, Avnet Incorporated, InfoPak \n• Roles: Senior Consulting Analyst, Web Developer, Software Contractor, Software Developer \n• Applications developed: Central reservation system, real estate inventory application, INI editor, code checker, query web application, administrative web application \n• Technologies: Active Server Pages, Dynamic HTML, HTML, FrontPage 98, Liquid Motion, Hewlett Packard 95 palmtop PCs, VB add-ins, Java \n• Development tools: Visual Basic 5.0, Visual C++ 5.0, Visual InterDev 6.0, Visual J++ 1.0, Borland C++ \n• Database tools: SQL Server 6.5, Access Software Design Engineer Integrated Information Systems January 1995  –  November 1996  (1 year 11 months) Tempe, Arizona • Clients: New Strategies, Allied Signal, City of Mesa, Super Shuttle \n• Roles: Software Design Engineer, Software Developer \n• Applications developed: Order entry system, call tracking system, inventory tracking system, import utility, backup utility \n• Technologies: DBLIB, Remote Data Objects (RDO), OLE Remote Automation, OLE Automation \n• Development tools: Visual Basic for Windows 3.0/4.0, Visual Basic for DOS 1.0, Visual C++ 4.0, Crystal Reports \n• Database tools: SQL Server 4.2/6.0, Erwin/ERX, Oracle, Lotus Notes Software Design Engineer Integrated Information Systems January 1995  –  November 1996  (1 year 11 months) Tempe, Arizona • Clients: New Strategies, Allied Signal, City of Mesa, Super Shuttle \n• Roles: Software Design Engineer, Software Developer \n• Applications developed: Order entry system, call tracking system, inventory tracking system, import utility, backup utility \n• Technologies: DBLIB, Remote Data Objects (RDO), OLE Remote Automation, OLE Automation \n• Development tools: Visual Basic for Windows 3.0/4.0, Visual Basic for DOS 1.0, Visual C++ 4.0, Crystal Reports \n• Database tools: SQL Server 4.2/6.0, Erwin/ERX, Oracle, Lotus Notes Skills .NET ASP.NET AJAX jQuery Silverlight MVVM WPF WCF WF ADO.NET SQL Server Training & Development SOA Web Services Windows Services Enterprise Architecture Solution Architecture Application Architecture Agile Extreme Programming TDD ASP.NET MVC Agile Methodologies Microsoft SQL Server Entity Framework Software Development See 11+     See less Skills  .NET ASP.NET AJAX jQuery Silverlight MVVM WPF WCF WF ADO.NET SQL Server Training & Development SOA Web Services Windows Services Enterprise Architecture Solution Architecture Application Architecture Agile Extreme Programming TDD ASP.NET MVC Agile Methodologies Microsoft SQL Server Entity Framework Software Development See 11+     See less .NET ASP.NET AJAX jQuery Silverlight MVVM WPF WCF WF ADO.NET SQL Server Training & Development SOA Web Services Windows Services Enterprise Architecture Solution Architecture Application Architecture Agile Extreme Programming TDD ASP.NET MVC Agile Methodologies Microsoft SQL Server Entity Framework Software Development See 11+     See less .NET ASP.NET AJAX jQuery Silverlight MVVM WPF WCF WF ADO.NET SQL Server Training & Development SOA Web Services Windows Services Enterprise Architecture Solution Architecture Application Architecture Agile Extreme Programming TDD ASP.NET MVC Agile Methodologies Microsoft SQL Server Entity Framework Software Development See 11+     See less Education Arizona State University BSE,  Computer Systems Engineering 1990  – 1994 Arizona State University BSE,  Computer Systems Engineering 1990  – 1994 Arizona State University BSE,  Computer Systems Engineering 1990  – 1994 Arizona State University BSE,  Computer Systems Engineering 1990  – 1994 ", "Experience Lecturer in Software Architecture Universidad Tecnologica Nacional January 2015  – Present (8 months) In addition to regular teaching activities: \n- Organized, implemented programmes and assessments. \n- Responsible for preparing learning material for courses and devising relevant practical activities. Senior Software Engineer Intel Corporation November 2013  – Present (1 year 10 months) Component leader in the Intel(R) XDK development environment for cross-platform HTML5 apps. Research in Programming Languages Universidad Tecnologica Nacional June 2013  – Present (2 years 3 months) Leader of PumaScript programming language development. \n \nPumaScript is a research programming language based on JavaScript. It has exactly the same syntax and semantic than JavaScript plus meta-programming capabilities and re-writing features. Senior Software Engineer Intel Corporation June 2010  –  December 2013  (3 years 7 months) Tech Leader for Intel(R) HTML5 App Porter Tool. A cross-compiler tool to translate Objective-C iOS applications into HTML5. Software Engineer Intel Corporation June 2009  –  June 2010  (1 year 1 month) Lead Software Engineer for UTN Emall Universidad Tecnologica Nacional June 2007  –  December 2008  (1 year 7 months) UTN Emall is a graphical DSL to easily generate mobile apps and services developed for Microsoft. LayerD - Meta-programming Framework Universidad Tecnologica Nacional January 2006  –  January 2008  (2 years 1 month) I've designed and implemented a meta-programming framework called LayerD. This framework provides a modular compiler infrastructure with compile time introspection capabilities and code generation for several targets like Java, C#, C++ and JavaScript. \n Independent Software Developer Freelance January 2002  –  December 2005  (4 years) Lecturer in Software Architecture Universidad Tecnologica Nacional January 2015  – Present (8 months) In addition to regular teaching activities: \n- Organized, implemented programmes and assessments. \n- Responsible for preparing learning material for courses and devising relevant practical activities. Lecturer in Software Architecture Universidad Tecnologica Nacional January 2015  – Present (8 months) In addition to regular teaching activities: \n- Organized, implemented programmes and assessments. \n- Responsible for preparing learning material for courses and devising relevant practical activities. Senior Software Engineer Intel Corporation November 2013  – Present (1 year 10 months) Component leader in the Intel(R) XDK development environment for cross-platform HTML5 apps. Senior Software Engineer Intel Corporation November 2013  – Present (1 year 10 months) Component leader in the Intel(R) XDK development environment for cross-platform HTML5 apps. Research in Programming Languages Universidad Tecnologica Nacional June 2013  – Present (2 years 3 months) Leader of PumaScript programming language development. \n \nPumaScript is a research programming language based on JavaScript. It has exactly the same syntax and semantic than JavaScript plus meta-programming capabilities and re-writing features. Research in Programming Languages Universidad Tecnologica Nacional June 2013  – Present (2 years 3 months) Leader of PumaScript programming language development. \n \nPumaScript is a research programming language based on JavaScript. It has exactly the same syntax and semantic than JavaScript plus meta-programming capabilities and re-writing features. Senior Software Engineer Intel Corporation June 2010  –  December 2013  (3 years 7 months) Tech Leader for Intel(R) HTML5 App Porter Tool. A cross-compiler tool to translate Objective-C iOS applications into HTML5. Senior Software Engineer Intel Corporation June 2010  –  December 2013  (3 years 7 months) Tech Leader for Intel(R) HTML5 App Porter Tool. A cross-compiler tool to translate Objective-C iOS applications into HTML5. Software Engineer Intel Corporation June 2009  –  June 2010  (1 year 1 month) Software Engineer Intel Corporation June 2009  –  June 2010  (1 year 1 month) Lead Software Engineer for UTN Emall Universidad Tecnologica Nacional June 2007  –  December 2008  (1 year 7 months) UTN Emall is a graphical DSL to easily generate mobile apps and services developed for Microsoft. Lead Software Engineer for UTN Emall Universidad Tecnologica Nacional June 2007  –  December 2008  (1 year 7 months) UTN Emall is a graphical DSL to easily generate mobile apps and services developed for Microsoft. LayerD - Meta-programming Framework Universidad Tecnologica Nacional January 2006  –  January 2008  (2 years 1 month) I've designed and implemented a meta-programming framework called LayerD. This framework provides a modular compiler infrastructure with compile time introspection capabilities and code generation for several targets like Java, C#, C++ and JavaScript. \n LayerD - Meta-programming Framework Universidad Tecnologica Nacional January 2006  –  January 2008  (2 years 1 month) I've designed and implemented a meta-programming framework called LayerD. This framework provides a modular compiler infrastructure with compile time introspection capabilities and code generation for several targets like Java, C#, C++ and JavaScript. \n Independent Software Developer Freelance January 2002  –  December 2005  (4 years) Independent Software Developer Freelance January 2002  –  December 2005  (4 years) Languages English Professional working proficiency Spanish Native or bilingual proficiency English Professional working proficiency Spanish Native or bilingual proficiency English Professional working proficiency Spanish Native or bilingual proficiency Professional working proficiency Native or bilingual proficiency Skills Compilers Compiler Construction Meta-programming Domain Specific... Programming Language... C++ .NET JavaScript HTML 5 Objective-C iOS development C# Multithreading Clang Meta D++ Mobile Applications Java Object Oriented Design Software Engineering HTML5 Subversion Scrum Software Development See 8+     See less Skills  Compilers Compiler Construction Meta-programming Domain Specific... Programming Language... C++ .NET JavaScript HTML 5 Objective-C iOS development C# Multithreading Clang Meta D++ Mobile Applications Java Object Oriented Design Software Engineering HTML5 Subversion Scrum Software Development See 8+     See less Compilers Compiler Construction Meta-programming Domain Specific... Programming Language... C++ .NET JavaScript HTML 5 Objective-C iOS development C# Multithreading Clang Meta D++ Mobile Applications Java Object Oriented Design Software Engineering HTML5 Subversion Scrum Software Development See 8+     See less Compilers Compiler Construction Meta-programming Domain Specific... Programming Language... C++ .NET JavaScript HTML 5 Objective-C iOS development C# Multithreading Clang Meta D++ Mobile Applications Java Object Oriented Design Software Engineering HTML5 Subversion Scrum Software Development See 8+     See less Education Universidad Tecnológica Nacional Systems Engineer,  Computer Engineering Universidad Tecnológica Nacional Systems Engineer,  Computer Engineering Universidad Tecnológica Nacional Systems Engineer,  Computer Engineering Universidad Tecnológica Nacional Systems Engineer,  Computer Engineering ", "Languages English English English Skills Emulation X86 Perl Visual C++ C++ Assembly C Python Linux Compilers Windows Optimization Communications Audits Intel Software Engineering Manufacturing Debugging Computer Architecture Embedded Systems Optimizations Algorithms Parallel Computing Simulations ARM High Performance... Linux Kernel Multithreading Parallel Programming Device Drivers Distributed Systems Processors Software Design Software Testing Life... See 18+     See less Skills  Emulation X86 Perl Visual C++ C++ Assembly C Python Linux Compilers Windows Optimization Communications Audits Intel Software Engineering Manufacturing Debugging Computer Architecture Embedded Systems Optimizations Algorithms Parallel Computing Simulations ARM High Performance... Linux Kernel Multithreading Parallel Programming Device Drivers Distributed Systems Processors Software Design Software Testing Life... See 18+     See less Emulation X86 Perl Visual C++ C++ Assembly C Python Linux Compilers Windows Optimization Communications Audits Intel Software Engineering Manufacturing Debugging Computer Architecture Embedded Systems Optimizations Algorithms Parallel Computing Simulations ARM High Performance... Linux Kernel Multithreading Parallel Programming Device Drivers Distributed Systems Processors Software Design Software Testing Life... See 18+     See less Emulation X86 Perl Visual C++ C++ Assembly C Python Linux Compilers Windows Optimization Communications Audits Intel Software Engineering Manufacturing Debugging Computer Architecture Embedded Systems Optimizations Algorithms Parallel Computing Simulations ARM High Performance... Linux Kernel Multithreading Parallel Programming Device Drivers Distributed Systems Processors Software Design Software Testing Life... See 18+     See less ", "Summary Demonstrated software engineer specializing in developing Mac OSX OpenGL graphics drivers for Intel integrated graphics chips. Also possesses strong knowledge of developing complex database driven .NET applications, and has a comprehensive understanding of the full life cycle of the software design process. Summary Demonstrated software engineer specializing in developing Mac OSX OpenGL graphics drivers for Intel integrated graphics chips. Also possesses strong knowledge of developing complex database driven .NET applications, and has a comprehensive understanding of the full life cycle of the software design process. Demonstrated software engineer specializing in developing Mac OSX OpenGL graphics drivers for Intel integrated graphics chips. Also possesses strong knowledge of developing complex database driven .NET applications, and has a comprehensive understanding of the full life cycle of the software design process. Demonstrated software engineer specializing in developing Mac OSX OpenGL graphics drivers for Intel integrated graphics chips. Also possesses strong knowledge of developing complex database driven .NET applications, and has a comprehensive understanding of the full life cycle of the software design process. Experience Senior Software Engineer Intel Corporation December 2010  – Present (4 years 9 months) Worked closely with Apple engineers to develop Intel 3D graphics driver for various Apple mobile and desktop product lines which included MBP, rMBP, MBA, and Mac mini. Focused on fixing OpenGL bugs reported from the Apple bug tracking database , also implemented driver features to support up-and-coming new products. \n \nDebugged Windows display driver bugs on Apple systems running boot camp. The combination of Apple hardware designs and Microsoft software stacks caused unique driver bugs and presented distinctive debug challenges. Senior Software Engineer Intel Corporation May 2007  –  November 2010  (3 years 7 months) Utilized Windbg and other debugging tools to identify root causes of display corruptions and failures in Intel graphics driver which were spread across components, such as 3D, media, display, and power conservation. \n \nTook an expatriate assignment in Taiwan to bring up a new peer team, established the leadership role to get the team operational in a short amount of time, provided extensive graphics driver debugging training to new hires. Software Engineer Intel Corporation April 2004  –  April 2007  (3 years 1 month) Architected and developed an automation tool to validate various Intel integrated graphics devices in the simulation, emulation, and silicon environments. The SQL database driven .NET application provided capabilities to set up execution environments, manage validation tests, execute tests automatically, track test progress, and report validation data. The core components of the tool have been continuously used by graphics system validation teams across the global since the development of Intel G965 chipsets in 2005. Enterprise Application Developer Intel Corporation January 2001  –  March 2004  (3 years 3 months) Developed and maintained a .NET web application to generate, store, and share pivot table reports by accessing the Microsoft OLAP data service. The application was used by majority of Intel fabrication plants to track mission critical chip manufacture data. Intern Technician Intel Corporation January 1999  –  August 1999  (8 months) Developed web based applications for the CPU validation team to report validation status. Intern Technician Intel Corporation January 1998  –  August 1998  (8 months) Monitored and maintained CTM D2 fabrication plant’s production data \n \nDeveloped Oracle database applications to improve data reporting processes Senior Software Engineer Intel Corporation December 2010  – Present (4 years 9 months) Worked closely with Apple engineers to develop Intel 3D graphics driver for various Apple mobile and desktop product lines which included MBP, rMBP, MBA, and Mac mini. Focused on fixing OpenGL bugs reported from the Apple bug tracking database , also implemented driver features to support up-and-coming new products. \n \nDebugged Windows display driver bugs on Apple systems running boot camp. The combination of Apple hardware designs and Microsoft software stacks caused unique driver bugs and presented distinctive debug challenges. Senior Software Engineer Intel Corporation December 2010  – Present (4 years 9 months) Worked closely with Apple engineers to develop Intel 3D graphics driver for various Apple mobile and desktop product lines which included MBP, rMBP, MBA, and Mac mini. Focused on fixing OpenGL bugs reported from the Apple bug tracking database , also implemented driver features to support up-and-coming new products. \n \nDebugged Windows display driver bugs on Apple systems running boot camp. The combination of Apple hardware designs and Microsoft software stacks caused unique driver bugs and presented distinctive debug challenges. Senior Software Engineer Intel Corporation May 2007  –  November 2010  (3 years 7 months) Utilized Windbg and other debugging tools to identify root causes of display corruptions and failures in Intel graphics driver which were spread across components, such as 3D, media, display, and power conservation. \n \nTook an expatriate assignment in Taiwan to bring up a new peer team, established the leadership role to get the team operational in a short amount of time, provided extensive graphics driver debugging training to new hires. Senior Software Engineer Intel Corporation May 2007  –  November 2010  (3 years 7 months) Utilized Windbg and other debugging tools to identify root causes of display corruptions and failures in Intel graphics driver which were spread across components, such as 3D, media, display, and power conservation. \n \nTook an expatriate assignment in Taiwan to bring up a new peer team, established the leadership role to get the team operational in a short amount of time, provided extensive graphics driver debugging training to new hires. Software Engineer Intel Corporation April 2004  –  April 2007  (3 years 1 month) Architected and developed an automation tool to validate various Intel integrated graphics devices in the simulation, emulation, and silicon environments. The SQL database driven .NET application provided capabilities to set up execution environments, manage validation tests, execute tests automatically, track test progress, and report validation data. The core components of the tool have been continuously used by graphics system validation teams across the global since the development of Intel G965 chipsets in 2005. Software Engineer Intel Corporation April 2004  –  April 2007  (3 years 1 month) Architected and developed an automation tool to validate various Intel integrated graphics devices in the simulation, emulation, and silicon environments. The SQL database driven .NET application provided capabilities to set up execution environments, manage validation tests, execute tests automatically, track test progress, and report validation data. The core components of the tool have been continuously used by graphics system validation teams across the global since the development of Intel G965 chipsets in 2005. Enterprise Application Developer Intel Corporation January 2001  –  March 2004  (3 years 3 months) Developed and maintained a .NET web application to generate, store, and share pivot table reports by accessing the Microsoft OLAP data service. The application was used by majority of Intel fabrication plants to track mission critical chip manufacture data. Enterprise Application Developer Intel Corporation January 2001  –  March 2004  (3 years 3 months) Developed and maintained a .NET web application to generate, store, and share pivot table reports by accessing the Microsoft OLAP data service. The application was used by majority of Intel fabrication plants to track mission critical chip manufacture data. Intern Technician Intel Corporation January 1999  –  August 1999  (8 months) Developed web based applications for the CPU validation team to report validation status. Intern Technician Intel Corporation January 1999  –  August 1999  (8 months) Developed web based applications for the CPU validation team to report validation status. Intern Technician Intel Corporation January 1998  –  August 1998  (8 months) Monitored and maintained CTM D2 fabrication plant’s production data \n \nDeveloped Oracle database applications to improve data reporting processes Intern Technician Intel Corporation January 1998  –  August 1998  (8 months) Monitored and maintained CTM D2 fabrication plant’s production data \n \nDeveloped Oracle database applications to improve data reporting processes Skills C++ C# Perl JavaScript Mac OS Windows 7 OpenGL Xcode GNU Debugger LLVM Windows software... Windows Driver... .NET Visual Studio WinDbg DirectX Shaders HTML ASP.NET XML XSL See 6+     See less Skills  C++ C# Perl JavaScript Mac OS Windows 7 OpenGL Xcode GNU Debugger LLVM Windows software... Windows Driver... .NET Visual Studio WinDbg DirectX Shaders HTML ASP.NET XML XSL See 6+     See less C++ C# Perl JavaScript Mac OS Windows 7 OpenGL Xcode GNU Debugger LLVM Windows software... Windows Driver... .NET Visual Studio WinDbg DirectX Shaders HTML ASP.NET XML XSL See 6+     See less C++ C# Perl JavaScript Mac OS Windows 7 OpenGL Xcode GNU Debugger LLVM Windows software... Windows Driver... .NET Visual Studio WinDbg DirectX Shaders HTML ASP.NET XML XSL See 6+     See less Education University of Florida Bachelor of Science,  Computer Engineering 1995  – 2001 University of Florida Bachelor of Science,  Computer Engineering 1995  – 2001 University of Florida Bachelor of Science,  Computer Engineering 1995  – 2001 University of Florida Bachelor of Science,  Computer Engineering 1995  – 2001 ", "Experience Senior Software Engineer Intel Corporation June 2014  – Present (1 year 3 months) Shanghai City, China WebRTC engineer working on video conferencing, browser optimization and customer enabling for windows/android/Linux. Senior Firmware Engineer Intel Corporation July 2011  –  May 2014  (2 years 11 months) Shanghai City, China Design and develop firmware for x86 SoC based mobile platform. Senior Software Engineer Intel Corporation May 2006  –  June 2011  (5 years 2 months) Shanghai City, China Design and develop middleware and application for Consumer Electronic devices Senior Software Engineer Intel Corporation June 2014  – Present (1 year 3 months) Shanghai City, China WebRTC engineer working on video conferencing, browser optimization and customer enabling for windows/android/Linux. Senior Software Engineer Intel Corporation June 2014  – Present (1 year 3 months) Shanghai City, China WebRTC engineer working on video conferencing, browser optimization and customer enabling for windows/android/Linux. Senior Firmware Engineer Intel Corporation July 2011  –  May 2014  (2 years 11 months) Shanghai City, China Design and develop firmware for x86 SoC based mobile platform. Senior Firmware Engineer Intel Corporation July 2011  –  May 2014  (2 years 11 months) Shanghai City, China Design and develop firmware for x86 SoC based mobile platform. Senior Software Engineer Intel Corporation May 2006  –  June 2011  (5 years 2 months) Shanghai City, China Design and develop middleware and application for Consumer Electronic devices Senior Software Engineer Intel Corporation May 2006  –  June 2011  (5 years 2 months) Shanghai City, China Design and develop middleware and application for Consumer Electronic devices Skills Debugging Security EFI BIOS SOA C/C++ Java Middleware DRM OTA Video Codec Audio codecs Optimizing Performance Video Conferencing browser optimization Skills  Debugging Security EFI BIOS SOA C/C++ Java Middleware DRM OTA Video Codec Audio codecs Optimizing Performance Video Conferencing browser optimization Debugging Security EFI BIOS SOA C/C++ Java Middleware DRM OTA Video Codec Audio codecs Optimizing Performance Video Conferencing browser optimization Debugging Security EFI BIOS SOA C/C++ Java Middleware DRM OTA Video Codec Audio codecs Optimizing Performance Video Conferencing browser optimization Education Nanjing University Master of Science (MS),  Computer Science 1999  – 2006 Nanjing University Master of Science (MS),  Computer Science 1999  – 2006 Nanjing University Master of Science (MS),  Computer Science 1999  – 2006 Nanjing University Master of Science (MS),  Computer Science 1999  – 2006 ", "Summary I have an extensive background in software design and development. I have served as a software engineer, team lead, and personnel manager during my tenure at Intel depending on what was needed by the organization that I work for. I have developed software for many flavors of Unix and Linux as well as 32 bit Windows dating back to Windows 95. Part of my career as an engineer was spent working in a research and development group at Intel that was pioneering the use of computers in the home as well as developing new applications that harnessed the Internet, which at the time was just hitting the mainstream. I was involved in some very early experiments integrating television content into computer applications. Right now I am very interested in mobile internet devices, and helping to shape the future of this growing technology area. I am interested in working as a software engineer or as a hands-on software architect. Specialties:Software architecture and design, managing technical vs. business trade-offs, C / C++ Summary I have an extensive background in software design and development. I have served as a software engineer, team lead, and personnel manager during my tenure at Intel depending on what was needed by the organization that I work for. I have developed software for many flavors of Unix and Linux as well as 32 bit Windows dating back to Windows 95. Part of my career as an engineer was spent working in a research and development group at Intel that was pioneering the use of computers in the home as well as developing new applications that harnessed the Internet, which at the time was just hitting the mainstream. I was involved in some very early experiments integrating television content into computer applications. Right now I am very interested in mobile internet devices, and helping to shape the future of this growing technology area. I am interested in working as a software engineer or as a hands-on software architect. Specialties:Software architecture and design, managing technical vs. business trade-offs, C / C++ I have an extensive background in software design and development. I have served as a software engineer, team lead, and personnel manager during my tenure at Intel depending on what was needed by the organization that I work for. I have developed software for many flavors of Unix and Linux as well as 32 bit Windows dating back to Windows 95. Part of my career as an engineer was spent working in a research and development group at Intel that was pioneering the use of computers in the home as well as developing new applications that harnessed the Internet, which at the time was just hitting the mainstream. I was involved in some very early experiments integrating television content into computer applications. Right now I am very interested in mobile internet devices, and helping to shape the future of this growing technology area. I am interested in working as a software engineer or as a hands-on software architect. Specialties:Software architecture and design, managing technical vs. business trade-offs, C / C++ I have an extensive background in software design and development. I have served as a software engineer, team lead, and personnel manager during my tenure at Intel depending on what was needed by the organization that I work for. I have developed software for many flavors of Unix and Linux as well as 32 bit Windows dating back to Windows 95. Part of my career as an engineer was spent working in a research and development group at Intel that was pioneering the use of computers in the home as well as developing new applications that harnessed the Internet, which at the time was just hitting the mainstream. I was involved in some very early experiments integrating television content into computer applications. Right now I am very interested in mobile internet devices, and helping to shape the future of this growing technology area. I am interested in working as a software engineer or as a hands-on software architect. Specialties:Software architecture and design, managing technical vs. business trade-offs, C / C++ Experience Senior Software Engineer Intel Corporation August 2012  – Present (3 years 1 month) Portland, Oregon Area Part of a team responsible for adding support for new Intel processors (both \"big core\" and Atom) to ChromeOS. Responsibilities include technical path-finding, Scrum release planning, leading development efforts within the team to support specific platforms, helping to coordinate engineering efforts with the upstream ChromiumOS project, and back-porting changes both in the Linux kernel and user space to the versions supported within ChromeOS. Senior Software Engineer Intel Corporation June 2011  –  August 2012  (1 year 3 months) Portland, Oregon Area Part of a team responsible for porting the Android OS (Honeycomb and Ice Cream Sandwich) to IA tablets. Most of my work has been in user space, but I have dabbled a bit in device drivers. Software Architect Intel Corporation March 2005  –  June 2011  (6 years 4 months) Designing, building, and supporting software tools to support a team of 150 validation engineers across multiple disciplines and sites. Refactoring C code (libraries and Linux loadable kernel modules) that provide an application-level interface to a set of product line specific silicon features to improve maintainability and portability. Defining validation tools deliverables and schedule for multiple silicon product families. Senior Software Engineer Intel Corporation September 2000  –  March 2005  (4 years 7 months) Part of a small team that designed and implemented an embedded validation infrastructure for Intel IXP Network Processors. Wrote a Tcl-based utility to initialize a multi-channel RDRAM controller. Heavily refactored an existing ARM assembly language routine for initializing the same RDRAM controller to support the IXP 2800. Senior Software Engineer Intel Corporation July 1995  –  September 2000  (5 years 3 months) Responsible for designing and developing a variety of application components that highlighted the multimedia capabilities of Intel Architecture platforms. Developed a communications infrastructure that allowed bi-directional, progressive transmission of digital images over a point-to-point POTS connection. Designed and developed Win32 C++ COM components showcasing the ability of IA platforms to process information coming from a satellite broadband connection. Senior Software Engineer Intel Corporation June 1994  –  July 1995  (1 year 2 months) Designed a media librarian component for a data management engine used to help drive an efficient data protection solution (software + hardware) used to allow disaster recovery protection for branch offices over a WAN link. Contributed to the overall architecture and design of the disaster recovery system as well as the design of several of the other components in the data management engine. Software Engineer Sequent Computer Systems July 1992  –  June 1994  (2 years) Designed and implemented (in C) the device-specific portion of a media changer subsystem that was developed in-house for the support of media changers from different vendors; design scaled from 10 volume to 2000+ volume media changers. Senior Software Engineer Intel Corporation August 2012  – Present (3 years 1 month) Portland, Oregon Area Part of a team responsible for adding support for new Intel processors (both \"big core\" and Atom) to ChromeOS. Responsibilities include technical path-finding, Scrum release planning, leading development efforts within the team to support specific platforms, helping to coordinate engineering efforts with the upstream ChromiumOS project, and back-porting changes both in the Linux kernel and user space to the versions supported within ChromeOS. Senior Software Engineer Intel Corporation August 2012  – Present (3 years 1 month) Portland, Oregon Area Part of a team responsible for adding support for new Intel processors (both \"big core\" and Atom) to ChromeOS. Responsibilities include technical path-finding, Scrum release planning, leading development efforts within the team to support specific platforms, helping to coordinate engineering efforts with the upstream ChromiumOS project, and back-porting changes both in the Linux kernel and user space to the versions supported within ChromeOS. Senior Software Engineer Intel Corporation June 2011  –  August 2012  (1 year 3 months) Portland, Oregon Area Part of a team responsible for porting the Android OS (Honeycomb and Ice Cream Sandwich) to IA tablets. Most of my work has been in user space, but I have dabbled a bit in device drivers. Senior Software Engineer Intel Corporation June 2011  –  August 2012  (1 year 3 months) Portland, Oregon Area Part of a team responsible for porting the Android OS (Honeycomb and Ice Cream Sandwich) to IA tablets. Most of my work has been in user space, but I have dabbled a bit in device drivers. Software Architect Intel Corporation March 2005  –  June 2011  (6 years 4 months) Designing, building, and supporting software tools to support a team of 150 validation engineers across multiple disciplines and sites. Refactoring C code (libraries and Linux loadable kernel modules) that provide an application-level interface to a set of product line specific silicon features to improve maintainability and portability. Defining validation tools deliverables and schedule for multiple silicon product families. Software Architect Intel Corporation March 2005  –  June 2011  (6 years 4 months) Designing, building, and supporting software tools to support a team of 150 validation engineers across multiple disciplines and sites. Refactoring C code (libraries and Linux loadable kernel modules) that provide an application-level interface to a set of product line specific silicon features to improve maintainability and portability. Defining validation tools deliverables and schedule for multiple silicon product families. Senior Software Engineer Intel Corporation September 2000  –  March 2005  (4 years 7 months) Part of a small team that designed and implemented an embedded validation infrastructure for Intel IXP Network Processors. Wrote a Tcl-based utility to initialize a multi-channel RDRAM controller. Heavily refactored an existing ARM assembly language routine for initializing the same RDRAM controller to support the IXP 2800. Senior Software Engineer Intel Corporation September 2000  –  March 2005  (4 years 7 months) Part of a small team that designed and implemented an embedded validation infrastructure for Intel IXP Network Processors. Wrote a Tcl-based utility to initialize a multi-channel RDRAM controller. Heavily refactored an existing ARM assembly language routine for initializing the same RDRAM controller to support the IXP 2800. Senior Software Engineer Intel Corporation July 1995  –  September 2000  (5 years 3 months) Responsible for designing and developing a variety of application components that highlighted the multimedia capabilities of Intel Architecture platforms. Developed a communications infrastructure that allowed bi-directional, progressive transmission of digital images over a point-to-point POTS connection. Designed and developed Win32 C++ COM components showcasing the ability of IA platforms to process information coming from a satellite broadband connection. Senior Software Engineer Intel Corporation July 1995  –  September 2000  (5 years 3 months) Responsible for designing and developing a variety of application components that highlighted the multimedia capabilities of Intel Architecture platforms. Developed a communications infrastructure that allowed bi-directional, progressive transmission of digital images over a point-to-point POTS connection. Designed and developed Win32 C++ COM components showcasing the ability of IA platforms to process information coming from a satellite broadband connection. Senior Software Engineer Intel Corporation June 1994  –  July 1995  (1 year 2 months) Designed a media librarian component for a data management engine used to help drive an efficient data protection solution (software + hardware) used to allow disaster recovery protection for branch offices over a WAN link. Contributed to the overall architecture and design of the disaster recovery system as well as the design of several of the other components in the data management engine. Senior Software Engineer Intel Corporation June 1994  –  July 1995  (1 year 2 months) Designed a media librarian component for a data management engine used to help drive an efficient data protection solution (software + hardware) used to allow disaster recovery protection for branch offices over a WAN link. Contributed to the overall architecture and design of the disaster recovery system as well as the design of several of the other components in the data management engine. Software Engineer Sequent Computer Systems July 1992  –  June 1994  (2 years) Designed and implemented (in C) the device-specific portion of a media changer subsystem that was developed in-house for the support of media changers from different vendors; design scaled from 10 volume to 2000+ volume media changers. Software Engineer Sequent Computer Systems July 1992  –  June 1994  (2 years) Designed and implemented (in C) the device-specific portion of a media changer subsystem that was developed in-house for the support of media changers from different vendors; design scaled from 10 volume to 2000+ volume media changers. Skills C C++ Linux Java Visual Studio Android Debugging Gdb Emacs Bash Python Eclipse ADB Unix Git Sockets COM GNU Make ARM Perl Software Design Intel Operating Systems Embedded Linux Linux Kernel Device Drivers Object Oriented Design Distributed Systems Embedded Software See 14+     See less Skills  C C++ Linux Java Visual Studio Android Debugging Gdb Emacs Bash Python Eclipse ADB Unix Git Sockets COM GNU Make ARM Perl Software Design Intel Operating Systems Embedded Linux Linux Kernel Device Drivers Object Oriented Design Distributed Systems Embedded Software See 14+     See less C C++ Linux Java Visual Studio Android Debugging Gdb Emacs Bash Python Eclipse ADB Unix Git Sockets COM GNU Make ARM Perl Software Design Intel Operating Systems Embedded Linux Linux Kernel Device Drivers Object Oriented Design Distributed Systems Embedded Software See 14+     See less C C++ Linux Java Visual Studio Android Debugging Gdb Emacs Bash Python Eclipse ADB Unix Git Sockets COM GNU Make ARM Perl Software Design Intel Operating Systems Embedded Linux Linux Kernel Device Drivers Object Oriented Design Distributed Systems Embedded Software See 14+     See less Education Oregon State University BS,  Computer Science 1988  – 1992 Oregon State University BS,  Computer Science 1988  – 1992 Oregon State University BS,  Computer Science 1988  – 1992 Oregon State University BS,  Computer Science 1988  – 1992 Honors & Awards SSG Group Recognition Award Intel Software & Services Group December 2011 Android Ice Cream Sandwich bring-up in just 26 hours Intel Achievement Award Intel Corporation May 2014 This award is given to less than 1% of Intel's world-wide population annually. It is Intel's highest honor that an individual or team can earn, recognizing innovation and results that have the greatest impact to Intel's business priorities. I was part of a team that earned this award in recognition of efforts to drive innovation and performance on Intel Architecture Chromebooks, thus enabling a significant recapturing of market share in this segment. SSG Group Recognition Award Intel Software & Services Group June 2014 24/7 Support to Enable Baytrail Chromebook Launch SSG Group Recognition Award Intel Software & Services Group December 2011 Android Ice Cream Sandwich bring-up in just 26 hours SSG Group Recognition Award Intel Software & Services Group December 2011 Android Ice Cream Sandwich bring-up in just 26 hours SSG Group Recognition Award Intel Software & Services Group December 2011 Android Ice Cream Sandwich bring-up in just 26 hours Intel Achievement Award Intel Corporation May 2014 This award is given to less than 1% of Intel's world-wide population annually. It is Intel's highest honor that an individual or team can earn, recognizing innovation and results that have the greatest impact to Intel's business priorities. I was part of a team that earned this award in recognition of efforts to drive innovation and performance on Intel Architecture Chromebooks, thus enabling a significant recapturing of market share in this segment. Intel Achievement Award Intel Corporation May 2014 This award is given to less than 1% of Intel's world-wide population annually. It is Intel's highest honor that an individual or team can earn, recognizing innovation and results that have the greatest impact to Intel's business priorities. I was part of a team that earned this award in recognition of efforts to drive innovation and performance on Intel Architecture Chromebooks, thus enabling a significant recapturing of market share in this segment. Intel Achievement Award Intel Corporation May 2014 This award is given to less than 1% of Intel's world-wide population annually. It is Intel's highest honor that an individual or team can earn, recognizing innovation and results that have the greatest impact to Intel's business priorities. I was part of a team that earned this award in recognition of efforts to drive innovation and performance on Intel Architecture Chromebooks, thus enabling a significant recapturing of market share in this segment. SSG Group Recognition Award Intel Software & Services Group June 2014 24/7 Support to Enable Baytrail Chromebook Launch SSG Group Recognition Award Intel Software & Services Group June 2014 24/7 Support to Enable Baytrail Chromebook Launch SSG Group Recognition Award Intel Software & Services Group June 2014 24/7 Support to Enable Baytrail Chromebook Launch ", "Summary Accomplished embedded software engineer and technical leader leveraging a wealth of experience leading the design, development, verification and production of real-time software and firmware for innovative, cutting edge products. Brings extensive system knowledge and full product lifecycle expertise to enable successful product commercialization. An innovative problem solver, leader and facilitator with a proven track record of driving efficiencies and increasing overall productivity. Areas of expertise include:  \n \nFull Lifecycle Software Development, Agile Development, Software Design & Development, Software Management, Silicon Validation, Build Management, Process Driven Software Development, Software Debugging, Root Cause Analysis \n Summary Accomplished embedded software engineer and technical leader leveraging a wealth of experience leading the design, development, verification and production of real-time software and firmware for innovative, cutting edge products. Brings extensive system knowledge and full product lifecycle expertise to enable successful product commercialization. An innovative problem solver, leader and facilitator with a proven track record of driving efficiencies and increasing overall productivity. Areas of expertise include:  \n \nFull Lifecycle Software Development, Agile Development, Software Design & Development, Software Management, Silicon Validation, Build Management, Process Driven Software Development, Software Debugging, Root Cause Analysis \n Accomplished embedded software engineer and technical leader leveraging a wealth of experience leading the design, development, verification and production of real-time software and firmware for innovative, cutting edge products. Brings extensive system knowledge and full product lifecycle expertise to enable successful product commercialization. An innovative problem solver, leader and facilitator with a proven track record of driving efficiencies and increasing overall productivity. Areas of expertise include:  \n \nFull Lifecycle Software Development, Agile Development, Software Design & Development, Software Management, Silicon Validation, Build Management, Process Driven Software Development, Software Debugging, Root Cause Analysis \n Accomplished embedded software engineer and technical leader leveraging a wealth of experience leading the design, development, verification and production of real-time software and firmware for innovative, cutting edge products. Brings extensive system knowledge and full product lifecycle expertise to enable successful product commercialization. An innovative problem solver, leader and facilitator with a proven track record of driving efficiencies and increasing overall productivity. Areas of expertise include:  \n \nFull Lifecycle Software Development, Agile Development, Software Design & Development, Software Management, Silicon Validation, Build Management, Process Driven Software Development, Software Debugging, Root Cause Analysis \n Experience Senior Software Engineer Intel Corporation January 2015  –  July 2015  (7 months) Chandler, AZ Senior Software Engineer - Internet of Things Group – Industrial Gateway Support Team (2015) \nLeveraged technical expertise, including vast knowledge of the REST APIs for the Intel® Trend Analytics Software, to provide customer support for Internet of Things Group (IoTG) Industrial Gateway Products. \n\tDeveloped and edited customer facing documentation detailing the REST APIs for the Intel® Trend Analytics Software cloud server. \n\tTracked, debugged, resolved, and reported customer build issues related to building Wind River 5 (Linux) images for use on the IoTG Industrial Gateway Products. \n\tIntroduced procedures that enabled the Intel Support Team to dramatically improve Service Level Agreement (SLA) metrics with regard to ticket response times. \n\tUndertook ownership of customer accounts that were not meeting SLA targets. Worked closely with IoTG customer, Daikin, and the Intel support organization to update processes that enabled over 80% of backlogged trouble tickets to be resolved. \n Software Engineering Manager Intel Corporation June 2011  –  January 2015  (3 years 8 months) Chandler, AZ Software Engineering Manager - Service Provider Division (SPD) – Gateway and Streaming Media Drivers Team (2011-2015) \nLed, mentored, and developed the Streaming Media Drivers team; grew team from six to 37 in three years (11 full time regular employees and 26 contingent workers). Coordinated team Engineering Change Requests (ECR) reviews for product releases; worked with the team to understand the capacity for new feature development, bug fixing, direct customer support, etc.  \n\tCollaborated with various Product Development Teams (PDT) to prioritize new feature requests and develop a cross PDT priority roadmap.  \n\tTook on leadership role for a team with 230 open bugs, prioritized bug reduction through effective use of bug scrubs and reviews; worked closely with the team to reduce the open bug count by 65%+ in three years. \n\tEvaluated team performance, identified process bottlenecks, and developed mitigation plans. Provided performance-shaping feedback on an individual and team basis. \n Senior Software Engineer Intel Corporation October 2007  –  June 2011  (3 years 9 months) Chandler, AZ Senior Software Engineer - Service Provider Division (SPD) – Streaming Media Drivers (SMD) (2007-2011) \nProvided technical project leadership to drive the development and integration of the Transport Stream Demux (TSD), a brand new hardware device that utilized a Linux device driver and a firmware that operated the custom hardware accelerator. Partnered with product leaders to identify software requirement and map tasks required to complete the project. \n\tImplemented an Agile development methodology and a unique pre-silicon test environment enabling the team to successfully deliver a fully functional driver and firmware in time for the first silicon bring-up, which exceeded all quality expectations, both in terms of data throughput and reliability of the software. \no\tDeveloped a detailed project schedule and tracked milestone delivery progress on a weekly basis.  \no\tDeveloped several specific parts of the TSD firmware including the hardware access layer and section filtering modules.  \no\tWrote unit level tests to validate new TSD modules which were subsequently heavily tested in a pre-Si environment.  \n\tDeveloped and maintained legacy driver components in the Streaming Media Drivers (SMD) software stack including the platform abstraction layer (PAL), operating system abstraction layer (OSAL) and the legacy TSD. \no\tPartnered with the Service Provide Division build team, as the SMD liaison, to understand how changes to the build system impacted developers. \no\tPerformed build related updates to SMD software components. Ran daily test builds of the SMD software stack to verify its health and correct problems causing build failures.  \no\tDeveloped processes and scripts to simplify use of the build system saving each developer hours of work per week. \n BIOS Validation Team Lead Intel Corporation June 2006  –  October 2007  (1 year 5 months) Chandler, AZ BIOS Design Verification Team Lead - Digital Enterprise Group – BIOS Design Verification (2006-2007) \nLed the BIOS Design Verification (DV) Team; prioritized and distributed work to ensure all projects were delivered on time.  \n\tImplemented processes and documentation templates used in BIOS verification engagements.  \no\tLed the team in a Design Verification pilot project to fine tune processes. Established performance metrics to track and report the DV team’s progress to management on a weekly basis.  \n\tIdentified and commandeered lab space for use by the DV team. Coordinated with building facilities team to retrofit the lab space. Tracked hardware pedigree for lab systems and arranged for hardware to be upgraded as required to support testing of the latest silicon releases. \n \nBIOS Design Verification Tester: \nDeveloped tests and test processes for the BIOS Design Verification (DV) Team. Developed test plans for testing Compatibility Validation and Silicon Validation BIOS releases. Executed tests on numerous BIOS releases.  \n\tPerformed testing on hardware platforms and in a Pre-Silicon emulation environment. Reported test results and logged all test failures in the bug tracking system. Verified bug fixes and updated bug reports.  \n\tCoordinated with BIOS engineers to run specific focused tests to identify root cause problems in the BIOS. \n Senior Validation Engineer Intel Corporation June 2004  –  June 2006  (2 years 1 month) Chandler, AZ Validation Engineer & Lead for Monahans Products - Intel Mobility Group – Platform Validation Engineering (2004-2006) \nProvided expertise to validate Monhans-P (MH-P) and MH-L/LV products (PDA and cell phone processors).  \n\tScheduled and planned concurrent validation testing for the MH-L/LV programs (pre and post Si). Identified test coverage requirements for MH-L/LV products.  \n\tDrove synergies with the focus test organization to share test software. \n\tSupported modifications to legacy code used to test the MH-P LCD controller. \n\tDeveloped both pre-Si and post-Si validation tests for a NAND Flash controller and a 2D Graphics Control Unit. \n\tSet up logic analyzer triggers and used the resulting captured waveforms to identify root cause device under test (DUT) and test software issues. \n\tDeveloped and validated software workarounds to DUT issues. Tested design changes resulting from DUT issues found in pre and post Si testing. \n Senior Software Engineer Intel Corporation February 1994  –  June 2004  (10 years 5 months) Chandler, AZ Other Intel Contributions: \n \nPCA Dev Kit Program Manager - Cellular & Handheld Group (formerly WCCG) – Group Marketing (2001-2004) \n \nFirmware Team Lead - Connected Products Division (CPD) – Audio Engineering Team (2000-2001) \nSenior Software Engineer - Components Automation Systems (CAS) – Automation Platform Systems Group (1999-2000) \n \nGroup Leader - Components Automation Systems (CAS) – Fab Station Controller Group (1997-1999) \n \nSenior Software Engineer - Components Automation Systems (CAS) – Fab Station Controller Group (1994-1997) \n Software Engineer Synergy Microsystems June 1992  –  February 1994  (1 year 9 months) Tucson, Arizona Embedded sofware development. Device drivers for pSOS board support package. Software Engineer United States Air Force - Civilian Contractor January 1988  –  June 1992  (4 years 6 months) William AFB, Arizona Developed software in support of flight simulation training systems. Radar, flight dynamics, Head-up-Display, navigation system and engine simulation software. Software Engineer Motorola June 1986  –  January 1988  (1 year 8 months) Phoenix, Arizona Customer support for VersaDOS real-time operating system. Senior Software Engineer Intel Corporation January 2015  –  July 2015  (7 months) Chandler, AZ Senior Software Engineer - Internet of Things Group – Industrial Gateway Support Team (2015) \nLeveraged technical expertise, including vast knowledge of the REST APIs for the Intel® Trend Analytics Software, to provide customer support for Internet of Things Group (IoTG) Industrial Gateway Products. \n\tDeveloped and edited customer facing documentation detailing the REST APIs for the Intel® Trend Analytics Software cloud server. \n\tTracked, debugged, resolved, and reported customer build issues related to building Wind River 5 (Linux) images for use on the IoTG Industrial Gateway Products. \n\tIntroduced procedures that enabled the Intel Support Team to dramatically improve Service Level Agreement (SLA) metrics with regard to ticket response times. \n\tUndertook ownership of customer accounts that were not meeting SLA targets. Worked closely with IoTG customer, Daikin, and the Intel support organization to update processes that enabled over 80% of backlogged trouble tickets to be resolved. \n Senior Software Engineer Intel Corporation January 2015  –  July 2015  (7 months) Chandler, AZ Senior Software Engineer - Internet of Things Group – Industrial Gateway Support Team (2015) \nLeveraged technical expertise, including vast knowledge of the REST APIs for the Intel® Trend Analytics Software, to provide customer support for Internet of Things Group (IoTG) Industrial Gateway Products. \n\tDeveloped and edited customer facing documentation detailing the REST APIs for the Intel® Trend Analytics Software cloud server. \n\tTracked, debugged, resolved, and reported customer build issues related to building Wind River 5 (Linux) images for use on the IoTG Industrial Gateway Products. \n\tIntroduced procedures that enabled the Intel Support Team to dramatically improve Service Level Agreement (SLA) metrics with regard to ticket response times. \n\tUndertook ownership of customer accounts that were not meeting SLA targets. Worked closely with IoTG customer, Daikin, and the Intel support organization to update processes that enabled over 80% of backlogged trouble tickets to be resolved. \n Software Engineering Manager Intel Corporation June 2011  –  January 2015  (3 years 8 months) Chandler, AZ Software Engineering Manager - Service Provider Division (SPD) – Gateway and Streaming Media Drivers Team (2011-2015) \nLed, mentored, and developed the Streaming Media Drivers team; grew team from six to 37 in three years (11 full time regular employees and 26 contingent workers). Coordinated team Engineering Change Requests (ECR) reviews for product releases; worked with the team to understand the capacity for new feature development, bug fixing, direct customer support, etc.  \n\tCollaborated with various Product Development Teams (PDT) to prioritize new feature requests and develop a cross PDT priority roadmap.  \n\tTook on leadership role for a team with 230 open bugs, prioritized bug reduction through effective use of bug scrubs and reviews; worked closely with the team to reduce the open bug count by 65%+ in three years. \n\tEvaluated team performance, identified process bottlenecks, and developed mitigation plans. Provided performance-shaping feedback on an individual and team basis. \n Software Engineering Manager Intel Corporation June 2011  –  January 2015  (3 years 8 months) Chandler, AZ Software Engineering Manager - Service Provider Division (SPD) – Gateway and Streaming Media Drivers Team (2011-2015) \nLed, mentored, and developed the Streaming Media Drivers team; grew team from six to 37 in three years (11 full time regular employees and 26 contingent workers). Coordinated team Engineering Change Requests (ECR) reviews for product releases; worked with the team to understand the capacity for new feature development, bug fixing, direct customer support, etc.  \n\tCollaborated with various Product Development Teams (PDT) to prioritize new feature requests and develop a cross PDT priority roadmap.  \n\tTook on leadership role for a team with 230 open bugs, prioritized bug reduction through effective use of bug scrubs and reviews; worked closely with the team to reduce the open bug count by 65%+ in three years. \n\tEvaluated team performance, identified process bottlenecks, and developed mitigation plans. Provided performance-shaping feedback on an individual and team basis. \n Senior Software Engineer Intel Corporation October 2007  –  June 2011  (3 years 9 months) Chandler, AZ Senior Software Engineer - Service Provider Division (SPD) – Streaming Media Drivers (SMD) (2007-2011) \nProvided technical project leadership to drive the development and integration of the Transport Stream Demux (TSD), a brand new hardware device that utilized a Linux device driver and a firmware that operated the custom hardware accelerator. Partnered with product leaders to identify software requirement and map tasks required to complete the project. \n\tImplemented an Agile development methodology and a unique pre-silicon test environment enabling the team to successfully deliver a fully functional driver and firmware in time for the first silicon bring-up, which exceeded all quality expectations, both in terms of data throughput and reliability of the software. \no\tDeveloped a detailed project schedule and tracked milestone delivery progress on a weekly basis.  \no\tDeveloped several specific parts of the TSD firmware including the hardware access layer and section filtering modules.  \no\tWrote unit level tests to validate new TSD modules which were subsequently heavily tested in a pre-Si environment.  \n\tDeveloped and maintained legacy driver components in the Streaming Media Drivers (SMD) software stack including the platform abstraction layer (PAL), operating system abstraction layer (OSAL) and the legacy TSD. \no\tPartnered with the Service Provide Division build team, as the SMD liaison, to understand how changes to the build system impacted developers. \no\tPerformed build related updates to SMD software components. Ran daily test builds of the SMD software stack to verify its health and correct problems causing build failures.  \no\tDeveloped processes and scripts to simplify use of the build system saving each developer hours of work per week. \n Senior Software Engineer Intel Corporation October 2007  –  June 2011  (3 years 9 months) Chandler, AZ Senior Software Engineer - Service Provider Division (SPD) – Streaming Media Drivers (SMD) (2007-2011) \nProvided technical project leadership to drive the development and integration of the Transport Stream Demux (TSD), a brand new hardware device that utilized a Linux device driver and a firmware that operated the custom hardware accelerator. Partnered with product leaders to identify software requirement and map tasks required to complete the project. \n\tImplemented an Agile development methodology and a unique pre-silicon test environment enabling the team to successfully deliver a fully functional driver and firmware in time for the first silicon bring-up, which exceeded all quality expectations, both in terms of data throughput and reliability of the software. \no\tDeveloped a detailed project schedule and tracked milestone delivery progress on a weekly basis.  \no\tDeveloped several specific parts of the TSD firmware including the hardware access layer and section filtering modules.  \no\tWrote unit level tests to validate new TSD modules which were subsequently heavily tested in a pre-Si environment.  \n\tDeveloped and maintained legacy driver components in the Streaming Media Drivers (SMD) software stack including the platform abstraction layer (PAL), operating system abstraction layer (OSAL) and the legacy TSD. \no\tPartnered with the Service Provide Division build team, as the SMD liaison, to understand how changes to the build system impacted developers. \no\tPerformed build related updates to SMD software components. Ran daily test builds of the SMD software stack to verify its health and correct problems causing build failures.  \no\tDeveloped processes and scripts to simplify use of the build system saving each developer hours of work per week. \n BIOS Validation Team Lead Intel Corporation June 2006  –  October 2007  (1 year 5 months) Chandler, AZ BIOS Design Verification Team Lead - Digital Enterprise Group – BIOS Design Verification (2006-2007) \nLed the BIOS Design Verification (DV) Team; prioritized and distributed work to ensure all projects were delivered on time.  \n\tImplemented processes and documentation templates used in BIOS verification engagements.  \no\tLed the team in a Design Verification pilot project to fine tune processes. Established performance metrics to track and report the DV team’s progress to management on a weekly basis.  \n\tIdentified and commandeered lab space for use by the DV team. Coordinated with building facilities team to retrofit the lab space. Tracked hardware pedigree for lab systems and arranged for hardware to be upgraded as required to support testing of the latest silicon releases. \n \nBIOS Design Verification Tester: \nDeveloped tests and test processes for the BIOS Design Verification (DV) Team. Developed test plans for testing Compatibility Validation and Silicon Validation BIOS releases. Executed tests on numerous BIOS releases.  \n\tPerformed testing on hardware platforms and in a Pre-Silicon emulation environment. Reported test results and logged all test failures in the bug tracking system. Verified bug fixes and updated bug reports.  \n\tCoordinated with BIOS engineers to run specific focused tests to identify root cause problems in the BIOS. \n BIOS Validation Team Lead Intel Corporation June 2006  –  October 2007  (1 year 5 months) Chandler, AZ BIOS Design Verification Team Lead - Digital Enterprise Group – BIOS Design Verification (2006-2007) \nLed the BIOS Design Verification (DV) Team; prioritized and distributed work to ensure all projects were delivered on time.  \n\tImplemented processes and documentation templates used in BIOS verification engagements.  \no\tLed the team in a Design Verification pilot project to fine tune processes. Established performance metrics to track and report the DV team’s progress to management on a weekly basis.  \n\tIdentified and commandeered lab space for use by the DV team. Coordinated with building facilities team to retrofit the lab space. Tracked hardware pedigree for lab systems and arranged for hardware to be upgraded as required to support testing of the latest silicon releases. \n \nBIOS Design Verification Tester: \nDeveloped tests and test processes for the BIOS Design Verification (DV) Team. Developed test plans for testing Compatibility Validation and Silicon Validation BIOS releases. Executed tests on numerous BIOS releases.  \n\tPerformed testing on hardware platforms and in a Pre-Silicon emulation environment. Reported test results and logged all test failures in the bug tracking system. Verified bug fixes and updated bug reports.  \n\tCoordinated with BIOS engineers to run specific focused tests to identify root cause problems in the BIOS. \n Senior Validation Engineer Intel Corporation June 2004  –  June 2006  (2 years 1 month) Chandler, AZ Validation Engineer & Lead for Monahans Products - Intel Mobility Group – Platform Validation Engineering (2004-2006) \nProvided expertise to validate Monhans-P (MH-P) and MH-L/LV products (PDA and cell phone processors).  \n\tScheduled and planned concurrent validation testing for the MH-L/LV programs (pre and post Si). Identified test coverage requirements for MH-L/LV products.  \n\tDrove synergies with the focus test organization to share test software. \n\tSupported modifications to legacy code used to test the MH-P LCD controller. \n\tDeveloped both pre-Si and post-Si validation tests for a NAND Flash controller and a 2D Graphics Control Unit. \n\tSet up logic analyzer triggers and used the resulting captured waveforms to identify root cause device under test (DUT) and test software issues. \n\tDeveloped and validated software workarounds to DUT issues. Tested design changes resulting from DUT issues found in pre and post Si testing. \n Senior Validation Engineer Intel Corporation June 2004  –  June 2006  (2 years 1 month) Chandler, AZ Validation Engineer & Lead for Monahans Products - Intel Mobility Group – Platform Validation Engineering (2004-2006) \nProvided expertise to validate Monhans-P (MH-P) and MH-L/LV products (PDA and cell phone processors).  \n\tScheduled and planned concurrent validation testing for the MH-L/LV programs (pre and post Si). Identified test coverage requirements for MH-L/LV products.  \n\tDrove synergies with the focus test organization to share test software. \n\tSupported modifications to legacy code used to test the MH-P LCD controller. \n\tDeveloped both pre-Si and post-Si validation tests for a NAND Flash controller and a 2D Graphics Control Unit. \n\tSet up logic analyzer triggers and used the resulting captured waveforms to identify root cause device under test (DUT) and test software issues. \n\tDeveloped and validated software workarounds to DUT issues. Tested design changes resulting from DUT issues found in pre and post Si testing. \n Senior Software Engineer Intel Corporation February 1994  –  June 2004  (10 years 5 months) Chandler, AZ Other Intel Contributions: \n \nPCA Dev Kit Program Manager - Cellular & Handheld Group (formerly WCCG) – Group Marketing (2001-2004) \n \nFirmware Team Lead - Connected Products Division (CPD) – Audio Engineering Team (2000-2001) \nSenior Software Engineer - Components Automation Systems (CAS) – Automation Platform Systems Group (1999-2000) \n \nGroup Leader - Components Automation Systems (CAS) – Fab Station Controller Group (1997-1999) \n \nSenior Software Engineer - Components Automation Systems (CAS) – Fab Station Controller Group (1994-1997) \n Senior Software Engineer Intel Corporation February 1994  –  June 2004  (10 years 5 months) Chandler, AZ Other Intel Contributions: \n \nPCA Dev Kit Program Manager - Cellular & Handheld Group (formerly WCCG) – Group Marketing (2001-2004) \n \nFirmware Team Lead - Connected Products Division (CPD) – Audio Engineering Team (2000-2001) \nSenior Software Engineer - Components Automation Systems (CAS) – Automation Platform Systems Group (1999-2000) \n \nGroup Leader - Components Automation Systems (CAS) – Fab Station Controller Group (1997-1999) \n \nSenior Software Engineer - Components Automation Systems (CAS) – Fab Station Controller Group (1994-1997) \n Software Engineer Synergy Microsystems June 1992  –  February 1994  (1 year 9 months) Tucson, Arizona Embedded sofware development. Device drivers for pSOS board support package. Software Engineer Synergy Microsystems June 1992  –  February 1994  (1 year 9 months) Tucson, Arizona Embedded sofware development. Device drivers for pSOS board support package. Software Engineer United States Air Force - Civilian Contractor January 1988  –  June 1992  (4 years 6 months) William AFB, Arizona Developed software in support of flight simulation training systems. Radar, flight dynamics, Head-up-Display, navigation system and engine simulation software. Software Engineer United States Air Force - Civilian Contractor January 1988  –  June 1992  (4 years 6 months) William AFB, Arizona Developed software in support of flight simulation training systems. Radar, flight dynamics, Head-up-Display, navigation system and engine simulation software. Software Engineer Motorola June 1986  –  January 1988  (1 year 8 months) Phoenix, Arizona Customer support for VersaDOS real-time operating system. Software Engineer Motorola June 1986  –  January 1988  (1 year 8 months) Phoenix, Arizona Customer support for VersaDOS real-time operating system. Skills Sofware Development Software Project... Software Documentation Software Engineering Device Drivers Linux Embedded Linux Embedded Systems Embedded Software Embedded C Embedded Operating... Firmware Customer Support Troubleshooting Debugging Software Design Software Development Testing C See 4+     See less Skills  Sofware Development Software Project... Software Documentation Software Engineering Device Drivers Linux Embedded Linux Embedded Systems Embedded Software Embedded C Embedded Operating... Firmware Customer Support Troubleshooting Debugging Software Design Software Development Testing C See 4+     See less Sofware Development Software Project... Software Documentation Software Engineering Device Drivers Linux Embedded Linux Embedded Systems Embedded Software Embedded C Embedded Operating... Firmware Customer Support Troubleshooting Debugging Software Design Software Development Testing C See 4+     See less Sofware Development Software Project... Software Documentation Software Engineering Device Drivers Linux Embedded Linux Embedded Systems Embedded Software Embedded C Embedded Operating... Firmware Customer Support Troubleshooting Debugging Software Design Software Development Testing C See 4+     See less Education University of Michigan Bachelor’s Degree,  Computer Science 1982  – 1986 University of Michigan Bachelor’s Degree,  Computer Science 1982  – 1986 University of Michigan Bachelor’s Degree,  Computer Science 1982  – 1986 University of Michigan Bachelor’s Degree,  Computer Science 1982  – 1986 ", "Summary Detail oriented and responsible technical professional with 18+ years of professional experience in areas of embedded development, system software development, and system design. Summary Detail oriented and responsible technical professional with 18+ years of professional experience in areas of embedded development, system software development, and system design. Detail oriented and responsible technical professional with 18+ years of professional experience in areas of embedded development, system software development, and system design. Detail oriented and responsible technical professional with 18+ years of professional experience in areas of embedded development, system software development, and system design. Experience Firmware Architect Micron Technology July 2014  – Present (1 year 2 months) Working for validation team on infrastructure software, firmware, and driver tools for the SATA, SAS, and PCIe based Solid State Disks. Currently focused on developing a methodology/design for collecting code coverage statistics for SSD FW and validation suites. Software Architect Intel Corporation October 2010  –  April 2014  (3 years 7 months) Worked as a FW/SW Architect for the Intel chipset team tasked with leading the FW/SW/BIOS/Tools architecture for the integrated clock controller (supporting overclocking) and high-speed I/O configuration. In addition supported advanced development of energy reporting tools associated with the PCH chipset. Senior Software Engineer Intel Corporation January 2009  –  October 2010  (1 year 10 months) Worked as a FW engineer on the second generation SSD with a focus on the block defect management. Supported validation/test providing source level host SATA driver support and improving the SSD failure analysis. Senior Software Engineer Intel Corporation July 2004  –  2008  (4 years) Technical leader on the chipset's Manageability Engine (ME), responsible for the ROM based FW, design of the boot flow, root of trust design, build infrastructure, and debug test tools. Lead the ME ROM design and porting for five generations of desktop, mobile, and server chipsets. This included incorporating huffman and lzma decompression, memory paging, architectural re-partitioning, and ROM based libraries. Senior Software Engineer Intel Corporation September 2002  –  July 2004  (1 year 11 months) Responsible for architectural design and implementation of the Int13h option ROM used for the IAA RAID edition product. This included design of the user interface, BIOS option ROM infrastructure, and build release methodology. In addition, served as a technical lead on the option ROM, directing other team members on testing design and trouble shooting techniques. Option ROM design was ported and reused for multiple chipset generations utilizing legacy BIOS. Senior Software Engineer Intel Corporation 2002  –  2003  (1 year) Provided driver and development support of the Microsoft USB driver stack to the Intel HW and validation teams to support Intel's 1st generation USB2 EHCI controller and to develop a fully compatible Microsoft USB driver. Senior Software Engineer Intel Corporation 2000  –  2002  (2 years) Worked in the Desktop Products Group's Systems Software Engineering group developing operating system drivers for Intel's chipsets. Primary developer for the SMBus driver used by the LAN and platform groups within the corporation. Drivers were developed for Window9x, NT and XP. In addition provided the software installers, customer documentation, and designed/implemented the validation suites along with the drivers. Software Architect Intel Corporation 1999  –  2000  (1 year) Worked in the Flash Products Division designing and developing the Intel Persistent Storage Manager (IPSM). This was an installable flash filesystem for WindowsCE and provided as reference code and platform specific libraries. In addition developed the BSP capabilities to allow for booting WindowsCE using execute in place and minimal SRAM based handlers that swapped out kernel while flash programming and erase operations completed. System Architect Intel Corporation 1995  –  1998  (3 years) Folsom Worked in the Flash Products Division supporting lab, firmware, and system debugging on the PCMCIA Intel Flash drive. Developed a BIOS option ROM capable of booting OS using flash memory. Developed a NOR based flash memory manager (FMM) for use in platform BIOS. Integrated the FMM for use in VxWorks operating system. Developed an Altera PLD based PCI add-in adapter that was used to extend platform flash storage and enable symmetrical flash BIOS and option ROM development. Developed initial designs for a BIOS protected boot framework and flash based protection mechanisms. Firmware Architect Micron Technology July 2014  – Present (1 year 2 months) Working for validation team on infrastructure software, firmware, and driver tools for the SATA, SAS, and PCIe based Solid State Disks. Currently focused on developing a methodology/design for collecting code coverage statistics for SSD FW and validation suites. Firmware Architect Micron Technology July 2014  – Present (1 year 2 months) Working for validation team on infrastructure software, firmware, and driver tools for the SATA, SAS, and PCIe based Solid State Disks. Currently focused on developing a methodology/design for collecting code coverage statistics for SSD FW and validation suites. Software Architect Intel Corporation October 2010  –  April 2014  (3 years 7 months) Worked as a FW/SW Architect for the Intel chipset team tasked with leading the FW/SW/BIOS/Tools architecture for the integrated clock controller (supporting overclocking) and high-speed I/O configuration. In addition supported advanced development of energy reporting tools associated with the PCH chipset. Software Architect Intel Corporation October 2010  –  April 2014  (3 years 7 months) Worked as a FW/SW Architect for the Intel chipset team tasked with leading the FW/SW/BIOS/Tools architecture for the integrated clock controller (supporting overclocking) and high-speed I/O configuration. In addition supported advanced development of energy reporting tools associated with the PCH chipset. Senior Software Engineer Intel Corporation January 2009  –  October 2010  (1 year 10 months) Worked as a FW engineer on the second generation SSD with a focus on the block defect management. Supported validation/test providing source level host SATA driver support and improving the SSD failure analysis. Senior Software Engineer Intel Corporation January 2009  –  October 2010  (1 year 10 months) Worked as a FW engineer on the second generation SSD with a focus on the block defect management. Supported validation/test providing source level host SATA driver support and improving the SSD failure analysis. Senior Software Engineer Intel Corporation July 2004  –  2008  (4 years) Technical leader on the chipset's Manageability Engine (ME), responsible for the ROM based FW, design of the boot flow, root of trust design, build infrastructure, and debug test tools. Lead the ME ROM design and porting for five generations of desktop, mobile, and server chipsets. This included incorporating huffman and lzma decompression, memory paging, architectural re-partitioning, and ROM based libraries. Senior Software Engineer Intel Corporation July 2004  –  2008  (4 years) Technical leader on the chipset's Manageability Engine (ME), responsible for the ROM based FW, design of the boot flow, root of trust design, build infrastructure, and debug test tools. Lead the ME ROM design and porting for five generations of desktop, mobile, and server chipsets. This included incorporating huffman and lzma decompression, memory paging, architectural re-partitioning, and ROM based libraries. Senior Software Engineer Intel Corporation September 2002  –  July 2004  (1 year 11 months) Responsible for architectural design and implementation of the Int13h option ROM used for the IAA RAID edition product. This included design of the user interface, BIOS option ROM infrastructure, and build release methodology. In addition, served as a technical lead on the option ROM, directing other team members on testing design and trouble shooting techniques. Option ROM design was ported and reused for multiple chipset generations utilizing legacy BIOS. Senior Software Engineer Intel Corporation September 2002  –  July 2004  (1 year 11 months) Responsible for architectural design and implementation of the Int13h option ROM used for the IAA RAID edition product. This included design of the user interface, BIOS option ROM infrastructure, and build release methodology. In addition, served as a technical lead on the option ROM, directing other team members on testing design and trouble shooting techniques. Option ROM design was ported and reused for multiple chipset generations utilizing legacy BIOS. Senior Software Engineer Intel Corporation 2002  –  2003  (1 year) Provided driver and development support of the Microsoft USB driver stack to the Intel HW and validation teams to support Intel's 1st generation USB2 EHCI controller and to develop a fully compatible Microsoft USB driver. Senior Software Engineer Intel Corporation 2002  –  2003  (1 year) Provided driver and development support of the Microsoft USB driver stack to the Intel HW and validation teams to support Intel's 1st generation USB2 EHCI controller and to develop a fully compatible Microsoft USB driver. Senior Software Engineer Intel Corporation 2000  –  2002  (2 years) Worked in the Desktop Products Group's Systems Software Engineering group developing operating system drivers for Intel's chipsets. Primary developer for the SMBus driver used by the LAN and platform groups within the corporation. Drivers were developed for Window9x, NT and XP. In addition provided the software installers, customer documentation, and designed/implemented the validation suites along with the drivers. Senior Software Engineer Intel Corporation 2000  –  2002  (2 years) Worked in the Desktop Products Group's Systems Software Engineering group developing operating system drivers for Intel's chipsets. Primary developer for the SMBus driver used by the LAN and platform groups within the corporation. Drivers were developed for Window9x, NT and XP. In addition provided the software installers, customer documentation, and designed/implemented the validation suites along with the drivers. Software Architect Intel Corporation 1999  –  2000  (1 year) Worked in the Flash Products Division designing and developing the Intel Persistent Storage Manager (IPSM). This was an installable flash filesystem for WindowsCE and provided as reference code and platform specific libraries. In addition developed the BSP capabilities to allow for booting WindowsCE using execute in place and minimal SRAM based handlers that swapped out kernel while flash programming and erase operations completed. Software Architect Intel Corporation 1999  –  2000  (1 year) Worked in the Flash Products Division designing and developing the Intel Persistent Storage Manager (IPSM). This was an installable flash filesystem for WindowsCE and provided as reference code and platform specific libraries. In addition developed the BSP capabilities to allow for booting WindowsCE using execute in place and minimal SRAM based handlers that swapped out kernel while flash programming and erase operations completed. System Architect Intel Corporation 1995  –  1998  (3 years) Folsom Worked in the Flash Products Division supporting lab, firmware, and system debugging on the PCMCIA Intel Flash drive. Developed a BIOS option ROM capable of booting OS using flash memory. Developed a NOR based flash memory manager (FMM) for use in platform BIOS. Integrated the FMM for use in VxWorks operating system. Developed an Altera PLD based PCI add-in adapter that was used to extend platform flash storage and enable symmetrical flash BIOS and option ROM development. Developed initial designs for a BIOS protected boot framework and flash based protection mechanisms. System Architect Intel Corporation 1995  –  1998  (3 years) Folsom Worked in the Flash Products Division supporting lab, firmware, and system debugging on the PCMCIA Intel Flash drive. Developed a BIOS option ROM capable of booting OS using flash memory. Developed a NOR based flash memory manager (FMM) for use in platform BIOS. Integrated the FMM for use in VxWorks operating system. Developed an Altera PLD based PCI add-in adapter that was used to extend platform flash storage and enable symmetrical flash BIOS and option ROM development. Developed initial designs for a BIOS protected boot framework and flash based protection mechanisms. Skills Firmware Embedded Systems Device Drivers Debugging USB Testing Kernel Software Development Operating Systems SATA Skills  Firmware Embedded Systems Device Drivers Debugging USB Testing Kernel Software Development Operating Systems SATA Firmware Embedded Systems Device Drivers Debugging USB Testing Kernel Software Development Operating Systems SATA Firmware Embedded Systems Device Drivers Debugging USB Testing Kernel Software Development Operating Systems SATA Education California State University-Sacramento Bachelor of Science (BS),  Computer Engineering , ~3.7/4.00 1991  – 1996 Dean's Honor Role: 1991-1996 California State University-Sacramento Bachelor of Science (BS),  Computer Engineering , ~3.7/4.00 1991  – 1996 Dean's Honor Role: 1991-1996 California State University-Sacramento Bachelor of Science (BS),  Computer Engineering , ~3.7/4.00 1991  – 1996 Dean's Honor Role: 1991-1996 California State University-Sacramento Bachelor of Science (BS),  Computer Engineering , ~3.7/4.00 1991  – 1996 Dean's Honor Role: 1991-1996 ", "Summary Programming Background: \nApplication Developing in C, SMS Installer, Visual Basic 6, Visual Basic .NET, Database, DOS, and project management in a wide variety of applications and hotfixes. Have knowledge in Windows 2000, Windows XP in dealing with imaging and OS automation. Working in SOL and IDE-R with the OS using AMT (Active Management Technology) with Altiris, SMS, and Landesk. Specialties:OS rebuilds, SOL and IDE-R with AMT, Application Coding Summary Programming Background: \nApplication Developing in C, SMS Installer, Visual Basic 6, Visual Basic .NET, Database, DOS, and project management in a wide variety of applications and hotfixes. Have knowledge in Windows 2000, Windows XP in dealing with imaging and OS automation. Working in SOL and IDE-R with the OS using AMT (Active Management Technology) with Altiris, SMS, and Landesk. Specialties:OS rebuilds, SOL and IDE-R with AMT, Application Coding Programming Background: \nApplication Developing in C, SMS Installer, Visual Basic 6, Visual Basic .NET, Database, DOS, and project management in a wide variety of applications and hotfixes. Have knowledge in Windows 2000, Windows XP in dealing with imaging and OS automation. Working in SOL and IDE-R with the OS using AMT (Active Management Technology) with Altiris, SMS, and Landesk. Specialties:OS rebuilds, SOL and IDE-R with AMT, Application Coding Programming Background: \nApplication Developing in C, SMS Installer, Visual Basic 6, Visual Basic .NET, Database, DOS, and project management in a wide variety of applications and hotfixes. Have knowledge in Windows 2000, Windows XP in dealing with imaging and OS automation. Working in SOL and IDE-R with the OS using AMT (Active Management Technology) with Altiris, SMS, and Landesk. Specialties:OS rebuilds, SOL and IDE-R with AMT, Application Coding Experience Software Engineer Intel Senior Software Engineer Intel Corporation February 2008  – Present (7 years 7 months) Digital Office - Probelm Resolution Engineering Support \nDigital Enterprise Group Senior Software Engineer Intel Corporation December 2006  –  February 2008  (1 year 3 months) Intel Solution Services \nCreating solutions for external customers dealing with Imaging Solutions Software/Integration Egineer Intel Corporation June 2002  –  November 2006  (4 years 6 months) Client Engineering OS Engineer \nCreated the Intel IT build \nCreated automation for the Intel IT Build Test Engineer Intel Corporation May 1999  –  May 2002  (3 years 1 month) Integration Test Facility in the QA Lab (Quality Assurance) \nImaging Solutions for quicker testing \nAutomating test scripts Software/Integration Engineer Intel Corporation June 1998  –  February 1999  (9 months) Co-Op with ITF (Integration Test Facility) Software Engineer Intel Software Engineer Intel Senior Software Engineer Intel Corporation February 2008  – Present (7 years 7 months) Digital Office - Probelm Resolution Engineering Support \nDigital Enterprise Group Senior Software Engineer Intel Corporation February 2008  – Present (7 years 7 months) Digital Office - Probelm Resolution Engineering Support \nDigital Enterprise Group Senior Software Engineer Intel Corporation December 2006  –  February 2008  (1 year 3 months) Intel Solution Services \nCreating solutions for external customers dealing with Imaging Solutions Senior Software Engineer Intel Corporation December 2006  –  February 2008  (1 year 3 months) Intel Solution Services \nCreating solutions for external customers dealing with Imaging Solutions Software/Integration Egineer Intel Corporation June 2002  –  November 2006  (4 years 6 months) Client Engineering OS Engineer \nCreated the Intel IT build \nCreated automation for the Intel IT Build Software/Integration Egineer Intel Corporation June 2002  –  November 2006  (4 years 6 months) Client Engineering OS Engineer \nCreated the Intel IT build \nCreated automation for the Intel IT Build Test Engineer Intel Corporation May 1999  –  May 2002  (3 years 1 month) Integration Test Facility in the QA Lab (Quality Assurance) \nImaging Solutions for quicker testing \nAutomating test scripts Test Engineer Intel Corporation May 1999  –  May 2002  (3 years 1 month) Integration Test Facility in the QA Lab (Quality Assurance) \nImaging Solutions for quicker testing \nAutomating test scripts Software/Integration Engineer Intel Corporation June 1998  –  February 1999  (9 months) Co-Op with ITF (Integration Test Facility) Software/Integration Engineer Intel Corporation June 1998  –  February 1999  (9 months) Co-Op with ITF (Integration Test Facility) Skills Integration Product Management Testing Programming Databases Operating Systems Intel Visual Basic C Project Management Quality Assurance Debugging XP VB.NET Enterprise Software Windows XP See 1+     See less Skills  Integration Product Management Testing Programming Databases Operating Systems Intel Visual Basic C Project Management Quality Assurance Debugging XP VB.NET Enterprise Software Windows XP See 1+     See less Integration Product Management Testing Programming Databases Operating Systems Intel Visual Basic C Project Management Quality Assurance Debugging XP VB.NET Enterprise Software Windows XP See 1+     See less Integration Product Management Testing Programming Databases Operating Systems Intel Visual Basic C Project Management Quality Assurance Debugging XP VB.NET Enterprise Software Windows XP See 1+     See less Education University of California, Davis Bachelors of Science,  Computer Science 1996  – 1999 BA Computer Science Activities and Societies:  Choir University of California, Davis Bachelors of Science,  Computer Science 1996  – 1999 BA Computer Science Activities and Societies:  Choir University of California, Davis Bachelors of Science,  Computer Science 1996  – 1999 BA Computer Science Activities and Societies:  Choir University of California, Davis Bachelors of Science,  Computer Science 1996  – 1999 BA Computer Science Activities and Societies:  Choir ", "Summary I come from a varied background with regards to software development and engineering; my original passion involved the fine arts, with a focus on painting, dry media, and graphic design. \n \nI have worked in multiple engineering domains throughout my career, including web application development and design (all aspects, including database design and implementation, back end development, front end development, on both LAMP and Windows stacks) and application development in a windows environment (.NET, WPF, related technologies). I've also spent time in QA and test automation.  \n \nIn my current role I'm spending my time developing validation tools using Java and C++ for Eclipse integration. \n \nSpecialties include human factor/user interface/usability problem solving, web application development, application level/front end development. Summary I come from a varied background with regards to software development and engineering; my original passion involved the fine arts, with a focus on painting, dry media, and graphic design. \n \nI have worked in multiple engineering domains throughout my career, including web application development and design (all aspects, including database design and implementation, back end development, front end development, on both LAMP and Windows stacks) and application development in a windows environment (.NET, WPF, related technologies). I've also spent time in QA and test automation.  \n \nIn my current role I'm spending my time developing validation tools using Java and C++ for Eclipse integration. \n \nSpecialties include human factor/user interface/usability problem solving, web application development, application level/front end development. I come from a varied background with regards to software development and engineering; my original passion involved the fine arts, with a focus on painting, dry media, and graphic design. \n \nI have worked in multiple engineering domains throughout my career, including web application development and design (all aspects, including database design and implementation, back end development, front end development, on both LAMP and Windows stacks) and application development in a windows environment (.NET, WPF, related technologies). I've also spent time in QA and test automation.  \n \nIn my current role I'm spending my time developing validation tools using Java and C++ for Eclipse integration. \n \nSpecialties include human factor/user interface/usability problem solving, web application development, application level/front end development. I come from a varied background with regards to software development and engineering; my original passion involved the fine arts, with a focus on painting, dry media, and graphic design. \n \nI have worked in multiple engineering domains throughout my career, including web application development and design (all aspects, including database design and implementation, back end development, front end development, on both LAMP and Windows stacks) and application development in a windows environment (.NET, WPF, related technologies). I've also spent time in QA and test automation.  \n \nIn my current role I'm spending my time developing validation tools using Java and C++ for Eclipse integration. \n \nSpecialties include human factor/user interface/usability problem solving, web application development, application level/front end development. Experience Senior Software Engineer Skype February 2015  – Present (7 months) Stockholm, Sweden Skype Foundation Technology - Media Platforms - Apple. Senior Software Engineer Intel Corporation March 2014  –  January 2015  (11 months) Ulm Area, Germany Senior Engineer on Embedded Debugger Team working on software debug capabilities utilizing hardware data metrics. Responsibilities include: \n \n* User experience efforts from use case definitions to final UI design. \n* Product architecture and development in C/C++ and Java. \n* Cross-division strategy enabling. Senior Software Engineer Intel Corporation September 2012  –  March 2014  (1 year 7 months) Dupont, Wa Senior Engineer on core architecture team for division's primary silicon and platform validation product. Responsibilities include: \n \n* Pathfinding new debug and validation features, including writing reference code and performing research and development for productization. \n* Design and implementation of new services/features written in C/C++ and C#. \n* Refactoring and re-architecture of current product. \n* Supervising junior engineers as necessary for productization. Senior Software Engineer Intel Corporation November 2010  –  September 2012  (1 year 11 months) Dupont, WA Lead Engineer in the creation of silicon debug software. Technical direction to a team of 10-20 engineers at any one time, spread around the world. Responsibilities include: \n \n* Education and mentorship of junior engineers in proper design, development, and programming practices. \n* Overall human factor and user interface design for current product. \n* Application architecture for current product. \n* Customer interaction and use case gathering. \n* Consult on development process for parent division. \n* Strategic planning for future needs regarding technology choices and long term engineer skill enhancement. Software Engineer Intel Corporation December 2004  –  October 2010  (5 years 11 months) Dupont, Wa Various engineering positions over the years, with below highlighting various tasks: \n \n* Application development for windows environments, using .NET 4/C#, WPF, Prism Framework (using MEF), utilizing the MVVM design pattern. \n* Web application development on a LAMP stack, creating internal ticketing and support applications for engineering groups. Solutions utilized web standards, back end development with PHP and MySQL, front end with JavaScript (YUI Library), valid XHTML, valid CSS. \n* User Interface design and user interface artifact creation, including icon design, overall color choices, branding, user workflow design. \n* Designing and implementing Firmware and BIOS test automation utilizing various scripting languages (Python, Tcl) \n* Test plan creation and execution \n* System administration of Windows and *nix (Linux flavors, FreeBSD) servers Senior Software Engineer Skype February 2015  – Present (7 months) Stockholm, Sweden Skype Foundation Technology - Media Platforms - Apple. Senior Software Engineer Skype February 2015  – Present (7 months) Stockholm, Sweden Skype Foundation Technology - Media Platforms - Apple. Senior Software Engineer Intel Corporation March 2014  –  January 2015  (11 months) Ulm Area, Germany Senior Engineer on Embedded Debugger Team working on software debug capabilities utilizing hardware data metrics. Responsibilities include: \n \n* User experience efforts from use case definitions to final UI design. \n* Product architecture and development in C/C++ and Java. \n* Cross-division strategy enabling. Senior Software Engineer Intel Corporation March 2014  –  January 2015  (11 months) Ulm Area, Germany Senior Engineer on Embedded Debugger Team working on software debug capabilities utilizing hardware data metrics. Responsibilities include: \n \n* User experience efforts from use case definitions to final UI design. \n* Product architecture and development in C/C++ and Java. \n* Cross-division strategy enabling. Senior Software Engineer Intel Corporation September 2012  –  March 2014  (1 year 7 months) Dupont, Wa Senior Engineer on core architecture team for division's primary silicon and platform validation product. Responsibilities include: \n \n* Pathfinding new debug and validation features, including writing reference code and performing research and development for productization. \n* Design and implementation of new services/features written in C/C++ and C#. \n* Refactoring and re-architecture of current product. \n* Supervising junior engineers as necessary for productization. Senior Software Engineer Intel Corporation September 2012  –  March 2014  (1 year 7 months) Dupont, Wa Senior Engineer on core architecture team for division's primary silicon and platform validation product. Responsibilities include: \n \n* Pathfinding new debug and validation features, including writing reference code and performing research and development for productization. \n* Design and implementation of new services/features written in C/C++ and C#. \n* Refactoring and re-architecture of current product. \n* Supervising junior engineers as necessary for productization. Senior Software Engineer Intel Corporation November 2010  –  September 2012  (1 year 11 months) Dupont, WA Lead Engineer in the creation of silicon debug software. Technical direction to a team of 10-20 engineers at any one time, spread around the world. Responsibilities include: \n \n* Education and mentorship of junior engineers in proper design, development, and programming practices. \n* Overall human factor and user interface design for current product. \n* Application architecture for current product. \n* Customer interaction and use case gathering. \n* Consult on development process for parent division. \n* Strategic planning for future needs regarding technology choices and long term engineer skill enhancement. Senior Software Engineer Intel Corporation November 2010  –  September 2012  (1 year 11 months) Dupont, WA Lead Engineer in the creation of silicon debug software. Technical direction to a team of 10-20 engineers at any one time, spread around the world. Responsibilities include: \n \n* Education and mentorship of junior engineers in proper design, development, and programming practices. \n* Overall human factor and user interface design for current product. \n* Application architecture for current product. \n* Customer interaction and use case gathering. \n* Consult on development process for parent division. \n* Strategic planning for future needs regarding technology choices and long term engineer skill enhancement. Software Engineer Intel Corporation December 2004  –  October 2010  (5 years 11 months) Dupont, Wa Various engineering positions over the years, with below highlighting various tasks: \n \n* Application development for windows environments, using .NET 4/C#, WPF, Prism Framework (using MEF), utilizing the MVVM design pattern. \n* Web application development on a LAMP stack, creating internal ticketing and support applications for engineering groups. Solutions utilized web standards, back end development with PHP and MySQL, front end with JavaScript (YUI Library), valid XHTML, valid CSS. \n* User Interface design and user interface artifact creation, including icon design, overall color choices, branding, user workflow design. \n* Designing and implementing Firmware and BIOS test automation utilizing various scripting languages (Python, Tcl) \n* Test plan creation and execution \n* System administration of Windows and *nix (Linux flavors, FreeBSD) servers Software Engineer Intel Corporation December 2004  –  October 2010  (5 years 11 months) Dupont, Wa Various engineering positions over the years, with below highlighting various tasks: \n \n* Application development for windows environments, using .NET 4/C#, WPF, Prism Framework (using MEF), utilizing the MVVM design pattern. \n* Web application development on a LAMP stack, creating internal ticketing and support applications for engineering groups. Solutions utilized web standards, back end development with PHP and MySQL, front end with JavaScript (YUI Library), valid XHTML, valid CSS. \n* User Interface design and user interface artifact creation, including icon design, overall color choices, branding, user workflow design. \n* Designing and implementing Firmware and BIOS test automation utilizing various scripting languages (Python, Tcl) \n* Test plan creation and execution \n* System administration of Windows and *nix (Linux flavors, FreeBSD) servers Skills JavaScript YUI C# WPF PHP HTML SQL Python User Experience Software Development MySQL CSS Design Patterns Test Automation Programming .NET Database Design Debugging See 3+     See less Skills  JavaScript YUI C# WPF PHP HTML SQL Python User Experience Software Development MySQL CSS Design Patterns Test Automation Programming .NET Database Design Debugging See 3+     See less JavaScript YUI C# WPF PHP HTML SQL Python User Experience Software Development MySQL CSS Design Patterns Test Automation Programming .NET Database Design Debugging See 3+     See less JavaScript YUI C# WPF PHP HTML SQL Python User Experience Software Development MySQL CSS Design Patterns Test Automation Programming .NET Database Design Debugging See 3+     See less Education The Evergreen State College Bachelor of Science,  Computer Science 2001  – 2003 The Evergreen State College Bachelor of Arts 2001  – 2003 The School of the Art Institute of Chicago Painting ,  Photography ,  Graphic Design 1995  – 1998 The Evergreen State College Bachelor of Science,  Computer Science 2001  – 2003 The Evergreen State College Bachelor of Science,  Computer Science 2001  – 2003 The Evergreen State College Bachelor of Science,  Computer Science 2001  – 2003 The Evergreen State College Bachelor of Arts 2001  – 2003 The Evergreen State College Bachelor of Arts 2001  – 2003 The Evergreen State College Bachelor of Arts 2001  – 2003 The School of the Art Institute of Chicago Painting ,  Photography ,  Graphic Design 1995  – 1998 The School of the Art Institute of Chicago Painting ,  Photography ,  Graphic Design 1995  – 1998 The School of the Art Institute of Chicago Painting ,  Photography ,  Graphic Design 1995  – 1998 "]}