{"position": "Senior Manufacturing Technician", "company": "Intel Corporation", "profiles": ["Experience BS Accounting DeVry University 2009  –  2012  (3 years) Business and governmental accounting, tax accounting. Business Management. Project Manager Dunrite Contracting Ltd April 2008  –  July 2009  (1 year 4 months) Redlands, California Project management for a privately owned contracting company rebuilding remodeling repair and warranty services for housing industry. Senior Manufacturing Technician Intel Corporation June 1997  –  December 2008  (11 years 7 months) Chandler, Arizona •\tCertified Peer Trainer and supervise for L1/L2 operations \n•\tMedical/Emergency Responder (MRT/ERT) \n•\tControlled Hazardous Energy (CoHE) Instructor and Safety Advisor \n•\tCertified L3/L4 Equipment Maintenance in Lithography, Wet and/Dry Etch. \n•\tL3E/L4E ASML/SVG Vendor Certification for Lithography SVG90S/SE Tract and SVG Hard Bake Track Equipment. BS Accounting DeVry University 2009  –  2012  (3 years) Business and governmental accounting, tax accounting. Business Management. BS Accounting DeVry University 2009  –  2012  (3 years) Business and governmental accounting, tax accounting. Business Management. Project Manager Dunrite Contracting Ltd April 2008  –  July 2009  (1 year 4 months) Redlands, California Project management for a privately owned contracting company rebuilding remodeling repair and warranty services for housing industry. Project Manager Dunrite Contracting Ltd April 2008  –  July 2009  (1 year 4 months) Redlands, California Project management for a privately owned contracting company rebuilding remodeling repair and warranty services for housing industry. Senior Manufacturing Technician Intel Corporation June 1997  –  December 2008  (11 years 7 months) Chandler, Arizona •\tCertified Peer Trainer and supervise for L1/L2 operations \n•\tMedical/Emergency Responder (MRT/ERT) \n•\tControlled Hazardous Energy (CoHE) Instructor and Safety Advisor \n•\tCertified L3/L4 Equipment Maintenance in Lithography, Wet and/Dry Etch. \n•\tL3E/L4E ASML/SVG Vendor Certification for Lithography SVG90S/SE Tract and SVG Hard Bake Track Equipment. Senior Manufacturing Technician Intel Corporation June 1997  –  December 2008  (11 years 7 months) Chandler, Arizona •\tCertified Peer Trainer and supervise for L1/L2 operations \n•\tMedical/Emergency Responder (MRT/ERT) \n•\tControlled Hazardous Energy (CoHE) Instructor and Safety Advisor \n•\tCertified L3/L4 Equipment Maintenance in Lithography, Wet and/Dry Etch. \n•\tL3E/L4E ASML/SVG Vendor Certification for Lithography SVG90S/SE Tract and SVG Hard Bake Track Equipment. Languages Tagalog Tagalog Tagalog Skills Top Skills 6 Troubleshooting 4 Microsoft Excel 3 Microsoft Office 3 Team Leadership 2 Project Management 2 Testing 2 Customer Service 1 Electronics 1 Windows 0 Semiconductors Oscar also knows about... 0 Robotics Skills  Top Skills 6 Troubleshooting 4 Microsoft Excel 3 Microsoft Office 3 Team Leadership 2 Project Management 2 Testing 2 Customer Service 1 Electronics 1 Windows 0 Semiconductors Oscar also knows about... 0 Robotics Top Skills 6 Troubleshooting 4 Microsoft Excel 3 Microsoft Office 3 Team Leadership 2 Project Management 2 Testing 2 Customer Service 1 Electronics 1 Windows 0 Semiconductors Oscar also knows about... 0 Robotics Top Skills 6 Troubleshooting 4 Microsoft Excel 3 Microsoft Office 3 Team Leadership 2 Project Management 2 Testing 2 Customer Service 1 Electronics 1 Windows 0 Semiconductors Oscar also knows about... 0 Robotics                     0 Robotics Education VA Educational Program Project Management Certification,  Business ,  Management ,  Marketing ,  and Related Support Services 2012  – 2012 DeVry University Phoenix Bachelor's degree,  Technical Management 2009  – 2012 Arizona State University Bachelor Associate of Engineering,  Engineering/Industrial Management 2004  – 2007 VA Educational Program Project Management Certification,  Business ,  Management ,  Marketing ,  and Related Support Services 2012  – 2012 VA Educational Program Project Management Certification,  Business ,  Management ,  Marketing ,  and Related Support Services 2012  – 2012 VA Educational Program Project Management Certification,  Business ,  Management ,  Marketing ,  and Related Support Services 2012  – 2012 DeVry University Phoenix Bachelor's degree,  Technical Management 2009  – 2012 DeVry University Phoenix Bachelor's degree,  Technical Management 2009  – 2012 DeVry University Phoenix Bachelor's degree,  Technical Management 2009  – 2012 Arizona State University Bachelor Associate of Engineering,  Engineering/Industrial Management 2004  – 2007 Arizona State University Bachelor Associate of Engineering,  Engineering/Industrial Management 2004  – 2007 Arizona State University Bachelor Associate of Engineering,  Engineering/Industrial Management 2004  – 2007 ", "Experience Senior Process Technician Sierra Solar Systems a division of EnPower Inc. December 2011  – Present (3 years 9 months) Fremont Senior Process Technician Process Technician Solyndra September 2009  –  September 2011  (2 years 1 month) Fremont Senior Manufacturing Technician Intel Corporation April 1984  –  November 2009  (25 years 8 months) Start up engineering technician. Senior Process Technician Sierra Solar Systems a division of EnPower Inc. December 2011  – Present (3 years 9 months) Fremont Senior Process Technician Senior Process Technician Sierra Solar Systems a division of EnPower Inc. December 2011  – Present (3 years 9 months) Fremont Senior Process Technician Process Technician Solyndra September 2009  –  September 2011  (2 years 1 month) Fremont Process Technician Solyndra September 2009  –  September 2011  (2 years 1 month) Fremont Senior Manufacturing Technician Intel Corporation April 1984  –  November 2009  (25 years 8 months) Start up engineering technician. Senior Manufacturing Technician Intel Corporation April 1984  –  November 2009  (25 years 8 months) Start up engineering technician. Languages English, Ilocano,Tagalog English, Ilocano,Tagalog English, Ilocano,Tagalog Skills Top Skills 26 Semiconductors 14 SPC 13 Failure Analysis 9 Semiconductor Industry 6 Metrology 4 Design of Experiments 4 JMP 4 Manufacturing 2 Thin Films 2 Silicon Rose also knows about... 2 Electronics 2 Plasma Etch 1 Intel 1 CVD 1 Testing 1 Lithography 1 IC 1 Process Simulation 1 Etching 1 Photolithography 1 PVD Skills  Top Skills 26 Semiconductors 14 SPC 13 Failure Analysis 9 Semiconductor Industry 6 Metrology 4 Design of Experiments 4 JMP 4 Manufacturing 2 Thin Films 2 Silicon Rose also knows about... 2 Electronics 2 Plasma Etch 1 Intel 1 CVD 1 Testing 1 Lithography 1 IC 1 Process Simulation 1 Etching 1 Photolithography 1 PVD Top Skills 26 Semiconductors 14 SPC 13 Failure Analysis 9 Semiconductor Industry 6 Metrology 4 Design of Experiments 4 JMP 4 Manufacturing 2 Thin Films 2 Silicon Rose also knows about... 2 Electronics 2 Plasma Etch 1 Intel 1 CVD 1 Testing 1 Lithography 1 IC 1 Process Simulation 1 Etching 1 Photolithography 1 PVD Top Skills 26 Semiconductors 14 SPC 13 Failure Analysis 9 Semiconductor Industry 6 Metrology 4 Design of Experiments 4 JMP 4 Manufacturing 2 Thin Films 2 Silicon Rose also knows about... 2 Electronics 2 Plasma Etch 1 Intel 1 CVD 1 Testing 1 Lithography 1 IC 1 Process Simulation 1 Etching 1 Photolithography 1 PVD                     2 Electronics 2 Plasma Etch 1 Intel 1 CVD 1 Testing 1 Lithography 1 IC 1 Process Simulation 1 Etching 1 Photolithography 1 PVD Education Philippine Science of Business Administration, Manila, Philippines Finance 1973  – 1974 Divine Word College of Laoag Liberal Arts,  Science 1969  – 1973 Philippine Science of Business Administration, Manila, Philippines Finance 1973  – 1974 Philippine Science of Business Administration, Manila, Philippines Finance 1973  – 1974 Philippine Science of Business Administration, Manila, Philippines Finance 1973  – 1974 Divine Word College of Laoag Liberal Arts,  Science 1969  – 1973 Divine Word College of Laoag Liberal Arts,  Science 1969  – 1973 Divine Word College of Laoag Liberal Arts,  Science 1969  – 1973 ", "Experience Senior Manufacturing Technician Intel Corporation July 1999  – Present (16 years 2 months) Phoenix, Arizona Area Senior Manufacturing Technician Intel Corporation July 1999  – Present (16 years 2 months) Phoenix, Arizona Area Senior Manufacturing Technician Intel Corporation July 1999  – Present (16 years 2 months) Phoenix, Arizona Area Skills Top Skills 6 Semiconductors 3 Engineering 2 Failure Analysis 1 Product Development 1 Semiconductor Industry 1 Lean Manufacturing 1 SPC 1 Strategic Planning 0 Lean Six Sigma 0 Project Planning Alan also knows about... 0 Project Coordination 0 Project Management 0 Maintenance & Repair 0 Microsoft Office 0 Customer Service 0 Design of Experiments 0 Continuous Improvement 0 Electronics 0 Six Sigma 0 Troubleshooting Skills  Top Skills 6 Semiconductors 3 Engineering 2 Failure Analysis 1 Product Development 1 Semiconductor Industry 1 Lean Manufacturing 1 SPC 1 Strategic Planning 0 Lean Six Sigma 0 Project Planning Alan also knows about... 0 Project Coordination 0 Project Management 0 Maintenance & Repair 0 Microsoft Office 0 Customer Service 0 Design of Experiments 0 Continuous Improvement 0 Electronics 0 Six Sigma 0 Troubleshooting Top Skills 6 Semiconductors 3 Engineering 2 Failure Analysis 1 Product Development 1 Semiconductor Industry 1 Lean Manufacturing 1 SPC 1 Strategic Planning 0 Lean Six Sigma 0 Project Planning Alan also knows about... 0 Project Coordination 0 Project Management 0 Maintenance & Repair 0 Microsoft Office 0 Customer Service 0 Design of Experiments 0 Continuous Improvement 0 Electronics 0 Six Sigma 0 Troubleshooting Top Skills 6 Semiconductors 3 Engineering 2 Failure Analysis 1 Product Development 1 Semiconductor Industry 1 Lean Manufacturing 1 SPC 1 Strategic Planning 0 Lean Six Sigma 0 Project Planning Alan also knows about... 0 Project Coordination 0 Project Management 0 Maintenance & Repair 0 Microsoft Office 0 Customer Service 0 Design of Experiments 0 Continuous Improvement 0 Electronics 0 Six Sigma 0 Troubleshooting                     0 Project Coordination 0 Project Management 0 Maintenance & Repair 0 Microsoft Office 0 Customer Service 0 Design of Experiments 0 Continuous Improvement 0 Electronics 0 Six Sigma 0 Troubleshooting Education Dublin Institute of Technology Associate's degree,  Mechanical Engineering , Merit 1993  – 1997 Dublin Institute of Technology Associate's degree,  Mechanical Engineering , Merit 1993  – 1997 Dublin Institute of Technology Associate's degree,  Mechanical Engineering , Merit 1993  – 1997 Dublin Institute of Technology Associate's degree,  Mechanical Engineering , Merit 1993  – 1997 ", "Summary Electromechanical Technician with 10 years of experience in a multinational high-tech company with an electronics technician and studies in Information Systems Engineering. Extensive experience in Manufacturing, Maintenance and Customer Service. Pneumatic knowledge, safety, quality, lean manufacturing, coordination skills and training of personnel and introduction of new products. High analytical thinking methodically focused on the tasks and foster an environment of stable and harmonious work. \n \nI am experienced and trained in functions associated with all Manufacturing Floor including operations, equipment, processing and training. My responsibilities in the past include collecting and evaluating operating data to conduct on-line equipment adjustment while ensuring process optimization. I was fully responsible for running lots in a qualitative way. Also, responsible for preventive maintenance, troubleshooting, spares, and sustainability. In addition, I was responsible for improving processes, troubleshooting nonstandard events in the production line, and reviewing technological health and stability. I am qualified for the buddy, trainer, and certifier levels and in the past I have been in charge of updating training manuals. My tasks and job title has been multifaceted and complex. In result I worked within the spectrum ranging from narrowly defined parameters with limited judgment up to highly complex and nonstandard assignments in nature. High degree of judgment and initiative was essential in resolving complex nonstandard problems and developing recommendations. I commonly received general instructions on routine work, and detailed instructions on new work. Summary Electromechanical Technician with 10 years of experience in a multinational high-tech company with an electronics technician and studies in Information Systems Engineering. Extensive experience in Manufacturing, Maintenance and Customer Service. Pneumatic knowledge, safety, quality, lean manufacturing, coordination skills and training of personnel and introduction of new products. High analytical thinking methodically focused on the tasks and foster an environment of stable and harmonious work. \n \nI am experienced and trained in functions associated with all Manufacturing Floor including operations, equipment, processing and training. My responsibilities in the past include collecting and evaluating operating data to conduct on-line equipment adjustment while ensuring process optimization. I was fully responsible for running lots in a qualitative way. Also, responsible for preventive maintenance, troubleshooting, spares, and sustainability. In addition, I was responsible for improving processes, troubleshooting nonstandard events in the production line, and reviewing technological health and stability. I am qualified for the buddy, trainer, and certifier levels and in the past I have been in charge of updating training manuals. My tasks and job title has been multifaceted and complex. In result I worked within the spectrum ranging from narrowly defined parameters with limited judgment up to highly complex and nonstandard assignments in nature. High degree of judgment and initiative was essential in resolving complex nonstandard problems and developing recommendations. I commonly received general instructions on routine work, and detailed instructions on new work. Electromechanical Technician with 10 years of experience in a multinational high-tech company with an electronics technician and studies in Information Systems Engineering. Extensive experience in Manufacturing, Maintenance and Customer Service. Pneumatic knowledge, safety, quality, lean manufacturing, coordination skills and training of personnel and introduction of new products. High analytical thinking methodically focused on the tasks and foster an environment of stable and harmonious work. \n \nI am experienced and trained in functions associated with all Manufacturing Floor including operations, equipment, processing and training. My responsibilities in the past include collecting and evaluating operating data to conduct on-line equipment adjustment while ensuring process optimization. I was fully responsible for running lots in a qualitative way. Also, responsible for preventive maintenance, troubleshooting, spares, and sustainability. In addition, I was responsible for improving processes, troubleshooting nonstandard events in the production line, and reviewing technological health and stability. I am qualified for the buddy, trainer, and certifier levels and in the past I have been in charge of updating training manuals. My tasks and job title has been multifaceted and complex. In result I worked within the spectrum ranging from narrowly defined parameters with limited judgment up to highly complex and nonstandard assignments in nature. High degree of judgment and initiative was essential in resolving complex nonstandard problems and developing recommendations. I commonly received general instructions on routine work, and detailed instructions on new work. Electromechanical Technician with 10 years of experience in a multinational high-tech company with an electronics technician and studies in Information Systems Engineering. Extensive experience in Manufacturing, Maintenance and Customer Service. Pneumatic knowledge, safety, quality, lean manufacturing, coordination skills and training of personnel and introduction of new products. High analytical thinking methodically focused on the tasks and foster an environment of stable and harmonious work. \n \nI am experienced and trained in functions associated with all Manufacturing Floor including operations, equipment, processing and training. My responsibilities in the past include collecting and evaluating operating data to conduct on-line equipment adjustment while ensuring process optimization. I was fully responsible for running lots in a qualitative way. Also, responsible for preventive maintenance, troubleshooting, spares, and sustainability. In addition, I was responsible for improving processes, troubleshooting nonstandard events in the production line, and reviewing technological health and stability. I am qualified for the buddy, trainer, and certifier levels and in the past I have been in charge of updating training manuals. My tasks and job title has been multifaceted and complex. In result I worked within the spectrum ranging from narrowly defined parameters with limited judgment up to highly complex and nonstandard assignments in nature. High degree of judgment and initiative was essential in resolving complex nonstandard problems and developing recommendations. I commonly received general instructions on routine work, and detailed instructions on new work. Experience Senior Manufacturing Technician Intel Corporation May 2005  –  May 2015  (10 years 1 month) Costa Rica My responsibilities include collecting and evaluating operating data to conduct on-line equipment adjustment while ensuring process optimization. I was fully responsible for running lots in a qualitative way. Also, responsible for preventive maintenance, troubleshooting, spares, and sustainability. In addition, I was responsible for improving processes, troubleshooting nonstandard events in the production line, and reviewing technological health and stability. \n \n• Contributed in the stabilization process and maintenance of equipment, analyzing trends in transferring equipment and simple techniques and methods so that a growth in the availability of equipment from 77% to 93% was achieved without impacting commitments production. \n• Directed and coordinated the coaching area and equipment preventive maintenance, organizing tasks, encouraging the skills and abilities of the companions and prioritizing requirements. The performance of equipment 80% to 87% increased. \n• Led conversions products manufacturing equipment, organizing the times and the methods and materials planning early. Conversion time 6 to 3 hours is decreased and loss of product quality problems are prevented. \n \n Senior Manufacturing Technician Intel Corporation June 2014  –  March 2015  (10 months) Ho Chi Minh, Vietnam I supported the start-up of new production line in Vietnam's Factory, trained and pass down my knowledge to new technicians, I worked on tools installation and qualification, where I achieved records numbers in productivity, safety and quality. \n \n• Plan the training of Vietnamese technical personnel in new manufacturing equipment, material designing, optimizing content and training to reviewers. 80% of qualified people and training time 5-3 days decreased was obtained. \n• Assist in the transfer of goods from Costa Rica to Vietnam, as well as process optimization, installing equipment and simplifying the tasks. A reduction was obtained at the time of installation and qualification systems 4-2 weeks without negative impact on quality. \n \n Senior Manufacturing Technician Intel Corporation May 2005  –  May 2015  (10 years 1 month) Costa Rica My responsibilities include collecting and evaluating operating data to conduct on-line equipment adjustment while ensuring process optimization. I was fully responsible for running lots in a qualitative way. Also, responsible for preventive maintenance, troubleshooting, spares, and sustainability. In addition, I was responsible for improving processes, troubleshooting nonstandard events in the production line, and reviewing technological health and stability. \n \n• Contributed in the stabilization process and maintenance of equipment, analyzing trends in transferring equipment and simple techniques and methods so that a growth in the availability of equipment from 77% to 93% was achieved without impacting commitments production. \n• Directed and coordinated the coaching area and equipment preventive maintenance, organizing tasks, encouraging the skills and abilities of the companions and prioritizing requirements. The performance of equipment 80% to 87% increased. \n• Led conversions products manufacturing equipment, organizing the times and the methods and materials planning early. Conversion time 6 to 3 hours is decreased and loss of product quality problems are prevented. \n \n Senior Manufacturing Technician Intel Corporation May 2005  –  May 2015  (10 years 1 month) Costa Rica My responsibilities include collecting and evaluating operating data to conduct on-line equipment adjustment while ensuring process optimization. I was fully responsible for running lots in a qualitative way. Also, responsible for preventive maintenance, troubleshooting, spares, and sustainability. In addition, I was responsible for improving processes, troubleshooting nonstandard events in the production line, and reviewing technological health and stability. \n \n• Contributed in the stabilization process and maintenance of equipment, analyzing trends in transferring equipment and simple techniques and methods so that a growth in the availability of equipment from 77% to 93% was achieved without impacting commitments production. \n• Directed and coordinated the coaching area and equipment preventive maintenance, organizing tasks, encouraging the skills and abilities of the companions and prioritizing requirements. The performance of equipment 80% to 87% increased. \n• Led conversions products manufacturing equipment, organizing the times and the methods and materials planning early. Conversion time 6 to 3 hours is decreased and loss of product quality problems are prevented. \n \n Senior Manufacturing Technician Intel Corporation June 2014  –  March 2015  (10 months) Ho Chi Minh, Vietnam I supported the start-up of new production line in Vietnam's Factory, trained and pass down my knowledge to new technicians, I worked on tools installation and qualification, where I achieved records numbers in productivity, safety and quality. \n \n• Plan the training of Vietnamese technical personnel in new manufacturing equipment, material designing, optimizing content and training to reviewers. 80% of qualified people and training time 5-3 days decreased was obtained. \n• Assist in the transfer of goods from Costa Rica to Vietnam, as well as process optimization, installing equipment and simplifying the tasks. A reduction was obtained at the time of installation and qualification systems 4-2 weeks without negative impact on quality. \n \n Senior Manufacturing Technician Intel Corporation June 2014  –  March 2015  (10 months) Ho Chi Minh, Vietnam I supported the start-up of new production line in Vietnam's Factory, trained and pass down my knowledge to new technicians, I worked on tools installation and qualification, where I achieved records numbers in productivity, safety and quality. \n \n• Plan the training of Vietnamese technical personnel in new manufacturing equipment, material designing, optimizing content and training to reviewers. 80% of qualified people and training time 5-3 days decreased was obtained. \n• Assist in the transfer of goods from Costa Rica to Vietnam, as well as process optimization, installing equipment and simplifying the tasks. A reduction was obtained at the time of installation and qualification systems 4-2 weeks without negative impact on quality. \n \n Languages Spanish Native or bilingual proficiency English Professional working proficiency Spanish Native or bilingual proficiency English Professional working proficiency Spanish Native or bilingual proficiency English Professional working proficiency Native or bilingual proficiency Professional working proficiency Skills Top Skills 4 Lean manufacturing 3 Electrónica 3 Manufactura 1 Solución de problemas 1 Failure Analysis 1 Ingeniería 1 Validación 1 Pruebas 1 Process Engineering 1 Mejora continua Marlon also knows about... 1 Mantenimiento preventivo 1 Semiconductores 1 Diseño experimental 0 Manufacturing 0 Troubleshooting 0 Preventive Maintenance 0 Electronics 0 Semiconductors 0 Testing 0 Engineering 0 Lean Manufacturing 0 Validation 0 Continuous Improvement Skills  Top Skills 4 Lean manufacturing 3 Electrónica 3 Manufactura 1 Solución de problemas 1 Failure Analysis 1 Ingeniería 1 Validación 1 Pruebas 1 Process Engineering 1 Mejora continua Marlon also knows about... 1 Mantenimiento preventivo 1 Semiconductores 1 Diseño experimental 0 Manufacturing 0 Troubleshooting 0 Preventive Maintenance 0 Electronics 0 Semiconductors 0 Testing 0 Engineering 0 Lean Manufacturing 0 Validation 0 Continuous Improvement Top Skills 4 Lean manufacturing 3 Electrónica 3 Manufactura 1 Solución de problemas 1 Failure Analysis 1 Ingeniería 1 Validación 1 Pruebas 1 Process Engineering 1 Mejora continua Marlon also knows about... 1 Mantenimiento preventivo 1 Semiconductores 1 Diseño experimental 0 Manufacturing 0 Troubleshooting 0 Preventive Maintenance 0 Electronics 0 Semiconductors 0 Testing 0 Engineering 0 Lean Manufacturing 0 Validation 0 Continuous Improvement Top Skills 4 Lean manufacturing 3 Electrónica 3 Manufactura 1 Solución de problemas 1 Failure Analysis 1 Ingeniería 1 Validación 1 Pruebas 1 Process Engineering 1 Mejora continua Marlon also knows about... 1 Mantenimiento preventivo 1 Semiconductores 1 Diseño experimental 0 Manufacturing 0 Troubleshooting 0 Preventive Maintenance 0 Electronics 0 Semiconductors 0 Testing 0 Engineering 0 Lean Manufacturing 0 Validation 0 Continuous Improvement                     1 Mantenimiento preventivo 1 Semiconductores 1 Diseño experimental 0 Manufacturing 0 Troubleshooting 0 Preventive Maintenance 0 Electronics 0 Semiconductors 0 Testing 0 Engineering 0 Lean Manufacturing 0 Validation 0 Continuous Improvement Education Universidad Fidélitas Bachelor's Degree,  Computer Engineering , Bachelor's Degree 2014  – 2018 Colegio Vocacional Monseñor Sanabria Electronic Technician,  Electrical ,  Electronic and Communications Technology/Technician , Technician 2001  – 2004 Universidad Fidélitas Bachelor's Degree,  Computer Engineering , Bachelor's Degree 2014  – 2018 Universidad Fidélitas Bachelor's Degree,  Computer Engineering , Bachelor's Degree 2014  – 2018 Universidad Fidélitas Bachelor's Degree,  Computer Engineering , Bachelor's Degree 2014  – 2018 Colegio Vocacional Monseñor Sanabria Electronic Technician,  Electrical ,  Electronic and Communications Technology/Technician , Technician 2001  – 2004 Colegio Vocacional Monseñor Sanabria Electronic Technician,  Electrical ,  Electronic and Communications Technology/Technician , Technician 2001  – 2004 Colegio Vocacional Monseñor Sanabria Electronic Technician,  Electrical ,  Electronic and Communications Technology/Technician , Technician 2001  – 2004 ", "Experience Senior Field Service Engineer FEI Company November 2014  – Present (10 months) Malta, New York Principal Equipment Engineering Technician GLOBALFOUNDRIES September 2012  –  November 2014  (2 years 3 months) Malta, Ny AMAT RTA (Vantage, Centura, SiNgen, DPO/DPN, Radiance) \nAMAT EPI Centura \nASM ALD (Pulsar and Emerald) \nUltratech Laser Spike Anneal Senior Engineering Technician Samsung Austin Semiconductor April 2011  –  September 2012  (1 year 6 months) Austin, Texas Area Senior Engineering Technician specializing on Axcelis, Nissin and Varian Ion Implanters. Senior Manufacturing Technician Intel Corporation October 2006  –  March 2011  (4 years 6 months) Senior Ion Implant Manufacturing Technician specializing in 300mm AMAT xR80, Quantum, Varian Viista and HCi series implanters. Senior Manufacturing Technician Intel Corporation November 2005  –  October 2006  (1 year) F12 Chandler AZ - Senior Ion Implant Manufacturing Technician specializing in 300mm Quantum X, Varian Viista and HCi series implanters. Customer Engineer III Applied Materials February 2000  –  September 2005  (5 years 8 months) 200mm & 300mm Field Service Engineer servicing INTEL accounts in Hillsboro, Oregon; Rio Rancho, New Mexico & Chandler, Arizona. Specialized in 200mm xR80, 300mm xR80 Leap & Leap II, Quantum I/II/III, Leap and Quantum X series Ion Implanters. Ion Implant Maintenance Technician Sandia National Laboratories June 1998  –  February 2000  (1 year 9 months) Maintenance Technician specializing in 150mm Varian 300xp and Varian 160xp Ion Implanters. Electronic Warfare Operator/Technician/Instructor US Navy March 1988  –  March 1998  (10 years 1 month) Electronic Warfare Operator, Technician and Instructor. Specialized on the Raytheon AN/SLQ-32(V)3 Series Electronic Countermeasures System. Senior Field Service Engineer FEI Company November 2014  – Present (10 months) Malta, New York Senior Field Service Engineer FEI Company November 2014  – Present (10 months) Malta, New York Principal Equipment Engineering Technician GLOBALFOUNDRIES September 2012  –  November 2014  (2 years 3 months) Malta, Ny AMAT RTA (Vantage, Centura, SiNgen, DPO/DPN, Radiance) \nAMAT EPI Centura \nASM ALD (Pulsar and Emerald) \nUltratech Laser Spike Anneal Principal Equipment Engineering Technician GLOBALFOUNDRIES September 2012  –  November 2014  (2 years 3 months) Malta, Ny AMAT RTA (Vantage, Centura, SiNgen, DPO/DPN, Radiance) \nAMAT EPI Centura \nASM ALD (Pulsar and Emerald) \nUltratech Laser Spike Anneal Senior Engineering Technician Samsung Austin Semiconductor April 2011  –  September 2012  (1 year 6 months) Austin, Texas Area Senior Engineering Technician specializing on Axcelis, Nissin and Varian Ion Implanters. Senior Engineering Technician Samsung Austin Semiconductor April 2011  –  September 2012  (1 year 6 months) Austin, Texas Area Senior Engineering Technician specializing on Axcelis, Nissin and Varian Ion Implanters. Senior Manufacturing Technician Intel Corporation October 2006  –  March 2011  (4 years 6 months) Senior Ion Implant Manufacturing Technician specializing in 300mm AMAT xR80, Quantum, Varian Viista and HCi series implanters. Senior Manufacturing Technician Intel Corporation October 2006  –  March 2011  (4 years 6 months) Senior Ion Implant Manufacturing Technician specializing in 300mm AMAT xR80, Quantum, Varian Viista and HCi series implanters. Senior Manufacturing Technician Intel Corporation November 2005  –  October 2006  (1 year) F12 Chandler AZ - Senior Ion Implant Manufacturing Technician specializing in 300mm Quantum X, Varian Viista and HCi series implanters. Senior Manufacturing Technician Intel Corporation November 2005  –  October 2006  (1 year) F12 Chandler AZ - Senior Ion Implant Manufacturing Technician specializing in 300mm Quantum X, Varian Viista and HCi series implanters. Customer Engineer III Applied Materials February 2000  –  September 2005  (5 years 8 months) 200mm & 300mm Field Service Engineer servicing INTEL accounts in Hillsboro, Oregon; Rio Rancho, New Mexico & Chandler, Arizona. Specialized in 200mm xR80, 300mm xR80 Leap & Leap II, Quantum I/II/III, Leap and Quantum X series Ion Implanters. Customer Engineer III Applied Materials February 2000  –  September 2005  (5 years 8 months) 200mm & 300mm Field Service Engineer servicing INTEL accounts in Hillsboro, Oregon; Rio Rancho, New Mexico & Chandler, Arizona. Specialized in 200mm xR80, 300mm xR80 Leap & Leap II, Quantum I/II/III, Leap and Quantum X series Ion Implanters. Ion Implant Maintenance Technician Sandia National Laboratories June 1998  –  February 2000  (1 year 9 months) Maintenance Technician specializing in 150mm Varian 300xp and Varian 160xp Ion Implanters. Ion Implant Maintenance Technician Sandia National Laboratories June 1998  –  February 2000  (1 year 9 months) Maintenance Technician specializing in 150mm Varian 300xp and Varian 160xp Ion Implanters. Electronic Warfare Operator/Technician/Instructor US Navy March 1988  –  March 1998  (10 years 1 month) Electronic Warfare Operator, Technician and Instructor. Specialized on the Raytheon AN/SLQ-32(V)3 Series Electronic Countermeasures System. Electronic Warfare Operator/Technician/Instructor US Navy March 1988  –  March 1998  (10 years 1 month) Electronic Warfare Operator, Technician and Instructor. Specialized on the Raytheon AN/SLQ-32(V)3 Series Electronic Countermeasures System. Languages French Spanish French Spanish French Spanish Skills Top Skills 27 Semiconductors 22 Semiconductor Industry 21 Electronics 19 Ion Implantation 15 Metrology 15 Failure Analysis 14 Field Service 12 SPC 9 Manufacturing 8 Engineering Thom also knows about... 6 Troubleshooting 6 Test Equipment 6 Plasma Etch 5 Silicon 4 Six Sigma 4 Electro-mechanical 3 Preventive Maintenance 3 Lean Manufacturing 3 Continuous Improvement 3 Robotics 2 Vacuum 1 Equipment Maintenance 1 MEMS 1 Soldering 1 Semiconductor Process 1 Clean Rooms 1 Laser 1 Analog 1 Calibration 1 Diffusion 1 Intel 1 Multimeter 1 Semiconductor Device 1 Reliability 1 Schematic See 10+     See less Skills  Top Skills 27 Semiconductors 22 Semiconductor Industry 21 Electronics 19 Ion Implantation 15 Metrology 15 Failure Analysis 14 Field Service 12 SPC 9 Manufacturing 8 Engineering Thom also knows about... 6 Troubleshooting 6 Test Equipment 6 Plasma Etch 5 Silicon 4 Six Sigma 4 Electro-mechanical 3 Preventive Maintenance 3 Lean Manufacturing 3 Continuous Improvement 3 Robotics 2 Vacuum 1 Equipment Maintenance 1 MEMS 1 Soldering 1 Semiconductor Process 1 Clean Rooms 1 Laser 1 Analog 1 Calibration 1 Diffusion 1 Intel 1 Multimeter 1 Semiconductor Device 1 Reliability 1 Schematic See 10+     See less Top Skills 27 Semiconductors 22 Semiconductor Industry 21 Electronics 19 Ion Implantation 15 Metrology 15 Failure Analysis 14 Field Service 12 SPC 9 Manufacturing 8 Engineering Thom also knows about... 6 Troubleshooting 6 Test Equipment 6 Plasma Etch 5 Silicon 4 Six Sigma 4 Electro-mechanical 3 Preventive Maintenance 3 Lean Manufacturing 3 Continuous Improvement 3 Robotics 2 Vacuum 1 Equipment Maintenance 1 MEMS 1 Soldering 1 Semiconductor Process 1 Clean Rooms 1 Laser 1 Analog 1 Calibration 1 Diffusion 1 Intel 1 Multimeter 1 Semiconductor Device 1 Reliability 1 Schematic See 10+     See less Top Skills 27 Semiconductors 22 Semiconductor Industry 21 Electronics 19 Ion Implantation 15 Metrology 15 Failure Analysis 14 Field Service 12 SPC 9 Manufacturing 8 Engineering Thom also knows about... 6 Troubleshooting 6 Test Equipment 6 Plasma Etch 5 Silicon 4 Six Sigma 4 Electro-mechanical 3 Preventive Maintenance 3 Lean Manufacturing 3 Continuous Improvement 3 Robotics 2 Vacuum 1 Equipment Maintenance 1 MEMS 1 Soldering 1 Semiconductor Process 1 Clean Rooms 1 Laser 1 Analog 1 Calibration 1 Diffusion 1 Intel 1 Multimeter 1 Semiconductor Device 1 Reliability 1 Schematic See 10+     See less                     6 Troubleshooting 6 Test Equipment 6 Plasma Etch 5 Silicon 4 Six Sigma 4 Electro-mechanical 3 Preventive Maintenance 3 Lean Manufacturing 3 Continuous Improvement 3 Robotics 2 Vacuum 1 Equipment Maintenance 1 MEMS 1 Soldering 1 Semiconductor Process 1 Clean Rooms 1 Laser 1 Analog 1 Calibration 1 Diffusion 1 Intel 1 Multimeter 1 Semiconductor Device 1 Reliability 1 Schematic Education Community College of New Mexico Electronics Technology; Business Administration 2008  – 2012 Escambia High School 1984  – 1987 Community College of New Mexico Electronics Technology; Business Administration 2008  – 2012 Community College of New Mexico Electronics Technology; Business Administration 2008  – 2012 Community College of New Mexico Electronics Technology; Business Administration 2008  – 2012 Escambia High School 1984  – 1987 Escambia High School 1984  – 1987 Escambia High School 1984  – 1987 Honors & Awards 2006 TIME Person of the Year TIME Magazine December 2006 2006 TIME Person of the Year TIME Magazine December 2006 2006 TIME Person of the Year TIME Magazine December 2006 2006 TIME Person of the Year TIME Magazine December 2006 ", "Experience Senior Manufacturing Technician Intel Corporation Senior Manufacturing Technician Intel Corporation Senior Manufacturing Technician Intel Corporation Skills Skills     ", "Experience Senior Manufacturing Technician Intel Corporation February 2011  – Present (4 years 7 months) FSE Yokogawa May 2007  –  February 2011  (3 years 10 months) Senior Manufacturing Technician Intel Corporation February 2011  – Present (4 years 7 months) Senior Manufacturing Technician Intel Corporation February 2011  – Present (4 years 7 months) FSE Yokogawa May 2007  –  February 2011  (3 years 10 months) FSE Yokogawa May 2007  –  February 2011  (3 years 10 months) Skills Skills     ", "Experience Senior Manufacturing Technician Intel November 2009  – Present (5 years 10 months) 大连 Semiconductor Manufactory equipment maintenance and repair on furnace tools, ASM & Kokusai, and optimization of manufacturing processes, training new engineers and technicians.\n \n2010 Intel China Employee of the Year\n \nJuly.2011-Sept.2011 Learning and Transfer the new semicondutor technology from Intel Ireland as a seed Tech.\n \nApril.2012 Travel to ASM company America one month to learn equipment Level3 as a senior technician\n \nAs a supervisor backup and a MT coordinator, assistant and cooperate Super's daily job, cover the Super rule regularly. Senior Manufacturing Technician Intel Corporation November 2009  – Present (5 years 10 months) Since year 2010. my responsibilities are :Semiconductor Manufactory equipment maintenance and repair on furnace tools, ASM & Kokusai, and optimization of manufacturing processes, training new engineers and technicians. \n Senior Manufacturing Technician Intel November 2009  – Present (5 years 10 months) 大连 Semiconductor Manufactory equipment maintenance and repair on furnace tools, ASM & Kokusai, and optimization of manufacturing processes, training new engineers and technicians.\n \n2010 Intel China Employee of the Year\n \nJuly.2011-Sept.2011 Learning and Transfer the new semicondutor technology from Intel Ireland as a seed Tech.\n \nApril.2012 Travel to ASM company America one month to learn equipment Level3 as a senior technician\n \nAs a supervisor backup and a MT coordinator, assistant and cooperate Super's daily job, cover the Super rule regularly. Senior Manufacturing Technician Intel November 2009  – Present (5 years 10 months) 大连 Semiconductor Manufactory equipment maintenance and repair on furnace tools, ASM & Kokusai, and optimization of manufacturing processes, training new engineers and technicians.\n \n2010 Intel China Employee of the Year\n \nJuly.2011-Sept.2011 Learning and Transfer the new semicondutor technology from Intel Ireland as a seed Tech.\n \nApril.2012 Travel to ASM company America one month to learn equipment Level3 as a senior technician\n \nAs a supervisor backup and a MT coordinator, assistant and cooperate Super's daily job, cover the Super rule regularly. Senior Manufacturing Technician Intel Corporation November 2009  – Present (5 years 10 months) Since year 2010. my responsibilities are :Semiconductor Manufactory equipment maintenance and repair on furnace tools, ASM & Kokusai, and optimization of manufacturing processes, training new engineers and technicians. \n Senior Manufacturing Technician Intel Corporation November 2009  – Present (5 years 10 months) Since year 2010. my responsibilities are :Semiconductor Manufactory equipment maintenance and repair on furnace tools, ASM & Kokusai, and optimization of manufacturing processes, training new engineers and technicians. \n Languages English Native or bilingual proficiency English Native or bilingual proficiency English Native or bilingual proficiency Native or bilingual proficiency Skills Top Skills 2 Embedded Systems 2 Semiconductors 2 Design of Experiments 2 Thin Films 2 CVD 2 Photolithography 2 Silicon 2 Semiconductor Industry 1 R&D 1 SPC Eileen also knows about... 1 Unix 1 Failure Analysis 1 Manufacturing 1 Robotics 1 CMOS 1 C 1 Metrology 1 Engineering Management 1 PECVD 1 Product Management 1 Process Engineering 1 Plasma Etch 1 Semiconductor... 1 IC 1 Matlab 1 Test Equipment 1 PVD 1 JMP 1 Six Sigma 1 RF 1 Linux 1 Product Marketing 1 C++ 1 Electronics 1 Process Simulation 1 Microcontrollers 1 Product Development 1 Competitive Analysis 1 Labview 1 Testing 1 Verilog 1 Debugging See 17+     See less Skills  Top Skills 2 Embedded Systems 2 Semiconductors 2 Design of Experiments 2 Thin Films 2 CVD 2 Photolithography 2 Silicon 2 Semiconductor Industry 1 R&D 1 SPC Eileen also knows about... 1 Unix 1 Failure Analysis 1 Manufacturing 1 Robotics 1 CMOS 1 C 1 Metrology 1 Engineering Management 1 PECVD 1 Product Management 1 Process Engineering 1 Plasma Etch 1 Semiconductor... 1 IC 1 Matlab 1 Test Equipment 1 PVD 1 JMP 1 Six Sigma 1 RF 1 Linux 1 Product Marketing 1 C++ 1 Electronics 1 Process Simulation 1 Microcontrollers 1 Product Development 1 Competitive Analysis 1 Labview 1 Testing 1 Verilog 1 Debugging See 17+     See less Top Skills 2 Embedded Systems 2 Semiconductors 2 Design of Experiments 2 Thin Films 2 CVD 2 Photolithography 2 Silicon 2 Semiconductor Industry 1 R&D 1 SPC Eileen also knows about... 1 Unix 1 Failure Analysis 1 Manufacturing 1 Robotics 1 CMOS 1 C 1 Metrology 1 Engineering Management 1 PECVD 1 Product Management 1 Process Engineering 1 Plasma Etch 1 Semiconductor... 1 IC 1 Matlab 1 Test Equipment 1 PVD 1 JMP 1 Six Sigma 1 RF 1 Linux 1 Product Marketing 1 C++ 1 Electronics 1 Process Simulation 1 Microcontrollers 1 Product Development 1 Competitive Analysis 1 Labview 1 Testing 1 Verilog 1 Debugging See 17+     See less Top Skills 2 Embedded Systems 2 Semiconductors 2 Design of Experiments 2 Thin Films 2 CVD 2 Photolithography 2 Silicon 2 Semiconductor Industry 1 R&D 1 SPC Eileen also knows about... 1 Unix 1 Failure Analysis 1 Manufacturing 1 Robotics 1 CMOS 1 C 1 Metrology 1 Engineering Management 1 PECVD 1 Product Management 1 Process Engineering 1 Plasma Etch 1 Semiconductor... 1 IC 1 Matlab 1 Test Equipment 1 PVD 1 JMP 1 Six Sigma 1 RF 1 Linux 1 Product Marketing 1 C++ 1 Electronics 1 Process Simulation 1 Microcontrollers 1 Product Development 1 Competitive Analysis 1 Labview 1 Testing 1 Verilog 1 Debugging See 17+     See less                     1 Unix 1 Failure Analysis 1 Manufacturing 1 Robotics 1 CMOS 1 C 1 Metrology 1 Engineering Management 1 PECVD 1 Product Management 1 Process Engineering 1 Plasma Etch 1 Semiconductor... 1 IC 1 Matlab 1 Test Equipment 1 PVD 1 JMP 1 Six Sigma 1 RF 1 Linux 1 Product Marketing 1 C++ 1 Electronics 1 Process Simulation 1 Microcontrollers 1 Product Development 1 Competitive Analysis 1 Labview 1 Testing 1 Verilog 1 Debugging Education 东北财经大学 学士,  公司管理 2010  – 2014 大连大学 电子技术 2004  – 2007 东北财经大学 学士,  公司管理 2010  – 2014 东北财经大学 学士,  公司管理 2010  – 2014 东北财经大学 学士,  公司管理 2010  – 2014 大连大学 电子技术 2004  – 2007 大连大学 电子技术 2004  – 2007 大连大学 电子技术 2004  – 2007 ", "Summary Engineering Equipment Technician with wide-ranging experience in repair, maintenance, troubleshooting and engineering of advanced technical equipment. Strong Management skills with critical understanding of business goals, highly organized, exceptional attention to detail, leads by example through accountability and informed decision making. Exceptional safety awareness in critical areas such as; area improvements, coaching and role modeling. Team building and work environment improvement, particularly aware of critical business needs. \nSpecific points. \nEPA universal certification in HVAC. \nSeveral equipment maintenance skills with specialties in the field of Lithography \nInstall qualification experience \nDECON Training \nFacilities equipment experience \nProcess engineering experience \nAssociate in electronics \nWarehouse management experience \nService management experience \n \nSkills:  \nTroubleshooting \nPreventative Maintenance \nEmergency Response first aid, CPR  \nHVAC EPA Universal Certified \nData collection and analysis \nLEAN manufacturing (MX) \nContinuous improvement \nFailure analysts  \nCost Savings \nSafety through job Hazard Analysis \nInventory control \nReading schematics \nBasic pluming skills \nEvent Organization Summary Engineering Equipment Technician with wide-ranging experience in repair, maintenance, troubleshooting and engineering of advanced technical equipment. Strong Management skills with critical understanding of business goals, highly organized, exceptional attention to detail, leads by example through accountability and informed decision making. Exceptional safety awareness in critical areas such as; area improvements, coaching and role modeling. Team building and work environment improvement, particularly aware of critical business needs. \nSpecific points. \nEPA universal certification in HVAC. \nSeveral equipment maintenance skills with specialties in the field of Lithography \nInstall qualification experience \nDECON Training \nFacilities equipment experience \nProcess engineering experience \nAssociate in electronics \nWarehouse management experience \nService management experience \n \nSkills:  \nTroubleshooting \nPreventative Maintenance \nEmergency Response first aid, CPR  \nHVAC EPA Universal Certified \nData collection and analysis \nLEAN manufacturing (MX) \nContinuous improvement \nFailure analysts  \nCost Savings \nSafety through job Hazard Analysis \nInventory control \nReading schematics \nBasic pluming skills \nEvent Organization Engineering Equipment Technician with wide-ranging experience in repair, maintenance, troubleshooting and engineering of advanced technical equipment. Strong Management skills with critical understanding of business goals, highly organized, exceptional attention to detail, leads by example through accountability and informed decision making. Exceptional safety awareness in critical areas such as; area improvements, coaching and role modeling. Team building and work environment improvement, particularly aware of critical business needs. \nSpecific points. \nEPA universal certification in HVAC. \nSeveral equipment maintenance skills with specialties in the field of Lithography \nInstall qualification experience \nDECON Training \nFacilities equipment experience \nProcess engineering experience \nAssociate in electronics \nWarehouse management experience \nService management experience \n \nSkills:  \nTroubleshooting \nPreventative Maintenance \nEmergency Response first aid, CPR  \nHVAC EPA Universal Certified \nData collection and analysis \nLEAN manufacturing (MX) \nContinuous improvement \nFailure analysts  \nCost Savings \nSafety through job Hazard Analysis \nInventory control \nReading schematics \nBasic pluming skills \nEvent Organization Engineering Equipment Technician with wide-ranging experience in repair, maintenance, troubleshooting and engineering of advanced technical equipment. Strong Management skills with critical understanding of business goals, highly organized, exceptional attention to detail, leads by example through accountability and informed decision making. Exceptional safety awareness in critical areas such as; area improvements, coaching and role modeling. Team building and work environment improvement, particularly aware of critical business needs. \nSpecific points. \nEPA universal certification in HVAC. \nSeveral equipment maintenance skills with specialties in the field of Lithography \nInstall qualification experience \nDECON Training \nFacilities equipment experience \nProcess engineering experience \nAssociate in electronics \nWarehouse management experience \nService management experience \n \nSkills:  \nTroubleshooting \nPreventative Maintenance \nEmergency Response first aid, CPR  \nHVAC EPA Universal Certified \nData collection and analysis \nLEAN manufacturing (MX) \nContinuous improvement \nFailure analysts  \nCost Savings \nSafety through job Hazard Analysis \nInventory control \nReading schematics \nBasic pluming skills \nEvent Organization Experience Engineering Technician with HVAC training and EPA universal Certification Intel 2006  – Present (9 years) Hudson MA. -Equipment owner of Lithography ASML Microscan II+ Stepper equipment in a high volume manufacturing factory. \n-Consistently exceeded quality, equipment availability and production output goals, ensuring the timely delivery to worldwide customers both internal and external.  \n-Developed detailed game plans for resolving process and equipment issues through structured problem solving techniques reducing redundant work being performed and decreasing tool downtime.  \n-Developed and performed various experiments to decrease run times and increase equipment availability, resulting in a cost reduction of 4% while increasing the equipment availability and utilization by 7%. \n-Collaborated with various engineering teams across the virtual factory to drive continuous improvement an example of this is the development of a new handling arm to reduce tool handling errors by 50%. Proliferated knowledge and best known procedures to Intel’s worldwide operations.  \n-Led a cost saving project to reduce material consumption by experiment and data collection to save $32,000 annually.  \n-Trained and mentored technicians in process operations, defect analysis, product disposition, preventive maintenance and repairs on ASML Microscan II+. \n-Extensive use SPC++ statistical program, Work stream(manufacturing, product, process tracking program). \n-Authored and maintained various Operational, Process and Maintenance specifications related to the functional area. Developed and led a team of equipment technician and engineers in the reorganization, clarification and simplification of the primary maintenance and repair specification to assure clarity and to help assurance of safety and quality repairs and maintenance. \n-Received advanced maintenance training on the Suss Microtec Spray Coater tool to facilitate maintenance and repair documentation for a new process. This included collaboration with joint engineering from Intel and a secondary company. \n-General maintenance training on Nikon S20X Scanner. (Open) 3 recommendations, including: Steven Pierce Maintenance Engineer at Southbridge Hotel and Confrence Center John Deveto is a very caring, determined, results oriented Saftey/Training/Technical talent. With Johns's help, I was able... View John Trautner Member of Technical Staff - PI Bump Lithography GLOBALFOUNDRIES I had the pleasure of working with John for the past seven years, working directly with him for the past 3 years. John... View 1 more recommendation Emergency Response Team A Lead Intel Corporation 2006  – Present (9 years) Hudson, MA. In addition to the Engineering Technician position i hold at Intel, I am the Team A (Entry/Extraction) Lead for the Emergency Response Team I am responsible for my entry team members safety, this includes check their equipment, making sure the zones are set safely and confirming that the hazards are properly identified .The lead also confirms and consults the Operation Commander to review the plan of action and once approved supervise the gowning and doffing of required Haz Mat equipment. Finally I am responsible for air time (this is the time my members start there air equipment) to keep track of how long they can be in the hazardous zone and when to send in my secondary team to relieve activated member for their safety. Corporate Services Mechanic Intel Corporation 2012  –  2013  (1 year) Hudson Ma 1012 to 2013 (1 year rotation) Corporate Service Mechanic \nResponsible for performing repairs and preventative maintenance on a wide variety of building and facility equipment, fixtures and systems. Installs, troubleshoot, repair and maintain an assortment of facility equipment, mechanical, heating and cooling systems. During my time in corporate services I helped facilitate new work practices by applying lean manufacturing techniques and developed several safety plans of action which also helped in reducing down time and work load. During my time I had 67 safety improvements and 20 area improvements in the way of documented practices and parts control. Process Engineer (tool owner) Intel Corporation March 2011  –  June 2011  (4 months) Hudson Ma SVG Tel Track tool owner responsible for tool maintenance reviews, correction of tool performance, creation of safety procedures, best tool matching and review and resolution of process issues in a timely manure.Tool Maintenance schedule, review, ownership and correction of tool performance. Owner AAMCO 2006  –  2008  (2 years) Supervision of all day to day customer service and showroom tasks guaranteeing customer satisfaction. Managed inventory, wrote and authorized work orders, ensured accuracy for all purchase orders, invoices, and shipping documentation to ensure on-time delivery to clients. Analyzed operations and developed profit and loss reports. As manager, I supervised both routine and custom orders from sale to job completion. Troubleshot and resolve issues in a timely manner, including vendor management and alternative solution generation, negotiated with potential suppliers to obtain maximum return for goods and services. In addition to regular duties, led the planning and launch of satellite showrooms, served as point of contact for the coordination of trade show activities.  \n•\tSales and service Install Qual Technician Intel February 2005  –  September 2006  (1 year 8 months) During this time I was tasked with the installation and product qualification of the ASML Micrascan II+ tools. This required vendor, cooperate service, facility and engineering coordination to achieve on time delivery and set up of 6 scanners, the final 2 scanners where completed before schedule. Senior Process/Equipment Technician, Equipment Coordinator, Training Coordinator,ERT Intel Corporation August 2002  –  2005  (3 years) - Organized and prioritized resources for tool repairs, scheduled maintenance and factory product commitments to ensure factories goals were met while observing Safety, Quality and Output practices in a clean room environment. \n-Performed preventive and corrective maintenance on illumination, focus, stage, reticle and other functional systems associated with the ASML Microscan II+ Stepper. I performed preventive and corrective maintenance on TEL Clean Track Act8 as part of my daily responsibilities.  \n–Tasked with monitoring and adjusting of product process parameters for optimal yield, and on floor contact for engineering experiments. Developed \n-As Training coordinator I monitored the progress of individuals training plans. Assisted the training specialist in reviewing, organizing, and developing plans and training to support factory needs in maintaining various equipment sets ensuring factory production goals and customer product commitments were met.  \n-Member of emergency response team A (entry/extraction team) A member of Team A member is trained for entry into hazardous situations to help any victims affected by the situation and extract them. We are also responsible for suppression and or containment and cleanup of affected area with the use of level A and or B HazMat suites. Senior Manufacturing Technician Intel Corporation 2000  –  2002  (2 years) -Team Lead : Provided shift area health and production reports at factory level production meetings. \n-Trained Process Technicians - responsible for visual inspection of semiconductor devices, analyzed statistical charts, identified defects and trends attributed to process and tool performance maintaining high yielding quality production material utilizing state of the art metrology equipment. \n-Coordinated production runs, balancing product priorities, tool configurations and factory goals. \n-Acquired knowledge of SVG tracks, TEL track, and ASML Microscan II+ Stepper. Warehouse manager Simon Manges Inc June 1996  –  June 1998  (2 years 1 month) Inventory control, shipping schedules, receiving, material estimates. Customer interaction and relations. project problem and concern troubleshooting. Responsible for day to day scheduling and deployment of job crews and supplies. Primarily responsible for the quality of the end product. . Service Manager Patterson, Flynn and Martin Inc. 1987  –  1996  (9 years) Direct interaction between sales, warehouse, supplier and customer in order to facilitate job projects and assure customer satisfaction. Responsible for: inventory control, product quality control, Service control, shipping and delivery. Primarily responsible for customer satisfaction and job completion. Engineering Technician with HVAC training and EPA universal Certification Intel 2006  – Present (9 years) Hudson MA. -Equipment owner of Lithography ASML Microscan II+ Stepper equipment in a high volume manufacturing factory. \n-Consistently exceeded quality, equipment availability and production output goals, ensuring the timely delivery to worldwide customers both internal and external.  \n-Developed detailed game plans for resolving process and equipment issues through structured problem solving techniques reducing redundant work being performed and decreasing tool downtime.  \n-Developed and performed various experiments to decrease run times and increase equipment availability, resulting in a cost reduction of 4% while increasing the equipment availability and utilization by 7%. \n-Collaborated with various engineering teams across the virtual factory to drive continuous improvement an example of this is the development of a new handling arm to reduce tool handling errors by 50%. Proliferated knowledge and best known procedures to Intel’s worldwide operations.  \n-Led a cost saving project to reduce material consumption by experiment and data collection to save $32,000 annually.  \n-Trained and mentored technicians in process operations, defect analysis, product disposition, preventive maintenance and repairs on ASML Microscan II+. \n-Extensive use SPC++ statistical program, Work stream(manufacturing, product, process tracking program). \n-Authored and maintained various Operational, Process and Maintenance specifications related to the functional area. Developed and led a team of equipment technician and engineers in the reorganization, clarification and simplification of the primary maintenance and repair specification to assure clarity and to help assurance of safety and quality repairs and maintenance. \n-Received advanced maintenance training on the Suss Microtec Spray Coater tool to facilitate maintenance and repair documentation for a new process. This included collaboration with joint engineering from Intel and a secondary company. \n-General maintenance training on Nikon S20X Scanner. (Open) 3 recommendations, including: Steven Pierce Maintenance Engineer at Southbridge Hotel and Confrence Center John Deveto is a very caring, determined, results oriented Saftey/Training/Technical talent. With Johns's help, I was able... View John Trautner Member of Technical Staff - PI Bump Lithography GLOBALFOUNDRIES I had the pleasure of working with John for the past seven years, working directly with him for the past 3 years. John... View 1 more recommendation Engineering Technician with HVAC training and EPA universal Certification Intel 2006  – Present (9 years) Hudson MA. -Equipment owner of Lithography ASML Microscan II+ Stepper equipment in a high volume manufacturing factory. \n-Consistently exceeded quality, equipment availability and production output goals, ensuring the timely delivery to worldwide customers both internal and external.  \n-Developed detailed game plans for resolving process and equipment issues through structured problem solving techniques reducing redundant work being performed and decreasing tool downtime.  \n-Developed and performed various experiments to decrease run times and increase equipment availability, resulting in a cost reduction of 4% while increasing the equipment availability and utilization by 7%. \n-Collaborated with various engineering teams across the virtual factory to drive continuous improvement an example of this is the development of a new handling arm to reduce tool handling errors by 50%. Proliferated knowledge and best known procedures to Intel’s worldwide operations.  \n-Led a cost saving project to reduce material consumption by experiment and data collection to save $32,000 annually.  \n-Trained and mentored technicians in process operations, defect analysis, product disposition, preventive maintenance and repairs on ASML Microscan II+. \n-Extensive use SPC++ statistical program, Work stream(manufacturing, product, process tracking program). \n-Authored and maintained various Operational, Process and Maintenance specifications related to the functional area. Developed and led a team of equipment technician and engineers in the reorganization, clarification and simplification of the primary maintenance and repair specification to assure clarity and to help assurance of safety and quality repairs and maintenance. \n-Received advanced maintenance training on the Suss Microtec Spray Coater tool to facilitate maintenance and repair documentation for a new process. This included collaboration with joint engineering from Intel and a secondary company. \n-General maintenance training on Nikon S20X Scanner. (Open) 3 recommendations, including: Steven Pierce Maintenance Engineer at Southbridge Hotel and Confrence Center John Deveto is a very caring, determined, results oriented Saftey/Training/Technical talent. With Johns's help, I was able... View John Trautner Member of Technical Staff - PI Bump Lithography GLOBALFOUNDRIES I had the pleasure of working with John for the past seven years, working directly with him for the past 3 years. John... View 1 more recommendation Emergency Response Team A Lead Intel Corporation 2006  – Present (9 years) Hudson, MA. In addition to the Engineering Technician position i hold at Intel, I am the Team A (Entry/Extraction) Lead for the Emergency Response Team I am responsible for my entry team members safety, this includes check their equipment, making sure the zones are set safely and confirming that the hazards are properly identified .The lead also confirms and consults the Operation Commander to review the plan of action and once approved supervise the gowning and doffing of required Haz Mat equipment. Finally I am responsible for air time (this is the time my members start there air equipment) to keep track of how long they can be in the hazardous zone and when to send in my secondary team to relieve activated member for their safety. Emergency Response Team A Lead Intel Corporation 2006  – Present (9 years) Hudson, MA. In addition to the Engineering Technician position i hold at Intel, I am the Team A (Entry/Extraction) Lead for the Emergency Response Team I am responsible for my entry team members safety, this includes check their equipment, making sure the zones are set safely and confirming that the hazards are properly identified .The lead also confirms and consults the Operation Commander to review the plan of action and once approved supervise the gowning and doffing of required Haz Mat equipment. Finally I am responsible for air time (this is the time my members start there air equipment) to keep track of how long they can be in the hazardous zone and when to send in my secondary team to relieve activated member for their safety. Corporate Services Mechanic Intel Corporation 2012  –  2013  (1 year) Hudson Ma 1012 to 2013 (1 year rotation) Corporate Service Mechanic \nResponsible for performing repairs and preventative maintenance on a wide variety of building and facility equipment, fixtures and systems. Installs, troubleshoot, repair and maintain an assortment of facility equipment, mechanical, heating and cooling systems. During my time in corporate services I helped facilitate new work practices by applying lean manufacturing techniques and developed several safety plans of action which also helped in reducing down time and work load. During my time I had 67 safety improvements and 20 area improvements in the way of documented practices and parts control. Corporate Services Mechanic Intel Corporation 2012  –  2013  (1 year) Hudson Ma 1012 to 2013 (1 year rotation) Corporate Service Mechanic \nResponsible for performing repairs and preventative maintenance on a wide variety of building and facility equipment, fixtures and systems. Installs, troubleshoot, repair and maintain an assortment of facility equipment, mechanical, heating and cooling systems. During my time in corporate services I helped facilitate new work practices by applying lean manufacturing techniques and developed several safety plans of action which also helped in reducing down time and work load. During my time I had 67 safety improvements and 20 area improvements in the way of documented practices and parts control. Process Engineer (tool owner) Intel Corporation March 2011  –  June 2011  (4 months) Hudson Ma SVG Tel Track tool owner responsible for tool maintenance reviews, correction of tool performance, creation of safety procedures, best tool matching and review and resolution of process issues in a timely manure.Tool Maintenance schedule, review, ownership and correction of tool performance. Process Engineer (tool owner) Intel Corporation March 2011  –  June 2011  (4 months) Hudson Ma SVG Tel Track tool owner responsible for tool maintenance reviews, correction of tool performance, creation of safety procedures, best tool matching and review and resolution of process issues in a timely manure.Tool Maintenance schedule, review, ownership and correction of tool performance. Owner AAMCO 2006  –  2008  (2 years) Supervision of all day to day customer service and showroom tasks guaranteeing customer satisfaction. Managed inventory, wrote and authorized work orders, ensured accuracy for all purchase orders, invoices, and shipping documentation to ensure on-time delivery to clients. Analyzed operations and developed profit and loss reports. As manager, I supervised both routine and custom orders from sale to job completion. Troubleshot and resolve issues in a timely manner, including vendor management and alternative solution generation, negotiated with potential suppliers to obtain maximum return for goods and services. In addition to regular duties, led the planning and launch of satellite showrooms, served as point of contact for the coordination of trade show activities.  \n•\tSales and service Owner AAMCO 2006  –  2008  (2 years) Supervision of all day to day customer service and showroom tasks guaranteeing customer satisfaction. Managed inventory, wrote and authorized work orders, ensured accuracy for all purchase orders, invoices, and shipping documentation to ensure on-time delivery to clients. Analyzed operations and developed profit and loss reports. As manager, I supervised both routine and custom orders from sale to job completion. Troubleshot and resolve issues in a timely manner, including vendor management and alternative solution generation, negotiated with potential suppliers to obtain maximum return for goods and services. In addition to regular duties, led the planning and launch of satellite showrooms, served as point of contact for the coordination of trade show activities.  \n•\tSales and service Install Qual Technician Intel February 2005  –  September 2006  (1 year 8 months) During this time I was tasked with the installation and product qualification of the ASML Micrascan II+ tools. This required vendor, cooperate service, facility and engineering coordination to achieve on time delivery and set up of 6 scanners, the final 2 scanners where completed before schedule. Install Qual Technician Intel February 2005  –  September 2006  (1 year 8 months) During this time I was tasked with the installation and product qualification of the ASML Micrascan II+ tools. This required vendor, cooperate service, facility and engineering coordination to achieve on time delivery and set up of 6 scanners, the final 2 scanners where completed before schedule. Senior Process/Equipment Technician, Equipment Coordinator, Training Coordinator,ERT Intel Corporation August 2002  –  2005  (3 years) - Organized and prioritized resources for tool repairs, scheduled maintenance and factory product commitments to ensure factories goals were met while observing Safety, Quality and Output practices in a clean room environment. \n-Performed preventive and corrective maintenance on illumination, focus, stage, reticle and other functional systems associated with the ASML Microscan II+ Stepper. I performed preventive and corrective maintenance on TEL Clean Track Act8 as part of my daily responsibilities.  \n–Tasked with monitoring and adjusting of product process parameters for optimal yield, and on floor contact for engineering experiments. Developed \n-As Training coordinator I monitored the progress of individuals training plans. Assisted the training specialist in reviewing, organizing, and developing plans and training to support factory needs in maintaining various equipment sets ensuring factory production goals and customer product commitments were met.  \n-Member of emergency response team A (entry/extraction team) A member of Team A member is trained for entry into hazardous situations to help any victims affected by the situation and extract them. We are also responsible for suppression and or containment and cleanup of affected area with the use of level A and or B HazMat suites. Senior Process/Equipment Technician, Equipment Coordinator, Training Coordinator,ERT Intel Corporation August 2002  –  2005  (3 years) - Organized and prioritized resources for tool repairs, scheduled maintenance and factory product commitments to ensure factories goals were met while observing Safety, Quality and Output practices in a clean room environment. \n-Performed preventive and corrective maintenance on illumination, focus, stage, reticle and other functional systems associated with the ASML Microscan II+ Stepper. I performed preventive and corrective maintenance on TEL Clean Track Act8 as part of my daily responsibilities.  \n–Tasked with monitoring and adjusting of product process parameters for optimal yield, and on floor contact for engineering experiments. Developed \n-As Training coordinator I monitored the progress of individuals training plans. Assisted the training specialist in reviewing, organizing, and developing plans and training to support factory needs in maintaining various equipment sets ensuring factory production goals and customer product commitments were met.  \n-Member of emergency response team A (entry/extraction team) A member of Team A member is trained for entry into hazardous situations to help any victims affected by the situation and extract them. We are also responsible for suppression and or containment and cleanup of affected area with the use of level A and or B HazMat suites. Senior Manufacturing Technician Intel Corporation 2000  –  2002  (2 years) -Team Lead : Provided shift area health and production reports at factory level production meetings. \n-Trained Process Technicians - responsible for visual inspection of semiconductor devices, analyzed statistical charts, identified defects and trends attributed to process and tool performance maintaining high yielding quality production material utilizing state of the art metrology equipment. \n-Coordinated production runs, balancing product priorities, tool configurations and factory goals. \n-Acquired knowledge of SVG tracks, TEL track, and ASML Microscan II+ Stepper. Senior Manufacturing Technician Intel Corporation 2000  –  2002  (2 years) -Team Lead : Provided shift area health and production reports at factory level production meetings. \n-Trained Process Technicians - responsible for visual inspection of semiconductor devices, analyzed statistical charts, identified defects and trends attributed to process and tool performance maintaining high yielding quality production material utilizing state of the art metrology equipment. \n-Coordinated production runs, balancing product priorities, tool configurations and factory goals. \n-Acquired knowledge of SVG tracks, TEL track, and ASML Microscan II+ Stepper. Warehouse manager Simon Manges Inc June 1996  –  June 1998  (2 years 1 month) Inventory control, shipping schedules, receiving, material estimates. Customer interaction and relations. project problem and concern troubleshooting. Responsible for day to day scheduling and deployment of job crews and supplies. Primarily responsible for the quality of the end product. . Warehouse manager Simon Manges Inc June 1996  –  June 1998  (2 years 1 month) Inventory control, shipping schedules, receiving, material estimates. Customer interaction and relations. project problem and concern troubleshooting. Responsible for day to day scheduling and deployment of job crews and supplies. Primarily responsible for the quality of the end product. . Service Manager Patterson, Flynn and Martin Inc. 1987  –  1996  (9 years) Direct interaction between sales, warehouse, supplier and customer in order to facilitate job projects and assure customer satisfaction. Responsible for: inventory control, product quality control, Service control, shipping and delivery. Primarily responsible for customer satisfaction and job completion. Service Manager Patterson, Flynn and Martin Inc. 1987  –  1996  (9 years) Direct interaction between sales, warehouse, supplier and customer in order to facilitate job projects and assure customer satisfaction. Responsible for: inventory control, product quality control, Service control, shipping and delivery. Primarily responsible for customer satisfaction and job completion. Languages English English English Skills Top Skills 68 Manufacturing 63 Lean Manufacturing 3 Process Improvement 43 SPC 36 Preventive Maintenance 35 Continuous Improvement 29 Electronics 28 Failure Analysis 29 Troubleshooting 24 Metrology John P. also knows about... 24 Lithography 20 Design of Experiments 20 Test Equipment 14 Cross-functional Team... 14 Root Cause Analysis 10 Intel 10 JMP 8 Semiconductor Industry 5 Pneumatics 5 Problem Solving 4 Reliability 4 Equipment Maintenance 3 Event Planning 3 Semiconductor... 3 Operations Management 3 Process Engineering 71 Semiconductors 3 Engineering 2 Data Collection 2 Debugging 2 Engineers 1 Inventory Control 0 Cost Savings 0 Cpr Certified See 9+     See less Skills  Top Skills 68 Manufacturing 63 Lean Manufacturing 3 Process Improvement 43 SPC 36 Preventive Maintenance 35 Continuous Improvement 29 Electronics 28 Failure Analysis 29 Troubleshooting 24 Metrology John P. also knows about... 24 Lithography 20 Design of Experiments 20 Test Equipment 14 Cross-functional Team... 14 Root Cause Analysis 10 Intel 10 JMP 8 Semiconductor Industry 5 Pneumatics 5 Problem Solving 4 Reliability 4 Equipment Maintenance 3 Event Planning 3 Semiconductor... 3 Operations Management 3 Process Engineering 71 Semiconductors 3 Engineering 2 Data Collection 2 Debugging 2 Engineers 1 Inventory Control 0 Cost Savings 0 Cpr Certified See 9+     See less Top Skills 68 Manufacturing 63 Lean Manufacturing 3 Process Improvement 43 SPC 36 Preventive Maintenance 35 Continuous Improvement 29 Electronics 28 Failure Analysis 29 Troubleshooting 24 Metrology John P. also knows about... 24 Lithography 20 Design of Experiments 20 Test Equipment 14 Cross-functional Team... 14 Root Cause Analysis 10 Intel 10 JMP 8 Semiconductor Industry 5 Pneumatics 5 Problem Solving 4 Reliability 4 Equipment Maintenance 3 Event Planning 3 Semiconductor... 3 Operations Management 3 Process Engineering 71 Semiconductors 3 Engineering 2 Data Collection 2 Debugging 2 Engineers 1 Inventory Control 0 Cost Savings 0 Cpr Certified See 9+     See less Top Skills 68 Manufacturing 63 Lean Manufacturing 3 Process Improvement 43 SPC 36 Preventive Maintenance 35 Continuous Improvement 29 Electronics 28 Failure Analysis 29 Troubleshooting 24 Metrology John P. also knows about... 24 Lithography 20 Design of Experiments 20 Test Equipment 14 Cross-functional Team... 14 Root Cause Analysis 10 Intel 10 JMP 8 Semiconductor Industry 5 Pneumatics 5 Problem Solving 4 Reliability 4 Equipment Maintenance 3 Event Planning 3 Semiconductor... 3 Operations Management 3 Process Engineering 71 Semiconductors 3 Engineering 2 Data Collection 2 Debugging 2 Engineers 1 Inventory Control 0 Cost Savings 0 Cpr Certified See 9+     See less                     24 Lithography 20 Design of Experiments 20 Test Equipment 14 Cross-functional Team... 14 Root Cause Analysis 10 Intel 10 JMP 8 Semiconductor Industry 5 Pneumatics 5 Problem Solving 4 Reliability 4 Equipment Maintenance 3 Event Planning 3 Semiconductor... 3 Operations Management 3 Process Engineering 71 Semiconductors 3 Engineering 2 Data Collection 2 Debugging 2 Engineers 1 Inventory Control 0 Cost Savings 0 Cpr Certified Education Quinsigamond Community College Refrigeration License,  Heating ,  Air Conditioning ,  Ventilation and Refrigeration , 3.75 2013  – 2014 (Open) 1 honor or award Deans List First semester grade average (4 coarse) 3.75\nAc hived while working full time View DeVry University Associate's degree,  Electronics Technology 1998  – 2000 Quinsigamond Community College Refrigeration License,  Heating ,  Air Conditioning ,  Ventilation and Refrigeration , 3.75 2013  – 2014 (Open) 1 honor or award Deans List First semester grade average (4 coarse) 3.75\nAc hived while working full time View Quinsigamond Community College Refrigeration License,  Heating ,  Air Conditioning ,  Ventilation and Refrigeration , 3.75 2013  – 2014 (Open) 1 honor or award Deans List First semester grade average (4 coarse) 3.75\nAc hived while working full time View Quinsigamond Community College Refrigeration License,  Heating ,  Air Conditioning ,  Ventilation and Refrigeration , 3.75 2013  – 2014 (Open) 1 honor or award Deans List First semester grade average (4 coarse) 3.75\nAc hived while working full time View DeVry University Associate's degree,  Electronics Technology 1998  – 2000 DeVry University Associate's degree,  Electronics Technology 1998  – 2000 DeVry University Associate's degree,  Electronics Technology 1998  – 2000 Honors & Awards Deans List QCC December 2013 First semester grade average (4 coarse) 3.75  \nAc hived while working full time Deans List QCC December 2013 First semester grade average (4 coarse) 3.75  \nAc hived while working full time Deans List QCC December 2013 First semester grade average (4 coarse) 3.75  \nAc hived while working full time Deans List QCC December 2013 First semester grade average (4 coarse) 3.75  \nAc hived while working full time ", "Experience Automation Technician Intel February 2012  – Present (3 years 7 months) INTEL AFO Senior Manufacturing Technician Intel Corporation October 2000  –  February 2012  (11 years 5 months) Intel RA Copier Service Tech Inland April 1998  –  September 2000  (2 years 6 months) Inland Business Systems Automation Technician Intel February 2012  – Present (3 years 7 months) INTEL AFO Automation Technician Intel February 2012  – Present (3 years 7 months) INTEL AFO Senior Manufacturing Technician Intel Corporation October 2000  –  February 2012  (11 years 5 months) Intel RA Senior Manufacturing Technician Intel Corporation October 2000  –  February 2012  (11 years 5 months) Intel RA Copier Service Tech Inland April 1998  –  September 2000  (2 years 6 months) Inland Business Systems Copier Service Tech Inland April 1998  –  September 2000  (2 years 6 months) Inland Business Systems Skills Skills     Education ITT BS/EET 1997  – 2000 ITT BS/EET 1997  – 2000 ITT BS/EET 1997  – 2000 ITT BS/EET 1997  – 2000 ", "Summary resume6-9 Edit Summary resume6-9 Edit   resume6-9 Edit resume6-9 Edit resume6-9 Edit resume6-9  resume6-9  Experience Dry Etch Process Engineer Intel Corporation January 2014  – Present (1 year 8 months) Albuquerque, New Mexico Area Responsible for Dry Etch Process/equipment issues and continuous improvement. Wet Etch Process Engineer Intel Corporation August 2012  –  December 2013  (1 year 5 months) •\tWet Station Rotation Engineer; maintain DNS wet station overall health and continuous improvement.  \n•\tResolve tools/ process issues such as Particles, Etch Rate, and Tracers. Senior Equipment Technician/Process Technician Intel Corporation January 2001  –  July 2012  (11 years 7 months) Level 2 process certified PCMT with responsibility for all process issues in the Etch (Telius) area such as custom etch wafers, wafer recovery, and excursion prevention. \nTelius L3 certifier for Telius etcher maintenance and tool modifications/upgrades. \nCoordinated equipment for daily activities with ROC/Bay/Equipment MTs, and Engineering. \nAdvanced troubleshooting and assisted engineers with process/hardware troubleshooting. \nWorked with engineers on continuous improvement for Telius equipment/process issues. \nDesigned and implemented wafer transfer ring to eliminated issues during wafer centering check.  \nDesigned and implemented Delrin screw driver to eliminated Aluminum particle on Telius system. \nResponsible for L2/3 MT equipment training. Senior Manufacturing Technician Intel Corporation January 1990  –  January 2001  (11 years 1 month) Responsible for all aspects of the LRC (Lam Research Corporation) Rainbow models etcher and Tel Unity II Oxide Etcher maintenance, troubleshooting, MT training and process project coordination. \nEquipment Coordinator for assigning daily tasks and projects with peers, support groups, production supervisors, process engineers, equipment engineers, and other shifts. Dry Etch Process Engineer Intel Corporation January 2014  – Present (1 year 8 months) Albuquerque, New Mexico Area Responsible for Dry Etch Process/equipment issues and continuous improvement. Dry Etch Process Engineer Intel Corporation January 2014  – Present (1 year 8 months) Albuquerque, New Mexico Area Responsible for Dry Etch Process/equipment issues and continuous improvement. Wet Etch Process Engineer Intel Corporation August 2012  –  December 2013  (1 year 5 months) •\tWet Station Rotation Engineer; maintain DNS wet station overall health and continuous improvement.  \n•\tResolve tools/ process issues such as Particles, Etch Rate, and Tracers. Wet Etch Process Engineer Intel Corporation August 2012  –  December 2013  (1 year 5 months) •\tWet Station Rotation Engineer; maintain DNS wet station overall health and continuous improvement.  \n•\tResolve tools/ process issues such as Particles, Etch Rate, and Tracers. Senior Equipment Technician/Process Technician Intel Corporation January 2001  –  July 2012  (11 years 7 months) Level 2 process certified PCMT with responsibility for all process issues in the Etch (Telius) area such as custom etch wafers, wafer recovery, and excursion prevention. \nTelius L3 certifier for Telius etcher maintenance and tool modifications/upgrades. \nCoordinated equipment for daily activities with ROC/Bay/Equipment MTs, and Engineering. \nAdvanced troubleshooting and assisted engineers with process/hardware troubleshooting. \nWorked with engineers on continuous improvement for Telius equipment/process issues. \nDesigned and implemented wafer transfer ring to eliminated issues during wafer centering check.  \nDesigned and implemented Delrin screw driver to eliminated Aluminum particle on Telius system. \nResponsible for L2/3 MT equipment training. Senior Equipment Technician/Process Technician Intel Corporation January 2001  –  July 2012  (11 years 7 months) Level 2 process certified PCMT with responsibility for all process issues in the Etch (Telius) area such as custom etch wafers, wafer recovery, and excursion prevention. \nTelius L3 certifier for Telius etcher maintenance and tool modifications/upgrades. \nCoordinated equipment for daily activities with ROC/Bay/Equipment MTs, and Engineering. \nAdvanced troubleshooting and assisted engineers with process/hardware troubleshooting. \nWorked with engineers on continuous improvement for Telius equipment/process issues. \nDesigned and implemented wafer transfer ring to eliminated issues during wafer centering check.  \nDesigned and implemented Delrin screw driver to eliminated Aluminum particle on Telius system. \nResponsible for L2/3 MT equipment training. Senior Manufacturing Technician Intel Corporation January 1990  –  January 2001  (11 years 1 month) Responsible for all aspects of the LRC (Lam Research Corporation) Rainbow models etcher and Tel Unity II Oxide Etcher maintenance, troubleshooting, MT training and process project coordination. \nEquipment Coordinator for assigning daily tasks and projects with peers, support groups, production supervisors, process engineers, equipment engineers, and other shifts. Senior Manufacturing Technician Intel Corporation January 1990  –  January 2001  (11 years 1 month) Responsible for all aspects of the LRC (Lam Research Corporation) Rainbow models etcher and Tel Unity II Oxide Etcher maintenance, troubleshooting, MT training and process project coordination. \nEquipment Coordinator for assigning daily tasks and projects with peers, support groups, production supervisors, process engineers, equipment engineers, and other shifts. Languages Chinese Native or bilingual proficiency English Full professional proficiency Chinese Native or bilingual proficiency English Full professional proficiency Chinese Native or bilingual proficiency English Full professional proficiency Native or bilingual proficiency Full professional proficiency Skills Top 5 0 Semiconductors 0 Metrology 0 Semiconductor Industry 0 Intel 0 JMP jai quan kai also knows about... 0 Etching 0 Silicon 0 SPC 0 Plasma Etch 0 Manufacturing 0 Troubleshooting 0 Engineering 0 Continuous Improvement 0 Failure Analysis 0 IC 0 Electronics 0 Thin Films 0 Design of Experiments 0 CVD Skills  Top 5 0 Semiconductors 0 Metrology 0 Semiconductor Industry 0 Intel 0 JMP jai quan kai also knows about... 0 Etching 0 Silicon 0 SPC 0 Plasma Etch 0 Manufacturing 0 Troubleshooting 0 Engineering 0 Continuous Improvement 0 Failure Analysis 0 IC 0 Electronics 0 Thin Films 0 Design of Experiments 0 CVD Top 5 0 Semiconductors 0 Metrology 0 Semiconductor Industry 0 Intel 0 JMP jai quan kai also knows about... 0 Etching 0 Silicon 0 SPC 0 Plasma Etch 0 Manufacturing 0 Troubleshooting 0 Engineering 0 Continuous Improvement 0 Failure Analysis 0 IC 0 Electronics 0 Thin Films 0 Design of Experiments 0 CVD Top 5 0 Semiconductors 0 Metrology 0 Semiconductor Industry 0 Intel 0 JMP jai quan kai also knows about... 0 Etching 0 Silicon 0 SPC 0 Plasma Etch 0 Manufacturing 0 Troubleshooting 0 Engineering 0 Continuous Improvement 0 Failure Analysis 0 IC 0 Electronics 0 Thin Films 0 Design of Experiments 0 CVD           0 Etching 0 Silicon 0 SPC 0 Plasma Etch 0 Manufacturing 0 Troubleshooting 0 Engineering 0 Continuous Improvement 0 Failure Analysis 0 IC 0 Electronics 0 Thin Films 0 Design of Experiments 0 CVD Education The University of New Mexico Bachelor of Science,  Electrical Engineering 2006  – 2011 The University of New Mexico Bachelor of Science,  Electrical Engineering 2006  – 2011 The University of New Mexico Bachelor of Science,  Electrical Engineering 2006  – 2011 The University of New Mexico Bachelor of Science,  Electrical Engineering 2006  – 2011 ", "Experience Senior Manufacturing Technician Intel Corporation November 2006  – Present (8 years 10 months) Operating semiconductor fab equipment, troubleshooting mechanical and software errors on the equipment and the assembly line, maintaining the equipment. Diagnosing and dispositioning out-of-spec output. On-call Tutor Santa Monica College January 2000  –  June 2001  (1 year 6 months) Santa Monica, CA Tutored drop-in students in math, physics, chemistry, biology, Japanese, and English. Senior Manufacturing Technician Intel Corporation November 2006  – Present (8 years 10 months) Operating semiconductor fab equipment, troubleshooting mechanical and software errors on the equipment and the assembly line, maintaining the equipment. Diagnosing and dispositioning out-of-spec output. Senior Manufacturing Technician Intel Corporation November 2006  – Present (8 years 10 months) Operating semiconductor fab equipment, troubleshooting mechanical and software errors on the equipment and the assembly line, maintaining the equipment. Diagnosing and dispositioning out-of-spec output. On-call Tutor Santa Monica College January 2000  –  June 2001  (1 year 6 months) Santa Monica, CA Tutored drop-in students in math, physics, chemistry, biology, Japanese, and English. On-call Tutor Santa Monica College January 2000  –  June 2001  (1 year 6 months) Santa Monica, CA Tutored drop-in students in math, physics, chemistry, biology, Japanese, and English. Languages English Russian Persian (Farsi) Japanese Spanish English Russian Persian (Farsi) Japanese Spanish English Russian Persian (Farsi) Japanese Spanish Skills Top 5 0 Semiconductors 0 Physics 0 Troubleshooting 0 Manufacturing 0 R&D Ralph also knows about... 0 Tutoring 0 Management 0 Testing 0 Engineering 0 Research 0 Russian 0 Japanese Skills  Top 5 0 Semiconductors 0 Physics 0 Troubleshooting 0 Manufacturing 0 R&D Ralph also knows about... 0 Tutoring 0 Management 0 Testing 0 Engineering 0 Research 0 Russian 0 Japanese Top 5 0 Semiconductors 0 Physics 0 Troubleshooting 0 Manufacturing 0 R&D Ralph also knows about... 0 Tutoring 0 Management 0 Testing 0 Engineering 0 Research 0 Russian 0 Japanese Top 5 0 Semiconductors 0 Physics 0 Troubleshooting 0 Manufacturing 0 R&D Ralph also knows about... 0 Tutoring 0 Management 0 Testing 0 Engineering 0 Research 0 Russian 0 Japanese           0 Tutoring 0 Management 0 Testing 0 Engineering 0 Research 0 Russian 0 Japanese Education University of California, Los Angeles Bachelor’s Degree,  Chemistry 2001  – 2004 Chemistry degree and two years of Persian language, and fell in love with and married my wife. Occidental College Bachelor’s Degree,  Mathematics 1985  – 1991 University of California, Los Angeles Bachelor’s Degree,  Chemistry 2001  – 2004 Chemistry degree and two years of Persian language, and fell in love with and married my wife. University of California, Los Angeles Bachelor’s Degree,  Chemistry 2001  – 2004 Chemistry degree and two years of Persian language, and fell in love with and married my wife. University of California, Los Angeles Bachelor’s Degree,  Chemistry 2001  – 2004 Chemistry degree and two years of Persian language, and fell in love with and married my wife. Occidental College Bachelor’s Degree,  Mathematics 1985  – 1991 Occidental College Bachelor’s Degree,  Mathematics 1985  – 1991 Occidental College Bachelor’s Degree,  Mathematics 1985  – 1991 ", "Experience Field Service Engineer FEI Company August 2014  – Present (1 year 1 month) Santa Fe, New Mexico Area Silicon Photonics Development Technician (BBR) Intel Corporation January 2014  –  August 2014  (8 months) Rio Rancho, NM F11x How Silicon Photonics Works Edit Senior Manufacturing Technician Intel Corporation August 2010  –  January 2014  (3 years 6 months) Fab11x, Albuquerque, New Mexico Area Ion Implant Field Service Engineer Retronix Semiconductor October 2009  –  July 2010  (10 months) Various customer locations Ion Implant Process Engineering Technician/Tool owner Intel Corporation June 2004  –  July 2009  (5 years 2 months) Fab23, Colorado Springs, Colorado (Open) 1 recommendation Scott Werner Chief Operating Officer at Diamond Wire Material Technologies Warren is an extremely detail, quality oriented person. He has extremely good troubleshooting (electrical/mechanical/pneumatic/etc) and poka-yoke (error proofing) skills and consistently displays a positive attitude and outlook. View Senior Ion Implant Maintenance Technician Atmel Corporation October 1995  –  June 2004  (8 years 9 months) Fab3/5, Colorado Springs, Colorado (Open) 1 recommendation James King Equipment Maintenance Technician at Samtec Microelectronics During our time at Intel and ATMEL, Warren always demonstrated exceptional organizational skills as well as the ability to successfully multi task and manage workloads. He demonstrated a very strong work ethic and proficient troubleshooting skills.... View Maintenance Technician Quantum Corporation August 1994  –  October 1995  (1 year 3 months) Colorado Springs, Colorado Fire Control Electronics Technician US NAVY July 1988  –  July 1994  (6 years 1 month) Phalanx CIWS, NATO SeaSparrow Field Service Engineer FEI Company August 2014  – Present (1 year 1 month) Santa Fe, New Mexico Area Field Service Engineer FEI Company August 2014  – Present (1 year 1 month) Santa Fe, New Mexico Area Silicon Photonics Development Technician (BBR) Intel Corporation January 2014  –  August 2014  (8 months) Rio Rancho, NM F11x How Silicon Photonics Works Edit Silicon Photonics Development Technician (BBR) Intel Corporation January 2014  –  August 2014  (8 months) Rio Rancho, NM F11x How Silicon Photonics Works Edit How Silicon Photonics Works Edit How Silicon Photonics Works Edit How Silicon Photonics Works  How Silicon Photonics Works  Senior Manufacturing Technician Intel Corporation August 2010  –  January 2014  (3 years 6 months) Fab11x, Albuquerque, New Mexico Area Senior Manufacturing Technician Intel Corporation August 2010  –  January 2014  (3 years 6 months) Fab11x, Albuquerque, New Mexico Area Ion Implant Field Service Engineer Retronix Semiconductor October 2009  –  July 2010  (10 months) Various customer locations Ion Implant Field Service Engineer Retronix Semiconductor October 2009  –  July 2010  (10 months) Various customer locations Ion Implant Process Engineering Technician/Tool owner Intel Corporation June 2004  –  July 2009  (5 years 2 months) Fab23, Colorado Springs, Colorado (Open) 1 recommendation Scott Werner Chief Operating Officer at Diamond Wire Material Technologies Warren is an extremely detail, quality oriented person. He has extremely good troubleshooting (electrical/mechanical/pneumatic/etc) and poka-yoke (error proofing) skills and consistently displays a positive attitude and outlook. View Ion Implant Process Engineering Technician/Tool owner Intel Corporation June 2004  –  July 2009  (5 years 2 months) Fab23, Colorado Springs, Colorado (Open) 1 recommendation Scott Werner Chief Operating Officer at Diamond Wire Material Technologies Warren is an extremely detail, quality oriented person. He has extremely good troubleshooting (electrical/mechanical/pneumatic/etc) and poka-yoke (error proofing) skills and consistently displays a positive attitude and outlook. View Senior Ion Implant Maintenance Technician Atmel Corporation October 1995  –  June 2004  (8 years 9 months) Fab3/5, Colorado Springs, Colorado (Open) 1 recommendation James King Equipment Maintenance Technician at Samtec Microelectronics During our time at Intel and ATMEL, Warren always demonstrated exceptional organizational skills as well as the ability to successfully multi task and manage workloads. He demonstrated a very strong work ethic and proficient troubleshooting skills.... View Senior Ion Implant Maintenance Technician Atmel Corporation October 1995  –  June 2004  (8 years 9 months) Fab3/5, Colorado Springs, Colorado (Open) 1 recommendation James King Equipment Maintenance Technician at Samtec Microelectronics During our time at Intel and ATMEL, Warren always demonstrated exceptional organizational skills as well as the ability to successfully multi task and manage workloads. He demonstrated a very strong work ethic and proficient troubleshooting skills.... View Maintenance Technician Quantum Corporation August 1994  –  October 1995  (1 year 3 months) Colorado Springs, Colorado Maintenance Technician Quantum Corporation August 1994  –  October 1995  (1 year 3 months) Colorado Springs, Colorado Fire Control Electronics Technician US NAVY July 1988  –  July 1994  (6 years 1 month) Phalanx CIWS, NATO SeaSparrow Fire Control Electronics Technician US NAVY July 1988  –  July 1994  (6 years 1 month) Phalanx CIWS, NATO SeaSparrow Skills Top Skills 41 Electronics 25 Semiconductor Industry 23 Troubleshooting 20 Semiconductors 15 Metrology 14 Manufacturing 13 Testing 12 SPC 10 Test Equipment 9 Failure Analysis Warren also knows about... 6 Plasma Etch 5 Design of Experiments 5 Equipment Maintenance 5 PVD 5 Electro-mechanical 4 Engineering 4 Automation 4 CVD 4 Oscilloscope 3 Software Documentation 3 Continuous Improvement 3 Process Improvement 3 Field Service 3 Thin Films 2 Training 2 Silicon 2 Vacuum 2 UHV 2 Electricians 1 Hardware 1 Project Planning 1 Calibration 1 Intel 1 JMP 1 Pneumatics 1 Analog 1 Soldering 1 Robotics 1 RF 1 Photolithography 1 Preventive Maintenance 1 Lithography 1 Product Engineering See 18+     See less Skills  Top Skills 41 Electronics 25 Semiconductor Industry 23 Troubleshooting 20 Semiconductors 15 Metrology 14 Manufacturing 13 Testing 12 SPC 10 Test Equipment 9 Failure Analysis Warren also knows about... 6 Plasma Etch 5 Design of Experiments 5 Equipment Maintenance 5 PVD 5 Electro-mechanical 4 Engineering 4 Automation 4 CVD 4 Oscilloscope 3 Software Documentation 3 Continuous Improvement 3 Process Improvement 3 Field Service 3 Thin Films 2 Training 2 Silicon 2 Vacuum 2 UHV 2 Electricians 1 Hardware 1 Project Planning 1 Calibration 1 Intel 1 JMP 1 Pneumatics 1 Analog 1 Soldering 1 Robotics 1 RF 1 Photolithography 1 Preventive Maintenance 1 Lithography 1 Product Engineering See 18+     See less Top Skills 41 Electronics 25 Semiconductor Industry 23 Troubleshooting 20 Semiconductors 15 Metrology 14 Manufacturing 13 Testing 12 SPC 10 Test Equipment 9 Failure Analysis Warren also knows about... 6 Plasma Etch 5 Design of Experiments 5 Equipment Maintenance 5 PVD 5 Electro-mechanical 4 Engineering 4 Automation 4 CVD 4 Oscilloscope 3 Software Documentation 3 Continuous Improvement 3 Process Improvement 3 Field Service 3 Thin Films 2 Training 2 Silicon 2 Vacuum 2 UHV 2 Electricians 1 Hardware 1 Project Planning 1 Calibration 1 Intel 1 JMP 1 Pneumatics 1 Analog 1 Soldering 1 Robotics 1 RF 1 Photolithography 1 Preventive Maintenance 1 Lithography 1 Product Engineering See 18+     See less Top Skills 41 Electronics 25 Semiconductor Industry 23 Troubleshooting 20 Semiconductors 15 Metrology 14 Manufacturing 13 Testing 12 SPC 10 Test Equipment 9 Failure Analysis Warren also knows about... 6 Plasma Etch 5 Design of Experiments 5 Equipment Maintenance 5 PVD 5 Electro-mechanical 4 Engineering 4 Automation 4 CVD 4 Oscilloscope 3 Software Documentation 3 Continuous Improvement 3 Process Improvement 3 Field Service 3 Thin Films 2 Training 2 Silicon 2 Vacuum 2 UHV 2 Electricians 1 Hardware 1 Project Planning 1 Calibration 1 Intel 1 JMP 1 Pneumatics 1 Analog 1 Soldering 1 Robotics 1 RF 1 Photolithography 1 Preventive Maintenance 1 Lithography 1 Product Engineering See 18+     See less                     6 Plasma Etch 5 Design of Experiments 5 Equipment Maintenance 5 PVD 5 Electro-mechanical 4 Engineering 4 Automation 4 CVD 4 Oscilloscope 3 Software Documentation 3 Continuous Improvement 3 Process Improvement 3 Field Service 3 Thin Films 2 Training 2 Silicon 2 Vacuum 2 UHV 2 Electricians 1 Hardware 1 Project Planning 1 Calibration 1 Intel 1 JMP 1 Pneumatics 1 Analog 1 Soldering 1 Robotics 1 RF 1 Photolithography 1 Preventive Maintenance 1 Lithography 1 Product Engineering Education Military Associate's degree,  Electrical and Electronics Engineering 1988  – 1994 Wasson 1986  – 1988 Military Associate's degree,  Electrical and Electronics Engineering 1988  – 1994 Military Associate's degree,  Electrical and Electronics Engineering 1988  – 1994 Military Associate's degree,  Electrical and Electronics Engineering 1988  – 1994 Wasson 1986  – 1988 Wasson 1986  – 1988 Wasson 1986  – 1988 ", "Summary Safety oriented - Focus on Safety and willing to work with groups to help resolve any issues. \n \nTeamwork - Collaborated with internal and external groups on improvement projects. \n \nGMP - Experience in compliance of GMP as documented in 21 CFR. \n \nTrackWise - Originator of over 20 TrackWise minor deviation/exception events. Initiated, investigated and developed Root Causes and CAPA management. \n \nIndependent Contributor - Identify issues or areas of improvements, develop solutions, and deliver to the customer. \n \nTechnical Knowledge - Created standardized operation, maintenance and troubleshooting procedures and supporting documents. Perform preventive and corrective maintenance on process equipment. \n \nProcess Oriented - Develop data tracking for criteria and tracking mechanism to support customers’ needs. \n \nAttention to Detail - Perform inspection on materials and products ensuring their criteria is within specification. \n \nTraining - Develop and standardized training certifications, deliver training and develop tracking systems. Specialties:High Volume Manufacturing, cGMP experience, biotech, Electro Mechanical Technician, Process Technician and Technical Training Summary Safety oriented - Focus on Safety and willing to work with groups to help resolve any issues. \n \nTeamwork - Collaborated with internal and external groups on improvement projects. \n \nGMP - Experience in compliance of GMP as documented in 21 CFR. \n \nTrackWise - Originator of over 20 TrackWise minor deviation/exception events. Initiated, investigated and developed Root Causes and CAPA management. \n \nIndependent Contributor - Identify issues or areas of improvements, develop solutions, and deliver to the customer. \n \nTechnical Knowledge - Created standardized operation, maintenance and troubleshooting procedures and supporting documents. Perform preventive and corrective maintenance on process equipment. \n \nProcess Oriented - Develop data tracking for criteria and tracking mechanism to support customers’ needs. \n \nAttention to Detail - Perform inspection on materials and products ensuring their criteria is within specification. \n \nTraining - Develop and standardized training certifications, deliver training and develop tracking systems. Specialties:High Volume Manufacturing, cGMP experience, biotech, Electro Mechanical Technician, Process Technician and Technical Training Safety oriented - Focus on Safety and willing to work with groups to help resolve any issues. \n \nTeamwork - Collaborated with internal and external groups on improvement projects. \n \nGMP - Experience in compliance of GMP as documented in 21 CFR. \n \nTrackWise - Originator of over 20 TrackWise minor deviation/exception events. Initiated, investigated and developed Root Causes and CAPA management. \n \nIndependent Contributor - Identify issues or areas of improvements, develop solutions, and deliver to the customer. \n \nTechnical Knowledge - Created standardized operation, maintenance and troubleshooting procedures and supporting documents. Perform preventive and corrective maintenance on process equipment. \n \nProcess Oriented - Develop data tracking for criteria and tracking mechanism to support customers’ needs. \n \nAttention to Detail - Perform inspection on materials and products ensuring their criteria is within specification. \n \nTraining - Develop and standardized training certifications, deliver training and develop tracking systems. Specialties:High Volume Manufacturing, cGMP experience, biotech, Electro Mechanical Technician, Process Technician and Technical Training Safety oriented - Focus on Safety and willing to work with groups to help resolve any issues. \n \nTeamwork - Collaborated with internal and external groups on improvement projects. \n \nGMP - Experience in compliance of GMP as documented in 21 CFR. \n \nTrackWise - Originator of over 20 TrackWise minor deviation/exception events. Initiated, investigated and developed Root Causes and CAPA management. \n \nIndependent Contributor - Identify issues or areas of improvements, develop solutions, and deliver to the customer. \n \nTechnical Knowledge - Created standardized operation, maintenance and troubleshooting procedures and supporting documents. Perform preventive and corrective maintenance on process equipment. \n \nProcess Oriented - Develop data tracking for criteria and tracking mechanism to support customers’ needs. \n \nAttention to Detail - Perform inspection on materials and products ensuring their criteria is within specification. \n \nTraining - Develop and standardized training certifications, deliver training and develop tracking systems. Specialties:High Volume Manufacturing, cGMP experience, biotech, Electro Mechanical Technician, Process Technician and Technical Training Experience Sr. Training Development Specialist Shire Pharmaceuticals March 2014  – Present (1 year 6 months) Clinlab Staffing on-site at Shire, Lexington, MA *Develops and authors On the Job Training (OJT) guides and performance assessment for manufacturing operations using standard operation procedures, preventive maintenance procedures and master batch records.  \n*Collaborates with Manufacturing Subject Matter Experts, Facilities, Quality, Safety and Engineering groups in developing training material ensuring content accuracy and GMP compliance. \n*Observes manufacturing operations to develop safety concepts and OJT tasks and assessment criteria. \n*Provides training to qualified trainers, supervisors and managers on the technical content and assessment criteria associated with new and revised OJTs. Manufacturing Training Specialist Genzyme December 2011  –  March 2014  (2 years 4 months) Allston, MA *Developed curriculum, presentations and training aides to support On the Job Training (OJT) and CAPA training requirements for operators and supervisors in the Purification, Cell Culture, Media, and Buffer groups. \n*Developed and presented new manufacturing concepts and requirements to the production teams utilizing Computer Based Training (CBT), Instructor Led Training (ILT) and Structured Discussions. \n*Plateau Admin: Developed performance tools from multiple Plateau reports for supervisors to track teams’ curriculum assignments, training needs, overdue training, safety classes, and OJT completion. \n*Reviewed proposed procedural changes and assessed training requirements. Based on the assessment identified the target audience(s), created the training materials and the appropriate delivery method.  \n*Reviewed manufacturing process procedures for safety, quality, integrity and accuracy.  \n*Collaborated with the Development and Training group in maintaining curriculums, meeting consent decree requirements and ensuring employees training assignments are reflective of their current role. \n*Created role based and task based curricula for Media and Buffer department operators and supervisors. \n*Processed document corrections and revisions in Livelink, a validated system.  \n*Investigator – Composed and conducted investigations in TrackWise to support minor and major deviations. Collaborated with Quality, MTS, and Manufacturing on minor and major manufacturing deviations in determining root cause, product impact, and developed effective corrective actions. Manufacturing Associate Genzyme April 2011  –  December 2011  (9 months) Allston, MA *Performed weigh and dispense operations and batching of formulations to support Purification and Cell Culture processes in strict accordance with PPE, SOP’s, GMP and Safety policies and procedures. \n*Initiated exceptions/deviations in the TrackWise system. Performed and documented investigations of events in support of developing Root Causes and CAPA’s. \n*Developed/delivered training for a document control portal in support of a CAPA aimed at the eliminating the loss of production records and supporting documents. Since the implementation in June 2011, no GMP documents have been lost in the Support Services area.  \n*Reviewed GMP documents/standard operating procedures and revised controlled documents.  \n*Troubleshot process issues involving anomalies in batching, hold vessels, and supporting systems.  \n*Performed various chemistry measurements including; pH, conductivity, osmosis and refractivity of formulations Process Engineering Technician III Evergreen Solar Inc March 2008  –  March 2010  (2 years 1 month) Devens, MA *Sole Engineering representative covering night shift operations; responsible for overseeing shift safety, quality, output and yield for 24 process steps associated with solar panel manufacturing.  \n*Developed and delivered training to Supervisors, Team Leads and Operators on line optimization/utilization, defect identification. After 16 weeks program implementation the shift sustained 94%+ yield until the plant closed.  \n*Depositioned defective materials, performed defect classification and product containment during process excursions preventing any defective products from escaping to the customers.  \n*Performed product defect to tool correlation and collaborated with technicians in identifying the root cause.  \n*Worked with The EHS/Safety on various projects such as proper signage, safe working platforms, training operators on safety concepts, and proper ventilation of process tools. (Open) 2 recommendations Darren J Chaulk Final Test Technician at TEL Epion Scott's technical skills and professionalism have enabled him to be highly successful in the roles he has filled. Most... View Greg Head Electro Mechanical Tech at Horizon Beverage Scott is a dedicated employee who is a great problem solver. View Electro/Mechanical Technician III Evergreen Solar Inc March 2008  –  March 2009  (1 year 1 month) Devens, MA -Maintained NPC Tabber/Stringers, Meier Laminators, Spire Sun Simulators and Kuka Robots. Performed corrective/preventive maintenance including troubleshooting to the component level. \n-In cooperation with KUKA technicians, installed robots including aligning and mounting platforms to landings, wiring, calibration, mastering, programming and pendant operation.  \n-Maintained Spire Sun Simulator used to test solar panels power ratings.  \n-Performed preventive/corrective maintenance and troubleshot issues on 360 proprietary designed String Ribbon furnaces.  \n-Worked with the Purchasing division in establishing proper levels of consumable materials, spare parts and tools necessary for sustaining the factory operating to minimize downtime and costs. \n-Performed installation, alignments, and preventive/corrective maintenance on YAG Class IV laser systems lasers.  \n-Performed tool installations, safety verifications, initial power up and process qualifications related to factory start up. \n-Used schematics and prints in fault isolation situations. Used SAP for logistic support. Process Engineering Intel Corporation March 2006  –  March 2008  (2 years 1 month) FAB17 Hudson, MA *Equipment owner of the lithography process in a high volume semiconductor manufacturing factory. \n*Consistently exceeded quality, equipment availability and production output goals, ensuring the timely delivery of the company’s product to worldwide customers both internal and external to the company.  \n*Developed detailed game plans in resolving process and equipment issues through structured problem solving techniques reducing redundant work being performed and decreasing tool downtime.  \n*Developed and performed various experiments utilizing candidate chemical products and lithography exposure recipes aimed at reducing wafer costs, decrease run times and increasing equipment availability. Over a 2 year period costs were reduced while increasing equipment availability and utilization increased by 20%. \n*Collaborated with various engineering teams across the virtual factory to drive continuous improvement. Proliferated knowledge and best known procedures to Intel’s worldwide operations.  \n*Trained and mentored technicians in process operations, defect analysis, product disposition, preventive maintenance and repairs on Nikon Stepper Body 9. \n*Extensive use SPC++ statistical program, JMP and other software programs including Work stream, a manufacturing, product and process tool tracking program. \n*Authored and maintained various operation, process and maintenance procedures (SOPs). (Open) 2 recommendations Larry Gering Product Development Specialist at TEL Epion Scott is a results driven Engineer who manages his time effectively and efficiently. He possesses excellent written and... View Thad W. Litho Eng Tech Scott is a fast learner and very detail oriented. He utilized a natural troubleshooting ability along with tons of common... View Training Specialist Intel Corporation July 2004  –  March 2006  (1 year 9 months) FAB17 Hudson, MA -Training Specialist for over 500 technicians. \n-Coordinated and developed specialized training to support factory needs in maintaining various equipment sets ensuring factory production goals and customer product commitments were met.  \n-Developed standardized certification training packages to aid the development and training of technicians in advanced preventive and corrective maintenance. \n-Led a corporate wide team in developing a proficiency tracking and assessment system aimed at improving training, supporting materials and driving down the cost of training. Results were 15% savings on training costs, increase in tool availability and zero safety incidents. Senior Manufacturing Technician Intel Corporation September 2000  –  July 2004  (3 years 11 months) FAB17 Hudson, MA *Team Lead – Coordinated, organized, and prioritized resources for tool repairs, scheduled maintenance and factory product commitments to ensure factories goals were met while observing Safety, Quality and Output practices in a clean room environment. \n*Performed preventive and corrective on lithography equipment. \n*Provided shift area health and production reports at factory level production meetings. \n*Trained Process Technicians - responsible for training technicians on visual inspection of semiconductor devices, analyzing statistical charts, identified defects and identifying trends.  \n*Coordinated production runs, balancing product priorities, tool configurations and factory goals. (Open) 2 recommendations Robbe Addis eLearning & Mobile Consultant @ IBM Scott is a highly intelligent problem solver and has great analytical skills. His continued drive for excellence while... View John P. DiVito III Engineering Technician with HVAC training and EPA Universal Certification with HAZMAT Training Scott and I never worked directly together even though we are work under the Litho area, umbrella; but he has always made... View Electronic Technician (Submarines) US Navy June 1986  –  July 2000  (14 years 2 months) -3M Work Center Supervisor; Preventive maintenance coordinator \n-Managed a department of 18 people in maintaining electronic systems, network communications, training, and equipment operation.  \n-Installed, operated, troubleshot, and repaired complex multiple unit electronic systems.  \n-Technical Trainer with over 1000 hours of formal classroom training on electronic navigation equipment and safety and computer system operation. \n-Qualified in Submarines. Sr. Training Development Specialist Shire Pharmaceuticals March 2014  – Present (1 year 6 months) Clinlab Staffing on-site at Shire, Lexington, MA *Develops and authors On the Job Training (OJT) guides and performance assessment for manufacturing operations using standard operation procedures, preventive maintenance procedures and master batch records.  \n*Collaborates with Manufacturing Subject Matter Experts, Facilities, Quality, Safety and Engineering groups in developing training material ensuring content accuracy and GMP compliance. \n*Observes manufacturing operations to develop safety concepts and OJT tasks and assessment criteria. \n*Provides training to qualified trainers, supervisors and managers on the technical content and assessment criteria associated with new and revised OJTs. Sr. Training Development Specialist Shire Pharmaceuticals March 2014  – Present (1 year 6 months) Clinlab Staffing on-site at Shire, Lexington, MA *Develops and authors On the Job Training (OJT) guides and performance assessment for manufacturing operations using standard operation procedures, preventive maintenance procedures and master batch records.  \n*Collaborates with Manufacturing Subject Matter Experts, Facilities, Quality, Safety and Engineering groups in developing training material ensuring content accuracy and GMP compliance. \n*Observes manufacturing operations to develop safety concepts and OJT tasks and assessment criteria. \n*Provides training to qualified trainers, supervisors and managers on the technical content and assessment criteria associated with new and revised OJTs. Manufacturing Training Specialist Genzyme December 2011  –  March 2014  (2 years 4 months) Allston, MA *Developed curriculum, presentations and training aides to support On the Job Training (OJT) and CAPA training requirements for operators and supervisors in the Purification, Cell Culture, Media, and Buffer groups. \n*Developed and presented new manufacturing concepts and requirements to the production teams utilizing Computer Based Training (CBT), Instructor Led Training (ILT) and Structured Discussions. \n*Plateau Admin: Developed performance tools from multiple Plateau reports for supervisors to track teams’ curriculum assignments, training needs, overdue training, safety classes, and OJT completion. \n*Reviewed proposed procedural changes and assessed training requirements. Based on the assessment identified the target audience(s), created the training materials and the appropriate delivery method.  \n*Reviewed manufacturing process procedures for safety, quality, integrity and accuracy.  \n*Collaborated with the Development and Training group in maintaining curriculums, meeting consent decree requirements and ensuring employees training assignments are reflective of their current role. \n*Created role based and task based curricula for Media and Buffer department operators and supervisors. \n*Processed document corrections and revisions in Livelink, a validated system.  \n*Investigator – Composed and conducted investigations in TrackWise to support minor and major deviations. Collaborated with Quality, MTS, and Manufacturing on minor and major manufacturing deviations in determining root cause, product impact, and developed effective corrective actions. Manufacturing Training Specialist Genzyme December 2011  –  March 2014  (2 years 4 months) Allston, MA *Developed curriculum, presentations and training aides to support On the Job Training (OJT) and CAPA training requirements for operators and supervisors in the Purification, Cell Culture, Media, and Buffer groups. \n*Developed and presented new manufacturing concepts and requirements to the production teams utilizing Computer Based Training (CBT), Instructor Led Training (ILT) and Structured Discussions. \n*Plateau Admin: Developed performance tools from multiple Plateau reports for supervisors to track teams’ curriculum assignments, training needs, overdue training, safety classes, and OJT completion. \n*Reviewed proposed procedural changes and assessed training requirements. Based on the assessment identified the target audience(s), created the training materials and the appropriate delivery method.  \n*Reviewed manufacturing process procedures for safety, quality, integrity and accuracy.  \n*Collaborated with the Development and Training group in maintaining curriculums, meeting consent decree requirements and ensuring employees training assignments are reflective of their current role. \n*Created role based and task based curricula for Media and Buffer department operators and supervisors. \n*Processed document corrections and revisions in Livelink, a validated system.  \n*Investigator – Composed and conducted investigations in TrackWise to support minor and major deviations. Collaborated with Quality, MTS, and Manufacturing on minor and major manufacturing deviations in determining root cause, product impact, and developed effective corrective actions. Manufacturing Associate Genzyme April 2011  –  December 2011  (9 months) Allston, MA *Performed weigh and dispense operations and batching of formulations to support Purification and Cell Culture processes in strict accordance with PPE, SOP’s, GMP and Safety policies and procedures. \n*Initiated exceptions/deviations in the TrackWise system. Performed and documented investigations of events in support of developing Root Causes and CAPA’s. \n*Developed/delivered training for a document control portal in support of a CAPA aimed at the eliminating the loss of production records and supporting documents. Since the implementation in June 2011, no GMP documents have been lost in the Support Services area.  \n*Reviewed GMP documents/standard operating procedures and revised controlled documents.  \n*Troubleshot process issues involving anomalies in batching, hold vessels, and supporting systems.  \n*Performed various chemistry measurements including; pH, conductivity, osmosis and refractivity of formulations Manufacturing Associate Genzyme April 2011  –  December 2011  (9 months) Allston, MA *Performed weigh and dispense operations and batching of formulations to support Purification and Cell Culture processes in strict accordance with PPE, SOP’s, GMP and Safety policies and procedures. \n*Initiated exceptions/deviations in the TrackWise system. Performed and documented investigations of events in support of developing Root Causes and CAPA’s. \n*Developed/delivered training for a document control portal in support of a CAPA aimed at the eliminating the loss of production records and supporting documents. Since the implementation in June 2011, no GMP documents have been lost in the Support Services area.  \n*Reviewed GMP documents/standard operating procedures and revised controlled documents.  \n*Troubleshot process issues involving anomalies in batching, hold vessels, and supporting systems.  \n*Performed various chemistry measurements including; pH, conductivity, osmosis and refractivity of formulations Process Engineering Technician III Evergreen Solar Inc March 2008  –  March 2010  (2 years 1 month) Devens, MA *Sole Engineering representative covering night shift operations; responsible for overseeing shift safety, quality, output and yield for 24 process steps associated with solar panel manufacturing.  \n*Developed and delivered training to Supervisors, Team Leads and Operators on line optimization/utilization, defect identification. After 16 weeks program implementation the shift sustained 94%+ yield until the plant closed.  \n*Depositioned defective materials, performed defect classification and product containment during process excursions preventing any defective products from escaping to the customers.  \n*Performed product defect to tool correlation and collaborated with technicians in identifying the root cause.  \n*Worked with The EHS/Safety on various projects such as proper signage, safe working platforms, training operators on safety concepts, and proper ventilation of process tools. (Open) 2 recommendations Darren J Chaulk Final Test Technician at TEL Epion Scott's technical skills and professionalism have enabled him to be highly successful in the roles he has filled. Most... View Greg Head Electro Mechanical Tech at Horizon Beverage Scott is a dedicated employee who is a great problem solver. View Process Engineering Technician III Evergreen Solar Inc March 2008  –  March 2010  (2 years 1 month) Devens, MA *Sole Engineering representative covering night shift operations; responsible for overseeing shift safety, quality, output and yield for 24 process steps associated with solar panel manufacturing.  \n*Developed and delivered training to Supervisors, Team Leads and Operators on line optimization/utilization, defect identification. After 16 weeks program implementation the shift sustained 94%+ yield until the plant closed.  \n*Depositioned defective materials, performed defect classification and product containment during process excursions preventing any defective products from escaping to the customers.  \n*Performed product defect to tool correlation and collaborated with technicians in identifying the root cause.  \n*Worked with The EHS/Safety on various projects such as proper signage, safe working platforms, training operators on safety concepts, and proper ventilation of process tools. (Open) 2 recommendations Darren J Chaulk Final Test Technician at TEL Epion Scott's technical skills and professionalism have enabled him to be highly successful in the roles he has filled. Most... View Greg Head Electro Mechanical Tech at Horizon Beverage Scott is a dedicated employee who is a great problem solver. View Electro/Mechanical Technician III Evergreen Solar Inc March 2008  –  March 2009  (1 year 1 month) Devens, MA -Maintained NPC Tabber/Stringers, Meier Laminators, Spire Sun Simulators and Kuka Robots. Performed corrective/preventive maintenance including troubleshooting to the component level. \n-In cooperation with KUKA technicians, installed robots including aligning and mounting platforms to landings, wiring, calibration, mastering, programming and pendant operation.  \n-Maintained Spire Sun Simulator used to test solar panels power ratings.  \n-Performed preventive/corrective maintenance and troubleshot issues on 360 proprietary designed String Ribbon furnaces.  \n-Worked with the Purchasing division in establishing proper levels of consumable materials, spare parts and tools necessary for sustaining the factory operating to minimize downtime and costs. \n-Performed installation, alignments, and preventive/corrective maintenance on YAG Class IV laser systems lasers.  \n-Performed tool installations, safety verifications, initial power up and process qualifications related to factory start up. \n-Used schematics and prints in fault isolation situations. Used SAP for logistic support. Electro/Mechanical Technician III Evergreen Solar Inc March 2008  –  March 2009  (1 year 1 month) Devens, MA -Maintained NPC Tabber/Stringers, Meier Laminators, Spire Sun Simulators and Kuka Robots. Performed corrective/preventive maintenance including troubleshooting to the component level. \n-In cooperation with KUKA technicians, installed robots including aligning and mounting platforms to landings, wiring, calibration, mastering, programming and pendant operation.  \n-Maintained Spire Sun Simulator used to test solar panels power ratings.  \n-Performed preventive/corrective maintenance and troubleshot issues on 360 proprietary designed String Ribbon furnaces.  \n-Worked with the Purchasing division in establishing proper levels of consumable materials, spare parts and tools necessary for sustaining the factory operating to minimize downtime and costs. \n-Performed installation, alignments, and preventive/corrective maintenance on YAG Class IV laser systems lasers.  \n-Performed tool installations, safety verifications, initial power up and process qualifications related to factory start up. \n-Used schematics and prints in fault isolation situations. Used SAP for logistic support. Process Engineering Intel Corporation March 2006  –  March 2008  (2 years 1 month) FAB17 Hudson, MA *Equipment owner of the lithography process in a high volume semiconductor manufacturing factory. \n*Consistently exceeded quality, equipment availability and production output goals, ensuring the timely delivery of the company’s product to worldwide customers both internal and external to the company.  \n*Developed detailed game plans in resolving process and equipment issues through structured problem solving techniques reducing redundant work being performed and decreasing tool downtime.  \n*Developed and performed various experiments utilizing candidate chemical products and lithography exposure recipes aimed at reducing wafer costs, decrease run times and increasing equipment availability. Over a 2 year period costs were reduced while increasing equipment availability and utilization increased by 20%. \n*Collaborated with various engineering teams across the virtual factory to drive continuous improvement. Proliferated knowledge and best known procedures to Intel’s worldwide operations.  \n*Trained and mentored technicians in process operations, defect analysis, product disposition, preventive maintenance and repairs on Nikon Stepper Body 9. \n*Extensive use SPC++ statistical program, JMP and other software programs including Work stream, a manufacturing, product and process tool tracking program. \n*Authored and maintained various operation, process and maintenance procedures (SOPs). (Open) 2 recommendations Larry Gering Product Development Specialist at TEL Epion Scott is a results driven Engineer who manages his time effectively and efficiently. He possesses excellent written and... View Thad W. Litho Eng Tech Scott is a fast learner and very detail oriented. He utilized a natural troubleshooting ability along with tons of common... View Process Engineering Intel Corporation March 2006  –  March 2008  (2 years 1 month) FAB17 Hudson, MA *Equipment owner of the lithography process in a high volume semiconductor manufacturing factory. \n*Consistently exceeded quality, equipment availability and production output goals, ensuring the timely delivery of the company’s product to worldwide customers both internal and external to the company.  \n*Developed detailed game plans in resolving process and equipment issues through structured problem solving techniques reducing redundant work being performed and decreasing tool downtime.  \n*Developed and performed various experiments utilizing candidate chemical products and lithography exposure recipes aimed at reducing wafer costs, decrease run times and increasing equipment availability. Over a 2 year period costs were reduced while increasing equipment availability and utilization increased by 20%. \n*Collaborated with various engineering teams across the virtual factory to drive continuous improvement. Proliferated knowledge and best known procedures to Intel’s worldwide operations.  \n*Trained and mentored technicians in process operations, defect analysis, product disposition, preventive maintenance and repairs on Nikon Stepper Body 9. \n*Extensive use SPC++ statistical program, JMP and other software programs including Work stream, a manufacturing, product and process tool tracking program. \n*Authored and maintained various operation, process and maintenance procedures (SOPs). (Open) 2 recommendations Larry Gering Product Development Specialist at TEL Epion Scott is a results driven Engineer who manages his time effectively and efficiently. He possesses excellent written and... View Thad W. Litho Eng Tech Scott is a fast learner and very detail oriented. He utilized a natural troubleshooting ability along with tons of common... View Training Specialist Intel Corporation July 2004  –  March 2006  (1 year 9 months) FAB17 Hudson, MA -Training Specialist for over 500 technicians. \n-Coordinated and developed specialized training to support factory needs in maintaining various equipment sets ensuring factory production goals and customer product commitments were met.  \n-Developed standardized certification training packages to aid the development and training of technicians in advanced preventive and corrective maintenance. \n-Led a corporate wide team in developing a proficiency tracking and assessment system aimed at improving training, supporting materials and driving down the cost of training. Results were 15% savings on training costs, increase in tool availability and zero safety incidents. Training Specialist Intel Corporation July 2004  –  March 2006  (1 year 9 months) FAB17 Hudson, MA -Training Specialist for over 500 technicians. \n-Coordinated and developed specialized training to support factory needs in maintaining various equipment sets ensuring factory production goals and customer product commitments were met.  \n-Developed standardized certification training packages to aid the development and training of technicians in advanced preventive and corrective maintenance. \n-Led a corporate wide team in developing a proficiency tracking and assessment system aimed at improving training, supporting materials and driving down the cost of training. Results were 15% savings on training costs, increase in tool availability and zero safety incidents. Senior Manufacturing Technician Intel Corporation September 2000  –  July 2004  (3 years 11 months) FAB17 Hudson, MA *Team Lead – Coordinated, organized, and prioritized resources for tool repairs, scheduled maintenance and factory product commitments to ensure factories goals were met while observing Safety, Quality and Output practices in a clean room environment. \n*Performed preventive and corrective on lithography equipment. \n*Provided shift area health and production reports at factory level production meetings. \n*Trained Process Technicians - responsible for training technicians on visual inspection of semiconductor devices, analyzing statistical charts, identified defects and identifying trends.  \n*Coordinated production runs, balancing product priorities, tool configurations and factory goals. (Open) 2 recommendations Robbe Addis eLearning & Mobile Consultant @ IBM Scott is a highly intelligent problem solver and has great analytical skills. His continued drive for excellence while... View John P. DiVito III Engineering Technician with HVAC training and EPA Universal Certification with HAZMAT Training Scott and I never worked directly together even though we are work under the Litho area, umbrella; but he has always made... View Senior Manufacturing Technician Intel Corporation September 2000  –  July 2004  (3 years 11 months) FAB17 Hudson, MA *Team Lead – Coordinated, organized, and prioritized resources for tool repairs, scheduled maintenance and factory product commitments to ensure factories goals were met while observing Safety, Quality and Output practices in a clean room environment. \n*Performed preventive and corrective on lithography equipment. \n*Provided shift area health and production reports at factory level production meetings. \n*Trained Process Technicians - responsible for training technicians on visual inspection of semiconductor devices, analyzing statistical charts, identified defects and identifying trends.  \n*Coordinated production runs, balancing product priorities, tool configurations and factory goals. (Open) 2 recommendations Robbe Addis eLearning & Mobile Consultant @ IBM Scott is a highly intelligent problem solver and has great analytical skills. His continued drive for excellence while... View John P. DiVito III Engineering Technician with HVAC training and EPA Universal Certification with HAZMAT Training Scott and I never worked directly together even though we are work under the Litho area, umbrella; but he has always made... View Electronic Technician (Submarines) US Navy June 1986  –  July 2000  (14 years 2 months) -3M Work Center Supervisor; Preventive maintenance coordinator \n-Managed a department of 18 people in maintaining electronic systems, network communications, training, and equipment operation.  \n-Installed, operated, troubleshot, and repaired complex multiple unit electronic systems.  \n-Technical Trainer with over 1000 hours of formal classroom training on electronic navigation equipment and safety and computer system operation. \n-Qualified in Submarines. Electronic Technician (Submarines) US Navy June 1986  –  July 2000  (14 years 2 months) -3M Work Center Supervisor; Preventive maintenance coordinator \n-Managed a department of 18 people in maintaining electronic systems, network communications, training, and equipment operation.  \n-Installed, operated, troubleshot, and repaired complex multiple unit electronic systems.  \n-Technical Trainer with over 1000 hours of formal classroom training on electronic navigation equipment and safety and computer system operation. \n-Qualified in Submarines. Skills Top Skills 99+ Manufacturing 74 Continuous Improvement 59 Process Engineering 58 Quality Assurance 45 Semiconductors 39 Process Improvement 24 Electronics 23 SPC 22 Software Documentation 21 GMP Scott also knows about... 20 Troubleshooting 20 Testing 19 Cross-functional Team... 14 Engineering 12 Six Sigma 11 Design of Experiments 10 Team Leadership 10 Preventive Maintenance 10 Lean Manufacturing 8 Biotechnology 7 Training 5 SAP 5 CAPA 4 Operations Management 2 Metrology 2 Root Cause Analysis 2 Quality System 2 Sop 2 5S See 4+     See less Skills  Top Skills 99+ Manufacturing 74 Continuous Improvement 59 Process Engineering 58 Quality Assurance 45 Semiconductors 39 Process Improvement 24 Electronics 23 SPC 22 Software Documentation 21 GMP Scott also knows about... 20 Troubleshooting 20 Testing 19 Cross-functional Team... 14 Engineering 12 Six Sigma 11 Design of Experiments 10 Team Leadership 10 Preventive Maintenance 10 Lean Manufacturing 8 Biotechnology 7 Training 5 SAP 5 CAPA 4 Operations Management 2 Metrology 2 Root Cause Analysis 2 Quality System 2 Sop 2 5S See 4+     See less Top Skills 99+ Manufacturing 74 Continuous Improvement 59 Process Engineering 58 Quality Assurance 45 Semiconductors 39 Process Improvement 24 Electronics 23 SPC 22 Software Documentation 21 GMP Scott also knows about... 20 Troubleshooting 20 Testing 19 Cross-functional Team... 14 Engineering 12 Six Sigma 11 Design of Experiments 10 Team Leadership 10 Preventive Maintenance 10 Lean Manufacturing 8 Biotechnology 7 Training 5 SAP 5 CAPA 4 Operations Management 2 Metrology 2 Root Cause Analysis 2 Quality System 2 Sop 2 5S See 4+     See less Top Skills 99+ Manufacturing 74 Continuous Improvement 59 Process Engineering 58 Quality Assurance 45 Semiconductors 39 Process Improvement 24 Electronics 23 SPC 22 Software Documentation 21 GMP Scott also knows about... 20 Troubleshooting 20 Testing 19 Cross-functional Team... 14 Engineering 12 Six Sigma 11 Design of Experiments 10 Team Leadership 10 Preventive Maintenance 10 Lean Manufacturing 8 Biotechnology 7 Training 5 SAP 5 CAPA 4 Operations Management 2 Metrology 2 Root Cause Analysis 2 Quality System 2 Sop 2 5S See 4+     See less                     20 Troubleshooting 20 Testing 19 Cross-functional Team... 14 Engineering 12 Six Sigma 11 Design of Experiments 10 Team Leadership 10 Preventive Maintenance 10 Lean Manufacturing 8 Biotechnology 7 Training 5 SAP 5 CAPA 4 Operations Management 2 Metrology 2 Root Cause Analysis 2 Quality System 2 Sop 2 5S Education Massasoit Community College A.S,  ELECTRONIC TECHNOLOGY Various employer sponsored classes in tool specific vendor training, manufacturing methodologies in addition to engineering excellence classes. \nMicrosoft Office programs; Word, Power Point, Excel and Outlook Massasoit Community College A.S,  ELECTRONIC TECHNOLOGY Various employer sponsored classes in tool specific vendor training, manufacturing methodologies in addition to engineering excellence classes. \nMicrosoft Office programs; Word, Power Point, Excel and Outlook Massasoit Community College A.S,  ELECTRONIC TECHNOLOGY Various employer sponsored classes in tool specific vendor training, manufacturing methodologies in addition to engineering excellence classes. \nMicrosoft Office programs; Word, Power Point, Excel and Outlook Massasoit Community College A.S,  ELECTRONIC TECHNOLOGY Various employer sponsored classes in tool specific vendor training, manufacturing methodologies in addition to engineering excellence classes. \nMicrosoft Office programs; Word, Power Point, Excel and Outlook Honors & Awards Additional Honors & Awards Qualified Submarines \nUSS TENNESSEE SSBN 734G \nUSS MARYLAND SSBN738G \nUSS MICHIGAN SSBN727B Additional Honors & Awards Qualified Submarines \nUSS TENNESSEE SSBN 734G \nUSS MARYLAND SSBN738G \nUSS MICHIGAN SSBN727B Additional Honors & Awards Qualified Submarines \nUSS TENNESSEE SSBN 734G \nUSS MARYLAND SSBN738G \nUSS MICHIGAN SSBN727B Additional Honors & Awards Qualified Submarines \nUSS TENNESSEE SSBN 734G \nUSS MARYLAND SSBN738G \nUSS MICHIGAN SSBN727B ", "Summary Highly skilled and motivated Electronics Technician with experience working in a variety of environments and roles; seeking a fast paced, challenging position in which to contribute to the success of a team and build new skills. Summary Highly skilled and motivated Electronics Technician with experience working in a variety of environments and roles; seeking a fast paced, challenging position in which to contribute to the success of a team and build new skills. Highly skilled and motivated Electronics Technician with experience working in a variety of environments and roles; seeking a fast paced, challenging position in which to contribute to the success of a team and build new skills. Highly skilled and motivated Electronics Technician with experience working in a variety of environments and roles; seeking a fast paced, challenging position in which to contribute to the success of a team and build new skills. Experience Senior Manufacturing Technician Intel Corporation October 2013  – Present (1 year 11 months) Manufacturing Technician Volt - Intel Corporation May 2013  –  October 2013  (6 months) Hillsboro, OR Assistant Project Manager Elcon Corporation May 2012  –  March 2013  (11 months) Portland, OR Actively involved in numerous aspects of contracted projects, from start to successful completion, for an electrical infrastructure contractor.  \nResponsible for supporting field operations including ordering materials, processing timecards, and other crew requests.  \nMaintains accurate records in accordance with project specifications to ensure projects are constructed with the highest quality and accuracy.  \nAttends project meetings with General Contractors and Owners to communicate completion milestones, future activity schedules, and address project roadblocks. Fab Operator TriQuint Semiconductor / Volt June 2011  –  April 2012  (11 months) Hillsboro, OR Operated wet benches and plasma etchers in a 150mm GaAs wafer fab. \nManaged material processing through equipment to maximize output and meet daily goals. \nPerformed daily preventative maintenance to ensure equipment was operating within spec. Shift Production Supervisor MEMC Electronic Materials June 2010  –  March 2011  (10 months) Managed a crew of 15 people producing silicon ingots for solar wafer production.  \nCoordinated operations to meet nightly production goals. \nSet priorities for maintenance activities to bring critical pullers online quickly. \nManaged time cards, vacation schedules, overtime needs. Electronics Bench Technician Ryzex July 2009  –  June 2010  (1 year) Troubleshooting, repairing, and testing of data collection/bar-coding equipment. \nExperience servicing many major brand data collection devices including bar-code scanners, handheld terminals, and truck mount computers. Manufacturing Technician Intel Corporation August 2004  –  April 2009  (4 years 9 months) Responsible for operating and maintaining 300mm diffusion furnaces used in the development of next generation semiconductor manufacturing processes. \nDaily duties included coordinating material processing, running engineering experiments, defect analysis, equipment troubleshooting, and managing development projects. \n4+ years experience, in a clean-room environment, performing equipment maintenance; quickly troubleshooting, repairing, and re-qualifying with minimal impact to production. \nFirst point of contact/area coordinator, providing management daily status reports, reporting equipment issues; coordinating technician schedules and team production goals. \nParticipated in automation software development, providing bug reports and usability feedback to developers, testing new software in the production environment, and helping troubleshoot compatibility issues. Senior Game Advisor/Key holder GameStop May 2001  –  July 2004  (3 years 3 months) Opening/closing store, accounting, shipping/receiving, organizing/stocking product. Electronics Technician Intern Ryzex December 2002  –  January 2003  (2 months) Troubleshooting, repairing, and testing of data collection/bar-coding equipment. Senior Manufacturing Technician Intel Corporation October 2013  – Present (1 year 11 months) Senior Manufacturing Technician Intel Corporation October 2013  – Present (1 year 11 months) Manufacturing Technician Volt - Intel Corporation May 2013  –  October 2013  (6 months) Hillsboro, OR Manufacturing Technician Volt - Intel Corporation May 2013  –  October 2013  (6 months) Hillsboro, OR Assistant Project Manager Elcon Corporation May 2012  –  March 2013  (11 months) Portland, OR Actively involved in numerous aspects of contracted projects, from start to successful completion, for an electrical infrastructure contractor.  \nResponsible for supporting field operations including ordering materials, processing timecards, and other crew requests.  \nMaintains accurate records in accordance with project specifications to ensure projects are constructed with the highest quality and accuracy.  \nAttends project meetings with General Contractors and Owners to communicate completion milestones, future activity schedules, and address project roadblocks. Assistant Project Manager Elcon Corporation May 2012  –  March 2013  (11 months) Portland, OR Actively involved in numerous aspects of contracted projects, from start to successful completion, for an electrical infrastructure contractor.  \nResponsible for supporting field operations including ordering materials, processing timecards, and other crew requests.  \nMaintains accurate records in accordance with project specifications to ensure projects are constructed with the highest quality and accuracy.  \nAttends project meetings with General Contractors and Owners to communicate completion milestones, future activity schedules, and address project roadblocks. Fab Operator TriQuint Semiconductor / Volt June 2011  –  April 2012  (11 months) Hillsboro, OR Operated wet benches and plasma etchers in a 150mm GaAs wafer fab. \nManaged material processing through equipment to maximize output and meet daily goals. \nPerformed daily preventative maintenance to ensure equipment was operating within spec. Fab Operator TriQuint Semiconductor / Volt June 2011  –  April 2012  (11 months) Hillsboro, OR Operated wet benches and plasma etchers in a 150mm GaAs wafer fab. \nManaged material processing through equipment to maximize output and meet daily goals. \nPerformed daily preventative maintenance to ensure equipment was operating within spec. Shift Production Supervisor MEMC Electronic Materials June 2010  –  March 2011  (10 months) Managed a crew of 15 people producing silicon ingots for solar wafer production.  \nCoordinated operations to meet nightly production goals. \nSet priorities for maintenance activities to bring critical pullers online quickly. \nManaged time cards, vacation schedules, overtime needs. Shift Production Supervisor MEMC Electronic Materials June 2010  –  March 2011  (10 months) Managed a crew of 15 people producing silicon ingots for solar wafer production.  \nCoordinated operations to meet nightly production goals. \nSet priorities for maintenance activities to bring critical pullers online quickly. \nManaged time cards, vacation schedules, overtime needs. Electronics Bench Technician Ryzex July 2009  –  June 2010  (1 year) Troubleshooting, repairing, and testing of data collection/bar-coding equipment. \nExperience servicing many major brand data collection devices including bar-code scanners, handheld terminals, and truck mount computers. Electronics Bench Technician Ryzex July 2009  –  June 2010  (1 year) Troubleshooting, repairing, and testing of data collection/bar-coding equipment. \nExperience servicing many major brand data collection devices including bar-code scanners, handheld terminals, and truck mount computers. Manufacturing Technician Intel Corporation August 2004  –  April 2009  (4 years 9 months) Responsible for operating and maintaining 300mm diffusion furnaces used in the development of next generation semiconductor manufacturing processes. \nDaily duties included coordinating material processing, running engineering experiments, defect analysis, equipment troubleshooting, and managing development projects. \n4+ years experience, in a clean-room environment, performing equipment maintenance; quickly troubleshooting, repairing, and re-qualifying with minimal impact to production. \nFirst point of contact/area coordinator, providing management daily status reports, reporting equipment issues; coordinating technician schedules and team production goals. \nParticipated in automation software development, providing bug reports and usability feedback to developers, testing new software in the production environment, and helping troubleshoot compatibility issues. Manufacturing Technician Intel Corporation August 2004  –  April 2009  (4 years 9 months) Responsible for operating and maintaining 300mm diffusion furnaces used in the development of next generation semiconductor manufacturing processes. \nDaily duties included coordinating material processing, running engineering experiments, defect analysis, equipment troubleshooting, and managing development projects. \n4+ years experience, in a clean-room environment, performing equipment maintenance; quickly troubleshooting, repairing, and re-qualifying with minimal impact to production. \nFirst point of contact/area coordinator, providing management daily status reports, reporting equipment issues; coordinating technician schedules and team production goals. \nParticipated in automation software development, providing bug reports and usability feedback to developers, testing new software in the production environment, and helping troubleshoot compatibility issues. Senior Game Advisor/Key holder GameStop May 2001  –  July 2004  (3 years 3 months) Opening/closing store, accounting, shipping/receiving, organizing/stocking product. Senior Game Advisor/Key holder GameStop May 2001  –  July 2004  (3 years 3 months) Opening/closing store, accounting, shipping/receiving, organizing/stocking product. Electronics Technician Intern Ryzex December 2002  –  January 2003  (2 months) Troubleshooting, repairing, and testing of data collection/bar-coding equipment. Electronics Technician Intern Ryzex December 2002  –  January 2003  (2 months) Troubleshooting, repairing, and testing of data collection/bar-coding equipment. Skills Top Skills 6 Troubleshooting 4 Electronics 3 Testing 3 Semiconductors 2 Automation 2 Engineering 2 Hardware 2 Project Management 2 Manufacturing 2 Program Management Eric also knows about... 1 Lean Manufacturing 1 Management 1 Team Leadership 1 Inventory Management 1 Customer Service 1 Computer Hardware 1 Microsoft Office 0 Computer Repair 0 Networking 0 Windows 7 0 Technical Writing Skills  Top Skills 6 Troubleshooting 4 Electronics 3 Testing 3 Semiconductors 2 Automation 2 Engineering 2 Hardware 2 Project Management 2 Manufacturing 2 Program Management Eric also knows about... 1 Lean Manufacturing 1 Management 1 Team Leadership 1 Inventory Management 1 Customer Service 1 Computer Hardware 1 Microsoft Office 0 Computer Repair 0 Networking 0 Windows 7 0 Technical Writing Top Skills 6 Troubleshooting 4 Electronics 3 Testing 3 Semiconductors 2 Automation 2 Engineering 2 Hardware 2 Project Management 2 Manufacturing 2 Program Management Eric also knows about... 1 Lean Manufacturing 1 Management 1 Team Leadership 1 Inventory Management 1 Customer Service 1 Computer Hardware 1 Microsoft Office 0 Computer Repair 0 Networking 0 Windows 7 0 Technical Writing Top Skills 6 Troubleshooting 4 Electronics 3 Testing 3 Semiconductors 2 Automation 2 Engineering 2 Hardware 2 Project Management 2 Manufacturing 2 Program Management Eric also knows about... 1 Lean Manufacturing 1 Management 1 Team Leadership 1 Inventory Management 1 Customer Service 1 Computer Hardware 1 Microsoft Office 0 Computer Repair 0 Networking 0 Windows 7 0 Technical Writing                     1 Lean Manufacturing 1 Management 1 Team Leadership 1 Inventory Management 1 Customer Service 1 Computer Hardware 1 Microsoft Office 0 Computer Repair 0 Networking 0 Windows 7 0 Technical Writing Education Bellingham Technical College AAS,  Electronics Technology 2002  – 2004 Bellingham Technical College AAS,  Electronics Technology 2002  – 2004 Bellingham Technical College AAS,  Electronics Technology 2002  – 2004 Bellingham Technical College AAS,  Electronics Technology 2002  – 2004 ", "Summary I am a BSEE with over 11 years of work experience related to high technology. I strive to maintain a high level of professionalism and quality in any task I undertake while delivering results in a swift timeframe. \n \nI look forward to applying the knowledge and experience I have gained through my education at UCCS and using it to compliment the work experience I have acquired over the years. Summary I am a BSEE with over 11 years of work experience related to high technology. I strive to maintain a high level of professionalism and quality in any task I undertake while delivering results in a swift timeframe. \n \nI look forward to applying the knowledge and experience I have gained through my education at UCCS and using it to compliment the work experience I have acquired over the years. I am a BSEE with over 11 years of work experience related to high technology. I strive to maintain a high level of professionalism and quality in any task I undertake while delivering results in a swift timeframe. \n \nI look forward to applying the knowledge and experience I have gained through my education at UCCS and using it to compliment the work experience I have acquired over the years. I am a BSEE with over 11 years of work experience related to high technology. I strive to maintain a high level of professionalism and quality in any task I undertake while delivering results in a swift timeframe. \n \nI look forward to applying the knowledge and experience I have gained through my education at UCCS and using it to compliment the work experience I have acquired over the years. Experience Electrical\\Hardware Design Engineer Hewlett-Packard September 2012  – Present (3 years) Colorado Springs, Colorado Area Design electrical and hardware system components for next generation storage servers. Self-Employed N/A October 2002  –  October 2012  (10 years 1 month) N/A Odd jobs concerning: \n--Carpentry (stairs, dog doors, wiring installation,tiling,  \nframing),  \n--MIG welding (horse arena gate, utility cart, mower repair), \n--Computer Repair (including setting up WiFi printers and WiFi networks). Probe Card Repair Engineering Technician Intel Corporation November 2001  –  August 2002  (10 months) Colorado Springs, CO --Responsible for probe card repair daily operation, and department management.  \n--In-house probe card inventory tracking \n--Equipment preventative maintenance scheduling \n--Equipment set up, balancing repair work volume \n--Identifying probe card inventory issues, and cross-site probe card inventory balancing. \n* Floor lacked inventory program, wrote interim \nExcel program to track problems and repairs  \nfor probe cards. This resulted in accurate \nrecords and tracking of probe card failures and \nrepair. Sort Industrial Engineering Technician Intel Corporation January 2000  –  November 2001  (1 year 11 months) Colorado Springs, CO --Outfitted the Sort production floor with ergonomic set-ups in workstations and processing equipment, strategic process layout to ensure efficient process flow \n--Completed equipment installations and qualifications. \n--Identified processing step issues and found cost effective solutions.  \n* Completed full ergonomic set up of sort floor, ergonomic  \nset up resulted in zero occupational injuries during the  \nyear. \n* Identified cost avoidance of several thousand dollars by  \nutilizing alternative design and recycled equipment for the \nsort floor. Senior Analytical Engineering Technician Intel Corporation December 1998  –  January 2000  (1 year 2 months) Chandler, AZ --Performed failure analysis and data collection on test BGA units to ensure a robust process was delivered to the production factory and revenue production yields were maximized. \n--Maintained a high level of safety in the lab and office area. \n--Completed yield analysis for microprocessor test vehicles. \n--Highlighted product or process issues and resolved with engineering team. \n--Analyze and identify failure mechanisms for several microprocessor test vehicles. \n--Developed, wrote and implemented procedures used to aid in the analysis process. \n--Wrote and delivered presentations on resulting data to factory and process managers. \n--Reported out yield data in factory operations meeting, process improvement meetings (PIMs) \n--Revision reviews. \n--Familiar with many applications, systems and \ndatabases which are used in the analysis process \nincluding SPEED, WorkStream, E.A.T.S., DataOutpost, DataView, Allegro, MS Excel, MS Excel VBA, MS Word, MS PowerPoint, JMP, ImagePro, D.O.S. and MS Imaging. \n--Familiar with many types of equipment which are used to \nconduct analysis such as: Sonix acoustical microscope, Fien Focus x-ray, Phillips Scanning Electron Microscopy, \nDNC CNC mill, Keithly multimeter, Plasma etch furnace, \nNikon and Lieca microscopes and Buhler polishers \n* Existing seasoned team lacked comprehensive \nexperience utilizing failure analysis (FA) tool sets.  \nPersonally took initiative to cross train and fully utilize all  \nFA tools and cross-trained other FA team members. Senior Manufacturing Equipment Technician Intel Corporation December 1997  –  December 1998  (1 year 1 month) Chandler, AZ --Senior MTE ensuring maximized utilization of equipment  \nand balancing engineering runs at the front of line \nfunctional area. \n--Performed PMs, guaranteed safety of equipment and production floor, developed escalation and  \nmaintenance specifications \n--Conducted engineering experiments and data collection  \n--Worked with cross site joint engineering teams for process and equipment improvements.  \n* Initiated and completed White Paper for dicing saw  \nionized water supply to increase product yield.  \n* Brought up Controlled Collapse Chip Connect line for Die  \nPreparation area in record time.  \n* Wrote program to track calibration requirements for  \nequipment to ensure preventive maintenance schedules  \nwere on time and accurate. Senior Manufacturing Technician Intel Corporation August 1995  –  December 1997  (2 years 5 months) Chandler, AZ --Processed microprocessor units in a high volume production environment. \n--Supported shift supervisor by monitoring the floor operations. \n--Identified processing issues and implemented corrective actions. \n--Led team exercises at the start of shift. \n--Facilitated training for new employees Warehouse Manager, Office Maintenance, and Technical Support Representative National Guardian / Silent Watchman Security Services September 1994  –  August 1995  (1 year) Phoenix, AZ --Ensured field installation technicians had the equipment  \nand tools needed to perform customer installations and  \nfield service. \n--Maintained warehouse inventory, familiar with a wide range of data systems and alarm equipment. \n--Installation, setup and maintenance of Novell  \nPeer-to-Peer network. \n--Guided field technicians with installations, maintenance, troubleshooting and repair of alarm systems. Technical Support Representative Silent Watchman Division March 1991  –  August 1994  (3 years 6 months) Obetz, OH --Assisted field install technicians with system specific set-up, operation, and programming information. \n--Assisted field technicians with troubleshooting and repair of alarm system equipment. \n--Assisted customers with access code changes. \n--Researched alarm histories to aid in investigations and litigation. \n--Designed and constructed electronic circuits for alarm system use. Lab Technician Dresser Industries / Jeffery Division November 1989  –  March 1991  (1 year 5 months) Columbus, OH --Ensured field transmitters and receiver for the mining  \nequipment operated within their design specifications.  \n--Calibrated, troubleshot, and repaired transmitters and  \nreceivers. \n--Worked with interfacing equipment between  \nmining controls and receiver. Managed radio repair  \ndepartment. Electrical\\Hardware Design Engineer Hewlett-Packard September 2012  – Present (3 years) Colorado Springs, Colorado Area Design electrical and hardware system components for next generation storage servers. Electrical\\Hardware Design Engineer Hewlett-Packard September 2012  – Present (3 years) Colorado Springs, Colorado Area Design electrical and hardware system components for next generation storage servers. Self-Employed N/A October 2002  –  October 2012  (10 years 1 month) N/A Odd jobs concerning: \n--Carpentry (stairs, dog doors, wiring installation,tiling,  \nframing),  \n--MIG welding (horse arena gate, utility cart, mower repair), \n--Computer Repair (including setting up WiFi printers and WiFi networks). Self-Employed N/A October 2002  –  October 2012  (10 years 1 month) N/A Odd jobs concerning: \n--Carpentry (stairs, dog doors, wiring installation,tiling,  \nframing),  \n--MIG welding (horse arena gate, utility cart, mower repair), \n--Computer Repair (including setting up WiFi printers and WiFi networks). Probe Card Repair Engineering Technician Intel Corporation November 2001  –  August 2002  (10 months) Colorado Springs, CO --Responsible for probe card repair daily operation, and department management.  \n--In-house probe card inventory tracking \n--Equipment preventative maintenance scheduling \n--Equipment set up, balancing repair work volume \n--Identifying probe card inventory issues, and cross-site probe card inventory balancing. \n* Floor lacked inventory program, wrote interim \nExcel program to track problems and repairs  \nfor probe cards. This resulted in accurate \nrecords and tracking of probe card failures and \nrepair. Probe Card Repair Engineering Technician Intel Corporation November 2001  –  August 2002  (10 months) Colorado Springs, CO --Responsible for probe card repair daily operation, and department management.  \n--In-house probe card inventory tracking \n--Equipment preventative maintenance scheduling \n--Equipment set up, balancing repair work volume \n--Identifying probe card inventory issues, and cross-site probe card inventory balancing. \n* Floor lacked inventory program, wrote interim \nExcel program to track problems and repairs  \nfor probe cards. This resulted in accurate \nrecords and tracking of probe card failures and \nrepair. Sort Industrial Engineering Technician Intel Corporation January 2000  –  November 2001  (1 year 11 months) Colorado Springs, CO --Outfitted the Sort production floor with ergonomic set-ups in workstations and processing equipment, strategic process layout to ensure efficient process flow \n--Completed equipment installations and qualifications. \n--Identified processing step issues and found cost effective solutions.  \n* Completed full ergonomic set up of sort floor, ergonomic  \nset up resulted in zero occupational injuries during the  \nyear. \n* Identified cost avoidance of several thousand dollars by  \nutilizing alternative design and recycled equipment for the \nsort floor. Sort Industrial Engineering Technician Intel Corporation January 2000  –  November 2001  (1 year 11 months) Colorado Springs, CO --Outfitted the Sort production floor with ergonomic set-ups in workstations and processing equipment, strategic process layout to ensure efficient process flow \n--Completed equipment installations and qualifications. \n--Identified processing step issues and found cost effective solutions.  \n* Completed full ergonomic set up of sort floor, ergonomic  \nset up resulted in zero occupational injuries during the  \nyear. \n* Identified cost avoidance of several thousand dollars by  \nutilizing alternative design and recycled equipment for the \nsort floor. Senior Analytical Engineering Technician Intel Corporation December 1998  –  January 2000  (1 year 2 months) Chandler, AZ --Performed failure analysis and data collection on test BGA units to ensure a robust process was delivered to the production factory and revenue production yields were maximized. \n--Maintained a high level of safety in the lab and office area. \n--Completed yield analysis for microprocessor test vehicles. \n--Highlighted product or process issues and resolved with engineering team. \n--Analyze and identify failure mechanisms for several microprocessor test vehicles. \n--Developed, wrote and implemented procedures used to aid in the analysis process. \n--Wrote and delivered presentations on resulting data to factory and process managers. \n--Reported out yield data in factory operations meeting, process improvement meetings (PIMs) \n--Revision reviews. \n--Familiar with many applications, systems and \ndatabases which are used in the analysis process \nincluding SPEED, WorkStream, E.A.T.S., DataOutpost, DataView, Allegro, MS Excel, MS Excel VBA, MS Word, MS PowerPoint, JMP, ImagePro, D.O.S. and MS Imaging. \n--Familiar with many types of equipment which are used to \nconduct analysis such as: Sonix acoustical microscope, Fien Focus x-ray, Phillips Scanning Electron Microscopy, \nDNC CNC mill, Keithly multimeter, Plasma etch furnace, \nNikon and Lieca microscopes and Buhler polishers \n* Existing seasoned team lacked comprehensive \nexperience utilizing failure analysis (FA) tool sets.  \nPersonally took initiative to cross train and fully utilize all  \nFA tools and cross-trained other FA team members. Senior Analytical Engineering Technician Intel Corporation December 1998  –  January 2000  (1 year 2 months) Chandler, AZ --Performed failure analysis and data collection on test BGA units to ensure a robust process was delivered to the production factory and revenue production yields were maximized. \n--Maintained a high level of safety in the lab and office area. \n--Completed yield analysis for microprocessor test vehicles. \n--Highlighted product or process issues and resolved with engineering team. \n--Analyze and identify failure mechanisms for several microprocessor test vehicles. \n--Developed, wrote and implemented procedures used to aid in the analysis process. \n--Wrote and delivered presentations on resulting data to factory and process managers. \n--Reported out yield data in factory operations meeting, process improvement meetings (PIMs) \n--Revision reviews. \n--Familiar with many applications, systems and \ndatabases which are used in the analysis process \nincluding SPEED, WorkStream, E.A.T.S., DataOutpost, DataView, Allegro, MS Excel, MS Excel VBA, MS Word, MS PowerPoint, JMP, ImagePro, D.O.S. and MS Imaging. \n--Familiar with many types of equipment which are used to \nconduct analysis such as: Sonix acoustical microscope, Fien Focus x-ray, Phillips Scanning Electron Microscopy, \nDNC CNC mill, Keithly multimeter, Plasma etch furnace, \nNikon and Lieca microscopes and Buhler polishers \n* Existing seasoned team lacked comprehensive \nexperience utilizing failure analysis (FA) tool sets.  \nPersonally took initiative to cross train and fully utilize all  \nFA tools and cross-trained other FA team members. Senior Manufacturing Equipment Technician Intel Corporation December 1997  –  December 1998  (1 year 1 month) Chandler, AZ --Senior MTE ensuring maximized utilization of equipment  \nand balancing engineering runs at the front of line \nfunctional area. \n--Performed PMs, guaranteed safety of equipment and production floor, developed escalation and  \nmaintenance specifications \n--Conducted engineering experiments and data collection  \n--Worked with cross site joint engineering teams for process and equipment improvements.  \n* Initiated and completed White Paper for dicing saw  \nionized water supply to increase product yield.  \n* Brought up Controlled Collapse Chip Connect line for Die  \nPreparation area in record time.  \n* Wrote program to track calibration requirements for  \nequipment to ensure preventive maintenance schedules  \nwere on time and accurate. Senior Manufacturing Equipment Technician Intel Corporation December 1997  –  December 1998  (1 year 1 month) Chandler, AZ --Senior MTE ensuring maximized utilization of equipment  \nand balancing engineering runs at the front of line \nfunctional area. \n--Performed PMs, guaranteed safety of equipment and production floor, developed escalation and  \nmaintenance specifications \n--Conducted engineering experiments and data collection  \n--Worked with cross site joint engineering teams for process and equipment improvements.  \n* Initiated and completed White Paper for dicing saw  \nionized water supply to increase product yield.  \n* Brought up Controlled Collapse Chip Connect line for Die  \nPreparation area in record time.  \n* Wrote program to track calibration requirements for  \nequipment to ensure preventive maintenance schedules  \nwere on time and accurate. Senior Manufacturing Technician Intel Corporation August 1995  –  December 1997  (2 years 5 months) Chandler, AZ --Processed microprocessor units in a high volume production environment. \n--Supported shift supervisor by monitoring the floor operations. \n--Identified processing issues and implemented corrective actions. \n--Led team exercises at the start of shift. \n--Facilitated training for new employees Senior Manufacturing Technician Intel Corporation August 1995  –  December 1997  (2 years 5 months) Chandler, AZ --Processed microprocessor units in a high volume production environment. \n--Supported shift supervisor by monitoring the floor operations. \n--Identified processing issues and implemented corrective actions. \n--Led team exercises at the start of shift. \n--Facilitated training for new employees Warehouse Manager, Office Maintenance, and Technical Support Representative National Guardian / Silent Watchman Security Services September 1994  –  August 1995  (1 year) Phoenix, AZ --Ensured field installation technicians had the equipment  \nand tools needed to perform customer installations and  \nfield service. \n--Maintained warehouse inventory, familiar with a wide range of data systems and alarm equipment. \n--Installation, setup and maintenance of Novell  \nPeer-to-Peer network. \n--Guided field technicians with installations, maintenance, troubleshooting and repair of alarm systems. Warehouse Manager, Office Maintenance, and Technical Support Representative National Guardian / Silent Watchman Security Services September 1994  –  August 1995  (1 year) Phoenix, AZ --Ensured field installation technicians had the equipment  \nand tools needed to perform customer installations and  \nfield service. \n--Maintained warehouse inventory, familiar with a wide range of data systems and alarm equipment. \n--Installation, setup and maintenance of Novell  \nPeer-to-Peer network. \n--Guided field technicians with installations, maintenance, troubleshooting and repair of alarm systems. Technical Support Representative Silent Watchman Division March 1991  –  August 1994  (3 years 6 months) Obetz, OH --Assisted field install technicians with system specific set-up, operation, and programming information. \n--Assisted field technicians with troubleshooting and repair of alarm system equipment. \n--Assisted customers with access code changes. \n--Researched alarm histories to aid in investigations and litigation. \n--Designed and constructed electronic circuits for alarm system use. Technical Support Representative Silent Watchman Division March 1991  –  August 1994  (3 years 6 months) Obetz, OH --Assisted field install technicians with system specific set-up, operation, and programming information. \n--Assisted field technicians with troubleshooting and repair of alarm system equipment. \n--Assisted customers with access code changes. \n--Researched alarm histories to aid in investigations and litigation. \n--Designed and constructed electronic circuits for alarm system use. Lab Technician Dresser Industries / Jeffery Division November 1989  –  March 1991  (1 year 5 months) Columbus, OH --Ensured field transmitters and receiver for the mining  \nequipment operated within their design specifications.  \n--Calibrated, troubleshot, and repaired transmitters and  \nreceivers. \n--Worked with interfacing equipment between  \nmining controls and receiver. Managed radio repair  \ndepartment. Lab Technician Dresser Industries / Jeffery Division November 1989  –  March 1991  (1 year 5 months) Columbus, OH --Ensured field transmitters and receiver for the mining  \nequipment operated within their design specifications.  \n--Calibrated, troubleshot, and repaired transmitters and  \nreceivers. \n--Worked with interfacing equipment between  \nmining controls and receiver. Managed radio repair  \ndepartment. Languages Some basic Spanish Some basic Spanish Some basic Spanish Skills Top Skills 7 Troubleshooting 6 Testing 4 Engineering 3 Soldering 3 Team Building 3 Team-oriented 2 Networking 2 Electricians 1 Creativity 1 Persistence Don also knows about... 1 Higher Education 1 Self-starter 1 Electrical Engineering 0 Carpentry 0 Ingenuity 0 Resourceful 0 Open Minded Skills  Top Skills 7 Troubleshooting 6 Testing 4 Engineering 3 Soldering 3 Team Building 3 Team-oriented 2 Networking 2 Electricians 1 Creativity 1 Persistence Don also knows about... 1 Higher Education 1 Self-starter 1 Electrical Engineering 0 Carpentry 0 Ingenuity 0 Resourceful 0 Open Minded Top Skills 7 Troubleshooting 6 Testing 4 Engineering 3 Soldering 3 Team Building 3 Team-oriented 2 Networking 2 Electricians 1 Creativity 1 Persistence Don also knows about... 1 Higher Education 1 Self-starter 1 Electrical Engineering 0 Carpentry 0 Ingenuity 0 Resourceful 0 Open Minded Top Skills 7 Troubleshooting 6 Testing 4 Engineering 3 Soldering 3 Team Building 3 Team-oriented 2 Networking 2 Electricians 1 Creativity 1 Persistence Don also knows about... 1 Higher Education 1 Self-starter 1 Electrical Engineering 0 Carpentry 0 Ingenuity 0 Resourceful 0 Open Minded                     1 Higher Education 1 Self-starter 1 Electrical Engineering 0 Carpentry 0 Ingenuity 0 Resourceful 0 Open Minded Education University of Colorado Colorado Springs (UCCS) Bachelor of Science,  Electrical Engineering , 3.2 2002  – 2011 Classical Physics, Modern Physics, Astronomy, Electromagnetic Fields Activities and Societies:  Unofficial national society of stressed-out homework practitioners (UNOFFICIALLY). DeVry Insitute of Technology Associate of Applied Science,  General Electronics , 3.42 1989  – 1991 University of Colorado Colorado Springs (UCCS) Bachelor of Science,  Electrical Engineering , 3.2 2002  – 2011 Classical Physics, Modern Physics, Astronomy, Electromagnetic Fields Activities and Societies:  Unofficial national society of stressed-out homework practitioners (UNOFFICIALLY). University of Colorado Colorado Springs (UCCS) Bachelor of Science,  Electrical Engineering , 3.2 2002  – 2011 Classical Physics, Modern Physics, Astronomy, Electromagnetic Fields Activities and Societies:  Unofficial national society of stressed-out homework practitioners (UNOFFICIALLY). University of Colorado Colorado Springs (UCCS) Bachelor of Science,  Electrical Engineering , 3.2 2002  – 2011 Classical Physics, Modern Physics, Astronomy, Electromagnetic Fields Activities and Societies:  Unofficial national society of stressed-out homework practitioners (UNOFFICIALLY). DeVry Insitute of Technology Associate of Applied Science,  General Electronics , 3.42 1989  – 1991 DeVry Insitute of Technology Associate of Applied Science,  General Electronics , 3.42 1989  – 1991 DeVry Insitute of Technology Associate of Applied Science,  General Electronics , 3.42 1989  – 1991 Honors & Awards Additional Honors & Awards Intel: \n--1995 \n----Team Support - Stand-in supervisor \n----Excursion prevention \n--1996 \n----Team Support - Operation coverage \n----Peer training Workshop \n----Peer training \n----Basic Sensor Training \n--1997 \n----Adept MV/550 robot sys. maintenance training \n----Eaton Verticle Furnace, Level 2 maintenance training \n----Team Support - Peer troubleshooting support \n--1998 \n----Bin 13 cross site lot identification \n----Eaton Compact 2, Level 3 training \n--1999 \n----DOE task force during off hours \n----Cross Team Support - DNC milling machine \n---------------------------------- Water jet cutter \n---------------------------------- OLGA 2 FA \n---------------------------------- Operations coordination \n----Equipment improvement for Eaton Verticle Furnace \n--2000 \n----Cross Team Support - MCM platform activities \n--------------------------------- Assisting with staffing support \n \nSCHOOL \nWho's Who Amoung American High School Students, 1989 Additional Honors & Awards Intel: \n--1995 \n----Team Support - Stand-in supervisor \n----Excursion prevention \n--1996 \n----Team Support - Operation coverage \n----Peer training Workshop \n----Peer training \n----Basic Sensor Training \n--1997 \n----Adept MV/550 robot sys. maintenance training \n----Eaton Verticle Furnace, Level 2 maintenance training \n----Team Support - Peer troubleshooting support \n--1998 \n----Bin 13 cross site lot identification \n----Eaton Compact 2, Level 3 training \n--1999 \n----DOE task force during off hours \n----Cross Team Support - DNC milling machine \n---------------------------------- Water jet cutter \n---------------------------------- OLGA 2 FA \n---------------------------------- Operations coordination \n----Equipment improvement for Eaton Verticle Furnace \n--2000 \n----Cross Team Support - MCM platform activities \n--------------------------------- Assisting with staffing support \n \nSCHOOL \nWho's Who Amoung American High School Students, 1989 Additional Honors & Awards Intel: \n--1995 \n----Team Support - Stand-in supervisor \n----Excursion prevention \n--1996 \n----Team Support - Operation coverage \n----Peer training Workshop \n----Peer training \n----Basic Sensor Training \n--1997 \n----Adept MV/550 robot sys. maintenance training \n----Eaton Verticle Furnace, Level 2 maintenance training \n----Team Support - Peer troubleshooting support \n--1998 \n----Bin 13 cross site lot identification \n----Eaton Compact 2, Level 3 training \n--1999 \n----DOE task force during off hours \n----Cross Team Support - DNC milling machine \n---------------------------------- Water jet cutter \n---------------------------------- OLGA 2 FA \n---------------------------------- Operations coordination \n----Equipment improvement for Eaton Verticle Furnace \n--2000 \n----Cross Team Support - MCM platform activities \n--------------------------------- Assisting with staffing support \n \nSCHOOL \nWho's Who Amoung American High School Students, 1989 Additional Honors & Awards Intel: \n--1995 \n----Team Support - Stand-in supervisor \n----Excursion prevention \n--1996 \n----Team Support - Operation coverage \n----Peer training Workshop \n----Peer training \n----Basic Sensor Training \n--1997 \n----Adept MV/550 robot sys. maintenance training \n----Eaton Verticle Furnace, Level 2 maintenance training \n----Team Support - Peer troubleshooting support \n--1998 \n----Bin 13 cross site lot identification \n----Eaton Compact 2, Level 3 training \n--1999 \n----DOE task force during off hours \n----Cross Team Support - DNC milling machine \n---------------------------------- Water jet cutter \n---------------------------------- OLGA 2 FA \n---------------------------------- Operations coordination \n----Equipment improvement for Eaton Verticle Furnace \n--2000 \n----Cross Team Support - MCM platform activities \n--------------------------------- Assisting with staffing support \n \nSCHOOL \nWho's Who Amoung American High School Students, 1989 ", "Summary Organized, high energy, and goal-oriented professional who brings experience and maturity, along with excellent communication and interpersonal skills. Additionally, with over 18+ years of semiconductor manufacturing experience, I have 24+ years of electronic troubleshooting and maintenance experience. Currently highly experienced and trained in the semiconductor industry as a Engineering Technician. Work well with constant change and deadlines. Successful in developing people, and capable of gaining cooperation of others and motivate them to maximum performance Summary Organized, high energy, and goal-oriented professional who brings experience and maturity, along with excellent communication and interpersonal skills. Additionally, with over 18+ years of semiconductor manufacturing experience, I have 24+ years of electronic troubleshooting and maintenance experience. Currently highly experienced and trained in the semiconductor industry as a Engineering Technician. Work well with constant change and deadlines. Successful in developing people, and capable of gaining cooperation of others and motivate them to maximum performance Organized, high energy, and goal-oriented professional who brings experience and maturity, along with excellent communication and interpersonal skills. Additionally, with over 18+ years of semiconductor manufacturing experience, I have 24+ years of electronic troubleshooting and maintenance experience. Currently highly experienced and trained in the semiconductor industry as a Engineering Technician. Work well with constant change and deadlines. Successful in developing people, and capable of gaining cooperation of others and motivate them to maximum performance Organized, high energy, and goal-oriented professional who brings experience and maturity, along with excellent communication and interpersonal skills. Additionally, with over 18+ years of semiconductor manufacturing experience, I have 24+ years of electronic troubleshooting and maintenance experience. Currently highly experienced and trained in the semiconductor industry as a Engineering Technician. Work well with constant change and deadlines. Successful in developing people, and capable of gaining cooperation of others and motivate them to maximum performance Experience Engineering Technician Intel Corporation October 2013  – Present (1 year 11 months) Hillsboro, Oregon • Thin films Atomic Layer Deposition (ALD) process and maintenance experience. \n• Equipment coordinator, responsible for setting up the shift priorities, and all maintenance activities Senior Manufacturing Technician Intel Corporation August 2005  –  September 2013  (8 years 2 months) Fab 11X Rio Rancho, NM •\t8+ years of thin films Physical Vapor Deposition (PVD) process and maintenance experience. \n•\tEquipment coordinator, responsible for setting up the shift priorities, and all maintenance activities in CSB/CTI team.  \n•\tLead technician for on shift corrective maintenance activities on the Endura platform. \n•\tAssisting Engineering personnel in the continuous improvement and development of the manufacturing process, including engineering experiments.  \n•\tProactive member of quality, safety and maintenance teams. \n \nMaintenance Experience \n \n•\tSignificant responsibilities included: sustaining, upgrading and troubleshooting any major equipment issues. \n•\tExperience with electrical schematics, precision instruments, Robotics, Pneumatics, Lasers, High Voltage and High Vacuum systems. \n•\tMake visual and mechanical evaluations of equipment and process faults.  \n•\tResponsible for all breakdowns, annual, semi-annual, quarterly and preventive maintenance on the Endura 5500. \n•\tResponsible for responding and correcting all tool aborts / excursions. \n•\tMeticulous around wearing all Personal Protective Equipment (PPE) as required for high voltage, toxic or flammable gases and chemicals.  \n \nInterpersonal Skills \n \n•\tHighly trusted by management and engineering for decision making on a nightly basis. \n•\tLeading ATAC’s and conducting shift pass down meetings. \n•\tArea point of contact for all vendors and shift manager while cover the shift group leader. \n•\tAbility to work under time constants and motivate team in accomplishing shift goals. \n•\tTraining coordinator, responsible for keeping track of all training gaps within the shift. Manufacturing Technician Agere Systems (formally Lucent Technologies) October 1996  –  August 2005  (8 years 11 months) Orlando, Florida Area •\t8+ years of thin films Physical Vapor Deposition (PVD) process experience \n•\t8+ years of High Vacuum equipment diagnosis and maintenance experience. \n•\tTrained personnel to operate and process check a variety of PVD and diagnostic equipment.  \nMaintenance Experience  \n•\tResponsible for all breakdowns, annual, semi-annual, quarterly and preventive maintenance on the Novellus / Varian M2I (PVD) system and ChemWest parts cleaning facilities. \nProcess Experience \n•\tSignificant responsibilities included setting up, proving-in, and sustaining processes. Running and evaluating qualification tests, diagnosing the causes of process problems and taking corrective action according to the statistical process control (SPC) charts. Field Service Technician Pomeroy October 1995  –  October 1996  (1 year 1 month) Jacksonville, Florida •\tExperience with installing & troubleshooting local area networks (LAN) hardware & software. \n•\tOn-site customer support & diagnosis of computer and printer systems. \n•\tCoordinated computer support on behalf of my customer accounts. Satellite Uplink Engineer American Simulcasting Corp. April 1995  –  October 1996  (1 year 7 months) Jacksonville, Florida •\tFamiliar with operation of commercial digital and analog encryption and compressing equipment. \n•\tProficient with troubleshooting and maintenance of high-powered amplifiers. \n•\tWorking knowledge of spectrum analyzers & oscilloscopes. Communications Technician US Army August 1988  –  January 1992  (3 years 6 months) Sullivan Barracks and Coleman Barracks in Mannheim, Germany •\tPromoted 3 times, and individually recognized 6 times for outstanding performance on the job by the United States Army. \n•\tSupervised personnel in the installation and maintenance of communication systems. \n•\tTrained personnel to operate satellite, radio and telecommunications systems. \n•\tCoordinated the operation and maintenance of high frequency radio station in the Military Affiliate Radio System (MARS). Engineering Technician Intel Corporation October 2013  – Present (1 year 11 months) Hillsboro, Oregon • Thin films Atomic Layer Deposition (ALD) process and maintenance experience. \n• Equipment coordinator, responsible for setting up the shift priorities, and all maintenance activities Engineering Technician Intel Corporation October 2013  – Present (1 year 11 months) Hillsboro, Oregon • Thin films Atomic Layer Deposition (ALD) process and maintenance experience. \n• Equipment coordinator, responsible for setting up the shift priorities, and all maintenance activities Senior Manufacturing Technician Intel Corporation August 2005  –  September 2013  (8 years 2 months) Fab 11X Rio Rancho, NM •\t8+ years of thin films Physical Vapor Deposition (PVD) process and maintenance experience. \n•\tEquipment coordinator, responsible for setting up the shift priorities, and all maintenance activities in CSB/CTI team.  \n•\tLead technician for on shift corrective maintenance activities on the Endura platform. \n•\tAssisting Engineering personnel in the continuous improvement and development of the manufacturing process, including engineering experiments.  \n•\tProactive member of quality, safety and maintenance teams. \n \nMaintenance Experience \n \n•\tSignificant responsibilities included: sustaining, upgrading and troubleshooting any major equipment issues. \n•\tExperience with electrical schematics, precision instruments, Robotics, Pneumatics, Lasers, High Voltage and High Vacuum systems. \n•\tMake visual and mechanical evaluations of equipment and process faults.  \n•\tResponsible for all breakdowns, annual, semi-annual, quarterly and preventive maintenance on the Endura 5500. \n•\tResponsible for responding and correcting all tool aborts / excursions. \n•\tMeticulous around wearing all Personal Protective Equipment (PPE) as required for high voltage, toxic or flammable gases and chemicals.  \n \nInterpersonal Skills \n \n•\tHighly trusted by management and engineering for decision making on a nightly basis. \n•\tLeading ATAC’s and conducting shift pass down meetings. \n•\tArea point of contact for all vendors and shift manager while cover the shift group leader. \n•\tAbility to work under time constants and motivate team in accomplishing shift goals. \n•\tTraining coordinator, responsible for keeping track of all training gaps within the shift. Senior Manufacturing Technician Intel Corporation August 2005  –  September 2013  (8 years 2 months) Fab 11X Rio Rancho, NM •\t8+ years of thin films Physical Vapor Deposition (PVD) process and maintenance experience. \n•\tEquipment coordinator, responsible for setting up the shift priorities, and all maintenance activities in CSB/CTI team.  \n•\tLead technician for on shift corrective maintenance activities on the Endura platform. \n•\tAssisting Engineering personnel in the continuous improvement and development of the manufacturing process, including engineering experiments.  \n•\tProactive member of quality, safety and maintenance teams. \n \nMaintenance Experience \n \n•\tSignificant responsibilities included: sustaining, upgrading and troubleshooting any major equipment issues. \n•\tExperience with electrical schematics, precision instruments, Robotics, Pneumatics, Lasers, High Voltage and High Vacuum systems. \n•\tMake visual and mechanical evaluations of equipment and process faults.  \n•\tResponsible for all breakdowns, annual, semi-annual, quarterly and preventive maintenance on the Endura 5500. \n•\tResponsible for responding and correcting all tool aborts / excursions. \n•\tMeticulous around wearing all Personal Protective Equipment (PPE) as required for high voltage, toxic or flammable gases and chemicals.  \n \nInterpersonal Skills \n \n•\tHighly trusted by management and engineering for decision making on a nightly basis. \n•\tLeading ATAC’s and conducting shift pass down meetings. \n•\tArea point of contact for all vendors and shift manager while cover the shift group leader. \n•\tAbility to work under time constants and motivate team in accomplishing shift goals. \n•\tTraining coordinator, responsible for keeping track of all training gaps within the shift. Manufacturing Technician Agere Systems (formally Lucent Technologies) October 1996  –  August 2005  (8 years 11 months) Orlando, Florida Area •\t8+ years of thin films Physical Vapor Deposition (PVD) process experience \n•\t8+ years of High Vacuum equipment diagnosis and maintenance experience. \n•\tTrained personnel to operate and process check a variety of PVD and diagnostic equipment.  \nMaintenance Experience  \n•\tResponsible for all breakdowns, annual, semi-annual, quarterly and preventive maintenance on the Novellus / Varian M2I (PVD) system and ChemWest parts cleaning facilities. \nProcess Experience \n•\tSignificant responsibilities included setting up, proving-in, and sustaining processes. Running and evaluating qualification tests, diagnosing the causes of process problems and taking corrective action according to the statistical process control (SPC) charts. Manufacturing Technician Agere Systems (formally Lucent Technologies) October 1996  –  August 2005  (8 years 11 months) Orlando, Florida Area •\t8+ years of thin films Physical Vapor Deposition (PVD) process experience \n•\t8+ years of High Vacuum equipment diagnosis and maintenance experience. \n•\tTrained personnel to operate and process check a variety of PVD and diagnostic equipment.  \nMaintenance Experience  \n•\tResponsible for all breakdowns, annual, semi-annual, quarterly and preventive maintenance on the Novellus / Varian M2I (PVD) system and ChemWest parts cleaning facilities. \nProcess Experience \n•\tSignificant responsibilities included setting up, proving-in, and sustaining processes. Running and evaluating qualification tests, diagnosing the causes of process problems and taking corrective action according to the statistical process control (SPC) charts. Field Service Technician Pomeroy October 1995  –  October 1996  (1 year 1 month) Jacksonville, Florida •\tExperience with installing & troubleshooting local area networks (LAN) hardware & software. \n•\tOn-site customer support & diagnosis of computer and printer systems. \n•\tCoordinated computer support on behalf of my customer accounts. Field Service Technician Pomeroy October 1995  –  October 1996  (1 year 1 month) Jacksonville, Florida •\tExperience with installing & troubleshooting local area networks (LAN) hardware & software. \n•\tOn-site customer support & diagnosis of computer and printer systems. \n•\tCoordinated computer support on behalf of my customer accounts. Satellite Uplink Engineer American Simulcasting Corp. April 1995  –  October 1996  (1 year 7 months) Jacksonville, Florida •\tFamiliar with operation of commercial digital and analog encryption and compressing equipment. \n•\tProficient with troubleshooting and maintenance of high-powered amplifiers. \n•\tWorking knowledge of spectrum analyzers & oscilloscopes. Satellite Uplink Engineer American Simulcasting Corp. April 1995  –  October 1996  (1 year 7 months) Jacksonville, Florida •\tFamiliar with operation of commercial digital and analog encryption and compressing equipment. \n•\tProficient with troubleshooting and maintenance of high-powered amplifiers. \n•\tWorking knowledge of spectrum analyzers & oscilloscopes. Communications Technician US Army August 1988  –  January 1992  (3 years 6 months) Sullivan Barracks and Coleman Barracks in Mannheim, Germany •\tPromoted 3 times, and individually recognized 6 times for outstanding performance on the job by the United States Army. \n•\tSupervised personnel in the installation and maintenance of communication systems. \n•\tTrained personnel to operate satellite, radio and telecommunications systems. \n•\tCoordinated the operation and maintenance of high frequency radio station in the Military Affiliate Radio System (MARS). Communications Technician US Army August 1988  –  January 1992  (3 years 6 months) Sullivan Barracks and Coleman Barracks in Mannheim, Germany •\tPromoted 3 times, and individually recognized 6 times for outstanding performance on the job by the United States Army. \n•\tSupervised personnel in the installation and maintenance of communication systems. \n•\tTrained personnel to operate satellite, radio and telecommunications systems. \n•\tCoordinated the operation and maintenance of high frequency radio station in the Military Affiliate Radio System (MARS). Skills Top Skills 7 SPC 8 Test Equipment 8 Manufacturing 6 Intel 10 Semiconductors 6 Failure Analysis 5 Metrology 5 Design of Experiments 10 Equipment Maintenance 8 Semiconductor... James also knows about... 6 High Vacuum 5 Clean Rooms 6 Preventive Maintenance 4 Equipment Installation 4 Electronics 2 Pneumatics 3 Multimeter 3 Lean Manufacturing 6 Thin Films 5 Manufacturing Operations 3 Robotics 2 Continuous Improvement 5 Troubleshooting 4 Semiconductor Industry 2 Oscilloscope 2 Engineering 2 Soldering 1 JMP 2 Calibration 2 Testing 2 IC 1 RF 2 Silicon 0 PVD 1 Cross-functional Team... 1 Field Service 1 Six Sigma 1 Process Improvement 0 Root Cause Analysis See 14+     See less Skills  Top Skills 7 SPC 8 Test Equipment 8 Manufacturing 6 Intel 10 Semiconductors 6 Failure Analysis 5 Metrology 5 Design of Experiments 10 Equipment Maintenance 8 Semiconductor... James also knows about... 6 High Vacuum 5 Clean Rooms 6 Preventive Maintenance 4 Equipment Installation 4 Electronics 2 Pneumatics 3 Multimeter 3 Lean Manufacturing 6 Thin Films 5 Manufacturing Operations 3 Robotics 2 Continuous Improvement 5 Troubleshooting 4 Semiconductor Industry 2 Oscilloscope 2 Engineering 2 Soldering 1 JMP 2 Calibration 2 Testing 2 IC 1 RF 2 Silicon 0 PVD 1 Cross-functional Team... 1 Field Service 1 Six Sigma 1 Process Improvement 0 Root Cause Analysis See 14+     See less Top Skills 7 SPC 8 Test Equipment 8 Manufacturing 6 Intel 10 Semiconductors 6 Failure Analysis 5 Metrology 5 Design of Experiments 10 Equipment Maintenance 8 Semiconductor... James also knows about... 6 High Vacuum 5 Clean Rooms 6 Preventive Maintenance 4 Equipment Installation 4 Electronics 2 Pneumatics 3 Multimeter 3 Lean Manufacturing 6 Thin Films 5 Manufacturing Operations 3 Robotics 2 Continuous Improvement 5 Troubleshooting 4 Semiconductor Industry 2 Oscilloscope 2 Engineering 2 Soldering 1 JMP 2 Calibration 2 Testing 2 IC 1 RF 2 Silicon 0 PVD 1 Cross-functional Team... 1 Field Service 1 Six Sigma 1 Process Improvement 0 Root Cause Analysis See 14+     See less Top Skills 7 SPC 8 Test Equipment 8 Manufacturing 6 Intel 10 Semiconductors 6 Failure Analysis 5 Metrology 5 Design of Experiments 10 Equipment Maintenance 8 Semiconductor... James also knows about... 6 High Vacuum 5 Clean Rooms 6 Preventive Maintenance 4 Equipment Installation 4 Electronics 2 Pneumatics 3 Multimeter 3 Lean Manufacturing 6 Thin Films 5 Manufacturing Operations 3 Robotics 2 Continuous Improvement 5 Troubleshooting 4 Semiconductor Industry 2 Oscilloscope 2 Engineering 2 Soldering 1 JMP 2 Calibration 2 Testing 2 IC 1 RF 2 Silicon 0 PVD 1 Cross-functional Team... 1 Field Service 1 Six Sigma 1 Process Improvement 0 Root Cause Analysis See 14+     See less                     6 High Vacuum 5 Clean Rooms 6 Preventive Maintenance 4 Equipment Installation 4 Electronics 2 Pneumatics 3 Multimeter 3 Lean Manufacturing 6 Thin Films 5 Manufacturing Operations 3 Robotics 2 Continuous Improvement 5 Troubleshooting 4 Semiconductor Industry 2 Oscilloscope 2 Engineering 2 Soldering 1 JMP 2 Calibration 2 Testing 2 IC 1 RF 2 Silicon 0 PVD 1 Cross-functional Team... 1 Field Service 1 Six Sigma 1 Process Improvement 0 Root Cause Analysis Education ITT Technical Institute-Jacksonville, Florida Associate of Arts and Sciences (AAS),  Electrical and Electronics Engineering 1994  – 1996 Sandalwood High School High School 1985  – 1988 ITT Technical Institute-Jacksonville, Florida Associate of Arts and Sciences (AAS),  Electrical and Electronics Engineering 1994  – 1996 ITT Technical Institute-Jacksonville, Florida Associate of Arts and Sciences (AAS),  Electrical and Electronics Engineering 1994  – 1996 ITT Technical Institute-Jacksonville, Florida Associate of Arts and Sciences (AAS),  Electrical and Electronics Engineering 1994  – 1996 Sandalwood High School High School 1985  – 1988 Sandalwood High School High School 1985  – 1988 Sandalwood High School High School 1985  – 1988 ", "Summary Hello, thank you very much for reading my Bio. \n \nI am full time employed as a technician, Operating and fixing machines in a high volume manufacturing facility, high-vacuum plasma environment. I'm in my current position 18yrs.  \n \nI am married, with children and along with work and home-DIY, the pursuit of running to maintain fitness and never become complacent in life....  \nPhotography, by default is in the 3rd or 4th seat of interests. \n \nPhotography is a part time love affair. \nMy Passion is photography. I'm good at it - but I will always be trying to get better. \n \nPhotography for me is recording memories or images that tell stories. In short, I would describe myself in photography as a people watcher, watching for quirks or emotions at 'that moment'. \nI do not do invasive-paparazzi type images. Don't ask me to. \n \nMy by-line is : \"Telling some of life's stories through images\". \n \nWhen I do agree or commit to a project - I do stay the course and am totally sincere and honest in my dealings. Outside of agreed projects - what free time is spent exploring the streets and sights of Dublin and it's surrounds. \nOccasionally, if an image that could cause embarrassment to the subject, arrives through my lens. That's OK, I choose not to publish them. That's my choice. \nLife is there to be fun in, not to be made fun of.  \n \nI also choose NOT to be on Facebook - please don't invite me.  \n \nAll that said. Allow me to change my mind and update my bio as I develop thoughts and ideas through my images. Summary Hello, thank you very much for reading my Bio. \n \nI am full time employed as a technician, Operating and fixing machines in a high volume manufacturing facility, high-vacuum plasma environment. I'm in my current position 18yrs.  \n \nI am married, with children and along with work and home-DIY, the pursuit of running to maintain fitness and never become complacent in life....  \nPhotography, by default is in the 3rd or 4th seat of interests. \n \nPhotography is a part time love affair. \nMy Passion is photography. I'm good at it - but I will always be trying to get better. \n \nPhotography for me is recording memories or images that tell stories. In short, I would describe myself in photography as a people watcher, watching for quirks or emotions at 'that moment'. \nI do not do invasive-paparazzi type images. Don't ask me to. \n \nMy by-line is : \"Telling some of life's stories through images\". \n \nWhen I do agree or commit to a project - I do stay the course and am totally sincere and honest in my dealings. Outside of agreed projects - what free time is spent exploring the streets and sights of Dublin and it's surrounds. \nOccasionally, if an image that could cause embarrassment to the subject, arrives through my lens. That's OK, I choose not to publish them. That's my choice. \nLife is there to be fun in, not to be made fun of.  \n \nI also choose NOT to be on Facebook - please don't invite me.  \n \nAll that said. Allow me to change my mind and update my bio as I develop thoughts and ideas through my images. Hello, thank you very much for reading my Bio. \n \nI am full time employed as a technician, Operating and fixing machines in a high volume manufacturing facility, high-vacuum plasma environment. I'm in my current position 18yrs.  \n \nI am married, with children and along with work and home-DIY, the pursuit of running to maintain fitness and never become complacent in life....  \nPhotography, by default is in the 3rd or 4th seat of interests. \n \nPhotography is a part time love affair. \nMy Passion is photography. I'm good at it - but I will always be trying to get better. \n \nPhotography for me is recording memories or images that tell stories. In short, I would describe myself in photography as a people watcher, watching for quirks or emotions at 'that moment'. \nI do not do invasive-paparazzi type images. Don't ask me to. \n \nMy by-line is : \"Telling some of life's stories through images\". \n \nWhen I do agree or commit to a project - I do stay the course and am totally sincere and honest in my dealings. Outside of agreed projects - what free time is spent exploring the streets and sights of Dublin and it's surrounds. \nOccasionally, if an image that could cause embarrassment to the subject, arrives through my lens. That's OK, I choose not to publish them. That's my choice. \nLife is there to be fun in, not to be made fun of.  \n \nI also choose NOT to be on Facebook - please don't invite me.  \n \nAll that said. Allow me to change my mind and update my bio as I develop thoughts and ideas through my images. Hello, thank you very much for reading my Bio. \n \nI am full time employed as a technician, Operating and fixing machines in a high volume manufacturing facility, high-vacuum plasma environment. I'm in my current position 18yrs.  \n \nI am married, with children and along with work and home-DIY, the pursuit of running to maintain fitness and never become complacent in life....  \nPhotography, by default is in the 3rd or 4th seat of interests. \n \nPhotography is a part time love affair. \nMy Passion is photography. I'm good at it - but I will always be trying to get better. \n \nPhotography for me is recording memories or images that tell stories. In short, I would describe myself in photography as a people watcher, watching for quirks or emotions at 'that moment'. \nI do not do invasive-paparazzi type images. Don't ask me to. \n \nMy by-line is : \"Telling some of life's stories through images\". \n \nWhen I do agree or commit to a project - I do stay the course and am totally sincere and honest in my dealings. Outside of agreed projects - what free time is spent exploring the streets and sights of Dublin and it's surrounds. \nOccasionally, if an image that could cause embarrassment to the subject, arrives through my lens. That's OK, I choose not to publish them. That's my choice. \nLife is there to be fun in, not to be made fun of.  \n \nI also choose NOT to be on Facebook - please don't invite me.  \n \nAll that said. Allow me to change my mind and update my bio as I develop thoughts and ideas through my images. Experience Senior Manufacturing Technician Intel Corporation June 1997  – Present (18 years 3 months) Leixlip, Co Kildare, Ireland Senior manufacturing Technician.  \nHi-Vacuum, Plasma, and PVD systems. \nShift based, 12hr rotating Nights/Days and also front/Back end week. \n \nIn short, you never know what time of day or night you might find me responding to tool alarms or emails. \n \n\"No matter how complex the machine, it's still only nut, bolts and wires - with a bit of magic thrown in\" Volunteer Photographer, Media Team Triathlon Ireland April 2012  – Present (3 years 5 months) Island of Ireland Volunteer Media team member with Triathlon Ireland, the National governing body for Triathlon and related sports in Ireland  Machinery installation fitter, logistics transport Elenco Engineering Co. October 1996  –  June 1997  (9 months) Dublin, Ireland Again on the road, seeing the country. \nTo sum up: I was a machinery installation fitter. My Duties were on-site survey, machinery decommission, removal from premises, transport logistics to new destination. Installation on new premises and assisting commissioning of installed toolsets. \nDepending on contract, some or all, of above component parts of an operation. \n \nWas I on my own ? No - not a chance. We were a small crew, the riggers, having been in the business a longer time knew their roles very well and were safe - very safe in their work. An abiding memory of the time was their motto: \"A 10-Tonne machine don't bounce\" ! \n \nI was responsible for the dismantling and re-assembling of machinery I had never seen before, so every contract was a learning, often difficult but never dull ! Transport Driver and Logistics Capital Stone, Dublin July 1996  –  September 1996  (3 months) Dublin, Ireland Back on home soil, recovered form Malaria - Yes, Africa finally caught me and in my last weeks too. \nYou've got to keep moving, doing something.  \nIt's alright saying - I was there, it's better saying I am here ! \n \nLogistical planning and transportation of granite and marble source material and finished product from a Dublin central location to throughout Ireland. Occasionally from Britain also. \n \nI enjoyed this job, not my norm - something different, a good way to settle back home ! Field service officer United Nations October 1994  –  June 1996  (1 year 9 months) Kigali, Rwanda Accepting a position as FSO in the UN was a major milestone. Similar to previous positions with regard to the logistical setup, maintenance and repair of electrical generating equipment throughout the country. Eventually in the withdrawal of the UN mission, assisting the convoy out through Uganda into Kenya. \nThe Genocide in Rwanda was only months in passing before my station, people still were in trauma and yet the country still needed to operate on a basic level.  \nA beautifully picturesque land and people. And like Liberia, a troubled past. Technical, volunteer United Nations April 1994  –  October 1994  (7 months) Liberia, West Africa Fleet service technican, Garage organisation and management. Convoy support and Logistics. \nBased in capital Monrovia. Involved with the daily support of fleet maintenance.  \nSpecialist skills included the logistical and physical support of vehicle convoys incoming from C'ote D'Ivoir. Retrieval of damaged vehicles also, in particular under duress of hostile fire. \nSome French language skill (lowkey). \n \nLiberia in west Africa was under the grip of a Civil war, with Charles Taylor on one side and local Government on the other..  \nIt's rich political history from the freeing and repatriation of slaves, to the worlds largest rubber plantation.  \nImages from here are fewer due to the hostile activities, but if you wish to read more, please read here: http://www.un.org/en/peacekeeping/missions/unmil/background.shtml Technical, Volunteer United Nations January 1993  –  January 1994  (1 year 1 month) Cambodia A year in South-East Asia.  \nJealous - You should be - a remarkable land, and remarkable people. \nHave a read: http://www.un.org/en/peacekeeping/missions/past/untacbackgr1.html \n \nMy role in supporting the UN mission was in the logistical setup, maintenance and repair of electrical generating equipment throughout the northwest region of Cambodia, to allow the electoral officers run the first free and democratic elections in a country that had undergone a massive social and political change through War and Dictatorship. \n \nThroughout the mission, I always carried a camera (Film) - and some of the most memorable images I have ever taken are from here. Technical Staff Member British Antarctic Survey November 1990  –  April 1992  (1 year 6 months) Antarctica Overwintering in the Antarctic. Straight from my apprenticeship to support the life systems generators on science base with the BAS.  \nPhotographically - what a place to be ! Fantastic experience. Senior Manufacturing Technician Intel Corporation June 1997  – Present (18 years 3 months) Leixlip, Co Kildare, Ireland Senior manufacturing Technician.  \nHi-Vacuum, Plasma, and PVD systems. \nShift based, 12hr rotating Nights/Days and also front/Back end week. \n \nIn short, you never know what time of day or night you might find me responding to tool alarms or emails. \n \n\"No matter how complex the machine, it's still only nut, bolts and wires - with a bit of magic thrown in\" Senior Manufacturing Technician Intel Corporation June 1997  – Present (18 years 3 months) Leixlip, Co Kildare, Ireland Senior manufacturing Technician.  \nHi-Vacuum, Plasma, and PVD systems. \nShift based, 12hr rotating Nights/Days and also front/Back end week. \n \nIn short, you never know what time of day or night you might find me responding to tool alarms or emails. \n \n\"No matter how complex the machine, it's still only nut, bolts and wires - with a bit of magic thrown in\" Volunteer Photographer, Media Team Triathlon Ireland April 2012  – Present (3 years 5 months) Island of Ireland Volunteer Media team member with Triathlon Ireland, the National governing body for Triathlon and related sports in Ireland  Volunteer Photographer, Media Team Triathlon Ireland April 2012  – Present (3 years 5 months) Island of Ireland Volunteer Media team member with Triathlon Ireland, the National governing body for Triathlon and related sports in Ireland  Machinery installation fitter, logistics transport Elenco Engineering Co. October 1996  –  June 1997  (9 months) Dublin, Ireland Again on the road, seeing the country. \nTo sum up: I was a machinery installation fitter. My Duties were on-site survey, machinery decommission, removal from premises, transport logistics to new destination. Installation on new premises and assisting commissioning of installed toolsets. \nDepending on contract, some or all, of above component parts of an operation. \n \nWas I on my own ? No - not a chance. We were a small crew, the riggers, having been in the business a longer time knew their roles very well and were safe - very safe in their work. An abiding memory of the time was their motto: \"A 10-Tonne machine don't bounce\" ! \n \nI was responsible for the dismantling and re-assembling of machinery I had never seen before, so every contract was a learning, often difficult but never dull ! Machinery installation fitter, logistics transport Elenco Engineering Co. October 1996  –  June 1997  (9 months) Dublin, Ireland Again on the road, seeing the country. \nTo sum up: I was a machinery installation fitter. My Duties were on-site survey, machinery decommission, removal from premises, transport logistics to new destination. Installation on new premises and assisting commissioning of installed toolsets. \nDepending on contract, some or all, of above component parts of an operation. \n \nWas I on my own ? No - not a chance. We were a small crew, the riggers, having been in the business a longer time knew their roles very well and were safe - very safe in their work. An abiding memory of the time was their motto: \"A 10-Tonne machine don't bounce\" ! \n \nI was responsible for the dismantling and re-assembling of machinery I had never seen before, so every contract was a learning, often difficult but never dull ! Transport Driver and Logistics Capital Stone, Dublin July 1996  –  September 1996  (3 months) Dublin, Ireland Back on home soil, recovered form Malaria - Yes, Africa finally caught me and in my last weeks too. \nYou've got to keep moving, doing something.  \nIt's alright saying - I was there, it's better saying I am here ! \n \nLogistical planning and transportation of granite and marble source material and finished product from a Dublin central location to throughout Ireland. Occasionally from Britain also. \n \nI enjoyed this job, not my norm - something different, a good way to settle back home ! Transport Driver and Logistics Capital Stone, Dublin July 1996  –  September 1996  (3 months) Dublin, Ireland Back on home soil, recovered form Malaria - Yes, Africa finally caught me and in my last weeks too. \nYou've got to keep moving, doing something.  \nIt's alright saying - I was there, it's better saying I am here ! \n \nLogistical planning and transportation of granite and marble source material and finished product from a Dublin central location to throughout Ireland. Occasionally from Britain also. \n \nI enjoyed this job, not my norm - something different, a good way to settle back home ! Field service officer United Nations October 1994  –  June 1996  (1 year 9 months) Kigali, Rwanda Accepting a position as FSO in the UN was a major milestone. Similar to previous positions with regard to the logistical setup, maintenance and repair of electrical generating equipment throughout the country. Eventually in the withdrawal of the UN mission, assisting the convoy out through Uganda into Kenya. \nThe Genocide in Rwanda was only months in passing before my station, people still were in trauma and yet the country still needed to operate on a basic level.  \nA beautifully picturesque land and people. And like Liberia, a troubled past. Field service officer United Nations October 1994  –  June 1996  (1 year 9 months) Kigali, Rwanda Accepting a position as FSO in the UN was a major milestone. Similar to previous positions with regard to the logistical setup, maintenance and repair of electrical generating equipment throughout the country. Eventually in the withdrawal of the UN mission, assisting the convoy out through Uganda into Kenya. \nThe Genocide in Rwanda was only months in passing before my station, people still were in trauma and yet the country still needed to operate on a basic level.  \nA beautifully picturesque land and people. And like Liberia, a troubled past. Technical, volunteer United Nations April 1994  –  October 1994  (7 months) Liberia, West Africa Fleet service technican, Garage organisation and management. Convoy support and Logistics. \nBased in capital Monrovia. Involved with the daily support of fleet maintenance.  \nSpecialist skills included the logistical and physical support of vehicle convoys incoming from C'ote D'Ivoir. Retrieval of damaged vehicles also, in particular under duress of hostile fire. \nSome French language skill (lowkey). \n \nLiberia in west Africa was under the grip of a Civil war, with Charles Taylor on one side and local Government on the other..  \nIt's rich political history from the freeing and repatriation of slaves, to the worlds largest rubber plantation.  \nImages from here are fewer due to the hostile activities, but if you wish to read more, please read here: http://www.un.org/en/peacekeeping/missions/unmil/background.shtml Technical, volunteer United Nations April 1994  –  October 1994  (7 months) Liberia, West Africa Fleet service technican, Garage organisation and management. Convoy support and Logistics. \nBased in capital Monrovia. Involved with the daily support of fleet maintenance.  \nSpecialist skills included the logistical and physical support of vehicle convoys incoming from C'ote D'Ivoir. Retrieval of damaged vehicles also, in particular under duress of hostile fire. \nSome French language skill (lowkey). \n \nLiberia in west Africa was under the grip of a Civil war, with Charles Taylor on one side and local Government on the other..  \nIt's rich political history from the freeing and repatriation of slaves, to the worlds largest rubber plantation.  \nImages from here are fewer due to the hostile activities, but if you wish to read more, please read here: http://www.un.org/en/peacekeeping/missions/unmil/background.shtml Technical, Volunteer United Nations January 1993  –  January 1994  (1 year 1 month) Cambodia A year in South-East Asia.  \nJealous - You should be - a remarkable land, and remarkable people. \nHave a read: http://www.un.org/en/peacekeeping/missions/past/untacbackgr1.html \n \nMy role in supporting the UN mission was in the logistical setup, maintenance and repair of electrical generating equipment throughout the northwest region of Cambodia, to allow the electoral officers run the first free and democratic elections in a country that had undergone a massive social and political change through War and Dictatorship. \n \nThroughout the mission, I always carried a camera (Film) - and some of the most memorable images I have ever taken are from here. Technical, Volunteer United Nations January 1993  –  January 1994  (1 year 1 month) Cambodia A year in South-East Asia.  \nJealous - You should be - a remarkable land, and remarkable people. \nHave a read: http://www.un.org/en/peacekeeping/missions/past/untacbackgr1.html \n \nMy role in supporting the UN mission was in the logistical setup, maintenance and repair of electrical generating equipment throughout the northwest region of Cambodia, to allow the electoral officers run the first free and democratic elections in a country that had undergone a massive social and political change through War and Dictatorship. \n \nThroughout the mission, I always carried a camera (Film) - and some of the most memorable images I have ever taken are from here. Technical Staff Member British Antarctic Survey November 1990  –  April 1992  (1 year 6 months) Antarctica Overwintering in the Antarctic. Straight from my apprenticeship to support the life systems generators on science base with the BAS.  \nPhotographically - what a place to be ! Fantastic experience. Technical Staff Member British Antarctic Survey November 1990  –  April 1992  (1 year 6 months) Antarctica Overwintering in the Antarctic. Straight from my apprenticeship to support the life systems generators on science base with the BAS.  \nPhotographically - what a place to be ! Fantastic experience. Skills 2 Event Photography 1 Photography 1 Digital Photography 1 Camera 1 Photos 1 Portrait Photography Skills  2 Event Photography 1 Photography 1 Digital Photography 1 Camera 1 Photos 1 Portrait Photography 2 Event Photography 1 Photography 1 Digital Photography 1 Camera 1 Photos 1 Portrait Photography 2 Event Photography 1 Photography 1 Digital Photography 1 Camera 1 Photos 1 Portrait Photography             ", "Languages English Native or bilingual proficiency English Native or bilingual proficiency English Native or bilingual proficiency Native or bilingual proficiency Skills Skills     Education Penn State World Campus Project Management 2015  – 2015 Activities and Societies:  MGMNT 510 - Project Managment. A problem-based ,  interdisciplinary course in project management skills and techniques needed to manage projects in a modern business environment.\nMGMNT 515 - Cost and Value Managment. A problem-based course that emphasizes project cost control and teaches students to apply techniques to control projects in business. Keller Graduate School of Management of DeVry University Master of Business Administration (MBA),  Management Information Systems (MIS) , 3.83 2013  – 2014 DeVry University Bachelor of Science (B.S.),  Technical Management , 3.76 2008  – 2013 (Open) 3 recommendations, including: Chester (Chet) Arnett Sales Engineer at Surescripts I have completed many group projects with Alexander and his organization, leadership skills and innovative thinking have... View David Robinson Editor-in-Chief at Positive Feedback Online Alexander is a student whom I've had in a couple of my classes at DeVry University. He is exceptionally intelligent,... View 1 more recommendation Penn State World Campus Project Management 2015  – 2015 Activities and Societies:  MGMNT 510 - Project Managment. A problem-based ,  interdisciplinary course in project management skills and techniques needed to manage projects in a modern business environment.\nMGMNT 515 - Cost and Value Managment. A problem-based course that emphasizes project cost control and teaches students to apply techniques to control projects in business. Penn State World Campus Project Management 2015  – 2015 Activities and Societies:  MGMNT 510 - Project Managment. A problem-based ,  interdisciplinary course in project management skills and techniques needed to manage projects in a modern business environment.\nMGMNT 515 - Cost and Value Managment. A problem-based course that emphasizes project cost control and teaches students to apply techniques to control projects in business. Penn State World Campus Project Management 2015  – 2015 Activities and Societies:  MGMNT 510 - Project Managment. A problem-based ,  interdisciplinary course in project management skills and techniques needed to manage projects in a modern business environment.\nMGMNT 515 - Cost and Value Managment. A problem-based course that emphasizes project cost control and teaches students to apply techniques to control projects in business. Keller Graduate School of Management of DeVry University Master of Business Administration (MBA),  Management Information Systems (MIS) , 3.83 2013  – 2014 Keller Graduate School of Management of DeVry University Master of Business Administration (MBA),  Management Information Systems (MIS) , 3.83 2013  – 2014 Keller Graduate School of Management of DeVry University Master of Business Administration (MBA),  Management Information Systems (MIS) , 3.83 2013  – 2014 DeVry University Bachelor of Science (B.S.),  Technical Management , 3.76 2008  – 2013 (Open) 3 recommendations, including: Chester (Chet) Arnett Sales Engineer at Surescripts I have completed many group projects with Alexander and his organization, leadership skills and innovative thinking have... View David Robinson Editor-in-Chief at Positive Feedback Online Alexander is a student whom I've had in a couple of my classes at DeVry University. He is exceptionally intelligent,... View 1 more recommendation DeVry University Bachelor of Science (B.S.),  Technical Management , 3.76 2008  – 2013 (Open) 3 recommendations, including: Chester (Chet) Arnett Sales Engineer at Surescripts I have completed many group projects with Alexander and his organization, leadership skills and innovative thinking have... View David Robinson Editor-in-Chief at Positive Feedback Online Alexander is a student whom I've had in a couple of my classes at DeVry University. He is exceptionally intelligent,... View 1 more recommendation DeVry University Bachelor of Science (B.S.),  Technical Management , 3.76 2008  – 2013 (Open) 3 recommendations, including: Chester (Chet) Arnett Sales Engineer at Surescripts I have completed many group projects with Alexander and his organization, leadership skills and innovative thinking have... View David Robinson Editor-in-Chief at Positive Feedback Online Alexander is a student whom I've had in a couple of my classes at DeVry University. He is exceptionally intelligent,... View 1 more recommendation ", "Experience Senior Manufacturing technician Intel Corporation Senior Manufacturing technician Intel Corporation Senior Manufacturing technician Intel Corporation Skills Skills     ", "Summary Methodical team player that works tirelessly until results are achieved, or problem is resolved. Summary Methodical team player that works tirelessly until results are achieved, or problem is resolved. Methodical team player that works tirelessly until results are achieved, or problem is resolved. Methodical team player that works tirelessly until results are achieved, or problem is resolved. Experience Senior Manufacturing Technician Intel Corporation April 2010  – Present (5 years 5 months) Perform semiconductor equipment maintenance, both scheduled and unscheduled. Senior Field Service Engineer Novellus Systems acquired by Lam Research Corporation September 1994  –  June 2009  (14 years 10 months) Install and setup semiconductor equipment. Train customer technicians in the maintenance of that equipment. Instruct students in both a formal and informal setting on how to perform scheduled and unscheduled equipment maintenance. Johnson Engineering Los Alamos National Laboratory January 1990  –  August 1994  (4 years 8 months) Performed PC, server, and network maintenance. Senior Manufacturing Technician Intel Corporation April 2010  – Present (5 years 5 months) Perform semiconductor equipment maintenance, both scheduled and unscheduled. Senior Manufacturing Technician Intel Corporation April 2010  – Present (5 years 5 months) Perform semiconductor equipment maintenance, both scheduled and unscheduled. Senior Field Service Engineer Novellus Systems acquired by Lam Research Corporation September 1994  –  June 2009  (14 years 10 months) Install and setup semiconductor equipment. Train customer technicians in the maintenance of that equipment. Instruct students in both a formal and informal setting on how to perform scheduled and unscheduled equipment maintenance. Senior Field Service Engineer Novellus Systems acquired by Lam Research Corporation September 1994  –  June 2009  (14 years 10 months) Install and setup semiconductor equipment. Train customer technicians in the maintenance of that equipment. Instruct students in both a formal and informal setting on how to perform scheduled and unscheduled equipment maintenance. Johnson Engineering Los Alamos National Laboratory January 1990  –  August 1994  (4 years 8 months) Performed PC, server, and network maintenance. Johnson Engineering Los Alamos National Laboratory January 1990  –  August 1994  (4 years 8 months) Performed PC, server, and network maintenance. Languages Spanish Spanish Spanish Skills 0 Electromechanical... 0 Semiconductor equipment... Skills  0 Electromechanical... 0 Semiconductor equipment... 0 Electromechanical... 0 Semiconductor equipment... 0 Electromechanical... 0 Semiconductor equipment...     Education Albuquerque T-VI Certificate,  Instrumentation and Control Technology 1987  – 1989 Cibola HS Diploma,  General Studies 1980  – 1984 Albuquerque T-VI Certificate,  Instrumentation and Control Technology 1987  – 1989 Albuquerque T-VI Certificate,  Instrumentation and Control Technology 1987  – 1989 Albuquerque T-VI Certificate,  Instrumentation and Control Technology 1987  – 1989 Cibola HS Diploma,  General Studies 1980  – 1984 Cibola HS Diploma,  General Studies 1980  – 1984 Cibola HS Diploma,  General Studies 1980  – 1984 ", "Experience Senior Manufacturing Technician Intel Corporation October 1993  – Present (21 years 11 months) Submarine Sonarman US Navy September 1984  –  February 1993  (8 years 6 months) Senior Manufacturing Technician Intel Corporation October 1993  – Present (21 years 11 months) Senior Manufacturing Technician Intel Corporation October 1993  – Present (21 years 11 months) Submarine Sonarman US Navy September 1984  –  February 1993  (8 years 6 months) Submarine Sonarman US Navy September 1984  –  February 1993  (8 years 6 months) Skills 1 Lean Manufacturing Skills  1 Lean Manufacturing 1 Lean Manufacturing 1 Lean Manufacturing   Education Keller graduate school of management Master of Business Administration (M.B.A.),  Project Management 1999  – 2002 Devry University Bachelor of Science (B.S.),  Electronics engineering technology 1993  – 1997 DeVry University Technician diploma,  Electronics technician 1981  – 1983 Keller graduate school of management Master of Business Administration (M.B.A.),  Project Management 1999  – 2002 Keller graduate school of management Master of Business Administration (M.B.A.),  Project Management 1999  – 2002 Keller graduate school of management Master of Business Administration (M.B.A.),  Project Management 1999  – 2002 Devry University Bachelor of Science (B.S.),  Electronics engineering technology 1993  – 1997 Devry University Bachelor of Science (B.S.),  Electronics engineering technology 1993  – 1997 Devry University Bachelor of Science (B.S.),  Electronics engineering technology 1993  – 1997 DeVry University Technician diploma,  Electronics technician 1981  – 1983 DeVry University Technician diploma,  Electronics technician 1981  – 1983 DeVry University Technician diploma,  Electronics technician 1981  – 1983 ", "Summary A Senior Field Service Engineer with 19 years of experience with increasing responsibility in maintaining high availability equipment in a precision manufacturing environment. Internally and externally recognized as the “go to” person for technical problems, troubleshooting, training and managing high-visibility projects with little to no supervision. Summary A Senior Field Service Engineer with 19 years of experience with increasing responsibility in maintaining high availability equipment in a precision manufacturing environment. Internally and externally recognized as the “go to” person for technical problems, troubleshooting, training and managing high-visibility projects with little to no supervision. A Senior Field Service Engineer with 19 years of experience with increasing responsibility in maintaining high availability equipment in a precision manufacturing environment. Internally and externally recognized as the “go to” person for technical problems, troubleshooting, training and managing high-visibility projects with little to no supervision. A Senior Field Service Engineer with 19 years of experience with increasing responsibility in maintaining high availability equipment in a precision manufacturing environment. Internally and externally recognized as the “go to” person for technical problems, troubleshooting, training and managing high-visibility projects with little to no supervision. Experience Senior Field Service Engineer FEI Company June 2015  – Present (3 months) Greater Denver Area Responsible for performing the on site installation, servicing and repair of complex equipment and systems. Investigates and approves operational quality of system equipment. Instructs customers in the operation and maintenance of the system. Serves as company liaison with customer on administrative and technical matters for assigned projects. Conducts on-site installations of the full range of FEI systems and their associated options. \n \nResponsibilities and deliverables include: \n•Conduct on-site installation of complex equipment and follow testing procedures to ensure proper working order \n•Conduct on-site scheduled planned maintenance visits \n•Provide troubleshooting and repair support for customers and other field service personnel \n•Cultivate and develop positive working relationships with customers, system users and company personnel \n•Travel, often on short notice, to customer sites to resolve problems or support other field service personnel \n•Complete and submit field service reports \n•Provide training for customers and users on system maintenance \n•Provide feedback to product quality teams \n•Provide appropriate input in writing updating and correcting various FEI system documentation \n•Provide input for various reports including identifying and isolating unique problems with system \n•Act as a subject expert and resource for training \n \n Senior Manufacturing Technician Intel Corporation June 2011  –  May 2015  (4 years) Directly responsible for performing preventative and corrective maintenance on Novellus Gamma Ash systems. \n•\tHigh Precision Lean troubleshooting. \n•\tContinuous improvement projects. \n•\tConstruction protocol enforcement expert for Class 1 cleanroom environment. Equipment Engineering Technician II Abound Solar May 2009  –  June 2011  (2 years 2 months) Longmont, Colorado Directly responsible for the commissioning and installations of various one-of-a-kind machines to support end to end production of proprietary photovoltaic thin film solar panels in a 24/7 production environment. \n•\tWorked directly with equipment engineering on CVD, PVD, Module Assembly and Test areas to develop practical engineering solutions to achieve 24/7 production capabilities. \n•\tInstrumental in developing PM and BKM processes for custom built and designed semiconductor and solar manufacturing equipment. Customer Engineer III Applied Materials January 2007  –  May 2009  (2 years 5 months) Colorado Springs, Colorado Area Field Service Engineer that worked at numerous customer installations world-wide. Provided maintenance, repair and installation of heavy industrial manufacturing equipment. Wrote field service documentation, preventative maintenance documentation and specifications, managed and implemented various continuous improvement projects. \n•\tAssistant Project Manager (Electrical Lead) for multinational workforce of approximately 25-50 Technicians and FSE’s for the installation of PVD glass coating systems, and support equipment. The projects were all valued in excess of $15 million and were 3-4 months in duration. \n•\tDesignated first responder for AMAT North, and South American Web and Glass Coating customers. \n•\tDirectly involved in determining and negotiating new and existing equipment specifications and technical requirements for systems which meet the customer process requirements at the time of tool installation and for future technologies. \n•\tResponsible for providing Final Acceptance Testing results to customer to ensure all remaining Contract items were closed-out for final payment of equipment. \n•\tResponsible for training and evaluating Technicians and Customers. \n•\tExperienced International traveler. Designated first responder for AMAT North and South American Web and Glass Coating customers, to provide direct warranty and continued process and hardware support. \n•\tDeveloped procedure that was adopted as “Best Known Method” by the customer to address critical maintenance issues that has directly lead to increased productivity and reduced maintenance costs by a minimum of 40%. \n•\tRecognized HDPCVD (High Density Plasma, Chemical Vapor Deposition) Ultima, Ultima Plus, Ultima TE 200mm-300mm system expert, consistently met all customer \nmilestones and expectations. Senior Field Service Engineer FEI Company June 2015  – Present (3 months) Greater Denver Area Responsible for performing the on site installation, servicing and repair of complex equipment and systems. Investigates and approves operational quality of system equipment. Instructs customers in the operation and maintenance of the system. Serves as company liaison with customer on administrative and technical matters for assigned projects. Conducts on-site installations of the full range of FEI systems and their associated options. \n \nResponsibilities and deliverables include: \n•Conduct on-site installation of complex equipment and follow testing procedures to ensure proper working order \n•Conduct on-site scheduled planned maintenance visits \n•Provide troubleshooting and repair support for customers and other field service personnel \n•Cultivate and develop positive working relationships with customers, system users and company personnel \n•Travel, often on short notice, to customer sites to resolve problems or support other field service personnel \n•Complete and submit field service reports \n•Provide training for customers and users on system maintenance \n•Provide feedback to product quality teams \n•Provide appropriate input in writing updating and correcting various FEI system documentation \n•Provide input for various reports including identifying and isolating unique problems with system \n•Act as a subject expert and resource for training \n \n Senior Field Service Engineer FEI Company June 2015  – Present (3 months) Greater Denver Area Responsible for performing the on site installation, servicing and repair of complex equipment and systems. Investigates and approves operational quality of system equipment. Instructs customers in the operation and maintenance of the system. Serves as company liaison with customer on administrative and technical matters for assigned projects. Conducts on-site installations of the full range of FEI systems and their associated options. \n \nResponsibilities and deliverables include: \n•Conduct on-site installation of complex equipment and follow testing procedures to ensure proper working order \n•Conduct on-site scheduled planned maintenance visits \n•Provide troubleshooting and repair support for customers and other field service personnel \n•Cultivate and develop positive working relationships with customers, system users and company personnel \n•Travel, often on short notice, to customer sites to resolve problems or support other field service personnel \n•Complete and submit field service reports \n•Provide training for customers and users on system maintenance \n•Provide feedback to product quality teams \n•Provide appropriate input in writing updating and correcting various FEI system documentation \n•Provide input for various reports including identifying and isolating unique problems with system \n•Act as a subject expert and resource for training \n \n Senior Manufacturing Technician Intel Corporation June 2011  –  May 2015  (4 years) Directly responsible for performing preventative and corrective maintenance on Novellus Gamma Ash systems. \n•\tHigh Precision Lean troubleshooting. \n•\tContinuous improvement projects. \n•\tConstruction protocol enforcement expert for Class 1 cleanroom environment. Senior Manufacturing Technician Intel Corporation June 2011  –  May 2015  (4 years) Directly responsible for performing preventative and corrective maintenance on Novellus Gamma Ash systems. \n•\tHigh Precision Lean troubleshooting. \n•\tContinuous improvement projects. \n•\tConstruction protocol enforcement expert for Class 1 cleanroom environment. Equipment Engineering Technician II Abound Solar May 2009  –  June 2011  (2 years 2 months) Longmont, Colorado Directly responsible for the commissioning and installations of various one-of-a-kind machines to support end to end production of proprietary photovoltaic thin film solar panels in a 24/7 production environment. \n•\tWorked directly with equipment engineering on CVD, PVD, Module Assembly and Test areas to develop practical engineering solutions to achieve 24/7 production capabilities. \n•\tInstrumental in developing PM and BKM processes for custom built and designed semiconductor and solar manufacturing equipment. Equipment Engineering Technician II Abound Solar May 2009  –  June 2011  (2 years 2 months) Longmont, Colorado Directly responsible for the commissioning and installations of various one-of-a-kind machines to support end to end production of proprietary photovoltaic thin film solar panels in a 24/7 production environment. \n•\tWorked directly with equipment engineering on CVD, PVD, Module Assembly and Test areas to develop practical engineering solutions to achieve 24/7 production capabilities. \n•\tInstrumental in developing PM and BKM processes for custom built and designed semiconductor and solar manufacturing equipment. Customer Engineer III Applied Materials January 2007  –  May 2009  (2 years 5 months) Colorado Springs, Colorado Area Field Service Engineer that worked at numerous customer installations world-wide. Provided maintenance, repair and installation of heavy industrial manufacturing equipment. Wrote field service documentation, preventative maintenance documentation and specifications, managed and implemented various continuous improvement projects. \n•\tAssistant Project Manager (Electrical Lead) for multinational workforce of approximately 25-50 Technicians and FSE’s for the installation of PVD glass coating systems, and support equipment. The projects were all valued in excess of $15 million and were 3-4 months in duration. \n•\tDesignated first responder for AMAT North, and South American Web and Glass Coating customers. \n•\tDirectly involved in determining and negotiating new and existing equipment specifications and technical requirements for systems which meet the customer process requirements at the time of tool installation and for future technologies. \n•\tResponsible for providing Final Acceptance Testing results to customer to ensure all remaining Contract items were closed-out for final payment of equipment. \n•\tResponsible for training and evaluating Technicians and Customers. \n•\tExperienced International traveler. Designated first responder for AMAT North and South American Web and Glass Coating customers, to provide direct warranty and continued process and hardware support. \n•\tDeveloped procedure that was adopted as “Best Known Method” by the customer to address critical maintenance issues that has directly lead to increased productivity and reduced maintenance costs by a minimum of 40%. \n•\tRecognized HDPCVD (High Density Plasma, Chemical Vapor Deposition) Ultima, Ultima Plus, Ultima TE 200mm-300mm system expert, consistently met all customer \nmilestones and expectations. Customer Engineer III Applied Materials January 2007  –  May 2009  (2 years 5 months) Colorado Springs, Colorado Area Field Service Engineer that worked at numerous customer installations world-wide. Provided maintenance, repair and installation of heavy industrial manufacturing equipment. Wrote field service documentation, preventative maintenance documentation and specifications, managed and implemented various continuous improvement projects. \n•\tAssistant Project Manager (Electrical Lead) for multinational workforce of approximately 25-50 Technicians and FSE’s for the installation of PVD glass coating systems, and support equipment. The projects were all valued in excess of $15 million and were 3-4 months in duration. \n•\tDesignated first responder for AMAT North, and South American Web and Glass Coating customers. \n•\tDirectly involved in determining and negotiating new and existing equipment specifications and technical requirements for systems which meet the customer process requirements at the time of tool installation and for future technologies. \n•\tResponsible for providing Final Acceptance Testing results to customer to ensure all remaining Contract items were closed-out for final payment of equipment. \n•\tResponsible for training and evaluating Technicians and Customers. \n•\tExperienced International traveler. Designated first responder for AMAT North and South American Web and Glass Coating customers, to provide direct warranty and continued process and hardware support. \n•\tDeveloped procedure that was adopted as “Best Known Method” by the customer to address critical maintenance issues that has directly lead to increased productivity and reduced maintenance costs by a minimum of 40%. \n•\tRecognized HDPCVD (High Density Plasma, Chemical Vapor Deposition) Ultima, Ultima Plus, Ultima TE 200mm-300mm system expert, consistently met all customer \nmilestones and expectations. Skills Top Skills 5 PVD 4 Semiconductors 3 CVD 3 Electronics 2 Semiconductor Industry 2 Failure Analysis 2 Design of Experiments 2 Lean Manufacturing 1 Metrology 1 Silicon steve also knows about... 1 Thin Films 1 SPC 0 Process Integration 0 RF systems 0 Robotic systems 0 Ultra Low Pressure... 0 Component level systems 0 Software systems... 0 Hardware systems... 0 High Voltage systems 0 Microwave systems 0 Automation systems... 0 Toxic Chemical systems 0 PLC systems 0 HDPCVD 0 Field Service... 0 Cryogenics 0 Siemens S7-200 0 RSLogix See 4+     See less Skills  Top Skills 5 PVD 4 Semiconductors 3 CVD 3 Electronics 2 Semiconductor Industry 2 Failure Analysis 2 Design of Experiments 2 Lean Manufacturing 1 Metrology 1 Silicon steve also knows about... 1 Thin Films 1 SPC 0 Process Integration 0 RF systems 0 Robotic systems 0 Ultra Low Pressure... 0 Component level systems 0 Software systems... 0 Hardware systems... 0 High Voltage systems 0 Microwave systems 0 Automation systems... 0 Toxic Chemical systems 0 PLC systems 0 HDPCVD 0 Field Service... 0 Cryogenics 0 Siemens S7-200 0 RSLogix See 4+     See less Top Skills 5 PVD 4 Semiconductors 3 CVD 3 Electronics 2 Semiconductor Industry 2 Failure Analysis 2 Design of Experiments 2 Lean Manufacturing 1 Metrology 1 Silicon steve also knows about... 1 Thin Films 1 SPC 0 Process Integration 0 RF systems 0 Robotic systems 0 Ultra Low Pressure... 0 Component level systems 0 Software systems... 0 Hardware systems... 0 High Voltage systems 0 Microwave systems 0 Automation systems... 0 Toxic Chemical systems 0 PLC systems 0 HDPCVD 0 Field Service... 0 Cryogenics 0 Siemens S7-200 0 RSLogix See 4+     See less Top Skills 5 PVD 4 Semiconductors 3 CVD 3 Electronics 2 Semiconductor Industry 2 Failure Analysis 2 Design of Experiments 2 Lean Manufacturing 1 Metrology 1 Silicon steve also knows about... 1 Thin Films 1 SPC 0 Process Integration 0 RF systems 0 Robotic systems 0 Ultra Low Pressure... 0 Component level systems 0 Software systems... 0 Hardware systems... 0 High Voltage systems 0 Microwave systems 0 Automation systems... 0 Toxic Chemical systems 0 PLC systems 0 HDPCVD 0 Field Service... 0 Cryogenics 0 Siemens S7-200 0 RSLogix See 4+     See less                     1 Thin Films 1 SPC 0 Process Integration 0 RF systems 0 Robotic systems 0 Ultra Low Pressure... 0 Component level systems 0 Software systems... 0 Hardware systems... 0 High Voltage systems 0 Microwave systems 0 Automation systems... 0 Toxic Chemical systems 0 PLC systems 0 HDPCVD 0 Field Service... 0 Cryogenics 0 Siemens S7-200 0 RSLogix Education Ferris State University Mortuary Science and Embalming/Embalmer 1983  – 1984 Ferris State University Mortuary Science and Embalming/Embalmer 1983  – 1984 Ferris State University Mortuary Science and Embalming/Embalmer 1983  – 1984 Ferris State University Mortuary Science and Embalming/Embalmer 1983  – 1984 "]}