{"position": "Senior Software Engineering Manager", "company": "IBM", "profiles": ["Experience Lecturer - CS Department San Jose State University August 2001  – Present (14 years 1 month) San Jose Senior Software Engineering Manager IBM May 2000  – Present (15 years 4 months) San Jose Lecturer - CS Department San Jose State University August 2001  – Present (14 years 1 month) San Jose Lecturer - CS Department San Jose State University August 2001  – Present (14 years 1 month) San Jose Senior Software Engineering Manager IBM May 2000  – Present (15 years 4 months) San Jose Senior Software Engineering Manager IBM May 2000  – Present (15 years 4 months) San Jose Skills Relational Databases Software Engineering Java DB2 SQL Skills  Relational Databases Software Engineering Java DB2 SQL Relational Databases Software Engineering Java DB2 SQL Relational Databases Software Engineering Java DB2 SQL ", "Experience Senior Software Engineering Manager IBM Senior Software Engineering Manager IBM Senior Software Engineering Manager IBM Skills WebSphere Application... Skills  WebSphere Application... WebSphere Application... WebSphere Application... ", "Summary Executive Summary \n \n•\tEngineering leader with successful history of delivering large scale virtualization, cloud, and systems management software products through Product Engineering, Product Management, Architecture, Development and QA. \n•\tStaffed and successfully managed engineering teams within IBM’s US sites, and across global development labs in China, India, and Israel. \n•\tExtensive customer engagement in promoting market awareness and support of IBM products. Summary Executive Summary \n \n•\tEngineering leader with successful history of delivering large scale virtualization, cloud, and systems management software products through Product Engineering, Product Management, Architecture, Development and QA. \n•\tStaffed and successfully managed engineering teams within IBM’s US sites, and across global development labs in China, India, and Israel. \n•\tExtensive customer engagement in promoting market awareness and support of IBM products. Executive Summary \n \n•\tEngineering leader with successful history of delivering large scale virtualization, cloud, and systems management software products through Product Engineering, Product Management, Architecture, Development and QA. \n•\tStaffed and successfully managed engineering teams within IBM’s US sites, and across global development labs in China, India, and Israel. \n•\tExtensive customer engagement in promoting market awareness and support of IBM products. Executive Summary \n \n•\tEngineering leader with successful history of delivering large scale virtualization, cloud, and systems management software products through Product Engineering, Product Management, Architecture, Development and QA. \n•\tStaffed and successfully managed engineering teams within IBM’s US sites, and across global development labs in China, India, and Israel. \n•\tExtensive customer engagement in promoting market awareness and support of IBM products. Skills Skills     Honors & Awards ", "Summary Execution-focused Technical Manger with proven abilities to dovetail individual team member interests with overall global team outcomes, building organizational capability in the US and China. Consistent project management track record, taking personal initiative to produce high-quality software product releases. Critical decision-making linked with excellent problem-solving, collaborative and interpersonal skills. Summary Execution-focused Technical Manger with proven abilities to dovetail individual team member interests with overall global team outcomes, building organizational capability in the US and China. Consistent project management track record, taking personal initiative to produce high-quality software product releases. Critical decision-making linked with excellent problem-solving, collaborative and interpersonal skills. Execution-focused Technical Manger with proven abilities to dovetail individual team member interests with overall global team outcomes, building organizational capability in the US and China. Consistent project management track record, taking personal initiative to produce high-quality software product releases. Critical decision-making linked with excellent problem-solving, collaborative and interpersonal skills. Execution-focused Technical Manger with proven abilities to dovetail individual team member interests with overall global team outcomes, building organizational capability in the US and China. Consistent project management track record, taking personal initiative to produce high-quality software product releases. Critical decision-making linked with excellent problem-solving, collaborative and interpersonal skills. Experience Senior Software Engineering Manager Lenovo 2014  –  2015  (1 year) Rochester, Minnesota Area Led several teams to develop a new System Management software product for the enterprise x86 customer. \n \n•Rebuilt several teams and restructured work assignments and schedules, ensuring all committed functional content was delivered on schedule.  \n•Built relationships with teams in China and managed many difficult technical dependencies external to the team, consistently ensuring projects were completed on schedule. \n•Initiated actions which improved the end-to-end product performance by 40%, and reduced software errors by 30%. Senior Software Engineering Manager IBM 2013  –  2014  (1 year) Rochester, Minnesota Area Selected to lead a new software product offering for the management of a hierarchy of computer servers. Led a new product development team with no established roles, product architecture, or schedule. \n \n•Built the team from a collection of personnel displaced from other projects. Partnered with a China development team to establish roles and responsibilities that balanced ownership and accountability across the 50-person team. These actions organized the team into an effective software development shop. \n•Established a continuous integration and test model using Agile methods which served as set of 'Best Practices' for future efforts, and allowing new features to be quickly added to the project based on user feedback. \n•Delivered a working prototype ahead of schedule, which marketing was able to demonstrate to prospective customers. Senior Software Engineering Manager IBM 2008  –  2013  (5 years) Rochester, Minnesota Area Selected to direct the program office for a software application to manage computer resources in the cloud. This software became more valuable and the program more critical to IBM as it became a 'middle-ware' component to other solutions, placing added responsibilities and requirements on the team.  \n \n•Focused the team to deliver strategic customer requirements. This was a critical strategic imperative for IBM to ensure it's hardware offerings were able to easily sell into the immerging Cloud marketplace \n•Led the team to establish new milestones for product availability, reliability and performance. Improved these metrics by 20-100%. \n•Prioritized conflicting requirements from multiple sources, often partnering with these teams to obtain additional resources. Managed budgets and prioritized objectives, ensuring team focus on key customer features. Senior Software Engineering Manager Lenovo 2014  –  2015  (1 year) Rochester, Minnesota Area Led several teams to develop a new System Management software product for the enterprise x86 customer. \n \n•Rebuilt several teams and restructured work assignments and schedules, ensuring all committed functional content was delivered on schedule.  \n•Built relationships with teams in China and managed many difficult technical dependencies external to the team, consistently ensuring projects were completed on schedule. \n•Initiated actions which improved the end-to-end product performance by 40%, and reduced software errors by 30%. Senior Software Engineering Manager Lenovo 2014  –  2015  (1 year) Rochester, Minnesota Area Led several teams to develop a new System Management software product for the enterprise x86 customer. \n \n•Rebuilt several teams and restructured work assignments and schedules, ensuring all committed functional content was delivered on schedule.  \n•Built relationships with teams in China and managed many difficult technical dependencies external to the team, consistently ensuring projects were completed on schedule. \n•Initiated actions which improved the end-to-end product performance by 40%, and reduced software errors by 30%. Senior Software Engineering Manager IBM 2013  –  2014  (1 year) Rochester, Minnesota Area Selected to lead a new software product offering for the management of a hierarchy of computer servers. Led a new product development team with no established roles, product architecture, or schedule. \n \n•Built the team from a collection of personnel displaced from other projects. Partnered with a China development team to establish roles and responsibilities that balanced ownership and accountability across the 50-person team. These actions organized the team into an effective software development shop. \n•Established a continuous integration and test model using Agile methods which served as set of 'Best Practices' for future efforts, and allowing new features to be quickly added to the project based on user feedback. \n•Delivered a working prototype ahead of schedule, which marketing was able to demonstrate to prospective customers. Senior Software Engineering Manager IBM 2013  –  2014  (1 year) Rochester, Minnesota Area Selected to lead a new software product offering for the management of a hierarchy of computer servers. Led a new product development team with no established roles, product architecture, or schedule. \n \n•Built the team from a collection of personnel displaced from other projects. Partnered with a China development team to establish roles and responsibilities that balanced ownership and accountability across the 50-person team. These actions organized the team into an effective software development shop. \n•Established a continuous integration and test model using Agile methods which served as set of 'Best Practices' for future efforts, and allowing new features to be quickly added to the project based on user feedback. \n•Delivered a working prototype ahead of schedule, which marketing was able to demonstrate to prospective customers. Senior Software Engineering Manager IBM 2008  –  2013  (5 years) Rochester, Minnesota Area Selected to direct the program office for a software application to manage computer resources in the cloud. This software became more valuable and the program more critical to IBM as it became a 'middle-ware' component to other solutions, placing added responsibilities and requirements on the team.  \n \n•Focused the team to deliver strategic customer requirements. This was a critical strategic imperative for IBM to ensure it's hardware offerings were able to easily sell into the immerging Cloud marketplace \n•Led the team to establish new milestones for product availability, reliability and performance. Improved these metrics by 20-100%. \n•Prioritized conflicting requirements from multiple sources, often partnering with these teams to obtain additional resources. Managed budgets and prioritized objectives, ensuring team focus on key customer features. Senior Software Engineering Manager IBM 2008  –  2013  (5 years) Rochester, Minnesota Area Selected to direct the program office for a software application to manage computer resources in the cloud. This software became more valuable and the program more critical to IBM as it became a 'middle-ware' component to other solutions, placing added responsibilities and requirements on the team.  \n \n•Focused the team to deliver strategic customer requirements. This was a critical strategic imperative for IBM to ensure it's hardware offerings were able to easily sell into the immerging Cloud marketplace \n•Led the team to establish new milestones for product availability, reliability and performance. Improved these metrics by 20-100%. \n•Prioritized conflicting requirements from multiple sources, often partnering with these teams to obtain additional resources. Managed budgets and prioritized objectives, ensuring team focus on key customer features. Skills Team Building Software Project... Collaborative Leadership Project Management Global Cross-Functional... Communication Software Quality... Embedded Software Problem Solving Risk Management Decision Making Software Development Business Analysis Management Consulting Mentoring Agile Methodologies Cloud Computing Software Engineering See 3+     See less Skills  Team Building Software Project... Collaborative Leadership Project Management Global Cross-Functional... Communication Software Quality... Embedded Software Problem Solving Risk Management Decision Making Software Development Business Analysis Management Consulting Mentoring Agile Methodologies Cloud Computing Software Engineering See 3+     See less Team Building Software Project... Collaborative Leadership Project Management Global Cross-Functional... Communication Software Quality... Embedded Software Problem Solving Risk Management Decision Making Software Development Business Analysis Management Consulting Mentoring Agile Methodologies Cloud Computing Software Engineering See 3+     See less Team Building Software Project... Collaborative Leadership Project Management Global Cross-Functional... Communication Software Quality... Embedded Software Problem Solving Risk Management Decision Making Software Development Business Analysis Management Consulting Mentoring Agile Methodologies Cloud Computing Software Engineering See 3+     See less Education University of Wisconsin-Madison BSEE,  Computer Engineering 1979  – 1981 Activities and Societies:  Dean's list each semester ,  Phi Kappa Phi Marquette University Electrical and Electronics Engineering 1977  – 1979 University of Wisconsin-Madison BSEE,  Computer Engineering 1979  – 1981 Activities and Societies:  Dean's list each semester ,  Phi Kappa Phi University of Wisconsin-Madison BSEE,  Computer Engineering 1979  – 1981 Activities and Societies:  Dean's list each semester ,  Phi Kappa Phi University of Wisconsin-Madison BSEE,  Computer Engineering 1979  – 1981 Activities and Societies:  Dean's list each semester ,  Phi Kappa Phi Marquette University Electrical and Electronics Engineering 1977  – 1979 Marquette University Electrical and Electronics Engineering 1977  – 1979 Marquette University Electrical and Electronics Engineering 1977  – 1979 ", "Skills Java Software Development Agile Methodologies Cloud Computing Linux C Software Engineering Websphere DB2 SOA WebSphere Application... Eclipse Java Enterprise Edition AIX Unix Perl XML SQL Software Project... Distributed Systems Management See 6+     See less Skills  Java Software Development Agile Methodologies Cloud Computing Linux C Software Engineering Websphere DB2 SOA WebSphere Application... Eclipse Java Enterprise Edition AIX Unix Perl XML SQL Software Project... Distributed Systems Management See 6+     See less Java Software Development Agile Methodologies Cloud Computing Linux C Software Engineering Websphere DB2 SOA WebSphere Application... Eclipse Java Enterprise Edition AIX Unix Perl XML SQL Software Project... Distributed Systems Management See 6+     See less Java Software Development Agile Methodologies Cloud Computing Linux C Software Engineering Websphere DB2 SOA WebSphere Application... Eclipse Java Enterprise Edition AIX Unix Perl XML SQL Software Project... Distributed Systems Management See 6+     See less ", "Skills Cloud Computing Software Development Management Telecommunications Network Administration Enterprise Architecture Networking TCP/IP IT Service Management Integration IT Strategy Virtualization Pre-sales Software Engineering Sales Product Management Systems Management Enterprise Software Team Leadership ITIL Perl Security Business Analysis Unix Solaris Data Center Technical Support See 12+     See less Skills  Cloud Computing Software Development Management Telecommunications Network Administration Enterprise Architecture Networking TCP/IP IT Service Management Integration IT Strategy Virtualization Pre-sales Software Engineering Sales Product Management Systems Management Enterprise Software Team Leadership ITIL Perl Security Business Analysis Unix Solaris Data Center Technical Support See 12+     See less Cloud Computing Software Development Management Telecommunications Network Administration Enterprise Architecture Networking TCP/IP IT Service Management Integration IT Strategy Virtualization Pre-sales Software Engineering Sales Product Management Systems Management Enterprise Software Team Leadership ITIL Perl Security Business Analysis Unix Solaris Data Center Technical Support See 12+     See less Cloud Computing Software Development Management Telecommunications Network Administration Enterprise Architecture Networking TCP/IP IT Service Management Integration IT Strategy Virtualization Pre-sales Software Engineering Sales Product Management Systems Management Enterprise Software Team Leadership ITIL Perl Security Business Analysis Unix Solaris Data Center Technical Support See 12+     See less ", "Summary Project Manager with an Master of Science in project management, and experience in software development and project management of complex projects. Summary Project Manager with an Master of Science in project management, and experience in software development and project management of complex projects. Project Manager with an Master of Science in project management, and experience in software development and project management of complex projects. Project Manager with an Master of Science in project management, and experience in software development and project management of complex projects. Experience Senior Software Engineering Manager IBM December 2014  – Present (9 months) Austin, Texas Area Manager of software development engineers responsible for design, analysis, and test of complex components related to Globalization, Install Management, and Power Security on AIX. Determine resource needs and requirements for the team. Ensure that assigned activities meet committed objective, quality targets, schedules and cost. Brand lead for AIX responsible for team handling of security vulnerabilities. Drive security projects related to regulatory compliance and policies for AIX. Project Manager - I/O Communications Development IBM October 2004  – Present (10 years 11 months) Austin, Texas Area Project managed complex Ethernet adapter projects at IBM. Coordinated project execution activities across groups such as development, test, manufacturing, and procurement. Managed relationships with I/O technology vendors for Ethernet product releases. Create, execute and maintain project plans that communicate tasks, milestone dates, and status to management and executives. Software Engineer - AIX Device Driver Development IBM June 1998  –  September 2003  (5 years 4 months) Austin, Texas Area Provided high-level software development and customer service support for LAN technologies running on the AIX operating system. Responsible for the development and testing of Ethernet device drivers using the C programming language. User Support Analyst Lockheed Martin IMS September 1995  –  June 1998  (2 years 10 months) Tarrytown, New York Hired for technical expertise to provide toll-free database support to nationwide long distance toll-free carriers. Assisted end users with database malfunctions and toll-free traffic management, arranged client records, monitored switching control points and transferred toll-free numbers from one telephone carrier to another. Senior Software Engineering Manager IBM December 2014  – Present (9 months) Austin, Texas Area Manager of software development engineers responsible for design, analysis, and test of complex components related to Globalization, Install Management, and Power Security on AIX. Determine resource needs and requirements for the team. Ensure that assigned activities meet committed objective, quality targets, schedules and cost. Brand lead for AIX responsible for team handling of security vulnerabilities. Drive security projects related to regulatory compliance and policies for AIX. Senior Software Engineering Manager IBM December 2014  – Present (9 months) Austin, Texas Area Manager of software development engineers responsible for design, analysis, and test of complex components related to Globalization, Install Management, and Power Security on AIX. Determine resource needs and requirements for the team. Ensure that assigned activities meet committed objective, quality targets, schedules and cost. Brand lead for AIX responsible for team handling of security vulnerabilities. Drive security projects related to regulatory compliance and policies for AIX. Project Manager - I/O Communications Development IBM October 2004  – Present (10 years 11 months) Austin, Texas Area Project managed complex Ethernet adapter projects at IBM. Coordinated project execution activities across groups such as development, test, manufacturing, and procurement. Managed relationships with I/O technology vendors for Ethernet product releases. Create, execute and maintain project plans that communicate tasks, milestone dates, and status to management and executives. Project Manager - I/O Communications Development IBM October 2004  – Present (10 years 11 months) Austin, Texas Area Project managed complex Ethernet adapter projects at IBM. Coordinated project execution activities across groups such as development, test, manufacturing, and procurement. Managed relationships with I/O technology vendors for Ethernet product releases. Create, execute and maintain project plans that communicate tasks, milestone dates, and status to management and executives. Software Engineer - AIX Device Driver Development IBM June 1998  –  September 2003  (5 years 4 months) Austin, Texas Area Provided high-level software development and customer service support for LAN technologies running on the AIX operating system. Responsible for the development and testing of Ethernet device drivers using the C programming language. Software Engineer - AIX Device Driver Development IBM June 1998  –  September 2003  (5 years 4 months) Austin, Texas Area Provided high-level software development and customer service support for LAN technologies running on the AIX operating system. Responsible for the development and testing of Ethernet device drivers using the C programming language. User Support Analyst Lockheed Martin IMS September 1995  –  June 1998  (2 years 10 months) Tarrytown, New York Hired for technical expertise to provide toll-free database support to nationwide long distance toll-free carriers. Assisted end users with database malfunctions and toll-free traffic management, arranged client records, monitored switching control points and transferred toll-free numbers from one telephone carrier to another. User Support Analyst Lockheed Martin IMS September 1995  –  June 1998  (2 years 10 months) Tarrytown, New York Hired for technical expertise to provide toll-free database support to nationwide long distance toll-free carriers. Assisted end users with database malfunctions and toll-free traffic management, arranged client records, monitored switching control points and transferred toll-free numbers from one telephone carrier to another. Skills PMP Program Management Software Project... Vendor Management Collaborative Problem... Leadership Team Management Ethernet Project Portfolio... Requirements Analysis Software Development Project Management Testing Operating Systems Cloud Computing SDLC Databases Cross-functional Team... Agile Methodologies IT Strategy Integration Management Business Process... Software Documentation See 9+     See less Skills  PMP Program Management Software Project... Vendor Management Collaborative Problem... Leadership Team Management Ethernet Project Portfolio... Requirements Analysis Software Development Project Management Testing Operating Systems Cloud Computing SDLC Databases Cross-functional Team... Agile Methodologies IT Strategy Integration Management Business Process... Software Documentation See 9+     See less PMP Program Management Software Project... Vendor Management Collaborative Problem... Leadership Team Management Ethernet Project Portfolio... Requirements Analysis Software Development Project Management Testing Operating Systems Cloud Computing SDLC Databases Cross-functional Team... Agile Methodologies IT Strategy Integration Management Business Process... Software Documentation See 9+     See less PMP Program Management Software Project... Vendor Management Collaborative Problem... Leadership Team Management Ethernet Project Portfolio... Requirements Analysis Software Development Project Management Testing Operating Systems Cloud Computing SDLC Databases Cross-functional Team... Agile Methodologies IT Strategy Integration Management Business Process... Software Documentation See 9+     See less Education St. Edward's University MS,  Project Management 2006  – 2008 The University of Texas at Austin Certificate,  Business Foundations 1999  – 2000 Pace University Certificate,  UNIX Operating Systems/C/C++ Programming 1999  – 1999 Hofstra University B.S.,  Computer Science 1991  – 1995 Activities and Societies:  National Society of Black Engineers St. Edward's University MS,  Project Management 2006  – 2008 St. Edward's University MS,  Project Management 2006  – 2008 St. Edward's University MS,  Project Management 2006  – 2008 The University of Texas at Austin Certificate,  Business Foundations 1999  – 2000 The University of Texas at Austin Certificate,  Business Foundations 1999  – 2000 The University of Texas at Austin Certificate,  Business Foundations 1999  – 2000 Pace University Certificate,  UNIX Operating Systems/C/C++ Programming 1999  – 1999 Pace University Certificate,  UNIX Operating Systems/C/C++ Programming 1999  – 1999 Pace University Certificate,  UNIX Operating Systems/C/C++ Programming 1999  – 1999 Hofstra University B.S.,  Computer Science 1991  – 1995 Activities and Societies:  National Society of Black Engineers Hofstra University B.S.,  Computer Science 1991  – 1995 Activities and Societies:  National Society of Black Engineers Hofstra University B.S.,  Computer Science 1991  – 1995 Activities and Societies:  National Society of Black Engineers ", "Skills Software Development SSO Security Software Engineering Identity Management Software Project... Agile Methodologies Enterprise Software Cloud Computing Product Management Skills  Software Development SSO Security Software Engineering Identity Management Software Project... Agile Methodologies Enterprise Software Cloud Computing Product Management Software Development SSO Security Software Engineering Identity Management Software Project... Agile Methodologies Enterprise Software Cloud Computing Product Management Software Development SSO Security Software Engineering Identity Management Software Project... Agile Methodologies Enterprise Software Cloud Computing Product Management ", "Summary Experience as a Software Developer, Quality Engineer, Customer Support Rep, Quality Engineering Manager, Software Engineering Manager, and Technical Resource Program Manager. Summary Experience as a Software Developer, Quality Engineer, Customer Support Rep, Quality Engineering Manager, Software Engineering Manager, and Technical Resource Program Manager. Experience as a Software Developer, Quality Engineer, Customer Support Rep, Quality Engineering Manager, Software Engineering Manager, and Technical Resource Program Manager. Experience as a Software Developer, Quality Engineer, Customer Support Rep, Quality Engineering Manager, Software Engineering Manager, and Technical Resource Program Manager. Experience Senior Software Engineering Manager IBM December 1987  – Present (27 years 9 months) I'm currently the software engineering manager of the IBM mail support for Microsoft Outlook development team, commonly known as the Hawthorn team. Also have management responsibility for Level 3 Domino team. Formerly manager for IBM Lotus Notes Adoption team focusing on Serviceability, Client Management, Managed Mail Replica, Roaming User and Client Security. Previously also owned areas including Install, Social Mail Install, Mail, Contacts, Infrastructure, Sync, integrated instant messaging, Mobile Workplace, Performance, and Common Inbox Framework. Managed Mobile Workplace, IBM Workplace, and Lotus SmartSuite teams. Also worked as an individual contributor as a developer, quality engineer, and support engineer. Software Engineer Electronic Data Systems January 1986  –  December 1987  (2 years) Software developer on the General Motors account writing and maintaining applications to track car sales and data. Senior Software Engineering Manager IBM December 1987  – Present (27 years 9 months) I'm currently the software engineering manager of the IBM mail support for Microsoft Outlook development team, commonly known as the Hawthorn team. Also have management responsibility for Level 3 Domino team. Formerly manager for IBM Lotus Notes Adoption team focusing on Serviceability, Client Management, Managed Mail Replica, Roaming User and Client Security. Previously also owned areas including Install, Social Mail Install, Mail, Contacts, Infrastructure, Sync, integrated instant messaging, Mobile Workplace, Performance, and Common Inbox Framework. Managed Mobile Workplace, IBM Workplace, and Lotus SmartSuite teams. Also worked as an individual contributor as a developer, quality engineer, and support engineer. Senior Software Engineering Manager IBM December 1987  – Present (27 years 9 months) I'm currently the software engineering manager of the IBM mail support for Microsoft Outlook development team, commonly known as the Hawthorn team. Also have management responsibility for Level 3 Domino team. Formerly manager for IBM Lotus Notes Adoption team focusing on Serviceability, Client Management, Managed Mail Replica, Roaming User and Client Security. Previously also owned areas including Install, Social Mail Install, Mail, Contacts, Infrastructure, Sync, integrated instant messaging, Mobile Workplace, Performance, and Common Inbox Framework. Managed Mobile Workplace, IBM Workplace, and Lotus SmartSuite teams. Also worked as an individual contributor as a developer, quality engineer, and support engineer. Software Engineer Electronic Data Systems January 1986  –  December 1987  (2 years) Software developer on the General Motors account writing and maintaining applications to track car sales and data. Software Engineer Electronic Data Systems January 1986  –  December 1987  (2 years) Software developer on the General Motors account writing and maintaining applications to track car sales and data. Skills Mobile Devices Agile Methodologies Technical Leadership WebSphere Application... Software Engineering Cloud Computing Software Development Rational Team Concert Websphere CRM Java Enterprise Architecture SDLC Solution Architecture Java Enterprise Edition Unix Security Software Project... SOA Distributed Systems Eclipse DB2 Scrum Architectures See 9+     See less Skills  Mobile Devices Agile Methodologies Technical Leadership WebSphere Application... Software Engineering Cloud Computing Software Development Rational Team Concert Websphere CRM Java Enterprise Architecture SDLC Solution Architecture Java Enterprise Edition Unix Security Software Project... SOA Distributed Systems Eclipse DB2 Scrum Architectures See 9+     See less Mobile Devices Agile Methodologies Technical Leadership WebSphere Application... Software Engineering Cloud Computing Software Development Rational Team Concert Websphere CRM Java Enterprise Architecture SDLC Solution Architecture Java Enterprise Edition Unix Security Software Project... SOA Distributed Systems Eclipse DB2 Scrum Architectures See 9+     See less Mobile Devices Agile Methodologies Technical Leadership WebSphere Application... Software Engineering Cloud Computing Software Development Rational Team Concert Websphere CRM Java Enterprise Architecture SDLC Solution Architecture Java Enterprise Edition Unix Security Software Project... SOA Distributed Systems Eclipse DB2 Scrum Architectures See 9+     See less Education State University of New York College at Fredonia BS,  Computer Science 1981  – 1985 Activities and Societies:  Tennis Team ,  Resident Manager Kingston High School 1978  – 1981 State University of New York College at Fredonia BS,  Computer Science 1981  – 1985 Activities and Societies:  Tennis Team ,  Resident Manager State University of New York College at Fredonia BS,  Computer Science 1981  – 1985 Activities and Societies:  Tennis Team ,  Resident Manager State University of New York College at Fredonia BS,  Computer Science 1981  – 1985 Activities and Societies:  Tennis Team ,  Resident Manager Kingston High School 1978  – 1981 Kingston High School 1978  – 1981 Kingston High School 1978  – 1981 ", "", "Experience Senior Software Engineering Manager IBM Senior Software Engineering Manager IBM Senior Software Engineering Manager IBM Skills Software Development Integration Java Cloud Computing Agile Methodologies Software Project... SQL Requirements Analysis Project Management Unix Skills  Software Development Integration Java Cloud Computing Agile Methodologies Software Project... SQL Requirements Analysis Project Management Unix Software Development Integration Java Cloud Computing Agile Methodologies Software Project... SQL Requirements Analysis Project Management Unix Software Development Integration Java Cloud Computing Agile Methodologies Software Project... SQL Requirements Analysis Project Management Unix ", "Skills SOA Software Development Software Development... Agile Methodologies Enterprise Architecture Product Management Program Management Software Project... PMP DB2 SDLC Enterprise Software Requirements Analysis Project Management IT Strategy Software Quality... Software Engineering Integration Management Websphere Solution Architecture UML Scrum Cloud Computing Agile Project Management Web Services Unix Java Enterprise Edition People Skills Architectures WebSphere See 16+     See less Skills  SOA Software Development Software Development... Agile Methodologies Enterprise Architecture Product Management Program Management Software Project... PMP DB2 SDLC Enterprise Software Requirements Analysis Project Management IT Strategy Software Quality... Software Engineering Integration Management Websphere Solution Architecture UML Scrum Cloud Computing Agile Project Management Web Services Unix Java Enterprise Edition People Skills Architectures WebSphere See 16+     See less SOA Software Development Software Development... Agile Methodologies Enterprise Architecture Product Management Program Management Software Project... PMP DB2 SDLC Enterprise Software Requirements Analysis Project Management IT Strategy Software Quality... Software Engineering Integration Management Websphere Solution Architecture UML Scrum Cloud Computing Agile Project Management Web Services Unix Java Enterprise Edition People Skills Architectures WebSphere See 16+     See less SOA Software Development Software Development... Agile Methodologies Enterprise Architecture Product Management Program Management Software Project... PMP DB2 SDLC Enterprise Software Requirements Analysis Project Management IT Strategy Software Quality... Software Engineering Integration Management Websphere Solution Architecture UML Scrum Cloud Computing Agile Project Management Web Services Unix Java Enterprise Edition People Skills Architectures WebSphere See 16+     See less ", "Languages English Native or bilingual proficiency Hindi Native or bilingual proficiency Gujarati Native or bilingual proficiency English Native or bilingual proficiency Hindi Native or bilingual proficiency Gujarati Native or bilingual proficiency English Native or bilingual proficiency Hindi Native or bilingual proficiency Gujarati Native or bilingual proficiency Native or bilingual proficiency Native or bilingual proficiency Native or bilingual proficiency Skills Skills     ", "Summary Specialties:Test/SQA leadership, team and project management, data/storage management solutions and technologies, SAN, product development, partnership/OEM development and management Summary Specialties:Test/SQA leadership, team and project management, data/storage management solutions and technologies, SAN, product development, partnership/OEM development and management Specialties:Test/SQA leadership, team and project management, data/storage management solutions and technologies, SAN, product development, partnership/OEM development and management Specialties:Test/SQA leadership, team and project management, data/storage management solutions and technologies, SAN, product development, partnership/OEM development and management Experience SQA Group Manager Brocade, Inc July 2006  – Present (9 years 2 months) San Jose, CA SQA Group Manager Brocade, Inc July 2006  – Present (9 years 2 months) San Jose, CA SQA Group Manager Brocade, Inc July 2006  – Present (9 years 2 months) San Jose, CA Skills SAN Product Development Storage Area Networks Testing Brocade Quality Assurance Storage Fibre Channel Management Go-to-market Strategy Storage Virtualization Virtualization Skills  SAN Product Development Storage Area Networks Testing Brocade Quality Assurance Storage Fibre Channel Management Go-to-market Strategy Storage Virtualization Virtualization SAN Product Development Storage Area Networks Testing Brocade Quality Assurance Storage Fibre Channel Management Go-to-market Strategy Storage Virtualization Virtualization SAN Product Development Storage Area Networks Testing Brocade Quality Assurance Storage Fibre Channel Management Go-to-market Strategy Storage Virtualization Virtualization Education San Jose State University MBA 2002  – 2005 San Jose State University MSE 2002  – 2005 Clarion University of Pennsylvania BS 1979  – 1983 Clarion University of Pennsylvania BS 1979  – 1983 San Jose State University MBA 2002  – 2005 San Jose State University MBA 2002  – 2005 San Jose State University MBA 2002  – 2005 San Jose State University MSE 2002  – 2005 San Jose State University MSE 2002  – 2005 San Jose State University MSE 2002  – 2005 Clarion University of Pennsylvania BS 1979  – 1983 Clarion University of Pennsylvania BS 1979  – 1983 Clarion University of Pennsylvania BS 1979  – 1983 Clarion University of Pennsylvania BS 1979  – 1983 Clarion University of Pennsylvania BS 1979  – 1983 Clarion University of Pennsylvania BS 1979  – 1983 ", "Skills Agile Methodologies DB2 XML Eclipse Java Software Development Web Services Software Engineering SOA Websphere CSS JDBC Java Enterprise Edition Database Design REST PHP C++ SQL Integration Enterprise Architecture Dojo XSLT Spring Web Applications Agile Software Design Distributed Systems Testing Linux XPath XHTML J2EE SOAP Ant Servlets Tomcat JavaScript AJAX JSON Apache MySQL Oracle Enterprise Software Web Development Mobile Applications C Perl Shell Scripting Unix Objective-C See 35+     See less Skills  Agile Methodologies DB2 XML Eclipse Java Software Development Web Services Software Engineering SOA Websphere CSS JDBC Java Enterprise Edition Database Design REST PHP C++ SQL Integration Enterprise Architecture Dojo XSLT Spring Web Applications Agile Software Design Distributed Systems Testing Linux XPath XHTML J2EE SOAP Ant Servlets Tomcat JavaScript AJAX JSON Apache MySQL Oracle Enterprise Software Web Development Mobile Applications C Perl Shell Scripting Unix Objective-C See 35+     See less Agile Methodologies DB2 XML Eclipse Java Software Development Web Services Software Engineering SOA Websphere CSS JDBC Java Enterprise Edition Database Design REST PHP C++ SQL Integration Enterprise Architecture Dojo XSLT Spring Web Applications Agile Software Design Distributed Systems Testing Linux XPath XHTML J2EE SOAP Ant Servlets Tomcat JavaScript AJAX JSON Apache MySQL Oracle Enterprise Software Web Development Mobile Applications C Perl Shell Scripting Unix Objective-C See 35+     See less Agile Methodologies DB2 XML Eclipse Java Software Development Web Services Software Engineering SOA Websphere CSS JDBC Java Enterprise Edition Database Design REST PHP C++ SQL Integration Enterprise Architecture Dojo XSLT Spring Web Applications Agile Software Design Distributed Systems Testing Linux XPath XHTML J2EE SOAP Ant Servlets Tomcat JavaScript AJAX JSON Apache MySQL Oracle Enterprise Software Web Development Mobile Applications C Perl Shell Scripting Unix Objective-C See 35+     See less Honors & Awards Salesforce.com 2014 Technology All-Stars Award July 2014 IBM Manager Spotlight Award 2010 IBM Invention Award 2008 IBM Invention Award 2007 IBM Outstanding Technology Achievement Award 2007 IBM Invention Award 2006 IBM Bravo Award 2006 IBM Bravo Award 2001 IBM Significant Achievement Award 2000 IBM Significant Achievement Award 1999 IBM Significant Achievement Award 1998 IBM Significant Achievement Award 1997 Salesforce.com 2014 Technology All-Stars Award July 2014 Salesforce.com 2014 Technology All-Stars Award July 2014 Salesforce.com 2014 Technology All-Stars Award July 2014 IBM Manager Spotlight Award 2010 IBM Manager Spotlight Award 2010 IBM Manager Spotlight Award 2010 IBM Invention Award 2008 IBM Invention Award 2008 IBM Invention Award 2008 IBM Invention Award 2007 IBM Invention Award 2007 IBM Invention Award 2007 IBM Outstanding Technology Achievement Award 2007 IBM Outstanding Technology Achievement Award 2007 IBM Outstanding Technology Achievement Award 2007 IBM Invention Award 2006 IBM Invention Award 2006 IBM Invention Award 2006 IBM Bravo Award 2006 IBM Bravo Award 2006 IBM Bravo Award 2006 IBM Bravo Award 2001 IBM Bravo Award 2001 IBM Bravo Award 2001 IBM Significant Achievement Award 2000 IBM Significant Achievement Award 2000 IBM Significant Achievement Award 2000 IBM Significant Achievement Award 1999 IBM Significant Achievement Award 1999 IBM Significant Achievement Award 1999 IBM Significant Achievement Award 1998 IBM Significant Achievement Award 1998 IBM Significant Achievement Award 1998 IBM Significant Achievement Award 1997 IBM Significant Achievement Award 1997 IBM Significant Achievement Award 1997 ", "Skills Agile Methodologies Enterprise Software Scrum SDLC Testing Project Management Integration Architecture Java Enterprise Edition Software Development Product Management SOA Business Process Oracle Linux Cross-functional Team... Java Software Engineering See 3+     See less Skills  Agile Methodologies Enterprise Software Scrum SDLC Testing Project Management Integration Architecture Java Enterprise Edition Software Development Product Management SOA Business Process Oracle Linux Cross-functional Team... Java Software Engineering See 3+     See less Agile Methodologies Enterprise Software Scrum SDLC Testing Project Management Integration Architecture Java Enterprise Edition Software Development Product Management SOA Business Process Oracle Linux Cross-functional Team... Java Software Engineering See 3+     See less Agile Methodologies Enterprise Software Scrum SDLC Testing Project Management Integration Architecture Java Enterprise Edition Software Development Product Management SOA Business Process Oracle Linux Cross-functional Team... Java Software Engineering See 3+     See less ", "Experience Senior Software Engineering Manager IBM April 1983  – Present (32 years 5 months) Austin, Texas Area Senior Software Engineering Manager IBM April 1983  – Present (32 years 5 months) Austin, Texas Area Senior Software Engineering Manager IBM April 1983  – Present (32 years 5 months) Austin, Texas Area Skills Microsoft Office Microsoft Excel Microsoft Word PowerPoint Customer Service English Windows Research Outlook Photoshop Teaching HTML Public Speaking Budgets C++ Editing C Strategic Planning Negotiation Java See 5+     See less Skills  Microsoft Office Microsoft Excel Microsoft Word PowerPoint Customer Service English Windows Research Outlook Photoshop Teaching HTML Public Speaking Budgets C++ Editing C Strategic Planning Negotiation Java See 5+     See less Microsoft Office Microsoft Excel Microsoft Word PowerPoint Customer Service English Windows Research Outlook Photoshop Teaching HTML Public Speaking Budgets C++ Editing C Strategic Planning Negotiation Java See 5+     See less Microsoft Office Microsoft Excel Microsoft Word PowerPoint Customer Service English Windows Research Outlook Photoshop Teaching HTML Public Speaking Budgets C++ Editing C Strategic Planning Negotiation Java See 5+     See less ", "Experience Senior Software Engineering Manager IBM July 1979  – Present (36 years 2 months) RTP, NC Senior Software Engineering Manager IBM July 1979  – Present (36 years 2 months) RTP, NC Senior Software Engineering Manager IBM July 1979  – Present (36 years 2 months) RTP, NC Education Boston College - Carroll School of Management Bachelor of Science (BS),  Computer Science Boston College - Carroll School of Management Bachelor of Science (BS),  Computer Science Boston College - Carroll School of Management Bachelor of Science (BS),  Computer Science Boston College - Carroll School of Management Bachelor of Science (BS),  Computer Science "]}