{"position": "Senior User Experience Designer", "company": "Intel Corporation", "profiles": ["Summary I am a London based designer with expertise mainly in Experience Design and Digital Branding Strategy, I have worked in creative agencies for most of my professional life. \nIn 2010 I joined the Thomson Reuters UX Design Team, where I have worked as UX Art Director and then UX Creative Director, leading the Creative Direction Team of five designers with different backgrounds, with the objective to conceive and design the new generation of Thomson Reuters F&R Digital products. \nI was part of the UX Design team at the BBC in 2012 and earlier this year, where I had the opportunity to work on My BBC and BBC One service. Summary I am a London based designer with expertise mainly in Experience Design and Digital Branding Strategy, I have worked in creative agencies for most of my professional life. \nIn 2010 I joined the Thomson Reuters UX Design Team, where I have worked as UX Art Director and then UX Creative Director, leading the Creative Direction Team of five designers with different backgrounds, with the objective to conceive and design the new generation of Thomson Reuters F&R Digital products. \nI was part of the UX Design team at the BBC in 2012 and earlier this year, where I had the opportunity to work on My BBC and BBC One service. I am a London based designer with expertise mainly in Experience Design and Digital Branding Strategy, I have worked in creative agencies for most of my professional life. \nIn 2010 I joined the Thomson Reuters UX Design Team, where I have worked as UX Art Director and then UX Creative Director, leading the Creative Direction Team of five designers with different backgrounds, with the objective to conceive and design the new generation of Thomson Reuters F&R Digital products. \nI was part of the UX Design team at the BBC in 2012 and earlier this year, where I had the opportunity to work on My BBC and BBC One service. I am a London based designer with expertise mainly in Experience Design and Digital Branding Strategy, I have worked in creative agencies for most of my professional life. \nIn 2010 I joined the Thomson Reuters UX Design Team, where I have worked as UX Art Director and then UX Creative Director, leading the Creative Direction Team of five designers with different backgrounds, with the objective to conceive and design the new generation of Thomson Reuters F&R Digital products. \nI was part of the UX Design team at the BBC in 2012 and earlier this year, where I had the opportunity to work on My BBC and BBC One service. Experience Senior User Experience Designer Intel Corporation January 2015  – Present (8 months) London, United Kingdom Creative Director and Owner 1001 Design March 2014  –  August 2015  (1 year 6 months) Creative Director Modern Human Design Ltd. August 2014  –  December 2014  (5 months) Design Consultant (contract) BBC March 2014  –  May 2014  (3 months) London, United Kingdom Creative Director Thomson Reuters January 2013  –  February 2014  (1 year 2 months) London, United Kingdom Senior Branding Designer BBC July 2012  –  December 2012  (6 months) London, United Kingdom Art Director Thomson Reuters July 2010  –  July 2012  (2 years 1 month) Senior Digital Designer Creeo Studio January 2009  –  March 2010  (1 year 3 months) London, United Kingdom Senior Graphic Designer Icom Group August 2007  –  December 2008  (1 year 5 months) London, United Kingdom Senior Graphic Designer Webfactory Ltd. Dublin, Ireland November 2006  –  July 2007  (9 months) Dublin Graphic Designer Creeo Studio July 2005  –  September 2006  (1 year 3 months) Designing corporate identities, corporate brochures, presentations, websites and online games for clients such as: Pirelli, BTicino, Istituto Europeo di design. Senior User Experience Designer Intel Corporation January 2015  – Present (8 months) London, United Kingdom Senior User Experience Designer Intel Corporation January 2015  – Present (8 months) London, United Kingdom Creative Director and Owner 1001 Design March 2014  –  August 2015  (1 year 6 months) Creative Director and Owner 1001 Design March 2014  –  August 2015  (1 year 6 months) Creative Director Modern Human Design Ltd. August 2014  –  December 2014  (5 months) Creative Director Modern Human Design Ltd. August 2014  –  December 2014  (5 months) Design Consultant (contract) BBC March 2014  –  May 2014  (3 months) London, United Kingdom Design Consultant (contract) BBC March 2014  –  May 2014  (3 months) London, United Kingdom Creative Director Thomson Reuters January 2013  –  February 2014  (1 year 2 months) London, United Kingdom Creative Director Thomson Reuters January 2013  –  February 2014  (1 year 2 months) London, United Kingdom Senior Branding Designer BBC July 2012  –  December 2012  (6 months) London, United Kingdom Senior Branding Designer BBC July 2012  –  December 2012  (6 months) London, United Kingdom Art Director Thomson Reuters July 2010  –  July 2012  (2 years 1 month) Art Director Thomson Reuters July 2010  –  July 2012  (2 years 1 month) Senior Digital Designer Creeo Studio January 2009  –  March 2010  (1 year 3 months) London, United Kingdom Senior Digital Designer Creeo Studio January 2009  –  March 2010  (1 year 3 months) London, United Kingdom Senior Graphic Designer Icom Group August 2007  –  December 2008  (1 year 5 months) London, United Kingdom Senior Graphic Designer Icom Group August 2007  –  December 2008  (1 year 5 months) London, United Kingdom Senior Graphic Designer Webfactory Ltd. Dublin, Ireland November 2006  –  July 2007  (9 months) Dublin Senior Graphic Designer Webfactory Ltd. Dublin, Ireland November 2006  –  July 2007  (9 months) Dublin Graphic Designer Creeo Studio July 2005  –  September 2006  (1 year 3 months) Designing corporate identities, corporate brochures, presentations, websites and online games for clients such as: Pirelli, BTicino, Istituto Europeo di design. Graphic Designer Creeo Studio July 2005  –  September 2006  (1 year 3 months) Designing corporate identities, corporate brochures, presentations, websites and online games for clients such as: Pirelli, BTicino, Istituto Europeo di design. Languages English Full professional proficiency Italian Native or bilingual proficiency English Full professional proficiency Italian Native or bilingual proficiency English Full professional proficiency Italian Native or bilingual proficiency Full professional proficiency Native or bilingual proficiency Skills Creative Direction Web Design Packaging User Interface Design User Experience Interaction Design Art Direction Graphic Design User-centered Design Mobile Design Corporate Identity Information Design Illustrator Wire Framing Visual Design Typography Wireframes Adobe Creative Suite Branding & Identity Brochures Concept Development Flash Graphics Layout Logo Design User Experience Design User Interface Product Design See 13+     See less Skills  Creative Direction Web Design Packaging User Interface Design User Experience Interaction Design Art Direction Graphic Design User-centered Design Mobile Design Corporate Identity Information Design Illustrator Wire Framing Visual Design Typography Wireframes Adobe Creative Suite Branding & Identity Brochures Concept Development Flash Graphics Layout Logo Design User Experience Design User Interface Product Design See 13+     See less Creative Direction Web Design Packaging User Interface Design User Experience Interaction Design Art Direction Graphic Design User-centered Design Mobile Design Corporate Identity Information Design Illustrator Wire Framing Visual Design Typography Wireframes Adobe Creative Suite Branding & Identity Brochures Concept Development Flash Graphics Layout Logo Design User Experience Design User Interface Product Design See 13+     See less Creative Direction Web Design Packaging User Interface Design User Experience Interaction Design Art Direction Graphic Design User-centered Design Mobile Design Corporate Identity Information Design Illustrator Wire Framing Visual Design Typography Wireframes Adobe Creative Suite Branding & Identity Brochures Concept Development Flash Graphics Layout Logo Design User Experience Design User Interface Product Design See 13+     See less Education University of the Arts London MA,  Graphic Design - Branding 2008  – 2009 General Assembly San Francisco User Experience Design Immersive 2014  – 2014 SDA Bocconi Master's degree,  Organizational Management 2005  – 2006 Politecnico di Milano Professional,  Architecture 1993  – 1999 University of the Arts London MA,  Graphic Design - Branding 2008  – 2009 University of the Arts London MA,  Graphic Design - Branding 2008  – 2009 University of the Arts London MA,  Graphic Design - Branding 2008  – 2009 General Assembly San Francisco User Experience Design Immersive 2014  – 2014 General Assembly San Francisco User Experience Design Immersive 2014  – 2014 General Assembly San Francisco User Experience Design Immersive 2014  – 2014 SDA Bocconi Master's degree,  Organizational Management 2005  – 2006 SDA Bocconi Master's degree,  Organizational Management 2005  – 2006 SDA Bocconi Master's degree,  Organizational Management 2005  – 2006 Politecnico di Milano Professional,  Architecture 1993  – 1999 Politecnico di Milano Professional,  Architecture 1993  – 1999 Politecnico di Milano Professional,  Architecture 1993  – 1999 ", "Summary Specialties:Web design, user interface design, user experience design, interaction design, front-end development. Summary Specialties:Web design, user interface design, user experience design, interaction design, front-end development. Specialties:Web design, user interface design, user experience design, interaction design, front-end development. Specialties:Web design, user interface design, user experience design, interaction design, front-end development. Experience Senior User Experience Designer Microsoft February 2015  – Present (7 months) Redmond, WA Senior User Experience Designer Intel Corporation October 2012  – Present (2 years 11 months) Portland, Oregon Area Senior User Experience Designer Nike October 2011  –  September 2012  (1 year) Oregon UI Designer Capital One May 2010  –  September 2011  (1 year 5 months) Richmond,VA UX/UI Designer/Developer Freelance Web Designer / Developer Logexsoft March 2010  –  2011  (1 year) Website design and development. Freelance Web Designer / Developer Brainchild Collective January 2007  –  2011  (4 years) Website design and development. Interactive Director SB&A October 2005  –  March 2010  (4 years 6 months) Web Designer Capital One September 2003  –  February 2006  (2 years 6 months) Richmond, Virginia Area Web Designer Philip Morris International September 2002  –  August 2003  (1 year) Richmond, Virginia Area Senior User Experience Designer Microsoft February 2015  – Present (7 months) Redmond, WA Senior User Experience Designer Microsoft February 2015  – Present (7 months) Redmond, WA Senior User Experience Designer Intel Corporation October 2012  – Present (2 years 11 months) Portland, Oregon Area Senior User Experience Designer Intel Corporation October 2012  – Present (2 years 11 months) Portland, Oregon Area Senior User Experience Designer Nike October 2011  –  September 2012  (1 year) Oregon Senior User Experience Designer Nike October 2011  –  September 2012  (1 year) Oregon UI Designer Capital One May 2010  –  September 2011  (1 year 5 months) Richmond,VA UX/UI Designer/Developer UI Designer Capital One May 2010  –  September 2011  (1 year 5 months) Richmond,VA UX/UI Designer/Developer Freelance Web Designer / Developer Logexsoft March 2010  –  2011  (1 year) Website design and development. Freelance Web Designer / Developer Logexsoft March 2010  –  2011  (1 year) Website design and development. Freelance Web Designer / Developer Brainchild Collective January 2007  –  2011  (4 years) Website design and development. Freelance Web Designer / Developer Brainchild Collective January 2007  –  2011  (4 years) Website design and development. Interactive Director SB&A October 2005  –  March 2010  (4 years 6 months) Interactive Director SB&A October 2005  –  March 2010  (4 years 6 months) Web Designer Capital One September 2003  –  February 2006  (2 years 6 months) Richmond, Virginia Area Web Designer Capital One September 2003  –  February 2006  (2 years 6 months) Richmond, Virginia Area Web Designer Philip Morris International September 2002  –  August 2003  (1 year) Richmond, Virginia Area Web Designer Philip Morris International September 2002  –  August 2003  (1 year) Richmond, Virginia Area Skills User Experience User Interface Design User-centered Design Front-end Development Visual Design Graphic Design Web Design Interaction Design Wireframing Rapid Prototyping Information Design Agile Lean UX Customer Experience Responsive Web Design Mobile Design Front-end Wireframes Agile Methodologies Data Visualization User Interface Illustrator Wire Framing Usability Engineering Creative Direction Adobe Creative Suite Usability Testing User Experience Design Digital Strategy Information Architecture Web Standards Experience Design Accessibility Typography User Research Art Direction HTML 5 Usability See 23+     See less Skills  User Experience User Interface Design User-centered Design Front-end Development Visual Design Graphic Design Web Design Interaction Design Wireframing Rapid Prototyping Information Design Agile Lean UX Customer Experience Responsive Web Design Mobile Design Front-end Wireframes Agile Methodologies Data Visualization User Interface Illustrator Wire Framing Usability Engineering Creative Direction Adobe Creative Suite Usability Testing User Experience Design Digital Strategy Information Architecture Web Standards Experience Design Accessibility Typography User Research Art Direction HTML 5 Usability See 23+     See less User Experience User Interface Design User-centered Design Front-end Development Visual Design Graphic Design Web Design Interaction Design Wireframing Rapid Prototyping Information Design Agile Lean UX Customer Experience Responsive Web Design Mobile Design Front-end Wireframes Agile Methodologies Data Visualization User Interface Illustrator Wire Framing Usability Engineering Creative Direction Adobe Creative Suite Usability Testing User Experience Design Digital Strategy Information Architecture Web Standards Experience Design Accessibility Typography User Research Art Direction HTML 5 Usability See 23+     See less User Experience User Interface Design User-centered Design Front-end Development Visual Design Graphic Design Web Design Interaction Design Wireframing Rapid Prototyping Information Design Agile Lean UX Customer Experience Responsive Web Design Mobile Design Front-end Wireframes Agile Methodologies Data Visualization User Interface Illustrator Wire Framing Usability Engineering Creative Direction Adobe Creative Suite Usability Testing User Experience Design Digital Strategy Information Architecture Web Standards Experience Design Accessibility Typography User Research Art Direction HTML 5 Usability See 23+     See less Education Virginia Commonwealth University Communications Art & Design,  Graphic Design 1995  – 1999 Virginia Commonwealth University Communications Art & Design,  Graphic Design 1995  – 1999 Virginia Commonwealth University Communications Art & Design,  Graphic Design 1995  – 1999 Virginia Commonwealth University Communications Art & Design,  Graphic Design 1995  – 1999 "]}