{"position": "Senior Systems Architect", "company": "IBM", "profiles": ["Skills WebSphere MQ Tivoli Storage Manager Linux Red Hat Linux Solaris IBM AIX EMC Storage V-Max Symmetrix Clariion Isilon VNX Celerra Nexsan Brocade Fibre Switches VMware ESX Bash Perl Python Disaster Recovery Integration See 6+     See less Skills  WebSphere MQ Tivoli Storage Manager Linux Red Hat Linux Solaris IBM AIX EMC Storage V-Max Symmetrix Clariion Isilon VNX Celerra Nexsan Brocade Fibre Switches VMware ESX Bash Perl Python Disaster Recovery Integration See 6+     See less WebSphere MQ Tivoli Storage Manager Linux Red Hat Linux Solaris IBM AIX EMC Storage V-Max Symmetrix Clariion Isilon VNX Celerra Nexsan Brocade Fibre Switches VMware ESX Bash Perl Python Disaster Recovery Integration See 6+     See less WebSphere MQ Tivoli Storage Manager Linux Red Hat Linux Solaris IBM AIX EMC Storage V-Max Symmetrix Clariion Isilon VNX Celerra Nexsan Brocade Fibre Switches VMware ESX Bash Perl Python Disaster Recovery Integration See 6+     See less ", "Experience Senior VMware Architect Discount Tire January 2015  – Present (8 months) Scottsdale, Arizona Lead VMware architect in charge of virtual environment at Discount Tire's corporate headquarters in Scottsdale AZ. Infrastructure Architect Dell July 2014  –  January 2015  (7 months) Phoenix, Arizona • Architect, design and build all Wintel server technologies, backup technologies, authentication technologies, software, and associated equipment across the entire company; collaborate with support teams as necessary. \n• Architect, design and build all Wintel software related technologies including, but not limited to VMWare, Microsoft Exchange, Citrix, Video systems and Medical equipment. \n• Develops and monitors adherence to company standards and procedures for all system operations, access, and usage. \n• Provides architectural and design oversight to technicians working on Wintel server platforms, backup technologies, authentication technologies, software, and associated equipment. \n• Architects and/or coordinates all projects assigned involving Wintel server technologies, backup technologies, authentication technologies, software, and associated equipment resources. \n• Works with Security engineers to ensure that security procedures are implemented and enforced in accordance with Information Security Department to provide required information security on the projects assigned to. \n• Assists with the evaluation of vendor products to provide enhanced enterprise-wide services for the Wintel server environments. Senior Systems Engineer ManpowerGroup March 2013  –  June 2014  (1 year 4 months) tempe arizona Responsible for the VMWare environent, Windows Servers, Linux servers, and Storage (NetApp). Currently designing uplifted data center to include fully redundant VM environment (multiple ESXi 5.x DL580-585 Hosts attached to NAS for vMotion needs). Windows server uplift from 2003 to 2008R2. Currently implementing and managing roll out of new SharePoint environment as well as Microsoft SQL 2005 to 2008 that I designed for the North American side of the company to fulfill their requirements. Also currently designing lab VM environment solution for dev teams in Tempe Az. Also in charge of Linux environment including PeopleSoft infrastructure as well as NetApp storage. Senior Software Developer Apollo Group June 2012  –  February 2013  (9 months) Phoenix, Arizona Area Responsible for working with development teams on solving production issues. Most of the issues were a result of missed items in testing that surfaced when in production as test and prod environments differed in hardware and network configurations. Required network packet sniffing, code review, server log and vm performance review to come up with proper solutions. Senior Systems Architect Amex February 2008  –  June 2012  (4 years 5 months) VMware and Windows systems architecture. Responsible for working with development teams on designing proper environment for their particular application requirements. Helping Development teams get their applications through dev/devqa/prodqa and eventually into full production. Senior Systems Architect IBM January 2007  –  February 2008  (1 year 2 months) VMware and Windows systems architecture. Responsible for working with development teams on designing proper environment for their particular application requirements. Helping Development teams get their applications through dev/devqa/prodqa and eventually into full production. Systems Architect US Airways March 2004  –  December 2006  (2 years 10 months) Windows and SQL systems architecture and maintenance. Working with development teams on designing systems that meet their requirements. Systems engineer IBM 2005  –  2006  (1 year) Windows desktop and Netware engineer. Worked with teams to come up with windows and network solutions to their particular needs. Some teams outside of AZ required at that time untested VPN solutions. Worked with Nortel on solutions for those needs. Systems Architect arizona public service 2001  –  2003  (2 years) Responsible for upgrading their server architecture. Looked into cutting costs and reducing the number of servers in use by using larger more powerful hardware. Senior VMware Architect Discount Tire January 2015  – Present (8 months) Scottsdale, Arizona Lead VMware architect in charge of virtual environment at Discount Tire's corporate headquarters in Scottsdale AZ. Senior VMware Architect Discount Tire January 2015  – Present (8 months) Scottsdale, Arizona Lead VMware architect in charge of virtual environment at Discount Tire's corporate headquarters in Scottsdale AZ. Infrastructure Architect Dell July 2014  –  January 2015  (7 months) Phoenix, Arizona • Architect, design and build all Wintel server technologies, backup technologies, authentication technologies, software, and associated equipment across the entire company; collaborate with support teams as necessary. \n• Architect, design and build all Wintel software related technologies including, but not limited to VMWare, Microsoft Exchange, Citrix, Video systems and Medical equipment. \n• Develops and monitors adherence to company standards and procedures for all system operations, access, and usage. \n• Provides architectural and design oversight to technicians working on Wintel server platforms, backup technologies, authentication technologies, software, and associated equipment. \n• Architects and/or coordinates all projects assigned involving Wintel server technologies, backup technologies, authentication technologies, software, and associated equipment resources. \n• Works with Security engineers to ensure that security procedures are implemented and enforced in accordance with Information Security Department to provide required information security on the projects assigned to. \n• Assists with the evaluation of vendor products to provide enhanced enterprise-wide services for the Wintel server environments. Infrastructure Architect Dell July 2014  –  January 2015  (7 months) Phoenix, Arizona • Architect, design and build all Wintel server technologies, backup technologies, authentication technologies, software, and associated equipment across the entire company; collaborate with support teams as necessary. \n• Architect, design and build all Wintel software related technologies including, but not limited to VMWare, Microsoft Exchange, Citrix, Video systems and Medical equipment. \n• Develops and monitors adherence to company standards and procedures for all system operations, access, and usage. \n• Provides architectural and design oversight to technicians working on Wintel server platforms, backup technologies, authentication technologies, software, and associated equipment. \n• Architects and/or coordinates all projects assigned involving Wintel server technologies, backup technologies, authentication technologies, software, and associated equipment resources. \n• Works with Security engineers to ensure that security procedures are implemented and enforced in accordance with Information Security Department to provide required information security on the projects assigned to. \n• Assists with the evaluation of vendor products to provide enhanced enterprise-wide services for the Wintel server environments. Senior Systems Engineer ManpowerGroup March 2013  –  June 2014  (1 year 4 months) tempe arizona Responsible for the VMWare environent, Windows Servers, Linux servers, and Storage (NetApp). Currently designing uplifted data center to include fully redundant VM environment (multiple ESXi 5.x DL580-585 Hosts attached to NAS for vMotion needs). Windows server uplift from 2003 to 2008R2. Currently implementing and managing roll out of new SharePoint environment as well as Microsoft SQL 2005 to 2008 that I designed for the North American side of the company to fulfill their requirements. Also currently designing lab VM environment solution for dev teams in Tempe Az. Also in charge of Linux environment including PeopleSoft infrastructure as well as NetApp storage. Senior Systems Engineer ManpowerGroup March 2013  –  June 2014  (1 year 4 months) tempe arizona Responsible for the VMWare environent, Windows Servers, Linux servers, and Storage (NetApp). Currently designing uplifted data center to include fully redundant VM environment (multiple ESXi 5.x DL580-585 Hosts attached to NAS for vMotion needs). Windows server uplift from 2003 to 2008R2. Currently implementing and managing roll out of new SharePoint environment as well as Microsoft SQL 2005 to 2008 that I designed for the North American side of the company to fulfill their requirements. Also currently designing lab VM environment solution for dev teams in Tempe Az. Also in charge of Linux environment including PeopleSoft infrastructure as well as NetApp storage. Senior Software Developer Apollo Group June 2012  –  February 2013  (9 months) Phoenix, Arizona Area Responsible for working with development teams on solving production issues. Most of the issues were a result of missed items in testing that surfaced when in production as test and prod environments differed in hardware and network configurations. Required network packet sniffing, code review, server log and vm performance review to come up with proper solutions. Senior Software Developer Apollo Group June 2012  –  February 2013  (9 months) Phoenix, Arizona Area Responsible for working with development teams on solving production issues. Most of the issues were a result of missed items in testing that surfaced when in production as test and prod environments differed in hardware and network configurations. Required network packet sniffing, code review, server log and vm performance review to come up with proper solutions. Senior Systems Architect Amex February 2008  –  June 2012  (4 years 5 months) VMware and Windows systems architecture. Responsible for working with development teams on designing proper environment for their particular application requirements. Helping Development teams get their applications through dev/devqa/prodqa and eventually into full production. Senior Systems Architect Amex February 2008  –  June 2012  (4 years 5 months) VMware and Windows systems architecture. Responsible for working with development teams on designing proper environment for their particular application requirements. Helping Development teams get their applications through dev/devqa/prodqa and eventually into full production. Senior Systems Architect IBM January 2007  –  February 2008  (1 year 2 months) VMware and Windows systems architecture. Responsible for working with development teams on designing proper environment for their particular application requirements. Helping Development teams get their applications through dev/devqa/prodqa and eventually into full production. Senior Systems Architect IBM January 2007  –  February 2008  (1 year 2 months) VMware and Windows systems architecture. Responsible for working with development teams on designing proper environment for their particular application requirements. Helping Development teams get their applications through dev/devqa/prodqa and eventually into full production. Systems Architect US Airways March 2004  –  December 2006  (2 years 10 months) Windows and SQL systems architecture and maintenance. Working with development teams on designing systems that meet their requirements. Systems Architect US Airways March 2004  –  December 2006  (2 years 10 months) Windows and SQL systems architecture and maintenance. Working with development teams on designing systems that meet their requirements. Systems engineer IBM 2005  –  2006  (1 year) Windows desktop and Netware engineer. Worked with teams to come up with windows and network solutions to their particular needs. Some teams outside of AZ required at that time untested VPN solutions. Worked with Nortel on solutions for those needs. Systems engineer IBM 2005  –  2006  (1 year) Windows desktop and Netware engineer. Worked with teams to come up with windows and network solutions to their particular needs. Some teams outside of AZ required at that time untested VPN solutions. Worked with Nortel on solutions for those needs. Systems Architect arizona public service 2001  –  2003  (2 years) Responsible for upgrading their server architecture. Looked into cutting costs and reducing the number of servers in use by using larger more powerful hardware. Systems Architect arizona public service 2001  –  2003  (2 years) Responsible for upgrading their server architecture. Looked into cutting costs and reducing the number of servers in use by using larger more powerful hardware. Languages English Native or bilingual proficiency French Native or bilingual proficiency English Native or bilingual proficiency French Native or bilingual proficiency English Native or bilingual proficiency French Native or bilingual proficiency Native or bilingual proficiency Native or bilingual proficiency Skills Unix Enterprise Architecture Linux SOA System Architecture Web Services Agile Methodologies SQL Solution Architecture VMware ESX Windows Server NetApp Filers SharePoint SDLC Virtualization Skills  Unix Enterprise Architecture Linux SOA System Architecture Web Services Agile Methodologies SQL Solution Architecture VMware ESX Windows Server NetApp Filers SharePoint SDLC Virtualization Unix Enterprise Architecture Linux SOA System Architecture Web Services Agile Methodologies SQL Solution Architecture VMware ESX Windows Server NetApp Filers SharePoint SDLC Virtualization Unix Enterprise Architecture Linux SOA System Architecture Web Services Agile Methodologies SQL Solution Architecture VMware ESX Windows Server NetApp Filers SharePoint SDLC Virtualization Education CIPEC France Mesa Community College CIPEC France CIPEC France CIPEC France Mesa Community College Mesa Community College Mesa Community College ", "Experience Senior Systems Architect /IBM Power Systems Tiffany & Co. May 2012  – Present (3 years 4 months) Infrastructure Engineer Barnes & Noble College Booksellers April 2001  –  April 2012  (11 years 1 month) Senior Technical Specilist BASF/Knoll Pharmaceuticals 1997  –  2001  (4 years) Sr. Systems Programmer Fresenius Medical Care 1995  –  1997  (2 years) Senior Systems Architect /IBM Power Systems Tiffany & Co. May 2012  – Present (3 years 4 months) Senior Systems Architect /IBM Power Systems Tiffany & Co. May 2012  – Present (3 years 4 months) Infrastructure Engineer Barnes & Noble College Booksellers April 2001  –  April 2012  (11 years 1 month) Infrastructure Engineer Barnes & Noble College Booksellers April 2001  –  April 2012  (11 years 1 month) Senior Technical Specilist BASF/Knoll Pharmaceuticals 1997  –  2001  (4 years) Senior Technical Specilist BASF/Knoll Pharmaceuticals 1997  –  2001  (4 years) Sr. Systems Programmer Fresenius Medical Care 1995  –  1997  (2 years) Sr. Systems Programmer Fresenius Medical Care 1995  –  1997  (2 years) Skills Disaster Recovery IT Management Data Center Infrastructure Integration System Administration Project Management Visio Enterprise Architecture Business Analysis IT Strategy SDLC Servers Skills  Disaster Recovery IT Management Data Center Infrastructure Integration System Administration Project Management Visio Enterprise Architecture Business Analysis IT Strategy SDLC Servers Disaster Recovery IT Management Data Center Infrastructure Integration System Administration Project Management Visio Enterprise Architecture Business Analysis IT Strategy SDLC Servers Disaster Recovery IT Management Data Center Infrastructure Integration System Administration Project Management Visio Enterprise Architecture Business Analysis IT Strategy SDLC Servers ", "Summary Certified IT Leader with over 25 years of successful experience in technical project management, team management, systems engineering, architecture, UNIX administration, and consulting services. Consistently risen to leadership positions and called upon to communicate complex technical solutions to both business and technical audiences. Highly motivated and organized problem solver with outstanding communication and people skills. Summary Certified IT Leader with over 25 years of successful experience in technical project management, team management, systems engineering, architecture, UNIX administration, and consulting services. Consistently risen to leadership positions and called upon to communicate complex technical solutions to both business and technical audiences. Highly motivated and organized problem solver with outstanding communication and people skills. Certified IT Leader with over 25 years of successful experience in technical project management, team management, systems engineering, architecture, UNIX administration, and consulting services. Consistently risen to leadership positions and called upon to communicate complex technical solutions to both business and technical audiences. Highly motivated and organized problem solver with outstanding communication and people skills. Certified IT Leader with over 25 years of successful experience in technical project management, team management, systems engineering, architecture, UNIX administration, and consulting services. Consistently risen to leadership positions and called upon to communicate complex technical solutions to both business and technical audiences. Highly motivated and organized problem solver with outstanding communication and people skills. Experience IT Systems Integrator CVS Caremark Corporation April 2014  – Present (1 year 5 months) Woonsocket RI IT solution configuration and estimation of new Infrastructure solutions \nManage the infrastructure delivery aspect of IT based projects \nTroubleshoot and resolve technical issues prior to go-live \nFacilitate the development of system test and performance test plans Senior Systems Architect IBM April 2013  –  April 2014  (1 year 1 month) providence, rhode island area Technical pre-sales consultant role, working with Enterprise Accounts to develop a strategic systems direction. Perform business and technology consulting, requirements analysis, architecture and solution design. VP, Head of Midrange Services Citizens Bank October 2005  –  March 2013  (7 years 6 months) Lead both UNIX and Middleware technical infrastructure organizations to deliver best in class technical services to our partners and business lines. This support includes over 1000 UNIX/Linux based hosts and their supporting infrastructure across multiple datacenters. \n \nWas responsible for Project Mangement leadership of all key technical components of multiple finance projects to include a $36.8 million dollar phase of the Enterprise Data Initiative program which is responsible for implementing our new company wide data warehouse initiative across the breadth of the organization. Open Systems Consultant Lighthouse Computer Services January 2000  –  October 2005  (5 years 10 months) Was responsible for high-end UNIX consulting and installing highly available solutions (HACMP) to SP and RS/6000 customer base. Consulted in high end AIX design/implementation. Developed HACMP/XD and SRDF automation scripts Customer Engineer/Systems Engineer IBM 1989  –  2000  (11 years) Providence, Rhode Island Area Was responsible for hardware and software support of IBM’s version of UNIX, AIX. Received several awards for excellence in technical knowledge and customer satisfaction. Chosen as territory specialist for RS/6000 systems. Unix/Internet Systems Analyst Stanley Bostitch 1996  –  1998  (2 years) Was responsible for high level UNIX system administration and support of 11 UNIX servers 25 UNIX workstations, 20 NT 4.0 workstations and over 700 active users supporting various divisions of StanleyWorks worldwide.. Communications Computer Systems Specialist United States Air Force August 1985  –  July 1989  (4 years) Colorado Springs, Colorado Area Managed database and communications for department. Received Top Secret Security clearance. Received the “John L. Levitow” Award for excellence in leadership IT Systems Integrator CVS Caremark Corporation April 2014  – Present (1 year 5 months) Woonsocket RI IT solution configuration and estimation of new Infrastructure solutions \nManage the infrastructure delivery aspect of IT based projects \nTroubleshoot and resolve technical issues prior to go-live \nFacilitate the development of system test and performance test plans IT Systems Integrator CVS Caremark Corporation April 2014  – Present (1 year 5 months) Woonsocket RI IT solution configuration and estimation of new Infrastructure solutions \nManage the infrastructure delivery aspect of IT based projects \nTroubleshoot and resolve technical issues prior to go-live \nFacilitate the development of system test and performance test plans Senior Systems Architect IBM April 2013  –  April 2014  (1 year 1 month) providence, rhode island area Technical pre-sales consultant role, working with Enterprise Accounts to develop a strategic systems direction. Perform business and technology consulting, requirements analysis, architecture and solution design. Senior Systems Architect IBM April 2013  –  April 2014  (1 year 1 month) providence, rhode island area Technical pre-sales consultant role, working with Enterprise Accounts to develop a strategic systems direction. Perform business and technology consulting, requirements analysis, architecture and solution design. VP, Head of Midrange Services Citizens Bank October 2005  –  March 2013  (7 years 6 months) Lead both UNIX and Middleware technical infrastructure organizations to deliver best in class technical services to our partners and business lines. This support includes over 1000 UNIX/Linux based hosts and their supporting infrastructure across multiple datacenters. \n \nWas responsible for Project Mangement leadership of all key technical components of multiple finance projects to include a $36.8 million dollar phase of the Enterprise Data Initiative program which is responsible for implementing our new company wide data warehouse initiative across the breadth of the organization. VP, Head of Midrange Services Citizens Bank October 2005  –  March 2013  (7 years 6 months) Lead both UNIX and Middleware technical infrastructure organizations to deliver best in class technical services to our partners and business lines. This support includes over 1000 UNIX/Linux based hosts and their supporting infrastructure across multiple datacenters. \n \nWas responsible for Project Mangement leadership of all key technical components of multiple finance projects to include a $36.8 million dollar phase of the Enterprise Data Initiative program which is responsible for implementing our new company wide data warehouse initiative across the breadth of the organization. Open Systems Consultant Lighthouse Computer Services January 2000  –  October 2005  (5 years 10 months) Was responsible for high-end UNIX consulting and installing highly available solutions (HACMP) to SP and RS/6000 customer base. Consulted in high end AIX design/implementation. Developed HACMP/XD and SRDF automation scripts Open Systems Consultant Lighthouse Computer Services January 2000  –  October 2005  (5 years 10 months) Was responsible for high-end UNIX consulting and installing highly available solutions (HACMP) to SP and RS/6000 customer base. Consulted in high end AIX design/implementation. Developed HACMP/XD and SRDF automation scripts Customer Engineer/Systems Engineer IBM 1989  –  2000  (11 years) Providence, Rhode Island Area Was responsible for hardware and software support of IBM’s version of UNIX, AIX. Received several awards for excellence in technical knowledge and customer satisfaction. Chosen as territory specialist for RS/6000 systems. Customer Engineer/Systems Engineer IBM 1989  –  2000  (11 years) Providence, Rhode Island Area Was responsible for hardware and software support of IBM’s version of UNIX, AIX. Received several awards for excellence in technical knowledge and customer satisfaction. Chosen as territory specialist for RS/6000 systems. Unix/Internet Systems Analyst Stanley Bostitch 1996  –  1998  (2 years) Was responsible for high level UNIX system administration and support of 11 UNIX servers 25 UNIX workstations, 20 NT 4.0 workstations and over 700 active users supporting various divisions of StanleyWorks worldwide.. Unix/Internet Systems Analyst Stanley Bostitch 1996  –  1998  (2 years) Was responsible for high level UNIX system administration and support of 11 UNIX servers 25 UNIX workstations, 20 NT 4.0 workstations and over 700 active users supporting various divisions of StanleyWorks worldwide.. Communications Computer Systems Specialist United States Air Force August 1985  –  July 1989  (4 years) Colorado Springs, Colorado Area Managed database and communications for department. Received Top Secret Security clearance. Received the “John L. Levitow” Award for excellence in leadership Communications Computer Systems Specialist United States Air Force August 1985  –  July 1989  (4 years) Colorado Springs, Colorado Area Managed database and communications for department. Received Top Secret Security clearance. Received the “John L. Levitow” Award for excellence in leadership Skills Disaster Recovery SDLC ITIL Vendor Management System Deployment Solution Architecture Integration AIX Virtualization Visio Security SAN Storage High Availability VMware Unix Server Architecture Risk Management Servers Solaris See 5+     See less Skills  Disaster Recovery SDLC ITIL Vendor Management System Deployment Solution Architecture Integration AIX Virtualization Visio Security SAN Storage High Availability VMware Unix Server Architecture Risk Management Servers Solaris See 5+     See less Disaster Recovery SDLC ITIL Vendor Management System Deployment Solution Architecture Integration AIX Virtualization Visio Security SAN Storage High Availability VMware Unix Server Architecture Risk Management Servers Solaris See 5+     See less Disaster Recovery SDLC ITIL Vendor Management System Deployment Solution Architecture Integration AIX Virtualization Visio Security SAN Storage High Availability VMware Unix Server Architecture Risk Management Servers Solaris See 5+     See less Education New England Institute of Technology Bachelor of Science (BS),  Computer Science 1994  – 1997 New England Institute of Technology Bachelor of Science (BS),  Computer Science 1994  – 1997 New England Institute of Technology Bachelor of Science (BS),  Computer Science 1994  – 1997 New England Institute of Technology Bachelor of Science (BS),  Computer Science 1994  – 1997 Honors & Awards Additional Honors & Awards Certified PureFlex Technical Support \nProject Management Professional (PMP)  \nCertified ITIL Foundation  \nRed Hat Certified Technician (RHCT) V5 \nIBM Certified Advanced Technical Expert (CATE) – pSeries and AIX  \nNovell Netware 3 Certified Network Engineer (CNE) Additional Honors & Awards Certified PureFlex Technical Support \nProject Management Professional (PMP)  \nCertified ITIL Foundation  \nRed Hat Certified Technician (RHCT) V5 \nIBM Certified Advanced Technical Expert (CATE) – pSeries and AIX  \nNovell Netware 3 Certified Network Engineer (CNE) Additional Honors & Awards Certified PureFlex Technical Support \nProject Management Professional (PMP)  \nCertified ITIL Foundation  \nRed Hat Certified Technician (RHCT) V5 \nIBM Certified Advanced Technical Expert (CATE) – pSeries and AIX  \nNovell Netware 3 Certified Network Engineer (CNE) Additional Honors & Awards Certified PureFlex Technical Support \nProject Management Professional (PMP)  \nCertified ITIL Foundation  \nRed Hat Certified Technician (RHCT) V5 \nIBM Certified Advanced Technical Expert (CATE) – pSeries and AIX  \nNovell Netware 3 Certified Network Engineer (CNE) ", "Summary - An experienced Technical Architect who has had responsiblity for the design, implementation and management of global, enterprise solutions in FTSE 100 companies including Reuters and Centrica, and Australian Federal Government. I have a track record in successfully delivering Active Directory and End User Computing solutions to estates of 30,000+ users/devices on a national and global scale and defining enterprise wide migration strategies across a wide variety of end user computing infrastructures. \n \n- Certified in Windows 7 (MCITP), Windows Server 2008 / Active Directory (MCITP) and have held MCP certification since 1996. \n \n- Experienced in enterprise wide and global migrations across End User Infrastructure platforms \n \n- Excellent documentation and presentation skills and able to communicate and explain solutions to both technical and non-technical audiences \n \n- Ability to think analytically and provide solutions and leadership across a wide range of technology solutions Specialties:Active Directory Design, Windows 7 deployment technologies, Quest Active Roles, Enterprise migrations in End User Infrastructure Summary - An experienced Technical Architect who has had responsiblity for the design, implementation and management of global, enterprise solutions in FTSE 100 companies including Reuters and Centrica, and Australian Federal Government. I have a track record in successfully delivering Active Directory and End User Computing solutions to estates of 30,000+ users/devices on a national and global scale and defining enterprise wide migration strategies across a wide variety of end user computing infrastructures. \n \n- Certified in Windows 7 (MCITP), Windows Server 2008 / Active Directory (MCITP) and have held MCP certification since 1996. \n \n- Experienced in enterprise wide and global migrations across End User Infrastructure platforms \n \n- Excellent documentation and presentation skills and able to communicate and explain solutions to both technical and non-technical audiences \n \n- Ability to think analytically and provide solutions and leadership across a wide range of technology solutions Specialties:Active Directory Design, Windows 7 deployment technologies, Quest Active Roles, Enterprise migrations in End User Infrastructure - An experienced Technical Architect who has had responsiblity for the design, implementation and management of global, enterprise solutions in FTSE 100 companies including Reuters and Centrica, and Australian Federal Government. I have a track record in successfully delivering Active Directory and End User Computing solutions to estates of 30,000+ users/devices on a national and global scale and defining enterprise wide migration strategies across a wide variety of end user computing infrastructures. \n \n- Certified in Windows 7 (MCITP), Windows Server 2008 / Active Directory (MCITP) and have held MCP certification since 1996. \n \n- Experienced in enterprise wide and global migrations across End User Infrastructure platforms \n \n- Excellent documentation and presentation skills and able to communicate and explain solutions to both technical and non-technical audiences \n \n- Ability to think analytically and provide solutions and leadership across a wide range of technology solutions Specialties:Active Directory Design, Windows 7 deployment technologies, Quest Active Roles, Enterprise migrations in End User Infrastructure - An experienced Technical Architect who has had responsiblity for the design, implementation and management of global, enterprise solutions in FTSE 100 companies including Reuters and Centrica, and Australian Federal Government. I have a track record in successfully delivering Active Directory and End User Computing solutions to estates of 30,000+ users/devices on a national and global scale and defining enterprise wide migration strategies across a wide variety of end user computing infrastructures. \n \n- Certified in Windows 7 (MCITP), Windows Server 2008 / Active Directory (MCITP) and have held MCP certification since 1996. \n \n- Experienced in enterprise wide and global migrations across End User Infrastructure platforms \n \n- Excellent documentation and presentation skills and able to communicate and explain solutions to both technical and non-technical audiences \n \n- Ability to think analytically and provide solutions and leadership across a wide range of technology solutions Specialties:Active Directory Design, Windows 7 deployment technologies, Quest Active Roles, Enterprise migrations in End User Infrastructure Experience Senior Customer Solutions Architect Fujitsu Services June 2007  – Present (8 years 3 months) Solutions Delivery Manager Reuters April 1999  –  May 2007  (8 years 2 months) London, United Kingdom Senior Systems Architect IBM Global Services 1995  –  1999  (4 years) Craftsman Ministry of Defence 1987  –  1991  (4 years) Senior Customer Solutions Architect Fujitsu Services June 2007  – Present (8 years 3 months) Senior Customer Solutions Architect Fujitsu Services June 2007  – Present (8 years 3 months) Solutions Delivery Manager Reuters April 1999  –  May 2007  (8 years 2 months) London, United Kingdom Solutions Delivery Manager Reuters April 1999  –  May 2007  (8 years 2 months) London, United Kingdom Senior Systems Architect IBM Global Services 1995  –  1999  (4 years) Senior Systems Architect IBM Global Services 1995  –  1999  (4 years) Craftsman Ministry of Defence 1987  –  1991  (4 years) Craftsman Ministry of Defence 1987  –  1991  (4 years) Skills Active Directory Solution Design Quest ActiveRoles Server Directory Services Windows 7 Windows Server 2008 Technical Architecture Powershell Group Policy Quest Migration Manager VBScript Solution Architecture Windows Server Microsoft Exchange Outsourcing Microsoft Certified... Enterprise Software Microsoft Technologies ITIL Disaster Recovery Infrastructure Virtualization System Deployment Microsoft SQL Server MBAM Microsoft Cluster Windows Server 2012 Arbitrary IT Buzzword Citrix SCCM Hyper-V See 16+     See less Skills  Active Directory Solution Design Quest ActiveRoles Server Directory Services Windows 7 Windows Server 2008 Technical Architecture Powershell Group Policy Quest Migration Manager VBScript Solution Architecture Windows Server Microsoft Exchange Outsourcing Microsoft Certified... Enterprise Software Microsoft Technologies ITIL Disaster Recovery Infrastructure Virtualization System Deployment Microsoft SQL Server MBAM Microsoft Cluster Windows Server 2012 Arbitrary IT Buzzword Citrix SCCM Hyper-V See 16+     See less Active Directory Solution Design Quest ActiveRoles Server Directory Services Windows 7 Windows Server 2008 Technical Architecture Powershell Group Policy Quest Migration Manager VBScript Solution Architecture Windows Server Microsoft Exchange Outsourcing Microsoft Certified... Enterprise Software Microsoft Technologies ITIL Disaster Recovery Infrastructure Virtualization System Deployment Microsoft SQL Server MBAM Microsoft Cluster Windows Server 2012 Arbitrary IT Buzzword Citrix SCCM Hyper-V See 16+     See less Active Directory Solution Design Quest ActiveRoles Server Directory Services Windows 7 Windows Server 2008 Technical Architecture Powershell Group Policy Quest Migration Manager VBScript Solution Architecture Windows Server Microsoft Exchange Outsourcing Microsoft Certified... Enterprise Software Microsoft Technologies ITIL Disaster Recovery Infrastructure Virtualization System Deployment Microsoft SQL Server MBAM Microsoft Cluster Windows Server 2012 Arbitrary IT Buzzword Citrix SCCM Hyper-V See 16+     See less ", "Experience Senior Systems Architect IBM Senior Systems Architect IBM Senior Systems Architect IBM ", "Summary Over 10+ years of IT experience specializing in architecting / engineering / maintaining enterprise-wide Access, Identity and Entitlements Management solutions for clients like AT&T, Guardian Life Insurance, UPS, Wal-Mart, Citigroup & IBM. Proven track record working with business teams and technology leaders to create significant business value through comprehensive security solutions; Specializes in designing corporate directories and working on IDM products from IBM (Tivoli Suite) as well as Oracle; Received 4 patents and 3 publications for Directory Services.  \nCurrently working in Guardian Life Insurance Company supporting its Access & identity management infrastructure; Specialties:Tivoli Access Manager (TAM), Tivoli Identity Manager (TIM), Tivoli Directory Integrator (TDI), Tivoli federated Identity Manager (TFIM), Oracle access & Identity Manager, Entrust Identity Guard, Sun One Directory Server Enterprise Edition (5.2/6.3/7.0), IBM Tivoli Directory Server (5.2/6.1/6.3), Oracle Internet Directory, OpenLDAP Summary Over 10+ years of IT experience specializing in architecting / engineering / maintaining enterprise-wide Access, Identity and Entitlements Management solutions for clients like AT&T, Guardian Life Insurance, UPS, Wal-Mart, Citigroup & IBM. Proven track record working with business teams and technology leaders to create significant business value through comprehensive security solutions; Specializes in designing corporate directories and working on IDM products from IBM (Tivoli Suite) as well as Oracle; Received 4 patents and 3 publications for Directory Services.  \nCurrently working in Guardian Life Insurance Company supporting its Access & identity management infrastructure; Specialties:Tivoli Access Manager (TAM), Tivoli Identity Manager (TIM), Tivoli Directory Integrator (TDI), Tivoli federated Identity Manager (TFIM), Oracle access & Identity Manager, Entrust Identity Guard, Sun One Directory Server Enterprise Edition (5.2/6.3/7.0), IBM Tivoli Directory Server (5.2/6.1/6.3), Oracle Internet Directory, OpenLDAP Over 10+ years of IT experience specializing in architecting / engineering / maintaining enterprise-wide Access, Identity and Entitlements Management solutions for clients like AT&T, Guardian Life Insurance, UPS, Wal-Mart, Citigroup & IBM. Proven track record working with business teams and technology leaders to create significant business value through comprehensive security solutions; Specializes in designing corporate directories and working on IDM products from IBM (Tivoli Suite) as well as Oracle; Received 4 patents and 3 publications for Directory Services.  \nCurrently working in Guardian Life Insurance Company supporting its Access & identity management infrastructure; Specialties:Tivoli Access Manager (TAM), Tivoli Identity Manager (TIM), Tivoli Directory Integrator (TDI), Tivoli federated Identity Manager (TFIM), Oracle access & Identity Manager, Entrust Identity Guard, Sun One Directory Server Enterprise Edition (5.2/6.3/7.0), IBM Tivoli Directory Server (5.2/6.1/6.3), Oracle Internet Directory, OpenLDAP Over 10+ years of IT experience specializing in architecting / engineering / maintaining enterprise-wide Access, Identity and Entitlements Management solutions for clients like AT&T, Guardian Life Insurance, UPS, Wal-Mart, Citigroup & IBM. Proven track record working with business teams and technology leaders to create significant business value through comprehensive security solutions; Specializes in designing corporate directories and working on IDM products from IBM (Tivoli Suite) as well as Oracle; Received 4 patents and 3 publications for Directory Services.  \nCurrently working in Guardian Life Insurance Company supporting its Access & identity management infrastructure; Specialties:Tivoli Access Manager (TAM), Tivoli Identity Manager (TIM), Tivoli Directory Integrator (TDI), Tivoli federated Identity Manager (TFIM), Oracle access & Identity Manager, Entrust Identity Guard, Sun One Directory Server Enterprise Edition (5.2/6.3/7.0), IBM Tivoli Directory Server (5.2/6.1/6.3), Oracle Internet Directory, OpenLDAP Experience Identity & Access Management Engineer (LDAP Architect, TIM, TAM) The Guardian Life Insurance Company of America August 2011  – Present (4 years 1 month) Greater New York City Area LDAP Architect @ AT&T AT&T October 2010  –  February 2012  (1 year 5 months) Greater Atlanta Area Senior Systems Engineer / Tech Lead - Client UPS IBM August 2009  –  October 2010  (1 year 3 months) Tivoli IDM LDAP Architect IBM January 2009  –  August 2009  (8 months) Senior Systems Engineer / Tech Lead - Client Walmart IBM January 2008  –  December 2008  (1 year) Project Lead / Senior Systems Developer - Client Citigroup IBM January 2007  –  December 2007  (1 year) Tampa/St. Petersburg, Florida Area Tech lead / Senior Systems Architect IBM Tivoli Software June 2004  –  December 2006  (2 years 7 months) Austin, Texas Area Systems Engineer / Developer @ IBM Software Labs IBM Tivoli Software June 2003  –  May 2004  (1 year) Austin, Texas Area Project Trainee / Developer @ IBM Software Labs IBM Tivoli Software January 2002  –  March 2003  (1 year 3 months) Identity & Access Management Engineer (LDAP Architect, TIM, TAM) The Guardian Life Insurance Company of America August 2011  – Present (4 years 1 month) Greater New York City Area Identity & Access Management Engineer (LDAP Architect, TIM, TAM) The Guardian Life Insurance Company of America August 2011  – Present (4 years 1 month) Greater New York City Area LDAP Architect @ AT&T AT&T October 2010  –  February 2012  (1 year 5 months) Greater Atlanta Area LDAP Architect @ AT&T AT&T October 2010  –  February 2012  (1 year 5 months) Greater Atlanta Area Senior Systems Engineer / Tech Lead - Client UPS IBM August 2009  –  October 2010  (1 year 3 months) Senior Systems Engineer / Tech Lead - Client UPS IBM August 2009  –  October 2010  (1 year 3 months) Tivoli IDM LDAP Architect IBM January 2009  –  August 2009  (8 months) Tivoli IDM LDAP Architect IBM January 2009  –  August 2009  (8 months) Senior Systems Engineer / Tech Lead - Client Walmart IBM January 2008  –  December 2008  (1 year) Senior Systems Engineer / Tech Lead - Client Walmart IBM January 2008  –  December 2008  (1 year) Project Lead / Senior Systems Developer - Client Citigroup IBM January 2007  –  December 2007  (1 year) Tampa/St. Petersburg, Florida Area Project Lead / Senior Systems Developer - Client Citigroup IBM January 2007  –  December 2007  (1 year) Tampa/St. Petersburg, Florida Area Tech lead / Senior Systems Architect IBM Tivoli Software June 2004  –  December 2006  (2 years 7 months) Austin, Texas Area Tech lead / Senior Systems Architect IBM Tivoli Software June 2004  –  December 2006  (2 years 7 months) Austin, Texas Area Systems Engineer / Developer @ IBM Software Labs IBM Tivoli Software June 2003  –  May 2004  (1 year) Austin, Texas Area Systems Engineer / Developer @ IBM Software Labs IBM Tivoli Software June 2003  –  May 2004  (1 year) Austin, Texas Area Project Trainee / Developer @ IBM Software Labs IBM Tivoli Software January 2002  –  March 2003  (1 year 3 months) Project Trainee / Developer @ IBM Software Labs IBM Tivoli Software January 2002  –  March 2003  (1 year 3 months) Skills OID Active Directory LDAP LDAP Administration Sun One LDAP Tivoli Directory Server Tivoli Access Manager Tivoli Identity Manager Identity Management Access Control... Unix Perl Java Enterprise Edition OpenLDAP Web Services Spring Hibernate Websphere IAM Directory Services Solaris WebSphere Application... Enterprise Software Weblogic Netcool SOA Middleware AIX DB2 IBM AIX WebSphere SDLC Oracle Security See 19+     See less Skills  OID Active Directory LDAP LDAP Administration Sun One LDAP Tivoli Directory Server Tivoli Access Manager Tivoli Identity Manager Identity Management Access Control... Unix Perl Java Enterprise Edition OpenLDAP Web Services Spring Hibernate Websphere IAM Directory Services Solaris WebSphere Application... Enterprise Software Weblogic Netcool SOA Middleware AIX DB2 IBM AIX WebSphere SDLC Oracle Security See 19+     See less OID Active Directory LDAP LDAP Administration Sun One LDAP Tivoli Directory Server Tivoli Access Manager Tivoli Identity Manager Identity Management Access Control... Unix Perl Java Enterprise Edition OpenLDAP Web Services Spring Hibernate Websphere IAM Directory Services Solaris WebSphere Application... Enterprise Software Weblogic Netcool SOA Middleware AIX DB2 IBM AIX WebSphere SDLC Oracle Security See 19+     See less OID Active Directory LDAP LDAP Administration Sun One LDAP Tivoli Directory Server Tivoli Access Manager Tivoli Identity Manager Identity Management Access Control... Unix Perl Java Enterprise Edition OpenLDAP Web Services Spring Hibernate Websphere IAM Directory Services Solaris WebSphere Application... Enterprise Software Weblogic Netcool SOA Middleware AIX DB2 IBM AIX WebSphere SDLC Oracle Security See 19+     See less ", "Summary I believe in creating quality, innovative, repeatable results based on pattern-driven approaches for high-end software solutions. I apply creative problem solving and organizing skills based on past, present and future approaches, in an agile manner, to ensure organizational proficiency in structuring work artifacts to accommodate changing business drivers.  \n \nI make difficult things easy to understand and use by distilling complexity into simplicity and creating a vision, projecting it throughout the organization and inspiring others in its delivery. My enthusiasm is centered on creating solutions for all stakeholders involved with the ability to bridge the gap between business and IT professionals in aligning strategic goals with tactical plans. \n \nMy specialties include: Business Intelligence, Service-Orientation and Service-Oriented Architecture, UML, Java, J2EE, Web Services, Relational and Big Data Databases, Data Architecture, Business Rule Management Systems, Business Process Management. Summary I believe in creating quality, innovative, repeatable results based on pattern-driven approaches for high-end software solutions. I apply creative problem solving and organizing skills based on past, present and future approaches, in an agile manner, to ensure organizational proficiency in structuring work artifacts to accommodate changing business drivers.  \n \nI make difficult things easy to understand and use by distilling complexity into simplicity and creating a vision, projecting it throughout the organization and inspiring others in its delivery. My enthusiasm is centered on creating solutions for all stakeholders involved with the ability to bridge the gap between business and IT professionals in aligning strategic goals with tactical plans. \n \nMy specialties include: Business Intelligence, Service-Orientation and Service-Oriented Architecture, UML, Java, J2EE, Web Services, Relational and Big Data Databases, Data Architecture, Business Rule Management Systems, Business Process Management. I believe in creating quality, innovative, repeatable results based on pattern-driven approaches for high-end software solutions. I apply creative problem solving and organizing skills based on past, present and future approaches, in an agile manner, to ensure organizational proficiency in structuring work artifacts to accommodate changing business drivers.  \n \nI make difficult things easy to understand and use by distilling complexity into simplicity and creating a vision, projecting it throughout the organization and inspiring others in its delivery. My enthusiasm is centered on creating solutions for all stakeholders involved with the ability to bridge the gap between business and IT professionals in aligning strategic goals with tactical plans. \n \nMy specialties include: Business Intelligence, Service-Orientation and Service-Oriented Architecture, UML, Java, J2EE, Web Services, Relational and Big Data Databases, Data Architecture, Business Rule Management Systems, Business Process Management. I believe in creating quality, innovative, repeatable results based on pattern-driven approaches for high-end software solutions. I apply creative problem solving and organizing skills based on past, present and future approaches, in an agile manner, to ensure organizational proficiency in structuring work artifacts to accommodate changing business drivers.  \n \nI make difficult things easy to understand and use by distilling complexity into simplicity and creating a vision, projecting it throughout the organization and inspiring others in its delivery. My enthusiasm is centered on creating solutions for all stakeholders involved with the ability to bridge the gap between business and IT professionals in aligning strategic goals with tactical plans. \n \nMy specialties include: Business Intelligence, Service-Orientation and Service-Oriented Architecture, UML, Java, J2EE, Web Services, Relational and Big Data Databases, Data Architecture, Business Rule Management Systems, Business Process Management. Experience Senior Systems Architect IBM June 2015  – Present (3 months) Huntsville, Alabama Supporting the U.S. Army Logistics Support Activity (LOGSA) command in designing and developing enterprise systems to support the war-fighter from Service Oriented Architectures to Business Intelligence solutions that run the gamete from executive-level users to the soldier in the field. Chief Solution Architect Brockwell Technologies, Inc. January 2014  –  June 2015  (1 year 6 months) Huntsville, AL Supporting the U.S. Army Logistics Support Activity (LOGSA) command in developing robust and mature Infrastructure as a Service (IaaS), Platform as a Service (PaaS), and Software as a Service (SaaS) environments necessary to drive model-driven development for cost-effective, goal-oriented and quality driven solutions. Associate Booz Allen Hamilton June 2010  –  December 2013  (3 years 7 months) Huntsville, AL Supporting the Army Materiel Command (AMC) CIO/CTO/G6 regarding Service-Oriented Computing, Enterprise Architecture, standards and technical directions to ensure success of interoperability and streamlined solutions moving into next generation modernization as a functioning subject matter expert for the Office of the Deputy Chief of Staff CIO/CTO/G6 HQ Army Material Command (AMC) in Huntsville, Alabama responsible for working with the CTO to create strategic directions for the next generation of the AMC enterprise as well as looking for opportunities to work at an enterprise level within and throughout the Department of Defense. SOA Architect Jacobs Technology October 2009  –  May 2010  (8 months) Huntsville, AL Accountable for assisting AMC organizations in moving into the “To Be” SOA technology by providing strategic and tactical direction necessary to realize core SOA value propositions. Providing detailed impact analysis centered on understanding the overall impact to the organization responsible for adherence to the AMC SOA Policy direction. Outlining organizational implementation responsibilities centered upon a Service-Oriented Maturity Model (SOMM), the utilization of a Lean SOA Engineering Process, an understanding of how a SOA Infrastructure can meet key SOA principles, and the use of interoperability standards. Chief Architect ComFrame January 2005  –  April 2009  (4 years 4 months) Chief Architect at ComFrame with extensive experience in Java/EE, service oriented architecture (SOA), web applications, and information management He has over 25 years experience in architecting and developing information systems that span the vertical and horizontal markets. He specializes in object-oriented solutions and migrating operational and legacy systems into component-based open system frameworks utilizing industry standards. He has experience in all phases of the Software Development Life Cycle (SDLC) as well as providing project leadership and mentoring. As a Chief Architect he works with clients to ensure that their products and solutions are designed and developed on reliable, extensible and flexible architectures utilizing industry best practices and technologies while integrating their Business and Information Technology (IT) department’s strategies and goals. Director SOA Enablement Engineering and Delivery (SE2D) ComFrame January 2005  –  April 2009  (4 years 4 months) Director of SOA Enablement Engineering and Delivery (SE2D) Center of Excellence (COE) providing proven software methodologies and tools to develop service-oriented solutions to be meet business and IT goals in diverse industries. Working with business and IT professionals he helps bridge the gaps in solving business problems through strategic goals and tactical plans, understanding the benefits, challenges and risks of using service-oriented modernization components and infrastructure service-oriented architectures. Senior Architect 2AB Inc. 1999  –  2004  (5 years) Strategic Consultant developing architectures, frameworks and guidelines for enabling distributed, enterprise-wide interoperability within and between organizations and organizational units.  \n \nQuality Assurance Engineer/Developer responsible for designing and developing an automated build/install process and GUI application for the core product lines ensuring adherence to internal quality standards and customer requirements. Software Development Specialist 3M Health Information Systems 1993  –  1999  (6 years) Key developer and architect on the 3M Care Innovation Suite of Enterprise Products which includes a Clinical Data Repository, Healthcare Data Dictionary and a Master Person Index. \n \nMember of the Advanced Technology Research Group charged with the research and recommendations for new technologies for existing and future products. \n \nMember of the Technical Steering Committee charged with providing technical leadership in the development of business cases for Information Technology Products and Services. Programmer III Intermountain Healthcare 1990  –  1993  (3 years) Joint development with 3M Health Information Systems in application/system design and development. Programmer Analyst University of Utah Hospitals and Clinics 1988  –  1990  (2 years) Responsible for the management of the integrated pharmacy subsystem and liaison for end-user’s of the system. Providing analysis and modeling of user requirements and turning requirements into system applications as well as providing strategic projections of system resources necessary to meet business objectives. Programmer University of Utah School of Medicine 1986  –  1987  (1 year) Accountable for the design and development of technical solutions to support research efforts of the epidemiology staff at the University Of Utah Hospital School Of Epidemiology working on the Down Winders Project. Senior Systems Architect IBM June 2015  – Present (3 months) Huntsville, Alabama Supporting the U.S. Army Logistics Support Activity (LOGSA) command in designing and developing enterprise systems to support the war-fighter from Service Oriented Architectures to Business Intelligence solutions that run the gamete from executive-level users to the soldier in the field. Senior Systems Architect IBM June 2015  – Present (3 months) Huntsville, Alabama Supporting the U.S. Army Logistics Support Activity (LOGSA) command in designing and developing enterprise systems to support the war-fighter from Service Oriented Architectures to Business Intelligence solutions that run the gamete from executive-level users to the soldier in the field. Chief Solution Architect Brockwell Technologies, Inc. January 2014  –  June 2015  (1 year 6 months) Huntsville, AL Supporting the U.S. Army Logistics Support Activity (LOGSA) command in developing robust and mature Infrastructure as a Service (IaaS), Platform as a Service (PaaS), and Software as a Service (SaaS) environments necessary to drive model-driven development for cost-effective, goal-oriented and quality driven solutions. Chief Solution Architect Brockwell Technologies, Inc. January 2014  –  June 2015  (1 year 6 months) Huntsville, AL Supporting the U.S. Army Logistics Support Activity (LOGSA) command in developing robust and mature Infrastructure as a Service (IaaS), Platform as a Service (PaaS), and Software as a Service (SaaS) environments necessary to drive model-driven development for cost-effective, goal-oriented and quality driven solutions. Associate Booz Allen Hamilton June 2010  –  December 2013  (3 years 7 months) Huntsville, AL Supporting the Army Materiel Command (AMC) CIO/CTO/G6 regarding Service-Oriented Computing, Enterprise Architecture, standards and technical directions to ensure success of interoperability and streamlined solutions moving into next generation modernization as a functioning subject matter expert for the Office of the Deputy Chief of Staff CIO/CTO/G6 HQ Army Material Command (AMC) in Huntsville, Alabama responsible for working with the CTO to create strategic directions for the next generation of the AMC enterprise as well as looking for opportunities to work at an enterprise level within and throughout the Department of Defense. Associate Booz Allen Hamilton June 2010  –  December 2013  (3 years 7 months) Huntsville, AL Supporting the Army Materiel Command (AMC) CIO/CTO/G6 regarding Service-Oriented Computing, Enterprise Architecture, standards and technical directions to ensure success of interoperability and streamlined solutions moving into next generation modernization as a functioning subject matter expert for the Office of the Deputy Chief of Staff CIO/CTO/G6 HQ Army Material Command (AMC) in Huntsville, Alabama responsible for working with the CTO to create strategic directions for the next generation of the AMC enterprise as well as looking for opportunities to work at an enterprise level within and throughout the Department of Defense. SOA Architect Jacobs Technology October 2009  –  May 2010  (8 months) Huntsville, AL Accountable for assisting AMC organizations in moving into the “To Be” SOA technology by providing strategic and tactical direction necessary to realize core SOA value propositions. Providing detailed impact analysis centered on understanding the overall impact to the organization responsible for adherence to the AMC SOA Policy direction. Outlining organizational implementation responsibilities centered upon a Service-Oriented Maturity Model (SOMM), the utilization of a Lean SOA Engineering Process, an understanding of how a SOA Infrastructure can meet key SOA principles, and the use of interoperability standards. SOA Architect Jacobs Technology October 2009  –  May 2010  (8 months) Huntsville, AL Accountable for assisting AMC organizations in moving into the “To Be” SOA technology by providing strategic and tactical direction necessary to realize core SOA value propositions. Providing detailed impact analysis centered on understanding the overall impact to the organization responsible for adherence to the AMC SOA Policy direction. Outlining organizational implementation responsibilities centered upon a Service-Oriented Maturity Model (SOMM), the utilization of a Lean SOA Engineering Process, an understanding of how a SOA Infrastructure can meet key SOA principles, and the use of interoperability standards. Chief Architect ComFrame January 2005  –  April 2009  (4 years 4 months) Chief Architect at ComFrame with extensive experience in Java/EE, service oriented architecture (SOA), web applications, and information management He has over 25 years experience in architecting and developing information systems that span the vertical and horizontal markets. He specializes in object-oriented solutions and migrating operational and legacy systems into component-based open system frameworks utilizing industry standards. He has experience in all phases of the Software Development Life Cycle (SDLC) as well as providing project leadership and mentoring. As a Chief Architect he works with clients to ensure that their products and solutions are designed and developed on reliable, extensible and flexible architectures utilizing industry best practices and technologies while integrating their Business and Information Technology (IT) department’s strategies and goals. Chief Architect ComFrame January 2005  –  April 2009  (4 years 4 months) Chief Architect at ComFrame with extensive experience in Java/EE, service oriented architecture (SOA), web applications, and information management He has over 25 years experience in architecting and developing information systems that span the vertical and horizontal markets. He specializes in object-oriented solutions and migrating operational and legacy systems into component-based open system frameworks utilizing industry standards. He has experience in all phases of the Software Development Life Cycle (SDLC) as well as providing project leadership and mentoring. As a Chief Architect he works with clients to ensure that their products and solutions are designed and developed on reliable, extensible and flexible architectures utilizing industry best practices and technologies while integrating their Business and Information Technology (IT) department’s strategies and goals. Director SOA Enablement Engineering and Delivery (SE2D) ComFrame January 2005  –  April 2009  (4 years 4 months) Director of SOA Enablement Engineering and Delivery (SE2D) Center of Excellence (COE) providing proven software methodologies and tools to develop service-oriented solutions to be meet business and IT goals in diverse industries. Working with business and IT professionals he helps bridge the gaps in solving business problems through strategic goals and tactical plans, understanding the benefits, challenges and risks of using service-oriented modernization components and infrastructure service-oriented architectures. Director SOA Enablement Engineering and Delivery (SE2D) ComFrame January 2005  –  April 2009  (4 years 4 months) Director of SOA Enablement Engineering and Delivery (SE2D) Center of Excellence (COE) providing proven software methodologies and tools to develop service-oriented solutions to be meet business and IT goals in diverse industries. Working with business and IT professionals he helps bridge the gaps in solving business problems through strategic goals and tactical plans, understanding the benefits, challenges and risks of using service-oriented modernization components and infrastructure service-oriented architectures. Senior Architect 2AB Inc. 1999  –  2004  (5 years) Strategic Consultant developing architectures, frameworks and guidelines for enabling distributed, enterprise-wide interoperability within and between organizations and organizational units.  \n \nQuality Assurance Engineer/Developer responsible for designing and developing an automated build/install process and GUI application for the core product lines ensuring adherence to internal quality standards and customer requirements. Senior Architect 2AB Inc. 1999  –  2004  (5 years) Strategic Consultant developing architectures, frameworks and guidelines for enabling distributed, enterprise-wide interoperability within and between organizations and organizational units.  \n \nQuality Assurance Engineer/Developer responsible for designing and developing an automated build/install process and GUI application for the core product lines ensuring adherence to internal quality standards and customer requirements. Software Development Specialist 3M Health Information Systems 1993  –  1999  (6 years) Key developer and architect on the 3M Care Innovation Suite of Enterprise Products which includes a Clinical Data Repository, Healthcare Data Dictionary and a Master Person Index. \n \nMember of the Advanced Technology Research Group charged with the research and recommendations for new technologies for existing and future products. \n \nMember of the Technical Steering Committee charged with providing technical leadership in the development of business cases for Information Technology Products and Services. Software Development Specialist 3M Health Information Systems 1993  –  1999  (6 years) Key developer and architect on the 3M Care Innovation Suite of Enterprise Products which includes a Clinical Data Repository, Healthcare Data Dictionary and a Master Person Index. \n \nMember of the Advanced Technology Research Group charged with the research and recommendations for new technologies for existing and future products. \n \nMember of the Technical Steering Committee charged with providing technical leadership in the development of business cases for Information Technology Products and Services. Programmer III Intermountain Healthcare 1990  –  1993  (3 years) Joint development with 3M Health Information Systems in application/system design and development. Programmer III Intermountain Healthcare 1990  –  1993  (3 years) Joint development with 3M Health Information Systems in application/system design and development. Programmer Analyst University of Utah Hospitals and Clinics 1988  –  1990  (2 years) Responsible for the management of the integrated pharmacy subsystem and liaison for end-user’s of the system. Providing analysis and modeling of user requirements and turning requirements into system applications as well as providing strategic projections of system resources necessary to meet business objectives. Programmer Analyst University of Utah Hospitals and Clinics 1988  –  1990  (2 years) Responsible for the management of the integrated pharmacy subsystem and liaison for end-user’s of the system. Providing analysis and modeling of user requirements and turning requirements into system applications as well as providing strategic projections of system resources necessary to meet business objectives. Programmer University of Utah School of Medicine 1986  –  1987  (1 year) Accountable for the design and development of technical solutions to support research efforts of the epidemiology staff at the University Of Utah Hospital School Of Epidemiology working on the Down Winders Project. Programmer University of Utah School of Medicine 1986  –  1987  (1 year) Accountable for the design and development of technical solutions to support research efforts of the epidemiology staff at the University Of Utah Hospital School Of Epidemiology working on the Down Winders Project. Skills SOA Web Services Agile Methodologies Architecture Software Development UML Enterprise Software SDLC Java Enterprise Edition Enterprise Architecture Business Process Java Design Patterns Requirements Analysis Architectures Business Intelligence Cloud Computing MySQL SaaS XML Business Analysis Software Engineering Strategy Testing Distributed Systems Object Oriented Design SQL J2EE Agile Business Process... Model-Driven Development Time Management Requirements Management Business Management DoDAF SySML Mental Organization Physical Organization Collaboration Tools See 24+     See less Skills  SOA Web Services Agile Methodologies Architecture Software Development UML Enterprise Software SDLC Java Enterprise Edition Enterprise Architecture Business Process Java Design Patterns Requirements Analysis Architectures Business Intelligence Cloud Computing MySQL SaaS XML Business Analysis Software Engineering Strategy Testing Distributed Systems Object Oriented Design SQL J2EE Agile Business Process... Model-Driven Development Time Management Requirements Management Business Management DoDAF SySML Mental Organization Physical Organization Collaboration Tools See 24+     See less SOA Web Services Agile Methodologies Architecture Software Development UML Enterprise Software SDLC Java Enterprise Edition Enterprise Architecture Business Process Java Design Patterns Requirements Analysis Architectures Business Intelligence Cloud Computing MySQL SaaS XML Business Analysis Software Engineering Strategy Testing Distributed Systems Object Oriented Design SQL J2EE Agile Business Process... Model-Driven Development Time Management Requirements Management Business Management DoDAF SySML Mental Organization Physical Organization Collaboration Tools See 24+     See less SOA Web Services Agile Methodologies Architecture Software Development UML Enterprise Software SDLC Java Enterprise Edition Enterprise Architecture Business Process Java Design Patterns Requirements Analysis Architectures Business Intelligence Cloud Computing MySQL SaaS XML Business Analysis Software Engineering Strategy Testing Distributed Systems Object Oriented Design SQL J2EE Agile Business Process... Model-Driven Development Time Management Requirements Management Business Management DoDAF SySML Mental Organization Physical Organization Collaboration Tools See 24+     See less Education Weber State University BS,  Computer Science 1981  – 1986 I started my higher education at the University of Utah and while a fine institution they were to steeped in theory. I transferred to Weber State University where I was engaged with a community of individuals attending college to solve problems, including many folks from Hill Air Force Base. This provided the opportunity to see how computer science was actually getting used in industry. I feel this made for a much better education and helped me better understand how to couple business with IT. University of Utah Computer Science Weber State University BS,  Computer Science 1981  – 1986 I started my higher education at the University of Utah and while a fine institution they were to steeped in theory. I transferred to Weber State University where I was engaged with a community of individuals attending college to solve problems, including many folks from Hill Air Force Base. This provided the opportunity to see how computer science was actually getting used in industry. I feel this made for a much better education and helped me better understand how to couple business with IT. Weber State University BS,  Computer Science 1981  – 1986 I started my higher education at the University of Utah and while a fine institution they were to steeped in theory. I transferred to Weber State University where I was engaged with a community of individuals attending college to solve problems, including many folks from Hill Air Force Base. This provided the opportunity to see how computer science was actually getting used in industry. I feel this made for a much better education and helped me better understand how to couple business with IT. Weber State University BS,  Computer Science 1981  – 1986 I started my higher education at the University of Utah and while a fine institution they were to steeped in theory. I transferred to Weber State University where I was engaged with a community of individuals attending college to solve problems, including many folks from Hill Air Force Base. This provided the opportunity to see how computer science was actually getting used in industry. I feel this made for a much better education and helped me better understand how to couple business with IT. University of Utah Computer Science University of Utah Computer Science University of Utah Computer Science ", "Summary Responsible for creating an over system wide IT Architecture solution for US Navy. Creating Business casses for new technologies and driving deliverables.  \n \nWindows  \nUnix \nCisco and other Networking Technologies \nSecurity Specialties:Windows Networking and Design \nUnix Network and Design \nSystems Analysis Summary Responsible for creating an over system wide IT Architecture solution for US Navy. Creating Business casses for new technologies and driving deliverables.  \n \nWindows  \nUnix \nCisco and other Networking Technologies \nSecurity Specialties:Windows Networking and Design \nUnix Network and Design \nSystems Analysis Responsible for creating an over system wide IT Architecture solution for US Navy. Creating Business casses for new technologies and driving deliverables.  \n \nWindows  \nUnix \nCisco and other Networking Technologies \nSecurity Specialties:Windows Networking and Design \nUnix Network and Design \nSystems Analysis Responsible for creating an over system wide IT Architecture solution for US Navy. Creating Business casses for new technologies and driving deliverables.  \n \nWindows  \nUnix \nCisco and other Networking Technologies \nSecurity Specialties:Windows Networking and Design \nUnix Network and Design \nSystems Analysis Experience Systems Engineer Hirsch Electronics 2008  –  2009  (1 year) Serve as technical architect and Project Manager on Hirsch Electronics product technologies. Complex project management and engineering with extensive use of client/server, networking, Windows 2000/2003 Server and Microsoft client products, Network Load Balancing, MS Cluster Server/Multi-vendor Cluster and SAN implementations, DNS, DHCP and other related areas with troubleshooting at the expert level within large network environments. Also responsible for architecting and developing technology that would could be used in to expand existing infrastructures with the intent of decreasing the total cost of owner ship and increasing the return on investment. In addition, leverage knowledge of TCP/IP and other protocols including use of troubleshooting tools - scripting, resource kit diagnostic tools and packet sniffers and/or Netmon. Systems involve physical access control, video, and security solutions. Strong problem solving skills, effective learning skills, and possess the ability to work well in a team environment. Technologies Used: Windows desktop Operating Systems, Windows Server Operating Systems, Active Directory (architecture, design, disaster recovery and troubleshooting), SQL, IIS, ISA , MOF/ITIL, identity management systems, government mandates (HSPD-12, FISMA, FIPS-201), Terminal Services, storage replication, network fault tolerance, network security, enterprise software system interoperation. Systems Architect The Irvine Company May 2007  –  June 2008  (1 year 2 months) Systems deisgn and Engineering. Senior Systems Architect IBM January 2006  –  February 2007  (1 year 2 months) Responsible for Systems Architecture and Analysis in Windows and Unix Enviorments. Sr. Systems Architect The Hana Group January 2004  –  January 2006  (2 years 1 month) Serve as technical architect and Project Manager on Hirsch Electronics product technologies. Complex project management and engineering with extensive use of client/server, networking, Windows 2000/2003 Server and Microsoft client products, Network Load Balancing, MS Cluster Server/Multi-vendor Cluster and SAN implementations, DNS, DHCP and other related areas with troubleshooting at the expert level within large network environments. Also responsible for architecting and developing technology that would could be used in to expand existing infrastructures with the intent of decreasing the total cost of owner ship and increasing the return on investment. In addition, leverage knowledge of TCP/IP and other protocols including use of troubleshooting tools - scripting, resource kit diagnostic tools and packet sniffers and/or Netmon. Systems involve physical access control, video, and security solutions. Strong problem solving skills, effective learning skills, and possess the ability to work well in a team environment. Technologies Used: Windows desktop Operating Systems, Windows Server Operating Systems, Active Directory (architecture, design, disaster recovery and troubleshooting), SQL, IIS, ISA , MOF/ITIL, identity management systems, government mandates (HSPD-12, FISMA, FIPS-201), Terminal Services, storage replication, network fault tolerance, network security, enterprise software system interoperation. Systems Engineer Hirsch Electronics 2008  –  2009  (1 year) Serve as technical architect and Project Manager on Hirsch Electronics product technologies. Complex project management and engineering with extensive use of client/server, networking, Windows 2000/2003 Server and Microsoft client products, Network Load Balancing, MS Cluster Server/Multi-vendor Cluster and SAN implementations, DNS, DHCP and other related areas with troubleshooting at the expert level within large network environments. Also responsible for architecting and developing technology that would could be used in to expand existing infrastructures with the intent of decreasing the total cost of owner ship and increasing the return on investment. In addition, leverage knowledge of TCP/IP and other protocols including use of troubleshooting tools - scripting, resource kit diagnostic tools and packet sniffers and/or Netmon. Systems involve physical access control, video, and security solutions. Strong problem solving skills, effective learning skills, and possess the ability to work well in a team environment. Technologies Used: Windows desktop Operating Systems, Windows Server Operating Systems, Active Directory (architecture, design, disaster recovery and troubleshooting), SQL, IIS, ISA , MOF/ITIL, identity management systems, government mandates (HSPD-12, FISMA, FIPS-201), Terminal Services, storage replication, network fault tolerance, network security, enterprise software system interoperation. Systems Engineer Hirsch Electronics 2008  –  2009  (1 year) Serve as technical architect and Project Manager on Hirsch Electronics product technologies. Complex project management and engineering with extensive use of client/server, networking, Windows 2000/2003 Server and Microsoft client products, Network Load Balancing, MS Cluster Server/Multi-vendor Cluster and SAN implementations, DNS, DHCP and other related areas with troubleshooting at the expert level within large network environments. Also responsible for architecting and developing technology that would could be used in to expand existing infrastructures with the intent of decreasing the total cost of owner ship and increasing the return on investment. In addition, leverage knowledge of TCP/IP and other protocols including use of troubleshooting tools - scripting, resource kit diagnostic tools and packet sniffers and/or Netmon. Systems involve physical access control, video, and security solutions. Strong problem solving skills, effective learning skills, and possess the ability to work well in a team environment. Technologies Used: Windows desktop Operating Systems, Windows Server Operating Systems, Active Directory (architecture, design, disaster recovery and troubleshooting), SQL, IIS, ISA , MOF/ITIL, identity management systems, government mandates (HSPD-12, FISMA, FIPS-201), Terminal Services, storage replication, network fault tolerance, network security, enterprise software system interoperation. Systems Architect The Irvine Company May 2007  –  June 2008  (1 year 2 months) Systems deisgn and Engineering. Systems Architect The Irvine Company May 2007  –  June 2008  (1 year 2 months) Systems deisgn and Engineering. Senior Systems Architect IBM January 2006  –  February 2007  (1 year 2 months) Responsible for Systems Architecture and Analysis in Windows and Unix Enviorments. Senior Systems Architect IBM January 2006  –  February 2007  (1 year 2 months) Responsible for Systems Architecture and Analysis in Windows and Unix Enviorments. Sr. Systems Architect The Hana Group January 2004  –  January 2006  (2 years 1 month) Serve as technical architect and Project Manager on Hirsch Electronics product technologies. Complex project management and engineering with extensive use of client/server, networking, Windows 2000/2003 Server and Microsoft client products, Network Load Balancing, MS Cluster Server/Multi-vendor Cluster and SAN implementations, DNS, DHCP and other related areas with troubleshooting at the expert level within large network environments. Also responsible for architecting and developing technology that would could be used in to expand existing infrastructures with the intent of decreasing the total cost of owner ship and increasing the return on investment. In addition, leverage knowledge of TCP/IP and other protocols including use of troubleshooting tools - scripting, resource kit diagnostic tools and packet sniffers and/or Netmon. Systems involve physical access control, video, and security solutions. Strong problem solving skills, effective learning skills, and possess the ability to work well in a team environment. Technologies Used: Windows desktop Operating Systems, Windows Server Operating Systems, Active Directory (architecture, design, disaster recovery and troubleshooting), SQL, IIS, ISA , MOF/ITIL, identity management systems, government mandates (HSPD-12, FISMA, FIPS-201), Terminal Services, storage replication, network fault tolerance, network security, enterprise software system interoperation. Sr. Systems Architect The Hana Group January 2004  –  January 2006  (2 years 1 month) Serve as technical architect and Project Manager on Hirsch Electronics product technologies. Complex project management and engineering with extensive use of client/server, networking, Windows 2000/2003 Server and Microsoft client products, Network Load Balancing, MS Cluster Server/Multi-vendor Cluster and SAN implementations, DNS, DHCP and other related areas with troubleshooting at the expert level within large network environments. Also responsible for architecting and developing technology that would could be used in to expand existing infrastructures with the intent of decreasing the total cost of owner ship and increasing the return on investment. In addition, leverage knowledge of TCP/IP and other protocols including use of troubleshooting tools - scripting, resource kit diagnostic tools and packet sniffers and/or Netmon. Systems involve physical access control, video, and security solutions. Strong problem solving skills, effective learning skills, and possess the ability to work well in a team environment. Technologies Used: Windows desktop Operating Systems, Windows Server Operating Systems, Active Directory (architecture, design, disaster recovery and troubleshooting), SQL, IIS, ISA , MOF/ITIL, identity management systems, government mandates (HSPD-12, FISMA, FIPS-201), Terminal Services, storage replication, network fault tolerance, network security, enterprise software system interoperation. Skills Systems Analysis Unix Enterprise Architecture Security Architecture Windows Networking Cisco Technologies Disaster Recovery ITIL VMware Virtualization Active Directory Cloud Computing Microsoft SQL Server Integration Data Center Requirements Analysis SharePoint Linux SDLC Troubleshooting Network Security Project Management Program Management Solution Architecture TCP/IP Windows Server SQL Process Improvement Technical Support Enterprise Software DNS Testing Network Architecture IIS Visio IT Strategy Software Development Infrastructure Information Technology Servers Vendor Management Databases IT Management SOA Software Project... Citrix Operating Systems Business Intelligence See 35+     See less Skills  Systems Analysis Unix Enterprise Architecture Security Architecture Windows Networking Cisco Technologies Disaster Recovery ITIL VMware Virtualization Active Directory Cloud Computing Microsoft SQL Server Integration Data Center Requirements Analysis SharePoint Linux SDLC Troubleshooting Network Security Project Management Program Management Solution Architecture TCP/IP Windows Server SQL Process Improvement Technical Support Enterprise Software DNS Testing Network Architecture IIS Visio IT Strategy Software Development Infrastructure Information Technology Servers Vendor Management Databases IT Management SOA Software Project... Citrix Operating Systems Business Intelligence See 35+     See less Systems Analysis Unix Enterprise Architecture Security Architecture Windows Networking Cisco Technologies Disaster Recovery ITIL VMware Virtualization Active Directory Cloud Computing Microsoft SQL Server Integration Data Center Requirements Analysis SharePoint Linux SDLC Troubleshooting Network Security Project Management Program Management Solution Architecture TCP/IP Windows Server SQL Process Improvement Technical Support Enterprise Software DNS Testing Network Architecture IIS Visio IT Strategy Software Development Infrastructure Information Technology Servers Vendor Management Databases IT Management SOA Software Project... Citrix Operating Systems Business Intelligence See 35+     See less Systems Analysis Unix Enterprise Architecture Security Architecture Windows Networking Cisco Technologies Disaster Recovery ITIL VMware Virtualization Active Directory Cloud Computing Microsoft SQL Server Integration Data Center Requirements Analysis SharePoint Linux SDLC Troubleshooting Network Security Project Management Program Management Solution Architecture TCP/IP Windows Server SQL Process Improvement Technical Support Enterprise Software DNS Testing Network Architecture IIS Visio IT Strategy Software Development Infrastructure Information Technology Servers Vendor Management Databases IT Management SOA Software Project... Citrix Operating Systems Business Intelligence See 35+     See less Education University of Phoenix Bachelor of Applied Science (B.A.Sc.) 2011  – 2013 University of California, Los Angeles BS 1993  – 1997 Grand Canyon University University of Phoenix Bachelor of Applied Science (B.A.Sc.) 2011  – 2013 University of Phoenix Bachelor of Applied Science (B.A.Sc.) 2011  – 2013 University of Phoenix Bachelor of Applied Science (B.A.Sc.) 2011  – 2013 University of California, Los Angeles BS 1993  – 1997 University of California, Los Angeles BS 1993  – 1997 University of California, Los Angeles BS 1993  – 1997 Grand Canyon University Grand Canyon University Grand Canyon University ", "Experience Release QA Engineer Fortinet January 2014  – Present (1 year 8 months) Millerton, New York Performing a mix of network management and quality assurance at Coyote Point Systems, a subsidiary of Fortinet, Inc. Release QA Engineer Fortinet January 2014  – Present (1 year 8 months) Millerton, New York Performing a mix of network management and quality assurance at Coyote Point Systems, a subsidiary of Fortinet, Inc. Release QA Engineer Fortinet January 2014  – Present (1 year 8 months) Millerton, New York Performing a mix of network management and quality assurance at Coyote Point Systems, a subsidiary of Fortinet, Inc. Languages English Native or bilingual proficiency Spanish Limited working proficiency English Native or bilingual proficiency Spanish Limited working proficiency English Native or bilingual proficiency Spanish Limited working proficiency Native or bilingual proficiency Limited working proficiency Skills Unix Software Development Linux Shell Scripting Software Engineering Technical Solutions... System Architecture Information Security Computer Security AIX Virtual Collaboration Cloud Computing EDA Operating Systems Solution Architecture IT Strategy Enterprise Architecture IT Solutions Product Development Project Management Project Planning Java Integration Product Design Technical Sales... Web Applications Preparation of Business... IBM Servers High Performance... SOA Software Design Grid Computing Distributed File Systems LoadLeveler Platform LSF X Window System Business Process Java Enterprise Edition Object Oriented Design JavaScript Hardware Solaris Programming Unix Shell Scripting XML Technical Leadership Web Services Security Agile Methodologies Software Project... See 35+     See less Skills  Unix Software Development Linux Shell Scripting Software Engineering Technical Solutions... System Architecture Information Security Computer Security AIX Virtual Collaboration Cloud Computing EDA Operating Systems Solution Architecture IT Strategy Enterprise Architecture IT Solutions Product Development Project Management Project Planning Java Integration Product Design Technical Sales... Web Applications Preparation of Business... IBM Servers High Performance... SOA Software Design Grid Computing Distributed File Systems LoadLeveler Platform LSF X Window System Business Process Java Enterprise Edition Object Oriented Design JavaScript Hardware Solaris Programming Unix Shell Scripting XML Technical Leadership Web Services Security Agile Methodologies Software Project... See 35+     See less Unix Software Development Linux Shell Scripting Software Engineering Technical Solutions... System Architecture Information Security Computer Security AIX Virtual Collaboration Cloud Computing EDA Operating Systems Solution Architecture IT Strategy Enterprise Architecture IT Solutions Product Development Project Management Project Planning Java Integration Product Design Technical Sales... Web Applications Preparation of Business... IBM Servers High Performance... SOA Software Design Grid Computing Distributed File Systems LoadLeveler Platform LSF X Window System Business Process Java Enterprise Edition Object Oriented Design JavaScript Hardware Solaris Programming Unix Shell Scripting XML Technical Leadership Web Services Security Agile Methodologies Software Project... See 35+     See less Unix Software Development Linux Shell Scripting Software Engineering Technical Solutions... System Architecture Information Security Computer Security AIX Virtual Collaboration Cloud Computing EDA Operating Systems Solution Architecture IT Strategy Enterprise Architecture IT Solutions Product Development Project Management Project Planning Java Integration Product Design Technical Sales... Web Applications Preparation of Business... IBM Servers High Performance... SOA Software Design Grid Computing Distributed File Systems LoadLeveler Platform LSF X Window System Business Process Java Enterprise Edition Object Oriented Design JavaScript Hardware Solaris Programming Unix Shell Scripting XML Technical Leadership Web Services Security Agile Methodologies Software Project... See 35+     See less Education National Technological University Master of Science (M.S.) 1993  – 1998 University of Illinois at Urbana-Champaign Bachelor of Science (B.S.) 1980  – 1984 National Technological University Master of Science (M.S.) 1993  – 1998 National Technological University Master of Science (M.S.) 1993  – 1998 National Technological University Master of Science (M.S.) 1993  – 1998 University of Illinois at Urbana-Champaign Bachelor of Science (B.S.) 1980  – 1984 University of Illinois at Urbana-Champaign Bachelor of Science (B.S.) 1980  – 1984 University of Illinois at Urbana-Champaign Bachelor of Science (B.S.) 1980  – 1984 Honors & Awards OpenAccess Contribution Award Silicon Integration Initiative, Inc. (Si2) July 2012 OpenAccess is recognized as an industry standard and technology enabler for many semiconductor and engineering design automation (EDA) companies. ( https://www.si2.org/www_site_map.php#OAC ) Upon the 10th anniversay of the OpenAccess, I was recognized as one of the thought leaders who helped shape its destiny and ensure its future success. Eminence and Excellence Award IBM July 2011 IBM Restricted Stock Options IBM November 2007 Invention Achievement Award IBM June 2002 IBM Stock Options IBM June 2002 IBM Stock Options IBM June 2001 IBM Stock Options IBM July 2000 Outstanding Technical Achievement Award IBM December 1999 Invention Achievement Award IBM July 1997 OpenAccess Contribution Award Silicon Integration Initiative, Inc. (Si2) July 2012 OpenAccess is recognized as an industry standard and technology enabler for many semiconductor and engineering design automation (EDA) companies. ( https://www.si2.org/www_site_map.php#OAC ) Upon the 10th anniversay of the OpenAccess, I was recognized as one of the thought leaders who helped shape its destiny and ensure its future success. OpenAccess Contribution Award Silicon Integration Initiative, Inc. (Si2) July 2012 OpenAccess is recognized as an industry standard and technology enabler for many semiconductor and engineering design automation (EDA) companies. ( https://www.si2.org/www_site_map.php#OAC ) Upon the 10th anniversay of the OpenAccess, I was recognized as one of the thought leaders who helped shape its destiny and ensure its future success. OpenAccess Contribution Award Silicon Integration Initiative, Inc. (Si2) July 2012 OpenAccess is recognized as an industry standard and technology enabler for many semiconductor and engineering design automation (EDA) companies. ( https://www.si2.org/www_site_map.php#OAC ) Upon the 10th anniversay of the OpenAccess, I was recognized as one of the thought leaders who helped shape its destiny and ensure its future success. Eminence and Excellence Award IBM July 2011 Eminence and Excellence Award IBM July 2011 Eminence and Excellence Award IBM July 2011 IBM Restricted Stock Options IBM November 2007 IBM Restricted Stock Options IBM November 2007 IBM Restricted Stock Options IBM November 2007 Invention Achievement Award IBM June 2002 Invention Achievement Award IBM June 2002 Invention Achievement Award IBM June 2002 IBM Stock Options IBM June 2002 IBM Stock Options IBM June 2002 IBM Stock Options IBM June 2002 IBM Stock Options IBM June 2001 IBM Stock Options IBM June 2001 IBM Stock Options IBM June 2001 IBM Stock Options IBM July 2000 IBM Stock Options IBM July 2000 IBM Stock Options IBM July 2000 Outstanding Technical Achievement Award IBM December 1999 Outstanding Technical Achievement Award IBM December 1999 Outstanding Technical Achievement Award IBM December 1999 Invention Achievement Award IBM July 1997 Invention Achievement Award IBM July 1997 Invention Achievement Award IBM July 1997 ", "Summary •\tMore than 15 years of experience in the Technology industry with the last 12 in commercial positions, varying from Regional Manager to Director. \n•\tConsistent achiever of sales targets and proven business track record. \n•\tStrong business development acumen and a clear understanding of business strategies, issues and drivers in the industry. \n•\tCommitted team player whilst being highly self motivated. \n•\tConfident, articulate and persuasive communicator at all levels. \n•\tExtensive knowledge of the EMEA region. \n \nAn industrious, dynamic Sales Manager/Director with a demonstrable track record of over achievement. \nA commercially focused business professional that believes in exceeding expectations, by delivering. Summary •\tMore than 15 years of experience in the Technology industry with the last 12 in commercial positions, varying from Regional Manager to Director. \n•\tConsistent achiever of sales targets and proven business track record. \n•\tStrong business development acumen and a clear understanding of business strategies, issues and drivers in the industry. \n•\tCommitted team player whilst being highly self motivated. \n•\tConfident, articulate and persuasive communicator at all levels. \n•\tExtensive knowledge of the EMEA region. \n \nAn industrious, dynamic Sales Manager/Director with a demonstrable track record of over achievement. \nA commercially focused business professional that believes in exceeding expectations, by delivering. •\tMore than 15 years of experience in the Technology industry with the last 12 in commercial positions, varying from Regional Manager to Director. \n•\tConsistent achiever of sales targets and proven business track record. \n•\tStrong business development acumen and a clear understanding of business strategies, issues and drivers in the industry. \n•\tCommitted team player whilst being highly self motivated. \n•\tConfident, articulate and persuasive communicator at all levels. \n•\tExtensive knowledge of the EMEA region. \n \nAn industrious, dynamic Sales Manager/Director with a demonstrable track record of over achievement. \nA commercially focused business professional that believes in exceeding expectations, by delivering. •\tMore than 15 years of experience in the Technology industry with the last 12 in commercial positions, varying from Regional Manager to Director. \n•\tConsistent achiever of sales targets and proven business track record. \n•\tStrong business development acumen and a clear understanding of business strategies, issues and drivers in the industry. \n•\tCommitted team player whilst being highly self motivated. \n•\tConfident, articulate and persuasive communicator at all levels. \n•\tExtensive knowledge of the EMEA region. \n \nAn industrious, dynamic Sales Manager/Director with a demonstrable track record of over achievement. \nA commercially focused business professional that believes in exceeding expectations, by delivering. Experience EMEA Director Sun Software Integration Oracle February 2010  –  September 2011  (1 year 8 months) EMEA Sales Director - Global SW Practice Sun Microsystems November 2006  –  September 2010  (3 years 11 months) Regional Sales Director – Southern EMEA Atempo April 2004  –  October 2006  (2 years 7 months) Madrid Area, Spain Magic Solutions - Regional Manager of Southern Europe, North & Central Africa BMC Software December 2002  –  April 2004  (1 year 5 months) United Kingdom Magic Solutions - Channel Account Manager Magic Solutions RO-EMEA Network Associates, Inc. November 2001  –  December 2002  (1 year 2 months) United Kingdom Pan European Commercial & Technical Account Manager Netstore November 1999  –  November 2001  (2 years 1 month) United Kingdom Business Manager Dimencia Ltd. March 1998  –  November 1999  (1 year 9 months) United Kingdom Senior Systems Architect IBM January 1996  –  March 1998  (2 years 3 months) United Kingdom Systems Trainer & Consultant Anthony Cook Associates January 1993  –  January 1996  (3 years 1 month) United Kingdom EMEA Director Sun Software Integration Oracle February 2010  –  September 2011  (1 year 8 months) EMEA Director Sun Software Integration Oracle February 2010  –  September 2011  (1 year 8 months) EMEA Sales Director - Global SW Practice Sun Microsystems November 2006  –  September 2010  (3 years 11 months) EMEA Sales Director - Global SW Practice Sun Microsystems November 2006  –  September 2010  (3 years 11 months) Regional Sales Director – Southern EMEA Atempo April 2004  –  October 2006  (2 years 7 months) Madrid Area, Spain Regional Sales Director – Southern EMEA Atempo April 2004  –  October 2006  (2 years 7 months) Madrid Area, Spain Magic Solutions - Regional Manager of Southern Europe, North & Central Africa BMC Software December 2002  –  April 2004  (1 year 5 months) United Kingdom Magic Solutions - Regional Manager of Southern Europe, North & Central Africa BMC Software December 2002  –  April 2004  (1 year 5 months) United Kingdom Magic Solutions - Channel Account Manager Magic Solutions RO-EMEA Network Associates, Inc. November 2001  –  December 2002  (1 year 2 months) United Kingdom Magic Solutions - Channel Account Manager Magic Solutions RO-EMEA Network Associates, Inc. November 2001  –  December 2002  (1 year 2 months) United Kingdom Pan European Commercial & Technical Account Manager Netstore November 1999  –  November 2001  (2 years 1 month) United Kingdom Pan European Commercial & Technical Account Manager Netstore November 1999  –  November 2001  (2 years 1 month) United Kingdom Business Manager Dimencia Ltd. March 1998  –  November 1999  (1 year 9 months) United Kingdom Business Manager Dimencia Ltd. March 1998  –  November 1999  (1 year 9 months) United Kingdom Senior Systems Architect IBM January 1996  –  March 1998  (2 years 3 months) United Kingdom Senior Systems Architect IBM January 1996  –  March 1998  (2 years 3 months) United Kingdom Systems Trainer & Consultant Anthony Cook Associates January 1993  –  January 1996  (3 years 1 month) United Kingdom Systems Trainer & Consultant Anthony Cook Associates January 1993  –  January 1996  (3 years 1 month) United Kingdom Languages English Native or bilingual proficiency Spanish Native or bilingual proficiency Galician Professional working proficiency Portuguese Professional working proficiency Italian Professional working proficiency English Native or bilingual proficiency Spanish Native or bilingual proficiency Galician Professional working proficiency Portuguese Professional working proficiency Italian Professional working proficiency English Native or bilingual proficiency Spanish Native or bilingual proficiency Galician Professional working proficiency Portuguese Professional working proficiency Italian Professional working proficiency Native or bilingual proficiency Native or bilingual proficiency Professional working proficiency Professional working proficiency Professional working proficiency Skills Cloud Computing Strategic Partnerships Enterprise Software Channel Business Development Go-to-market Strategy Professional Services Solution Selling Pre-sales SaaS Channel Partners Outsourcing Account Management Business Intelligence Integration Strategy CRM Security Selling Software Industry Sales Management Business Alliances Leadership Partner Management Sales Operations Sales Sales Enablement Management Business Planning Start-ups Sales Process Lead Generation See 17+     See less Skills  Cloud Computing Strategic Partnerships Enterprise Software Channel Business Development Go-to-market Strategy Professional Services Solution Selling Pre-sales SaaS Channel Partners Outsourcing Account Management Business Intelligence Integration Strategy CRM Security Selling Software Industry Sales Management Business Alliances Leadership Partner Management Sales Operations Sales Sales Enablement Management Business Planning Start-ups Sales Process Lead Generation See 17+     See less Cloud Computing Strategic Partnerships Enterprise Software Channel Business Development Go-to-market Strategy Professional Services Solution Selling Pre-sales SaaS Channel Partners Outsourcing Account Management Business Intelligence Integration Strategy CRM Security Selling Software Industry Sales Management Business Alliances Leadership Partner Management Sales Operations Sales Sales Enablement Management Business Planning Start-ups Sales Process Lead Generation See 17+     See less Cloud Computing Strategic Partnerships Enterprise Software Channel Business Development Go-to-market Strategy Professional Services Solution Selling Pre-sales SaaS Channel Partners Outsourcing Account Management Business Intelligence Integration Strategy CRM Security Selling Software Industry Sales Management Business Alliances Leadership Partner Management Sales Operations Sales Sales Enablement Management Business Planning Start-ups Sales Process Lead Generation See 17+     See less ", "Experience None None January 2015  – Present (8 months) Newbury, UK Case Management Consultant Senior ECM Specialist IBM August 2007  –  January 2015  (7 years 6 months) Senior Systems Architect ibm filenet January 1996  –  January 2015  (19 years 1 month) Consultant FileNet 1996  –  2007  (11 years) SWS - Specialist Digital Equipment Corporation 1981  –  1993  (12 years) None None January 2015  – Present (8 months) Newbury, UK Case Management Consultant None None January 2015  – Present (8 months) Newbury, UK Case Management Consultant Senior ECM Specialist IBM August 2007  –  January 2015  (7 years 6 months) Senior ECM Specialist IBM August 2007  –  January 2015  (7 years 6 months) Senior Systems Architect ibm filenet January 1996  –  January 2015  (19 years 1 month) Senior Systems Architect ibm filenet January 1996  –  January 2015  (19 years 1 month) Consultant FileNet 1996  –  2007  (11 years) Consultant FileNet 1996  –  2007  (11 years) SWS - Specialist Digital Equipment Corporation 1981  –  1993  (12 years) SWS - Specialist Digital Equipment Corporation 1981  –  1993  (12 years) Skills Enterprise Content... FileNet Enterprise Software Solution Architecture Enterprise Architecture SOA Business Process... Document Management IT Strategy SDLC C# Skills  Enterprise Content... FileNet Enterprise Software Solution Architecture Enterprise Architecture SOA Business Process... Document Management IT Strategy SDLC C# Enterprise Content... FileNet Enterprise Software Solution Architecture Enterprise Architecture SOA Business Process... Document Management IT Strategy SDLC C# Enterprise Content... FileNet Enterprise Software Solution Architecture Enterprise Architecture SOA Business Process... Document Management IT Strategy SDLC C# ", "Experience Senior Systems Architect IBM Senior Systems Architect IBM Senior Systems Architect IBM ", "Summary High performing senior program manager focused on enterprise infrastructures, cloud solutions and services. Creative business problem solver, who accurately assesses business challenges and transforms ideas into workable solutions that address today’s business objectives. Demonstrated experience in solving business and technical issues across multiple organizations to achieve and exceed stated objectives. Strong team builder with proven leadership skills, derived from successful experience defining future technology roadmaps, communicating strategy and business value to customers, corporate executive management, and technical teams.  \n \nNotable Highlights \n• Assembled and executed pre-sales, and sales education programs, improving the organization’s knowledge in cloud solutions and enabling sales to significantly increase orders and revenue  \n• Brought in as one of the key closers on “must-win” accounts to deliver the vision sales pitch to financial decision making executives, 90+ % success closing multi-year/multi-million dollar contracts \n• Created solutions that significantly reduced internal operational expenses \n• Developed first Infrastructure as a Service at IBM meeting storage on demand business goals. The solution has been in service for years supporting petabytes of storage globally Summary High performing senior program manager focused on enterprise infrastructures, cloud solutions and services. Creative business problem solver, who accurately assesses business challenges and transforms ideas into workable solutions that address today’s business objectives. Demonstrated experience in solving business and technical issues across multiple organizations to achieve and exceed stated objectives. Strong team builder with proven leadership skills, derived from successful experience defining future technology roadmaps, communicating strategy and business value to customers, corporate executive management, and technical teams.  \n \nNotable Highlights \n• Assembled and executed pre-sales, and sales education programs, improving the organization’s knowledge in cloud solutions and enabling sales to significantly increase orders and revenue  \n• Brought in as one of the key closers on “must-win” accounts to deliver the vision sales pitch to financial decision making executives, 90+ % success closing multi-year/multi-million dollar contracts \n• Created solutions that significantly reduced internal operational expenses \n• Developed first Infrastructure as a Service at IBM meeting storage on demand business goals. The solution has been in service for years supporting petabytes of storage globally High performing senior program manager focused on enterprise infrastructures, cloud solutions and services. Creative business problem solver, who accurately assesses business challenges and transforms ideas into workable solutions that address today’s business objectives. Demonstrated experience in solving business and technical issues across multiple organizations to achieve and exceed stated objectives. Strong team builder with proven leadership skills, derived from successful experience defining future technology roadmaps, communicating strategy and business value to customers, corporate executive management, and technical teams.  \n \nNotable Highlights \n• Assembled and executed pre-sales, and sales education programs, improving the organization’s knowledge in cloud solutions and enabling sales to significantly increase orders and revenue  \n• Brought in as one of the key closers on “must-win” accounts to deliver the vision sales pitch to financial decision making executives, 90+ % success closing multi-year/multi-million dollar contracts \n• Created solutions that significantly reduced internal operational expenses \n• Developed first Infrastructure as a Service at IBM meeting storage on demand business goals. The solution has been in service for years supporting petabytes of storage globally High performing senior program manager focused on enterprise infrastructures, cloud solutions and services. Creative business problem solver, who accurately assesses business challenges and transforms ideas into workable solutions that address today’s business objectives. Demonstrated experience in solving business and technical issues across multiple organizations to achieve and exceed stated objectives. Strong team builder with proven leadership skills, derived from successful experience defining future technology roadmaps, communicating strategy and business value to customers, corporate executive management, and technical teams.  \n \nNotable Highlights \n• Assembled and executed pre-sales, and sales education programs, improving the organization’s knowledge in cloud solutions and enabling sales to significantly increase orders and revenue  \n• Brought in as one of the key closers on “must-win” accounts to deliver the vision sales pitch to financial decision making executives, 90+ % success closing multi-year/multi-million dollar contracts \n• Created solutions that significantly reduced internal operational expenses \n• Developed first Infrastructure as a Service at IBM meeting storage on demand business goals. The solution has been in service for years supporting petabytes of storage globally Experience Cloud Solutions and Services - Portfolio Manager Unisys February 2012  – Present (3 years 7 months) Cloud Solutions and Services - Portfolio Manager Unisys February 2012  – Present (3 years 7 months) Cloud Solutions and Services - Portfolio Manager Unisys February 2012  – Present (3 years 7 months) Skills Cloud Computing Data Center Storage Solution Architecture Enterprise Architecture IT Strategy PaaS IaaS Cloud Security Program Management Cloud Storage Private Cloud Product Management Cluster Cloud Applications Storage Services Hybrid Cloud FCoE McData Brocade Fibre Switches Cisco MDS SAN switches Cloud Computing IaaS EMC ControlCenter Storage Migrations SAN Architect Storage Engineering Thin Provisioning Fibre Channel Protocol SMI-S FCIP iFCP V-Max Open Replicator PowerPath Distributed Storage IBM XIV Cloud Consulting Utility Computing Virtual Computing Private Clouds Cloud Marketing Network Virtualization OS Virtualization Virtual Desktop... Service-Now See 30+     See less Skills  Cloud Computing Data Center Storage Solution Architecture Enterprise Architecture IT Strategy PaaS IaaS Cloud Security Program Management Cloud Storage Private Cloud Product Management Cluster Cloud Applications Storage Services Hybrid Cloud FCoE McData Brocade Fibre Switches Cisco MDS SAN switches Cloud Computing IaaS EMC ControlCenter Storage Migrations SAN Architect Storage Engineering Thin Provisioning Fibre Channel Protocol SMI-S FCIP iFCP V-Max Open Replicator PowerPath Distributed Storage IBM XIV Cloud Consulting Utility Computing Virtual Computing Private Clouds Cloud Marketing Network Virtualization OS Virtualization Virtual Desktop... Service-Now See 30+     See less Cloud Computing Data Center Storage Solution Architecture Enterprise Architecture IT Strategy PaaS IaaS Cloud Security Program Management Cloud Storage Private Cloud Product Management Cluster Cloud Applications Storage Services Hybrid Cloud FCoE McData Brocade Fibre Switches Cisco MDS SAN switches Cloud Computing IaaS EMC ControlCenter Storage Migrations SAN Architect Storage Engineering Thin Provisioning Fibre Channel Protocol SMI-S FCIP iFCP V-Max Open Replicator PowerPath Distributed Storage IBM XIV Cloud Consulting Utility Computing Virtual Computing Private Clouds Cloud Marketing Network Virtualization OS Virtualization Virtual Desktop... Service-Now See 30+     See less Cloud Computing Data Center Storage Solution Architecture Enterprise Architecture IT Strategy PaaS IaaS Cloud Security Program Management Cloud Storage Private Cloud Product Management Cluster Cloud Applications Storage Services Hybrid Cloud FCoE McData Brocade Fibre Switches Cisco MDS SAN switches Cloud Computing IaaS EMC ControlCenter Storage Migrations SAN Architect Storage Engineering Thin Provisioning Fibre Channel Protocol SMI-S FCIP iFCP V-Max Open Replicator PowerPath Distributed Storage IBM XIV Cloud Consulting Utility Computing Virtual Computing Private Clouds Cloud Marketing Network Virtualization OS Virtualization Virtual Desktop... Service-Now See 30+     See less ", "Experience Senior Systems Architect IBM January 2011  – Present (4 years 8 months) Systems Architect IBM 1978  –  2012  (34 years) Senior IT Specialist IBM March 2004  –  December 2010  (6 years 10 months) Provide presales support for IBM POWER servers. Senior Systems Architect IBM January 2011  – Present (4 years 8 months) Senior Systems Architect IBM January 2011  – Present (4 years 8 months) Systems Architect IBM 1978  –  2012  (34 years) Systems Architect IBM 1978  –  2012  (34 years) Senior IT Specialist IBM March 2004  –  December 2010  (6 years 10 months) Provide presales support for IBM POWER servers. Senior IT Specialist IBM March 2004  –  December 2010  (6 years 10 months) Provide presales support for IBM POWER servers. Languages Urdu Urdu Urdu Skills AIX Virtualization Power Systems Systems Engineering Systems Management Private Cloud Enterprise Architecture Integration High Availability Storage Area Networks Storage Geriatrics Disaster Recovery Data Center Hair Loss VMware Solaris Servers Cluster SAN See 5+     See less Skills  AIX Virtualization Power Systems Systems Engineering Systems Management Private Cloud Enterprise Architecture Integration High Availability Storage Area Networks Storage Geriatrics Disaster Recovery Data Center Hair Loss VMware Solaris Servers Cluster SAN See 5+     See less AIX Virtualization Power Systems Systems Engineering Systems Management Private Cloud Enterprise Architecture Integration High Availability Storage Area Networks Storage Geriatrics Disaster Recovery Data Center Hair Loss VMware Solaris Servers Cluster SAN See 5+     See less AIX Virtualization Power Systems Systems Engineering Systems Management Private Cloud Enterprise Architecture Integration High Availability Storage Area Networks Storage Geriatrics Disaster Recovery Data Center Hair Loss VMware Solaris Servers Cluster SAN See 5+     See less Education University of Houston-Downtown 1975  – 1976 Adamjee Science College 1970  – 1972 University of Houston-Downtown 1975  – 1976 University of Houston-Downtown 1975  – 1976 University of Houston-Downtown 1975  – 1976 Adamjee Science College 1970  – 1972 Adamjee Science College 1970  – 1972 Adamjee Science College 1970  – 1972 ", "Skills IT Strategy Solutions Design Cloud Computing IT Infrastructure Design Data Centre Architecture Coaching Personnel Management Technological Innovation High Performance... Negotiation Data Processing Storage Virtualization Power Systems Motivation Storage Area Networks Storage Solutions Enterprise Storage AIX SAN Storage Architecture DS4000 Data Center Server Architecture Pre-sales IT Service Management Integration See 12+     See less Skills  IT Strategy Solutions Design Cloud Computing IT Infrastructure Design Data Centre Architecture Coaching Personnel Management Technological Innovation High Performance... Negotiation Data Processing Storage Virtualization Power Systems Motivation Storage Area Networks Storage Solutions Enterprise Storage AIX SAN Storage Architecture DS4000 Data Center Server Architecture Pre-sales IT Service Management Integration See 12+     See less IT Strategy Solutions Design Cloud Computing IT Infrastructure Design Data Centre Architecture Coaching Personnel Management Technological Innovation High Performance... Negotiation Data Processing Storage Virtualization Power Systems Motivation Storage Area Networks Storage Solutions Enterprise Storage AIX SAN Storage Architecture DS4000 Data Center Server Architecture Pre-sales IT Service Management Integration See 12+     See less IT Strategy Solutions Design Cloud Computing IT Infrastructure Design Data Centre Architecture Coaching Personnel Management Technological Innovation High Performance... Negotiation Data Processing Storage Virtualization Power Systems Motivation Storage Area Networks Storage Solutions Enterprise Storage AIX SAN Storage Architecture DS4000 Data Center Server Architecture Pre-sales IT Service Management Integration See 12+     See less ", "Skills DB2 Cloud Computing Software Development Enterprise Software Linux Agile Methodologies Software Engineering RDBMS Algorithms Skills  DB2 Cloud Computing Software Development Enterprise Software Linux Agile Methodologies Software Engineering RDBMS Algorithms DB2 Cloud Computing Software Development Enterprise Software Linux Agile Methodologies Software Engineering RDBMS Algorithms DB2 Cloud Computing Software Development Enterprise Software Linux Agile Methodologies Software Engineering RDBMS Algorithms ", "Summary A consulting executive with a history of managing large Business Intelligence projects in various industries focusing on creating value for the clients. Extensive hands on experience in developing and refining strategies across a range of process and functional disciplines (marketing, operations, human capital, products, growth, churn, etc.) and industries (banking, entertainment, retail, energy, healthcare, insurance, and pharmaceuticals, among others). Specializing in developing long term relations with the clients and assisting organizations in developing insights by leveraging business analytics technologies and Big Data platforms. \n \nSpecialties:  \n- Consulting Leadership \n- Practice Management \n- Program Management \n- Business Intelligence \n- Data Warehousing/Big Data \n- Analytics \n- Information Management \n- Information Strategy \n- Knowledge Management Summary A consulting executive with a history of managing large Business Intelligence projects in various industries focusing on creating value for the clients. Extensive hands on experience in developing and refining strategies across a range of process and functional disciplines (marketing, operations, human capital, products, growth, churn, etc.) and industries (banking, entertainment, retail, energy, healthcare, insurance, and pharmaceuticals, among others). Specializing in developing long term relations with the clients and assisting organizations in developing insights by leveraging business analytics technologies and Big Data platforms. \n \nSpecialties:  \n- Consulting Leadership \n- Practice Management \n- Program Management \n- Business Intelligence \n- Data Warehousing/Big Data \n- Analytics \n- Information Management \n- Information Strategy \n- Knowledge Management A consulting executive with a history of managing large Business Intelligence projects in various industries focusing on creating value for the clients. Extensive hands on experience in developing and refining strategies across a range of process and functional disciplines (marketing, operations, human capital, products, growth, churn, etc.) and industries (banking, entertainment, retail, energy, healthcare, insurance, and pharmaceuticals, among others). Specializing in developing long term relations with the clients and assisting organizations in developing insights by leveraging business analytics technologies and Big Data platforms. \n \nSpecialties:  \n- Consulting Leadership \n- Practice Management \n- Program Management \n- Business Intelligence \n- Data Warehousing/Big Data \n- Analytics \n- Information Management \n- Information Strategy \n- Knowledge Management A consulting executive with a history of managing large Business Intelligence projects in various industries focusing on creating value for the clients. Extensive hands on experience in developing and refining strategies across a range of process and functional disciplines (marketing, operations, human capital, products, growth, churn, etc.) and industries (banking, entertainment, retail, energy, healthcare, insurance, and pharmaceuticals, among others). Specializing in developing long term relations with the clients and assisting organizations in developing insights by leveraging business analytics technologies and Big Data platforms. \n \nSpecialties:  \n- Consulting Leadership \n- Practice Management \n- Program Management \n- Business Intelligence \n- Data Warehousing/Big Data \n- Analytics \n- Information Management \n- Information Strategy \n- Knowledge Management Experience Business Intelligence Competency Lead HP June 2009  – Present (6 years 3 months) Consulting. Senior Principal HP Services – Americas (Previously Knightsbridge) January 2005  –  June 2009  (4 years 6 months) Consulting. Senior Manager PwC April 1997  –  December 2004  (7 years 9 months) Consulting. Senior Systems Architect IBM Global Services June 1993  –  March 1997  (3 years 10 months) Systems Consulting/Outsourcing. Consultant Various Companies July 1990  –  June 1993  (3 years) Consulting. Business Intelligence Competency Lead HP June 2009  – Present (6 years 3 months) Consulting. Business Intelligence Competency Lead HP June 2009  – Present (6 years 3 months) Consulting. Senior Principal HP Services – Americas (Previously Knightsbridge) January 2005  –  June 2009  (4 years 6 months) Consulting. Senior Principal HP Services – Americas (Previously Knightsbridge) January 2005  –  June 2009  (4 years 6 months) Consulting. Senior Manager PwC April 1997  –  December 2004  (7 years 9 months) Consulting. Senior Manager PwC April 1997  –  December 2004  (7 years 9 months) Consulting. Senior Systems Architect IBM Global Services June 1993  –  March 1997  (3 years 10 months) Systems Consulting/Outsourcing. Senior Systems Architect IBM Global Services June 1993  –  March 1997  (3 years 10 months) Systems Consulting/Outsourcing. Consultant Various Companies July 1990  –  June 1993  (3 years) Consulting. Consultant Various Companies July 1990  –  June 1993  (3 years) Consulting. Skills Data Warehousing Business Intelligence Master Data Management Governance Data Quality Data Governance Business Analysis IT Strategy Analytics Information Management Business Process PMP Data Modeling Management Consulting Business Analytics Informatica ETL Data Integration SDLC Enterprise Software Outsourcing CRM Strategy Agile Methodologies Enterprise Architecture Solution Architecture Data Migration Pre-sales Requirements Analysis Requirements Gathering Business Objects Data Warehouse... Integration Teradata Business Requirements SOA Dimensional Modeling Program Management Consulting Management Big Data Project Management See 27+     See less Skills  Data Warehousing Business Intelligence Master Data Management Governance Data Quality Data Governance Business Analysis IT Strategy Analytics Information Management Business Process PMP Data Modeling Management Consulting Business Analytics Informatica ETL Data Integration SDLC Enterprise Software Outsourcing CRM Strategy Agile Methodologies Enterprise Architecture Solution Architecture Data Migration Pre-sales Requirements Analysis Requirements Gathering Business Objects Data Warehouse... Integration Teradata Business Requirements SOA Dimensional Modeling Program Management Consulting Management Big Data Project Management See 27+     See less Data Warehousing Business Intelligence Master Data Management Governance Data Quality Data Governance Business Analysis IT Strategy Analytics Information Management Business Process PMP Data Modeling Management Consulting Business Analytics Informatica ETL Data Integration SDLC Enterprise Software Outsourcing CRM Strategy Agile Methodologies Enterprise Architecture Solution Architecture Data Migration Pre-sales Requirements Analysis Requirements Gathering Business Objects Data Warehouse... Integration Teradata Business Requirements SOA Dimensional Modeling Program Management Consulting Management Big Data Project Management See 27+     See less Data Warehousing Business Intelligence Master Data Management Governance Data Quality Data Governance Business Analysis IT Strategy Analytics Information Management Business Process PMP Data Modeling Management Consulting Business Analytics Informatica ETL Data Integration SDLC Enterprise Software Outsourcing CRM Strategy Agile Methodologies Enterprise Architecture Solution Architecture Data Migration Pre-sales Requirements Analysis Requirements Gathering Business Objects Data Warehouse... Integration Teradata Business Requirements SOA Dimensional Modeling Program Management Consulting Management Big Data Project Management See 27+     See less Education University of Missouri - St. Louis MIS,  Information Technology January 1992  – December 1994 University of Missouri - St. Louis MIS,  Information Technology January 1992  – December 1994 University of Missouri - St. Louis MIS,  Information Technology January 1992  – December 1994 University of Missouri - St. Louis MIS,  Information Technology January 1992  – December 1994 ", "Experience Senior Systems Architect IBM July 1995  – Present (20 years 2 months) IDC Staff Instructor International Scuba 2008  – Present (7 years) International Scuba Systems Analyst BNSF Railway 1992  –  1995  (3 years) Director of IT Texas State Board of Insurance 1988  –  1992  (4 years) Senior Systems Architect IBM July 1995  – Present (20 years 2 months) Senior Systems Architect IBM July 1995  – Present (20 years 2 months) IDC Staff Instructor International Scuba 2008  – Present (7 years) International Scuba IDC Staff Instructor International Scuba 2008  – Present (7 years) International Scuba Systems Analyst BNSF Railway 1992  –  1995  (3 years) Systems Analyst BNSF Railway 1992  –  1995  (3 years) Director of IT Texas State Board of Insurance 1988  –  1992  (4 years) Director of IT Texas State Board of Insurance 1988  –  1992  (4 years) Skills Business Analysis Enterprise Architecture ITIL SDLC Software Development Distributed Systems Business Process... Process Improvement Requirements Analysis Cloud Computing Strategic Planning Product Development IT Management Business Management Cross-functional Team... Team Leadership Project Management Vendor Management Project Portfolio... Lotus Notes Servers Databases SQL IT Operations Operating Systems System Administration JavaScript HTML Windows Microsoft Office Web Services Solution Design Data Warehousing Solution Architecture Business Intelligence IT Strategy Integration Management Disaster Recovery Enterprise Software IT Service Management Program Management Quantitative... Project Planning Strategic Financial... Business Planning Financial Analysis Software Project... Data Center SaaS See 35+     See less Skills  Business Analysis Enterprise Architecture ITIL SDLC Software Development Distributed Systems Business Process... Process Improvement Requirements Analysis Cloud Computing Strategic Planning Product Development IT Management Business Management Cross-functional Team... Team Leadership Project Management Vendor Management Project Portfolio... Lotus Notes Servers Databases SQL IT Operations Operating Systems System Administration JavaScript HTML Windows Microsoft Office Web Services Solution Design Data Warehousing Solution Architecture Business Intelligence IT Strategy Integration Management Disaster Recovery Enterprise Software IT Service Management Program Management Quantitative... Project Planning Strategic Financial... Business Planning Financial Analysis Software Project... Data Center SaaS See 35+     See less Business Analysis Enterprise Architecture ITIL SDLC Software Development Distributed Systems Business Process... Process Improvement Requirements Analysis Cloud Computing Strategic Planning Product Development IT Management Business Management Cross-functional Team... Team Leadership Project Management Vendor Management Project Portfolio... Lotus Notes Servers Databases SQL IT Operations Operating Systems System Administration JavaScript HTML Windows Microsoft Office Web Services Solution Design Data Warehousing Solution Architecture Business Intelligence IT Strategy Integration Management Disaster Recovery Enterprise Software IT Service Management Program Management Quantitative... Project Planning Strategic Financial... Business Planning Financial Analysis Software Project... Data Center SaaS See 35+     See less Business Analysis Enterprise Architecture ITIL SDLC Software Development Distributed Systems Business Process... Process Improvement Requirements Analysis Cloud Computing Strategic Planning Product Development IT Management Business Management Cross-functional Team... Team Leadership Project Management Vendor Management Project Portfolio... Lotus Notes Servers Databases SQL IT Operations Operating Systems System Administration JavaScript HTML Windows Microsoft Office Web Services Solution Design Data Warehousing Solution Architecture Business Intelligence IT Strategy Integration Management Disaster Recovery Enterprise Software IT Service Management Program Management Quantitative... Project Planning Strategic Financial... Business Planning Financial Analysis Software Project... Data Center SaaS See 35+     See less Education University of Houston Bachelors,  Finance 1977  – 1981 University of Houston Bachelors,  Finance 1977  – 1981 University of Houston Bachelors,  Finance 1977  – 1981 University of Houston Bachelors,  Finance 1977  – 1981 Honors & Awards Additional Honors & Awards 2011 IBM Means Service Additional Honors & Awards 2011 IBM Means Service Additional Honors & Awards 2011 IBM Means Service Additional Honors & Awards 2011 IBM Means Service ", "Languages Spanish English Spanish English Spanish English Skills Microsoft SQL Server Agile Methodologies Unix Telecommunications Integration Oracle CRM SQL Cloud Computing Enterprise Architecture Business Intelligence SDLC Software Project... IT Strategy Solution Architecture Skills  Microsoft SQL Server Agile Methodologies Unix Telecommunications Integration Oracle CRM SQL Cloud Computing Enterprise Architecture Business Intelligence SDLC Software Project... IT Strategy Solution Architecture Microsoft SQL Server Agile Methodologies Unix Telecommunications Integration Oracle CRM SQL Cloud Computing Enterprise Architecture Business Intelligence SDLC Software Project... IT Strategy Solution Architecture Microsoft SQL Server Agile Methodologies Unix Telecommunications Integration Oracle CRM SQL Cloud Computing Enterprise Architecture Business Intelligence SDLC Software Project... IT Strategy Solution Architecture ", "Languages German German German Skills Data Center Cloud Computing Virtualization SaaS Storage VMware VMware ESX Enterprise Software Architecture Unix vSphere Server Architecture Integration Solaris VDI Security See 1+     See less Skills  Data Center Cloud Computing Virtualization SaaS Storage VMware VMware ESX Enterprise Software Architecture Unix vSphere Server Architecture Integration Solaris VDI Security See 1+     See less Data Center Cloud Computing Virtualization SaaS Storage VMware VMware ESX Enterprise Software Architecture Unix vSphere Server Architecture Integration Solaris VDI Security See 1+     See less Data Center Cloud Computing Virtualization SaaS Storage VMware VMware ESX Enterprise Software Architecture Unix vSphere Server Architecture Integration Solaris VDI Security See 1+     See less "]}