{"position": "Senior Scientist", "company": "Stanford University", "profiles": ["Experience Senior Scientist Stanford University January 2014  – Present (1 year 8 months) Research Scientist Stanford University February 2010  –  December 2013  (3 years 11 months) Postdoctoral Fellow Stanford University February 2004  –  January 2010  (6 years) Senior Scientist Stanford University January 2014  – Present (1 year 8 months) Senior Scientist Stanford University January 2014  – Present (1 year 8 months) Research Scientist Stanford University February 2010  –  December 2013  (3 years 11 months) Research Scientist Stanford University February 2010  –  December 2013  (3 years 11 months) Postdoctoral Fellow Stanford University February 2004  –  January 2010  (6 years) Postdoctoral Fellow Stanford University February 2004  –  January 2010  (6 years) Skills Molecular Biology Oncology Neurobiology Cell Biology Regenerative Medicine Biotechnology Biotherapeutics Business Development Startup Development SOP development Cell Culture Animal Models Disease Studies in... Gene Expression... Cell Tranplantation Transgenics Cellular... DNA/RNA/Protein Analyses microRNA Post-translational... Cell Signaling Gene Therapy See 7+     See less Skills  Molecular Biology Oncology Neurobiology Cell Biology Regenerative Medicine Biotechnology Biotherapeutics Business Development Startup Development SOP development Cell Culture Animal Models Disease Studies in... Gene Expression... Cell Tranplantation Transgenics Cellular... DNA/RNA/Protein Analyses microRNA Post-translational... Cell Signaling Gene Therapy See 7+     See less Molecular Biology Oncology Neurobiology Cell Biology Regenerative Medicine Biotechnology Biotherapeutics Business Development Startup Development SOP development Cell Culture Animal Models Disease Studies in... Gene Expression... Cell Tranplantation Transgenics Cellular... DNA/RNA/Protein Analyses microRNA Post-translational... Cell Signaling Gene Therapy See 7+     See less Molecular Biology Oncology Neurobiology Cell Biology Regenerative Medicine Biotechnology Biotherapeutics Business Development Startup Development SOP development Cell Culture Animal Models Disease Studies in... Gene Expression... Cell Tranplantation Transgenics Cellular... DNA/RNA/Protein Analyses microRNA Post-translational... Cell Signaling Gene Therapy See 7+     See less Education Stanford University Postdoctoral Degree,  Pathology ,  Neurobiology ,  Oncology 2004  – 2010 Philipps-Universität Marburg Doctor of Philosophy (PhD),  Molecular Biology , Oncology,  Hematology 2000  – 2003 Christian-Albrechts-Universität zu Kiel / University of Kiel Master of Science (M.S.),  Biology ,  Genetics 1997  – 2000 Stanford University Postdoctoral Degree,  Pathology ,  Neurobiology ,  Oncology 2004  – 2010 Stanford University Postdoctoral Degree,  Pathology ,  Neurobiology ,  Oncology 2004  – 2010 Stanford University Postdoctoral Degree,  Pathology ,  Neurobiology ,  Oncology 2004  – 2010 Philipps-Universität Marburg Doctor of Philosophy (PhD),  Molecular Biology , Oncology,  Hematology 2000  – 2003 Philipps-Universität Marburg Doctor of Philosophy (PhD),  Molecular Biology , Oncology,  Hematology 2000  – 2003 Philipps-Universität Marburg Doctor of Philosophy (PhD),  Molecular Biology , Oncology,  Hematology 2000  – 2003 Christian-Albrechts-Universität zu Kiel / University of Kiel Master of Science (M.S.),  Biology ,  Genetics 1997  – 2000 Christian-Albrechts-Universität zu Kiel / University of Kiel Master of Science (M.S.),  Biology ,  Genetics 1997  – 2000 Christian-Albrechts-Universität zu Kiel / University of Kiel Master of Science (M.S.),  Biology ,  Genetics 1997  – 2000 ", "Summary A results orientated and highly motivated biotechnology professional with scientific leadership and commercial technology experience. Passionate for innovative technologies that have impact in biomarker discovery, clinical immunology and molecular diagnostics. Immunologist with a passion for mechanistic and functional characterization of cell fate decisions in autoimmune and hematopoietic disorders. Expertise in multiparametric flow cytometry, antibody/reagent production and validation, phospho-marker development and signaling pathways in immune cells. Developer of the phosphoflow(TM) technology. Experienced in protein biochemistry, chemistry, pharmacology, molecular biology, immune techniques, HTS screening, clinical and viral immunology, product development, data management, information systems and strategic marketing. Demonstrated ability to manage R&D scientific collaboration alliances and IP portfolios, hire and motivate individuals, and facilitate corporate and business development . Problem solver and strategic thinker with strong analytical, organizational, communication, presentation and interpersonal skills.  \n \nDr. Perez is a co-founder of Nodality, a biotechnology company focused on developing blood based diagnostics . Prior to Nodality, Dr. Perez was the Senior Scientist and Director of the phosphoflow cytometry group at the Proteomics Center in the Stanford Medical Center. He is an inventor of the multiparametric phosphoflow technologies and an author in 34 publications and 28 patents. Dr. Perez has also collaborated with various companies that include Novartis, BMS, Chiron, Sugen and BD Biosciences. Dr. Perez is recipient of several prestigious awards that include being a Kauffman Fellow finalist, the Herzenberg Prize, the Human Immunology Award Dana Foundation, and the Bristol Myers Squibb-Irvington Award and is invited to speak at scientific conferences worldwide. Specialties:scientific stratgy and planning, translating decisions into operational plans, highly organized, results orientated project management style, intellectual property management, information technology planning, entrepreneurial spirIt. Developed diagnostic or biomarker assays for Toca-FC, PKC412, LBH589, LFA703, LFA878, SU1128, enzastorin, atorvastatin, raptiva, anti-CD137, GD-Tex, Gleevec, CHR258, Anti-TNFa agents and myoseverin. Summary A results orientated and highly motivated biotechnology professional with scientific leadership and commercial technology experience. Passionate for innovative technologies that have impact in biomarker discovery, clinical immunology and molecular diagnostics. Immunologist with a passion for mechanistic and functional characterization of cell fate decisions in autoimmune and hematopoietic disorders. Expertise in multiparametric flow cytometry, antibody/reagent production and validation, phospho-marker development and signaling pathways in immune cells. Developer of the phosphoflow(TM) technology. Experienced in protein biochemistry, chemistry, pharmacology, molecular biology, immune techniques, HTS screening, clinical and viral immunology, product development, data management, information systems and strategic marketing. Demonstrated ability to manage R&D scientific collaboration alliances and IP portfolios, hire and motivate individuals, and facilitate corporate and business development . Problem solver and strategic thinker with strong analytical, organizational, communication, presentation and interpersonal skills.  \n \nDr. Perez is a co-founder of Nodality, a biotechnology company focused on developing blood based diagnostics . Prior to Nodality, Dr. Perez was the Senior Scientist and Director of the phosphoflow cytometry group at the Proteomics Center in the Stanford Medical Center. He is an inventor of the multiparametric phosphoflow technologies and an author in 34 publications and 28 patents. Dr. Perez has also collaborated with various companies that include Novartis, BMS, Chiron, Sugen and BD Biosciences. Dr. Perez is recipient of several prestigious awards that include being a Kauffman Fellow finalist, the Herzenberg Prize, the Human Immunology Award Dana Foundation, and the Bristol Myers Squibb-Irvington Award and is invited to speak at scientific conferences worldwide. Specialties:scientific stratgy and planning, translating decisions into operational plans, highly organized, results orientated project management style, intellectual property management, information technology planning, entrepreneurial spirIt. Developed diagnostic or biomarker assays for Toca-FC, PKC412, LBH589, LFA703, LFA878, SU1128, enzastorin, atorvastatin, raptiva, anti-CD137, GD-Tex, Gleevec, CHR258, Anti-TNFa agents and myoseverin. A results orientated and highly motivated biotechnology professional with scientific leadership and commercial technology experience. Passionate for innovative technologies that have impact in biomarker discovery, clinical immunology and molecular diagnostics. Immunologist with a passion for mechanistic and functional characterization of cell fate decisions in autoimmune and hematopoietic disorders. Expertise in multiparametric flow cytometry, antibody/reagent production and validation, phospho-marker development and signaling pathways in immune cells. Developer of the phosphoflow(TM) technology. Experienced in protein biochemistry, chemistry, pharmacology, molecular biology, immune techniques, HTS screening, clinical and viral immunology, product development, data management, information systems and strategic marketing. Demonstrated ability to manage R&D scientific collaboration alliances and IP portfolios, hire and motivate individuals, and facilitate corporate and business development . Problem solver and strategic thinker with strong analytical, organizational, communication, presentation and interpersonal skills.  \n \nDr. Perez is a co-founder of Nodality, a biotechnology company focused on developing blood based diagnostics . Prior to Nodality, Dr. Perez was the Senior Scientist and Director of the phosphoflow cytometry group at the Proteomics Center in the Stanford Medical Center. He is an inventor of the multiparametric phosphoflow technologies and an author in 34 publications and 28 patents. Dr. Perez has also collaborated with various companies that include Novartis, BMS, Chiron, Sugen and BD Biosciences. Dr. Perez is recipient of several prestigious awards that include being a Kauffman Fellow finalist, the Herzenberg Prize, the Human Immunology Award Dana Foundation, and the Bristol Myers Squibb-Irvington Award and is invited to speak at scientific conferences worldwide. Specialties:scientific stratgy and planning, translating decisions into operational plans, highly organized, results orientated project management style, intellectual property management, information technology planning, entrepreneurial spirIt. Developed diagnostic or biomarker assays for Toca-FC, PKC412, LBH589, LFA703, LFA878, SU1128, enzastorin, atorvastatin, raptiva, anti-CD137, GD-Tex, Gleevec, CHR258, Anti-TNFa agents and myoseverin. A results orientated and highly motivated biotechnology professional with scientific leadership and commercial technology experience. Passionate for innovative technologies that have impact in biomarker discovery, clinical immunology and molecular diagnostics. Immunologist with a passion for mechanistic and functional characterization of cell fate decisions in autoimmune and hematopoietic disorders. Expertise in multiparametric flow cytometry, antibody/reagent production and validation, phospho-marker development and signaling pathways in immune cells. Developer of the phosphoflow(TM) technology. Experienced in protein biochemistry, chemistry, pharmacology, molecular biology, immune techniques, HTS screening, clinical and viral immunology, product development, data management, information systems and strategic marketing. Demonstrated ability to manage R&D scientific collaboration alliances and IP portfolios, hire and motivate individuals, and facilitate corporate and business development . Problem solver and strategic thinker with strong analytical, organizational, communication, presentation and interpersonal skills.  \n \nDr. Perez is a co-founder of Nodality, a biotechnology company focused on developing blood based diagnostics . Prior to Nodality, Dr. Perez was the Senior Scientist and Director of the phosphoflow cytometry group at the Proteomics Center in the Stanford Medical Center. He is an inventor of the multiparametric phosphoflow technologies and an author in 34 publications and 28 patents. Dr. Perez has also collaborated with various companies that include Novartis, BMS, Chiron, Sugen and BD Biosciences. Dr. Perez is recipient of several prestigious awards that include being a Kauffman Fellow finalist, the Herzenberg Prize, the Human Immunology Award Dana Foundation, and the Bristol Myers Squibb-Irvington Award and is invited to speak at scientific conferences worldwide. Specialties:scientific stratgy and planning, translating decisions into operational plans, highly organized, results orientated project management style, intellectual property management, information technology planning, entrepreneurial spirIt. Developed diagnostic or biomarker assays for Toca-FC, PKC412, LBH589, LFA703, LFA878, SU1128, enzastorin, atorvastatin, raptiva, anti-CD137, GD-Tex, Gleevec, CHR258, Anti-TNFa agents and myoseverin. Experience Director Diagnostics Oncology, Worldwide R&D Pfizer April 2012  – Present (3 years 5 months) La Jolla Oversee global companion diagnostic developments for the oncology portfolio Entrepreneur in Residence CONNECT 2012  – Present (3 years) Director R&D, Diagnostics Tocagen Inc. April 2011  –  April 2012  (1 year 1 month) ● Oversee diagnostic development for clinical and preclinical assays including reagent development, reagent qualification programs and assay validation.  \n● Lead cross-functional teams to develop clinical testing strategy and support of CMC strategy including release, stability, and comparability programs.  \n● Manage CRO relationships for tech transfer and clinical trial support \n● Developed NAT and serological diagnostics for viral detection Director of Preclinical Development & QC Tocagen Inc. April 2008  –  2012  (4 years) San Diego • Oversee preclinical development department for a gene therapy biological and small molecule combination product: assay development, validation of release product assays, and all analytical assays development \n• Procure and manage alliances for product development, R&D, preclinical studies, reagent development and assay validation \n•\tLead all analytical development for clinical and preclinical assays to support clinical testing strategy and support of CMC strategy including release, stability, and comparability programs. \n• Successful IND filing for Toca511, a replication competent prodrug activator product Biotechnology Consultant ODP Consulting 2001  –  2012  (11 years) Six sigma black belt training \nKauffman Fellow  \nMaven Consultant \n \nBiotech consultant assisting companies with business development strategies, technology licensing, start-up formations, assay design and development and marketing strategies.  \n \nAreas of expertise: \n- Immunology, hematological and rheumatological diseases \n- Signalng analysis by flow cytometry \n- Phosphoflow(TM)  \n- Multiplexed technologies \n- Clinical sample handling logistics  \n- IT/IS platform approaches to data management  \n- Intellectual property management \n- Project management, operations \n- Antibody reagent vendor relationships \n- Strategic marketing, competive intelligence analysis,  \n- Efficiency streamlining \n- Licensing strategies, negotiations, and contract mangement \n \nAdvised on phospho-antibody production, conjugate chemistry and QC validation platforms for reagent development.Evaluated novel fluorochrome dyes for tags for flow cytometry applications. Developed novel flow assays for NK cell killing, HIV detection, phospho-epitope monitoring, signal network detection, glycosylation modification detection, receptor dimerization assessment and nuclear localization. Provided expertise in phosphoflow(TM) cytometry for drug screening, pharmacodynamic monitoring, target validation and clinical immune monitoring programs for industry and academia. Consulted on multiplexed assay systems for functional assessment in highly immunophenotyped cells.Provided expertise on clinical sample handling, cryopreservation techniques, and automated flow cytometry. Advised on small molecule screening programs that included FLT3 inhibitors, LFA-1 antagonists and various kinase inhibitors. Clients included Chiron, Novartis, BMS, ICOS, Sugen, Pharmacyclics, and Pharmingen. Founder; Sr Director Research and Technology Nodality January 2004  –  December 2008  (5 years) South San Francisco Nodality Inc. is a privately held emerging biotechnology company focused on developing mechanistic and patient-specific classification of disease. Nodality has expertise in multiparametric single cell based measurements, which will enable us to advance our technology in all aspects of drug development including discovery research, clinical trial cohort identification and biomarker analysis. We are focused in different therapeutic areas such as oncology and autoimmunity. Exec Management MIT Sloan School of Management 2007  –  2007  (less than a year) Strategic Marketing, Corporate Finance, Managing Innovation, Business leadership Senior Scientist Stanford University April 2004  –  April 2006  (2 years 1 month) Developed the phosphoflow(TM) technique for applications that included human immunolgy,mechanistic studies and clinical applications. More details in pubmed! Managed pharma contracted research projects that included BMS, Novartis, Chiron as sponsors. Consultant BD Biosicences 2003  –  2006  (3 years) Assisted with experimental design and QC validation of the phosphoflow product line. Provided marketing and technical analysis. Fellow Irvington Institute 2003  –  2006  (3 years) Evaluated biomarkers in rheumatoid arthritis and lupus using phosphoflow analysis Consultant Bristol-Myers Squibb 2004  –  2005  (1 year) Develop biomarker strategies for a immunotherapeutic agent in development Grad student Stanford University Medical Center 1999  –  2002  (3 years) Develop the phosphflow technology and apply it for studying T cell activation and differentiation. Particularly understanding mechanistically the LFA-1/ICAM interaction. PI: Garry Nolan Fellow, biopharmaceutical sciences UCSF 1998  –  1998  (less than a year) Clone and fluorescently tag nucleotide transporters, characterize enzyme kinetics and perform confocal microscopy Director Diagnostics Oncology, Worldwide R&D Pfizer April 2012  – Present (3 years 5 months) La Jolla Oversee global companion diagnostic developments for the oncology portfolio Director Diagnostics Oncology, Worldwide R&D Pfizer April 2012  – Present (3 years 5 months) La Jolla Oversee global companion diagnostic developments for the oncology portfolio Entrepreneur in Residence CONNECT 2012  – Present (3 years) Entrepreneur in Residence CONNECT 2012  – Present (3 years) Director R&D, Diagnostics Tocagen Inc. April 2011  –  April 2012  (1 year 1 month) ● Oversee diagnostic development for clinical and preclinical assays including reagent development, reagent qualification programs and assay validation.  \n● Lead cross-functional teams to develop clinical testing strategy and support of CMC strategy including release, stability, and comparability programs.  \n● Manage CRO relationships for tech transfer and clinical trial support \n● Developed NAT and serological diagnostics for viral detection Director R&D, Diagnostics Tocagen Inc. April 2011  –  April 2012  (1 year 1 month) ● Oversee diagnostic development for clinical and preclinical assays including reagent development, reagent qualification programs and assay validation.  \n● Lead cross-functional teams to develop clinical testing strategy and support of CMC strategy including release, stability, and comparability programs.  \n● Manage CRO relationships for tech transfer and clinical trial support \n● Developed NAT and serological diagnostics for viral detection Director of Preclinical Development & QC Tocagen Inc. April 2008  –  2012  (4 years) San Diego • Oversee preclinical development department for a gene therapy biological and small molecule combination product: assay development, validation of release product assays, and all analytical assays development \n• Procure and manage alliances for product development, R&D, preclinical studies, reagent development and assay validation \n•\tLead all analytical development for clinical and preclinical assays to support clinical testing strategy and support of CMC strategy including release, stability, and comparability programs. \n• Successful IND filing for Toca511, a replication competent prodrug activator product Director of Preclinical Development & QC Tocagen Inc. April 2008  –  2012  (4 years) San Diego • Oversee preclinical development department for a gene therapy biological and small molecule combination product: assay development, validation of release product assays, and all analytical assays development \n• Procure and manage alliances for product development, R&D, preclinical studies, reagent development and assay validation \n•\tLead all analytical development for clinical and preclinical assays to support clinical testing strategy and support of CMC strategy including release, stability, and comparability programs. \n• Successful IND filing for Toca511, a replication competent prodrug activator product Biotechnology Consultant ODP Consulting 2001  –  2012  (11 years) Six sigma black belt training \nKauffman Fellow  \nMaven Consultant \n \nBiotech consultant assisting companies with business development strategies, technology licensing, start-up formations, assay design and development and marketing strategies.  \n \nAreas of expertise: \n- Immunology, hematological and rheumatological diseases \n- Signalng analysis by flow cytometry \n- Phosphoflow(TM)  \n- Multiplexed technologies \n- Clinical sample handling logistics  \n- IT/IS platform approaches to data management  \n- Intellectual property management \n- Project management, operations \n- Antibody reagent vendor relationships \n- Strategic marketing, competive intelligence analysis,  \n- Efficiency streamlining \n- Licensing strategies, negotiations, and contract mangement \n \nAdvised on phospho-antibody production, conjugate chemistry and QC validation platforms for reagent development.Evaluated novel fluorochrome dyes for tags for flow cytometry applications. Developed novel flow assays for NK cell killing, HIV detection, phospho-epitope monitoring, signal network detection, glycosylation modification detection, receptor dimerization assessment and nuclear localization. Provided expertise in phosphoflow(TM) cytometry for drug screening, pharmacodynamic monitoring, target validation and clinical immune monitoring programs for industry and academia. Consulted on multiplexed assay systems for functional assessment in highly immunophenotyped cells.Provided expertise on clinical sample handling, cryopreservation techniques, and automated flow cytometry. Advised on small molecule screening programs that included FLT3 inhibitors, LFA-1 antagonists and various kinase inhibitors. Clients included Chiron, Novartis, BMS, ICOS, Sugen, Pharmacyclics, and Pharmingen. Biotechnology Consultant ODP Consulting 2001  –  2012  (11 years) Six sigma black belt training \nKauffman Fellow  \nMaven Consultant \n \nBiotech consultant assisting companies with business development strategies, technology licensing, start-up formations, assay design and development and marketing strategies.  \n \nAreas of expertise: \n- Immunology, hematological and rheumatological diseases \n- Signalng analysis by flow cytometry \n- Phosphoflow(TM)  \n- Multiplexed technologies \n- Clinical sample handling logistics  \n- IT/IS platform approaches to data management  \n- Intellectual property management \n- Project management, operations \n- Antibody reagent vendor relationships \n- Strategic marketing, competive intelligence analysis,  \n- Efficiency streamlining \n- Licensing strategies, negotiations, and contract mangement \n \nAdvised on phospho-antibody production, conjugate chemistry and QC validation platforms for reagent development.Evaluated novel fluorochrome dyes for tags for flow cytometry applications. Developed novel flow assays for NK cell killing, HIV detection, phospho-epitope monitoring, signal network detection, glycosylation modification detection, receptor dimerization assessment and nuclear localization. Provided expertise in phosphoflow(TM) cytometry for drug screening, pharmacodynamic monitoring, target validation and clinical immune monitoring programs for industry and academia. Consulted on multiplexed assay systems for functional assessment in highly immunophenotyped cells.Provided expertise on clinical sample handling, cryopreservation techniques, and automated flow cytometry. Advised on small molecule screening programs that included FLT3 inhibitors, LFA-1 antagonists and various kinase inhibitors. Clients included Chiron, Novartis, BMS, ICOS, Sugen, Pharmacyclics, and Pharmingen. Founder; Sr Director Research and Technology Nodality January 2004  –  December 2008  (5 years) South San Francisco Nodality Inc. is a privately held emerging biotechnology company focused on developing mechanistic and patient-specific classification of disease. Nodality has expertise in multiparametric single cell based measurements, which will enable us to advance our technology in all aspects of drug development including discovery research, clinical trial cohort identification and biomarker analysis. We are focused in different therapeutic areas such as oncology and autoimmunity. Founder; Sr Director Research and Technology Nodality January 2004  –  December 2008  (5 years) South San Francisco Nodality Inc. is a privately held emerging biotechnology company focused on developing mechanistic and patient-specific classification of disease. Nodality has expertise in multiparametric single cell based measurements, which will enable us to advance our technology in all aspects of drug development including discovery research, clinical trial cohort identification and biomarker analysis. We are focused in different therapeutic areas such as oncology and autoimmunity. Exec Management MIT Sloan School of Management 2007  –  2007  (less than a year) Strategic Marketing, Corporate Finance, Managing Innovation, Business leadership Exec Management MIT Sloan School of Management 2007  –  2007  (less than a year) Strategic Marketing, Corporate Finance, Managing Innovation, Business leadership Senior Scientist Stanford University April 2004  –  April 2006  (2 years 1 month) Developed the phosphoflow(TM) technique for applications that included human immunolgy,mechanistic studies and clinical applications. More details in pubmed! Managed pharma contracted research projects that included BMS, Novartis, Chiron as sponsors. Senior Scientist Stanford University April 2004  –  April 2006  (2 years 1 month) Developed the phosphoflow(TM) technique for applications that included human immunolgy,mechanistic studies and clinical applications. More details in pubmed! Managed pharma contracted research projects that included BMS, Novartis, Chiron as sponsors. Consultant BD Biosicences 2003  –  2006  (3 years) Assisted with experimental design and QC validation of the phosphoflow product line. Provided marketing and technical analysis. Consultant BD Biosicences 2003  –  2006  (3 years) Assisted with experimental design and QC validation of the phosphoflow product line. Provided marketing and technical analysis. Fellow Irvington Institute 2003  –  2006  (3 years) Evaluated biomarkers in rheumatoid arthritis and lupus using phosphoflow analysis Fellow Irvington Institute 2003  –  2006  (3 years) Evaluated biomarkers in rheumatoid arthritis and lupus using phosphoflow analysis Consultant Bristol-Myers Squibb 2004  –  2005  (1 year) Develop biomarker strategies for a immunotherapeutic agent in development Consultant Bristol-Myers Squibb 2004  –  2005  (1 year) Develop biomarker strategies for a immunotherapeutic agent in development Grad student Stanford University Medical Center 1999  –  2002  (3 years) Develop the phosphflow technology and apply it for studying T cell activation and differentiation. Particularly understanding mechanistically the LFA-1/ICAM interaction. PI: Garry Nolan Grad student Stanford University Medical Center 1999  –  2002  (3 years) Develop the phosphflow technology and apply it for studying T cell activation and differentiation. Particularly understanding mechanistically the LFA-1/ICAM interaction. PI: Garry Nolan Fellow, biopharmaceutical sciences UCSF 1998  –  1998  (less than a year) Clone and fluorescently tag nucleotide transporters, characterize enzyme kinetics and perform confocal microscopy Fellow, biopharmaceutical sciences UCSF 1998  –  1998  (less than a year) Clone and fluorescently tag nucleotide transporters, characterize enzyme kinetics and perform confocal microscopy Languages Spanish French Italian Spanish French Italian Spanish French Italian Skills Intellectual Property Technology Planning Biotechnology Strategic Planning Pharmaceutical... Quality Systems Diagnostics Immunology Oncology Project Portfolio... Business Intelligence New Business Development Product Development Quality System Hardware Diagnostics Assay Development Pharmaceutical Industry Lifesciences Molecular Biology Flow Cytometry High Throughput... Business Development Biomarkers Genomics Proteomics Biopharmaceuticals Clinical Development Start-ups Biochemistry Cell Strategy Technology Transfer Drug Development Antibodies R&D Pharmacology Clinical Trials Commercialization Cross-functional Team... CRO Medical Devices Clinical Research Patents Validation Drug Discovery Chemistry Laboratory Infectious Diseases Life Sciences Cell Culture See 35+     See less Skills  Intellectual Property Technology Planning Biotechnology Strategic Planning Pharmaceutical... Quality Systems Diagnostics Immunology Oncology Project Portfolio... Business Intelligence New Business Development Product Development Quality System Hardware Diagnostics Assay Development Pharmaceutical Industry Lifesciences Molecular Biology Flow Cytometry High Throughput... Business Development Biomarkers Genomics Proteomics Biopharmaceuticals Clinical Development Start-ups Biochemistry Cell Strategy Technology Transfer Drug Development Antibodies R&D Pharmacology Clinical Trials Commercialization Cross-functional Team... CRO Medical Devices Clinical Research Patents Validation Drug Discovery Chemistry Laboratory Infectious Diseases Life Sciences Cell Culture See 35+     See less Intellectual Property Technology Planning Biotechnology Strategic Planning Pharmaceutical... Quality Systems Diagnostics Immunology Oncology Project Portfolio... Business Intelligence New Business Development Product Development Quality System Hardware Diagnostics Assay Development Pharmaceutical Industry Lifesciences Molecular Biology Flow Cytometry High Throughput... Business Development Biomarkers Genomics Proteomics Biopharmaceuticals Clinical Development Start-ups Biochemistry Cell Strategy Technology Transfer Drug Development Antibodies R&D Pharmacology Clinical Trials Commercialization Cross-functional Team... CRO Medical Devices Clinical Research Patents Validation Drug Discovery Chemistry Laboratory Infectious Diseases Life Sciences Cell Culture See 35+     See less Intellectual Property Technology Planning Biotechnology Strategic Planning Pharmaceutical... Quality Systems Diagnostics Immunology Oncology Project Portfolio... Business Intelligence New Business Development Product Development Quality System Hardware Diagnostics Assay Development Pharmaceutical Industry Lifesciences Molecular Biology Flow Cytometry High Throughput... Business Development Biomarkers Genomics Proteomics Biopharmaceuticals Clinical Development Start-ups Biochemistry Cell Strategy Technology Transfer Drug Development Antibodies R&D Pharmacology Clinical Trials Commercialization Cross-functional Team... CRO Medical Devices Clinical Research Patents Validation Drug Discovery Chemistry Laboratory Infectious Diseases Life Sciences Cell Culture See 35+     See less Education Massachusetts Institute of Technology - Sloan School of Management Executive Education,  Management , Corporate finace, Marketing, Bus analytics 2007  – 2007 University of California, San Diego Certificate in Biostatistics,  Biostatistics 2007  – 2007 Clinical Biostats, SAS University of California, San Diego Certificate in Regulatory Affairs,  Regulatory Affairs , A 2006  – 2006 Regulatory Compliance for drugs and biologics, GLP, GCP, GMP, QA/QC, IVD Stanford University PhD,  Molecular Pharmacology 1999  – 2002 Graduate work in Garry Nolan's Laboratory. Initiated the Stanford Proteomics effort. Developed the phosphoflow(R) technology platform and applications. Functionally characterized LFA-1/ICAM molecules in various immune contexts. Helped initiate phase 1 clinical trials in novel anti-HIV agent and re-tasking of drugs for new indications. Managed pharma/biotech contracted research projects. Activities and Societies:  FASEB MARC mentoring program ,  Irvington Institute Fellow ,  Bristol-Meyers Squibb-Fellow ,  Human Immunology Award ,  Herzenberg Prize ,  Upstate Signaling Award University of California, Berkeley BA/BA/BSC,  Biochemistry/Philosophy/Chemistry 1995  – 1999 Worked in Peter Schultz' laboratory in Dept of Chemistry. Discovered myoseverin, a compound that induced muscle de-differentiation. Nature Biotech [Front Cover], Chemistry&Biology [Front Cover] Activities and Societies:  Research editor for Berkeley Scientific Journal ,  CALPIRG ,  HIV education peer mentor ,  Studied abroad in Italy ,  Children's Hospital in Oakland volunteer ,  Biology Scholars Program Don Bosco Technical Institute Associate Certificate,  Graphic Communications 1991  – 1995 Massachusetts Institute of Technology - Sloan School of Management Executive Education,  Management , Corporate finace, Marketing, Bus analytics 2007  – 2007 Massachusetts Institute of Technology - Sloan School of Management Executive Education,  Management , Corporate finace, Marketing, Bus analytics 2007  – 2007 Massachusetts Institute of Technology - Sloan School of Management Executive Education,  Management , Corporate finace, Marketing, Bus analytics 2007  – 2007 University of California, San Diego Certificate in Biostatistics,  Biostatistics 2007  – 2007 Clinical Biostats, SAS University of California, San Diego Certificate in Biostatistics,  Biostatistics 2007  – 2007 Clinical Biostats, SAS University of California, San Diego Certificate in Biostatistics,  Biostatistics 2007  – 2007 Clinical Biostats, SAS University of California, San Diego Certificate in Regulatory Affairs,  Regulatory Affairs , A 2006  – 2006 Regulatory Compliance for drugs and biologics, GLP, GCP, GMP, QA/QC, IVD University of California, San Diego Certificate in Regulatory Affairs,  Regulatory Affairs , A 2006  – 2006 Regulatory Compliance for drugs and biologics, GLP, GCP, GMP, QA/QC, IVD University of California, San Diego Certificate in Regulatory Affairs,  Regulatory Affairs , A 2006  – 2006 Regulatory Compliance for drugs and biologics, GLP, GCP, GMP, QA/QC, IVD Stanford University PhD,  Molecular Pharmacology 1999  – 2002 Graduate work in Garry Nolan's Laboratory. Initiated the Stanford Proteomics effort. Developed the phosphoflow(R) technology platform and applications. Functionally characterized LFA-1/ICAM molecules in various immune contexts. Helped initiate phase 1 clinical trials in novel anti-HIV agent and re-tasking of drugs for new indications. Managed pharma/biotech contracted research projects. Activities and Societies:  FASEB MARC mentoring program ,  Irvington Institute Fellow ,  Bristol-Meyers Squibb-Fellow ,  Human Immunology Award ,  Herzenberg Prize ,  Upstate Signaling Award Stanford University PhD,  Molecular Pharmacology 1999  – 2002 Graduate work in Garry Nolan's Laboratory. Initiated the Stanford Proteomics effort. Developed the phosphoflow(R) technology platform and applications. Functionally characterized LFA-1/ICAM molecules in various immune contexts. Helped initiate phase 1 clinical trials in novel anti-HIV agent and re-tasking of drugs for new indications. Managed pharma/biotech contracted research projects. Activities and Societies:  FASEB MARC mentoring program ,  Irvington Institute Fellow ,  Bristol-Meyers Squibb-Fellow ,  Human Immunology Award ,  Herzenberg Prize ,  Upstate Signaling Award Stanford University PhD,  Molecular Pharmacology 1999  – 2002 Graduate work in Garry Nolan's Laboratory. Initiated the Stanford Proteomics effort. Developed the phosphoflow(R) technology platform and applications. Functionally characterized LFA-1/ICAM molecules in various immune contexts. Helped initiate phase 1 clinical trials in novel anti-HIV agent and re-tasking of drugs for new indications. Managed pharma/biotech contracted research projects. Activities and Societies:  FASEB MARC mentoring program ,  Irvington Institute Fellow ,  Bristol-Meyers Squibb-Fellow ,  Human Immunology Award ,  Herzenberg Prize ,  Upstate Signaling Award University of California, Berkeley BA/BA/BSC,  Biochemistry/Philosophy/Chemistry 1995  – 1999 Worked in Peter Schultz' laboratory in Dept of Chemistry. Discovered myoseverin, a compound that induced muscle de-differentiation. Nature Biotech [Front Cover], Chemistry&Biology [Front Cover] Activities and Societies:  Research editor for Berkeley Scientific Journal ,  CALPIRG ,  HIV education peer mentor ,  Studied abroad in Italy ,  Children's Hospital in Oakland volunteer ,  Biology Scholars Program University of California, Berkeley BA/BA/BSC,  Biochemistry/Philosophy/Chemistry 1995  – 1999 Worked in Peter Schultz' laboratory in Dept of Chemistry. Discovered myoseverin, a compound that induced muscle de-differentiation. Nature Biotech [Front Cover], Chemistry&Biology [Front Cover] Activities and Societies:  Research editor for Berkeley Scientific Journal ,  CALPIRG ,  HIV education peer mentor ,  Studied abroad in Italy ,  Children's Hospital in Oakland volunteer ,  Biology Scholars Program University of California, Berkeley BA/BA/BSC,  Biochemistry/Philosophy/Chemistry 1995  – 1999 Worked in Peter Schultz' laboratory in Dept of Chemistry. Discovered myoseverin, a compound that induced muscle de-differentiation. Nature Biotech [Front Cover], Chemistry&Biology [Front Cover] Activities and Societies:  Research editor for Berkeley Scientific Journal ,  CALPIRG ,  HIV education peer mentor ,  Studied abroad in Italy ,  Children's Hospital in Oakland volunteer ,  Biology Scholars Program Don Bosco Technical Institute Associate Certificate,  Graphic Communications 1991  – 1995 Don Bosco Technical Institute Associate Certificate,  Graphic Communications 1991  – 1995 Don Bosco Technical Institute Associate Certificate,  Graphic Communications 1991  – 1995 Honors & Awards Additional Honors & Awards Honors and Awards \n \n1998 National Science Foundation Honorable Mention \n1999 Howard Hughes Medical Institute Honorable Mention \n2000 Graduate Student Recognition \n2002 Investigator Award (Santa Cruz Biotechnology) \n2002-03 FOCIS Meeting Travel Award \n2003 AAI Minority Scientist Travel Award \n2003-2006 Bristol Meyer-Squibb-Irvington Institute Fellowship \n2004-2007 Human Immunology Award Dana Foundation \n2005 Herzenberg Prize \n2006 Upstate Young Signaling Award nominee \n2007 Kauffman Fellows Finalist \n2007 MIT T35 Young Innovator Award nominee \n2011 Ernst & Young Entrepreneur of the Year nominee Additional Honors & Awards Honors and Awards \n \n1998 National Science Foundation Honorable Mention \n1999 Howard Hughes Medical Institute Honorable Mention \n2000 Graduate Student Recognition \n2002 Investigator Award (Santa Cruz Biotechnology) \n2002-03 FOCIS Meeting Travel Award \n2003 AAI Minority Scientist Travel Award \n2003-2006 Bristol Meyer-Squibb-Irvington Institute Fellowship \n2004-2007 Human Immunology Award Dana Foundation \n2005 Herzenberg Prize \n2006 Upstate Young Signaling Award nominee \n2007 Kauffman Fellows Finalist \n2007 MIT T35 Young Innovator Award nominee \n2011 Ernst & Young Entrepreneur of the Year nominee Additional Honors & Awards Honors and Awards \n \n1998 National Science Foundation Honorable Mention \n1999 Howard Hughes Medical Institute Honorable Mention \n2000 Graduate Student Recognition \n2002 Investigator Award (Santa Cruz Biotechnology) \n2002-03 FOCIS Meeting Travel Award \n2003 AAI Minority Scientist Travel Award \n2003-2006 Bristol Meyer-Squibb-Irvington Institute Fellowship \n2004-2007 Human Immunology Award Dana Foundation \n2005 Herzenberg Prize \n2006 Upstate Young Signaling Award nominee \n2007 Kauffman Fellows Finalist \n2007 MIT T35 Young Innovator Award nominee \n2011 Ernst & Young Entrepreneur of the Year nominee Additional Honors & Awards Honors and Awards \n \n1998 National Science Foundation Honorable Mention \n1999 Howard Hughes Medical Institute Honorable Mention \n2000 Graduate Student Recognition \n2002 Investigator Award (Santa Cruz Biotechnology) \n2002-03 FOCIS Meeting Travel Award \n2003 AAI Minority Scientist Travel Award \n2003-2006 Bristol Meyer-Squibb-Irvington Institute Fellowship \n2004-2007 Human Immunology Award Dana Foundation \n2005 Herzenberg Prize \n2006 Upstate Young Signaling Award nominee \n2007 Kauffman Fellows Finalist \n2007 MIT T35 Young Innovator Award nominee \n2011 Ernst & Young Entrepreneur of the Year nominee ", "Experience Senior Scientist Stanford University Senior Scientist Stanford University Senior Scientist Stanford University ", "Experience Senior Scientist Stanford University School of Medicine Senior Scientist Stanford University School of Medicine Senior Scientist Stanford University School of Medicine ", "Experience Senior Scientist Stanford University School of Medicine Senior Scientist Stanford University School of Medicine Senior Scientist Stanford University School of Medicine Skills Cell Biology In Vivo Cell Based Assays Signal Transduction Stem Cells Molecular Biology Skills  Cell Biology In Vivo Cell Based Assays Signal Transduction Stem Cells Molecular Biology Cell Biology In Vivo Cell Based Assays Signal Transduction Stem Cells Molecular Biology Cell Biology In Vivo Cell Based Assays Signal Transduction Stem Cells Molecular Biology ", "Summary Developing software tools for high-resolution (nanometer) neuroimaging at the Janelia Farm Research Center, where we are trying to understand the architecture and computation methods of the brain. \n \nOn the side, enjoying web development and creative writing. Summary Developing software tools for high-resolution (nanometer) neuroimaging at the Janelia Farm Research Center, where we are trying to understand the architecture and computation methods of the brain. \n \nOn the side, enjoying web development and creative writing. Developing software tools for high-resolution (nanometer) neuroimaging at the Janelia Farm Research Center, where we are trying to understand the architecture and computation methods of the brain. \n \nOn the side, enjoying web development and creative writing. Developing software tools for high-resolution (nanometer) neuroimaging at the Janelia Farm Research Center, where we are trying to understand the architecture and computation methods of the brain. \n \nOn the side, enjoying web development and creative writing. Experience Senior Software Engineer Howard Hughes Medical Institute January 2010  – Present (5 years 8 months) Developing software tools for visualization, analysis, and storage of high-resolution neuroimaging. Chief areas of interest: multi-scale visualization of sparse volumes; distributed, versioned image-related datastores. Founder Writertopia August 2003  – Present (12 years 1 month) Writertopia hosts the eligibility pages for the Campbell Award for Best New Sci-Fi/Fantasy Writer, some college workshops, and a few tools. Through Writertopia development, I've explored (from most recent to ancient): Go web development, Amazon Web Services, Google App Engine and its python APIs, Ruby on Rails, PHP and various shared web hosting providers. Senior Scientist Stanford University March 2006  –  November 2007  (1 year 9 months) Development of open source, patient-specific cardiovascular simulation programs as part of Simbios, the NIH Center for Biocomputation at Stanford. Provided Ruby on Rails expertise during the development of Simbiome, an online directory of resources for physics-based simulation of biomedical structures. Senior Scientist Varian Medical Systems October 1995  –  October 2001  (6 years 1 month) One of the founding software engineers of Multimedia Medical Systems, which was acquired by Varian Medical in June 1999. Designed, developed, and supported a software system for real-time radiotherapy planning in an intra-operative setting. By October 2001, the VariSeed system was employed at over 600 hospitals and clinics. Created algorithms for the optimal positioning of radioisotope sources in the treatment of prostate cancer. Developed prototypes for dose-optimized source placement using both simulated annealing and a proprietary method for direct evaluation of user-defined rules. Assistant Professor of Research in Neurosurgery University of Virginia May 1995  –  October 1995  (6 months) Directed the Neurosurgical Visualization Lab, which explored the use of 3D image analysis and human-computer interfaces for neurosurgical planning. Recruited by mentor to start a company with other lab members. After departure to commercial sector, continued to serve as a resource for lab efforts. Senior Software Engineer Howard Hughes Medical Institute January 2010  – Present (5 years 8 months) Developing software tools for visualization, analysis, and storage of high-resolution neuroimaging. Chief areas of interest: multi-scale visualization of sparse volumes; distributed, versioned image-related datastores. Senior Software Engineer Howard Hughes Medical Institute January 2010  – Present (5 years 8 months) Developing software tools for visualization, analysis, and storage of high-resolution neuroimaging. Chief areas of interest: multi-scale visualization of sparse volumes; distributed, versioned image-related datastores. Founder Writertopia August 2003  – Present (12 years 1 month) Writertopia hosts the eligibility pages for the Campbell Award for Best New Sci-Fi/Fantasy Writer, some college workshops, and a few tools. Through Writertopia development, I've explored (from most recent to ancient): Go web development, Amazon Web Services, Google App Engine and its python APIs, Ruby on Rails, PHP and various shared web hosting providers. Founder Writertopia August 2003  – Present (12 years 1 month) Writertopia hosts the eligibility pages for the Campbell Award for Best New Sci-Fi/Fantasy Writer, some college workshops, and a few tools. Through Writertopia development, I've explored (from most recent to ancient): Go web development, Amazon Web Services, Google App Engine and its python APIs, Ruby on Rails, PHP and various shared web hosting providers. Senior Scientist Stanford University March 2006  –  November 2007  (1 year 9 months) Development of open source, patient-specific cardiovascular simulation programs as part of Simbios, the NIH Center for Biocomputation at Stanford. Provided Ruby on Rails expertise during the development of Simbiome, an online directory of resources for physics-based simulation of biomedical structures. Senior Scientist Stanford University March 2006  –  November 2007  (1 year 9 months) Development of open source, patient-specific cardiovascular simulation programs as part of Simbios, the NIH Center for Biocomputation at Stanford. Provided Ruby on Rails expertise during the development of Simbiome, an online directory of resources for physics-based simulation of biomedical structures. Senior Scientist Varian Medical Systems October 1995  –  October 2001  (6 years 1 month) One of the founding software engineers of Multimedia Medical Systems, which was acquired by Varian Medical in June 1999. Designed, developed, and supported a software system for real-time radiotherapy planning in an intra-operative setting. By October 2001, the VariSeed system was employed at over 600 hospitals and clinics. Created algorithms for the optimal positioning of radioisotope sources in the treatment of prostate cancer. Developed prototypes for dose-optimized source placement using both simulated annealing and a proprietary method for direct evaluation of user-defined rules. Senior Scientist Varian Medical Systems October 1995  –  October 2001  (6 years 1 month) One of the founding software engineers of Multimedia Medical Systems, which was acquired by Varian Medical in June 1999. Designed, developed, and supported a software system for real-time radiotherapy planning in an intra-operative setting. By October 2001, the VariSeed system was employed at over 600 hospitals and clinics. Created algorithms for the optimal positioning of radioisotope sources in the treatment of prostate cancer. Developed prototypes for dose-optimized source placement using both simulated annealing and a proprietary method for direct evaluation of user-defined rules. Assistant Professor of Research in Neurosurgery University of Virginia May 1995  –  October 1995  (6 months) Directed the Neurosurgical Visualization Lab, which explored the use of 3D image analysis and human-computer interfaces for neurosurgical planning. Recruited by mentor to start a company with other lab members. After departure to commercial sector, continued to serve as a resource for lab efforts. Assistant Professor of Research in Neurosurgery University of Virginia May 1995  –  October 1995  (6 months) Directed the Neurosurgical Visualization Lab, which explored the use of 3D image analysis and human-computer interfaces for neurosurgical planning. Recruited by mentor to start a company with other lab members. After departure to commercial sector, continued to serve as a resource for lab efforts. Skills Go Python C++ Scientific Visualization Spatial Databases Algorithms Research Big Data Life Sciences Image Analysis Digital Image Processing Skills  Go Python C++ Scientific Visualization Spatial Databases Algorithms Research Big Data Life Sciences Image Analysis Digital Image Processing Go Python C++ Scientific Visualization Spatial Databases Algorithms Research Big Data Life Sciences Image Analysis Digital Image Processing Go Python C++ Scientific Visualization Spatial Databases Algorithms Research Big Data Life Sciences Image Analysis Digital Image Processing Education Stanford University B.S.,  Biological Sciences ,  Computer Science Coterminal B.S/M.S. student in Biological Sciences & Computer Science. Worked for the Faculty Author Development Program designing courseware for PC and Mac. Developed 3D ultrasound software after winning a Firestone Major Grant for Extended Research. Studied AI, medical computing, computer graphics, and premedical sciences. Activities and Societies:  ACM Programming Team ,  Stanford Symphonic Band University of Virginia Ph.D.,  Biomedical Engineering Ph.D. dissertation: \"Semiautomated Segmentation and Display of Three-Dimensional Images of the Head.\" Activities and Societies:  Sigma Xi ,  ACM Programming Team University of Virginia M.D.,  Medicine Medical Scientist Training Program: full-tuition and stipend fellowship for joint MD and PhD training. St. Mary's International School Tokyo, Japan. Stanford University B.S.,  Biological Sciences ,  Computer Science Coterminal B.S/M.S. student in Biological Sciences & Computer Science. Worked for the Faculty Author Development Program designing courseware for PC and Mac. Developed 3D ultrasound software after winning a Firestone Major Grant for Extended Research. Studied AI, medical computing, computer graphics, and premedical sciences. Activities and Societies:  ACM Programming Team ,  Stanford Symphonic Band Stanford University B.S.,  Biological Sciences ,  Computer Science Coterminal B.S/M.S. student in Biological Sciences & Computer Science. Worked for the Faculty Author Development Program designing courseware for PC and Mac. Developed 3D ultrasound software after winning a Firestone Major Grant for Extended Research. Studied AI, medical computing, computer graphics, and premedical sciences. Activities and Societies:  ACM Programming Team ,  Stanford Symphonic Band Stanford University B.S.,  Biological Sciences ,  Computer Science Coterminal B.S/M.S. student in Biological Sciences & Computer Science. Worked for the Faculty Author Development Program designing courseware for PC and Mac. Developed 3D ultrasound software after winning a Firestone Major Grant for Extended Research. Studied AI, medical computing, computer graphics, and premedical sciences. Activities and Societies:  ACM Programming Team ,  Stanford Symphonic Band University of Virginia Ph.D.,  Biomedical Engineering Ph.D. dissertation: \"Semiautomated Segmentation and Display of Three-Dimensional Images of the Head.\" Activities and Societies:  Sigma Xi ,  ACM Programming Team University of Virginia Ph.D.,  Biomedical Engineering Ph.D. dissertation: \"Semiautomated Segmentation and Display of Three-Dimensional Images of the Head.\" Activities and Societies:  Sigma Xi ,  ACM Programming Team University of Virginia Ph.D.,  Biomedical Engineering Ph.D. dissertation: \"Semiautomated Segmentation and Display of Three-Dimensional Images of the Head.\" Activities and Societies:  Sigma Xi ,  ACM Programming Team University of Virginia M.D.,  Medicine Medical Scientist Training Program: full-tuition and stipend fellowship for joint MD and PhD training. University of Virginia M.D.,  Medicine Medical Scientist Training Program: full-tuition and stipend fellowship for joint MD and PhD training. University of Virginia M.D.,  Medicine Medical Scientist Training Program: full-tuition and stipend fellowship for joint MD and PhD training. St. Mary's International School Tokyo, Japan. St. Mary's International School Tokyo, Japan. St. Mary's International School Tokyo, Japan. Honors & Awards Additional Honors & Awards Best Screenplay, First De Anza Screenplay Competition, 2008. \nGrand Prize Winner, 2003 Writers of the Future Contest. \nWhitfield-Randolph Endowed Award at University of Virginia for notable MD/PhD nervous system research. Additional Honors & Awards Best Screenplay, First De Anza Screenplay Competition, 2008. \nGrand Prize Winner, 2003 Writers of the Future Contest. \nWhitfield-Randolph Endowed Award at University of Virginia for notable MD/PhD nervous system research. Additional Honors & Awards Best Screenplay, First De Anza Screenplay Competition, 2008. \nGrand Prize Winner, 2003 Writers of the Future Contest. \nWhitfield-Randolph Endowed Award at University of Virginia for notable MD/PhD nervous system research. Additional Honors & Awards Best Screenplay, First De Anza Screenplay Competition, 2008. \nGrand Prize Winner, 2003 Writers of the Future Contest. \nWhitfield-Randolph Endowed Award at University of Virginia for notable MD/PhD nervous system research. ", "Experience Professor and Dean of College of Life Science and Chemistry, Vice President Wuhan Donghu University August 2013  – Present (2 years 1 month) Wuhan, China CEO GD Biotechnology Inc October 2011  – Present (3 years 11 months) Senior Scientist Stanford University School of Medicine November 2009  – Present (5 years 10 months) President, CSO & Founder QX System Inc June 2011  –  June 2013  (2 years 1 month) 1165 A O'Brien Drive, Menlo Park, CA 94025 Senior Consultant Axela June 2009  –  October 2009  (5 months) Senior Scientist Genetix September 2006  –  October 2009  (3 years 2 months) Senior Scientist Applied Imaging December 2005  –  September 2006  (10 months) Senior Scientist NuGEN Technologies February 2001  –  November 2004  (3 years 10 months) Research Scientist DNA Sciences October 2000  –  February 2001  (5 months) Scientist Affymetrix October 1999  –  October 2000  (1 year 1 month) Scientist Merck October 1998  –  October 1999  (1 year 1 month) California Research Scientist Japanese Human Genome Project April 1992  –  November 1993  (1 year 8 months) Tokyo, Japan Professor and Dean of College of Life Science and Chemistry, Vice President Wuhan Donghu University August 2013  – Present (2 years 1 month) Wuhan, China Professor and Dean of College of Life Science and Chemistry, Vice President Wuhan Donghu University August 2013  – Present (2 years 1 month) Wuhan, China CEO GD Biotechnology Inc October 2011  – Present (3 years 11 months) CEO GD Biotechnology Inc October 2011  – Present (3 years 11 months) Senior Scientist Stanford University School of Medicine November 2009  – Present (5 years 10 months) Senior Scientist Stanford University School of Medicine November 2009  – Present (5 years 10 months) President, CSO & Founder QX System Inc June 2011  –  June 2013  (2 years 1 month) 1165 A O'Brien Drive, Menlo Park, CA 94025 President, CSO & Founder QX System Inc June 2011  –  June 2013  (2 years 1 month) 1165 A O'Brien Drive, Menlo Park, CA 94025 Senior Consultant Axela June 2009  –  October 2009  (5 months) Senior Consultant Axela June 2009  –  October 2009  (5 months) Senior Scientist Genetix September 2006  –  October 2009  (3 years 2 months) Senior Scientist Genetix September 2006  –  October 2009  (3 years 2 months) Senior Scientist Applied Imaging December 2005  –  September 2006  (10 months) Senior Scientist Applied Imaging December 2005  –  September 2006  (10 months) Senior Scientist NuGEN Technologies February 2001  –  November 2004  (3 years 10 months) Senior Scientist NuGEN Technologies February 2001  –  November 2004  (3 years 10 months) Research Scientist DNA Sciences October 2000  –  February 2001  (5 months) Research Scientist DNA Sciences October 2000  –  February 2001  (5 months) Scientist Affymetrix October 1999  –  October 2000  (1 year 1 month) Scientist Affymetrix October 1999  –  October 2000  (1 year 1 month) Scientist Merck October 1998  –  October 1999  (1 year 1 month) California Scientist Merck October 1998  –  October 1999  (1 year 1 month) California Research Scientist Japanese Human Genome Project April 1992  –  November 1993  (1 year 8 months) Tokyo, Japan Research Scientist Japanese Human Genome Project April 1992  –  November 1993  (1 year 8 months) Tokyo, Japan Languages Japanese Japanese Japanese Skills Biotechnology Lifesciences Molecular Biology Drug Discovery Genomics Biochemistry Technology Transfer Pharmaceutical Industry Oncology Clinical Development Cell Culture Commercialization Immunology Cell Biology R&D Drug Development FDA Infectious Diseases Cancer Microscopy PCR Assay Development See 7+     See less Skills  Biotechnology Lifesciences Molecular Biology Drug Discovery Genomics Biochemistry Technology Transfer Pharmaceutical Industry Oncology Clinical Development Cell Culture Commercialization Immunology Cell Biology R&D Drug Development FDA Infectious Diseases Cancer Microscopy PCR Assay Development See 7+     See less Biotechnology Lifesciences Molecular Biology Drug Discovery Genomics Biochemistry Technology Transfer Pharmaceutical Industry Oncology Clinical Development Cell Culture Commercialization Immunology Cell Biology R&D Drug Development FDA Infectious Diseases Cancer Microscopy PCR Assay Development See 7+     See less Biotechnology Lifesciences Molecular Biology Drug Discovery Genomics Biochemistry Technology Transfer Pharmaceutical Industry Oncology Clinical Development Cell Culture Commercialization Immunology Cell Biology R&D Drug Development FDA Infectious Diseases Cancer Microscopy PCR Assay Development See 7+     See less Education Stanford University Postdoc,  Molecular Biology 1997  – 1998 University of Florida Postdoc,  Pathology 1993  – 1996 Tokyo University of Marine Science and Technology Ph.D.,  Biotechnology 1988  – 1992 Mie University MS,  Development Biology 1986  – 1988 Huazhong Agricultural Universit BS,  Fish Biology 1978  – 1982 Stanford University Postdoc,  Molecular Biology 1997  – 1998 Stanford University Postdoc,  Molecular Biology 1997  – 1998 Stanford University Postdoc,  Molecular Biology 1997  – 1998 University of Florida Postdoc,  Pathology 1993  – 1996 University of Florida Postdoc,  Pathology 1993  – 1996 University of Florida Postdoc,  Pathology 1993  – 1996 Tokyo University of Marine Science and Technology Ph.D.,  Biotechnology 1988  – 1992 Tokyo University of Marine Science and Technology Ph.D.,  Biotechnology 1988  – 1992 Tokyo University of Marine Science and Technology Ph.D.,  Biotechnology 1988  – 1992 Mie University MS,  Development Biology 1986  – 1988 Mie University MS,  Development Biology 1986  – 1988 Mie University MS,  Development Biology 1986  – 1988 Huazhong Agricultural Universit BS,  Fish Biology 1978  – 1982 Huazhong Agricultural Universit BS,  Fish Biology 1978  – 1982 Huazhong Agricultural Universit BS,  Fish Biology 1978  – 1982 ", "Experience Senior scientist Stanford University Professor Peking university 1961  –  1987  (26 years) Beijing Senior scientist Stanford University Senior scientist Stanford University Professor Peking university 1961  –  1987  (26 years) Beijing Professor Peking university 1961  –  1987  (26 years) Beijing ", "Experience Senior Scientist Stanford University 2014  – Present (1 year) Senior Scientist Stanford University 2014  – Present (1 year) Senior Scientist Stanford University 2014  – Present (1 year) Languages   Skills Molecular Biology Developmental Biology Evolution Genomics Bioinformatics Computational Biology Microscopes Fluorescence Microscopy Image Processing Graph Theory Matlab Perl C++ Java Java Enterprise Edition Struts Science Sequencing Biology Genetics See 5+     See less Skills  Molecular Biology Developmental Biology Evolution Genomics Bioinformatics Computational Biology Microscopes Fluorescence Microscopy Image Processing Graph Theory Matlab Perl C++ Java Java Enterprise Edition Struts Science Sequencing Biology Genetics See 5+     See less Molecular Biology Developmental Biology Evolution Genomics Bioinformatics Computational Biology Microscopes Fluorescence Microscopy Image Processing Graph Theory Matlab Perl C++ Java Java Enterprise Edition Struts Science Sequencing Biology Genetics See 5+     See less Molecular Biology Developmental Biology Evolution Genomics Bioinformatics Computational Biology Microscopes Fluorescence Microscopy Image Processing Graph Theory Matlab Perl C++ Java Java Enterprise Edition Struts Science Sequencing Biology Genetics See 5+     See less Education Indian Institute of Technology, Delhi B.Tech + M.Tech (Dual degree) 1999  – 2004 Indian Institute of Technology, Delhi B.Tech + M.Tech (Dual degree) 1999  – 2004 Indian Institute of Technology, Delhi B.Tech + M.Tech (Dual degree) 1999  – 2004 Indian Institute of Technology, Delhi B.Tech + M.Tech (Dual degree) 1999  – 2004 Honors & Awards ", "Summary Accomplished software developer, with highly successful products in science and industry. Scientist, innovator, with several patents pending and over 20 papers published in peer reviewed journals. Specialties:C, C++, STL, JAVA, Swing, Junit, PHP, Shell, Bash, SQL, XML, HTML, Linux, Unix, Eclipse, Visual C++, Office, OpenOffice, Subversion, CVS, Maven, MultiThreading, Hadoop, Map/Reduce, Oozie, MPI, OOD, OOP, MySql, Oracle, LAMP, Algorithms, Data Structures, Code Optimization Summary Accomplished software developer, with highly successful products in science and industry. Scientist, innovator, with several patents pending and over 20 papers published in peer reviewed journals. Specialties:C, C++, STL, JAVA, Swing, Junit, PHP, Shell, Bash, SQL, XML, HTML, Linux, Unix, Eclipse, Visual C++, Office, OpenOffice, Subversion, CVS, Maven, MultiThreading, Hadoop, Map/Reduce, Oozie, MPI, OOD, OOP, MySql, Oracle, LAMP, Algorithms, Data Structures, Code Optimization Accomplished software developer, with highly successful products in science and industry. Scientist, innovator, with several patents pending and over 20 papers published in peer reviewed journals. Specialties:C, C++, STL, JAVA, Swing, Junit, PHP, Shell, Bash, SQL, XML, HTML, Linux, Unix, Eclipse, Visual C++, Office, OpenOffice, Subversion, CVS, Maven, MultiThreading, Hadoop, Map/Reduce, Oozie, MPI, OOD, OOP, MySql, Oracle, LAMP, Algorithms, Data Structures, Code Optimization Accomplished software developer, with highly successful products in science and industry. Scientist, innovator, with several patents pending and over 20 papers published in peer reviewed journals. Specialties:C, C++, STL, JAVA, Swing, Junit, PHP, Shell, Bash, SQL, XML, HTML, Linux, Unix, Eclipse, Visual C++, Office, OpenOffice, Subversion, CVS, Maven, MultiThreading, Hadoop, Map/Reduce, Oozie, MPI, OOD, OOP, MySql, Oracle, LAMP, Algorithms, Data Structures, Code Optimization Experience Principal Software Dev Eng Yahoo March 2013  – Present (2 years 6 months) • Invented algorithm to unify the Guaranteed and non-Guaranteed Display Ad marketplaces using realtime bids at serve time; implemented and pushed to production. \n• Invented algorithm to improve ad delivery using feedback controller with minutes latency. In production, this increased revenues of guaranteed marketplace by reducing under-delivery of ads. Senior Software Engineer Yahoo 2007  –  February 2013  (6 years) • Pioneered IMS2 (Inventory Management System) for next generation guaranteed display advertizing platform. Instrumental in building, enhancing and maintaining IMS2. \n• Select and train developers to build out IMS2. \n• Developed C++ program to characterize targeting attributes of billions of user visits per day. \n• Co-invented algorithm for optimal allocation of inventory. Improved performance of algorithm by factor of N, reducing run time to seconds. \n• Architect of scalable system for processing inventory allocation on Hadoop grid. \n• Designed and implemented infrastructure components for IMS2 online systems. \n• Produced tools using LAMP to gain fine grain visibility of running ads. \n• Enhanced capabilities of inventory allocation to support GD2, the next generation of guaranteed display ad serving system, including a fast path optimizer system to achieve low booking-to-serving latency. Principle Scientist, Software Complete Genomics 2006  –  2007  (1 year) • Architect of high performance pipeline using parallel computing on a Linux cluster, as infrastructure to sequence the complete human genome (3 billion base pairs). \n• Implemented C++ modules for the pipeline, including clustering, combinatorial analysis and DNA assembly. \n• Developed clustering software in C++ using mixture models to characterize 4 dimensional imaging data for DNA sequencing. \n• Developed statistical and visualization tools to characterize DNA sequencing data. Director of Software Development Callida Genomics (spin off from Nuvelo Pharmaceuticals) 2002  –  2006  (4 years) •\tSupervised development of software for the HyChip, a DNA sequencing product \n•\tManaged program to develop DNA sequencing software, from image analysis to producing finished sequence, as well a user interface for customers. \n•\tArchitect of core business software to handle statistical analysis of DNA sequencing data \n•\tDeveloped image analysis program to identify features (DNA nano-balls) and track the features across a time sequence of images. \n•\tDeveloped software to detect/identify genetic components of pathogens for a Department of Energy grant related to bio-defense. Senior Software Engineer Nuvelo Pharmaceuticals February 2000  –  December 2001  (1 year 11 months) •\tSupervised software engineers to build prototype of DNA sequencing product.  \n•\tDeveloped an image analysis program in C++ to locate and score DNA probes. \n•\tDesigned and implemented a C++ framework to handle analysis requirements of various DNA sequencing platforms used by biochemists.  \n•\tBuilt three applications using the framework: 1) HyChip sequencing prototype, 2) analyzing data from Luminex beads and 3) characterizing DNA probes on the Affymetrix GeneChip. Senior Scientist Stanford University January 1993  –  February 2000  (7 years 2 months) •\tLead developer of real-time C program to command, control and download data from a sophisticated physics experiment to test properties of 2D fluids in microgravity of the Space Shuttle (The Confined Helium Experiment).  \n•\tProgrammed in VxWorks RTOS on a Mips processor using threads, pipes, message queues and semaphores. \n•\tDevised custom compression algorithm for space shuttle telemetry.  \n•\tWrote data analysis program in C for ~2GB of space shuttle data.  \n•\tMade extensive use of numerical methods such as singular value decomposition, least-squared fitting and robust estimation.  \n•\tBuilt instrument and software to test the Renormalization Group Theory, in microgravity of the Space Shuttle (The Lambda Point Experiment). \n•\tDeveloped software to calculate the optimal shape of a shielded superconducting magnet. Used magnet to build paramagnetic thermometer that achieved record sensitivity (sub-nanoKelvin resolution). Principal Software Dev Eng Yahoo March 2013  – Present (2 years 6 months) • Invented algorithm to unify the Guaranteed and non-Guaranteed Display Ad marketplaces using realtime bids at serve time; implemented and pushed to production. \n• Invented algorithm to improve ad delivery using feedback controller with minutes latency. In production, this increased revenues of guaranteed marketplace by reducing under-delivery of ads. Principal Software Dev Eng Yahoo March 2013  – Present (2 years 6 months) • Invented algorithm to unify the Guaranteed and non-Guaranteed Display Ad marketplaces using realtime bids at serve time; implemented and pushed to production. \n• Invented algorithm to improve ad delivery using feedback controller with minutes latency. In production, this increased revenues of guaranteed marketplace by reducing under-delivery of ads. Senior Software Engineer Yahoo 2007  –  February 2013  (6 years) • Pioneered IMS2 (Inventory Management System) for next generation guaranteed display advertizing platform. Instrumental in building, enhancing and maintaining IMS2. \n• Select and train developers to build out IMS2. \n• Developed C++ program to characterize targeting attributes of billions of user visits per day. \n• Co-invented algorithm for optimal allocation of inventory. Improved performance of algorithm by factor of N, reducing run time to seconds. \n• Architect of scalable system for processing inventory allocation on Hadoop grid. \n• Designed and implemented infrastructure components for IMS2 online systems. \n• Produced tools using LAMP to gain fine grain visibility of running ads. \n• Enhanced capabilities of inventory allocation to support GD2, the next generation of guaranteed display ad serving system, including a fast path optimizer system to achieve low booking-to-serving latency. Senior Software Engineer Yahoo 2007  –  February 2013  (6 years) • Pioneered IMS2 (Inventory Management System) for next generation guaranteed display advertizing platform. Instrumental in building, enhancing and maintaining IMS2. \n• Select and train developers to build out IMS2. \n• Developed C++ program to characterize targeting attributes of billions of user visits per day. \n• Co-invented algorithm for optimal allocation of inventory. Improved performance of algorithm by factor of N, reducing run time to seconds. \n• Architect of scalable system for processing inventory allocation on Hadoop grid. \n• Designed and implemented infrastructure components for IMS2 online systems. \n• Produced tools using LAMP to gain fine grain visibility of running ads. \n• Enhanced capabilities of inventory allocation to support GD2, the next generation of guaranteed display ad serving system, including a fast path optimizer system to achieve low booking-to-serving latency. Principle Scientist, Software Complete Genomics 2006  –  2007  (1 year) • Architect of high performance pipeline using parallel computing on a Linux cluster, as infrastructure to sequence the complete human genome (3 billion base pairs). \n• Implemented C++ modules for the pipeline, including clustering, combinatorial analysis and DNA assembly. \n• Developed clustering software in C++ using mixture models to characterize 4 dimensional imaging data for DNA sequencing. \n• Developed statistical and visualization tools to characterize DNA sequencing data. Principle Scientist, Software Complete Genomics 2006  –  2007  (1 year) • Architect of high performance pipeline using parallel computing on a Linux cluster, as infrastructure to sequence the complete human genome (3 billion base pairs). \n• Implemented C++ modules for the pipeline, including clustering, combinatorial analysis and DNA assembly. \n• Developed clustering software in C++ using mixture models to characterize 4 dimensional imaging data for DNA sequencing. \n• Developed statistical and visualization tools to characterize DNA sequencing data. Director of Software Development Callida Genomics (spin off from Nuvelo Pharmaceuticals) 2002  –  2006  (4 years) •\tSupervised development of software for the HyChip, a DNA sequencing product \n•\tManaged program to develop DNA sequencing software, from image analysis to producing finished sequence, as well a user interface for customers. \n•\tArchitect of core business software to handle statistical analysis of DNA sequencing data \n•\tDeveloped image analysis program to identify features (DNA nano-balls) and track the features across a time sequence of images. \n•\tDeveloped software to detect/identify genetic components of pathogens for a Department of Energy grant related to bio-defense. Director of Software Development Callida Genomics (spin off from Nuvelo Pharmaceuticals) 2002  –  2006  (4 years) •\tSupervised development of software for the HyChip, a DNA sequencing product \n•\tManaged program to develop DNA sequencing software, from image analysis to producing finished sequence, as well a user interface for customers. \n•\tArchitect of core business software to handle statistical analysis of DNA sequencing data \n•\tDeveloped image analysis program to identify features (DNA nano-balls) and track the features across a time sequence of images. \n•\tDeveloped software to detect/identify genetic components of pathogens for a Department of Energy grant related to bio-defense. Senior Software Engineer Nuvelo Pharmaceuticals February 2000  –  December 2001  (1 year 11 months) •\tSupervised software engineers to build prototype of DNA sequencing product.  \n•\tDeveloped an image analysis program in C++ to locate and score DNA probes. \n•\tDesigned and implemented a C++ framework to handle analysis requirements of various DNA sequencing platforms used by biochemists.  \n•\tBuilt three applications using the framework: 1) HyChip sequencing prototype, 2) analyzing data from Luminex beads and 3) characterizing DNA probes on the Affymetrix GeneChip. Senior Software Engineer Nuvelo Pharmaceuticals February 2000  –  December 2001  (1 year 11 months) •\tSupervised software engineers to build prototype of DNA sequencing product.  \n•\tDeveloped an image analysis program in C++ to locate and score DNA probes. \n•\tDesigned and implemented a C++ framework to handle analysis requirements of various DNA sequencing platforms used by biochemists.  \n•\tBuilt three applications using the framework: 1) HyChip sequencing prototype, 2) analyzing data from Luminex beads and 3) characterizing DNA probes on the Affymetrix GeneChip. Senior Scientist Stanford University January 1993  –  February 2000  (7 years 2 months) •\tLead developer of real-time C program to command, control and download data from a sophisticated physics experiment to test properties of 2D fluids in microgravity of the Space Shuttle (The Confined Helium Experiment).  \n•\tProgrammed in VxWorks RTOS on a Mips processor using threads, pipes, message queues and semaphores. \n•\tDevised custom compression algorithm for space shuttle telemetry.  \n•\tWrote data analysis program in C for ~2GB of space shuttle data.  \n•\tMade extensive use of numerical methods such as singular value decomposition, least-squared fitting and robust estimation.  \n•\tBuilt instrument and software to test the Renormalization Group Theory, in microgravity of the Space Shuttle (The Lambda Point Experiment). \n•\tDeveloped software to calculate the optimal shape of a shielded superconducting magnet. Used magnet to build paramagnetic thermometer that achieved record sensitivity (sub-nanoKelvin resolution). Senior Scientist Stanford University January 1993  –  February 2000  (7 years 2 months) •\tLead developer of real-time C program to command, control and download data from a sophisticated physics experiment to test properties of 2D fluids in microgravity of the Space Shuttle (The Confined Helium Experiment).  \n•\tProgrammed in VxWorks RTOS on a Mips processor using threads, pipes, message queues and semaphores. \n•\tDevised custom compression algorithm for space shuttle telemetry.  \n•\tWrote data analysis program in C for ~2GB of space shuttle data.  \n•\tMade extensive use of numerical methods such as singular value decomposition, least-squared fitting and robust estimation.  \n•\tBuilt instrument and software to test the Renormalization Group Theory, in microgravity of the Space Shuttle (The Lambda Point Experiment). \n•\tDeveloped software to calculate the optimal shape of a shielded superconducting magnet. Used magnet to build paramagnetic thermometer that achieved record sensitivity (sub-nanoKelvin resolution). Skills Algorithms Linux Subversion C++ Unix Software Development Hadoop Object Oriented Design Java XML Skills  Algorithms Linux Subversion C++ Unix Software Development Hadoop Object Oriented Design Java XML Algorithms Linux Subversion C++ Unix Software Development Hadoop Object Oriented Design Java XML Algorithms Linux Subversion C++ Unix Software Development Hadoop Object Oriented Design Java XML Education The Ohio State University Ph.D.,  Physics University of Minnesota-Twin Cities BS,  Physics The Ohio State University Ph.D.,  Physics The Ohio State University Ph.D.,  Physics The Ohio State University Ph.D.,  Physics University of Minnesota-Twin Cities BS,  Physics University of Minnesota-Twin Cities BS,  Physics University of Minnesota-Twin Cities BS,  Physics ", "Experience Professor Ecole Centrale Paris December 2003  – Present (11 years 9 months) Senior Scientist Stanford University September 1999  –  October 2002  (3 years 2 months) Research Associate Stanford University August 1993  –  August 1999  (6 years 1 month) Professor Ecole Centrale Paris December 2003  – Present (11 years 9 months) Professor Ecole Centrale Paris December 2003  – Present (11 years 9 months) Senior Scientist Stanford University September 1999  –  October 2002  (3 years 2 months) Senior Scientist Stanford University September 1999  –  October 2002  (3 years 2 months) Research Associate Stanford University August 1993  –  August 1999  (6 years 1 month) Research Associate Stanford University August 1993  –  August 1999  (6 years 1 month) Education Stanford University Ph.D.,  Mechanical Engineering 1988  – 1993 Ecole Centrale Paris Ingénieur,  Engineering 1985  – 1988 Stanford University Ph.D.,  Mechanical Engineering 1988  – 1993 Stanford University Ph.D.,  Mechanical Engineering 1988  – 1993 Stanford University Ph.D.,  Mechanical Engineering 1988  – 1993 Ecole Centrale Paris Ingénieur,  Engineering 1985  – 1988 Ecole Centrale Paris Ingénieur,  Engineering 1985  – 1988 Ecole Centrale Paris Ingénieur,  Engineering 1985  – 1988 ", "Experience Senior Scientist Stanford University 2008  – Present (7 years) Senior Lecturer / Assistant Professor Technion - Israel Institute of Technology 2005  –  2007  (2 years) Assistant Professor Cornell University 2001  –  2005  (4 years) Post doctoral fellow Stanford University 1998  –  2000  (2 years) PhD Student, Research Assistant The Hebrew University of Jerusalem 1992  –  1998  (6 years) Senior Scientist Stanford University 2008  – Present (7 years) Senior Scientist Stanford University 2008  – Present (7 years) Senior Lecturer / Assistant Professor Technion - Israel Institute of Technology 2005  –  2007  (2 years) Senior Lecturer / Assistant Professor Technion - Israel Institute of Technology 2005  –  2007  (2 years) Assistant Professor Cornell University 2001  –  2005  (4 years) Assistant Professor Cornell University 2001  –  2005  (4 years) Post doctoral fellow Stanford University 1998  –  2000  (2 years) Post doctoral fellow Stanford University 1998  –  2000  (2 years) PhD Student, Research Assistant The Hebrew University of Jerusalem 1992  –  1998  (6 years) PhD Student, Research Assistant The Hebrew University of Jerusalem 1992  –  1998  (6 years) Education The Hebrew University PhD,  Computer Science ,  Computational Biology ,  Bioinformatics 1993  – 1998 The Hebrew University B.Sc.,  Physics ,  Math 1989  – 1992 The Hebrew University PhD,  Computer Science ,  Computational Biology ,  Bioinformatics 1993  – 1998 The Hebrew University PhD,  Computer Science ,  Computational Biology ,  Bioinformatics 1993  – 1998 The Hebrew University PhD,  Computer Science ,  Computational Biology ,  Bioinformatics 1993  – 1998 The Hebrew University B.Sc.,  Physics ,  Math 1989  – 1992 The Hebrew University B.Sc.,  Physics ,  Math 1989  – 1992 The Hebrew University B.Sc.,  Physics ,  Math 1989  – 1992 ", "Skills Digital Photography Leadership Mergers & Acquisitions Software Development Program Management Enterprise Software Start-ups Strategic Planning Competitive Analysis Mergers Business Process Integration strategic marketing Skills  Digital Photography Leadership Mergers & Acquisitions Software Development Program Management Enterprise Software Start-ups Strategic Planning Competitive Analysis Mergers Business Process Integration strategic marketing Digital Photography Leadership Mergers & Acquisitions Software Development Program Management Enterprise Software Start-ups Strategic Planning Competitive Analysis Mergers Business Process Integration strategic marketing Digital Photography Leadership Mergers & Acquisitions Software Development Program Management Enterprise Software Start-ups Strategic Planning Competitive Analysis Mergers Business Process Integration strategic marketing ", "Experience Associate Professor (Research) Stanford University February 2008  – Present (7 years 7 months) Senior Scientist Stanford University 2006  –  2008  (2 years) Research Associate Stanford University 1999  –  2006  (7 years) Associate Professor (Research) Stanford University February 2008  – Present (7 years 7 months) Associate Professor (Research) Stanford University February 2008  – Present (7 years 7 months) Senior Scientist Stanford University 2006  –  2008  (2 years) Senior Scientist Stanford University 2006  –  2008  (2 years) Research Associate Stanford University 1999  –  2006  (7 years) Research Associate Stanford University 1999  –  2006  (7 years) Skills Reservoir... Geostatistics Geophysics Matlab Mathematical Modeling Research Seismic Data Analysis Numerical Modeling Simulation Physics Teaching Science Rock Physics Earth Science Geology Modeling Scientific Computing See 3+     See less Skills  Reservoir... Geostatistics Geophysics Matlab Mathematical Modeling Research Seismic Data Analysis Numerical Modeling Simulation Physics Teaching Science Rock Physics Earth Science Geology Modeling Scientific Computing See 3+     See less Reservoir... Geostatistics Geophysics Matlab Mathematical Modeling Research Seismic Data Analysis Numerical Modeling Simulation Physics Teaching Science Rock Physics Earth Science Geology Modeling Scientific Computing See 3+     See less Reservoir... Geostatistics Geophysics Matlab Mathematical Modeling Research Seismic Data Analysis Numerical Modeling Simulation Physics Teaching Science Rock Physics Earth Science Geology Modeling Scientific Computing See 3+     See less Education Stanford University Ph.D.,  Geophysics 1989  – 1995 BHU, Varanasi, India Master of Science (M.S.),  Geophysics BHU, Varanasi, India Bachelor of Science (B.S.),  Physics Stanford University Ph.D.,  Geophysics 1989  – 1995 Stanford University Ph.D.,  Geophysics 1989  – 1995 Stanford University Ph.D.,  Geophysics 1989  – 1995 BHU, Varanasi, India Master of Science (M.S.),  Geophysics BHU, Varanasi, India Master of Science (M.S.),  Geophysics BHU, Varanasi, India Master of Science (M.S.),  Geophysics BHU, Varanasi, India Bachelor of Science (B.S.),  Physics BHU, Varanasi, India Bachelor of Science (B.S.),  Physics BHU, Varanasi, India Bachelor of Science (B.S.),  Physics ", "Experience Founder, Acting CEO Leuvas Therapeutics April 2013  – Present (2 years 5 months) SF Bay Area Co-founded start-up clinical-stage company focused on novel therapeutics to address unmet medical needs in neuro-inflammatory and other inflammatory disease. Consultant/Senior Advisor/Acting Officer Biotechnology Drug Development Consulting April 2006  – Present (9 years 5 months) Strategic consulting in translational medicine/drug development programs - driving drugs from discovery/preclinical through first-in-man studies and into later phase clinical development. Successful experience in multiple therapeutic areas. \n \nSelected projects: \n \n*Acting Head of Product Development for Sutro Biopharma (2011-2012), lead antibody drug conjugate and bifunctional programs. \n \n*Acting CSO/COO, TFT Therapeutics 2007-2009, partnered with Anges (Japan) on atopic dermatology drug development; transitioned project to Anges. \n \n*Senior advisor for Anges (Japan), led/advised research program (2009-2011) leading to successful licensing of atopic dermatology therapeutic to major Japanese pharmaceutical company. \n \n*Senior Advisor/Consultant for Anesiva (2007-2008); co-led team that successfully negotiated terms with FDA, executed additional studies, and prepared CTD (NDA) through approval of in-licensed pain product. Senior Vice President, Research Anesiva September 2001  –  April 2006  (4 years 8 months) • Effectively built and led research and preclinical development, including basic discovery, target ID, design, screening, optimization and selection of clinical candidates, formulation, PK, IND- and CTD-enabling preclinical studies, focused on vascular biology, oncology, antibiotics, inflammation, drug delivery, and dermatology. \n• Successfully initiated and led the NF-κB Inhibitor program to on-time, successful first-in-man POC studies.  \n• Successfully initiated and led a product life cycle mgmt program – designed and executed IND-enabling POC studies, tox, and PK/PD studies in a novel indication for Phase III drug-device product (including design, fabrication of a novel device).  \n• Partnered with colleagues on clinical study design, regulatory strategy, and FDA negotiations. \n• Partnering of lead product – developed and presented technical and value-proposition and due-diligence material resulting in a $600 million partnering deal with major pharmaceutical company. Senior Vice President, Research Corgentech Inc 2000  –  2006  (6 years) Staff Scientist/Senior Principle Scientist DNAX Research Institute (now Schering-Plough Biopharma) 1997  –  2001  (4 years) Senior Principal Scientist DNAX Research Institute October 1997  –  January 2000  (2 years 4 months) Led Chemokine Development Program Senior Principle Scientist Schering-Plough Biopharma (formerly DNAX) 1997  –  2000  (3 years) Senior Scientist Stanford University School of Medicine 1992  –  1997  (5 years) Independently funded research scientist (NIH RO1 and NIH program project) focused on vascular biology and remodeling, leukocyte trafficking, mucosal immunity, and cell trafficking and adhesion. Lilly Research Fellow Eli Lilly and Company 1987  –  1989  (2 years) Discovery research focused on vascular biology, atherosclerosis, production and screening of monoclonal antibodies to discover and characterize novel drug targets. Founder, Acting CEO Leuvas Therapeutics April 2013  – Present (2 years 5 months) SF Bay Area Co-founded start-up clinical-stage company focused on novel therapeutics to address unmet medical needs in neuro-inflammatory and other inflammatory disease. Founder, Acting CEO Leuvas Therapeutics April 2013  – Present (2 years 5 months) SF Bay Area Co-founded start-up clinical-stage company focused on novel therapeutics to address unmet medical needs in neuro-inflammatory and other inflammatory disease. Consultant/Senior Advisor/Acting Officer Biotechnology Drug Development Consulting April 2006  – Present (9 years 5 months) Strategic consulting in translational medicine/drug development programs - driving drugs from discovery/preclinical through first-in-man studies and into later phase clinical development. Successful experience in multiple therapeutic areas. \n \nSelected projects: \n \n*Acting Head of Product Development for Sutro Biopharma (2011-2012), lead antibody drug conjugate and bifunctional programs. \n \n*Acting CSO/COO, TFT Therapeutics 2007-2009, partnered with Anges (Japan) on atopic dermatology drug development; transitioned project to Anges. \n \n*Senior advisor for Anges (Japan), led/advised research program (2009-2011) leading to successful licensing of atopic dermatology therapeutic to major Japanese pharmaceutical company. \n \n*Senior Advisor/Consultant for Anesiva (2007-2008); co-led team that successfully negotiated terms with FDA, executed additional studies, and prepared CTD (NDA) through approval of in-licensed pain product. Consultant/Senior Advisor/Acting Officer Biotechnology Drug Development Consulting April 2006  – Present (9 years 5 months) Strategic consulting in translational medicine/drug development programs - driving drugs from discovery/preclinical through first-in-man studies and into later phase clinical development. Successful experience in multiple therapeutic areas. \n \nSelected projects: \n \n*Acting Head of Product Development for Sutro Biopharma (2011-2012), lead antibody drug conjugate and bifunctional programs. \n \n*Acting CSO/COO, TFT Therapeutics 2007-2009, partnered with Anges (Japan) on atopic dermatology drug development; transitioned project to Anges. \n \n*Senior advisor for Anges (Japan), led/advised research program (2009-2011) leading to successful licensing of atopic dermatology therapeutic to major Japanese pharmaceutical company. \n \n*Senior Advisor/Consultant for Anesiva (2007-2008); co-led team that successfully negotiated terms with FDA, executed additional studies, and prepared CTD (NDA) through approval of in-licensed pain product. Senior Vice President, Research Anesiva September 2001  –  April 2006  (4 years 8 months) • Effectively built and led research and preclinical development, including basic discovery, target ID, design, screening, optimization and selection of clinical candidates, formulation, PK, IND- and CTD-enabling preclinical studies, focused on vascular biology, oncology, antibiotics, inflammation, drug delivery, and dermatology. \n• Successfully initiated and led the NF-κB Inhibitor program to on-time, successful first-in-man POC studies.  \n• Successfully initiated and led a product life cycle mgmt program – designed and executed IND-enabling POC studies, tox, and PK/PD studies in a novel indication for Phase III drug-device product (including design, fabrication of a novel device).  \n• Partnered with colleagues on clinical study design, regulatory strategy, and FDA negotiations. \n• Partnering of lead product – developed and presented technical and value-proposition and due-diligence material resulting in a $600 million partnering deal with major pharmaceutical company. Senior Vice President, Research Anesiva September 2001  –  April 2006  (4 years 8 months) • Effectively built and led research and preclinical development, including basic discovery, target ID, design, screening, optimization and selection of clinical candidates, formulation, PK, IND- and CTD-enabling preclinical studies, focused on vascular biology, oncology, antibiotics, inflammation, drug delivery, and dermatology. \n• Successfully initiated and led the NF-κB Inhibitor program to on-time, successful first-in-man POC studies.  \n• Successfully initiated and led a product life cycle mgmt program – designed and executed IND-enabling POC studies, tox, and PK/PD studies in a novel indication for Phase III drug-device product (including design, fabrication of a novel device).  \n• Partnered with colleagues on clinical study design, regulatory strategy, and FDA negotiations. \n• Partnering of lead product – developed and presented technical and value-proposition and due-diligence material resulting in a $600 million partnering deal with major pharmaceutical company. Senior Vice President, Research Corgentech Inc 2000  –  2006  (6 years) Senior Vice President, Research Corgentech Inc 2000  –  2006  (6 years) Staff Scientist/Senior Principle Scientist DNAX Research Institute (now Schering-Plough Biopharma) 1997  –  2001  (4 years) Staff Scientist/Senior Principle Scientist DNAX Research Institute (now Schering-Plough Biopharma) 1997  –  2001  (4 years) Senior Principal Scientist DNAX Research Institute October 1997  –  January 2000  (2 years 4 months) Led Chemokine Development Program Senior Principal Scientist DNAX Research Institute October 1997  –  January 2000  (2 years 4 months) Led Chemokine Development Program Senior Principle Scientist Schering-Plough Biopharma (formerly DNAX) 1997  –  2000  (3 years) Senior Principle Scientist Schering-Plough Biopharma (formerly DNAX) 1997  –  2000  (3 years) Senior Scientist Stanford University School of Medicine 1992  –  1997  (5 years) Independently funded research scientist (NIH RO1 and NIH program project) focused on vascular biology and remodeling, leukocyte trafficking, mucosal immunity, and cell trafficking and adhesion. Senior Scientist Stanford University School of Medicine 1992  –  1997  (5 years) Independently funded research scientist (NIH RO1 and NIH program project) focused on vascular biology and remodeling, leukocyte trafficking, mucosal immunity, and cell trafficking and adhesion. Lilly Research Fellow Eli Lilly and Company 1987  –  1989  (2 years) Discovery research focused on vascular biology, atherosclerosis, production and screening of monoclonal antibodies to discover and characterize novel drug targets. Lilly Research Fellow Eli Lilly and Company 1987  –  1989  (2 years) Discovery research focused on vascular biology, atherosclerosis, production and screening of monoclonal antibodies to discover and characterize novel drug targets. Skills FDA negotiations Translational Medicine Biotechnology Drug Discovery Clinical Development Oncology Pharmaceutical Industry IND Biomarkers Immunology Clinical Trials Team Building Team Leadership Management Consulting Strategic Leadership Antibodies Drug Development Clinical Research Neuroscience In Vivo See 5+     See less Skills  FDA negotiations Translational Medicine Biotechnology Drug Discovery Clinical Development Oncology Pharmaceutical Industry IND Biomarkers Immunology Clinical Trials Team Building Team Leadership Management Consulting Strategic Leadership Antibodies Drug Development Clinical Research Neuroscience In Vivo See 5+     See less FDA negotiations Translational Medicine Biotechnology Drug Discovery Clinical Development Oncology Pharmaceutical Industry IND Biomarkers Immunology Clinical Trials Team Building Team Leadership Management Consulting Strategic Leadership Antibodies Drug Development Clinical Research Neuroscience In Vivo See 5+     See less FDA negotiations Translational Medicine Biotechnology Drug Discovery Clinical Development Oncology Pharmaceutical Industry IND Biomarkers Immunology Clinical Trials Team Building Team Leadership Management Consulting Strategic Leadership Antibodies Drug Development Clinical Research Neuroscience In Vivo See 5+     See less Education Stanford University School of Medicine Postdoctoral Fellow,  Immunology ,  vascular biology 1989  – 1992 Penn State University Ph.D.,  Molecular and Cell Biology 1982  – 1987 Clarkson B.S.,  Biology 1978  – 1982 Bishop Magin HS Stanford University School of Medicine Postdoctoral Fellow,  Immunology ,  vascular biology 1989  – 1992 Stanford University School of Medicine Postdoctoral Fellow,  Immunology ,  vascular biology 1989  – 1992 Stanford University School of Medicine Postdoctoral Fellow,  Immunology ,  vascular biology 1989  – 1992 Penn State University Ph.D.,  Molecular and Cell Biology 1982  – 1987 Penn State University Ph.D.,  Molecular and Cell Biology 1982  – 1987 Penn State University Ph.D.,  Molecular and Cell Biology 1982  – 1987 Clarkson B.S.,  Biology 1978  – 1982 Clarkson B.S.,  Biology 1978  – 1982 Clarkson B.S.,  Biology 1978  – 1982 Bishop Magin HS Bishop Magin HS Bishop Magin HS ", "Summary I have prepared and prosecuted U.S., international and foreign patent applications for corporate clients, universities and non-profit institutions for over 15 years. My practice emphasis is in biotechnology including applications relating to stem cells, therapeutic proteins, immunogens, antibodies, vaccines, methods of treatment, diagnostics, pharmaceuticals and medical devices. I am a senior member of the Life Sciences Group at Klarquist Sparkman, LLP.  Summary I have prepared and prosecuted U.S., international and foreign patent applications for corporate clients, universities and non-profit institutions for over 15 years. My practice emphasis is in biotechnology including applications relating to stem cells, therapeutic proteins, immunogens, antibodies, vaccines, methods of treatment, diagnostics, pharmaceuticals and medical devices. I am a senior member of the Life Sciences Group at Klarquist Sparkman, LLP.  I have prepared and prosecuted U.S., international and foreign patent applications for corporate clients, universities and non-profit institutions for over 15 years. My practice emphasis is in biotechnology including applications relating to stem cells, therapeutic proteins, immunogens, antibodies, vaccines, methods of treatment, diagnostics, pharmaceuticals and medical devices. I am a senior member of the Life Sciences Group at Klarquist Sparkman, LLP.  I have prepared and prosecuted U.S., international and foreign patent applications for corporate clients, universities and non-profit institutions for over 15 years. My practice emphasis is in biotechnology including applications relating to stem cells, therapeutic proteins, immunogens, antibodies, vaccines, methods of treatment, diagnostics, pharmaceuticals and medical devices. I am a senior member of the Life Sciences Group at Klarquist Sparkman, LLP.  Experience Patent Agent Klarquist Sparkman, LLP August 1999  – Present (16 years 1 month) Patent Agent Fish & Richardson P.C. 1997  –  1999  (2 years) Menlo Park, CA Senior Scientist Stanford University 1993  –  1995  (2 years) Stanford, CA Postdoctoral Fellow Standford University 1991  –  1993  (2 years) Research Assistant Stanford University 1990  –  1991  (1 year) Stanford, CA Postdoctoral Fellow UCSF July 1989  –  September 1990  (1 year 3 months) San Francisco Bay Area Patent Agent Klarquist Sparkman, LLP August 1999  – Present (16 years 1 month) Patent Agent Klarquist Sparkman, LLP August 1999  – Present (16 years 1 month) Patent Agent Fish & Richardson P.C. 1997  –  1999  (2 years) Menlo Park, CA Patent Agent Fish & Richardson P.C. 1997  –  1999  (2 years) Menlo Park, CA Senior Scientist Stanford University 1993  –  1995  (2 years) Stanford, CA Senior Scientist Stanford University 1993  –  1995  (2 years) Stanford, CA Postdoctoral Fellow Standford University 1991  –  1993  (2 years) Postdoctoral Fellow Standford University 1991  –  1993  (2 years) Research Assistant Stanford University 1990  –  1991  (1 year) Stanford, CA Research Assistant Stanford University 1990  –  1991  (1 year) Stanford, CA Postdoctoral Fellow UCSF July 1989  –  September 1990  (1 year 3 months) San Francisco Bay Area Postdoctoral Fellow UCSF July 1989  –  September 1990  (1 year 3 months) San Francisco Bay Area Skills Prosecution Patentability Patents Intellectual Property Legal Research Biotechnology Legal Writing Molecular Biology Cell Biology Monoclonal Antibodies Cancer Biology Immunology Environmental Toxicology Patent Prosecution Technical Writing Patent Portfolio... Biochemistry See 2+     See less Skills  Prosecution Patentability Patents Intellectual Property Legal Research Biotechnology Legal Writing Molecular Biology Cell Biology Monoclonal Antibodies Cancer Biology Immunology Environmental Toxicology Patent Prosecution Technical Writing Patent Portfolio... Biochemistry See 2+     See less Prosecution Patentability Patents Intellectual Property Legal Research Biotechnology Legal Writing Molecular Biology Cell Biology Monoclonal Antibodies Cancer Biology Immunology Environmental Toxicology Patent Prosecution Technical Writing Patent Portfolio... Biochemistry See 2+     See less Prosecution Patentability Patents Intellectual Property Legal Research Biotechnology Legal Writing Molecular Biology Cell Biology Monoclonal Antibodies Cancer Biology Immunology Environmental Toxicology Patent Prosecution Technical Writing Patent Portfolio... Biochemistry See 2+     See less Education Cold Spring Harbor Laboratory Doctor of Philosophy (Ph.D.) 1984  – 1988 Stony Brook University Ph.D.,  Molecular Genetics 1984  – 1988 Massachusetts Institute of Technology Ph.D Candidate,  Environmental Toxicology 1982  – 1984 UC Davis Bachelor of Science (B.S.),  Environmental Toxicology 1978  – 1982 Activities and Societies:  Phi Kappa Phi\nDepartmental Citation Homestead High School High School Diploma 1974  – 1978 Cold Spring Harbor Laboratory Doctor of Philosophy (Ph.D.) 1984  – 1988 Cold Spring Harbor Laboratory Doctor of Philosophy (Ph.D.) 1984  – 1988 Cold Spring Harbor Laboratory Doctor of Philosophy (Ph.D.) 1984  – 1988 Stony Brook University Ph.D.,  Molecular Genetics 1984  – 1988 Stony Brook University Ph.D.,  Molecular Genetics 1984  – 1988 Stony Brook University Ph.D.,  Molecular Genetics 1984  – 1988 Massachusetts Institute of Technology Ph.D Candidate,  Environmental Toxicology 1982  – 1984 Massachusetts Institute of Technology Ph.D Candidate,  Environmental Toxicology 1982  – 1984 Massachusetts Institute of Technology Ph.D Candidate,  Environmental Toxicology 1982  – 1984 UC Davis Bachelor of Science (B.S.),  Environmental Toxicology 1978  – 1982 Activities and Societies:  Phi Kappa Phi\nDepartmental Citation UC Davis Bachelor of Science (B.S.),  Environmental Toxicology 1978  – 1982 Activities and Societies:  Phi Kappa Phi\nDepartmental Citation UC Davis Bachelor of Science (B.S.),  Environmental Toxicology 1978  – 1982 Activities and Societies:  Phi Kappa Phi\nDepartmental Citation Homestead High School High School Diploma 1974  – 1978 Homestead High School High School Diploma 1974  – 1978 Homestead High School High School Diploma 1974  – 1978 ", "Experience Senior Scientist Stanford University 1984  – Present (31 years) Discipline Scientist NASA HQ 2000  –  2004  (4 years) Senior Scientist Stanford University 1984  – Present (31 years) Senior Scientist Stanford University 1984  – Present (31 years) Discipline Scientist NASA HQ 2000  –  2004  (4 years) Discipline Scientist NASA HQ 2000  –  2004  (4 years) Skills Science Fortran Physics Mathematical Modeling LaTeX Data Analysis Simulations Scientific Computing Numerical Analysis Experimentation Research Statistics Spectroscopy Astrophysics Skills  Science Fortran Physics Mathematical Modeling LaTeX Data Analysis Simulations Scientific Computing Numerical Analysis Experimentation Research Statistics Spectroscopy Astrophysics Science Fortran Physics Mathematical Modeling LaTeX Data Analysis Simulations Scientific Computing Numerical Analysis Experimentation Research Statistics Spectroscopy Astrophysics Science Fortran Physics Mathematical Modeling LaTeX Data Analysis Simulations Scientific Computing Numerical Analysis Experimentation Research Statistics Spectroscopy Astrophysics Education Stanford University Doctor of Philosophy (Ph.D.),  Applied Physics Calvin College Bachelor of Arts (B.A.),  Physics and Mathematics The Prairie School Stanford University Doctor of Philosophy (Ph.D.),  Applied Physics Stanford University Doctor of Philosophy (Ph.D.),  Applied Physics Stanford University Doctor of Philosophy (Ph.D.),  Applied Physics Calvin College Bachelor of Arts (B.A.),  Physics and Mathematics Calvin College Bachelor of Arts (B.A.),  Physics and Mathematics Calvin College Bachelor of Arts (B.A.),  Physics and Mathematics The Prairie School The Prairie School The Prairie School ", "Experience Senior Scientist Stanford University Senior Scientist Stanford University Senior Scientist Stanford University ", "Experience senior scientist Stanford University School of Medicine senior scientist Stanford University School of Medicine senior scientist Stanford University School of Medicine "]}