{"position": "Senior Technical Architect", "company": "IBM", "profiles": ["Experience Senior Technical Architect IBM June 2015  – Present (3 months) Senior Technical Architect IBM June 2015  – Present (3 months) Senior Technical Architect IBM June 2015  – Present (3 months) Skills Skills     ", "Summary Outcomes focused with a proven track record of introducing solutions that align delivery and performance, increase revenue opportunities, reduce costs, and increase client engagement. Brings excellence in solution delivery through a detailed understanding of IT and business operating models and service frameworks. Demonstrated experience in business analysis, project management and ability to empower teams to ensure service delivery solutions are a ‘fit for purpose’. Ensures deliverables are met through continuous improvement, quality control and monitoring of risk factors that may impact on services. Recognised for establishing credibility by building sustainable business relationships with win-win solutions. \n \nSpecialties: Strategic IT delivery and program management, Product, Solutions Proposals, Cost Analysis, ITIL Support & Integration, Resource Management, Process Improvement, Business Relationship Management, Scope of Work Proposals, Outsourcing Management, Systems Planning & Design, Managed Services Operations, Regional Team Leadership, Business Reporting & Operations, Change Control Management, Enterprise Change Management, Contract Negotiation & Management, Stakeholder & Vendor Management Summary Outcomes focused with a proven track record of introducing solutions that align delivery and performance, increase revenue opportunities, reduce costs, and increase client engagement. Brings excellence in solution delivery through a detailed understanding of IT and business operating models and service frameworks. Demonstrated experience in business analysis, project management and ability to empower teams to ensure service delivery solutions are a ‘fit for purpose’. Ensures deliverables are met through continuous improvement, quality control and monitoring of risk factors that may impact on services. Recognised for establishing credibility by building sustainable business relationships with win-win solutions. \n \nSpecialties: Strategic IT delivery and program management, Product, Solutions Proposals, Cost Analysis, ITIL Support & Integration, Resource Management, Process Improvement, Business Relationship Management, Scope of Work Proposals, Outsourcing Management, Systems Planning & Design, Managed Services Operations, Regional Team Leadership, Business Reporting & Operations, Change Control Management, Enterprise Change Management, Contract Negotiation & Management, Stakeholder & Vendor Management Outcomes focused with a proven track record of introducing solutions that align delivery and performance, increase revenue opportunities, reduce costs, and increase client engagement. Brings excellence in solution delivery through a detailed understanding of IT and business operating models and service frameworks. Demonstrated experience in business analysis, project management and ability to empower teams to ensure service delivery solutions are a ‘fit for purpose’. Ensures deliverables are met through continuous improvement, quality control and monitoring of risk factors that may impact on services. Recognised for establishing credibility by building sustainable business relationships with win-win solutions. \n \nSpecialties: Strategic IT delivery and program management, Product, Solutions Proposals, Cost Analysis, ITIL Support & Integration, Resource Management, Process Improvement, Business Relationship Management, Scope of Work Proposals, Outsourcing Management, Systems Planning & Design, Managed Services Operations, Regional Team Leadership, Business Reporting & Operations, Change Control Management, Enterprise Change Management, Contract Negotiation & Management, Stakeholder & Vendor Management Outcomes focused with a proven track record of introducing solutions that align delivery and performance, increase revenue opportunities, reduce costs, and increase client engagement. Brings excellence in solution delivery through a detailed understanding of IT and business operating models and service frameworks. Demonstrated experience in business analysis, project management and ability to empower teams to ensure service delivery solutions are a ‘fit for purpose’. Ensures deliverables are met through continuous improvement, quality control and monitoring of risk factors that may impact on services. Recognised for establishing credibility by building sustainable business relationships with win-win solutions. \n \nSpecialties: Strategic IT delivery and program management, Product, Solutions Proposals, Cost Analysis, ITIL Support & Integration, Resource Management, Process Improvement, Business Relationship Management, Scope of Work Proposals, Outsourcing Management, Systems Planning & Design, Managed Services Operations, Regional Team Leadership, Business Reporting & Operations, Change Control Management, Enterprise Change Management, Contract Negotiation & Management, Stakeholder & Vendor Management Skills Project Delivery Vendor Management Integration Business Analysis Change Management Process Improvement Management Enterprise Software IT Strategy Professional Services Stakeholder Management Program Management Outsourcing Solution Architecture Requirements Gathering Leadership Business Intelligence PMO ITIL Service Delivery Business Relationship... Resource Management Business Requirements User Acceptance Testing Consulting Cross-functional Team... Project Management Team Leadership Agile & Waterfall... Agile Project Management See 15+     See less Skills  Project Delivery Vendor Management Integration Business Analysis Change Management Process Improvement Management Enterprise Software IT Strategy Professional Services Stakeholder Management Program Management Outsourcing Solution Architecture Requirements Gathering Leadership Business Intelligence PMO ITIL Service Delivery Business Relationship... Resource Management Business Requirements User Acceptance Testing Consulting Cross-functional Team... Project Management Team Leadership Agile & Waterfall... Agile Project Management See 15+     See less Project Delivery Vendor Management Integration Business Analysis Change Management Process Improvement Management Enterprise Software IT Strategy Professional Services Stakeholder Management Program Management Outsourcing Solution Architecture Requirements Gathering Leadership Business Intelligence PMO ITIL Service Delivery Business Relationship... Resource Management Business Requirements User Acceptance Testing Consulting Cross-functional Team... Project Management Team Leadership Agile & Waterfall... Agile Project Management See 15+     See less Project Delivery Vendor Management Integration Business Analysis Change Management Process Improvement Management Enterprise Software IT Strategy Professional Services Stakeholder Management Program Management Outsourcing Solution Architecture Requirements Gathering Leadership Business Intelligence PMO ITIL Service Delivery Business Relationship... Resource Management Business Requirements User Acceptance Testing Consulting Cross-functional Team... Project Management Team Leadership Agile & Waterfall... Agile Project Management See 15+     See less Education PM-Partners 2013  – 2013 Vmware 2009  – 2009 Excom 2008  – 2008 Excom 2008  – 2008 Microsoft MCITP 2008 / MCSE 2003 / MCSE 2003 Messaging PM-Partners 2013  – 2013 PM-Partners 2013  – 2013 PM-Partners 2013  – 2013 Vmware 2009  – 2009 Vmware 2009  – 2009 Vmware 2009  – 2009 Excom 2008  – 2008 Excom 2008  – 2008 Excom 2008  – 2008 Excom 2008  – 2008 Excom 2008  – 2008 Excom 2008  – 2008 Microsoft MCITP 2008 / MCSE 2003 / MCSE 2003 Messaging Microsoft MCITP 2008 / MCSE 2003 / MCSE 2003 Messaging Microsoft MCITP 2008 / MCSE 2003 / MCSE 2003 Messaging Honors & Awards Additional Honors & Awards Awarded 2009 APAC Consulting Services High Achiever Award for outstanding achievement and customer service Additional Honors & Awards Awarded 2009 APAC Consulting Services High Achiever Award for outstanding achievement and customer service Additional Honors & Awards Awarded 2009 APAC Consulting Services High Achiever Award for outstanding achievement and customer service Additional Honors & Awards Awarded 2009 APAC Consulting Services High Achiever Award for outstanding achievement and customer service ", "Skills Virtualization Enterprise Architecture Telecommunications Change Management Linux Solution Architecture Management Cloud Computing Technical Architecture Wireless Business Strategy Business Intelligence Negotiation Strategic Financial... Strategic Planning Integration IT Strategy Data Center IT Service Management Infrastructure Pre-sales ITIL Hardware Service Delivery Enterprise Software Disaster Recovery IT Outsourcing Outsourcing Storage IT Management System Deployment See 16+     See less Skills  Virtualization Enterprise Architecture Telecommunications Change Management Linux Solution Architecture Management Cloud Computing Technical Architecture Wireless Business Strategy Business Intelligence Negotiation Strategic Financial... Strategic Planning Integration IT Strategy Data Center IT Service Management Infrastructure Pre-sales ITIL Hardware Service Delivery Enterprise Software Disaster Recovery IT Outsourcing Outsourcing Storage IT Management System Deployment See 16+     See less Virtualization Enterprise Architecture Telecommunications Change Management Linux Solution Architecture Management Cloud Computing Technical Architecture Wireless Business Strategy Business Intelligence Negotiation Strategic Financial... Strategic Planning Integration IT Strategy Data Center IT Service Management Infrastructure Pre-sales ITIL Hardware Service Delivery Enterprise Software Disaster Recovery IT Outsourcing Outsourcing Storage IT Management System Deployment See 16+     See less Virtualization Enterprise Architecture Telecommunications Change Management Linux Solution Architecture Management Cloud Computing Technical Architecture Wireless Business Strategy Business Intelligence Negotiation Strategic Financial... Strategic Planning Integration IT Strategy Data Center IT Service Management Infrastructure Pre-sales ITIL Hardware Service Delivery Enterprise Software Disaster Recovery IT Outsourcing Outsourcing Storage IT Management System Deployment See 16+     See less ", "Experience CTO IT Management Consulting September 2014  – Present (1 year) IT Management Consulting projects, including IT Strategy consulting for a department store business and web/social media strategy for a Hampshire-based charity. Interim Chief Technology Officer conject AG June 2012  –  January 2013  (8 months) Woking •\tBrought in to revitalise the development and impact of the IT function. Reporting to the CEO as a member of the Board, with six direct reports and a larger team of around 90. \n•\tEstablished a three year product strategy and built a fit-for-purpose product management team \n•\tTransformed the software development organisation into new teams to underpin the product development strategy, enabling faster product delivery and higher customer satisfaction \n•\tDeveloped a new culture of co-operation in the IT organisation, overcoming geographical and political barriers. The teams were based in multiple locations in India, Germany and the UK Chief Technology Officer Imaginatik plc 2001  –  June 2012  (11 years) Winchester •\tAccountable for the creation and execution of the company’s IT strategy reporting to the CEO \n•\tBuilt a Software-as-a-Service platform which consistently exceeded customer expectations, in both availability and speed of delivery \n•\tAchieved a listing on the AIM market of the London Stock Exchange as a result of the value of recurring Software-as-a-service business \n•\tEnabled the provision of web-centric services to customers and their supply chains, enhancing the value of customers' investments and creating a new revenue stream  \n•\tDirected a project to increase the performance and robustness of the global offering by implementing a world-wide system of cloud-based proxy servers, working with Akamai and other suppliers. This sped up access times and opened up sales to multi-national customers, resulting in an increase in sales of 25% \n•\tIntroduced a series of efficiency improvements and targeted investments, resulting in reducing the cost of managing internal systems by 40% while adding capabilities \n•\tMoved the company to a procedures-based footing capable of meeting the ISO 27001 Information Systems Management Standard Chief Technology Officer and co-founder ideadollar.com 2000  –  2001  (1 year) San Francisco and Winchester This dotcom was set up as a unique innovation and ideas generation management company. \n•\tResponsible for the development and ongoing support of the company’s website and internal computing systems and the creation and operation of company strategy and policy across all areas of the business. \n•\tCreated a community of more than a hundred volunteers who managed the operation of a complex set of tasks (ideadollar assessors) – including motivation and self-policing \n•\tSpecified and developed artificial Intelligence tools to support processes and run the website.  \n•\tDeveloped crowdsourcing techniques to solve the problem of rapidly assessing thousands of ideas. European Offering Manager IBM e-Business Services 1998  –  2000  (2 years) Hursley •\tAccountable for a portfolio of Service Offerings. Was appointed to rescue the main service offering, turning-around a previously loss-making business and exceeding annual targets of £4.5m Europe-wide \n•\tManaged sales, marketing, helpdesk, delivery and support of a number of Software-as-a-service offerings \n•\tIdentified a range of potential new service offerings \n•\tLed six service delivery teams based across Europe, with a total of 110 employees Senior Technical Architect IBM United Kingdom Ltd 1996  –  1998  (2 years) North Harbour •\tLead architect for managed hosted systems in outsourced customers. \n•\tAssisted in the winning of large service bids (£10m+). \n•\tConceived and constructed a new, more efficient, support service model for Lotus Notes. \n•\tLed a team to Boston which wrote and published a book; “Secrets to Running Lotus Notes: The Decisions No-one Tells You How to Make”. Project Manager, \"Genie\" IBM UK PC Company 1994  –  1996  (2 years) Basingstoke •\tBuilt a team to deliver a transformation project providing a new information system for PC Dealers \n•\tDirected a project to design, build and refresh the software on all 350 company laptops \n•\tMet all objectives, and helped raise customer satisfaction within the company from 66% to 78%. \n•\tEarned a Director's Award for exceptional achievement e-commerce Consultancy, Sales and Support IBM United Kingdom Ltd 1991  –  1994  (3 years) South Bank As a country-wide expert, worked as a UK product expert and technical consultant, working with companies such as Guinness, National Westminster Bank and Unilever. Formed an international special interest group of technical specialists. Systems Engineer IBM United Kingdom Ltd 1988  –  1991  (3 years) Richmond, Warwick Extensive training in IBM hardware, software and methodologies, graduating top in Systems Engineers’ School, and winning a number of awards for work in selling, writing and supporting software, and for providing high quality on-site customer support. CTO IT Management Consulting September 2014  – Present (1 year) IT Management Consulting projects, including IT Strategy consulting for a department store business and web/social media strategy for a Hampshire-based charity. CTO IT Management Consulting September 2014  – Present (1 year) IT Management Consulting projects, including IT Strategy consulting for a department store business and web/social media strategy for a Hampshire-based charity. Interim Chief Technology Officer conject AG June 2012  –  January 2013  (8 months) Woking •\tBrought in to revitalise the development and impact of the IT function. Reporting to the CEO as a member of the Board, with six direct reports and a larger team of around 90. \n•\tEstablished a three year product strategy and built a fit-for-purpose product management team \n•\tTransformed the software development organisation into new teams to underpin the product development strategy, enabling faster product delivery and higher customer satisfaction \n•\tDeveloped a new culture of co-operation in the IT organisation, overcoming geographical and political barriers. The teams were based in multiple locations in India, Germany and the UK Interim Chief Technology Officer conject AG June 2012  –  January 2013  (8 months) Woking •\tBrought in to revitalise the development and impact of the IT function. Reporting to the CEO as a member of the Board, with six direct reports and a larger team of around 90. \n•\tEstablished a three year product strategy and built a fit-for-purpose product management team \n•\tTransformed the software development organisation into new teams to underpin the product development strategy, enabling faster product delivery and higher customer satisfaction \n•\tDeveloped a new culture of co-operation in the IT organisation, overcoming geographical and political barriers. The teams were based in multiple locations in India, Germany and the UK Chief Technology Officer Imaginatik plc 2001  –  June 2012  (11 years) Winchester •\tAccountable for the creation and execution of the company’s IT strategy reporting to the CEO \n•\tBuilt a Software-as-a-Service platform which consistently exceeded customer expectations, in both availability and speed of delivery \n•\tAchieved a listing on the AIM market of the London Stock Exchange as a result of the value of recurring Software-as-a-service business \n•\tEnabled the provision of web-centric services to customers and their supply chains, enhancing the value of customers' investments and creating a new revenue stream  \n•\tDirected a project to increase the performance and robustness of the global offering by implementing a world-wide system of cloud-based proxy servers, working with Akamai and other suppliers. This sped up access times and opened up sales to multi-national customers, resulting in an increase in sales of 25% \n•\tIntroduced a series of efficiency improvements and targeted investments, resulting in reducing the cost of managing internal systems by 40% while adding capabilities \n•\tMoved the company to a procedures-based footing capable of meeting the ISO 27001 Information Systems Management Standard Chief Technology Officer Imaginatik plc 2001  –  June 2012  (11 years) Winchester •\tAccountable for the creation and execution of the company’s IT strategy reporting to the CEO \n•\tBuilt a Software-as-a-Service platform which consistently exceeded customer expectations, in both availability and speed of delivery \n•\tAchieved a listing on the AIM market of the London Stock Exchange as a result of the value of recurring Software-as-a-service business \n•\tEnabled the provision of web-centric services to customers and their supply chains, enhancing the value of customers' investments and creating a new revenue stream  \n•\tDirected a project to increase the performance and robustness of the global offering by implementing a world-wide system of cloud-based proxy servers, working with Akamai and other suppliers. This sped up access times and opened up sales to multi-national customers, resulting in an increase in sales of 25% \n•\tIntroduced a series of efficiency improvements and targeted investments, resulting in reducing the cost of managing internal systems by 40% while adding capabilities \n•\tMoved the company to a procedures-based footing capable of meeting the ISO 27001 Information Systems Management Standard Chief Technology Officer and co-founder ideadollar.com 2000  –  2001  (1 year) San Francisco and Winchester This dotcom was set up as a unique innovation and ideas generation management company. \n•\tResponsible for the development and ongoing support of the company’s website and internal computing systems and the creation and operation of company strategy and policy across all areas of the business. \n•\tCreated a community of more than a hundred volunteers who managed the operation of a complex set of tasks (ideadollar assessors) – including motivation and self-policing \n•\tSpecified and developed artificial Intelligence tools to support processes and run the website.  \n•\tDeveloped crowdsourcing techniques to solve the problem of rapidly assessing thousands of ideas. Chief Technology Officer and co-founder ideadollar.com 2000  –  2001  (1 year) San Francisco and Winchester This dotcom was set up as a unique innovation and ideas generation management company. \n•\tResponsible for the development and ongoing support of the company’s website and internal computing systems and the creation and operation of company strategy and policy across all areas of the business. \n•\tCreated a community of more than a hundred volunteers who managed the operation of a complex set of tasks (ideadollar assessors) – including motivation and self-policing \n•\tSpecified and developed artificial Intelligence tools to support processes and run the website.  \n•\tDeveloped crowdsourcing techniques to solve the problem of rapidly assessing thousands of ideas. European Offering Manager IBM e-Business Services 1998  –  2000  (2 years) Hursley •\tAccountable for a portfolio of Service Offerings. Was appointed to rescue the main service offering, turning-around a previously loss-making business and exceeding annual targets of £4.5m Europe-wide \n•\tManaged sales, marketing, helpdesk, delivery and support of a number of Software-as-a-service offerings \n•\tIdentified a range of potential new service offerings \n•\tLed six service delivery teams based across Europe, with a total of 110 employees European Offering Manager IBM e-Business Services 1998  –  2000  (2 years) Hursley •\tAccountable for a portfolio of Service Offerings. Was appointed to rescue the main service offering, turning-around a previously loss-making business and exceeding annual targets of £4.5m Europe-wide \n•\tManaged sales, marketing, helpdesk, delivery and support of a number of Software-as-a-service offerings \n•\tIdentified a range of potential new service offerings \n•\tLed six service delivery teams based across Europe, with a total of 110 employees Senior Technical Architect IBM United Kingdom Ltd 1996  –  1998  (2 years) North Harbour •\tLead architect for managed hosted systems in outsourced customers. \n•\tAssisted in the winning of large service bids (£10m+). \n•\tConceived and constructed a new, more efficient, support service model for Lotus Notes. \n•\tLed a team to Boston which wrote and published a book; “Secrets to Running Lotus Notes: The Decisions No-one Tells You How to Make”. Senior Technical Architect IBM United Kingdom Ltd 1996  –  1998  (2 years) North Harbour •\tLead architect for managed hosted systems in outsourced customers. \n•\tAssisted in the winning of large service bids (£10m+). \n•\tConceived and constructed a new, more efficient, support service model for Lotus Notes. \n•\tLed a team to Boston which wrote and published a book; “Secrets to Running Lotus Notes: The Decisions No-one Tells You How to Make”. Project Manager, \"Genie\" IBM UK PC Company 1994  –  1996  (2 years) Basingstoke •\tBuilt a team to deliver a transformation project providing a new information system for PC Dealers \n•\tDirected a project to design, build and refresh the software on all 350 company laptops \n•\tMet all objectives, and helped raise customer satisfaction within the company from 66% to 78%. \n•\tEarned a Director's Award for exceptional achievement Project Manager, \"Genie\" IBM UK PC Company 1994  –  1996  (2 years) Basingstoke •\tBuilt a team to deliver a transformation project providing a new information system for PC Dealers \n•\tDirected a project to design, build and refresh the software on all 350 company laptops \n•\tMet all objectives, and helped raise customer satisfaction within the company from 66% to 78%. \n•\tEarned a Director's Award for exceptional achievement e-commerce Consultancy, Sales and Support IBM United Kingdom Ltd 1991  –  1994  (3 years) South Bank As a country-wide expert, worked as a UK product expert and technical consultant, working with companies such as Guinness, National Westminster Bank and Unilever. Formed an international special interest group of technical specialists. e-commerce Consultancy, Sales and Support IBM United Kingdom Ltd 1991  –  1994  (3 years) South Bank As a country-wide expert, worked as a UK product expert and technical consultant, working with companies such as Guinness, National Westminster Bank and Unilever. Formed an international special interest group of technical specialists. Systems Engineer IBM United Kingdom Ltd 1988  –  1991  (3 years) Richmond, Warwick Extensive training in IBM hardware, software and methodologies, graduating top in Systems Engineers’ School, and winning a number of awards for work in selling, writing and supporting software, and for providing high quality on-site customer support. Systems Engineer IBM United Kingdom Ltd 1988  –  1991  (3 years) Richmond, Warwick Extensive training in IBM hardware, software and methodologies, graduating top in Systems Engineers’ School, and winning a number of awards for work in selling, writing and supporting software, and for providing high quality on-site customer support. Languages German German German Skills SaaS Cloud Computing Innovation Management IT Strategy IT Management Strategy Data Center Innovation Web Development Product Management IT Operations Information Security Team Leadership Creative Problem Solving Strategic Partnerships Change Management E-commerce Leadership Open Innovation German Management Enterprise Software Start-ups Team Building Continuous Improvement Partner Management Corporate Governance Board Level Cost Management Outsourcing Product Development Integration Service Delivery Software Development Software Project... ITIL IT Project Leadership IT Service Management Team Management Ruby on Rails Scala Python .NET See 28+     See less Skills  SaaS Cloud Computing Innovation Management IT Strategy IT Management Strategy Data Center Innovation Web Development Product Management IT Operations Information Security Team Leadership Creative Problem Solving Strategic Partnerships Change Management E-commerce Leadership Open Innovation German Management Enterprise Software Start-ups Team Building Continuous Improvement Partner Management Corporate Governance Board Level Cost Management Outsourcing Product Development Integration Service Delivery Software Development Software Project... ITIL IT Project Leadership IT Service Management Team Management Ruby on Rails Scala Python .NET See 28+     See less SaaS Cloud Computing Innovation Management IT Strategy IT Management Strategy Data Center Innovation Web Development Product Management IT Operations Information Security Team Leadership Creative Problem Solving Strategic Partnerships Change Management E-commerce Leadership Open Innovation German Management Enterprise Software Start-ups Team Building Continuous Improvement Partner Management Corporate Governance Board Level Cost Management Outsourcing Product Development Integration Service Delivery Software Development Software Project... ITIL IT Project Leadership IT Service Management Team Management Ruby on Rails Scala Python .NET See 28+     See less SaaS Cloud Computing Innovation Management IT Strategy IT Management Strategy Data Center Innovation Web Development Product Management IT Operations Information Security Team Leadership Creative Problem Solving Strategic Partnerships Change Management E-commerce Leadership Open Innovation German Management Enterprise Software Start-ups Team Building Continuous Improvement Partner Management Corporate Governance Board Level Cost Management Outsourcing Product Development Integration Service Delivery Software Development Software Project... ITIL IT Project Leadership IT Service Management Team Management Ruby on Rails Scala Python .NET See 28+     See less Education University of Cambridge MA,  Mathematics 1985  – 1988 Mathematics Activities and Societies:  Corpus Christi College ,  Rowing Merchant Taylors School, Northwood University of Cambridge MA,  Mathematics 1985  – 1988 Mathematics Activities and Societies:  Corpus Christi College ,  Rowing University of Cambridge MA,  Mathematics 1985  – 1988 Mathematics Activities and Societies:  Corpus Christi College ,  Rowing University of Cambridge MA,  Mathematics 1985  – 1988 Mathematics Activities and Societies:  Corpus Christi College ,  Rowing Merchant Taylors School, Northwood Merchant Taylors School, Northwood Merchant Taylors School, Northwood Honors & Awards ", "Summary 16+ years of industry experience at IBM India Software Labs, which includes various technical leadership roles, developing of SDN for Virtual Environments(using OpenvSwitch, Liniux Bridge and VMware vSwitch), Java Class Libraries, Just In Time (JIT) compilers, Java Virtual Machine(JVM) and coming up with innovative & patentable solutions for optimizing Java runtime for multi-core and virtualized environments. \n \nSpecialties: SDN for Virtual Environments, OpenvSwitch, Linux Bridge, VMware vSwitch, KVM, Java Virtual Machine, Just in Time Compiler, Java Class Libraries, Virtualization Technologies, Multi-Core Technologies, Cloud Computing, Debugging and Diagnostics Summary 16+ years of industry experience at IBM India Software Labs, which includes various technical leadership roles, developing of SDN for Virtual Environments(using OpenvSwitch, Liniux Bridge and VMware vSwitch), Java Class Libraries, Just In Time (JIT) compilers, Java Virtual Machine(JVM) and coming up with innovative & patentable solutions for optimizing Java runtime for multi-core and virtualized environments. \n \nSpecialties: SDN for Virtual Environments, OpenvSwitch, Linux Bridge, VMware vSwitch, KVM, Java Virtual Machine, Just in Time Compiler, Java Class Libraries, Virtualization Technologies, Multi-Core Technologies, Cloud Computing, Debugging and Diagnostics 16+ years of industry experience at IBM India Software Labs, which includes various technical leadership roles, developing of SDN for Virtual Environments(using OpenvSwitch, Liniux Bridge and VMware vSwitch), Java Class Libraries, Just In Time (JIT) compilers, Java Virtual Machine(JVM) and coming up with innovative & patentable solutions for optimizing Java runtime for multi-core and virtualized environments. \n \nSpecialties: SDN for Virtual Environments, OpenvSwitch, Linux Bridge, VMware vSwitch, KVM, Java Virtual Machine, Just in Time Compiler, Java Class Libraries, Virtualization Technologies, Multi-Core Technologies, Cloud Computing, Debugging and Diagnostics 16+ years of industry experience at IBM India Software Labs, which includes various technical leadership roles, developing of SDN for Virtual Environments(using OpenvSwitch, Liniux Bridge and VMware vSwitch), Java Class Libraries, Just In Time (JIT) compilers, Java Virtual Machine(JVM) and coming up with innovative & patentable solutions for optimizing Java runtime for multi-core and virtualized environments. \n \nSpecialties: SDN for Virtual Environments, OpenvSwitch, Linux Bridge, VMware vSwitch, KVM, Java Virtual Machine, Just in Time Compiler, Java Class Libraries, Virtualization Technologies, Multi-Core Technologies, Cloud Computing, Debugging and Diagnostics Experience Senior Technical Architect IBM August 1998  – Present (17 years 1 month) Bangalore, India Performed various technical leadership roles in designing & developing SDN for Virtual Environments, Java Class Libraries, Just In Time (JIT) compilers, Java Virtual Machine (JVM) and incubation projects to optimize Java runtime for multi-core and virtualized environments. Senior Technical Architect IBM August 1998  – Present (17 years 1 month) Bangalore, India Performed various technical leadership roles in designing & developing SDN for Virtual Environments, Java Class Libraries, Just In Time (JIT) compilers, Java Virtual Machine (JVM) and incubation projects to optimize Java runtime for multi-core and virtualized environments. Senior Technical Architect IBM August 1998  – Present (17 years 1 month) Bangalore, India Performed various technical leadership roles in designing & developing SDN for Virtual Environments, Java Class Libraries, Just In Time (JIT) compilers, Java Virtual Machine (JVM) and incubation projects to optimize Java runtime for multi-core and virtualized environments. Skills Networking Cloud Computing Software Defined... Openflow OpenStack Unix OpenvSwitch Python Debugging Virtualization Java C++ Compilers Distributed Systems VMware vSwitch Linux Bridge Kernel Programming JVM Shell Scripting Agile Methodologies Java Enterprise Edition See 6+     See less Skills  Networking Cloud Computing Software Defined... Openflow OpenStack Unix OpenvSwitch Python Debugging Virtualization Java C++ Compilers Distributed Systems VMware vSwitch Linux Bridge Kernel Programming JVM Shell Scripting Agile Methodologies Java Enterprise Edition See 6+     See less Networking Cloud Computing Software Defined... Openflow OpenStack Unix OpenvSwitch Python Debugging Virtualization Java C++ Compilers Distributed Systems VMware vSwitch Linux Bridge Kernel Programming JVM Shell Scripting Agile Methodologies Java Enterprise Edition See 6+     See less Networking Cloud Computing Software Defined... Openflow OpenStack Unix OpenvSwitch Python Debugging Virtualization Java C++ Compilers Distributed Systems VMware vSwitch Linux Bridge Kernel Programming JVM Shell Scripting Agile Methodologies Java Enterprise Edition See 6+     See less Education National Institute of Technology Karnataka Bachelor's degree,  Electrical , Electronics and Communications Engineering 1994  – 1998 National Institute of Technology Karnataka Bachelor's degree,  Electrical , Electronics and Communications Engineering 1994  – 1998 National Institute of Technology Karnataka Bachelor's degree,  Electrical , Electronics and Communications Engineering 1994  – 1998 National Institute of Technology Karnataka Bachelor's degree,  Electrical , Electronics and Communications Engineering 1994  – 1998 ", "Summary Provide deep and specialized technical skills to create custom technology solutions, also in-depth understanding of products, offerings and services within my area of expertise: IT Infrastructure Monitoring, IT Service Management and Security. \nParticipate to the knowledge sharing area and try to continuous enhance existing reusable assets in order to increase the quality of work and improve my efficiency. Team effectively with people of all levels and businesses within Kapsch Romania and on my projects. \n \nI am an energetic, hard working and target driven individual, who thrives in a professional team environment focused on delivering results. I am eager to meet new challenges and am strongly committed to providing a quality solution to the many challenges of a modern business. I am looking for a progressive, dynamic, and vibrant organisation with rewarding career opportunity. Summary Provide deep and specialized technical skills to create custom technology solutions, also in-depth understanding of products, offerings and services within my area of expertise: IT Infrastructure Monitoring, IT Service Management and Security. \nParticipate to the knowledge sharing area and try to continuous enhance existing reusable assets in order to increase the quality of work and improve my efficiency. Team effectively with people of all levels and businesses within Kapsch Romania and on my projects. \n \nI am an energetic, hard working and target driven individual, who thrives in a professional team environment focused on delivering results. I am eager to meet new challenges and am strongly committed to providing a quality solution to the many challenges of a modern business. I am looking for a progressive, dynamic, and vibrant organisation with rewarding career opportunity. Provide deep and specialized technical skills to create custom technology solutions, also in-depth understanding of products, offerings and services within my area of expertise: IT Infrastructure Monitoring, IT Service Management and Security. \nParticipate to the knowledge sharing area and try to continuous enhance existing reusable assets in order to increase the quality of work and improve my efficiency. Team effectively with people of all levels and businesses within Kapsch Romania and on my projects. \n \nI am an energetic, hard working and target driven individual, who thrives in a professional team environment focused on delivering results. I am eager to meet new challenges and am strongly committed to providing a quality solution to the many challenges of a modern business. I am looking for a progressive, dynamic, and vibrant organisation with rewarding career opportunity. Provide deep and specialized technical skills to create custom technology solutions, also in-depth understanding of products, offerings and services within my area of expertise: IT Infrastructure Monitoring, IT Service Management and Security. \nParticipate to the knowledge sharing area and try to continuous enhance existing reusable assets in order to increase the quality of work and improve my efficiency. Team effectively with people of all levels and businesses within Kapsch Romania and on my projects. \n \nI am an energetic, hard working and target driven individual, who thrives in a professional team environment focused on delivering results. I am eager to meet new challenges and am strongly committed to providing a quality solution to the many challenges of a modern business. I am looking for a progressive, dynamic, and vibrant organisation with rewarding career opportunity. Experience Senior Technical Architect IBM November 2012  – Present (2 years 10 months) IT Architect Kapsch Romania January 2012  –  November 2012  (11 months) Responsibilities: \nProvide deep and specialized technical skills to create custom technology solutions, also in-depth understanding of products, offerings and services within my area of expertise: IT Infrastructure Monitoring, IT Service Management and Security. \nContribute to the achievement of Infrastructure Services signings targets by participating in pre-sales activities. \nParticipate to the knowledge sharing area and try to continuous enhance existing reusable assets in order to increase the quality of work and improve my efficiency. Team effectively with people of all levels and businesses within Kapsch Romania and on my projects. \nDefine Design Architecture documentation for the Implementation Phase of System and Security Management solutions and for the Integration with the customer IT Infrastructure. \nSupport my colleagues for a better understanding of the System Management and Security Solutions for our customers. \nDefine SOWs for Monitoring and Service Management solutions, Identity Management and Access Management solutions and others Security IT Solutions implemented with Tivoli Products. \nDefine Design Architecture documentation for the Implementation Phase of System and Security Management solutions and for the Integration with the customer IT Infrastructure. \nDevelop demo and Proof of Concept environments to demonstrate to the customer how the IBM Middleware responds to their needs. \nParticipate in projects during Design and Analyses, Implementation and Functional Tests Phases \nParticipate in meetings with the customer to understand their needs, and to propose and built technical solutions and architectures to answer their needs. IT Architect S&T Romania November 2010  –  December 2011  (1 year 2 months) Define SOWs for Monitoring and Service Management solutions, Identity Management and Access Management solutions and others Security IT Solutions implemented with Tivoli Products. \nDefine Design Architecture documentation for the Implementation Phase of System and Security Management solutions and for the Integration with the customer IT Infrastructure. \nDevelop demo and Proof of Concept environments to demonstrate to the customer how the IBM Middleware responds to their needs \nParticipate in projects during Design and Analyses, Implementation and Functional Tests Phases \nParticipate in meetings with the customer to understand their needs, and to propose and built technical solutions and architectures to answer their needs. Tivoli Service Management IT Specialist IBM May 2005  –  October 2010  (5 years 6 months) Provide deep and specialized technical skills to create custom technology solutions, also in-depth understanding of products, offerings and services within my area of expertise : IT Infrastructure Monitoring, IT Service Management and Security. \nContribute to the achievement of signings targets by participating in pre-sales activities. \nParticipate to the knowledge sharing area and try to continuous enhance existing reusable assets in order to increase the quality of work and improve my efficiency. Team effectively with people of all levels and businesses within IBM and on my projects. \nDefine SOWs for Service Management solutions, Identity Management and Access Management solutions and others Security IT Solutions implemented with Tivoli Products. \nDefine Design Architecture documentation for the Implementation of System and Security Management solutions and for the Integration with the customer IT Infrastructure. \nSupport my colleagues for a better understanding of the System Management and Security Solutions for customers \nWork with other IBM specialists and contractors to build the needed solution during Implementation phases for the projects I was involved \nDevelop demo and Proof of Concept environments to demonstrate to the customer how the IBM Middleware responds to their needs \nParticipate in projects during Design and Analyses, Implementation and Functional Tests Phases \nParticipate in meetings with the customer to understand their needs, and to propose and built technical solutions and architectures to answer their needs. \nKnowledge on the following Middleware Products: \nTivoli Identity Manager \nTivoli Access Manager (eBu, SSO, OS) \nTivoli Federated Identity Manager, \nTivoli Directory Server \nTivoli Directory Integrator \nTivoli Compliance Insight Manager \nTivoli Monitoring \nTivoli Composite Application Manager \nTivoli Security Information and Event Manager \nWebSphere Application Server Network Deployment(Installation in a Cluster Environment and Application Deployment) \nDB2 Senior Technical Architect IBM November 2012  – Present (2 years 10 months) Senior Technical Architect IBM November 2012  – Present (2 years 10 months) IT Architect Kapsch Romania January 2012  –  November 2012  (11 months) Responsibilities: \nProvide deep and specialized technical skills to create custom technology solutions, also in-depth understanding of products, offerings and services within my area of expertise: IT Infrastructure Monitoring, IT Service Management and Security. \nContribute to the achievement of Infrastructure Services signings targets by participating in pre-sales activities. \nParticipate to the knowledge sharing area and try to continuous enhance existing reusable assets in order to increase the quality of work and improve my efficiency. Team effectively with people of all levels and businesses within Kapsch Romania and on my projects. \nDefine Design Architecture documentation for the Implementation Phase of System and Security Management solutions and for the Integration with the customer IT Infrastructure. \nSupport my colleagues for a better understanding of the System Management and Security Solutions for our customers. \nDefine SOWs for Monitoring and Service Management solutions, Identity Management and Access Management solutions and others Security IT Solutions implemented with Tivoli Products. \nDefine Design Architecture documentation for the Implementation Phase of System and Security Management solutions and for the Integration with the customer IT Infrastructure. \nDevelop demo and Proof of Concept environments to demonstrate to the customer how the IBM Middleware responds to their needs. \nParticipate in projects during Design and Analyses, Implementation and Functional Tests Phases \nParticipate in meetings with the customer to understand their needs, and to propose and built technical solutions and architectures to answer their needs. IT Architect Kapsch Romania January 2012  –  November 2012  (11 months) Responsibilities: \nProvide deep and specialized technical skills to create custom technology solutions, also in-depth understanding of products, offerings and services within my area of expertise: IT Infrastructure Monitoring, IT Service Management and Security. \nContribute to the achievement of Infrastructure Services signings targets by participating in pre-sales activities. \nParticipate to the knowledge sharing area and try to continuous enhance existing reusable assets in order to increase the quality of work and improve my efficiency. Team effectively with people of all levels and businesses within Kapsch Romania and on my projects. \nDefine Design Architecture documentation for the Implementation Phase of System and Security Management solutions and for the Integration with the customer IT Infrastructure. \nSupport my colleagues for a better understanding of the System Management and Security Solutions for our customers. \nDefine SOWs for Monitoring and Service Management solutions, Identity Management and Access Management solutions and others Security IT Solutions implemented with Tivoli Products. \nDefine Design Architecture documentation for the Implementation Phase of System and Security Management solutions and for the Integration with the customer IT Infrastructure. \nDevelop demo and Proof of Concept environments to demonstrate to the customer how the IBM Middleware responds to their needs. \nParticipate in projects during Design and Analyses, Implementation and Functional Tests Phases \nParticipate in meetings with the customer to understand their needs, and to propose and built technical solutions and architectures to answer their needs. IT Architect S&T Romania November 2010  –  December 2011  (1 year 2 months) Define SOWs for Monitoring and Service Management solutions, Identity Management and Access Management solutions and others Security IT Solutions implemented with Tivoli Products. \nDefine Design Architecture documentation for the Implementation Phase of System and Security Management solutions and for the Integration with the customer IT Infrastructure. \nDevelop demo and Proof of Concept environments to demonstrate to the customer how the IBM Middleware responds to their needs \nParticipate in projects during Design and Analyses, Implementation and Functional Tests Phases \nParticipate in meetings with the customer to understand their needs, and to propose and built technical solutions and architectures to answer their needs. IT Architect S&T Romania November 2010  –  December 2011  (1 year 2 months) Define SOWs for Monitoring and Service Management solutions, Identity Management and Access Management solutions and others Security IT Solutions implemented with Tivoli Products. \nDefine Design Architecture documentation for the Implementation Phase of System and Security Management solutions and for the Integration with the customer IT Infrastructure. \nDevelop demo and Proof of Concept environments to demonstrate to the customer how the IBM Middleware responds to their needs \nParticipate in projects during Design and Analyses, Implementation and Functional Tests Phases \nParticipate in meetings with the customer to understand their needs, and to propose and built technical solutions and architectures to answer their needs. Tivoli Service Management IT Specialist IBM May 2005  –  October 2010  (5 years 6 months) Provide deep and specialized technical skills to create custom technology solutions, also in-depth understanding of products, offerings and services within my area of expertise : IT Infrastructure Monitoring, IT Service Management and Security. \nContribute to the achievement of signings targets by participating in pre-sales activities. \nParticipate to the knowledge sharing area and try to continuous enhance existing reusable assets in order to increase the quality of work and improve my efficiency. Team effectively with people of all levels and businesses within IBM and on my projects. \nDefine SOWs for Service Management solutions, Identity Management and Access Management solutions and others Security IT Solutions implemented with Tivoli Products. \nDefine Design Architecture documentation for the Implementation of System and Security Management solutions and for the Integration with the customer IT Infrastructure. \nSupport my colleagues for a better understanding of the System Management and Security Solutions for customers \nWork with other IBM specialists and contractors to build the needed solution during Implementation phases for the projects I was involved \nDevelop demo and Proof of Concept environments to demonstrate to the customer how the IBM Middleware responds to their needs \nParticipate in projects during Design and Analyses, Implementation and Functional Tests Phases \nParticipate in meetings with the customer to understand their needs, and to propose and built technical solutions and architectures to answer their needs. \nKnowledge on the following Middleware Products: \nTivoli Identity Manager \nTivoli Access Manager (eBu, SSO, OS) \nTivoli Federated Identity Manager, \nTivoli Directory Server \nTivoli Directory Integrator \nTivoli Compliance Insight Manager \nTivoli Monitoring \nTivoli Composite Application Manager \nTivoli Security Information and Event Manager \nWebSphere Application Server Network Deployment(Installation in a Cluster Environment and Application Deployment) \nDB2 Tivoli Service Management IT Specialist IBM May 2005  –  October 2010  (5 years 6 months) Provide deep and specialized technical skills to create custom technology solutions, also in-depth understanding of products, offerings and services within my area of expertise : IT Infrastructure Monitoring, IT Service Management and Security. \nContribute to the achievement of signings targets by participating in pre-sales activities. \nParticipate to the knowledge sharing area and try to continuous enhance existing reusable assets in order to increase the quality of work and improve my efficiency. Team effectively with people of all levels and businesses within IBM and on my projects. \nDefine SOWs for Service Management solutions, Identity Management and Access Management solutions and others Security IT Solutions implemented with Tivoli Products. \nDefine Design Architecture documentation for the Implementation of System and Security Management solutions and for the Integration with the customer IT Infrastructure. \nSupport my colleagues for a better understanding of the System Management and Security Solutions for customers \nWork with other IBM specialists and contractors to build the needed solution during Implementation phases for the projects I was involved \nDevelop demo and Proof of Concept environments to demonstrate to the customer how the IBM Middleware responds to their needs \nParticipate in projects during Design and Analyses, Implementation and Functional Tests Phases \nParticipate in meetings with the customer to understand their needs, and to propose and built technical solutions and architectures to answer their needs. \nKnowledge on the following Middleware Products: \nTivoli Identity Manager \nTivoli Access Manager (eBu, SSO, OS) \nTivoli Federated Identity Manager, \nTivoli Directory Server \nTivoli Directory Integrator \nTivoli Compliance Insight Manager \nTivoli Monitoring \nTivoli Composite Application Manager \nTivoli Security Information and Event Manager \nWebSphere Application Server Network Deployment(Installation in a Cluster Environment and Application Deployment) \nDB2 Languages English Full professional proficiency French Limited working proficiency German Elementary proficiency English Full professional proficiency French Limited working proficiency German Elementary proficiency English Full professional proficiency French Limited working proficiency German Elementary proficiency Full professional proficiency Limited working proficiency Elementary proficiency Skills IT architectures ITIL Access Management Identity Management IT Service Management Security Management Security Architecture... Project Implementation QRadar Solution Architecture TOGAF Tivoli Identity Manager Tivoli Directory Server Tivoli Access Manager IBM Tivoli Security Linux Enterprise Architecture System Architecture Information Architecture Cluster Virtualization Integration AIX Pre-sales Middleware Operating Systems Architectures Architecture Storage SOA Unix Information Security See 18+     See less Skills  IT architectures ITIL Access Management Identity Management IT Service Management Security Management Security Architecture... Project Implementation QRadar Solution Architecture TOGAF Tivoli Identity Manager Tivoli Directory Server Tivoli Access Manager IBM Tivoli Security Linux Enterprise Architecture System Architecture Information Architecture Cluster Virtualization Integration AIX Pre-sales Middleware Operating Systems Architectures Architecture Storage SOA Unix Information Security See 18+     See less IT architectures ITIL Access Management Identity Management IT Service Management Security Management Security Architecture... Project Implementation QRadar Solution Architecture TOGAF Tivoli Identity Manager Tivoli Directory Server Tivoli Access Manager IBM Tivoli Security Linux Enterprise Architecture System Architecture Information Architecture Cluster Virtualization Integration AIX Pre-sales Middleware Operating Systems Architectures Architecture Storage SOA Unix Information Security See 18+     See less IT architectures ITIL Access Management Identity Management IT Service Management Security Management Security Architecture... Project Implementation QRadar Solution Architecture TOGAF Tivoli Identity Manager Tivoli Directory Server Tivoli Access Manager IBM Tivoli Security Linux Enterprise Architecture System Architecture Information Architecture Cluster Virtualization Integration AIX Pre-sales Middleware Operating Systems Architectures Architecture Storage SOA Unix Information Security See 18+     See less Education Universitatea „Politehnica” din București Bachelor's degree,  Computer Science and Automatic Control 2001  – 2004 Computer Science and Automatic Control 1998  – 2001 Liceul Teoretic Calistrat Hogas - Piatra Neamt Baccalaureate,  Physics - Chemistry 1994  – 1998 Universitatea „Politehnica” din București Bachelor's degree,  Computer Science and Automatic Control 2001  – 2004 Universitatea „Politehnica” din București Bachelor's degree,  Computer Science and Automatic Control 2001  – 2004 Universitatea „Politehnica” din București Bachelor's degree,  Computer Science and Automatic Control 2001  – 2004 Computer Science and Automatic Control 1998  – 2001 Computer Science and Automatic Control 1998  – 2001 Computer Science and Automatic Control 1998  – 2001 Liceul Teoretic Calistrat Hogas - Piatra Neamt Baccalaureate,  Physics - Chemistry 1994  – 1998 Liceul Teoretic Calistrat Hogas - Piatra Neamt Baccalaureate,  Physics - Chemistry 1994  – 1998 Liceul Teoretic Calistrat Hogas - Piatra Neamt Baccalaureate,  Physics - Chemistry 1994  – 1998 ", "Skills Enterprise Architecture IT Strategy SAP SAP R/3 Business Intelligence ERP Integration Solution Architecture Business Process Business Analysis Requirements Analysis Business Process Design Master Data Management Data Warehousing Program Management Software Project... Business Objects Business Process... SOA SAP ERP Vendor Management EAI ABAP Business Transformation SAP Implementation Management Consulting SAP BW Executive Management Project Portfolio... Project Management Strategy IT Management SD PMO SDLC Business Process... Enterprise Software Outsourcing Management Software Development See 25+     See less Skills  Enterprise Architecture IT Strategy SAP SAP R/3 Business Intelligence ERP Integration Solution Architecture Business Process Business Analysis Requirements Analysis Business Process Design Master Data Management Data Warehousing Program Management Software Project... Business Objects Business Process... SOA SAP ERP Vendor Management EAI ABAP Business Transformation SAP Implementation Management Consulting SAP BW Executive Management Project Portfolio... Project Management Strategy IT Management SD PMO SDLC Business Process... Enterprise Software Outsourcing Management Software Development See 25+     See less Enterprise Architecture IT Strategy SAP SAP R/3 Business Intelligence ERP Integration Solution Architecture Business Process Business Analysis Requirements Analysis Business Process Design Master Data Management Data Warehousing Program Management Software Project... Business Objects Business Process... SOA SAP ERP Vendor Management EAI ABAP Business Transformation SAP Implementation Management Consulting SAP BW Executive Management Project Portfolio... Project Management Strategy IT Management SD PMO SDLC Business Process... Enterprise Software Outsourcing Management Software Development See 25+     See less Enterprise Architecture IT Strategy SAP SAP R/3 Business Intelligence ERP Integration Solution Architecture Business Process Business Analysis Requirements Analysis Business Process Design Master Data Management Data Warehousing Program Management Software Project... Business Objects Business Process... SOA SAP ERP Vendor Management EAI ABAP Business Transformation SAP Implementation Management Consulting SAP BW Executive Management Project Portfolio... Project Management Strategy IT Management SD PMO SDLC Business Process... Enterprise Software Outsourcing Management Software Development See 25+     See less ", "Summary Proven ability to enhance profitability, develop and support strategic initiatives, augment structure and internal control through Key Management roles in Strategic Planning, Systems Development, Project Management, and Technology Integration. Primary focus towards utilizing managerial and organizational skills in the field of Project Management. Summary Proven ability to enhance profitability, develop and support strategic initiatives, augment structure and internal control through Key Management roles in Strategic Planning, Systems Development, Project Management, and Technology Integration. Primary focus towards utilizing managerial and organizational skills in the field of Project Management. Proven ability to enhance profitability, develop and support strategic initiatives, augment structure and internal control through Key Management roles in Strategic Planning, Systems Development, Project Management, and Technology Integration. Primary focus towards utilizing managerial and organizational skills in the field of Project Management. Proven ability to enhance profitability, develop and support strategic initiatives, augment structure and internal control through Key Management roles in Strategic Planning, Systems Development, Project Management, and Technology Integration. Primary focus towards utilizing managerial and organizational skills in the field of Project Management. Experience Project Manager FlexITy Solutions Inc. May 2015  – Present (4 months) Manager - I.T. - Service Delivery, Technology Hallmark Canada August 2007  –  April 2015  (7 years 9 months) Toronto, Ontario, Canada • Reporting directly to the Vice President of Business Enablement, currently manages a 10 person multi-disciplined technology team which includes the following: \n• Systems and Storage  \n• Sharepoint and Webdesign\t \n• IP Networking and Communication  \n• Database Infrastructure  \n• Technical Services and Support\t \n• Mainframe Infrastructure \n• Point of Sale / Retail Infrastructure \n• Primary role in the successful project management of projects, process’ and IT tasks to support business enablement within Hallmark Canada. \n• Assigned as primary project manager to major retail accounts revision initiatives including national Hallmark retail outlets, Walmart Canada and Loblaws Companies Limited. \n• Implementation of project submission, project management and project delivery process’ within Information Technology utilizing PMI’s best practices \n• Actively manages and initiates smart spending to adhere to a 5.2 million dollar Information Technology budget \n• Key initiator and decision maker in the research and development of emerging technology that enhances business practices and positively impacts the company’s EBIT \n• Collaborates and negotiates with the internal business units within the company to determine best course of action with implementing technology solutions \n• Train and provide customer translated/understandable tutorials to the user community with technology applications and process \n• Manage day to day operations and escalations of the Technical Service and Support desk for all of Canada Director - Managed Services, IP Communications Bell ICT Outsourcing Solutions Inc. - A Bell Canada Company September 2003  –  August 2007  (4 years) Richmond Hill, Ontario, Canada (Formerly Infostream Technologies) \n• Effectively managed a Technical Assistance Center team (20+) with their daily duties, schedule and adhere to their personal goals and work development \n• Responsible for managing day to day operations of the Network Operations Center supporting and managing customer’s networks’ infrastructure \n• Responsible for project managing IP Delivery including IP Telephony, Network Assessments, Network upgrades, Managed service deliverables and customized request as per the customers’ expectations \n• Utilizing ITIL methodology effectively managed and supported multiple projects, with multiple vendors and multiple stake holders. \n• Budget creation and adherence \n• Facilitated vendor regarding strategic partnership and requirements \n• Point of escalation for Cisco, Systems and Storage and IP delivery issues \n• Key decision maker for IP delivery projects including network strategies, IP Voice and Managed services deliverables \n• Effectively managed vendor relationships and requirements including Cisco Systems Gold qualification, Certified Sun Helpdesk Providers, and Symantec/Veritas TSSP program \n• Working experience of Cisco Call Manager, Unity, IPCC and related AVVID products \n• Promoted September, 2006 (formerly, Manager, Managed Services) Senior Technical Architect IBM Canada September 2002  –  January 2003  (5 months) Toronto, Ontario, Canada • Provided Technical Advisement to IBM employees within North America and Mexico \n• Resolved issues pertaining to Lotus Notes applications, Virtual Mainframe and MVS systems, a variety of Windows operating systems as well as network connectivity \n• Technical Advisement to Bank of Nova Scotia employees within North America and Europe \n• Resolved issues pertaining to the ATM network, links and all electronic components involving the bank network Senior Regional Access Engineer Excite@Home September 2000  –  January 2002  (1 year 5 months) Redwood City, California, USA • Designed networking systems (Prime) using knowledge of Cisco IOS, Extreme Networks IOS and the internal LAN/WAN technology \n• Prepared reports for the implementation of network enhancements \n• Experience with Catalyst 6500, Cisco 7200 + and GSR 12000+ architectures.  \n• CMTS and HFC networks knowledge and experience gained. \n• Presented a self-designed layer 2 (switches/hubs) and 3 (Routers) networks with advantages, disadvantages and business case solutions for customers’ and internal design review board’s approval. \n• Advanced knowledge of Cisco IOS, Extreme Networks IOS and the internal LAN/WAN technology \n• Involved in the activation and the troubleshooting of OC48 (Packet Over SONET), OC3 (Packet Over SONET), DS3 and DS1 circuits over the OSPF routing protocol. \n• Implemented fault tolerance on the data networks through the introduction of Cisco DPT (Dynamic Packet Transport) on OC-48 and OC-12 rings \n• Monitored bandwidth utilization, traffic shaping, network errors / CPU utilization on production network gear and planned network upgrades with Network Operation Center. \n• Assisted in the creation of the physical and the logical network of the Greater Toronto, South Western Ontario, Central Ontario and the Greater Ottawa area OC48 ring architectured WANs \n• Assisted the internal Network Operations System on trouble shooting networks throughout Canada and the United States. Team Manager - Rogers@Home, Internet on Cable Rogers Communications October 1997  –  September 2000  (3 years) Toronto, Ontario, Canada • Managed a team staff 50+ to ensure the highest quality of customer care \n• Communicated with customers to ensure internal and external customer satisfaction \n• Ensured customers on the Rogers Cable System WAN network received the highest level of service \n• Usage of CTI, SGI, IVRs, Rockwell products, Lucent products and other Call Center enhanced utilities. \n• Assisted and Co-ordinated the implementation of software upgrades within plan for Y2K capability. \n• Denoted as the ‘special projects’ Project Manager to oversee opportunities in enhancing Call Center efficiency. \n• Oversaw staff to ensure quantitative and qualitative results were met. \n• Ensured that internal and external customer satisfaction was maintained. \n• Coached and identified areas of opportunities and training requirements. \n• Re-enforced strict customer care operational observance of standard policies and procedures. \n• Assisted in the implementation of reporting of ongoing tasks, projects, or committees as delegated by the Operations Manager. Project Manager FlexITy Solutions Inc. May 2015  – Present (4 months) Project Manager FlexITy Solutions Inc. May 2015  – Present (4 months) Manager - I.T. - Service Delivery, Technology Hallmark Canada August 2007  –  April 2015  (7 years 9 months) Toronto, Ontario, Canada • Reporting directly to the Vice President of Business Enablement, currently manages a 10 person multi-disciplined technology team which includes the following: \n• Systems and Storage  \n• Sharepoint and Webdesign\t \n• IP Networking and Communication  \n• Database Infrastructure  \n• Technical Services and Support\t \n• Mainframe Infrastructure \n• Point of Sale / Retail Infrastructure \n• Primary role in the successful project management of projects, process’ and IT tasks to support business enablement within Hallmark Canada. \n• Assigned as primary project manager to major retail accounts revision initiatives including national Hallmark retail outlets, Walmart Canada and Loblaws Companies Limited. \n• Implementation of project submission, project management and project delivery process’ within Information Technology utilizing PMI’s best practices \n• Actively manages and initiates smart spending to adhere to a 5.2 million dollar Information Technology budget \n• Key initiator and decision maker in the research and development of emerging technology that enhances business practices and positively impacts the company’s EBIT \n• Collaborates and negotiates with the internal business units within the company to determine best course of action with implementing technology solutions \n• Train and provide customer translated/understandable tutorials to the user community with technology applications and process \n• Manage day to day operations and escalations of the Technical Service and Support desk for all of Canada Manager - I.T. - Service Delivery, Technology Hallmark Canada August 2007  –  April 2015  (7 years 9 months) Toronto, Ontario, Canada • Reporting directly to the Vice President of Business Enablement, currently manages a 10 person multi-disciplined technology team which includes the following: \n• Systems and Storage  \n• Sharepoint and Webdesign\t \n• IP Networking and Communication  \n• Database Infrastructure  \n• Technical Services and Support\t \n• Mainframe Infrastructure \n• Point of Sale / Retail Infrastructure \n• Primary role in the successful project management of projects, process’ and IT tasks to support business enablement within Hallmark Canada. \n• Assigned as primary project manager to major retail accounts revision initiatives including national Hallmark retail outlets, Walmart Canada and Loblaws Companies Limited. \n• Implementation of project submission, project management and project delivery process’ within Information Technology utilizing PMI’s best practices \n• Actively manages and initiates smart spending to adhere to a 5.2 million dollar Information Technology budget \n• Key initiator and decision maker in the research and development of emerging technology that enhances business practices and positively impacts the company’s EBIT \n• Collaborates and negotiates with the internal business units within the company to determine best course of action with implementing technology solutions \n• Train and provide customer translated/understandable tutorials to the user community with technology applications and process \n• Manage day to day operations and escalations of the Technical Service and Support desk for all of Canada Director - Managed Services, IP Communications Bell ICT Outsourcing Solutions Inc. - A Bell Canada Company September 2003  –  August 2007  (4 years) Richmond Hill, Ontario, Canada (Formerly Infostream Technologies) \n• Effectively managed a Technical Assistance Center team (20+) with their daily duties, schedule and adhere to their personal goals and work development \n• Responsible for managing day to day operations of the Network Operations Center supporting and managing customer’s networks’ infrastructure \n• Responsible for project managing IP Delivery including IP Telephony, Network Assessments, Network upgrades, Managed service deliverables and customized request as per the customers’ expectations \n• Utilizing ITIL methodology effectively managed and supported multiple projects, with multiple vendors and multiple stake holders. \n• Budget creation and adherence \n• Facilitated vendor regarding strategic partnership and requirements \n• Point of escalation for Cisco, Systems and Storage and IP delivery issues \n• Key decision maker for IP delivery projects including network strategies, IP Voice and Managed services deliverables \n• Effectively managed vendor relationships and requirements including Cisco Systems Gold qualification, Certified Sun Helpdesk Providers, and Symantec/Veritas TSSP program \n• Working experience of Cisco Call Manager, Unity, IPCC and related AVVID products \n• Promoted September, 2006 (formerly, Manager, Managed Services) Director - Managed Services, IP Communications Bell ICT Outsourcing Solutions Inc. - A Bell Canada Company September 2003  –  August 2007  (4 years) Richmond Hill, Ontario, Canada (Formerly Infostream Technologies) \n• Effectively managed a Technical Assistance Center team (20+) with their daily duties, schedule and adhere to their personal goals and work development \n• Responsible for managing day to day operations of the Network Operations Center supporting and managing customer’s networks’ infrastructure \n• Responsible for project managing IP Delivery including IP Telephony, Network Assessments, Network upgrades, Managed service deliverables and customized request as per the customers’ expectations \n• Utilizing ITIL methodology effectively managed and supported multiple projects, with multiple vendors and multiple stake holders. \n• Budget creation and adherence \n• Facilitated vendor regarding strategic partnership and requirements \n• Point of escalation for Cisco, Systems and Storage and IP delivery issues \n• Key decision maker for IP delivery projects including network strategies, IP Voice and Managed services deliverables \n• Effectively managed vendor relationships and requirements including Cisco Systems Gold qualification, Certified Sun Helpdesk Providers, and Symantec/Veritas TSSP program \n• Working experience of Cisco Call Manager, Unity, IPCC and related AVVID products \n• Promoted September, 2006 (formerly, Manager, Managed Services) Senior Technical Architect IBM Canada September 2002  –  January 2003  (5 months) Toronto, Ontario, Canada • Provided Technical Advisement to IBM employees within North America and Mexico \n• Resolved issues pertaining to Lotus Notes applications, Virtual Mainframe and MVS systems, a variety of Windows operating systems as well as network connectivity \n• Technical Advisement to Bank of Nova Scotia employees within North America and Europe \n• Resolved issues pertaining to the ATM network, links and all electronic components involving the bank network Senior Technical Architect IBM Canada September 2002  –  January 2003  (5 months) Toronto, Ontario, Canada • Provided Technical Advisement to IBM employees within North America and Mexico \n• Resolved issues pertaining to Lotus Notes applications, Virtual Mainframe and MVS systems, a variety of Windows operating systems as well as network connectivity \n• Technical Advisement to Bank of Nova Scotia employees within North America and Europe \n• Resolved issues pertaining to the ATM network, links and all electronic components involving the bank network Senior Regional Access Engineer Excite@Home September 2000  –  January 2002  (1 year 5 months) Redwood City, California, USA • Designed networking systems (Prime) using knowledge of Cisco IOS, Extreme Networks IOS and the internal LAN/WAN technology \n• Prepared reports for the implementation of network enhancements \n• Experience with Catalyst 6500, Cisco 7200 + and GSR 12000+ architectures.  \n• CMTS and HFC networks knowledge and experience gained. \n• Presented a self-designed layer 2 (switches/hubs) and 3 (Routers) networks with advantages, disadvantages and business case solutions for customers’ and internal design review board’s approval. \n• Advanced knowledge of Cisco IOS, Extreme Networks IOS and the internal LAN/WAN technology \n• Involved in the activation and the troubleshooting of OC48 (Packet Over SONET), OC3 (Packet Over SONET), DS3 and DS1 circuits over the OSPF routing protocol. \n• Implemented fault tolerance on the data networks through the introduction of Cisco DPT (Dynamic Packet Transport) on OC-48 and OC-12 rings \n• Monitored bandwidth utilization, traffic shaping, network errors / CPU utilization on production network gear and planned network upgrades with Network Operation Center. \n• Assisted in the creation of the physical and the logical network of the Greater Toronto, South Western Ontario, Central Ontario and the Greater Ottawa area OC48 ring architectured WANs \n• Assisted the internal Network Operations System on trouble shooting networks throughout Canada and the United States. Senior Regional Access Engineer Excite@Home September 2000  –  January 2002  (1 year 5 months) Redwood City, California, USA • Designed networking systems (Prime) using knowledge of Cisco IOS, Extreme Networks IOS and the internal LAN/WAN technology \n• Prepared reports for the implementation of network enhancements \n• Experience with Catalyst 6500, Cisco 7200 + and GSR 12000+ architectures.  \n• CMTS and HFC networks knowledge and experience gained. \n• Presented a self-designed layer 2 (switches/hubs) and 3 (Routers) networks with advantages, disadvantages and business case solutions for customers’ and internal design review board’s approval. \n• Advanced knowledge of Cisco IOS, Extreme Networks IOS and the internal LAN/WAN technology \n• Involved in the activation and the troubleshooting of OC48 (Packet Over SONET), OC3 (Packet Over SONET), DS3 and DS1 circuits over the OSPF routing protocol. \n• Implemented fault tolerance on the data networks through the introduction of Cisco DPT (Dynamic Packet Transport) on OC-48 and OC-12 rings \n• Monitored bandwidth utilization, traffic shaping, network errors / CPU utilization on production network gear and planned network upgrades with Network Operation Center. \n• Assisted in the creation of the physical and the logical network of the Greater Toronto, South Western Ontario, Central Ontario and the Greater Ottawa area OC48 ring architectured WANs \n• Assisted the internal Network Operations System on trouble shooting networks throughout Canada and the United States. Team Manager - Rogers@Home, Internet on Cable Rogers Communications October 1997  –  September 2000  (3 years) Toronto, Ontario, Canada • Managed a team staff 50+ to ensure the highest quality of customer care \n• Communicated with customers to ensure internal and external customer satisfaction \n• Ensured customers on the Rogers Cable System WAN network received the highest level of service \n• Usage of CTI, SGI, IVRs, Rockwell products, Lucent products and other Call Center enhanced utilities. \n• Assisted and Co-ordinated the implementation of software upgrades within plan for Y2K capability. \n• Denoted as the ‘special projects’ Project Manager to oversee opportunities in enhancing Call Center efficiency. \n• Oversaw staff to ensure quantitative and qualitative results were met. \n• Ensured that internal and external customer satisfaction was maintained. \n• Coached and identified areas of opportunities and training requirements. \n• Re-enforced strict customer care operational observance of standard policies and procedures. \n• Assisted in the implementation of reporting of ongoing tasks, projects, or committees as delegated by the Operations Manager. Team Manager - Rogers@Home, Internet on Cable Rogers Communications October 1997  –  September 2000  (3 years) Toronto, Ontario, Canada • Managed a team staff 50+ to ensure the highest quality of customer care \n• Communicated with customers to ensure internal and external customer satisfaction \n• Ensured customers on the Rogers Cable System WAN network received the highest level of service \n• Usage of CTI, SGI, IVRs, Rockwell products, Lucent products and other Call Center enhanced utilities. \n• Assisted and Co-ordinated the implementation of software upgrades within plan for Y2K capability. \n• Denoted as the ‘special projects’ Project Manager to oversee opportunities in enhancing Call Center efficiency. \n• Oversaw staff to ensure quantitative and qualitative results were met. \n• Ensured that internal and external customer satisfaction was maintained. \n• Coached and identified areas of opportunities and training requirements. \n• Re-enforced strict customer care operational observance of standard policies and procedures. \n• Assisted in the implementation of reporting of ongoing tasks, projects, or committees as delegated by the Operations Manager. Skills Access Business Analysis Cisco Technologies Customer Experience Customer Service Data Center IP Information Technology Managed Services Microsoft Office Retail Team Leadership Vendor Management Management Network Architecture Network Design Project Management Service Delivery VoIP Telecommunications Integration ITIL See 7+     See less Skills  Access Business Analysis Cisco Technologies Customer Experience Customer Service Data Center IP Information Technology Managed Services Microsoft Office Retail Team Leadership Vendor Management Management Network Architecture Network Design Project Management Service Delivery VoIP Telecommunications Integration ITIL See 7+     See less Access Business Analysis Cisco Technologies Customer Experience Customer Service Data Center IP Information Technology Managed Services Microsoft Office Retail Team Leadership Vendor Management Management Network Architecture Network Design Project Management Service Delivery VoIP Telecommunications Integration ITIL See 7+     See less Access Business Analysis Cisco Technologies Customer Experience Customer Service Data Center IP Information Technology Managed Services Microsoft Office Retail Team Leadership Vendor Management Management Network Architecture Network Design Project Management Service Delivery VoIP Telecommunications Integration ITIL See 7+     See less Education Seneca College of Applied Arts and Technology Business Certificate 2013  – 2014 Niagara College Computer Engineering – Computer Technologist 1996  – 1997 University of Ottawa B.Sc - Electrical Engineering 1993  – 1996 Seneca College of Applied Arts and Technology Business Certificate 2013  – 2014 Seneca College of Applied Arts and Technology Business Certificate 2013  – 2014 Seneca College of Applied Arts and Technology Business Certificate 2013  – 2014 Niagara College Computer Engineering – Computer Technologist 1996  – 1997 Niagara College Computer Engineering – Computer Technologist 1996  – 1997 Niagara College Computer Engineering – Computer Technologist 1996  – 1997 University of Ottawa B.Sc - Electrical Engineering 1993  – 1996 University of Ottawa B.Sc - Electrical Engineering 1993  – 1996 University of Ottawa B.Sc - Electrical Engineering 1993  – 1996 Honors & Awards ", "Summary ✯✯✯Experienced Enterprise Project, Program, Portfolio Manager & Lean Process Improvement Consultant✯✯✯ \n \nShabana Wollin specializes in Enterprise-wide, multi-year portfolio management, project management best practices, methodology adoption, execution and process improvement. She has more than 15 years of experience that began with designing & managing efficient,repeatable business processes for companies establishing standardized work & automating workflow management (WfM). Her expertise involves enterprise PPM & product development life cycles. She progressed to work for a variety of renowned companies, in various industries, in multidisciplinary functions and roles. She is adept in understanding requirements, leading a team of business analysts, scope management, strategy execution, project governance, project stakeholder management, project management process life cycle, program governance, SDLC, and leading CF teams. Recently, she has expanded her focus to help her clients organize, manage & integrate their data so that they are better prepared to leverage the powerful capabilities of advanced predictive analytics that enables a data-driven decision making process that lead to better business outcomes.  \n \nSPECIALTIES: \nFull Life Cycle Project Management, Full Life Cycle Program Management, Account Relationship Management, Project Monitoring & Control, Project Estimation, Project Risk Management, Resource Management, Onboarding, Training & Coaching, Enterprise Project Portfolio Management, Program Financial Forecasting & Budgeting, Vendor Management & Negotiations, PMO Methodology & Processes, Program Management Life Cycle, Project Management Life Cycle \n \nShabana is a PMI certified Project Management Professional (PMP) and holds certifications as ITIL v3 Foundations Professional & Six Sigma Black Belt. She is a member of Toastmasters International and welcomes opportunity as a keynote speaker at conferences, workshops and user group communities. Summary ✯✯✯Experienced Enterprise Project, Program, Portfolio Manager & Lean Process Improvement Consultant✯✯✯ \n \nShabana Wollin specializes in Enterprise-wide, multi-year portfolio management, project management best practices, methodology adoption, execution and process improvement. She has more than 15 years of experience that began with designing & managing efficient,repeatable business processes for companies establishing standardized work & automating workflow management (WfM). Her expertise involves enterprise PPM & product development life cycles. She progressed to work for a variety of renowned companies, in various industries, in multidisciplinary functions and roles. She is adept in understanding requirements, leading a team of business analysts, scope management, strategy execution, project governance, project stakeholder management, project management process life cycle, program governance, SDLC, and leading CF teams. Recently, she has expanded her focus to help her clients organize, manage & integrate their data so that they are better prepared to leverage the powerful capabilities of advanced predictive analytics that enables a data-driven decision making process that lead to better business outcomes.  \n \nSPECIALTIES: \nFull Life Cycle Project Management, Full Life Cycle Program Management, Account Relationship Management, Project Monitoring & Control, Project Estimation, Project Risk Management, Resource Management, Onboarding, Training & Coaching, Enterprise Project Portfolio Management, Program Financial Forecasting & Budgeting, Vendor Management & Negotiations, PMO Methodology & Processes, Program Management Life Cycle, Project Management Life Cycle \n \nShabana is a PMI certified Project Management Professional (PMP) and holds certifications as ITIL v3 Foundations Professional & Six Sigma Black Belt. She is a member of Toastmasters International and welcomes opportunity as a keynote speaker at conferences, workshops and user group communities. ✯✯✯Experienced Enterprise Project, Program, Portfolio Manager & Lean Process Improvement Consultant✯✯✯ \n \nShabana Wollin specializes in Enterprise-wide, multi-year portfolio management, project management best practices, methodology adoption, execution and process improvement. She has more than 15 years of experience that began with designing & managing efficient,repeatable business processes for companies establishing standardized work & automating workflow management (WfM). Her expertise involves enterprise PPM & product development life cycles. She progressed to work for a variety of renowned companies, in various industries, in multidisciplinary functions and roles. She is adept in understanding requirements, leading a team of business analysts, scope management, strategy execution, project governance, project stakeholder management, project management process life cycle, program governance, SDLC, and leading CF teams. Recently, she has expanded her focus to help her clients organize, manage & integrate their data so that they are better prepared to leverage the powerful capabilities of advanced predictive analytics that enables a data-driven decision making process that lead to better business outcomes.  \n \nSPECIALTIES: \nFull Life Cycle Project Management, Full Life Cycle Program Management, Account Relationship Management, Project Monitoring & Control, Project Estimation, Project Risk Management, Resource Management, Onboarding, Training & Coaching, Enterprise Project Portfolio Management, Program Financial Forecasting & Budgeting, Vendor Management & Negotiations, PMO Methodology & Processes, Program Management Life Cycle, Project Management Life Cycle \n \nShabana is a PMI certified Project Management Professional (PMP) and holds certifications as ITIL v3 Foundations Professional & Six Sigma Black Belt. She is a member of Toastmasters International and welcomes opportunity as a keynote speaker at conferences, workshops and user group communities. ✯✯✯Experienced Enterprise Project, Program, Portfolio Manager & Lean Process Improvement Consultant✯✯✯ \n \nShabana Wollin specializes in Enterprise-wide, multi-year portfolio management, project management best practices, methodology adoption, execution and process improvement. She has more than 15 years of experience that began with designing & managing efficient,repeatable business processes for companies establishing standardized work & automating workflow management (WfM). Her expertise involves enterprise PPM & product development life cycles. She progressed to work for a variety of renowned companies, in various industries, in multidisciplinary functions and roles. She is adept in understanding requirements, leading a team of business analysts, scope management, strategy execution, project governance, project stakeholder management, project management process life cycle, program governance, SDLC, and leading CF teams. Recently, she has expanded her focus to help her clients organize, manage & integrate their data so that they are better prepared to leverage the powerful capabilities of advanced predictive analytics that enables a data-driven decision making process that lead to better business outcomes.  \n \nSPECIALTIES: \nFull Life Cycle Project Management, Full Life Cycle Program Management, Account Relationship Management, Project Monitoring & Control, Project Estimation, Project Risk Management, Resource Management, Onboarding, Training & Coaching, Enterprise Project Portfolio Management, Program Financial Forecasting & Budgeting, Vendor Management & Negotiations, PMO Methodology & Processes, Program Management Life Cycle, Project Management Life Cycle \n \nShabana is a PMI certified Project Management Professional (PMP) and holds certifications as ITIL v3 Foundations Professional & Six Sigma Black Belt. She is a member of Toastmasters International and welcomes opportunity as a keynote speaker at conferences, workshops and user group communities. Experience Senior IT Manager, Enterprise Processes & Methods - EPMO, North America Johnson Controls April 2015  – Present (5 months) Greater Milwaukee Area Founding President Bluefrog Technologies LLC February 2009  – Present (6 years 7 months) Greater Milwaukee Area Member ASQ May 2014  – Present (1 year 4 months) Greater Milwaukee Area Senior IT Manager, Enterprise Processes & Methods - EPMO, North America Johnson Controls April 2015  – Present (5 months) Greater Milwaukee Area Senior IT Manager, Enterprise Processes & Methods - EPMO, North America Johnson Controls April 2015  – Present (5 months) Greater Milwaukee Area Founding President Bluefrog Technologies LLC February 2009  – Present (6 years 7 months) Greater Milwaukee Area Founding President Bluefrog Technologies LLC February 2009  – Present (6 years 7 months) Greater Milwaukee Area Member ASQ May 2014  – Present (1 year 4 months) Greater Milwaukee Area Member ASQ May 2014  – Present (1 year 4 months) Greater Milwaukee Area Languages   Skills Program Management Business Analysis CRM Project Management Vendor Management ITIL PMP IT Service Management SDLC Lotus Notes Management Consulting Business Strategy PMO Business Process... Strategic Leadership Public Speaking IT Strategy SharePoint Business Intelligence Predictive Analytics Social Media Software Project... XPages LotusScript Social Media Marketing Entrepreneurship Business Requirements Service Portfolio... jQuery ERP Lean Six Sigma Dojo New Business Development Marketing Strategy Microsoft Project Knowledge Management ITIL Implementation Stakeholder Management Predictive Modeling Six Sigma Black Belt Continuous Improvement IBM Lotus Notes Domino Marketing Communications IBM Certified Data Visualization Blog Marketing Service Design Requirements Analysis Change Management Microsoft Dynamics AX See 35+     See less Skills  Program Management Business Analysis CRM Project Management Vendor Management ITIL PMP IT Service Management SDLC Lotus Notes Management Consulting Business Strategy PMO Business Process... Strategic Leadership Public Speaking IT Strategy SharePoint Business Intelligence Predictive Analytics Social Media Software Project... XPages LotusScript Social Media Marketing Entrepreneurship Business Requirements Service Portfolio... jQuery ERP Lean Six Sigma Dojo New Business Development Marketing Strategy Microsoft Project Knowledge Management ITIL Implementation Stakeholder Management Predictive Modeling Six Sigma Black Belt Continuous Improvement IBM Lotus Notes Domino Marketing Communications IBM Certified Data Visualization Blog Marketing Service Design Requirements Analysis Change Management Microsoft Dynamics AX See 35+     See less Program Management Business Analysis CRM Project Management Vendor Management ITIL PMP IT Service Management SDLC Lotus Notes Management Consulting Business Strategy PMO Business Process... Strategic Leadership Public Speaking IT Strategy SharePoint Business Intelligence Predictive Analytics Social Media Software Project... XPages LotusScript Social Media Marketing Entrepreneurship Business Requirements Service Portfolio... jQuery ERP Lean Six Sigma Dojo New Business Development Marketing Strategy Microsoft Project Knowledge Management ITIL Implementation Stakeholder Management Predictive Modeling Six Sigma Black Belt Continuous Improvement IBM Lotus Notes Domino Marketing Communications IBM Certified Data Visualization Blog Marketing Service Design Requirements Analysis Change Management Microsoft Dynamics AX See 35+     See less Program Management Business Analysis CRM Project Management Vendor Management ITIL PMP IT Service Management SDLC Lotus Notes Management Consulting Business Strategy PMO Business Process... Strategic Leadership Public Speaking IT Strategy SharePoint Business Intelligence Predictive Analytics Social Media Software Project... XPages LotusScript Social Media Marketing Entrepreneurship Business Requirements Service Portfolio... jQuery ERP Lean Six Sigma Dojo New Business Development Marketing Strategy Microsoft Project Knowledge Management ITIL Implementation Stakeholder Management Predictive Modeling Six Sigma Black Belt Continuous Improvement IBM Lotus Notes Domino Marketing Communications IBM Certified Data Visualization Blog Marketing Service Design Requirements Analysis Change Management Microsoft Dynamics AX See 35+     See less Education University of Wisconsin-Milwaukee BBA-MIS (Sheldon B. Lubar School of Business) 1993  – 1997 Peking University N/A 2014  – 2014 Vanavani Matriculation Higher Secondary School, Chennai, India IGCSE, High School Diploma 1988  – 1992 University of Wisconsin-Milwaukee BBA-MIS (Sheldon B. Lubar School of Business) 1993  – 1997 University of Wisconsin-Milwaukee BBA-MIS (Sheldon B. Lubar School of Business) 1993  – 1997 University of Wisconsin-Milwaukee BBA-MIS (Sheldon B. Lubar School of Business) 1993  – 1997 Peking University N/A 2014  – 2014 Peking University N/A 2014  – 2014 Peking University N/A 2014  – 2014 Vanavani Matriculation Higher Secondary School, Chennai, India IGCSE, High School Diploma 1988  – 1992 Vanavani Matriculation Higher Secondary School, Chennai, India IGCSE, High School Diploma 1988  – 1992 Vanavani Matriculation Higher Secondary School, Chennai, India IGCSE, High School Diploma 1988  – 1992 Honors & Awards Finalist, Rising Star Minority Business Enterprise Wisconsin Economic Development Corporation, Governor Scott Walker October 2011 The Rising Star Award recognizes businesses with great promise that have been in business less than five years. Additional Honors & Awards Finalist in the 2011 Minority Business Development Marketplace Rising Star Award Finalist, Rising Star Minority Business Enterprise Wisconsin Economic Development Corporation, Governor Scott Walker October 2011 The Rising Star Award recognizes businesses with great promise that have been in business less than five years. Finalist, Rising Star Minority Business Enterprise Wisconsin Economic Development Corporation, Governor Scott Walker October 2011 The Rising Star Award recognizes businesses with great promise that have been in business less than five years. Finalist, Rising Star Minority Business Enterprise Wisconsin Economic Development Corporation, Governor Scott Walker October 2011 The Rising Star Award recognizes businesses with great promise that have been in business less than five years. Additional Honors & Awards Finalist in the 2011 Minority Business Development Marketplace Rising Star Award Additional Honors & Awards Finalist in the 2011 Minority Business Development Marketplace Rising Star Award Additional Honors & Awards Finalist in the 2011 Minority Business Development Marketplace Rising Star Award ", "Summary Neerav Shah has over 15 years of international experience in the technology and IT industries at leading software and systems integration enterprises. Currently Mr Shah is the Sales Director in the UK and Northern Europe for Lithium Technologies, the leading provider of Social CRM and Community Platforms. Previously Mr. Shah spent 9.5 years at Motive Inc (a division of Alcatel-Lucent since 2008) where he was a direct account executive selling complex high value software solutions to wireline and wireless service providers in the UK and across Europe. Prior to that, Mr. Shah was a manager within KPMG Consulting’s northeast Communications, Content and Commerce industry located in New York City. Mr. Shah also held various senior technical roles at Tivoli Software (IBM) and DBMX Limited (IBM). Mr. Shah has an extensive network of telecoms, hi-tech and media contacts across Europe and the United States. Mr. Shah holds a BSc in Computer Science from City University London. \n \nMr. Shah has been the founding member of two companies in EMEA (Motive and Lithium) when their respective boards of directors decided to expand into the region, demonstrating solid experience in growing companies from a startup to an established business with predictability. \n \nSpecialties: Selling high value solutions. \nSoftware start-up experience. \nDeep experience selling into telcos/service providers. \nInternational experience. \nSaaS. \nValue based selling. Summary Neerav Shah has over 15 years of international experience in the technology and IT industries at leading software and systems integration enterprises. Currently Mr Shah is the Sales Director in the UK and Northern Europe for Lithium Technologies, the leading provider of Social CRM and Community Platforms. Previously Mr. Shah spent 9.5 years at Motive Inc (a division of Alcatel-Lucent since 2008) where he was a direct account executive selling complex high value software solutions to wireline and wireless service providers in the UK and across Europe. Prior to that, Mr. Shah was a manager within KPMG Consulting’s northeast Communications, Content and Commerce industry located in New York City. Mr. Shah also held various senior technical roles at Tivoli Software (IBM) and DBMX Limited (IBM). Mr. Shah has an extensive network of telecoms, hi-tech and media contacts across Europe and the United States. Mr. Shah holds a BSc in Computer Science from City University London. \n \nMr. Shah has been the founding member of two companies in EMEA (Motive and Lithium) when their respective boards of directors decided to expand into the region, demonstrating solid experience in growing companies from a startup to an established business with predictability. \n \nSpecialties: Selling high value solutions. \nSoftware start-up experience. \nDeep experience selling into telcos/service providers. \nInternational experience. \nSaaS. \nValue based selling. Neerav Shah has over 15 years of international experience in the technology and IT industries at leading software and systems integration enterprises. Currently Mr Shah is the Sales Director in the UK and Northern Europe for Lithium Technologies, the leading provider of Social CRM and Community Platforms. Previously Mr. Shah spent 9.5 years at Motive Inc (a division of Alcatel-Lucent since 2008) where he was a direct account executive selling complex high value software solutions to wireline and wireless service providers in the UK and across Europe. Prior to that, Mr. Shah was a manager within KPMG Consulting’s northeast Communications, Content and Commerce industry located in New York City. Mr. Shah also held various senior technical roles at Tivoli Software (IBM) and DBMX Limited (IBM). Mr. Shah has an extensive network of telecoms, hi-tech and media contacts across Europe and the United States. Mr. Shah holds a BSc in Computer Science from City University London. \n \nMr. Shah has been the founding member of two companies in EMEA (Motive and Lithium) when their respective boards of directors decided to expand into the region, demonstrating solid experience in growing companies from a startup to an established business with predictability. \n \nSpecialties: Selling high value solutions. \nSoftware start-up experience. \nDeep experience selling into telcos/service providers. \nInternational experience. \nSaaS. \nValue based selling. Neerav Shah has over 15 years of international experience in the technology and IT industries at leading software and systems integration enterprises. Currently Mr Shah is the Sales Director in the UK and Northern Europe for Lithium Technologies, the leading provider of Social CRM and Community Platforms. Previously Mr. Shah spent 9.5 years at Motive Inc (a division of Alcatel-Lucent since 2008) where he was a direct account executive selling complex high value software solutions to wireline and wireless service providers in the UK and across Europe. Prior to that, Mr. Shah was a manager within KPMG Consulting’s northeast Communications, Content and Commerce industry located in New York City. Mr. Shah also held various senior technical roles at Tivoli Software (IBM) and DBMX Limited (IBM). Mr. Shah has an extensive network of telecoms, hi-tech and media contacts across Europe and the United States. Mr. Shah holds a BSc in Computer Science from City University London. \n \nMr. Shah has been the founding member of two companies in EMEA (Motive and Lithium) when their respective boards of directors decided to expand into the region, demonstrating solid experience in growing companies from a startup to an established business with predictability. \n \nSpecialties: Selling high value solutions. \nSoftware start-up experience. \nDeep experience selling into telcos/service providers. \nInternational experience. \nSaaS. \nValue based selling. Experience Sales Director, UK & Northern Europe Lithium Technologies January 2010  – Present (5 years 8 months) London, United Kingdom Responsible for high value and strategic sales for Lithium in the UK and Northern Europe with a focus on telecommunications, high tech, retail and media. This role has allowed Mr. Shah to extend his network and become a trusted adviser to fortune 500/FTSE 100 companies and brands looking to generate tangible value from community social media engagement platforms. Sales Manager, UK & Northern Europe Lithium Technologies October 2009  –  December 2010  (1 year 3 months) London, United Kingdom Established the UK & Northern Europe office and was the first sales executive on the ground identifying and closing key opportunities in the telco, airline and hi-tech sectors. Achieved 100%+ growth in first full year and created a team comprising of a sales engineer, sales development manager, and additional sales executives. Account Executive - UK, Nordics, Baltics & Sub Saharan Africa Alcatel-Lucent, Motive Product Division January 2006  –  September 2009  (3 years 9 months) London, United Kingdom Responsible for the success and growth of Applications Software Group (ASG) business with telecommunications, service providers, mobile and cable operators in the UK, Scandinavia, Baltics, and Sub Saharan Africa. Responsible for managing and driving new contracts revenues from one of Alcatel-Lucent's key strategic accounts. Sold over $25M of new software and services. Instrumental in driving first time sales from new products like ASG's mobile device and service management product portfolio. Over achieved on quota targets three years running. Directly involved in the identification and qualification of prospective customers for software license and services bookings and revenue. Working with strategic partners to generate software license and professional services revenue in new territories. Negotiated multi-million Euro and GBP software, hosting and services agreements with service providers. Account Executive - Benelux & Nordics Motive January 2004  –  December 2005  (2 years) London, United Kingdom Responsible for sales and business development in the Nordics and Benelux territory. Broke into the first telco and MSO/cable accounts establishing the region from ground up. Alliances & Services Director, EMEA Motive March 2000  –  December 2003  (3 years 10 months) London, United Kingdom Creating and managing Professional Services and Technical Support organisations in EMEA. Creating and managing all alliances as sales and delivery channels. Assisting sales in selling solutions and projects Manager KPMG October 1998  –  March 2000  (1 year 6 months) Greater New York City Area Responsible for systems and network management large-scale projects and team in North East USA based out of New York City. Strategic consulting / advisory services in helping companies develop and realise their systems and network management plans. Senior Technical Architect IBM Tivoli Software September 1994  –  September 1998  (4 years 1 month) London, United Kingdom Responsible for the technical architecture definition of network and systems management solutions for strategic accounts. Sales Director, UK & Northern Europe Lithium Technologies January 2010  – Present (5 years 8 months) London, United Kingdom Responsible for high value and strategic sales for Lithium in the UK and Northern Europe with a focus on telecommunications, high tech, retail and media. This role has allowed Mr. Shah to extend his network and become a trusted adviser to fortune 500/FTSE 100 companies and brands looking to generate tangible value from community social media engagement platforms. Sales Director, UK & Northern Europe Lithium Technologies January 2010  – Present (5 years 8 months) London, United Kingdom Responsible for high value and strategic sales for Lithium in the UK and Northern Europe with a focus on telecommunications, high tech, retail and media. This role has allowed Mr. Shah to extend his network and become a trusted adviser to fortune 500/FTSE 100 companies and brands looking to generate tangible value from community social media engagement platforms. Sales Manager, UK & Northern Europe Lithium Technologies October 2009  –  December 2010  (1 year 3 months) London, United Kingdom Established the UK & Northern Europe office and was the first sales executive on the ground identifying and closing key opportunities in the telco, airline and hi-tech sectors. Achieved 100%+ growth in first full year and created a team comprising of a sales engineer, sales development manager, and additional sales executives. Sales Manager, UK & Northern Europe Lithium Technologies October 2009  –  December 2010  (1 year 3 months) London, United Kingdom Established the UK & Northern Europe office and was the first sales executive on the ground identifying and closing key opportunities in the telco, airline and hi-tech sectors. Achieved 100%+ growth in first full year and created a team comprising of a sales engineer, sales development manager, and additional sales executives. Account Executive - UK, Nordics, Baltics & Sub Saharan Africa Alcatel-Lucent, Motive Product Division January 2006  –  September 2009  (3 years 9 months) London, United Kingdom Responsible for the success and growth of Applications Software Group (ASG) business with telecommunications, service providers, mobile and cable operators in the UK, Scandinavia, Baltics, and Sub Saharan Africa. Responsible for managing and driving new contracts revenues from one of Alcatel-Lucent's key strategic accounts. Sold over $25M of new software and services. Instrumental in driving first time sales from new products like ASG's mobile device and service management product portfolio. Over achieved on quota targets three years running. Directly involved in the identification and qualification of prospective customers for software license and services bookings and revenue. Working with strategic partners to generate software license and professional services revenue in new territories. Negotiated multi-million Euro and GBP software, hosting and services agreements with service providers. Account Executive - UK, Nordics, Baltics & Sub Saharan Africa Alcatel-Lucent, Motive Product Division January 2006  –  September 2009  (3 years 9 months) London, United Kingdom Responsible for the success and growth of Applications Software Group (ASG) business with telecommunications, service providers, mobile and cable operators in the UK, Scandinavia, Baltics, and Sub Saharan Africa. Responsible for managing and driving new contracts revenues from one of Alcatel-Lucent's key strategic accounts. Sold over $25M of new software and services. Instrumental in driving first time sales from new products like ASG's mobile device and service management product portfolio. Over achieved on quota targets three years running. Directly involved in the identification and qualification of prospective customers for software license and services bookings and revenue. Working with strategic partners to generate software license and professional services revenue in new territories. Negotiated multi-million Euro and GBP software, hosting and services agreements with service providers. Account Executive - Benelux & Nordics Motive January 2004  –  December 2005  (2 years) London, United Kingdom Responsible for sales and business development in the Nordics and Benelux territory. Broke into the first telco and MSO/cable accounts establishing the region from ground up. Account Executive - Benelux & Nordics Motive January 2004  –  December 2005  (2 years) London, United Kingdom Responsible for sales and business development in the Nordics and Benelux territory. Broke into the first telco and MSO/cable accounts establishing the region from ground up. Alliances & Services Director, EMEA Motive March 2000  –  December 2003  (3 years 10 months) London, United Kingdom Creating and managing Professional Services and Technical Support organisations in EMEA. Creating and managing all alliances as sales and delivery channels. Assisting sales in selling solutions and projects Alliances & Services Director, EMEA Motive March 2000  –  December 2003  (3 years 10 months) London, United Kingdom Creating and managing Professional Services and Technical Support organisations in EMEA. Creating and managing all alliances as sales and delivery channels. Assisting sales in selling solutions and projects Manager KPMG October 1998  –  March 2000  (1 year 6 months) Greater New York City Area Responsible for systems and network management large-scale projects and team in North East USA based out of New York City. Strategic consulting / advisory services in helping companies develop and realise their systems and network management plans. Manager KPMG October 1998  –  March 2000  (1 year 6 months) Greater New York City Area Responsible for systems and network management large-scale projects and team in North East USA based out of New York City. Strategic consulting / advisory services in helping companies develop and realise their systems and network management plans. Senior Technical Architect IBM Tivoli Software September 1994  –  September 1998  (4 years 1 month) London, United Kingdom Responsible for the technical architecture definition of network and systems management solutions for strategic accounts. Senior Technical Architect IBM Tivoli Software September 1994  –  September 1998  (4 years 1 month) London, United Kingdom Responsible for the technical architecture definition of network and systems management solutions for strategic accounts. Languages English Native or bilingual proficiency Gujarati Native or bilingual proficiency Hindi Professional working proficiency French Elementary proficiency English Native or bilingual proficiency Gujarati Native or bilingual proficiency Hindi Professional working proficiency French Elementary proficiency English Native or bilingual proficiency Gujarati Native or bilingual proficiency Hindi Professional working proficiency French Elementary proficiency Native or bilingual proficiency Native or bilingual proficiency Professional working proficiency Elementary proficiency Skills Contributed to IBM... Direct Sales Key Account Management Value Selling Tivoli Mobile Device Management Software Sales Consultative Selling Selling Software Industry Netcool SaaS Professional Services Strategic Partnerships Business Alliances Mobile Devices Telecommunications Start-ups Solution Selling Channel Enterprise Software Management Go-to-market Strategy Lead Generation New Business Development Integration Sales Operations Social Media Social CRM Wireless Business Development Leadership Product Management Cloud Computing Sales Management Sales Salesforce.com Pre-sales CRM Partner Management Sales Enablement E-commerce Channel Partners Sales Process See 29+     See less Skills  Contributed to IBM... Direct Sales Key Account Management Value Selling Tivoli Mobile Device Management Software Sales Consultative Selling Selling Software Industry Netcool SaaS Professional Services Strategic Partnerships Business Alliances Mobile Devices Telecommunications Start-ups Solution Selling Channel Enterprise Software Management Go-to-market Strategy Lead Generation New Business Development Integration Sales Operations Social Media Social CRM Wireless Business Development Leadership Product Management Cloud Computing Sales Management Sales Salesforce.com Pre-sales CRM Partner Management Sales Enablement E-commerce Channel Partners Sales Process See 29+     See less Contributed to IBM... Direct Sales Key Account Management Value Selling Tivoli Mobile Device Management Software Sales Consultative Selling Selling Software Industry Netcool SaaS Professional Services Strategic Partnerships Business Alliances Mobile Devices Telecommunications Start-ups Solution Selling Channel Enterprise Software Management Go-to-market Strategy Lead Generation New Business Development Integration Sales Operations Social Media Social CRM Wireless Business Development Leadership Product Management Cloud Computing Sales Management Sales Salesforce.com Pre-sales CRM Partner Management Sales Enablement E-commerce Channel Partners Sales Process See 29+     See less Contributed to IBM... Direct Sales Key Account Management Value Selling Tivoli Mobile Device Management Software Sales Consultative Selling Selling Software Industry Netcool SaaS Professional Services Strategic Partnerships Business Alliances Mobile Devices Telecommunications Start-ups Solution Selling Channel Enterprise Software Management Go-to-market Strategy Lead Generation New Business Development Integration Sales Operations Social Media Social CRM Wireless Business Development Leadership Product Management Cloud Computing Sales Management Sales Salesforce.com Pre-sales CRM Partner Management Sales Enablement E-commerce Channel Partners Sales Process See 29+     See less Education City University London Bachelor of Science with honours,  Computer Science 1991  – 1994 City University London Bachelor of Science with honours,  Computer Science 1991  – 1994 City University London Bachelor of Science with honours,  Computer Science 1991  – 1994 City University London Bachelor of Science with honours,  Computer Science 1991  – 1994 ", "Experience Technical Leader IBM Senior Technical Architect IBM November 2006  – Present (8 years 10 months) Subject matter expert for IBM Enterprise Content Management products portfolio. \nEnterprise Content Management solutions architecture and development \nCustomer relationship and technical enablement. Data Architect GE Healthcare June 2005  –  November 2006  (1 year 6 months) Bengaluru Area, India Data modeling, data architecture, database administration \nSQL development and customization Senior Software Engineer sonata software 1998  –  2005  (7 years) Bengaluru Area, India Technical Leader IBM Technical Leader IBM Senior Technical Architect IBM November 2006  – Present (8 years 10 months) Subject matter expert for IBM Enterprise Content Management products portfolio. \nEnterprise Content Management solutions architecture and development \nCustomer relationship and technical enablement. Senior Technical Architect IBM November 2006  – Present (8 years 10 months) Subject matter expert for IBM Enterprise Content Management products portfolio. \nEnterprise Content Management solutions architecture and development \nCustomer relationship and technical enablement. Data Architect GE Healthcare June 2005  –  November 2006  (1 year 6 months) Bengaluru Area, India Data modeling, data architecture, database administration \nSQL development and customization Data Architect GE Healthcare June 2005  –  November 2006  (1 year 6 months) Bengaluru Area, India Data modeling, data architecture, database administration \nSQL development and customization Senior Software Engineer sonata software 1998  –  2005  (7 years) Bengaluru Area, India Senior Software Engineer sonata software 1998  –  2005  (7 years) Bengaluru Area, India Skills Requirements Analysis Solution Architecture Software Project... SQL Skills  Requirements Analysis Solution Architecture Software Project... SQL Requirements Analysis Solution Architecture Software Project... SQL Requirements Analysis Solution Architecture Software Project... SQL Education Andhra University B.Tech,  EEE 1993  – 1997 Andhra University B.Tech,  EEE 1993  – 1997 Andhra University B.Tech,  EEE 1993  – 1997 Andhra University B.Tech,  EEE 1993  – 1997 ", "Languages English Chinese Native or bilingual proficiency English Chinese Native or bilingual proficiency English Chinese Native or bilingual proficiency Native or bilingual proficiency Skills Enterprise Software Solution Architecture Agile Methodologies Enterprise Architecture Web Services Cloud Computing SOA SaaS Integration Unix System Architecture SDLC Security Architectures Project Management Hadoop SQL Big Data IT Strategy See 4+     See less Skills  Enterprise Software Solution Architecture Agile Methodologies Enterprise Architecture Web Services Cloud Computing SOA SaaS Integration Unix System Architecture SDLC Security Architectures Project Management Hadoop SQL Big Data IT Strategy See 4+     See less Enterprise Software Solution Architecture Agile Methodologies Enterprise Architecture Web Services Cloud Computing SOA SaaS Integration Unix System Architecture SDLC Security Architectures Project Management Hadoop SQL Big Data IT Strategy See 4+     See less Enterprise Software Solution Architecture Agile Methodologies Enterprise Architecture Web Services Cloud Computing SOA SaaS Integration Unix System Architecture SDLC Security Architectures Project Management Hadoop SQL Big Data IT Strategy See 4+     See less ", "Summary Broad range of skills: architecture/design, project management, pre-sales, bid-management and business analysis.  \n \nSpecialist in application integration architecture in legacy legacy applications in the finance industry. \n \nExperienced working with clients in consultancy-style engagements. Specialties:Detailed knowledge of IBM integration suite \nDetailed knowledge of Rational System Architect \nIBM Product Certified: Websphere Integration Suite \nIBM Certified Infrastructure Systems Architect (ISA) \nSun Certified Enterprise Architect for Java 2 Enterprise Edition (J2EE) Technology (SCEA) \nIBM Certified Solution Designer IBM e-Business Solutions \nMicrosoft Certified Solution Developer (MCSD) Summary Broad range of skills: architecture/design, project management, pre-sales, bid-management and business analysis.  \n \nSpecialist in application integration architecture in legacy legacy applications in the finance industry. \n \nExperienced working with clients in consultancy-style engagements. Specialties:Detailed knowledge of IBM integration suite \nDetailed knowledge of Rational System Architect \nIBM Product Certified: Websphere Integration Suite \nIBM Certified Infrastructure Systems Architect (ISA) \nSun Certified Enterprise Architect for Java 2 Enterprise Edition (J2EE) Technology (SCEA) \nIBM Certified Solution Designer IBM e-Business Solutions \nMicrosoft Certified Solution Developer (MCSD) Broad range of skills: architecture/design, project management, pre-sales, bid-management and business analysis.  \n \nSpecialist in application integration architecture in legacy legacy applications in the finance industry. \n \nExperienced working with clients in consultancy-style engagements. Specialties:Detailed knowledge of IBM integration suite \nDetailed knowledge of Rational System Architect \nIBM Product Certified: Websphere Integration Suite \nIBM Certified Infrastructure Systems Architect (ISA) \nSun Certified Enterprise Architect for Java 2 Enterprise Edition (J2EE) Technology (SCEA) \nIBM Certified Solution Designer IBM e-Business Solutions \nMicrosoft Certified Solution Developer (MCSD) Broad range of skills: architecture/design, project management, pre-sales, bid-management and business analysis.  \n \nSpecialist in application integration architecture in legacy legacy applications in the finance industry. \n \nExperienced working with clients in consultancy-style engagements. Specialties:Detailed knowledge of IBM integration suite \nDetailed knowledge of Rational System Architect \nIBM Product Certified: Websphere Integration Suite \nIBM Certified Infrastructure Systems Architect (ISA) \nSun Certified Enterprise Architect for Java 2 Enterprise Edition (J2EE) Technology (SCEA) \nIBM Certified Solution Designer IBM e-Business Solutions \nMicrosoft Certified Solution Developer (MCSD) Experience Solution Architect Fidelity Information Services December 2012  – Present (2 years 9 months) Thailand Solution Architect IBM SD Outsourcing Thailand March 2006  –  December 2012  (6 years 10 months) Applications architect in retail bank. Legacy and new application portfolio of 297 applications and 300 application development staff. Focus areas integration and portfolio analysis. Senior Technical Architect IBM Strategic Outsourcing (Singapore) January 2005  –  March 2006  (1 year 3 months) Senior Technical Architect for IBM Strategic Outsourcing for large retail bank. \nDeveloped infrastructure plan and costing model for replacement of core banking system. Technical Architect Information Technology and Services December 2003  –  January 2005  (1 year 2 months) Designed B2B Exchange for logistics business in Asia. Broker allowed ERP systems to connect to multiple warehouse management systems. Integration Consulting Information Technology and Services December 2002  –  November 2003  (1 year) Saudi Arabia - Retail Banking \nReview and audit of integration services layer, (WebSphere MQ/WMQI/WAS), at retail bank. Layer reviewed connected all e-channel delivery systems. Specification of resilience options for middleware layer, and performance analysis and capacity planning. \n \n \n \nUk Health Care project \nThree-month assignment, working on the integration layer between existing and new applications using messaging and web services. Consultant ING Barings Bank December 2001  –  June 2002  (7 months) Retail Banking \nReview and audit of integration services layer, (WebSphere MQ/WMQI/WAS), at retail bank. Layer reviewed connected all e-channel delivery systems. Specification of resilience options for middleware layer, and performance analysis and capacity planning.; Straight Through Processing (STP) Project (Asia) \nTime; Designed technical components for Straight Through Processing, (STP), between Front Office dealing systems and settlement and risk management systems for Repo trading. Consultant ABN AMRO Bank April 2001  –  December 2001  (9 months) Technical authority and architect for FIX based (Financial Information Exchange) global client connectivity order routing solution for ABN AMRO Bank Securities. Consultant New Era of Networks January 1999  –  January 2001  (2 years 1 month) Specified application architectures in both a pre and post-sales roles. Acted as technical authority for resellers in Japan, resulting in 20 M US of inventory orders. Delivered training to resellers in Japan and Singapore. Consultant DM (Asia) Ltd January 1995  –  January 1999  (4 years 1 month) Projects across: \nBI and Datawarehousing. \nFinance \nAirport Aviation Fuel Management \nFast Moving Consumer Goods (FMCG) \nTransport industry (Cargo and Aviation) (EDI) \nTelecommunications \nHealth \nLogistics (EDI B2B) Technical Account Development Manager Fujitsu/ICLIndustry January 1990  –  January 1995  (5 years 1 month) Technical pre-sales role, responsible for development of solution architectures, bid management and the development of prototypes and benchmarks. Law Enforcement Hong Kong Government January 1982  –  January 1989  (7 years 1 month) Business representative on criminal intelligence application development. Solution Architect Fidelity Information Services December 2012  – Present (2 years 9 months) Thailand Solution Architect Fidelity Information Services December 2012  – Present (2 years 9 months) Thailand Solution Architect IBM SD Outsourcing Thailand March 2006  –  December 2012  (6 years 10 months) Applications architect in retail bank. Legacy and new application portfolio of 297 applications and 300 application development staff. Focus areas integration and portfolio analysis. Solution Architect IBM SD Outsourcing Thailand March 2006  –  December 2012  (6 years 10 months) Applications architect in retail bank. Legacy and new application portfolio of 297 applications and 300 application development staff. Focus areas integration and portfolio analysis. Senior Technical Architect IBM Strategic Outsourcing (Singapore) January 2005  –  March 2006  (1 year 3 months) Senior Technical Architect for IBM Strategic Outsourcing for large retail bank. \nDeveloped infrastructure plan and costing model for replacement of core banking system. Senior Technical Architect IBM Strategic Outsourcing (Singapore) January 2005  –  March 2006  (1 year 3 months) Senior Technical Architect for IBM Strategic Outsourcing for large retail bank. \nDeveloped infrastructure plan and costing model for replacement of core banking system. Technical Architect Information Technology and Services December 2003  –  January 2005  (1 year 2 months) Designed B2B Exchange for logistics business in Asia. Broker allowed ERP systems to connect to multiple warehouse management systems. Technical Architect Information Technology and Services December 2003  –  January 2005  (1 year 2 months) Designed B2B Exchange for logistics business in Asia. Broker allowed ERP systems to connect to multiple warehouse management systems. Integration Consulting Information Technology and Services December 2002  –  November 2003  (1 year) Saudi Arabia - Retail Banking \nReview and audit of integration services layer, (WebSphere MQ/WMQI/WAS), at retail bank. Layer reviewed connected all e-channel delivery systems. Specification of resilience options for middleware layer, and performance analysis and capacity planning. \n \n \n \nUk Health Care project \nThree-month assignment, working on the integration layer between existing and new applications using messaging and web services. Integration Consulting Information Technology and Services December 2002  –  November 2003  (1 year) Saudi Arabia - Retail Banking \nReview and audit of integration services layer, (WebSphere MQ/WMQI/WAS), at retail bank. Layer reviewed connected all e-channel delivery systems. Specification of resilience options for middleware layer, and performance analysis and capacity planning. \n \n \n \nUk Health Care project \nThree-month assignment, working on the integration layer between existing and new applications using messaging and web services. Consultant ING Barings Bank December 2001  –  June 2002  (7 months) Retail Banking \nReview and audit of integration services layer, (WebSphere MQ/WMQI/WAS), at retail bank. Layer reviewed connected all e-channel delivery systems. Specification of resilience options for middleware layer, and performance analysis and capacity planning.; Straight Through Processing (STP) Project (Asia) \nTime; Designed technical components for Straight Through Processing, (STP), between Front Office dealing systems and settlement and risk management systems for Repo trading. Consultant ING Barings Bank December 2001  –  June 2002  (7 months) Retail Banking \nReview and audit of integration services layer, (WebSphere MQ/WMQI/WAS), at retail bank. Layer reviewed connected all e-channel delivery systems. Specification of resilience options for middleware layer, and performance analysis and capacity planning.; Straight Through Processing (STP) Project (Asia) \nTime; Designed technical components for Straight Through Processing, (STP), between Front Office dealing systems and settlement and risk management systems for Repo trading. Consultant ABN AMRO Bank April 2001  –  December 2001  (9 months) Technical authority and architect for FIX based (Financial Information Exchange) global client connectivity order routing solution for ABN AMRO Bank Securities. Consultant ABN AMRO Bank April 2001  –  December 2001  (9 months) Technical authority and architect for FIX based (Financial Information Exchange) global client connectivity order routing solution for ABN AMRO Bank Securities. Consultant New Era of Networks January 1999  –  January 2001  (2 years 1 month) Specified application architectures in both a pre and post-sales roles. Acted as technical authority for resellers in Japan, resulting in 20 M US of inventory orders. Delivered training to resellers in Japan and Singapore. Consultant New Era of Networks January 1999  –  January 2001  (2 years 1 month) Specified application architectures in both a pre and post-sales roles. Acted as technical authority for resellers in Japan, resulting in 20 M US of inventory orders. Delivered training to resellers in Japan and Singapore. Consultant DM (Asia) Ltd January 1995  –  January 1999  (4 years 1 month) Projects across: \nBI and Datawarehousing. \nFinance \nAirport Aviation Fuel Management \nFast Moving Consumer Goods (FMCG) \nTransport industry (Cargo and Aviation) (EDI) \nTelecommunications \nHealth \nLogistics (EDI B2B) Consultant DM (Asia) Ltd January 1995  –  January 1999  (4 years 1 month) Projects across: \nBI and Datawarehousing. \nFinance \nAirport Aviation Fuel Management \nFast Moving Consumer Goods (FMCG) \nTransport industry (Cargo and Aviation) (EDI) \nTelecommunications \nHealth \nLogistics (EDI B2B) Technical Account Development Manager Fujitsu/ICLIndustry January 1990  –  January 1995  (5 years 1 month) Technical pre-sales role, responsible for development of solution architectures, bid management and the development of prototypes and benchmarks. Technical Account Development Manager Fujitsu/ICLIndustry January 1990  –  January 1995  (5 years 1 month) Technical pre-sales role, responsible for development of solution architectures, bid management and the development of prototypes and benchmarks. Law Enforcement Hong Kong Government January 1982  –  January 1989  (7 years 1 month) Business representative on criminal intelligence application development. Law Enforcement Hong Kong Government January 1982  –  January 1989  (7 years 1 month) Business representative on criminal intelligence application development. Skills Integration Business Analysis Solution Architecture Business Intelligence Risk Management Data Warehousing Project Management SOA Pre-sales Software Development Web Services Outsourcing Java Enterprise Edition Telecommunications Agile Methodologies Requirements Analysis Websphere ERP IT Strategy Middleware Training Enterprise Architecture Core Banking SDLC Application Architecture Architecture See 11+     See less Skills  Integration Business Analysis Solution Architecture Business Intelligence Risk Management Data Warehousing Project Management SOA Pre-sales Software Development Web Services Outsourcing Java Enterprise Edition Telecommunications Agile Methodologies Requirements Analysis Websphere ERP IT Strategy Middleware Training Enterprise Architecture Core Banking SDLC Application Architecture Architecture See 11+     See less Integration Business Analysis Solution Architecture Business Intelligence Risk Management Data Warehousing Project Management SOA Pre-sales Software Development Web Services Outsourcing Java Enterprise Edition Telecommunications Agile Methodologies Requirements Analysis Websphere ERP IT Strategy Middleware Training Enterprise Architecture Core Banking SDLC Application Architecture Architecture See 11+     See less Integration Business Analysis Solution Architecture Business Intelligence Risk Management Data Warehousing Project Management SOA Pre-sales Software Development Web Services Outsourcing Java Enterprise Edition Telecommunications Agile Methodologies Requirements Analysis Websphere ERP IT Strategy Middleware Training Enterprise Architecture Core Banking SDLC Application Architecture Architecture See 11+     See less Education University of Newcastle Bachelor of Science; BSc Honours,  Physics University of Otago Master of Business Administration Degree (M.B.A University of Newcastle Bachelor of Science; BSc Honours,  Physics University of Newcastle Bachelor of Science; BSc Honours,  Physics University of Newcastle Bachelor of Science; BSc Honours,  Physics University of Otago Master of Business Administration Degree (M.B.A University of Otago Master of Business Administration Degree (M.B.A University of Otago Master of Business Administration Degree (M.B.A ", "Experience Senior Technical Architect IBM Senior Technical Architect IBM Senior Technical Architect IBM ", "Summary Fully recovered former IT industry workaholic turned sailing instructor & charter captain. \n \nExtensive sailing experience on a wide range of vessels in many different venues. Currently sailing the waters of the NW & SW Caribbean. \n \nASA Sailing Instructor \nASA Instructor Evaluator \nUSCG Licensed Captain (100-Ton Master, Near Coastal, Aux Sail) \n \nGoal: Keep sailing Summary Fully recovered former IT industry workaholic turned sailing instructor & charter captain. \n \nExtensive sailing experience on a wide range of vessels in many different venues. Currently sailing the waters of the NW & SW Caribbean. \n \nASA Sailing Instructor \nASA Instructor Evaluator \nUSCG Licensed Captain (100-Ton Master, Near Coastal, Aux Sail) \n \nGoal: Keep sailing Fully recovered former IT industry workaholic turned sailing instructor & charter captain. \n \nExtensive sailing experience on a wide range of vessels in many different venues. Currently sailing the waters of the NW & SW Caribbean. \n \nASA Sailing Instructor \nASA Instructor Evaluator \nUSCG Licensed Captain (100-Ton Master, Near Coastal, Aux Sail) \n \nGoal: Keep sailing Fully recovered former IT industry workaholic turned sailing instructor & charter captain. \n \nExtensive sailing experience on a wide range of vessels in many different venues. Currently sailing the waters of the NW & SW Caribbean. \n \nASA Sailing Instructor \nASA Instructor Evaluator \nUSCG Licensed Captain (100-Ton Master, Near Coastal, Aux Sail) \n \nGoal: Keep sailing Languages Spanish Spanish Spanish Skills Leadership Navigation Maritime Sailing Sailing Instruction Charter Captain Belize Local Knowledge Guatemala Local... Heavy Weather Sailing Cruising Boat Brewing Scuba Diving Yachting Boating Project Management Integration Program Management Change Management See 4+     See less Skills  Leadership Navigation Maritime Sailing Sailing Instruction Charter Captain Belize Local Knowledge Guatemala Local... Heavy Weather Sailing Cruising Boat Brewing Scuba Diving Yachting Boating Project Management Integration Program Management Change Management See 4+     See less Leadership Navigation Maritime Sailing Sailing Instruction Charter Captain Belize Local Knowledge Guatemala Local... Heavy Weather Sailing Cruising Boat Brewing Scuba Diving Yachting Boating Project Management Integration Program Management Change Management See 4+     See less Leadership Navigation Maritime Sailing Sailing Instruction Charter Captain Belize Local Knowledge Guatemala Local... Heavy Weather Sailing Cruising Boat Brewing Scuba Diving Yachting Boating Project Management Integration Program Management Change Management See 4+     See less ", "Summary •\t13 years of strong experience in EAI software development using IBM Message Broker, IBM WebSphere Process Server and ESB and IBM MQ Workflow.  \n•\tIBM Certified System Administrator for WebSphere MQ v6.0 \n•\tIBM Certified WebSphere Enterprise Service Bus 7.0, Integration Developer \n•\tIBM Certified Integration Developer - WebSphere Process Server V7.0 \n•\tIBM Certified SOA Associate [2008] \n•\tWorked on analysis, design, and development and testing phases in various projects.  \n•\tMostly worked at onsite with assignments involved requirements gathering, high level and detailed design documentation, review of artifacts delivered by offshore team and implementation of the application at the client’s site.  \n•\tProvided consultancy on EAI tools like MQ Workflow, IBM WMQ, IBM WMB and IBM WESB.  \n•\tHave done production support and onsite coordination for EAI implementation using IBM WMQ, IBM Message Broker and IBM WebSphere Application Server.  \n•\tDeveloped Web Service solutions for IBM WebSphere Application Server  \n•\tHandled migration projects from MQSI to WBIMB  \n•\tDriven major upgrades of IBM WMQ, IBM WBIMB and IBM WAS as part of production support.  \n•\tAware of the latest trends and technology in EAI industry. \n \nSpecialties: IBM WESB, IBM WBI Message Broker, IBM MQ Workflow, IBM WMQ, Web Service, XML and XML Schema, Java, WebService Security Summary •\t13 years of strong experience in EAI software development using IBM Message Broker, IBM WebSphere Process Server and ESB and IBM MQ Workflow.  \n•\tIBM Certified System Administrator for WebSphere MQ v6.0 \n•\tIBM Certified WebSphere Enterprise Service Bus 7.0, Integration Developer \n•\tIBM Certified Integration Developer - WebSphere Process Server V7.0 \n•\tIBM Certified SOA Associate [2008] \n•\tWorked on analysis, design, and development and testing phases in various projects.  \n•\tMostly worked at onsite with assignments involved requirements gathering, high level and detailed design documentation, review of artifacts delivered by offshore team and implementation of the application at the client’s site.  \n•\tProvided consultancy on EAI tools like MQ Workflow, IBM WMQ, IBM WMB and IBM WESB.  \n•\tHave done production support and onsite coordination for EAI implementation using IBM WMQ, IBM Message Broker and IBM WebSphere Application Server.  \n•\tDeveloped Web Service solutions for IBM WebSphere Application Server  \n•\tHandled migration projects from MQSI to WBIMB  \n•\tDriven major upgrades of IBM WMQ, IBM WBIMB and IBM WAS as part of production support.  \n•\tAware of the latest trends and technology in EAI industry. \n \nSpecialties: IBM WESB, IBM WBI Message Broker, IBM MQ Workflow, IBM WMQ, Web Service, XML and XML Schema, Java, WebService Security •\t13 years of strong experience in EAI software development using IBM Message Broker, IBM WebSphere Process Server and ESB and IBM MQ Workflow.  \n•\tIBM Certified System Administrator for WebSphere MQ v6.0 \n•\tIBM Certified WebSphere Enterprise Service Bus 7.0, Integration Developer \n•\tIBM Certified Integration Developer - WebSphere Process Server V7.0 \n•\tIBM Certified SOA Associate [2008] \n•\tWorked on analysis, design, and development and testing phases in various projects.  \n•\tMostly worked at onsite with assignments involved requirements gathering, high level and detailed design documentation, review of artifacts delivered by offshore team and implementation of the application at the client’s site.  \n•\tProvided consultancy on EAI tools like MQ Workflow, IBM WMQ, IBM WMB and IBM WESB.  \n•\tHave done production support and onsite coordination for EAI implementation using IBM WMQ, IBM Message Broker and IBM WebSphere Application Server.  \n•\tDeveloped Web Service solutions for IBM WebSphere Application Server  \n•\tHandled migration projects from MQSI to WBIMB  \n•\tDriven major upgrades of IBM WMQ, IBM WBIMB and IBM WAS as part of production support.  \n•\tAware of the latest trends and technology in EAI industry. \n \nSpecialties: IBM WESB, IBM WBI Message Broker, IBM MQ Workflow, IBM WMQ, Web Service, XML and XML Schema, Java, WebService Security •\t13 years of strong experience in EAI software development using IBM Message Broker, IBM WebSphere Process Server and ESB and IBM MQ Workflow.  \n•\tIBM Certified System Administrator for WebSphere MQ v6.0 \n•\tIBM Certified WebSphere Enterprise Service Bus 7.0, Integration Developer \n•\tIBM Certified Integration Developer - WebSphere Process Server V7.0 \n•\tIBM Certified SOA Associate [2008] \n•\tWorked on analysis, design, and development and testing phases in various projects.  \n•\tMostly worked at onsite with assignments involved requirements gathering, high level and detailed design documentation, review of artifacts delivered by offshore team and implementation of the application at the client’s site.  \n•\tProvided consultancy on EAI tools like MQ Workflow, IBM WMQ, IBM WMB and IBM WESB.  \n•\tHave done production support and onsite coordination for EAI implementation using IBM WMQ, IBM Message Broker and IBM WebSphere Application Server.  \n•\tDeveloped Web Service solutions for IBM WebSphere Application Server  \n•\tHandled migration projects from MQSI to WBIMB  \n•\tDriven major upgrades of IBM WMQ, IBM WBIMB and IBM WAS as part of production support.  \n•\tAware of the latest trends and technology in EAI industry. \n \nSpecialties: IBM WESB, IBM WBI Message Broker, IBM MQ Workflow, IBM WMQ, Web Service, XML and XML Schema, Java, WebService Security Experience Senior Technical Architect IBM November 2011  – Present (3 years 10 months) Noida Solution Architect for IBM BPM 7.5 Wipro Technologies June 2011  –  October 2011  (5 months) Bengaluru Area, India Technical Architect for IBM WebSphere ESB Wipro Technologies January 2011  –  May 2011  (5 months) Franklin, TN, USA Project Engineer for IBM Middleware Technologies Wipro Technologies January 2007  –  December 2010  (4 years) Rochester, New York Area Associate Consultant Wipro Technologies November 2004  –  December 2006  (2 years 2 months) Analyst Covansys Singapore Pte. Ltd. July 2004  –  October 2004  (4 months) Project Leader Automated Workflow Pvt. Ltd. January 2001  –  June 2004  (3 years 6 months) Developer Bit-Mapper Infotech Pvt. Ltd. April 2000  –  January 2001  (10 months) Senior Technical Architect IBM November 2011  – Present (3 years 10 months) Noida Senior Technical Architect IBM November 2011  – Present (3 years 10 months) Noida Solution Architect for IBM BPM 7.5 Wipro Technologies June 2011  –  October 2011  (5 months) Bengaluru Area, India Solution Architect for IBM BPM 7.5 Wipro Technologies June 2011  –  October 2011  (5 months) Bengaluru Area, India Technical Architect for IBM WebSphere ESB Wipro Technologies January 2011  –  May 2011  (5 months) Franklin, TN, USA Technical Architect for IBM WebSphere ESB Wipro Technologies January 2011  –  May 2011  (5 months) Franklin, TN, USA Project Engineer for IBM Middleware Technologies Wipro Technologies January 2007  –  December 2010  (4 years) Rochester, New York Area Project Engineer for IBM Middleware Technologies Wipro Technologies January 2007  –  December 2010  (4 years) Rochester, New York Area Associate Consultant Wipro Technologies November 2004  –  December 2006  (2 years 2 months) Associate Consultant Wipro Technologies November 2004  –  December 2006  (2 years 2 months) Analyst Covansys Singapore Pte. Ltd. July 2004  –  October 2004  (4 months) Analyst Covansys Singapore Pte. Ltd. July 2004  –  October 2004  (4 months) Project Leader Automated Workflow Pvt. Ltd. January 2001  –  June 2004  (3 years 6 months) Project Leader Automated Workflow Pvt. Ltd. January 2001  –  June 2004  (3 years 6 months) Developer Bit-Mapper Infotech Pvt. Ltd. April 2000  –  January 2001  (10 months) Developer Bit-Mapper Infotech Pvt. Ltd. April 2000  –  January 2001  (10 months) Skills WebSphere Message Broker WebSphere ESB WebSphere MQ Websphere WebSphere Application... ESB EAI Middleware Web Services XML Tomcat Servlets IBM BPM Software Development XML Schema SOA Solution Architecture Requirements Analysis Integration See 4+     See less Skills  WebSphere Message Broker WebSphere ESB WebSphere MQ Websphere WebSphere Application... ESB EAI Middleware Web Services XML Tomcat Servlets IBM BPM Software Development XML Schema SOA Solution Architecture Requirements Analysis Integration See 4+     See less WebSphere Message Broker WebSphere ESB WebSphere MQ Websphere WebSphere Application... ESB EAI Middleware Web Services XML Tomcat Servlets IBM BPM Software Development XML Schema SOA Solution Architecture Requirements Analysis Integration See 4+     See less WebSphere Message Broker WebSphere ESB WebSphere MQ Websphere WebSphere Application... ESB EAI Middleware Web Services XML Tomcat Servlets IBM BPM Software Development XML Schema SOA Solution Architecture Requirements Analysis Integration See 4+     See less Education Sikkim Manipal University - Distance Education Bachelor of Computer Applications (BCA) 2011  – 2014 Maharaja Sayajirao University Diploma 1996  – 1999 Tata Infotech Pvt. Ltd. MDIT 1996  – 1999 Sikkim Manipal University - Distance Education Bachelor of Computer Applications (BCA) 2011  – 2014 Sikkim Manipal University - Distance Education Bachelor of Computer Applications (BCA) 2011  – 2014 Sikkim Manipal University - Distance Education Bachelor of Computer Applications (BCA) 2011  – 2014 Maharaja Sayajirao University Diploma 1996  – 1999 Maharaja Sayajirao University Diploma 1996  – 1999 Maharaja Sayajirao University Diploma 1996  – 1999 Tata Infotech Pvt. Ltd. MDIT 1996  – 1999 Tata Infotech Pvt. Ltd. MDIT 1996  – 1999 Tata Infotech Pvt. Ltd. MDIT 1996  – 1999 ", "Summary Highly experienced professional with technical and consulting background in business application design, development and implementation to include system integration. Well versed in e-business, electronic data interchange (EDI), database management, data modeling, work flow management, object technology, grid computing, virtualization, cloud computing, and infrastructure solutions. Background in manufacturing, distribution, transportation, education, US shipbuilding, and defense industries. Managed and led development and support teams. Conducted business presentations to C-level executives. Consulted to companies in Latin America. Prepared and taught courses for both executive and highly technical community. \n \nSpecialties: Several programming languages to include assembler, FORTRAN, ALGOL, COBOL, C, C++ and Java \nSoftware development methologies \nObject oriented, Web Services, Service Oriented Architecture \nInternet Technologies such as XML, XSLT, XML Schema, ebusiness, ecommerce, electronic data exchange (EDI) \nResearch, development and industry experience \nGrid Computing and Virtualization \nCloud Computing \nITIL V3 \nComputer Simulations Summary Highly experienced professional with technical and consulting background in business application design, development and implementation to include system integration. Well versed in e-business, electronic data interchange (EDI), database management, data modeling, work flow management, object technology, grid computing, virtualization, cloud computing, and infrastructure solutions. Background in manufacturing, distribution, transportation, education, US shipbuilding, and defense industries. Managed and led development and support teams. Conducted business presentations to C-level executives. Consulted to companies in Latin America. Prepared and taught courses for both executive and highly technical community. \n \nSpecialties: Several programming languages to include assembler, FORTRAN, ALGOL, COBOL, C, C++ and Java \nSoftware development methologies \nObject oriented, Web Services, Service Oriented Architecture \nInternet Technologies such as XML, XSLT, XML Schema, ebusiness, ecommerce, electronic data exchange (EDI) \nResearch, development and industry experience \nGrid Computing and Virtualization \nCloud Computing \nITIL V3 \nComputer Simulations Highly experienced professional with technical and consulting background in business application design, development and implementation to include system integration. Well versed in e-business, electronic data interchange (EDI), database management, data modeling, work flow management, object technology, grid computing, virtualization, cloud computing, and infrastructure solutions. Background in manufacturing, distribution, transportation, education, US shipbuilding, and defense industries. Managed and led development and support teams. Conducted business presentations to C-level executives. Consulted to companies in Latin America. Prepared and taught courses for both executive and highly technical community. \n \nSpecialties: Several programming languages to include assembler, FORTRAN, ALGOL, COBOL, C, C++ and Java \nSoftware development methologies \nObject oriented, Web Services, Service Oriented Architecture \nInternet Technologies such as XML, XSLT, XML Schema, ebusiness, ecommerce, electronic data exchange (EDI) \nResearch, development and industry experience \nGrid Computing and Virtualization \nCloud Computing \nITIL V3 \nComputer Simulations Highly experienced professional with technical and consulting background in business application design, development and implementation to include system integration. Well versed in e-business, electronic data interchange (EDI), database management, data modeling, work flow management, object technology, grid computing, virtualization, cloud computing, and infrastructure solutions. Background in manufacturing, distribution, transportation, education, US shipbuilding, and defense industries. Managed and led development and support teams. Conducted business presentations to C-level executives. Consulted to companies in Latin America. Prepared and taught courses for both executive and highly technical community. \n \nSpecialties: Several programming languages to include assembler, FORTRAN, ALGOL, COBOL, C, C++ and Java \nSoftware development methologies \nObject oriented, Web Services, Service Oriented Architecture \nInternet Technologies such as XML, XSLT, XML Schema, ebusiness, ecommerce, electronic data exchange (EDI) \nResearch, development and industry experience \nGrid Computing and Virtualization \nCloud Computing \nITIL V3 \nComputer Simulations Experience Senior Technical Architect IBM 2002  –  2009  (7 years) Senior Software Engineer IBM 1993  –  2002  (9 years) Lieutenant Colonel US Army Reserve 81st Army Reserve Command 1991  –  1996  (5 years) Senior Technical Architect IBM 2002  –  2009  (7 years) Senior Technical Architect IBM 2002  –  2009  (7 years) Senior Software Engineer IBM 1993  –  2002  (9 years) Senior Software Engineer IBM 1993  –  2002  (9 years) Lieutenant Colonel US Army Reserve 81st Army Reserve Command 1991  –  1996  (5 years) Lieutenant Colonel US Army Reserve 81st Army Reserve Command 1991  –  1996  (5 years) Languages Spanish Spanish Spanish Skills SOA Cloud Computing Software Development Web Services System Architecture E-commerce Java Grid Computing Enterprise Architecture Architectures ITIL Virtualization Unix C E-business Solution Architecture Distributed Systems XSLT XML Schema C++ Spanish Architecture Websphere Solaris Software Engineering Sun Certified Java... Computer Simulation Object Oriented Modeling OOP Object Oriented... Object Oriented Design COBOL Fortran Assembly Language Medical Interpreter... Commerical Pilot Single... Airplane Instrument... FAA Certified Ground... See 22+     See less Skills  SOA Cloud Computing Software Development Web Services System Architecture E-commerce Java Grid Computing Enterprise Architecture Architectures ITIL Virtualization Unix C E-business Solution Architecture Distributed Systems XSLT XML Schema C++ Spanish Architecture Websphere Solaris Software Engineering Sun Certified Java... Computer Simulation Object Oriented Modeling OOP Object Oriented... Object Oriented Design COBOL Fortran Assembly Language Medical Interpreter... Commerical Pilot Single... Airplane Instrument... FAA Certified Ground... See 22+     See less SOA Cloud Computing Software Development Web Services System Architecture E-commerce Java Grid Computing Enterprise Architecture Architectures ITIL Virtualization Unix C E-business Solution Architecture Distributed Systems XSLT XML Schema C++ Spanish Architecture Websphere Solaris Software Engineering Sun Certified Java... Computer Simulation Object Oriented Modeling OOP Object Oriented... Object Oriented Design COBOL Fortran Assembly Language Medical Interpreter... Commerical Pilot Single... Airplane Instrument... FAA Certified Ground... See 22+     See less SOA Cloud Computing Software Development Web Services System Architecture E-commerce Java Grid Computing Enterprise Architecture Architectures ITIL Virtualization Unix C E-business Solution Architecture Distributed Systems XSLT XML Schema C++ Spanish Architecture Websphere Solaris Software Engineering Sun Certified Java... Computer Simulation Object Oriented Modeling OOP Object Oriented... Object Oriented Design COBOL Fortran Assembly Language Medical Interpreter... Commerical Pilot Single... Airplane Instrument... FAA Certified Ground... See 22+     See less Education Georgia Institute of Technology Doctor of Philosophy (Ph.D.) 1983  – 1986 Georgia Institute of Technology Master's Degree 1972  – 1973 Universidad de Puerto Rico Bachelor's Degree 1968  – 1972 Kennesaw State University Certificate 2009  – 2009 Kennesaw State University Certificate 2014  – 2014 Georgia Institute of Technology Doctor of Philosophy (Ph.D.) 1983  – 1986 Georgia Institute of Technology Doctor of Philosophy (Ph.D.) 1983  – 1986 Georgia Institute of Technology Doctor of Philosophy (Ph.D.) 1983  – 1986 Georgia Institute of Technology Master's Degree 1972  – 1973 Georgia Institute of Technology Master's Degree 1972  – 1973 Georgia Institute of Technology Master's Degree 1972  – 1973 Universidad de Puerto Rico Bachelor's Degree 1968  – 1972 Universidad de Puerto Rico Bachelor's Degree 1968  – 1972 Universidad de Puerto Rico Bachelor's Degree 1968  – 1972 Kennesaw State University Certificate 2009  – 2009 Kennesaw State University Certificate 2009  – 2009 Kennesaw State University Certificate 2009  – 2009 Kennesaw State University Certificate 2014  – 2014 Kennesaw State University Certificate 2014  – 2014 Kennesaw State University Certificate 2014  – 2014 Honors & Awards Additional Honors & Awards Senior Member IEEE \nPatent Holder \nIBM Invention Achievement Awards \nIBM Technical Achievement Awards \nIBM 100% Club \nIBM Golden Circle \nCertified Computing Professional \nSeveral IBM, Sun and ITIL professional certifications \nCertified Pharmacy Technician (CPhT) \nCertified EKG Technician (CET) \nFord Foundation Fellowship \nDistinguished Graduate, U.S. Army Command and General Staff College \nSeveral badges including Parachutist badge, awards and medals, US Army (Active and Reserve) \nFAA Certified Commercial Pilot (Land and Sea Single Engine) \nFAA Certified Ground Instructor (Advanced and Instrument) \nKSU Medical Interpreter Certificate Additional Honors & Awards Senior Member IEEE \nPatent Holder \nIBM Invention Achievement Awards \nIBM Technical Achievement Awards \nIBM 100% Club \nIBM Golden Circle \nCertified Computing Professional \nSeveral IBM, Sun and ITIL professional certifications \nCertified Pharmacy Technician (CPhT) \nCertified EKG Technician (CET) \nFord Foundation Fellowship \nDistinguished Graduate, U.S. Army Command and General Staff College \nSeveral badges including Parachutist badge, awards and medals, US Army (Active and Reserve) \nFAA Certified Commercial Pilot (Land and Sea Single Engine) \nFAA Certified Ground Instructor (Advanced and Instrument) \nKSU Medical Interpreter Certificate Additional Honors & Awards Senior Member IEEE \nPatent Holder \nIBM Invention Achievement Awards \nIBM Technical Achievement Awards \nIBM 100% Club \nIBM Golden Circle \nCertified Computing Professional \nSeveral IBM, Sun and ITIL professional certifications \nCertified Pharmacy Technician (CPhT) \nCertified EKG Technician (CET) \nFord Foundation Fellowship \nDistinguished Graduate, U.S. Army Command and General Staff College \nSeveral badges including Parachutist badge, awards and medals, US Army (Active and Reserve) \nFAA Certified Commercial Pilot (Land and Sea Single Engine) \nFAA Certified Ground Instructor (Advanced and Instrument) \nKSU Medical Interpreter Certificate Additional Honors & Awards Senior Member IEEE \nPatent Holder \nIBM Invention Achievement Awards \nIBM Technical Achievement Awards \nIBM 100% Club \nIBM Golden Circle \nCertified Computing Professional \nSeveral IBM, Sun and ITIL professional certifications \nCertified Pharmacy Technician (CPhT) \nCertified EKG Technician (CET) \nFord Foundation Fellowship \nDistinguished Graduate, U.S. Army Command and General Staff College \nSeveral badges including Parachutist badge, awards and medals, US Army (Active and Reserve) \nFAA Certified Commercial Pilot (Land and Sea Single Engine) \nFAA Certified Ground Instructor (Advanced and Instrument) \nKSU Medical Interpreter Certificate ", "Summary Technology Executive with expertise in worldwide enterprise solutions development, systems engineering, Internet/e-commerce, web content and digital asset management systems, operations, project/program management, sales and team leadership, identity and access management, information security, enterprise marketing management, digital media \n \nSpecialties: Internet marketing, web site design and development, systems analysis and design, network design and administration, enterprise architecture, presentation and people skills, process re-engineering, team management Summary Technology Executive with expertise in worldwide enterprise solutions development, systems engineering, Internet/e-commerce, web content and digital asset management systems, operations, project/program management, sales and team leadership, identity and access management, information security, enterprise marketing management, digital media \n \nSpecialties: Internet marketing, web site design and development, systems analysis and design, network design and administration, enterprise architecture, presentation and people skills, process re-engineering, team management Technology Executive with expertise in worldwide enterprise solutions development, systems engineering, Internet/e-commerce, web content and digital asset management systems, operations, project/program management, sales and team leadership, identity and access management, information security, enterprise marketing management, digital media \n \nSpecialties: Internet marketing, web site design and development, systems analysis and design, network design and administration, enterprise architecture, presentation and people skills, process re-engineering, team management Technology Executive with expertise in worldwide enterprise solutions development, systems engineering, Internet/e-commerce, web content and digital asset management systems, operations, project/program management, sales and team leadership, identity and access management, information security, enterprise marketing management, digital media \n \nSpecialties: Internet marketing, web site design and development, systems analysis and design, network design and administration, enterprise architecture, presentation and people skills, process re-engineering, team management Experience Senior Enterprise Architect IBM March 2011  – Present (4 years 6 months) San Antonio, TX Owner Alfieri Consulting February 2004  – Present (11 years 7 months) San Antonio, TX Senior Technical Architect IBM July 2008  –  March 2011  (2 years 9 months) Austin, TX Principal, Strategic Consultant Crown Partners, LLC January 2008  –  June 2008  (6 months) Dayton, OH Senior Sales Engineer Encentuate, Inc. January 2006  –  December 2007  (2 years) Sunnyvale, CA Senior Sales Engineer Stellent, Inc. June 2005  –  December 2005  (7 months) Minneapolis, MN Principal Enterprise Architect Interwoven, Inc. September 2000  –  January 2004  (3 years 5 months) Sunnyvale, CA Senior Manager, Site Operations Compaq October 1987  –  September 2000  (13 years) Programming Manager / Information Center Supervisor Baker Service Tools, Inc. August 1980  –  October 1987  (7 years 3 months) Programmer/Analyst National Systems Analysts, Inc. January 1979  –  August 1980  (1 year 8 months) Cherry Hill, NJ Programmer/Analyst, Data Processing Manager Vineland Laboratories, Inc. October 1976  –  January 1979  (2 years 4 months) Vineland, NJ Senior Enterprise Architect IBM March 2011  – Present (4 years 6 months) San Antonio, TX Senior Enterprise Architect IBM March 2011  – Present (4 years 6 months) San Antonio, TX Owner Alfieri Consulting February 2004  – Present (11 years 7 months) San Antonio, TX Owner Alfieri Consulting February 2004  – Present (11 years 7 months) San Antonio, TX Senior Technical Architect IBM July 2008  –  March 2011  (2 years 9 months) Austin, TX Senior Technical Architect IBM July 2008  –  March 2011  (2 years 9 months) Austin, TX Principal, Strategic Consultant Crown Partners, LLC January 2008  –  June 2008  (6 months) Dayton, OH Principal, Strategic Consultant Crown Partners, LLC January 2008  –  June 2008  (6 months) Dayton, OH Senior Sales Engineer Encentuate, Inc. January 2006  –  December 2007  (2 years) Sunnyvale, CA Senior Sales Engineer Encentuate, Inc. January 2006  –  December 2007  (2 years) Sunnyvale, CA Senior Sales Engineer Stellent, Inc. June 2005  –  December 2005  (7 months) Minneapolis, MN Senior Sales Engineer Stellent, Inc. June 2005  –  December 2005  (7 months) Minneapolis, MN Principal Enterprise Architect Interwoven, Inc. September 2000  –  January 2004  (3 years 5 months) Sunnyvale, CA Principal Enterprise Architect Interwoven, Inc. September 2000  –  January 2004  (3 years 5 months) Sunnyvale, CA Senior Manager, Site Operations Compaq October 1987  –  September 2000  (13 years) Senior Manager, Site Operations Compaq October 1987  –  September 2000  (13 years) Programming Manager / Information Center Supervisor Baker Service Tools, Inc. August 1980  –  October 1987  (7 years 3 months) Programming Manager / Information Center Supervisor Baker Service Tools, Inc. August 1980  –  October 1987  (7 years 3 months) Programmer/Analyst National Systems Analysts, Inc. January 1979  –  August 1980  (1 year 8 months) Cherry Hill, NJ Programmer/Analyst National Systems Analysts, Inc. January 1979  –  August 1980  (1 year 8 months) Cherry Hill, NJ Programmer/Analyst, Data Processing Manager Vineland Laboratories, Inc. October 1976  –  January 1979  (2 years 4 months) Vineland, NJ Programmer/Analyst, Data Processing Manager Vineland Laboratories, Inc. October 1976  –  January 1979  (2 years 4 months) Vineland, NJ Languages Spanish Spanish Spanish Skills Enterprise Architecture Pre-sales Enterprise Content... E-commerce Content Management Management Project Management Consulting SharePoint Web Content Management WebSphere Application... Microsoft SQL Server Network Security VMware Visio Linux Microsoft Office Windows Information Architecture Java Training Enterprise Marketing Visual Basic Photography Mentoring Public Speaking Relationship Management Windows Server Mac OS X IBM DB/2 Oracle SQL Database Administration Website Management Network Administration Active Directory Exchange Website Development HTML/XML User Interface Design Videography Video Editing Photoshop Adobe Creative Suite RPG II COBOL CICS IBM Mainframe IBM AS/400 Unica Silverpop See 35+     See less Skills  Enterprise Architecture Pre-sales Enterprise Content... E-commerce Content Management Management Project Management Consulting SharePoint Web Content Management WebSphere Application... Microsoft SQL Server Network Security VMware Visio Linux Microsoft Office Windows Information Architecture Java Training Enterprise Marketing Visual Basic Photography Mentoring Public Speaking Relationship Management Windows Server Mac OS X IBM DB/2 Oracle SQL Database Administration Website Management Network Administration Active Directory Exchange Website Development HTML/XML User Interface Design Videography Video Editing Photoshop Adobe Creative Suite RPG II COBOL CICS IBM Mainframe IBM AS/400 Unica Silverpop See 35+     See less Enterprise Architecture Pre-sales Enterprise Content... E-commerce Content Management Management Project Management Consulting SharePoint Web Content Management WebSphere Application... Microsoft SQL Server Network Security VMware Visio Linux Microsoft Office Windows Information Architecture Java Training Enterprise Marketing Visual Basic Photography Mentoring Public Speaking Relationship Management Windows Server Mac OS X IBM DB/2 Oracle SQL Database Administration Website Management Network Administration Active Directory Exchange Website Development HTML/XML User Interface Design Videography Video Editing Photoshop Adobe Creative Suite RPG II COBOL CICS IBM Mainframe IBM AS/400 Unica Silverpop See 35+     See less Enterprise Architecture Pre-sales Enterprise Content... E-commerce Content Management Management Project Management Consulting SharePoint Web Content Management WebSphere Application... Microsoft SQL Server Network Security VMware Visio Linux Microsoft Office Windows Information Architecture Java Training Enterprise Marketing Visual Basic Photography Mentoring Public Speaking Relationship Management Windows Server Mac OS X IBM DB/2 Oracle SQL Database Administration Website Management Network Administration Active Directory Exchange Website Development HTML/XML User Interface Design Videography Video Editing Photoshop Adobe Creative Suite RPG II COBOL CICS IBM Mainframe IBM AS/400 Unica Silverpop See 35+     See less Education University of Phoenix BSIT 2009  – 2011 University of Phoenix AAIT 2008  – 2009 Maxwell Institute Diploma 1976  – 1976 Drexel University September 1973  – January 1975 Cinnaminson High School Diploma September 1969  – June 1973 University of Phoenix BSIT 2009  – 2011 University of Phoenix BSIT 2009  – 2011 University of Phoenix BSIT 2009  – 2011 University of Phoenix AAIT 2008  – 2009 University of Phoenix AAIT 2008  – 2009 University of Phoenix AAIT 2008  – 2009 Maxwell Institute Diploma 1976  – 1976 Maxwell Institute Diploma 1976  – 1976 Maxwell Institute Diploma 1976  – 1976 Drexel University September 1973  – January 1975 Drexel University September 1973  – January 1975 Drexel University September 1973  – January 1975 Cinnaminson High School Diploma September 1969  – June 1973 Cinnaminson High School Diploma September 1969  – June 1973 Cinnaminson High School Diploma September 1969  – June 1973 Honors & Awards ", "Summary Technical Architecture Specialties:Technical Architecture , Infrastructure, Siebel Summary Technical Architecture Specialties:Technical Architecture , Infrastructure, Siebel Technical Architecture Specialties:Technical Architecture , Infrastructure, Siebel Technical Architecture Specialties:Technical Architecture , Infrastructure, Siebel Experience Siebel Architect CGI March 2015  – Present (6 months) Siebel Architecte blue-infinity September 2014  –  March 2015  (7 months) Genève Siebel Architect/admin CGI February 2013  –  March 2014  (1 year 2 months) Siebel Architect AXA January 2011  –  December 2012  (2 years) Paris Area, France Siebel Architect WTA 2010  –  2010  (less than a year) Siebel Architect IBM Deutche telekom March 2007  –  August 2009  (2 years 6 months) Senior Siebel Archiect Rabobank October 2005  –  February 2007  (1 year 5 months) Senior Technical Architect for Siebel implementations Senior Technical Architect IBM Saudi Arabia November 2004  –  September 2005  (11 months) Technical Architect on a Siebel Implementation Senior Consultant Siebel Systems October 2000  –  October 2004  (4 years 1 month) Technical Architect Cap Gemini 1998  –  2000  (2 years) Ingénieur d'etudes Cap Gemini 1998  –  2000  (2 years) Responsable technique Orange 1997  –  1998  (1 year) Responsable technique Orange 1997  –  1998  (1 year) Technical Manager France Telecom 1996  –  1998  (2 years) Siebel Architect CGI March 2015  – Present (6 months) Siebel Architect CGI March 2015  – Present (6 months) Siebel Architecte blue-infinity September 2014  –  March 2015  (7 months) Genève Siebel Architecte blue-infinity September 2014  –  March 2015  (7 months) Genève Siebel Architect/admin CGI February 2013  –  March 2014  (1 year 2 months) Siebel Architect/admin CGI February 2013  –  March 2014  (1 year 2 months) Siebel Architect AXA January 2011  –  December 2012  (2 years) Paris Area, France Siebel Architect AXA January 2011  –  December 2012  (2 years) Paris Area, France Siebel Architect WTA 2010  –  2010  (less than a year) Siebel Architect WTA 2010  –  2010  (less than a year) Siebel Architect IBM Deutche telekom March 2007  –  August 2009  (2 years 6 months) Siebel Architect IBM Deutche telekom March 2007  –  August 2009  (2 years 6 months) Senior Siebel Archiect Rabobank October 2005  –  February 2007  (1 year 5 months) Senior Technical Architect for Siebel implementations Senior Siebel Archiect Rabobank October 2005  –  February 2007  (1 year 5 months) Senior Technical Architect for Siebel implementations Senior Technical Architect IBM Saudi Arabia November 2004  –  September 2005  (11 months) Technical Architect on a Siebel Implementation Senior Technical Architect IBM Saudi Arabia November 2004  –  September 2005  (11 months) Technical Architect on a Siebel Implementation Senior Consultant Siebel Systems October 2000  –  October 2004  (4 years 1 month) Senior Consultant Siebel Systems October 2000  –  October 2004  (4 years 1 month) Technical Architect Cap Gemini 1998  –  2000  (2 years) Technical Architect Cap Gemini 1998  –  2000  (2 years) Ingénieur d'etudes Cap Gemini 1998  –  2000  (2 years) Ingénieur d'etudes Cap Gemini 1998  –  2000  (2 years) Responsable technique Orange 1997  –  1998  (1 year) Responsable technique Orange 1997  –  1998  (1 year) Responsable technique Orange 1997  –  1998  (1 year) Responsable technique Orange 1997  –  1998  (1 year) Technical Manager France Telecom 1996  –  1998  (2 years) Technical Manager France Telecom 1996  –  1998  (2 years) Skills Siebel Infrastructure Technical Architecture Solution Architecture EAI Skills  Siebel Infrastructure Technical Architecture Solution Architecture EAI Siebel Infrastructure Technical Architecture Solution Architecture EAI Siebel Infrastructure Technical Architecture Solution Architecture EAI Education The Robert Gordon University Master of Science (M.Sc.),  Information Systems 1994  – 1996 IUT B The Robert Gordon University Master of Science (M.Sc.),  Information Systems 1994  – 1996 The Robert Gordon University Master of Science (M.Sc.),  Information Systems 1994  – 1996 The Robert Gordon University Master of Science (M.Sc.),  Information Systems 1994  – 1996 IUT B IUT B IUT B ", "Summary • With more than 17 years of overall experience in IT Industry. \n• Roles: Smartet Cities Architect, WebSphere Portal & Tivoli Architect, Software/Solution Architect, Project Manager, Strategy Advisor, Virtual Worlds Architect, Business Analyst and Programmer Summary • With more than 17 years of overall experience in IT Industry. \n• Roles: Smartet Cities Architect, WebSphere Portal & Tivoli Architect, Software/Solution Architect, Project Manager, Strategy Advisor, Virtual Worlds Architect, Business Analyst and Programmer • With more than 17 years of overall experience in IT Industry. \n• Roles: Smartet Cities Architect, WebSphere Portal & Tivoli Architect, Software/Solution Architect, Project Manager, Strategy Advisor, Virtual Worlds Architect, Business Analyst and Programmer • With more than 17 years of overall experience in IT Industry. \n• Roles: Smartet Cities Architect, WebSphere Portal & Tivoli Architect, Software/Solution Architect, Project Manager, Strategy Advisor, Virtual Worlds Architect, Business Analyst and Programmer Experience Senior Technical Architect, Smarter Cities, Industry Solutions, Software Group IBM December 2001  – Present (13 years 9 months) Bangalore, India and Herndon, USA • Area Expertise: Project Management, Cyber Security, Information Security, Quality Assurance, Vendor and Package Analysis and Selection, E-business Infrastructure, Personalization Technologies and Architectures, Performance Management/Stress Testing, Content Management, Search Engine Design & Implementation, 3D In-traverse, Web Metrics, WebSphere Portal Architect, Portal Development, Data Network Design & Implementation, and Network & Systems Management. \n• Application Expertise: Active Worlds, WebSphere Portal, WebSphere Application Server, Tivoli Directory Server, Tivoli Identity & Access Manager, Tivoli Network Management and Performance, Lotus Collaborative Products (Lotus Sametime Standard & Advanced, Lotus Quickr, Unified Telephony), Lotus Quickr, OmniFind, Rational SDLC Products. Sr. Software Engineer Strategic Management Group Inc August 1999  –  November 2001  (2 years 4 months) Greater Philadelphia Area IQNet Platform Design & Implementation: \n \n• Design & implementation of three-tier state based Learning Management System (LMS) and Learning Delivery System (LDS), which runs on Windows 2000 platform utilizing the Microsoft Internet Information Server, and consists of Active Server Pages. Management & Participant information are stored in a relational database (SQL Server 7.0). Business logic (Microsoft COM based) keeps track of usage performance, real time usage statistics, controls user navigation & retrieves content based on client. System allows high-level client based content customization (data is stored in a single database). System also contains extensive administration site that allows clients to views user and group statistics, it also allows administrator to set parameters on how the system performs (based on client). \n \nHuthwaite Strategic SPIN®/E-Biz IQNet/Finance IQNet Product Design & Implementation: \n• Development of platform to be used in three distinct products. \n \nSimulation-Centric Learning Solutions Development: \n• Design & implementation of three distinct simulation-centric learning solutions used in teaching and consulting. Products include “Optimizing the Supply Chain” (OSC), “Project Management” (PRM) and “Managing Change” (MCH). Important feature of OSC contain a complex mathematical model simulating the supply chain functionality. Designed & development of the first java-based and web-based implementation of the financial model at SMG. Developed software that translates model designed in PowerSim into java-based code. Developed software enabled us to directly translate complex financial models developed using PowerSim into Java Code (with minimal amount of user manipulation). Provided extensive consultation to other solutions under development as well as writing software to facilitate this development. Software includes system that automatically parses simulation storyboards and automatically populates the database. Consultant Semcor August 1997  –  August 1999  (2 years 1 month) Warminster, PA Worked on several projects in following areas: \n- Network Design and Implementation. \n- Software Integration/Administration. \n- Web Development and Database Development. \n- Application Development. Software Engineer Future Software Private Limited September 1995  –  August 1996  (1 year) Chennai Area, India Worked in the Products group in the areas of data communication and telecommunication. Projects involved were, ATM LAN Emulation (enhancements and testing), Scorpio SNMP Agent (design and implementation), Future SNMP Agent (design and implementation), 2-port Bridge and Inter Process Communication (IPC). Senior Technical Architect, Smarter Cities, Industry Solutions, Software Group IBM December 2001  – Present (13 years 9 months) Bangalore, India and Herndon, USA • Area Expertise: Project Management, Cyber Security, Information Security, Quality Assurance, Vendor and Package Analysis and Selection, E-business Infrastructure, Personalization Technologies and Architectures, Performance Management/Stress Testing, Content Management, Search Engine Design & Implementation, 3D In-traverse, Web Metrics, WebSphere Portal Architect, Portal Development, Data Network Design & Implementation, and Network & Systems Management. \n• Application Expertise: Active Worlds, WebSphere Portal, WebSphere Application Server, Tivoli Directory Server, Tivoli Identity & Access Manager, Tivoli Network Management and Performance, Lotus Collaborative Products (Lotus Sametime Standard & Advanced, Lotus Quickr, Unified Telephony), Lotus Quickr, OmniFind, Rational SDLC Products. Senior Technical Architect, Smarter Cities, Industry Solutions, Software Group IBM December 2001  – Present (13 years 9 months) Bangalore, India and Herndon, USA • Area Expertise: Project Management, Cyber Security, Information Security, Quality Assurance, Vendor and Package Analysis and Selection, E-business Infrastructure, Personalization Technologies and Architectures, Performance Management/Stress Testing, Content Management, Search Engine Design & Implementation, 3D In-traverse, Web Metrics, WebSphere Portal Architect, Portal Development, Data Network Design & Implementation, and Network & Systems Management. \n• Application Expertise: Active Worlds, WebSphere Portal, WebSphere Application Server, Tivoli Directory Server, Tivoli Identity & Access Manager, Tivoli Network Management and Performance, Lotus Collaborative Products (Lotus Sametime Standard & Advanced, Lotus Quickr, Unified Telephony), Lotus Quickr, OmniFind, Rational SDLC Products. Sr. Software Engineer Strategic Management Group Inc August 1999  –  November 2001  (2 years 4 months) Greater Philadelphia Area IQNet Platform Design & Implementation: \n \n• Design & implementation of three-tier state based Learning Management System (LMS) and Learning Delivery System (LDS), which runs on Windows 2000 platform utilizing the Microsoft Internet Information Server, and consists of Active Server Pages. Management & Participant information are stored in a relational database (SQL Server 7.0). Business logic (Microsoft COM based) keeps track of usage performance, real time usage statistics, controls user navigation & retrieves content based on client. System allows high-level client based content customization (data is stored in a single database). System also contains extensive administration site that allows clients to views user and group statistics, it also allows administrator to set parameters on how the system performs (based on client). \n \nHuthwaite Strategic SPIN®/E-Biz IQNet/Finance IQNet Product Design & Implementation: \n• Development of platform to be used in three distinct products. \n \nSimulation-Centric Learning Solutions Development: \n• Design & implementation of three distinct simulation-centric learning solutions used in teaching and consulting. Products include “Optimizing the Supply Chain” (OSC), “Project Management” (PRM) and “Managing Change” (MCH). Important feature of OSC contain a complex mathematical model simulating the supply chain functionality. Designed & development of the first java-based and web-based implementation of the financial model at SMG. Developed software that translates model designed in PowerSim into java-based code. Developed software enabled us to directly translate complex financial models developed using PowerSim into Java Code (with minimal amount of user manipulation). Provided extensive consultation to other solutions under development as well as writing software to facilitate this development. Software includes system that automatically parses simulation storyboards and automatically populates the database. Sr. Software Engineer Strategic Management Group Inc August 1999  –  November 2001  (2 years 4 months) Greater Philadelphia Area IQNet Platform Design & Implementation: \n \n• Design & implementation of three-tier state based Learning Management System (LMS) and Learning Delivery System (LDS), which runs on Windows 2000 platform utilizing the Microsoft Internet Information Server, and consists of Active Server Pages. Management & Participant information are stored in a relational database (SQL Server 7.0). Business logic (Microsoft COM based) keeps track of usage performance, real time usage statistics, controls user navigation & retrieves content based on client. System allows high-level client based content customization (data is stored in a single database). System also contains extensive administration site that allows clients to views user and group statistics, it also allows administrator to set parameters on how the system performs (based on client). \n \nHuthwaite Strategic SPIN®/E-Biz IQNet/Finance IQNet Product Design & Implementation: \n• Development of platform to be used in three distinct products. \n \nSimulation-Centric Learning Solutions Development: \n• Design & implementation of three distinct simulation-centric learning solutions used in teaching and consulting. Products include “Optimizing the Supply Chain” (OSC), “Project Management” (PRM) and “Managing Change” (MCH). Important feature of OSC contain a complex mathematical model simulating the supply chain functionality. Designed & development of the first java-based and web-based implementation of the financial model at SMG. Developed software that translates model designed in PowerSim into java-based code. Developed software enabled us to directly translate complex financial models developed using PowerSim into Java Code (with minimal amount of user manipulation). Provided extensive consultation to other solutions under development as well as writing software to facilitate this development. Software includes system that automatically parses simulation storyboards and automatically populates the database. Consultant Semcor August 1997  –  August 1999  (2 years 1 month) Warminster, PA Worked on several projects in following areas: \n- Network Design and Implementation. \n- Software Integration/Administration. \n- Web Development and Database Development. \n- Application Development. Consultant Semcor August 1997  –  August 1999  (2 years 1 month) Warminster, PA Worked on several projects in following areas: \n- Network Design and Implementation. \n- Software Integration/Administration. \n- Web Development and Database Development. \n- Application Development. Software Engineer Future Software Private Limited September 1995  –  August 1996  (1 year) Chennai Area, India Worked in the Products group in the areas of data communication and telecommunication. Projects involved were, ATM LAN Emulation (enhancements and testing), Scorpio SNMP Agent (design and implementation), Future SNMP Agent (design and implementation), 2-port Bridge and Inter Process Communication (IPC). Software Engineer Future Software Private Limited September 1995  –  August 1996  (1 year) Chennai Area, India Worked in the Products group in the areas of data communication and telecommunication. Projects involved were, ATM LAN Emulation (enhancements and testing), Scorpio SNMP Agent (design and implementation), Future SNMP Agent (design and implementation), 2-port Bridge and Inter Process Communication (IPC). Languages Hindi Telugu Tamil Hindi Telugu Tamil Hindi Telugu Tamil Skills WebSphere Portal Enterprise Architecture SOA Netcool Solution Architecture Cloud Computing Java Enterprise Edition Websphere IT Strategy Integration Architecture SQL XML DB2 Java Performance Tuning WebSphere Application... Tivoli Directory Server SDLC See 4+     See less Skills  WebSphere Portal Enterprise Architecture SOA Netcool Solution Architecture Cloud Computing Java Enterprise Edition Websphere IT Strategy Integration Architecture SQL XML DB2 Java Performance Tuning WebSphere Application... Tivoli Directory Server SDLC See 4+     See less WebSphere Portal Enterprise Architecture SOA Netcool Solution Architecture Cloud Computing Java Enterprise Edition Websphere IT Strategy Integration Architecture SQL XML DB2 Java Performance Tuning WebSphere Application... Tivoli Directory Server SDLC See 4+     See less WebSphere Portal Enterprise Architecture SOA Netcool Solution Architecture Cloud Computing Java Enterprise Edition Websphere IT Strategy Integration Architecture SQL XML DB2 Java Performance Tuning WebSphere Application... Tivoli Directory Server SDLC See 4+     See less Education Drexel University M.S.,  Computer Networking 1996  – 1998 University of Madras B.E.,  Computer Science and Engineering 1991  – 1995 Drexel University M.S.,  Computer Networking 1996  – 1998 Drexel University M.S.,  Computer Networking 1996  – 1998 Drexel University M.S.,  Computer Networking 1996  – 1998 University of Madras B.E.,  Computer Science and Engineering 1991  – 1995 University of Madras B.E.,  Computer Science and Engineering 1991  – 1995 University of Madras B.E.,  Computer Science and Engineering 1991  – 1995 Honors & Awards Excellence Award IBM December 2013 Two Excellence Awards IBM June 2006 Excellence Award IBM December 2013 Excellence Award IBM December 2013 Excellence Award IBM December 2013 Two Excellence Awards IBM June 2006 Two Excellence Awards IBM June 2006 Two Excellence Awards IBM June 2006 "]}