{"position": "Senior Finance Manager", "company": "Intel Corporation", "profiles": ["Experience General Manager Asia Veritiv July 2014  – Present (1 year 2 months) Sr. Director of Business Development Unisource Global Solutions December 2013  –  June 2014  (7 months) Director of Asia Operations Unisource Global Solutions March 2011  –  November 2013  (2 years 9 months) Senior Finance Manager Intel Corporation April 2010  –  March 2011  (1 year) beijing Senior Finance Manager Intel Corporation April 2008  –  April 2010  (2 years 1 month) shanghai Finance Manager Intel Corporation July 2006  –  April 2008  (1 year 10 months) General Manager Asia Veritiv July 2014  – Present (1 year 2 months) General Manager Asia Veritiv July 2014  – Present (1 year 2 months) Sr. Director of Business Development Unisource Global Solutions December 2013  –  June 2014  (7 months) Sr. Director of Business Development Unisource Global Solutions December 2013  –  June 2014  (7 months) Director of Asia Operations Unisource Global Solutions March 2011  –  November 2013  (2 years 9 months) Director of Asia Operations Unisource Global Solutions March 2011  –  November 2013  (2 years 9 months) Senior Finance Manager Intel Corporation April 2010  –  March 2011  (1 year) beijing Senior Finance Manager Intel Corporation April 2010  –  March 2011  (1 year) beijing Senior Finance Manager Intel Corporation April 2008  –  April 2010  (2 years 1 month) shanghai Senior Finance Manager Intel Corporation April 2008  –  April 2010  (2 years 1 month) shanghai Finance Manager Intel Corporation July 2006  –  April 2008  (1 year 10 months) Finance Manager Intel Corporation July 2006  –  April 2008  (1 year 10 months) Education UCLA Anderson School of Management Master of Business Administration (M.B.A.),  Business Administration and Management , General 2004  – 2006 UNSW Australia Master of Engineering (M.Eng.),  Computer Engineering 1998  – 1999 Tongji University Bachelor of Science (B.Sc.),  Computer Science 1994  – 1998 UCLA Anderson School of Management Master of Business Administration (M.B.A.),  Business Administration and Management , General 2004  – 2006 UCLA Anderson School of Management Master of Business Administration (M.B.A.),  Business Administration and Management , General 2004  – 2006 UCLA Anderson School of Management Master of Business Administration (M.B.A.),  Business Administration and Management , General 2004  – 2006 UNSW Australia Master of Engineering (M.Eng.),  Computer Engineering 1998  – 1999 UNSW Australia Master of Engineering (M.Eng.),  Computer Engineering 1998  – 1999 UNSW Australia Master of Engineering (M.Eng.),  Computer Engineering 1998  – 1999 Tongji University Bachelor of Science (B.Sc.),  Computer Science 1994  – 1998 Tongji University Bachelor of Science (B.Sc.),  Computer Science 1994  – 1998 Tongji University Bachelor of Science (B.Sc.),  Computer Science 1994  – 1998 ", "Experience Senior Finance Manager Intel Corporation March 2012  – Present (3 years 6 months) -Responsible for driving Leadership Graphics & Imaging IP in Smart Phones and Tablets.  \n-Ensures Intel delivers leadership performance, for 3D Graphics, Media, & Imaging IP blocks within an affordable RnD budget  \n-Partners with VPG/ICG engineers to define and deliver max ROI Smartphone/Tablet Graphics & Imaging IP Roadmap \n-Responsible for all aspects of the Low Power Graphics & Imaging Roadmap including product definition, feature tradeoffs, cost targets, & process technology definitions \n-Drives Optimal die strategy and leads cost reduction efforts  \n-Responsible for driving all Low Power Graphics and Imaging related Mergers & Acquisition activity. Including financial analysis and strategic impact of the acquisition. \n-Responsible for financial assessments of Gfx & Imaging competitiveness vs. Apple, Qualcomm, Nvidia, AMD, & Mediatek FP&A Manager Intel Corporation March 2010  –  April 2012  (2 years 2 months) Responsible for all Budgetary & Capital Spending Planning Process & Close activities for the Chipset Business. Managed 3 direct reports and 2 dotted line reports in different geographies. Sr. Finance Analyst Intel Corporation September 2005  –  March 2010  (4 years 7 months) Pricing & Supply Chain analysis for key US customers. Sr. Accountant Citi July 2001  –  August 2004  (3 years 2 months) Sacramento, California Area Senior Finance Manager Intel Corporation March 2012  – Present (3 years 6 months) -Responsible for driving Leadership Graphics & Imaging IP in Smart Phones and Tablets.  \n-Ensures Intel delivers leadership performance, for 3D Graphics, Media, & Imaging IP blocks within an affordable RnD budget  \n-Partners with VPG/ICG engineers to define and deliver max ROI Smartphone/Tablet Graphics & Imaging IP Roadmap \n-Responsible for all aspects of the Low Power Graphics & Imaging Roadmap including product definition, feature tradeoffs, cost targets, & process technology definitions \n-Drives Optimal die strategy and leads cost reduction efforts  \n-Responsible for driving all Low Power Graphics and Imaging related Mergers & Acquisition activity. Including financial analysis and strategic impact of the acquisition. \n-Responsible for financial assessments of Gfx & Imaging competitiveness vs. Apple, Qualcomm, Nvidia, AMD, & Mediatek Senior Finance Manager Intel Corporation March 2012  – Present (3 years 6 months) -Responsible for driving Leadership Graphics & Imaging IP in Smart Phones and Tablets.  \n-Ensures Intel delivers leadership performance, for 3D Graphics, Media, & Imaging IP blocks within an affordable RnD budget  \n-Partners with VPG/ICG engineers to define and deliver max ROI Smartphone/Tablet Graphics & Imaging IP Roadmap \n-Responsible for all aspects of the Low Power Graphics & Imaging Roadmap including product definition, feature tradeoffs, cost targets, & process technology definitions \n-Drives Optimal die strategy and leads cost reduction efforts  \n-Responsible for driving all Low Power Graphics and Imaging related Mergers & Acquisition activity. Including financial analysis and strategic impact of the acquisition. \n-Responsible for financial assessments of Gfx & Imaging competitiveness vs. Apple, Qualcomm, Nvidia, AMD, & Mediatek FP&A Manager Intel Corporation March 2010  –  April 2012  (2 years 2 months) Responsible for all Budgetary & Capital Spending Planning Process & Close activities for the Chipset Business. Managed 3 direct reports and 2 dotted line reports in different geographies. FP&A Manager Intel Corporation March 2010  –  April 2012  (2 years 2 months) Responsible for all Budgetary & Capital Spending Planning Process & Close activities for the Chipset Business. Managed 3 direct reports and 2 dotted line reports in different geographies. Sr. Finance Analyst Intel Corporation September 2005  –  March 2010  (4 years 7 months) Pricing & Supply Chain analysis for key US customers. Sr. Finance Analyst Intel Corporation September 2005  –  March 2010  (4 years 7 months) Pricing & Supply Chain analysis for key US customers. Sr. Accountant Citi July 2001  –  August 2004  (3 years 2 months) Sacramento, California Area Sr. Accountant Citi July 2001  –  August 2004  (3 years 2 months) Sacramento, California Area Skills Budgets Finance Supply Chain Pricing Financial Modeling Financial Analysis Forecasting Sarbanes-Oxley Act Financial Reporting Variance Analysis Essbase Financial Forecasting Corporate Finance Hyperion Managerial Finance Skills  Budgets Finance Supply Chain Pricing Financial Modeling Financial Analysis Forecasting Sarbanes-Oxley Act Financial Reporting Variance Analysis Essbase Financial Forecasting Corporate Finance Hyperion Managerial Finance Budgets Finance Supply Chain Pricing Financial Modeling Financial Analysis Forecasting Sarbanes-Oxley Act Financial Reporting Variance Analysis Essbase Financial Forecasting Corporate Finance Hyperion Managerial Finance Budgets Finance Supply Chain Pricing Financial Modeling Financial Analysis Forecasting Sarbanes-Oxley Act Financial Reporting Variance Analysis Essbase Financial Forecasting Corporate Finance Hyperion Managerial Finance Education California State University-Sacramento Master of Business Administration (MBA),  Accounting and Finance 2003  – 2005 Morgan State University Bachelor's degree,  Finance , General 1997  – 2001 California State University-Sacramento Master of Business Administration (MBA),  Accounting and Finance 2003  – 2005 California State University-Sacramento Master of Business Administration (MBA),  Accounting and Finance 2003  – 2005 California State University-Sacramento Master of Business Administration (MBA),  Accounting and Finance 2003  – 2005 Morgan State University Bachelor's degree,  Finance , General 1997  – 2001 Morgan State University Bachelor's degree,  Finance , General 1997  – 2001 Morgan State University Bachelor's degree,  Finance , General 1997  – 2001 ", "Experience Senior Finance Manager, Worldwide Revenue Intel Corporation February 2010  – Present (5 years 7 months) Responsible for forecasting and reporting Intel's revenue, ensuring compliance to all corporate and legal reporting requirements, and defining and maintaining worldwide revenue reporting systems and processes. Directly manage a staff of 6 senior finance analysts. Finance Specialist, Worldwide Consumer Sales Organization Intel Corporation April 2009  –  February 2010  (11 months) WW Consumer Sales Organization (CSO) was newly created in 2009. Primary finance business partner for the GM of CSO. Influence strategy and annual investment planning to drive the highest ROI. Establish common processes across a matrixed finance organization worldwide. Finance Business Manager, EMEA Sales and Marketing Group Intel July 2007  –  March 2009  (1 year 9 months) Primary finance business partner for EMEA Multi National Corporation sales ($8.1B in revenue and $250M in expenses) and European Union Region sales ($8.3B in revenue and $750M in expenses), influence strategic direction and key tactical decisions to improve profitability. Corportate Planning Team Lead, Corp Planning and Reporting Intel January 2005  –  July 2007  (2 years 7 months) Manage Intel’s forecasting processes across all of Operations finance by leading a team of 8 analysts, setting direction for every division, and leading the preparation of the corporate package presented to the CEO. Support senior finance management in preparing presentations to the Board of Directors and executives. Analyze Intel’s income statement and present findings to the CFO, which drives Intel’s outlook to Wall Street. Senior Finance Analyst, Materials Intel February 2003  –  January 2005  (2 years) Influence the development of financially optimal supplier negotiation strategies through cost modeling and benchmarking for $405M in annual spends. Identify cash savings projects and influence inventory strategy. Supervise an analyst responsible for External Memory close and controls activities. Budgets and Planning Analyst, Design Technology Intel July 2001  –  February 2003  (1 year 8 months) Lead forecasting and close activities for Design Technology. Influence finance and operations across most divisions and manage the forecasting and optimization of a $120M external software pool. Senior Finance Manager, Worldwide Revenue Intel Corporation February 2010  – Present (5 years 7 months) Responsible for forecasting and reporting Intel's revenue, ensuring compliance to all corporate and legal reporting requirements, and defining and maintaining worldwide revenue reporting systems and processes. Directly manage a staff of 6 senior finance analysts. Senior Finance Manager, Worldwide Revenue Intel Corporation February 2010  – Present (5 years 7 months) Responsible for forecasting and reporting Intel's revenue, ensuring compliance to all corporate and legal reporting requirements, and defining and maintaining worldwide revenue reporting systems and processes. Directly manage a staff of 6 senior finance analysts. Finance Specialist, Worldwide Consumer Sales Organization Intel Corporation April 2009  –  February 2010  (11 months) WW Consumer Sales Organization (CSO) was newly created in 2009. Primary finance business partner for the GM of CSO. Influence strategy and annual investment planning to drive the highest ROI. Establish common processes across a matrixed finance organization worldwide. Finance Specialist, Worldwide Consumer Sales Organization Intel Corporation April 2009  –  February 2010  (11 months) WW Consumer Sales Organization (CSO) was newly created in 2009. Primary finance business partner for the GM of CSO. Influence strategy and annual investment planning to drive the highest ROI. Establish common processes across a matrixed finance organization worldwide. Finance Business Manager, EMEA Sales and Marketing Group Intel July 2007  –  March 2009  (1 year 9 months) Primary finance business partner for EMEA Multi National Corporation sales ($8.1B in revenue and $250M in expenses) and European Union Region sales ($8.3B in revenue and $750M in expenses), influence strategic direction and key tactical decisions to improve profitability. Finance Business Manager, EMEA Sales and Marketing Group Intel July 2007  –  March 2009  (1 year 9 months) Primary finance business partner for EMEA Multi National Corporation sales ($8.1B in revenue and $250M in expenses) and European Union Region sales ($8.3B in revenue and $750M in expenses), influence strategic direction and key tactical decisions to improve profitability. Corportate Planning Team Lead, Corp Planning and Reporting Intel January 2005  –  July 2007  (2 years 7 months) Manage Intel’s forecasting processes across all of Operations finance by leading a team of 8 analysts, setting direction for every division, and leading the preparation of the corporate package presented to the CEO. Support senior finance management in preparing presentations to the Board of Directors and executives. Analyze Intel’s income statement and present findings to the CFO, which drives Intel’s outlook to Wall Street. Corportate Planning Team Lead, Corp Planning and Reporting Intel January 2005  –  July 2007  (2 years 7 months) Manage Intel’s forecasting processes across all of Operations finance by leading a team of 8 analysts, setting direction for every division, and leading the preparation of the corporate package presented to the CEO. Support senior finance management in preparing presentations to the Board of Directors and executives. Analyze Intel’s income statement and present findings to the CFO, which drives Intel’s outlook to Wall Street. Senior Finance Analyst, Materials Intel February 2003  –  January 2005  (2 years) Influence the development of financially optimal supplier negotiation strategies through cost modeling and benchmarking for $405M in annual spends. Identify cash savings projects and influence inventory strategy. Supervise an analyst responsible for External Memory close and controls activities. Senior Finance Analyst, Materials Intel February 2003  –  January 2005  (2 years) Influence the development of financially optimal supplier negotiation strategies through cost modeling and benchmarking for $405M in annual spends. Identify cash savings projects and influence inventory strategy. Supervise an analyst responsible for External Memory close and controls activities. Budgets and Planning Analyst, Design Technology Intel July 2001  –  February 2003  (1 year 8 months) Lead forecasting and close activities for Design Technology. Influence finance and operations across most divisions and manage the forecasting and optimization of a $120M external software pool. Budgets and Planning Analyst, Design Technology Intel July 2001  –  February 2003  (1 year 8 months) Lead forecasting and close activities for Design Technology. Influence finance and operations across most divisions and manage the forecasting and optimization of a $120M external software pool. Education University of California, Berkeley MBA 2010  – 2013 University of Southern California BS,  Business Administration 1996  – 2001 Waseda University 1999  – 2000 University of California, Berkeley MBA 2010  – 2013 University of California, Berkeley MBA 2010  – 2013 University of California, Berkeley MBA 2010  – 2013 University of Southern California BS,  Business Administration 1996  – 2001 University of Southern California BS,  Business Administration 1996  – 2001 University of Southern California BS,  Business Administration 1996  – 2001 Waseda University 1999  – 2000 Waseda University 1999  – 2000 Waseda University 1999  – 2000 ", "Languages English English English Skills Financial Analysis Sarbanes-Oxley Act Variance Analysis Strategy Forecasting Cost Accounting Process Improvement Team Building Internal Controls Budgets Analysis Benchmarking Financial Modeling Pricing Return on Investment Financial Forecasting Corporate Finance Organizational Design Cross-functional Team... Business Strategy Manufacturing Accounting Auditing Business Analysis Finance See 10+     See less Skills  Financial Analysis Sarbanes-Oxley Act Variance Analysis Strategy Forecasting Cost Accounting Process Improvement Team Building Internal Controls Budgets Analysis Benchmarking Financial Modeling Pricing Return on Investment Financial Forecasting Corporate Finance Organizational Design Cross-functional Team... Business Strategy Manufacturing Accounting Auditing Business Analysis Finance See 10+     See less Financial Analysis Sarbanes-Oxley Act Variance Analysis Strategy Forecasting Cost Accounting Process Improvement Team Building Internal Controls Budgets Analysis Benchmarking Financial Modeling Pricing Return on Investment Financial Forecasting Corporate Finance Organizational Design Cross-functional Team... Business Strategy Manufacturing Accounting Auditing Business Analysis Finance See 10+     See less Financial Analysis Sarbanes-Oxley Act Variance Analysis Strategy Forecasting Cost Accounting Process Improvement Team Building Internal Controls Budgets Analysis Benchmarking Financial Modeling Pricing Return on Investment Financial Forecasting Corporate Finance Organizational Design Cross-functional Team... Business Strategy Manufacturing Accounting Auditing Business Analysis Finance See 10+     See less ", "Skills Financial Analysis Financial Modeling Financial Reporting Strategic Financial... Variance Analysis Process Improvement Corporate Finance Finance Analytics Business Development Competitive Analysis Forecasting Cross-functional Team... Start-ups Managerial Finance Business Strategy Management Strategy Financial Forecasting Sarbanes-Oxley Act Analysis Valuation Cost Accounting Accounting Due Diligence Mergers & Acquisitions Essbase Internal Controls Business Planning Business Process... Risk Management Pricing Business Analysis SAP Budgets Capital Budgeting Portfolio Management NPV Financial Accounting See 24+     See less Skills  Financial Analysis Financial Modeling Financial Reporting Strategic Financial... Variance Analysis Process Improvement Corporate Finance Finance Analytics Business Development Competitive Analysis Forecasting Cross-functional Team... Start-ups Managerial Finance Business Strategy Management Strategy Financial Forecasting Sarbanes-Oxley Act Analysis Valuation Cost Accounting Accounting Due Diligence Mergers & Acquisitions Essbase Internal Controls Business Planning Business Process... Risk Management Pricing Business Analysis SAP Budgets Capital Budgeting Portfolio Management NPV Financial Accounting See 24+     See less Financial Analysis Financial Modeling Financial Reporting Strategic Financial... Variance Analysis Process Improvement Corporate Finance Finance Analytics Business Development Competitive Analysis Forecasting Cross-functional Team... Start-ups Managerial Finance Business Strategy Management Strategy Financial Forecasting Sarbanes-Oxley Act Analysis Valuation Cost Accounting Accounting Due Diligence Mergers & Acquisitions Essbase Internal Controls Business Planning Business Process... Risk Management Pricing Business Analysis SAP Budgets Capital Budgeting Portfolio Management NPV Financial Accounting See 24+     See less Financial Analysis Financial Modeling Financial Reporting Strategic Financial... Variance Analysis Process Improvement Corporate Finance Finance Analytics Business Development Competitive Analysis Forecasting Cross-functional Team... Start-ups Managerial Finance Business Strategy Management Strategy Financial Forecasting Sarbanes-Oxley Act Analysis Valuation Cost Accounting Accounting Due Diligence Mergers & Acquisitions Essbase Internal Controls Business Planning Business Process... Risk Management Pricing Business Analysis SAP Budgets Capital Budgeting Portfolio Management NPV Financial Accounting See 24+     See less ", "Languages Telugu Telugu Telugu Skills Financial Modeling Financial Analysis Forecasting Cross-functional Team... Strategic Financial... Corporate Finance Financial Reporting Variance Analysis Finance Process Improvement Business Strategy Strategy Business Analysis Management Analysis Skills  Financial Modeling Financial Analysis Forecasting Cross-functional Team... Strategic Financial... Corporate Finance Financial Reporting Variance Analysis Finance Process Improvement Business Strategy Strategy Business Analysis Management Analysis Financial Modeling Financial Analysis Forecasting Cross-functional Team... Strategic Financial... Corporate Finance Financial Reporting Variance Analysis Finance Process Improvement Business Strategy Strategy Business Analysis Management Analysis Financial Modeling Financial Analysis Forecasting Cross-functional Team... Strategic Financial... Corporate Finance Financial Reporting Variance Analysis Finance Process Improvement Business Strategy Strategy Business Analysis Management Analysis ", "Summary Thirteen years of Finance experience spanning product line marketing, R&D, manufacturing, and Corporate organizations. Substantial experience in creating complex financial models, managing teams, executing forecasting/reporting cycles, and presenting at VP/GM level. Summary Thirteen years of Finance experience spanning product line marketing, R&D, manufacturing, and Corporate organizations. Substantial experience in creating complex financial models, managing teams, executing forecasting/reporting cycles, and presenting at VP/GM level. Thirteen years of Finance experience spanning product line marketing, R&D, manufacturing, and Corporate organizations. Substantial experience in creating complex financial models, managing teams, executing forecasting/reporting cycles, and presenting at VP/GM level. Thirteen years of Finance experience spanning product line marketing, R&D, manufacturing, and Corporate organizations. Substantial experience in creating complex financial models, managing teams, executing forecasting/reporting cycles, and presenting at VP/GM level. Skills Financial Modeling Semiconductors Finance Forecasting Corporate Finance Strategy Skills  Financial Modeling Semiconductors Finance Forecasting Corporate Finance Strategy Financial Modeling Semiconductors Finance Forecasting Corporate Finance Strategy Financial Modeling Semiconductors Finance Forecasting Corporate Finance Strategy Education University of California, Berkeley, Haas School of Business Masters in Business Administration 2004  – 2007 University of Pennsylvania Bachelor of Arts 1996  – 2000 University of California, Berkeley, Haas School of Business Masters in Business Administration 2004  – 2007 University of California, Berkeley, Haas School of Business Masters in Business Administration 2004  – 2007 University of California, Berkeley, Haas School of Business Masters in Business Administration 2004  – 2007 University of Pennsylvania Bachelor of Arts 1996  – 2000 University of Pennsylvania Bachelor of Arts 1996  – 2000 University of Pennsylvania Bachelor of Arts 1996  – 2000 ", "Languages Burmese Burmese Burmese Skills Revenue Recognition Financial Goals Supply Chain Management SOX 404 Financial Modeling Financial Analysis Forecasting Financial Forecasting Sarbanes-Oxley Act Financial Reporting Cross-functional Team... Competitive Analysis Finance Management Risk Assessment Accounting Financial Statements Capital Budgeting Strategy Mergers & Acquisitions Program Management Business Analysis Budgets SAP Data Analysis Variance Analysis Analysis Auditing Essbase Sarbanes-Oxley Internal Audit Managerial Finance Business Process... Leadership Corporate Finance Internal Controls Strategic Financial... Pricing Start-ups Process Improvement US GAAP Financial Accounting See 27+     See less Skills  Revenue Recognition Financial Goals Supply Chain Management SOX 404 Financial Modeling Financial Analysis Forecasting Financial Forecasting Sarbanes-Oxley Act Financial Reporting Cross-functional Team... Competitive Analysis Finance Management Risk Assessment Accounting Financial Statements Capital Budgeting Strategy Mergers & Acquisitions Program Management Business Analysis Budgets SAP Data Analysis Variance Analysis Analysis Auditing Essbase Sarbanes-Oxley Internal Audit Managerial Finance Business Process... Leadership Corporate Finance Internal Controls Strategic Financial... Pricing Start-ups Process Improvement US GAAP Financial Accounting See 27+     See less Revenue Recognition Financial Goals Supply Chain Management SOX 404 Financial Modeling Financial Analysis Forecasting Financial Forecasting Sarbanes-Oxley Act Financial Reporting Cross-functional Team... Competitive Analysis Finance Management Risk Assessment Accounting Financial Statements Capital Budgeting Strategy Mergers & Acquisitions Program Management Business Analysis Budgets SAP Data Analysis Variance Analysis Analysis Auditing Essbase Sarbanes-Oxley Internal Audit Managerial Finance Business Process... Leadership Corporate Finance Internal Controls Strategic Financial... Pricing Start-ups Process Improvement US GAAP Financial Accounting See 27+     See less Revenue Recognition Financial Goals Supply Chain Management SOX 404 Financial Modeling Financial Analysis Forecasting Financial Forecasting Sarbanes-Oxley Act Financial Reporting Cross-functional Team... Competitive Analysis Finance Management Risk Assessment Accounting Financial Statements Capital Budgeting Strategy Mergers & Acquisitions Program Management Business Analysis Budgets SAP Data Analysis Variance Analysis Analysis Auditing Essbase Sarbanes-Oxley Internal Audit Managerial Finance Business Process... Leadership Corporate Finance Internal Controls Strategic Financial... Pricing Start-ups Process Improvement US GAAP Financial Accounting See 27+     See less ", "Skills Asset Management CRM Change Management Corporate Real Estate Cross-functional Team... Facilities Management Leadership Financial Analysis Multi-Site Operations Operations Management Strategic Planning Project Management Skills  Asset Management CRM Change Management Corporate Real Estate Cross-functional Team... Facilities Management Leadership Financial Analysis Multi-Site Operations Operations Management Strategic Planning Project Management Asset Management CRM Change Management Corporate Real Estate Cross-functional Team... Facilities Management Leadership Financial Analysis Multi-Site Operations Operations Management Strategic Planning Project Management Asset Management CRM Change Management Corporate Real Estate Cross-functional Team... Facilities Management Leadership Financial Analysis Multi-Site Operations Operations Management Strategic Planning Project Management Honors & Awards ", "Skills Project Planning Financial Analysis Finance Budgets Cross-functional Team... Management Financial Risk Competitive Analysis Financial Modeling Strategic Partnerships Process Improvement Project Management Analysis Semiconductors Managerial Finance Capital Budgeting Team Building See 2+     See less Skills  Project Planning Financial Analysis Finance Budgets Cross-functional Team... Management Financial Risk Competitive Analysis Financial Modeling Strategic Partnerships Process Improvement Project Management Analysis Semiconductors Managerial Finance Capital Budgeting Team Building See 2+     See less Project Planning Financial Analysis Finance Budgets Cross-functional Team... Management Financial Risk Competitive Analysis Financial Modeling Strategic Partnerships Process Improvement Project Management Analysis Semiconductors Managerial Finance Capital Budgeting Team Building See 2+     See less Project Planning Financial Analysis Finance Budgets Cross-functional Team... Management Financial Risk Competitive Analysis Financial Modeling Strategic Partnerships Process Improvement Project Management Analysis Semiconductors Managerial Finance Capital Budgeting Team Building See 2+     See less ", "Experience Senior Finance Manager Intel Corporation July 2013  – Present (2 years 2 months) Folsom, CA Finance Manager Intel Corporation January 2011  –  July 2013  (2 years 7 months) Folsom, CA Audit Area Manager Intel Corporation January 2005  –  December 2010  (6 years) Santa Clara, California Product and Business Strategy Analyst Ford Motor Company January 1999  –  June 2001  (2 years 6 months) Product Design engineer Ford Motor Company January 1993  –  January 1999  (6 years 1 month) Senior Finance Manager Intel Corporation July 2013  – Present (2 years 2 months) Folsom, CA Senior Finance Manager Intel Corporation July 2013  – Present (2 years 2 months) Folsom, CA Finance Manager Intel Corporation January 2011  –  July 2013  (2 years 7 months) Folsom, CA Finance Manager Intel Corporation January 2011  –  July 2013  (2 years 7 months) Folsom, CA Audit Area Manager Intel Corporation January 2005  –  December 2010  (6 years) Santa Clara, California Audit Area Manager Intel Corporation January 2005  –  December 2010  (6 years) Santa Clara, California Product and Business Strategy Analyst Ford Motor Company January 1999  –  June 2001  (2 years 6 months) Product and Business Strategy Analyst Ford Motor Company January 1999  –  June 2001  (2 years 6 months) Product Design engineer Ford Motor Company January 1993  –  January 1999  (6 years 1 month) Product Design engineer Ford Motor Company January 1993  –  January 1999  (6 years 1 month) Languages English Native or bilingual proficiency Urdu Native or bilingual proficiency Arabic Elementary proficiency English Native or bilingual proficiency Urdu Native or bilingual proficiency Arabic Elementary proficiency English Native or bilingual proficiency Urdu Native or bilingual proficiency Arabic Elementary proficiency Native or bilingual proficiency Native or bilingual proficiency Elementary proficiency Skills Start-ups Competitive Analysis Strategy Financial Analysis Product Development Product Management Process Improvement Cross-functional Team... Strategic Planning Product Marketing Forecasting Continuous Improvement Business Strategy Go-to-market Strategy Analysis Six Sigma Negotiation Manufacturing Business Analysis Program Management Project Management Strategic Partnerships Business Process... Financial Modeling Management Project Planning New Business Development Business Planning Leadership Team Management See 15+     See less Skills  Start-ups Competitive Analysis Strategy Financial Analysis Product Development Product Management Process Improvement Cross-functional Team... Strategic Planning Product Marketing Forecasting Continuous Improvement Business Strategy Go-to-market Strategy Analysis Six Sigma Negotiation Manufacturing Business Analysis Program Management Project Management Strategic Partnerships Business Process... Financial Modeling Management Project Planning New Business Development Business Planning Leadership Team Management See 15+     See less Start-ups Competitive Analysis Strategy Financial Analysis Product Development Product Management Process Improvement Cross-functional Team... Strategic Planning Product Marketing Forecasting Continuous Improvement Business Strategy Go-to-market Strategy Analysis Six Sigma Negotiation Manufacturing Business Analysis Program Management Project Management Strategic Partnerships Business Process... Financial Modeling Management Project Planning New Business Development Business Planning Leadership Team Management See 15+     See less Start-ups Competitive Analysis Strategy Financial Analysis Product Development Product Management Process Improvement Cross-functional Team... Strategic Planning Product Marketing Forecasting Continuous Improvement Business Strategy Go-to-market Strategy Analysis Six Sigma Negotiation Manufacturing Business Analysis Program Management Project Management Strategic Partnerships Business Process... Financial Modeling Management Project Planning New Business Development Business Planning Leadership Team Management See 15+     See less Education University of Michigan - Stephen M. Ross School of Business MBA,  Business Strategy and Finance 1998  – 2001 Wayne State University MSME,  Mechanical Engineering 1990  – 1992 Activities and Societies:  President Pakistan Student Association\nAdvisor to Internation Student Office University of Michigan - Stephen M. Ross School of Business MBA,  Business Strategy and Finance 1998  – 2001 University of Michigan - Stephen M. Ross School of Business MBA,  Business Strategy and Finance 1998  – 2001 University of Michigan - Stephen M. Ross School of Business MBA,  Business Strategy and Finance 1998  – 2001 Wayne State University MSME,  Mechanical Engineering 1990  – 1992 Activities and Societies:  President Pakistan Student Association\nAdvisor to Internation Student Office Wayne State University MSME,  Mechanical Engineering 1990  – 1992 Activities and Societies:  President Pakistan Student Association\nAdvisor to Internation Student Office Wayne State University MSME,  Mechanical Engineering 1990  – 1992 Activities and Societies:  President Pakistan Student Association\nAdvisor to Internation Student Office ", "Summary Finance Leader with experience in directing FP&A function for Hardware and Software Businesses. Demonstrated strength in financial modeling, financial analysis and problem solving skills. Proven strength in partnering with Senior Executives to drive business results and experienced in managing and developing world class finance professionals. Summary Finance Leader with experience in directing FP&A function for Hardware and Software Businesses. Demonstrated strength in financial modeling, financial analysis and problem solving skills. Proven strength in partnering with Senior Executives to drive business results and experienced in managing and developing world class finance professionals. Finance Leader with experience in directing FP&A function for Hardware and Software Businesses. Demonstrated strength in financial modeling, financial analysis and problem solving skills. Proven strength in partnering with Senior Executives to drive business results and experienced in managing and developing world class finance professionals. Finance Leader with experience in directing FP&A function for Hardware and Software Businesses. Demonstrated strength in financial modeling, financial analysis and problem solving skills. Proven strength in partnering with Senior Executives to drive business results and experienced in managing and developing world class finance professionals. Experience Director Financial Planning and Analysis AppliedMicro June 2015  – Present (3 months) Director Financial Planning and Analysis AppliedMicro June 2015  – Present (3 months) Director Financial Planning and Analysis AppliedMicro June 2015  – Present (3 months) Skills Management Cross-functional Team... Financial Analysis Pricing Budgets Finance Financial Modeling Forecasting Mergers & Acquisitions Strategic Financial... Analysis Business Strategy Semiconductors Process Improvement Strategic Planning Leadership Mobile Devices Budgeting Financial Planning See 4+     See less Skills  Management Cross-functional Team... Financial Analysis Pricing Budgets Finance Financial Modeling Forecasting Mergers & Acquisitions Strategic Financial... Analysis Business Strategy Semiconductors Process Improvement Strategic Planning Leadership Mobile Devices Budgeting Financial Planning See 4+     See less Management Cross-functional Team... Financial Analysis Pricing Budgets Finance Financial Modeling Forecasting Mergers & Acquisitions Strategic Financial... Analysis Business Strategy Semiconductors Process Improvement Strategic Planning Leadership Mobile Devices Budgeting Financial Planning See 4+     See less Management Cross-functional Team... Financial Analysis Pricing Budgets Finance Financial Modeling Forecasting Mergers & Acquisitions Strategic Financial... Analysis Business Strategy Semiconductors Process Improvement Strategic Planning Leadership Mobile Devices Budgeting Financial Planning See 4+     See less ", "Skills Finance Mergers & Acquisitions Strategy Analysis Financial Modeling Cloud Computing Skills  Finance Mergers & Acquisitions Strategy Analysis Financial Modeling Cloud Computing Finance Mergers & Acquisitions Strategy Analysis Financial Modeling Cloud Computing Finance Mergers & Acquisitions Strategy Analysis Financial Modeling Cloud Computing ", "Summary More than 18 years’ professional experience starting out in Audit and Accounting and majority of the time in Corporate Finance of Multinational companies and international working experience in the US, UK, Malaysia and Singapore. Excellent management, strategic, analytical, project management and customer relationship management skills. PC proficiency with Microsoft Office and specialized accounting and financial analysis/reporting software Summary More than 18 years’ professional experience starting out in Audit and Accounting and majority of the time in Corporate Finance of Multinational companies and international working experience in the US, UK, Malaysia and Singapore. Excellent management, strategic, analytical, project management and customer relationship management skills. PC proficiency with Microsoft Office and specialized accounting and financial analysis/reporting software More than 18 years’ professional experience starting out in Audit and Accounting and majority of the time in Corporate Finance of Multinational companies and international working experience in the US, UK, Malaysia and Singapore. Excellent management, strategic, analytical, project management and customer relationship management skills. PC proficiency with Microsoft Office and specialized accounting and financial analysis/reporting software More than 18 years’ professional experience starting out in Audit and Accounting and majority of the time in Corporate Finance of Multinational companies and international working experience in the US, UK, Malaysia and Singapore. Excellent management, strategic, analytical, project management and customer relationship management skills. PC proficiency with Microsoft Office and specialized accounting and financial analysis/reporting software Experience Assembly Test Factory Senior Finance Manager Intel Corporation March 2015  – Present (6 months) Penang, Malaysia Automated Test Equipment Factory - Senior Finance Manager Intel Corporation December 2010  –  February 2015  (4 years 3 months) Kulim, Malaysia Strategic Capacity Planning Finance Intel Corporation November 2008  –  December 2010  (2 years 2 months) United States Senior Finance Analyst Intel Corp (UK) Ltd August 2005  –  December 2006  (1 year 5 months) Swindon, United Kingdom Senior Finance Analyst HCL Hewlett Packard March 2004  –  August 2005  (1 year 6 months) Singapore Assembly Test Factory Senior Finance Manager Intel Corporation March 2015  – Present (6 months) Penang, Malaysia Assembly Test Factory Senior Finance Manager Intel Corporation March 2015  – Present (6 months) Penang, Malaysia Automated Test Equipment Factory - Senior Finance Manager Intel Corporation December 2010  –  February 2015  (4 years 3 months) Kulim, Malaysia Automated Test Equipment Factory - Senior Finance Manager Intel Corporation December 2010  –  February 2015  (4 years 3 months) Kulim, Malaysia Strategic Capacity Planning Finance Intel Corporation November 2008  –  December 2010  (2 years 2 months) United States Strategic Capacity Planning Finance Intel Corporation November 2008  –  December 2010  (2 years 2 months) United States Senior Finance Analyst Intel Corp (UK) Ltd August 2005  –  December 2006  (1 year 5 months) Swindon, United Kingdom Senior Finance Analyst Intel Corp (UK) Ltd August 2005  –  December 2006  (1 year 5 months) Swindon, United Kingdom Senior Finance Analyst HCL Hewlett Packard March 2004  –  August 2005  (1 year 6 months) Singapore Senior Finance Analyst HCL Hewlett Packard March 2004  –  August 2005  (1 year 6 months) Singapore Skills Financial Analysis Risk Management Cross-functional Team... Strategy Financial Modeling Valuation Make vs Buy Setting up new... Business Process... Competitive Analysis Forecasting Finance Project Management Start-ups Corporate Finance Process Improvement See 1+     See less Skills  Financial Analysis Risk Management Cross-functional Team... Strategy Financial Modeling Valuation Make vs Buy Setting up new... Business Process... Competitive Analysis Forecasting Finance Project Management Start-ups Corporate Finance Process Improvement See 1+     See less Financial Analysis Risk Management Cross-functional Team... Strategy Financial Modeling Valuation Make vs Buy Setting up new... Business Process... Competitive Analysis Forecasting Finance Project Management Start-ups Corporate Finance Process Improvement See 1+     See less Financial Analysis Risk Management Cross-functional Team... Strategy Financial Modeling Valuation Make vs Buy Setting up new... Business Process... Competitive Analysis Forecasting Finance Project Management Start-ups Corporate Finance Process Improvement See 1+     See less Education Systematic Business School ACCA,  Accounting and Finance Systematic Business School ACCA,  Accounting and Finance Systematic Business School ACCA,  Accounting and Finance Systematic Business School ACCA,  Accounting and Finance ", "Languages Vietnamese English Native or bilingual proficiency Vietnamese English Native or bilingual proficiency Vietnamese English Native or bilingual proficiency Native or bilingual proficiency Skills Financial Modeling Competitive Analysis Forecasting Mergers & Acquisitions Venture Capital Cross-functional Team... Financial Analysis Strategy Due Diligence Corporate Finance Start-ups Valuation Business Strategy Corporate Development Finance Product Management Analysis Private Equity Acquisition Integration See 4+     See less Skills  Financial Modeling Competitive Analysis Forecasting Mergers & Acquisitions Venture Capital Cross-functional Team... Financial Analysis Strategy Due Diligence Corporate Finance Start-ups Valuation Business Strategy Corporate Development Finance Product Management Analysis Private Equity Acquisition Integration See 4+     See less Financial Modeling Competitive Analysis Forecasting Mergers & Acquisitions Venture Capital Cross-functional Team... Financial Analysis Strategy Due Diligence Corporate Finance Start-ups Valuation Business Strategy Corporate Development Finance Product Management Analysis Private Equity Acquisition Integration See 4+     See less Financial Modeling Competitive Analysis Forecasting Mergers & Acquisitions Venture Capital Cross-functional Team... Financial Analysis Strategy Due Diligence Corporate Finance Start-ups Valuation Business Strategy Corporate Development Finance Product Management Analysis Private Equity Acquisition Integration See 4+     See less ", "Languages English Swedish English Swedish English Swedish Skills Financial Modeling Accounting Corporate Finance Financial Analysis Microsoft Excel Financial Forecasting Forecasting Financial Reporting Strategic Planning Cost Accounting Sarbanes-Oxley Act Revenue Recognition Internal Controls Strategic Financial... Variance Analysis Financial Planning See 1+     See less Skills  Financial Modeling Accounting Corporate Finance Financial Analysis Microsoft Excel Financial Forecasting Forecasting Financial Reporting Strategic Planning Cost Accounting Sarbanes-Oxley Act Revenue Recognition Internal Controls Strategic Financial... Variance Analysis Financial Planning See 1+     See less Financial Modeling Accounting Corporate Finance Financial Analysis Microsoft Excel Financial Forecasting Forecasting Financial Reporting Strategic Planning Cost Accounting Sarbanes-Oxley Act Revenue Recognition Internal Controls Strategic Financial... Variance Analysis Financial Planning See 1+     See less Financial Modeling Accounting Corporate Finance Financial Analysis Microsoft Excel Financial Forecasting Forecasting Financial Reporting Strategic Planning Cost Accounting Sarbanes-Oxley Act Revenue Recognition Internal Controls Strategic Financial... Variance Analysis Financial Planning See 1+     See less ", "Summary Senior Finance Manager at Intel Corporation with over 14 years experience. Experience in P&L, Cost, Inventory, Revenue, Pricing and FP&A Management. Also experience in strategic product line support, cost reduction, benchmarking, M&A and general project management. Summary Senior Finance Manager at Intel Corporation with over 14 years experience. Experience in P&L, Cost, Inventory, Revenue, Pricing and FP&A Management. Also experience in strategic product line support, cost reduction, benchmarking, M&A and general project management. Senior Finance Manager at Intel Corporation with over 14 years experience. Experience in P&L, Cost, Inventory, Revenue, Pricing and FP&A Management. Also experience in strategic product line support, cost reduction, benchmarking, M&A and general project management. Senior Finance Manager at Intel Corporation with over 14 years experience. Experience in P&L, Cost, Inventory, Revenue, Pricing and FP&A Management. Also experience in strategic product line support, cost reduction, benchmarking, M&A and general project management. Experience IT Senior Finance Manager Intel Corporation March 2011  – Present (4 years 6 months) Folsom, CA IT Finance Manager supporting IT automation in factories worldwide as well as Intel Supply Chain. Responsible for team managing close, forecasting and strategic support. Also completed extensive benchmarking work with Bain, led and influenced a major contingent worker strategy change saving the company ~$40M/year and implemented a cost reduction program in IT automation saving Intel manufacturing millions/year. Infineon Acquisition Cost & Inventory Finance Lead Intel Corporation October 2010  –  February 2011  (5 months) Munich Area, Germany Responsible for integrating the Infineon carve out into Intel for cost and inventory. Required significant accounting policy interpretations, enabling Infineon suppliers and subcons to feed into Intel systems, training the Infineon team how to close the books and forecast with Intel systems, policies and US GAAP. Chipset P&L, Cost & Inventory Senior Finance Manager Intel Corporation June 2008  –  September 2010  (2 years 4 months) Folsom, CA Managing the ~$4B Chipset P&L, ~$2B in inventory, inventory build plan, cost reduction support and short term strategic product support (right before product launch). Specific responsibilities revolved around managing team to complete monthly close, forecasting, audit support (E&Y) etc. Also responsible for accounting policy determining R&D vs COS policy. TMG Finance Affordability Specialist Intel Corporation August 2007  –  May 2008  (10 months) Folsom, CA Responsible for manufacturing cost reduction for Chipsets. Originated, led and drove major roadmap change implementing a multi die process saving over $1B in manufacturing capital. Chipset Revenue and Pricing Finance Manager Intel Corporation 2005  –  2007  (2 years) Folsom, CA Responsible for close and forecasting of Chipset revenue and pricing. Partnered with marketing to set pricing stack to maximize revenue and profitability. NOR Flash Product Line Finance Analyst Intel Corporation 2004  –  2005  (1 year) Folsom CA Responsible for several products 3-4 years out including feature roadmap, pricing and proposed memory stacks. Senior P&L and Cost Finance Analyst Intel Corporation 2003  –  2004  (1 year) Folsom, CA Close and Forecasting of P&L & unit cost and strategic support for products launching less than 1 yr out. FP&A Finance Analyst Intel Corporation 2000  –  2002  (2 years) Folsom, CA IT Senior Finance Manager Intel Corporation March 2011  – Present (4 years 6 months) Folsom, CA IT Finance Manager supporting IT automation in factories worldwide as well as Intel Supply Chain. Responsible for team managing close, forecasting and strategic support. Also completed extensive benchmarking work with Bain, led and influenced a major contingent worker strategy change saving the company ~$40M/year and implemented a cost reduction program in IT automation saving Intel manufacturing millions/year. IT Senior Finance Manager Intel Corporation March 2011  – Present (4 years 6 months) Folsom, CA IT Finance Manager supporting IT automation in factories worldwide as well as Intel Supply Chain. Responsible for team managing close, forecasting and strategic support. Also completed extensive benchmarking work with Bain, led and influenced a major contingent worker strategy change saving the company ~$40M/year and implemented a cost reduction program in IT automation saving Intel manufacturing millions/year. Infineon Acquisition Cost & Inventory Finance Lead Intel Corporation October 2010  –  February 2011  (5 months) Munich Area, Germany Responsible for integrating the Infineon carve out into Intel for cost and inventory. Required significant accounting policy interpretations, enabling Infineon suppliers and subcons to feed into Intel systems, training the Infineon team how to close the books and forecast with Intel systems, policies and US GAAP. Infineon Acquisition Cost & Inventory Finance Lead Intel Corporation October 2010  –  February 2011  (5 months) Munich Area, Germany Responsible for integrating the Infineon carve out into Intel for cost and inventory. Required significant accounting policy interpretations, enabling Infineon suppliers and subcons to feed into Intel systems, training the Infineon team how to close the books and forecast with Intel systems, policies and US GAAP. Chipset P&L, Cost & Inventory Senior Finance Manager Intel Corporation June 2008  –  September 2010  (2 years 4 months) Folsom, CA Managing the ~$4B Chipset P&L, ~$2B in inventory, inventory build plan, cost reduction support and short term strategic product support (right before product launch). Specific responsibilities revolved around managing team to complete monthly close, forecasting, audit support (E&Y) etc. Also responsible for accounting policy determining R&D vs COS policy. Chipset P&L, Cost & Inventory Senior Finance Manager Intel Corporation June 2008  –  September 2010  (2 years 4 months) Folsom, CA Managing the ~$4B Chipset P&L, ~$2B in inventory, inventory build plan, cost reduction support and short term strategic product support (right before product launch). Specific responsibilities revolved around managing team to complete monthly close, forecasting, audit support (E&Y) etc. Also responsible for accounting policy determining R&D vs COS policy. TMG Finance Affordability Specialist Intel Corporation August 2007  –  May 2008  (10 months) Folsom, CA Responsible for manufacturing cost reduction for Chipsets. Originated, led and drove major roadmap change implementing a multi die process saving over $1B in manufacturing capital. TMG Finance Affordability Specialist Intel Corporation August 2007  –  May 2008  (10 months) Folsom, CA Responsible for manufacturing cost reduction for Chipsets. Originated, led and drove major roadmap change implementing a multi die process saving over $1B in manufacturing capital. Chipset Revenue and Pricing Finance Manager Intel Corporation 2005  –  2007  (2 years) Folsom, CA Responsible for close and forecasting of Chipset revenue and pricing. Partnered with marketing to set pricing stack to maximize revenue and profitability. Chipset Revenue and Pricing Finance Manager Intel Corporation 2005  –  2007  (2 years) Folsom, CA Responsible for close and forecasting of Chipset revenue and pricing. Partnered with marketing to set pricing stack to maximize revenue and profitability. NOR Flash Product Line Finance Analyst Intel Corporation 2004  –  2005  (1 year) Folsom CA Responsible for several products 3-4 years out including feature roadmap, pricing and proposed memory stacks. NOR Flash Product Line Finance Analyst Intel Corporation 2004  –  2005  (1 year) Folsom CA Responsible for several products 3-4 years out including feature roadmap, pricing and proposed memory stacks. Senior P&L and Cost Finance Analyst Intel Corporation 2003  –  2004  (1 year) Folsom, CA Close and Forecasting of P&L & unit cost and strategic support for products launching less than 1 yr out. Senior P&L and Cost Finance Analyst Intel Corporation 2003  –  2004  (1 year) Folsom, CA Close and Forecasting of P&L & unit cost and strategic support for products launching less than 1 yr out. FP&A Finance Analyst Intel Corporation 2000  –  2002  (2 years) Folsom, CA FP&A Finance Analyst Intel Corporation 2000  –  2002  (2 years) Folsom, CA Skills Financial Analysis Financial Modeling Forecasting Cross-functional Team... Process Improvement Management Competitive Analysis Financial Forecasting Analysis Financial Reporting Mergers & Acquisitions Financial Planning Program Management Skills  Financial Analysis Financial Modeling Forecasting Cross-functional Team... Process Improvement Management Competitive Analysis Financial Forecasting Analysis Financial Reporting Mergers & Acquisitions Financial Planning Program Management Financial Analysis Financial Modeling Forecasting Cross-functional Team... Process Improvement Management Competitive Analysis Financial Forecasting Analysis Financial Reporting Mergers & Acquisitions Financial Planning Program Management Financial Analysis Financial Modeling Forecasting Cross-functional Team... Process Improvement Management Competitive Analysis Financial Forecasting Analysis Financial Reporting Mergers & Acquisitions Financial Planning Program Management Education UC Davis Master of Business Administration (MBA),  Finance , General 2004  – 2006 UC Davis Bachelor of Science (BS),  Managerial Economics 1996  – 2000 UC Davis Master of Business Administration (MBA),  Finance , General 2004  – 2006 UC Davis Master of Business Administration (MBA),  Finance , General 2004  – 2006 UC Davis Master of Business Administration (MBA),  Finance , General 2004  – 2006 UC Davis Bachelor of Science (BS),  Managerial Economics 1996  – 2000 UC Davis Bachelor of Science (BS),  Managerial Economics 1996  – 2000 UC Davis Bachelor of Science (BS),  Managerial Economics 1996  – 2000 ", "Languages English Native or bilingual proficiency Portuguese Native or bilingual proficiency Spanish Native or bilingual proficiency English Native or bilingual proficiency Portuguese Native or bilingual proficiency Spanish Native or bilingual proficiency English Native or bilingual proficiency Portuguese Native or bilingual proficiency Spanish Native or bilingual proficiency Native or bilingual proficiency Native or bilingual proficiency Native or bilingual proficiency Skills Skills     Honors & Awards ", "Summary Financial Stewardship | Financial Planning & Analysis | Financial Reporting \n \nAccomplished Financial Executive & Business Partner with solid and progressive experience in all facets of financial management. Highly skilled in collaborating with all members of the organization to achieve business and financial objectives. Specialized expertise in financial controls, management, and reporting across development, validation, manufacturing, and business unit P&L for high-tech hardware, software, and service businesses. Adept in building and motivating high performance teams, enhancing productivity levels, introducing process improvements, and reducing costs. Additional core competencies include:  \n \nGAAP & SOX Compliance • P&L and Budgetary Planning • Organizational Restructuring & Strategic Planning • Supply Chain Management • M&A Integration • Process Improvement & Change Management • Forecasting & Modeling • Revenue Recognition • Internal Controls & Risk Management Summary Financial Stewardship | Financial Planning & Analysis | Financial Reporting \n \nAccomplished Financial Executive & Business Partner with solid and progressive experience in all facets of financial management. Highly skilled in collaborating with all members of the organization to achieve business and financial objectives. Specialized expertise in financial controls, management, and reporting across development, validation, manufacturing, and business unit P&L for high-tech hardware, software, and service businesses. Adept in building and motivating high performance teams, enhancing productivity levels, introducing process improvements, and reducing costs. Additional core competencies include:  \n \nGAAP & SOX Compliance • P&L and Budgetary Planning • Organizational Restructuring & Strategic Planning • Supply Chain Management • M&A Integration • Process Improvement & Change Management • Forecasting & Modeling • Revenue Recognition • Internal Controls & Risk Management Financial Stewardship | Financial Planning & Analysis | Financial Reporting \n \nAccomplished Financial Executive & Business Partner with solid and progressive experience in all facets of financial management. Highly skilled in collaborating with all members of the organization to achieve business and financial objectives. Specialized expertise in financial controls, management, and reporting across development, validation, manufacturing, and business unit P&L for high-tech hardware, software, and service businesses. Adept in building and motivating high performance teams, enhancing productivity levels, introducing process improvements, and reducing costs. Additional core competencies include:  \n \nGAAP & SOX Compliance • P&L and Budgetary Planning • Organizational Restructuring & Strategic Planning • Supply Chain Management • M&A Integration • Process Improvement & Change Management • Forecasting & Modeling • Revenue Recognition • Internal Controls & Risk Management Financial Stewardship | Financial Planning & Analysis | Financial Reporting \n \nAccomplished Financial Executive & Business Partner with solid and progressive experience in all facets of financial management. Highly skilled in collaborating with all members of the organization to achieve business and financial objectives. Specialized expertise in financial controls, management, and reporting across development, validation, manufacturing, and business unit P&L for high-tech hardware, software, and service businesses. Adept in building and motivating high performance teams, enhancing productivity levels, introducing process improvements, and reducing costs. Additional core competencies include:  \n \nGAAP & SOX Compliance • P&L and Budgetary Planning • Organizational Restructuring & Strategic Planning • Supply Chain Management • M&A Integration • Process Improvement & Change Management • Forecasting & Modeling • Revenue Recognition • Internal Controls & Risk Management Experience Data Center Software Division – Senior Strategic Finance Lead Intel Corporation 2012  – Present (3 years) Hillsboro, Oregon Maintained accountability for acquisition integration and new business structure for datacenter caching startup. Formulated strategy and monetization business plan for new memory technology.  \n•\tAchieved a Division Recognition Award for unpacking the strategy into execution milestones highlighting the critical path of the program, which garnered recognition as the model for unpacking the strategy for major programs into execution milestones across Intel. \n•\tInitiated a strategic direction and working group to establish a new software strategy to determine what vertical software stacks were needed to accomplish the market size and ramp. Desktop Motherboards and Channel Products & Strategy – Senior P&L Manager Intel Corporation 2008  –  2012  (4 years) Hillsboro, OR Platform Validation & Engineering - Senior Finance Manager Intel Corporation 2005  –  2008  (3 years) Hillsboro, OR Communications Group - Senior Finance Manager Intel Corporation 2004  –  2005  (1 year) Hillsboro, OR Desktop Products Group - CPU Cost Finance Manager Intel Corporation 2001  –  2004  (3 years) Hillsboro, OR Additional tenure: FP&A Manager, Senior Product Line Analyst, Senior Revenue Analyst Intel Corporation 1997  –  2001  (4 years) Hillsboro, OR IBM Credit: Business Lending Group - Credit Analyst IBM 1996  –  1996  (less than a year) Stamford, CT Data Center Software Division – Senior Strategic Finance Lead Intel Corporation 2012  – Present (3 years) Hillsboro, Oregon Maintained accountability for acquisition integration and new business structure for datacenter caching startup. Formulated strategy and monetization business plan for new memory technology.  \n•\tAchieved a Division Recognition Award for unpacking the strategy into execution milestones highlighting the critical path of the program, which garnered recognition as the model for unpacking the strategy for major programs into execution milestones across Intel. \n•\tInitiated a strategic direction and working group to establish a new software strategy to determine what vertical software stacks were needed to accomplish the market size and ramp. Data Center Software Division – Senior Strategic Finance Lead Intel Corporation 2012  – Present (3 years) Hillsboro, Oregon Maintained accountability for acquisition integration and new business structure for datacenter caching startup. Formulated strategy and monetization business plan for new memory technology.  \n•\tAchieved a Division Recognition Award for unpacking the strategy into execution milestones highlighting the critical path of the program, which garnered recognition as the model for unpacking the strategy for major programs into execution milestones across Intel. \n•\tInitiated a strategic direction and working group to establish a new software strategy to determine what vertical software stacks were needed to accomplish the market size and ramp. Desktop Motherboards and Channel Products & Strategy – Senior P&L Manager Intel Corporation 2008  –  2012  (4 years) Hillsboro, OR Desktop Motherboards and Channel Products & Strategy – Senior P&L Manager Intel Corporation 2008  –  2012  (4 years) Hillsboro, OR Platform Validation & Engineering - Senior Finance Manager Intel Corporation 2005  –  2008  (3 years) Hillsboro, OR Platform Validation & Engineering - Senior Finance Manager Intel Corporation 2005  –  2008  (3 years) Hillsboro, OR Communications Group - Senior Finance Manager Intel Corporation 2004  –  2005  (1 year) Hillsboro, OR Communications Group - Senior Finance Manager Intel Corporation 2004  –  2005  (1 year) Hillsboro, OR Desktop Products Group - CPU Cost Finance Manager Intel Corporation 2001  –  2004  (3 years) Hillsboro, OR Desktop Products Group - CPU Cost Finance Manager Intel Corporation 2001  –  2004  (3 years) Hillsboro, OR Additional tenure: FP&A Manager, Senior Product Line Analyst, Senior Revenue Analyst Intel Corporation 1997  –  2001  (4 years) Hillsboro, OR Additional tenure: FP&A Manager, Senior Product Line Analyst, Senior Revenue Analyst Intel Corporation 1997  –  2001  (4 years) Hillsboro, OR IBM Credit: Business Lending Group - Credit Analyst IBM 1996  –  1996  (less than a year) Stamford, CT IBM Credit: Business Lending Group - Credit Analyst IBM 1996  –  1996  (less than a year) Stamford, CT Languages English Native or bilingual proficiency Spanish Limited working proficiency English Native or bilingual proficiency Spanish Limited working proficiency English Native or bilingual proficiency Spanish Limited working proficiency Native or bilingual proficiency Limited working proficiency Skills Forecasting Internal Controls Budgets Project Planning Financial Modeling Financial Analysis Sarbanes-Oxley Act Revenue Recognition Variance Analysis Cost Accounting Capital Budgeting Strategic Financial... Financial Reporting Financial Forecasting Management Start-ups Analysis Finance SAP Business Strategy Cross-functional Team... Business Development Managerial Finance Corporate Finance Mergers & Acquisitions Process Improvement Essbase US GAAP Accounting Competitive Analysis Sarbanes-Oxley See 16+     See less Skills  Forecasting Internal Controls Budgets Project Planning Financial Modeling Financial Analysis Sarbanes-Oxley Act Revenue Recognition Variance Analysis Cost Accounting Capital Budgeting Strategic Financial... Financial Reporting Financial Forecasting Management Start-ups Analysis Finance SAP Business Strategy Cross-functional Team... Business Development Managerial Finance Corporate Finance Mergers & Acquisitions Process Improvement Essbase US GAAP Accounting Competitive Analysis Sarbanes-Oxley See 16+     See less Forecasting Internal Controls Budgets Project Planning Financial Modeling Financial Analysis Sarbanes-Oxley Act Revenue Recognition Variance Analysis Cost Accounting Capital Budgeting Strategic Financial... Financial Reporting Financial Forecasting Management Start-ups Analysis Finance SAP Business Strategy Cross-functional Team... Business Development Managerial Finance Corporate Finance Mergers & Acquisitions Process Improvement Essbase US GAAP Accounting Competitive Analysis Sarbanes-Oxley See 16+     See less Forecasting Internal Controls Budgets Project Planning Financial Modeling Financial Analysis Sarbanes-Oxley Act Revenue Recognition Variance Analysis Cost Accounting Capital Budgeting Strategic Financial... Financial Reporting Financial Forecasting Management Start-ups Analysis Finance SAP Business Strategy Cross-functional Team... Business Development Managerial Finance Corporate Finance Mergers & Acquisitions Process Improvement Essbase US GAAP Accounting Competitive Analysis Sarbanes-Oxley See 16+     See less Honors & Awards Additional Honors & Awards Intel 15 year Instructor Recognition \nIntel Finance Achievement Award Additional Honors & Awards Intel 15 year Instructor Recognition \nIntel Finance Achievement Award Additional Honors & Awards Intel 15 year Instructor Recognition \nIntel Finance Achievement Award Additional Honors & Awards Intel 15 year Instructor Recognition \nIntel Finance Achievement Award ", "Skills Strategy Finance Budgets Forecasting Skills  Strategy Finance Budgets Forecasting Strategy Finance Budgets Forecasting Strategy Finance Budgets Forecasting ", "Summary Skilled Professional has 10+ year semiconductor industry experience in mobile and memory industry; extensive expertise in developing business strategies and scenario planning; experience in market analysis, industry value chain assessment, financial analysis and market modeling. Fluency in English and Mandarin. \n \nActively looking for opportunity in China! Summary Skilled Professional has 10+ year semiconductor industry experience in mobile and memory industry; extensive expertise in developing business strategies and scenario planning; experience in market analysis, industry value chain assessment, financial analysis and market modeling. Fluency in English and Mandarin. \n \nActively looking for opportunity in China! Skilled Professional has 10+ year semiconductor industry experience in mobile and memory industry; extensive expertise in developing business strategies and scenario planning; experience in market analysis, industry value chain assessment, financial analysis and market modeling. Fluency in English and Mandarin. \n \nActively looking for opportunity in China! Skilled Professional has 10+ year semiconductor industry experience in mobile and memory industry; extensive expertise in developing business strategies and scenario planning; experience in market analysis, industry value chain assessment, financial analysis and market modeling. Fluency in English and Mandarin. \n \nActively looking for opportunity in China! Experience Software and Service Group Senior Finance Manager Intel Corporation January 2014  – Present (1 year 8 months) Shanghai City, China Finance owner for >700 headcount Software and Service Group in PRC, also provide strategic support to APAC and IJKK SSG teams NAND Business Group Strategic Finance Manager Intel October 2008  –  December 2013  (5 years 3 months) Folsom, CA, USA Supported corporate strategy discussion and influenced optimized risk/reward capacity strategy; avoided $1.5B capex investment \nShaped $3B foundry business model strategy for business discussion with Intel CEO \nFinance owner for a new memory technology overall strategy, drove technology adoption analysis, go to market strategy for the first 2 years, demand/supply risk analysis and cross platform alignment, $2B NPV value Flash Memory Manufacturing Group Senior Finance Analyst Intel June 2004  –  October 2008  (4 years 5 months) Folsom, CA, USA Led Flash Memory Manufacturing group close/POR process and influenced key business decisions in the FMMG network MBA Project Manager Summer Intern Schneider Logistics June 2003  –  August 2003  (3 months) Green Bay, WI, USA Senior Buyer HP 1999  –  June 2002  (3 years) Shanghai City, China Procurement Engineer GE 1997  –  1999  (2 years) Shanghai City, China Software and Service Group Senior Finance Manager Intel Corporation January 2014  – Present (1 year 8 months) Shanghai City, China Finance owner for >700 headcount Software and Service Group in PRC, also provide strategic support to APAC and IJKK SSG teams Software and Service Group Senior Finance Manager Intel Corporation January 2014  – Present (1 year 8 months) Shanghai City, China Finance owner for >700 headcount Software and Service Group in PRC, also provide strategic support to APAC and IJKK SSG teams NAND Business Group Strategic Finance Manager Intel October 2008  –  December 2013  (5 years 3 months) Folsom, CA, USA Supported corporate strategy discussion and influenced optimized risk/reward capacity strategy; avoided $1.5B capex investment \nShaped $3B foundry business model strategy for business discussion with Intel CEO \nFinance owner for a new memory technology overall strategy, drove technology adoption analysis, go to market strategy for the first 2 years, demand/supply risk analysis and cross platform alignment, $2B NPV value NAND Business Group Strategic Finance Manager Intel October 2008  –  December 2013  (5 years 3 months) Folsom, CA, USA Supported corporate strategy discussion and influenced optimized risk/reward capacity strategy; avoided $1.5B capex investment \nShaped $3B foundry business model strategy for business discussion with Intel CEO \nFinance owner for a new memory technology overall strategy, drove technology adoption analysis, go to market strategy for the first 2 years, demand/supply risk analysis and cross platform alignment, $2B NPV value Flash Memory Manufacturing Group Senior Finance Analyst Intel June 2004  –  October 2008  (4 years 5 months) Folsom, CA, USA Led Flash Memory Manufacturing group close/POR process and influenced key business decisions in the FMMG network Flash Memory Manufacturing Group Senior Finance Analyst Intel June 2004  –  October 2008  (4 years 5 months) Folsom, CA, USA Led Flash Memory Manufacturing group close/POR process and influenced key business decisions in the FMMG network MBA Project Manager Summer Intern Schneider Logistics June 2003  –  August 2003  (3 months) Green Bay, WI, USA MBA Project Manager Summer Intern Schneider Logistics June 2003  –  August 2003  (3 months) Green Bay, WI, USA Senior Buyer HP 1999  –  June 2002  (3 years) Shanghai City, China Senior Buyer HP 1999  –  June 2002  (3 years) Shanghai City, China Procurement Engineer GE 1997  –  1999  (2 years) Shanghai City, China Procurement Engineer GE 1997  –  1999  (2 years) Shanghai City, China Skills Business strategies,... Six Sigma Strategic Planning Strategy Strategic Sourcing Semiconductors Cross-functional Team... Supply Management Skills  Business strategies,... Six Sigma Strategic Planning Strategy Strategic Sourcing Semiconductors Cross-functional Team... Supply Management Business strategies,... Six Sigma Strategic Planning Strategy Strategic Sourcing Semiconductors Cross-functional Team... Supply Management Business strategies,... Six Sigma Strategic Planning Strategy Strategic Sourcing Semiconductors Cross-functional Team... Supply Management Education University of Maryland - Robert H. Smith School of Business MBA,  Finance and Supply Chain 2002  – 2004 Shanghai Jiao Tong University BA,  Chemistry 1993  – 1997 University of Maryland - Robert H. Smith School of Business MBA,  Finance and Supply Chain 2002  – 2004 University of Maryland - Robert H. Smith School of Business MBA,  Finance and Supply Chain 2002  – 2004 University of Maryland - Robert H. Smith School of Business MBA,  Finance and Supply Chain 2002  – 2004 Shanghai Jiao Tong University BA,  Chemistry 1993  – 1997 Shanghai Jiao Tong University BA,  Chemistry 1993  – 1997 Shanghai Jiao Tong University BA,  Chemistry 1993  – 1997 ", "Skills Data Center Networking Ethernet Mergers & Acquisitions Go-to-market Strategy Finance Corporate Finance Cloud Computing Cross-functional Team... SaaS Product Management Unified Communications Enterprise Software Cisco Technologies Sales Enablement Skills  Data Center Networking Ethernet Mergers & Acquisitions Go-to-market Strategy Finance Corporate Finance Cloud Computing Cross-functional Team... SaaS Product Management Unified Communications Enterprise Software Cisco Technologies Sales Enablement Data Center Networking Ethernet Mergers & Acquisitions Go-to-market Strategy Finance Corporate Finance Cloud Computing Cross-functional Team... SaaS Product Management Unified Communications Enterprise Software Cisco Technologies Sales Enablement Data Center Networking Ethernet Mergers & Acquisitions Go-to-market Strategy Finance Corporate Finance Cloud Computing Cross-functional Team... SaaS Product Management Unified Communications Enterprise Software Cisco Technologies Sales Enablement ", "Summary Throughout my 15 years at Intel – both Intel International Subsidiaries as well as HQ – I’ve delivered business results in the form of: \n•\tDriving Business: Led a team of finance professionals to deliver over $9 Billion Revenue a year, complex financial analysis and modeling and Influencing Strategies. Managed Annual Budgets of over $600M, partnering with VPs and GMs World Wide in multi-year projects, which delivered increased return on investment, efficiencies and simplicity for the company’s customers. Negotiated Bank Loans for Latin American Subs. GAAP, Tax Compliance, Accounting activities. Close and Reporting. Budgeting and Planning. Cash Management and Relationships with Banks. Fixed Asset Inventory. Payroll. Financial Statements and its Notes. Relationship with External Auditors. Cash Management. \n•\tRisk Management: Managed over $200 Million in Credit Lines in Latin America, maximizing revenue while managing the risk. Key customer turn around – a 3-year effort to turn around one customer’s failing business, expanding free cash flow, optimizing Capex and avoiding bankruptcy, which would have resulted in the loss of ~30% of the Region’s Revenue. Complex relationship building and influencing strategy on GM and Customer’s CEO. Customer and Intel Growth Strategies. Internal Controls – Process improvement and implementation: Self Audits, Standardization. Credit and Collections. \n•\tDeals: SSG’s Software Development Center in Cordoba – Argentina. Led negotiations for 9+ months with the Argentine Government to close a complex deal to have Intel’s first Software Development Center in Latin America. Delicate approach that resulted in $25M worth of tax breaks, a free building for the center – paid for by the Provincial Government - and with Intel’s only obligation to hire local employees on an agreed upon schedule. \n Summary Throughout my 15 years at Intel – both Intel International Subsidiaries as well as HQ – I’ve delivered business results in the form of: \n•\tDriving Business: Led a team of finance professionals to deliver over $9 Billion Revenue a year, complex financial analysis and modeling and Influencing Strategies. Managed Annual Budgets of over $600M, partnering with VPs and GMs World Wide in multi-year projects, which delivered increased return on investment, efficiencies and simplicity for the company’s customers. Negotiated Bank Loans for Latin American Subs. GAAP, Tax Compliance, Accounting activities. Close and Reporting. Budgeting and Planning. Cash Management and Relationships with Banks. Fixed Asset Inventory. Payroll. Financial Statements and its Notes. Relationship with External Auditors. Cash Management. \n•\tRisk Management: Managed over $200 Million in Credit Lines in Latin America, maximizing revenue while managing the risk. Key customer turn around – a 3-year effort to turn around one customer’s failing business, expanding free cash flow, optimizing Capex and avoiding bankruptcy, which would have resulted in the loss of ~30% of the Region’s Revenue. Complex relationship building and influencing strategy on GM and Customer’s CEO. Customer and Intel Growth Strategies. Internal Controls – Process improvement and implementation: Self Audits, Standardization. Credit and Collections. \n•\tDeals: SSG’s Software Development Center in Cordoba – Argentina. Led negotiations for 9+ months with the Argentine Government to close a complex deal to have Intel’s first Software Development Center in Latin America. Delicate approach that resulted in $25M worth of tax breaks, a free building for the center – paid for by the Provincial Government - and with Intel’s only obligation to hire local employees on an agreed upon schedule. \n Throughout my 15 years at Intel – both Intel International Subsidiaries as well as HQ – I’ve delivered business results in the form of: \n•\tDriving Business: Led a team of finance professionals to deliver over $9 Billion Revenue a year, complex financial analysis and modeling and Influencing Strategies. Managed Annual Budgets of over $600M, partnering with VPs and GMs World Wide in multi-year projects, which delivered increased return on investment, efficiencies and simplicity for the company’s customers. Negotiated Bank Loans for Latin American Subs. GAAP, Tax Compliance, Accounting activities. Close and Reporting. Budgeting and Planning. Cash Management and Relationships with Banks. Fixed Asset Inventory. Payroll. Financial Statements and its Notes. Relationship with External Auditors. Cash Management. \n•\tRisk Management: Managed over $200 Million in Credit Lines in Latin America, maximizing revenue while managing the risk. Key customer turn around – a 3-year effort to turn around one customer’s failing business, expanding free cash flow, optimizing Capex and avoiding bankruptcy, which would have resulted in the loss of ~30% of the Region’s Revenue. Complex relationship building and influencing strategy on GM and Customer’s CEO. Customer and Intel Growth Strategies. Internal Controls – Process improvement and implementation: Self Audits, Standardization. Credit and Collections. \n•\tDeals: SSG’s Software Development Center in Cordoba – Argentina. Led negotiations for 9+ months with the Argentine Government to close a complex deal to have Intel’s first Software Development Center in Latin America. Delicate approach that resulted in $25M worth of tax breaks, a free building for the center – paid for by the Provincial Government - and with Intel’s only obligation to hire local employees on an agreed upon schedule. \n Throughout my 15 years at Intel – both Intel International Subsidiaries as well as HQ – I’ve delivered business results in the form of: \n•\tDriving Business: Led a team of finance professionals to deliver over $9 Billion Revenue a year, complex financial analysis and modeling and Influencing Strategies. Managed Annual Budgets of over $600M, partnering with VPs and GMs World Wide in multi-year projects, which delivered increased return on investment, efficiencies and simplicity for the company’s customers. Negotiated Bank Loans for Latin American Subs. GAAP, Tax Compliance, Accounting activities. Close and Reporting. Budgeting and Planning. Cash Management and Relationships with Banks. Fixed Asset Inventory. Payroll. Financial Statements and its Notes. Relationship with External Auditors. Cash Management. \n•\tRisk Management: Managed over $200 Million in Credit Lines in Latin America, maximizing revenue while managing the risk. Key customer turn around – a 3-year effort to turn around one customer’s failing business, expanding free cash flow, optimizing Capex and avoiding bankruptcy, which would have resulted in the loss of ~30% of the Region’s Revenue. Complex relationship building and influencing strategy on GM and Customer’s CEO. Customer and Intel Growth Strategies. Internal Controls – Process improvement and implementation: Self Audits, Standardization. Credit and Collections. \n•\tDeals: SSG’s Software Development Center in Cordoba – Argentina. Led negotiations for 9+ months with the Argentine Government to close a complex deal to have Intel’s first Software Development Center in Latin America. Delicate approach that resulted in $25M worth of tax breaks, a free building for the center – paid for by the Provincial Government - and with Intel’s only obligation to hire local employees on an agreed upon schedule. \n Languages English Spanish Portuguese English Spanish Portuguese English Spanish Portuguese Skills Forecasting Financial Analysis Competitive Analysis Cross-functional Team... Strategy Financial Modeling Management Mergers & Acquisitions Process Improvement Business Development Finance Team Leadership Go-to-market Strategy Program Management Business Strategy Strategic Partnerships Strategic Planning See 2+     See less Skills  Forecasting Financial Analysis Competitive Analysis Cross-functional Team... Strategy Financial Modeling Management Mergers & Acquisitions Process Improvement Business Development Finance Team Leadership Go-to-market Strategy Program Management Business Strategy Strategic Partnerships Strategic Planning See 2+     See less Forecasting Financial Analysis Competitive Analysis Cross-functional Team... Strategy Financial Modeling Management Mergers & Acquisitions Process Improvement Business Development Finance Team Leadership Go-to-market Strategy Program Management Business Strategy Strategic Partnerships Strategic Planning See 2+     See less Forecasting Financial Analysis Competitive Analysis Cross-functional Team... Strategy Financial Modeling Management Mergers & Acquisitions Process Improvement Business Development Finance Team Leadership Go-to-market Strategy Program Management Business Strategy Strategic Partnerships Strategic Planning See 2+     See less ", "Summary A passion for serving business owners and CEO's as \"CFO partner\" working together to define and drive a comprehensive vision for success.  \n \nFrom helping Intel achieve and implement world-class manufacturing financial processes and systems during a critical early period (which led to receipt of the firm's highest award) to leading and assisting some of the most exciting private firms (a number with venture-backing) in Silicon Valley and beyond to achieve fast-growth while transitioning a few onto acquisition or public listing … \n \nAlways by guiding the implementation of a strong financial foundation coupled with the development of operational plans with milestones for success. \n \nKnown for providing superior guidance as an analytical strategist; for guiding capital fundraising and company growth; and for preparing entities for potential acquisition or IPO. Summary A passion for serving business owners and CEO's as \"CFO partner\" working together to define and drive a comprehensive vision for success.  \n \nFrom helping Intel achieve and implement world-class manufacturing financial processes and systems during a critical early period (which led to receipt of the firm's highest award) to leading and assisting some of the most exciting private firms (a number with venture-backing) in Silicon Valley and beyond to achieve fast-growth while transitioning a few onto acquisition or public listing … \n \nAlways by guiding the implementation of a strong financial foundation coupled with the development of operational plans with milestones for success. \n \nKnown for providing superior guidance as an analytical strategist; for guiding capital fundraising and company growth; and for preparing entities for potential acquisition or IPO. A passion for serving business owners and CEO's as \"CFO partner\" working together to define and drive a comprehensive vision for success.  \n \nFrom helping Intel achieve and implement world-class manufacturing financial processes and systems during a critical early period (which led to receipt of the firm's highest award) to leading and assisting some of the most exciting private firms (a number with venture-backing) in Silicon Valley and beyond to achieve fast-growth while transitioning a few onto acquisition or public listing … \n \nAlways by guiding the implementation of a strong financial foundation coupled with the development of operational plans with milestones for success. \n \nKnown for providing superior guidance as an analytical strategist; for guiding capital fundraising and company growth; and for preparing entities for potential acquisition or IPO. A passion for serving business owners and CEO's as \"CFO partner\" working together to define and drive a comprehensive vision for success.  \n \nFrom helping Intel achieve and implement world-class manufacturing financial processes and systems during a critical early period (which led to receipt of the firm's highest award) to leading and assisting some of the most exciting private firms (a number with venture-backing) in Silicon Valley and beyond to achieve fast-growth while transitioning a few onto acquisition or public listing … \n \nAlways by guiding the implementation of a strong financial foundation coupled with the development of operational plans with milestones for success. \n \nKnown for providing superior guidance as an analytical strategist; for guiding capital fundraising and company growth; and for preparing entities for potential acquisition or IPO. Experience Founder and CFO Engagement Partner Next Level Consulting Inc 1993  – Present (22 years) CFO Engagement Partner Tatum, a Randstad company April 2012  – Present (3 years 5 months) Founder and CFO Engagement Partner Next Level Consulting Inc 1993  – Present (22 years) Founder and CFO Engagement Partner Next Level Consulting Inc 1993  – Present (22 years) CFO Engagement Partner Tatum, a Randstad company April 2012  – Present (3 years 5 months) CFO Engagement Partner Tatum, a Randstad company April 2012  – Present (3 years 5 months) Skills Manufacturing Venture Capital Mergers Start-ups Financial Modeling Financial Analysis Financial Management Cash Management Forecasting Cost Reduction Joint Ventures Business Planning Strategic Planning Financial Reporting Cross-functional Team... Early Stage Ventures Managerial Finance Mergers & Acquisitions Strategy Leadership ERP Management Budgets Business Development Restructuring Strategic Financial... IPO Analysis Accounting Corporate Finance Investments Executive Management Contract Negotiation Acquisition Integration Finance Business Strategy Auditing Private Equity M&A experience SEC filings Acquisitions Divestitures Revenue Recognition Turn Around Management Corporate Development Investor Relations Due Diligence Consulting Entrepreneurship Strategic Partnerships See 35+     See less Skills  Manufacturing Venture Capital Mergers Start-ups Financial Modeling Financial Analysis Financial Management Cash Management Forecasting Cost Reduction Joint Ventures Business Planning Strategic Planning Financial Reporting Cross-functional Team... Early Stage Ventures Managerial Finance Mergers & Acquisitions Strategy Leadership ERP Management Budgets Business Development Restructuring Strategic Financial... IPO Analysis Accounting Corporate Finance Investments Executive Management Contract Negotiation Acquisition Integration Finance Business Strategy Auditing Private Equity M&A experience SEC filings Acquisitions Divestitures Revenue Recognition Turn Around Management Corporate Development Investor Relations Due Diligence Consulting Entrepreneurship Strategic Partnerships See 35+     See less Manufacturing Venture Capital Mergers Start-ups Financial Modeling Financial Analysis Financial Management Cash Management Forecasting Cost Reduction Joint Ventures Business Planning Strategic Planning Financial Reporting Cross-functional Team... Early Stage Ventures Managerial Finance Mergers & Acquisitions Strategy Leadership ERP Management Budgets Business Development Restructuring Strategic Financial... IPO Analysis Accounting Corporate Finance Investments Executive Management Contract Negotiation Acquisition Integration Finance Business Strategy Auditing Private Equity M&A experience SEC filings Acquisitions Divestitures Revenue Recognition Turn Around Management Corporate Development Investor Relations Due Diligence Consulting Entrepreneurship Strategic Partnerships See 35+     See less Manufacturing Venture Capital Mergers Start-ups Financial Modeling Financial Analysis Financial Management Cash Management Forecasting Cost Reduction Joint Ventures Business Planning Strategic Planning Financial Reporting Cross-functional Team... Early Stage Ventures Managerial Finance Mergers & Acquisitions Strategy Leadership ERP Management Budgets Business Development Restructuring Strategic Financial... IPO Analysis Accounting Corporate Finance Investments Executive Management Contract Negotiation Acquisition Integration Finance Business Strategy Auditing Private Equity M&A experience SEC filings Acquisitions Divestitures Revenue Recognition Turn Around Management Corporate Development Investor Relations Due Diligence Consulting Entrepreneurship Strategic Partnerships See 35+     See less Education The University of Chicago Booth School of Business MBA,  General Business and Finance Dean's List Activities and Societies:  Selected Booth Representative to University President Duke University BA,  Economics and Political Science Awarded top prize for economics thesis: \"Teenagers and the Minimum Wage.\" Activities and Societies:  Awarded Economics Honors ,  PoliSci Honor Fraternity ,  Duke scholar at Oxford ,  magna cum laude The University of Chicago Booth School of Business MBA,  General Business and Finance Dean's List Activities and Societies:  Selected Booth Representative to University President The University of Chicago Booth School of Business MBA,  General Business and Finance Dean's List Activities and Societies:  Selected Booth Representative to University President The University of Chicago Booth School of Business MBA,  General Business and Finance Dean's List Activities and Societies:  Selected Booth Representative to University President Duke University BA,  Economics and Political Science Awarded top prize for economics thesis: \"Teenagers and the Minimum Wage.\" Activities and Societies:  Awarded Economics Honors ,  PoliSci Honor Fraternity ,  Duke scholar at Oxford ,  magna cum laude Duke University BA,  Economics and Political Science Awarded top prize for economics thesis: \"Teenagers and the Minimum Wage.\" Activities and Societies:  Awarded Economics Honors ,  PoliSci Honor Fraternity ,  Duke scholar at Oxford ,  magna cum laude Duke University BA,  Economics and Political Science Awarded top prize for economics thesis: \"Teenagers and the Minimum Wage.\" Activities and Societies:  Awarded Economics Honors ,  PoliSci Honor Fraternity ,  Duke scholar at Oxford ,  magna cum laude Honors & Awards Intel Achievement Award Intel Awarded Intel's highest honor for engagement world-wide with management and financial teams guiding implementation of a new internal approach to Financial Planning and Strategy that served as a foundation for the company's achievement of World-Class Manufacturing.  Top Prize: Economics Thesis Duke University \"Teenagers and the Minimum Wage.\" Intel Achievement Award Intel Awarded Intel's highest honor for engagement world-wide with management and financial teams guiding implementation of a new internal approach to Financial Planning and Strategy that served as a foundation for the company's achievement of World-Class Manufacturing.  Intel Achievement Award Intel Awarded Intel's highest honor for engagement world-wide with management and financial teams guiding implementation of a new internal approach to Financial Planning and Strategy that served as a foundation for the company's achievement of World-Class Manufacturing.  Intel Achievement Award Intel Awarded Intel's highest honor for engagement world-wide with management and financial teams guiding implementation of a new internal approach to Financial Planning and Strategy that served as a foundation for the company's achievement of World-Class Manufacturing.  Top Prize: Economics Thesis Duke University \"Teenagers and the Minimum Wage.\" Top Prize: Economics Thesis Duke University \"Teenagers and the Minimum Wage.\" Top Prize: Economics Thesis Duke University \"Teenagers and the Minimum Wage.\" "]}