{"position": "SOA Architect", "company": "IBM", "profiles": ["Summary Sabu John is a Senior Solution Architect in the IBM BPMS National Business Unit of Perficient. He has sixteen years of experience in the IT industry and has successfully carried out the responsibilities of Lead Application Architect, SOA Architect, Technical Lead, Integration Lead, Application Developer and Programmer. He has carried out tasks in large enterprise systems with specific focus on SOA Architecture, Implementation & Governance, EAI, RUP Methodology, JAD Sessions , RRD (Rapid Requirement Definition) , Java/J2EE Web application development, Application performance tuning, Capacity Analysis & Planning, Application Migration, conversion & Data Migration, ETL, OOAD, Data Modeling, Use Case Realizations, Compilation of Proposals including RFI, RFP , BAFO etc.. His industry exposure includes Government, Telecommunications, Banking, Defense, Distribution, Inventory Control, Utilities/Energy, Retail, Airlines and Health Care.  \n \nSabu was an SOA Architect for IBM and has extensive experience in IBM SOA engagement models and was part of multiple IBM SOA Project implementations. Summary Sabu John is a Senior Solution Architect in the IBM BPMS National Business Unit of Perficient. He has sixteen years of experience in the IT industry and has successfully carried out the responsibilities of Lead Application Architect, SOA Architect, Technical Lead, Integration Lead, Application Developer and Programmer. He has carried out tasks in large enterprise systems with specific focus on SOA Architecture, Implementation & Governance, EAI, RUP Methodology, JAD Sessions , RRD (Rapid Requirement Definition) , Java/J2EE Web application development, Application performance tuning, Capacity Analysis & Planning, Application Migration, conversion & Data Migration, ETL, OOAD, Data Modeling, Use Case Realizations, Compilation of Proposals including RFI, RFP , BAFO etc.. His industry exposure includes Government, Telecommunications, Banking, Defense, Distribution, Inventory Control, Utilities/Energy, Retail, Airlines and Health Care.  \n \nSabu was an SOA Architect for IBM and has extensive experience in IBM SOA engagement models and was part of multiple IBM SOA Project implementations. Sabu John is a Senior Solution Architect in the IBM BPMS National Business Unit of Perficient. He has sixteen years of experience in the IT industry and has successfully carried out the responsibilities of Lead Application Architect, SOA Architect, Technical Lead, Integration Lead, Application Developer and Programmer. He has carried out tasks in large enterprise systems with specific focus on SOA Architecture, Implementation & Governance, EAI, RUP Methodology, JAD Sessions , RRD (Rapid Requirement Definition) , Java/J2EE Web application development, Application performance tuning, Capacity Analysis & Planning, Application Migration, conversion & Data Migration, ETL, OOAD, Data Modeling, Use Case Realizations, Compilation of Proposals including RFI, RFP , BAFO etc.. His industry exposure includes Government, Telecommunications, Banking, Defense, Distribution, Inventory Control, Utilities/Energy, Retail, Airlines and Health Care.  \n \nSabu was an SOA Architect for IBM and has extensive experience in IBM SOA engagement models and was part of multiple IBM SOA Project implementations. Sabu John is a Senior Solution Architect in the IBM BPMS National Business Unit of Perficient. He has sixteen years of experience in the IT industry and has successfully carried out the responsibilities of Lead Application Architect, SOA Architect, Technical Lead, Integration Lead, Application Developer and Programmer. He has carried out tasks in large enterprise systems with specific focus on SOA Architecture, Implementation & Governance, EAI, RUP Methodology, JAD Sessions , RRD (Rapid Requirement Definition) , Java/J2EE Web application development, Application performance tuning, Capacity Analysis & Planning, Application Migration, conversion & Data Migration, ETL, OOAD, Data Modeling, Use Case Realizations, Compilation of Proposals including RFI, RFP , BAFO etc.. His industry exposure includes Government, Telecommunications, Banking, Defense, Distribution, Inventory Control, Utilities/Energy, Retail, Airlines and Health Care.  \n \nSabu was an SOA Architect for IBM and has extensive experience in IBM SOA engagement models and was part of multiple IBM SOA Project implementations. Experience Senior Solution Architect Perficient April 2008  – Present (7 years 5 months) SOA Architect IBM Global Services February 2003  –  April 2008  (5 years 3 months) SOA Architect \nIT Application Architect SOA/Integration Architect IBM Global Services February 2003  –  April 2008  (5 years 3 months) Solution Architect/J2EE Architect Compuware Corporation February 2000  –  February 2003  (3 years 1 month) Java/J2EE Developer Kaiser Permanente 2000  –  2000  (less than a year) Senior Solution Architect Perficient April 2008  – Present (7 years 5 months) Senior Solution Architect Perficient April 2008  – Present (7 years 5 months) SOA Architect IBM Global Services February 2003  –  April 2008  (5 years 3 months) SOA Architect \nIT Application Architect SOA Architect IBM Global Services February 2003  –  April 2008  (5 years 3 months) SOA Architect \nIT Application Architect SOA/Integration Architect IBM Global Services February 2003  –  April 2008  (5 years 3 months) SOA/Integration Architect IBM Global Services February 2003  –  April 2008  (5 years 3 months) Solution Architect/J2EE Architect Compuware Corporation February 2000  –  February 2003  (3 years 1 month) Solution Architect/J2EE Architect Compuware Corporation February 2000  –  February 2003  (3 years 1 month) Java/J2EE Developer Kaiser Permanente 2000  –  2000  (less than a year) Java/J2EE Developer Kaiser Permanente 2000  –  2000  (less than a year) Skills Integration Solution Architecture SOA Software Documentation Enterprise Architecture EAI Java Enterprise Edition Agile Methodologies ESB Web Services SDLC Websphere Application Architecture Software Development Software Project... Middleware Requirements Analysis Architecture Cloud Computing IT Strategy TIBCO WebSphere Application... SQL See 8+     See less Skills  Integration Solution Architecture SOA Software Documentation Enterprise Architecture EAI Java Enterprise Edition Agile Methodologies ESB Web Services SDLC Websphere Application Architecture Software Development Software Project... Middleware Requirements Analysis Architecture Cloud Computing IT Strategy TIBCO WebSphere Application... SQL See 8+     See less Integration Solution Architecture SOA Software Documentation Enterprise Architecture EAI Java Enterprise Edition Agile Methodologies ESB Web Services SDLC Websphere Application Architecture Software Development Software Project... Middleware Requirements Analysis Architecture Cloud Computing IT Strategy TIBCO WebSphere Application... SQL See 8+     See less Integration Solution Architecture SOA Software Documentation Enterprise Architecture EAI Java Enterprise Edition Agile Methodologies ESB Web Services SDLC Websphere Application Architecture Software Development Software Project... Middleware Requirements Analysis Architecture Cloud Computing IT Strategy TIBCO WebSphere Application... SQL See 8+     See less Education Indian Institute of Technology, Kharagpur MS,  Software Engineering Jamnalal Bajaj Institute of Management Studies MBA,  Finance Jawaharlal Nehru University, New Delhi BS,  Engineering Indian Institute of Technology, Kharagpur MS,  Software Engineering Indian Institute of Technology, Kharagpur MS,  Software Engineering Indian Institute of Technology, Kharagpur MS,  Software Engineering Jamnalal Bajaj Institute of Management Studies MBA,  Finance Jamnalal Bajaj Institute of Management Studies MBA,  Finance Jamnalal Bajaj Institute of Management Studies MBA,  Finance Jawaharlal Nehru University, New Delhi BS,  Engineering Jawaharlal Nehru University, New Delhi BS,  Engineering Jawaharlal Nehru University, New Delhi BS,  Engineering ", "Experience Client Technical Leader IBM January 2014  – Present (1 year 8 months) Richmond, Virginia Client Technical Leader IBM January 2014  – Present (1 year 8 months) Richmond, Virginia Client Technical Leader IBM January 2014  – Present (1 year 8 months) Richmond, Virginia Skills SOA Business Intelligence Data Warehousing Solution Architecture Enterprise Architecture Cloud Computing IT Strategy Integration Software Development Enterprise Software Business Analysis ETL Software Project... Application Architecture Requirements Analysis Websphere Databases Agile Methodologies DB2 Web Services Pre-sales PMP Big data architectures Data virtualization WebSphere See 10+     See less Skills  SOA Business Intelligence Data Warehousing Solution Architecture Enterprise Architecture Cloud Computing IT Strategy Integration Software Development Enterprise Software Business Analysis ETL Software Project... Application Architecture Requirements Analysis Websphere Databases Agile Methodologies DB2 Web Services Pre-sales PMP Big data architectures Data virtualization WebSphere See 10+     See less SOA Business Intelligence Data Warehousing Solution Architecture Enterprise Architecture Cloud Computing IT Strategy Integration Software Development Enterprise Software Business Analysis ETL Software Project... Application Architecture Requirements Analysis Websphere Databases Agile Methodologies DB2 Web Services Pre-sales PMP Big data architectures Data virtualization WebSphere See 10+     See less SOA Business Intelligence Data Warehousing Solution Architecture Enterprise Architecture Cloud Computing IT Strategy Integration Software Development Enterprise Software Business Analysis ETL Software Project... Application Architecture Requirements Analysis Websphere Databases Agile Methodologies DB2 Web Services Pre-sales PMP Big data architectures Data virtualization WebSphere See 10+     See less Education University of Virginia Master of Science (MS) 1975  – 1977 Case Western Reserve University BA University of Virginia Master of Science (MS) 1975  – 1977 University of Virginia Master of Science (MS) 1975  – 1977 University of Virginia Master of Science (MS) 1975  – 1977 Case Western Reserve University BA Case Western Reserve University BA Case Western Reserve University BA Honors & Awards Outstanding Technical Achievement Award IBM April 2012 Outstanding Technical Achievement Award in appreciation for Travel & Transportation Leadership Speaker, Agile Business Intelligence IBM Academy of Technology May 2007 IBM First Agile Methods and Practices Conference Outstanding Technical Achievement Award IBM April 2012 Outstanding Technical Achievement Award in appreciation for Travel & Transportation Leadership Outstanding Technical Achievement Award IBM April 2012 Outstanding Technical Achievement Award in appreciation for Travel & Transportation Leadership Outstanding Technical Achievement Award IBM April 2012 Outstanding Technical Achievement Award in appreciation for Travel & Transportation Leadership Speaker, Agile Business Intelligence IBM Academy of Technology May 2007 IBM First Agile Methods and Practices Conference Speaker, Agile Business Intelligence IBM Academy of Technology May 2007 IBM First Agile Methods and Practices Conference Speaker, Agile Business Intelligence IBM Academy of Technology May 2007 IBM First Agile Methods and Practices Conference ", "Experience SOA Architect IBM SOA Architect IBM SOA Architect IBM ", "Summary Specialties:Specialist in using IBM's SOA product stack. Summary Specialties:Specialist in using IBM's SOA product stack. Specialties:Specialist in using IBM's SOA product stack. Specialties:Specialist in using IBM's SOA product stack. Experience Integration / SOA Architect IBM July 2011  – Present (4 years 2 months) Minneapolis IT Architect IBM India July 2007  – Present (8 years 2 months) Currently working as SOA Architect with expertise on IBM SOA stack. Senior Systems Analyst Eon Technologies July 2000  –  July 2007  (7 years 1 month) Business/Technical Analyst Visa Europe, Basingstoke, UK November 2005  –  October 2006  (1 year) IT Consultant - DBS Bank Singapore/Hong Kong Siebel Systems October 2004  –  June 2005  (9 months) Technical consultant for design and implementation of internet banking application using Eontec's multi-channel J2EE banking software framework. IT Consultant Bankers' Automated Clearing Services, London, UK May 2004  –  October 2004  (6 months) Designing and implementation of Java/J2EE solutions, performance improvements of existing applications. Technical Consultant Eontec, Ireland January 2001  –  December 2001  (1 year) Worked at EBS, Ireland for the implementation of Banking applications using Eontec's multi-channel J2EE banking software framework. Integration / SOA Architect IBM July 2011  – Present (4 years 2 months) Minneapolis Integration / SOA Architect IBM July 2011  – Present (4 years 2 months) Minneapolis IT Architect IBM India July 2007  – Present (8 years 2 months) Currently working as SOA Architect with expertise on IBM SOA stack. IT Architect IBM India July 2007  – Present (8 years 2 months) Currently working as SOA Architect with expertise on IBM SOA stack. Senior Systems Analyst Eon Technologies July 2000  –  July 2007  (7 years 1 month) Senior Systems Analyst Eon Technologies July 2000  –  July 2007  (7 years 1 month) Business/Technical Analyst Visa Europe, Basingstoke, UK November 2005  –  October 2006  (1 year) Business/Technical Analyst Visa Europe, Basingstoke, UK November 2005  –  October 2006  (1 year) IT Consultant - DBS Bank Singapore/Hong Kong Siebel Systems October 2004  –  June 2005  (9 months) Technical consultant for design and implementation of internet banking application using Eontec's multi-channel J2EE banking software framework. IT Consultant - DBS Bank Singapore/Hong Kong Siebel Systems October 2004  –  June 2005  (9 months) Technical consultant for design and implementation of internet banking application using Eontec's multi-channel J2EE banking software framework. IT Consultant Bankers' Automated Clearing Services, London, UK May 2004  –  October 2004  (6 months) Designing and implementation of Java/J2EE solutions, performance improvements of existing applications. IT Consultant Bankers' Automated Clearing Services, London, UK May 2004  –  October 2004  (6 months) Designing and implementation of Java/J2EE solutions, performance improvements of existing applications. Technical Consultant Eontec, Ireland January 2001  –  December 2001  (1 year) Worked at EBS, Ireland for the implementation of Banking applications using Eontec's multi-channel J2EE banking software framework. Technical Consultant Eontec, Ireland January 2001  –  December 2001  (1 year) Worked at EBS, Ireland for the implementation of Banking applications using Eontec's multi-channel J2EE banking software framework. Skills System Architecture SOA WebSphere Integration... WebSphere Process Server High Availability Java Enterprise Edition Websphere Virtualization Message Queue JPA ESB Skills  System Architecture SOA WebSphere Integration... WebSphere Process Server High Availability Java Enterprise Edition Websphere Virtualization Message Queue JPA ESB System Architecture SOA WebSphere Integration... WebSphere Process Server High Availability Java Enterprise Edition Websphere Virtualization Message Queue JPA ESB System Architecture SOA WebSphere Integration... WebSphere Process Server High Availability Java Enterprise Edition Websphere Virtualization Message Queue JPA ESB Education Maharshi Dayanand University Master of Science (M.Sc.),  Computer Science 2004  – 2007 Maharshi Dayanand University Master of Science (M.Sc.),  Computer Science 2004  – 2007 Maharshi Dayanand University Master of Science (M.Sc.),  Computer Science 2004  – 2007 Maharshi Dayanand University Master of Science (M.Sc.),  Computer Science 2004  – 2007 ", "Experience SOA Architect IBM Global Services November 2007  – Present (7 years 10 months) SOA Architect American Express 2009  –  2010  (1 year) SOA Architect IBM Global Services November 2007  – Present (7 years 10 months) SOA Architect IBM Global Services November 2007  – Present (7 years 10 months) SOA Architect American Express 2009  –  2010  (1 year) SOA Architect American Express 2009  –  2010  (1 year) Skills SOA Websphere Enterprise Architecture SDLC Solution Architecture Java Enterprise Edition Skills  SOA Websphere Enterprise Architecture SDLC Solution Architecture Java Enterprise Edition SOA Websphere Enterprise Architecture SDLC Solution Architecture Java Enterprise Edition SOA Websphere Enterprise Architecture SDLC Solution Architecture Java Enterprise Edition Education Acharya Nagarjuna University MCA,  Computers 1995  – 1998 Acharya Nagarjuna University MCA,  Computers 1995  – 1998 Acharya Nagarjuna University MCA,  Computers 1995  – 1998 Acharya Nagarjuna University MCA,  Computers 1995  – 1998 ", "Experience IT Architect, SOA Architect IBM IT Architect, SOA Architect IBM IT Architect, SOA Architect IBM Skills Enterprise Architecture IT Strategy Solution Architecture Integration SOA Skills  Enterprise Architecture IT Strategy Solution Architecture Integration SOA Enterprise Architecture IT Strategy Solution Architecture Integration SOA Enterprise Architecture IT Strategy Solution Architecture Integration SOA ", "Experience SOA Architect IBM SOA Architect IBM SOA Architect IBM Education University of Kentucky University of Kentucky University of Kentucky University of Kentucky ", "Experience SOA Architect IBM SOA Architect IBM SOA Architect IBM ", "Summary I'm a perfectionist person that I feel a pasion by IT Systems, be happy with what I do. Summary I'm a perfectionist person that I feel a pasion by IT Systems, be happy with what I do. I'm a perfectionist person that I feel a pasion by IT Systems, be happy with what I do. I'm a perfectionist person that I feel a pasion by IT Systems, be happy with what I do. Experience SOA Architect & IBM Instructor NOISOFT 2005  – Present (10 years) Mexico City Area, Mexico Generate architectures in distributed Systems in banks, insurance, .. and manage traning in IT tecnologies as IBM, programming languages, .. IT Specialist Wesphere Message Broker HSBC 2011  –  2012  (1 year) Mexico Java Senior Essential Studio January 2010  –  November 2010  (11 months) Develop an Assurance System for manage the workflow for the client managment. SOA Architect & IBM Instructor NOISOFT 2005  – Present (10 years) Mexico City Area, Mexico Generate architectures in distributed Systems in banks, insurance, .. and manage traning in IT tecnologies as IBM, programming languages, .. SOA Architect & IBM Instructor NOISOFT 2005  – Present (10 years) Mexico City Area, Mexico Generate architectures in distributed Systems in banks, insurance, .. and manage traning in IT tecnologies as IBM, programming languages, .. IT Specialist Wesphere Message Broker HSBC 2011  –  2012  (1 year) Mexico IT Specialist Wesphere Message Broker HSBC 2011  –  2012  (1 year) Mexico Java Senior Essential Studio January 2010  –  November 2010  (11 months) Develop an Assurance System for manage the workflow for the client managment. Java Senior Essential Studio January 2010  –  November 2010  (11 months) Develop an Assurance System for manage the workflow for the client managment. Languages English Professional working proficiency Spanish Native or bilingual proficiency Japanese Elementary proficiency English Professional working proficiency Spanish Native or bilingual proficiency Japanese Elementary proficiency English Professional working proficiency Spanish Native or bilingual proficiency Japanese Elementary proficiency Professional working proficiency Native or bilingual proficiency Elementary proficiency Skills WebSphere Message Broker Java SOA WebSphere MQ Java Enterprise Edition WebSphere Application... Web Services XML Enterprise Architecture Websphere Registry and... Software Development UML Integration Architectures SQL Linux JavaScript Solution Architecture Oracle Rational Build Forge Rational Team Concert Rational Functional... Rational Performance... zSeries AIX WS C++ ESQL DB2 RUP Methodologies IBM Tivoli CSS3 Datastage InfoSphere Data... COBOL JCL TSO Solaris Scrum Tivoli Storage Manager InfoSphere Big Insights InfoSphere MDM Spring, Faces,... InfoSphere : DataStage... Rational: Build Forge -... See 30+     See less Skills  WebSphere Message Broker Java SOA WebSphere MQ Java Enterprise Edition WebSphere Application... Web Services XML Enterprise Architecture Websphere Registry and... Software Development UML Integration Architectures SQL Linux JavaScript Solution Architecture Oracle Rational Build Forge Rational Team Concert Rational Functional... Rational Performance... zSeries AIX WS C++ ESQL DB2 RUP Methodologies IBM Tivoli CSS3 Datastage InfoSphere Data... COBOL JCL TSO Solaris Scrum Tivoli Storage Manager InfoSphere Big Insights InfoSphere MDM Spring, Faces,... InfoSphere : DataStage... Rational: Build Forge -... See 30+     See less WebSphere Message Broker Java SOA WebSphere MQ Java Enterprise Edition WebSphere Application... Web Services XML Enterprise Architecture Websphere Registry and... Software Development UML Integration Architectures SQL Linux JavaScript Solution Architecture Oracle Rational Build Forge Rational Team Concert Rational Functional... Rational Performance... zSeries AIX WS C++ ESQL DB2 RUP Methodologies IBM Tivoli CSS3 Datastage InfoSphere Data... COBOL JCL TSO Solaris Scrum Tivoli Storage Manager InfoSphere Big Insights InfoSphere MDM Spring, Faces,... InfoSphere : DataStage... Rational: Build Forge -... See 30+     See less WebSphere Message Broker Java SOA WebSphere MQ Java Enterprise Edition WebSphere Application... Web Services XML Enterprise Architecture Websphere Registry and... Software Development UML Integration Architectures SQL Linux JavaScript Solution Architecture Oracle Rational Build Forge Rational Team Concert Rational Functional... Rational Performance... zSeries AIX WS C++ ESQL DB2 RUP Methodologies IBM Tivoli CSS3 Datastage InfoSphere Data... COBOL JCL TSO Solaris Scrum Tivoli Storage Manager InfoSphere Big Insights InfoSphere MDM Spring, Faces,... InfoSphere : DataStage... Rational: Build Forge -... See 30+     See less Education Instituto Politécnico Nacional, ESCOM Engineer's degree,  Systems Engineering 2001  – 2005 Manage the most modern aspects of the IT Systems and some aspects about the electrical circuits. Activities and Societies:  Project Presentations IBM Instituto Politécnico Nacional, ESCOM Engineer's degree,  Systems Engineering 2001  – 2005 Manage the most modern aspects of the IT Systems and some aspects about the electrical circuits. Activities and Societies:  Project Presentations Instituto Politécnico Nacional, ESCOM Engineer's degree,  Systems Engineering 2001  – 2005 Manage the most modern aspects of the IT Systems and some aspects about the electrical circuits. Activities and Societies:  Project Presentations Instituto Politécnico Nacional, ESCOM Engineer's degree,  Systems Engineering 2001  – 2005 Manage the most modern aspects of the IT Systems and some aspects about the electrical circuits. Activities and Societies:  Project Presentations IBM IBM IBM ", "Skills JSP Java Enterprise Edition TIBCO Web Services SOA Architecture Unix Core Java Skills  JSP Java Enterprise Edition TIBCO Web Services SOA Architecture Unix Core Java JSP Java Enterprise Edition TIBCO Web Services SOA Architecture Unix Core Java JSP Java Enterprise Edition TIBCO Web Services SOA Architecture Unix Core Java ", "Summary Help organizations become agile using SOA/Web Services, build SOA solution using \"vendor-neutral\" approach. \n \nExpertise in implementing BPM using IBM Websphere Process Server / WESB technologies. \n \nIBM certified SOA solution designer and AWS certified solution architect,hand's on building solutions using AWS Cloud infrastructure. \n \nOther interests include complex event processing (CEP),SaaS & Big Data. \n \nSpecialties: Due diligence for SOA projects, WPS/WESB implementation,AWS Solution Architect. Summary Help organizations become agile using SOA/Web Services, build SOA solution using \"vendor-neutral\" approach. \n \nExpertise in implementing BPM using IBM Websphere Process Server / WESB technologies. \n \nIBM certified SOA solution designer and AWS certified solution architect,hand's on building solutions using AWS Cloud infrastructure. \n \nOther interests include complex event processing (CEP),SaaS & Big Data. \n \nSpecialties: Due diligence for SOA projects, WPS/WESB implementation,AWS Solution Architect. Help organizations become agile using SOA/Web Services, build SOA solution using \"vendor-neutral\" approach. \n \nExpertise in implementing BPM using IBM Websphere Process Server / WESB technologies. \n \nIBM certified SOA solution designer and AWS certified solution architect,hand's on building solutions using AWS Cloud infrastructure. \n \nOther interests include complex event processing (CEP),SaaS & Big Data. \n \nSpecialties: Due diligence for SOA projects, WPS/WESB implementation,AWS Solution Architect. Help organizations become agile using SOA/Web Services, build SOA solution using \"vendor-neutral\" approach. \n \nExpertise in implementing BPM using IBM Websphere Process Server / WESB technologies. \n \nIBM certified SOA solution designer and AWS certified solution architect,hand's on building solutions using AWS Cloud infrastructure. \n \nOther interests include complex event processing (CEP),SaaS & Big Data. \n \nSpecialties: Due diligence for SOA projects, WPS/WESB implementation,AWS Solution Architect. Experience Technical Lead UnitedHealth Group March 2011  – Present (4 years 6 months) Santa Ana, CA Working on IBM Websphere SOA primarily on Websphere Process Server 7.x/ WESB 7.x /WMQFTE 7.x/ Websphere Business Monitor 7.x/ WTX 8.3.x SOA Architect IBM Business partner November 2008  –  March 2011  (2 years 5 months) Convert the business usecases into technical artifacts and solutions. \n \nDesign and implement business flows using various SCA components like BPEL/HTM/business rules in Websphere Integration developer IDE. \n \nRecommend best practises for deployment topology in Websphere process server/WESB7.x SOA Architect Satyam January 2008  –  November 2008  (11 months) Create prototypes and evaluated new concepts and technologies to implement the most appropriate SOA solution. \n \nWorked as system architect using Websphere Process Server 6.1/Websphere ESB 6.1 for Citigroup-GWM. \n \nProposed different deployment topologies for high volume transaction applications. Solutions Architect Jean Martin Inc January 2007  –  December 2007  (1 year) Worked as Solutions Architect providing end-end solutions using IBM products. \n \nDeveloped proposals to implement SOA using IBM Websphere Stack of products. \n \nImplemented POC's/POT's using IBM Websphere Process Server 6.x/WESB for technical evaluation. SOA Architect IBM December 2005  –  December 2006  (1 year 1 month) Technology Consulting  \n \nSOA development and Implementation using IBM SOA suite of products and IBM Certified SOA Solution Designer. \n \nTraveled across Asia-pacific to implement and train customers to adopt IBM SOA Solution using Websphere Process Server 6.x,Websphere ESB 6.x. Project Lead Satyam February 2003  –  December 2005  (2 years 11 months) As an Technical Lead designed,developed applications using SOA and Web Services(WSDL/SOAP/XML). \n \nConversant in using Apache, IBM's SOAP Engines.Websphere Web Services Gateway(WSGW) and UDDI registries. \n \nDeveloped Vehicle Information Services Architecture based on Web Services for Volkswagen of America. \n \nWorked as consultant for Royal Bank of Canada,Toronto in legacy modernization initiative to convert existing assets in IBM IMS systems into Web services based model using IBM Websphere integration stack. Web Services Develolper Webify Solutions May 2001  –  February 2003  (1 year 10 months) Webify Solutions was startup focused in developing vertical SOA Products/Solutions using SOBA. \n \nInvolved in developing architecture and framework using Open Source tools like Apache AXIS,JBoss/Websphere5.x,Tapestry,Maven and Apache Commons. \n \nDeveloped Web Services Implementation for transforming HIPAA 837 documents to Excel format. \n \nWebify Solutions was acquired by IBM during Aug'2006 , Webify Fabric product is part of Websphere portfolio. Technical Lead CKS Business Supports August 1996  –  April 2001  (4 years 9 months) Worked in startup as Java/J2EE programmer \n \nEarly adopter of services oriented application development \n \nUtilized mostly open source tools for development,like eclipse,tomcat& apache frameworks. Technical Lead UnitedHealth Group March 2011  – Present (4 years 6 months) Santa Ana, CA Working on IBM Websphere SOA primarily on Websphere Process Server 7.x/ WESB 7.x /WMQFTE 7.x/ Websphere Business Monitor 7.x/ WTX 8.3.x Technical Lead UnitedHealth Group March 2011  – Present (4 years 6 months) Santa Ana, CA Working on IBM Websphere SOA primarily on Websphere Process Server 7.x/ WESB 7.x /WMQFTE 7.x/ Websphere Business Monitor 7.x/ WTX 8.3.x SOA Architect IBM Business partner November 2008  –  March 2011  (2 years 5 months) Convert the business usecases into technical artifacts and solutions. \n \nDesign and implement business flows using various SCA components like BPEL/HTM/business rules in Websphere Integration developer IDE. \n \nRecommend best practises for deployment topology in Websphere process server/WESB7.x SOA Architect IBM Business partner November 2008  –  March 2011  (2 years 5 months) Convert the business usecases into technical artifacts and solutions. \n \nDesign and implement business flows using various SCA components like BPEL/HTM/business rules in Websphere Integration developer IDE. \n \nRecommend best practises for deployment topology in Websphere process server/WESB7.x SOA Architect Satyam January 2008  –  November 2008  (11 months) Create prototypes and evaluated new concepts and technologies to implement the most appropriate SOA solution. \n \nWorked as system architect using Websphere Process Server 6.1/Websphere ESB 6.1 for Citigroup-GWM. \n \nProposed different deployment topologies for high volume transaction applications. SOA Architect Satyam January 2008  –  November 2008  (11 months) Create prototypes and evaluated new concepts and technologies to implement the most appropriate SOA solution. \n \nWorked as system architect using Websphere Process Server 6.1/Websphere ESB 6.1 for Citigroup-GWM. \n \nProposed different deployment topologies for high volume transaction applications. Solutions Architect Jean Martin Inc January 2007  –  December 2007  (1 year) Worked as Solutions Architect providing end-end solutions using IBM products. \n \nDeveloped proposals to implement SOA using IBM Websphere Stack of products. \n \nImplemented POC's/POT's using IBM Websphere Process Server 6.x/WESB for technical evaluation. Solutions Architect Jean Martin Inc January 2007  –  December 2007  (1 year) Worked as Solutions Architect providing end-end solutions using IBM products. \n \nDeveloped proposals to implement SOA using IBM Websphere Stack of products. \n \nImplemented POC's/POT's using IBM Websphere Process Server 6.x/WESB for technical evaluation. SOA Architect IBM December 2005  –  December 2006  (1 year 1 month) Technology Consulting  \n \nSOA development and Implementation using IBM SOA suite of products and IBM Certified SOA Solution Designer. \n \nTraveled across Asia-pacific to implement and train customers to adopt IBM SOA Solution using Websphere Process Server 6.x,Websphere ESB 6.x. SOA Architect IBM December 2005  –  December 2006  (1 year 1 month) Technology Consulting  \n \nSOA development and Implementation using IBM SOA suite of products and IBM Certified SOA Solution Designer. \n \nTraveled across Asia-pacific to implement and train customers to adopt IBM SOA Solution using Websphere Process Server 6.x,Websphere ESB 6.x. Project Lead Satyam February 2003  –  December 2005  (2 years 11 months) As an Technical Lead designed,developed applications using SOA and Web Services(WSDL/SOAP/XML). \n \nConversant in using Apache, IBM's SOAP Engines.Websphere Web Services Gateway(WSGW) and UDDI registries. \n \nDeveloped Vehicle Information Services Architecture based on Web Services for Volkswagen of America. \n \nWorked as consultant for Royal Bank of Canada,Toronto in legacy modernization initiative to convert existing assets in IBM IMS systems into Web services based model using IBM Websphere integration stack. Project Lead Satyam February 2003  –  December 2005  (2 years 11 months) As an Technical Lead designed,developed applications using SOA and Web Services(WSDL/SOAP/XML). \n \nConversant in using Apache, IBM's SOAP Engines.Websphere Web Services Gateway(WSGW) and UDDI registries. \n \nDeveloped Vehicle Information Services Architecture based on Web Services for Volkswagen of America. \n \nWorked as consultant for Royal Bank of Canada,Toronto in legacy modernization initiative to convert existing assets in IBM IMS systems into Web services based model using IBM Websphere integration stack. Web Services Develolper Webify Solutions May 2001  –  February 2003  (1 year 10 months) Webify Solutions was startup focused in developing vertical SOA Products/Solutions using SOBA. \n \nInvolved in developing architecture and framework using Open Source tools like Apache AXIS,JBoss/Websphere5.x,Tapestry,Maven and Apache Commons. \n \nDeveloped Web Services Implementation for transforming HIPAA 837 documents to Excel format. \n \nWebify Solutions was acquired by IBM during Aug'2006 , Webify Fabric product is part of Websphere portfolio. Web Services Develolper Webify Solutions May 2001  –  February 2003  (1 year 10 months) Webify Solutions was startup focused in developing vertical SOA Products/Solutions using SOBA. \n \nInvolved in developing architecture and framework using Open Source tools like Apache AXIS,JBoss/Websphere5.x,Tapestry,Maven and Apache Commons. \n \nDeveloped Web Services Implementation for transforming HIPAA 837 documents to Excel format. \n \nWebify Solutions was acquired by IBM during Aug'2006 , Webify Fabric product is part of Websphere portfolio. Technical Lead CKS Business Supports August 1996  –  April 2001  (4 years 9 months) Worked in startup as Java/J2EE programmer \n \nEarly adopter of services oriented application development \n \nUtilized mostly open source tools for development,like eclipse,tomcat& apache frameworks. Technical Lead CKS Business Supports August 1996  –  April 2001  (4 years 9 months) Worked in startup as Java/J2EE programmer \n \nEarly adopter of services oriented application development \n \nUtilized mostly open source tools for development,like eclipse,tomcat& apache frameworks. Skills SOA Enterprise Architecture Solution Architecture EAI Agile Methodologies Java Enterprise Edition Cloud Computing Web Services Software Project... ESB SDLC Integration Requirements Analysis Websphere IT Strategy WebSphere ESB See 1+     See less Skills  SOA Enterprise Architecture Solution Architecture EAI Agile Methodologies Java Enterprise Edition Cloud Computing Web Services Software Project... ESB SDLC Integration Requirements Analysis Websphere IT Strategy WebSphere ESB See 1+     See less SOA Enterprise Architecture Solution Architecture EAI Agile Methodologies Java Enterprise Edition Cloud Computing Web Services Software Project... ESB SDLC Integration Requirements Analysis Websphere IT Strategy WebSphere ESB See 1+     See less SOA Enterprise Architecture Solution Architecture EAI Agile Methodologies Java Enterprise Edition Cloud Computing Web Services Software Project... ESB SDLC Integration Requirements Analysis Websphere IT Strategy WebSphere ESB See 1+     See less Education Madurai Kamaraj University Bachelors of Engineering,  Mechanical Engineering 1992  – 1996 Sri Ramakrishna Mission 1990 Madurai Kamaraj University Bachelors of Engineering,  Mechanical Engineering 1992  – 1996 Madurai Kamaraj University Bachelors of Engineering,  Mechanical Engineering 1992  – 1996 Madurai Kamaraj University Bachelors of Engineering,  Mechanical Engineering 1992  – 1996 Sri Ramakrishna Mission 1990 Sri Ramakrishna Mission 1990 Sri Ramakrishna Mission 1990 ", "Skills Websphere BPMN WebSphere Application... WebSphere Process Server SOA Hibernate JBoss Application Server JMS UML Java Enterprise Edition Web Services ESB EJB Java Maven Oracle SOAP Tomcat Scrum See 4+     See less Skills  Websphere BPMN WebSphere Application... WebSphere Process Server SOA Hibernate JBoss Application Server JMS UML Java Enterprise Edition Web Services ESB EJB Java Maven Oracle SOAP Tomcat Scrum See 4+     See less Websphere BPMN WebSphere Application... WebSphere Process Server SOA Hibernate JBoss Application Server JMS UML Java Enterprise Edition Web Services ESB EJB Java Maven Oracle SOAP Tomcat Scrum See 4+     See less Websphere BPMN WebSphere Application... WebSphere Process Server SOA Hibernate JBoss Application Server JMS UML Java Enterprise Edition Web Services ESB EJB Java Maven Oracle SOAP Tomcat Scrum See 4+     See less ", "Summary Senior-certified Executive Architect with 22+ years experience in the architecture, design, development and implementation of solution architectures for various industries that span airlines, telecommunications, banking, Government, healthcare and retail.  \n \nCreative, dynamic, thought-leader, team-player with extensive global experience and strong leadership capabilities. Possesses well rounded skills with keen interest in understanding business issues and customer's problems and demands. \n \nSpecialties: Leadership, CAMS, Service Oriented Architecture (SOA), Cloud Computing, OOA/D, CRM, Consulting and Complex Project Delivery. Summary Senior-certified Executive Architect with 22+ years experience in the architecture, design, development and implementation of solution architectures for various industries that span airlines, telecommunications, banking, Government, healthcare and retail.  \n \nCreative, dynamic, thought-leader, team-player with extensive global experience and strong leadership capabilities. Possesses well rounded skills with keen interest in understanding business issues and customer's problems and demands. \n \nSpecialties: Leadership, CAMS, Service Oriented Architecture (SOA), Cloud Computing, OOA/D, CRM, Consulting and Complex Project Delivery. Senior-certified Executive Architect with 22+ years experience in the architecture, design, development and implementation of solution architectures for various industries that span airlines, telecommunications, banking, Government, healthcare and retail.  \n \nCreative, dynamic, thought-leader, team-player with extensive global experience and strong leadership capabilities. Possesses well rounded skills with keen interest in understanding business issues and customer's problems and demands. \n \nSpecialties: Leadership, CAMS, Service Oriented Architecture (SOA), Cloud Computing, OOA/D, CRM, Consulting and Complex Project Delivery. Senior-certified Executive Architect with 22+ years experience in the architecture, design, development and implementation of solution architectures for various industries that span airlines, telecommunications, banking, Government, healthcare and retail.  \n \nCreative, dynamic, thought-leader, team-player with extensive global experience and strong leadership capabilities. Possesses well rounded skills with keen interest in understanding business issues and customer's problems and demands. \n \nSpecialties: Leadership, CAMS, Service Oriented Architecture (SOA), Cloud Computing, OOA/D, CRM, Consulting and Complex Project Delivery. Experience Executive Architect - Enterprise Initiatives (Cloud, Analytics, Mobile, Social) IBM July 2013  – Present (2 years 2 months) United States, Texas, Austin Software Architect Leader, Middle East and Africa - Software Group IBM July 2011  –  July 2013  (2 years 1 month) United Arab Emirates Executive IT Architect - SOA IBM July 2002  –  January 2012  (9 years 7 months) Senior SOA Architect IBM June 2005  –  June 2008  (3 years 1 month) Managing Consultant /Principal Consultant IBM and PricewaterhouseCoopers March 1999  –  June 2005  (6 years 4 months) Senior Managing Consultant IBM Global Business Services 2002  –  2005  (3 years) Principal Consultant PricewaterhouseCoopers 1999  –  2002  (3 years) Executive Architect - Enterprise Initiatives (Cloud, Analytics, Mobile, Social) IBM July 2013  – Present (2 years 2 months) United States, Texas, Austin Executive Architect - Enterprise Initiatives (Cloud, Analytics, Mobile, Social) IBM July 2013  – Present (2 years 2 months) United States, Texas, Austin Software Architect Leader, Middle East and Africa - Software Group IBM July 2011  –  July 2013  (2 years 1 month) United Arab Emirates Software Architect Leader, Middle East and Africa - Software Group IBM July 2011  –  July 2013  (2 years 1 month) United Arab Emirates Executive IT Architect - SOA IBM July 2002  –  January 2012  (9 years 7 months) Executive IT Architect - SOA IBM July 2002  –  January 2012  (9 years 7 months) Senior SOA Architect IBM June 2005  –  June 2008  (3 years 1 month) Senior SOA Architect IBM June 2005  –  June 2008  (3 years 1 month) Managing Consultant /Principal Consultant IBM and PricewaterhouseCoopers March 1999  –  June 2005  (6 years 4 months) Managing Consultant /Principal Consultant IBM and PricewaterhouseCoopers March 1999  –  June 2005  (6 years 4 months) Senior Managing Consultant IBM Global Business Services 2002  –  2005  (3 years) Senior Managing Consultant IBM Global Business Services 2002  –  2005  (3 years) Principal Consultant PricewaterhouseCoopers 1999  –  2002  (3 years) Principal Consultant PricewaterhouseCoopers 1999  –  2002  (3 years) Languages Arabic Arabic Arabic Skills Solution Architecture SOA Enterprise Architecture Cloud Computing Application Architecture Middleware EAI Technical Architecture Enterprise Software Java Enterprise Edition IT Strategy ESB TOGAF CRM Technical Leadership Integration Architecture Web Services Leadership SOA Governance Master Data Management Software Engineering Java Agile Methodologies Object Oriented Design See 9+     See less Skills  Solution Architecture SOA Enterprise Architecture Cloud Computing Application Architecture Middleware EAI Technical Architecture Enterprise Software Java Enterprise Edition IT Strategy ESB TOGAF CRM Technical Leadership Integration Architecture Web Services Leadership SOA Governance Master Data Management Software Engineering Java Agile Methodologies Object Oriented Design See 9+     See less Solution Architecture SOA Enterprise Architecture Cloud Computing Application Architecture Middleware EAI Technical Architecture Enterprise Software Java Enterprise Edition IT Strategy ESB TOGAF CRM Technical Leadership Integration Architecture Web Services Leadership SOA Governance Master Data Management Software Engineering Java Agile Methodologies Object Oriented Design See 9+     See less Solution Architecture SOA Enterprise Architecture Cloud Computing Application Architecture Middleware EAI Technical Architecture Enterprise Software Java Enterprise Edition IT Strategy ESB TOGAF CRM Technical Leadership Integration Architecture Web Services Leadership SOA Governance Master Data Management Software Engineering Java Agile Methodologies Object Oriented Design See 9+     See less Education DePaul University Doctor of Philosophy (PhD),  CS 2007  – 2012 Northeastern Illinois University MS,  CS 1993  – 1994 Al-Jami'ah Al-Urdunia BS,  CS 1985  – 1989 DePaul University Doctor of Philosophy (PhD),  CS 2007  – 2012 DePaul University Doctor of Philosophy (PhD),  CS 2007  – 2012 DePaul University Doctor of Philosophy (PhD),  CS 2007  – 2012 Northeastern Illinois University MS,  CS 1993  – 1994 Northeastern Illinois University MS,  CS 1993  – 1994 Northeastern Illinois University MS,  CS 1993  – 1994 Al-Jami'ah Al-Urdunia BS,  CS 1985  – 1989 Al-Jami'ah Al-Urdunia BS,  CS 1985  – 1989 Al-Jami'ah Al-Urdunia BS,  CS 1985  – 1989 ", "Summary My primary focus is to design complex solutions that enable existing and new systems to perform automated business functions by scoping all levels of integration (User Access, Application, Extended Enterprise, Process, and Information Integration), considering different aspects of operational costs, security, performance engineering, application development , and systems management. \n \nWith enthusiasm and genuine passion for gaining knowledge and achieving business goals during a 9 years career, including 7 years of IBM working journey, I've acquired a vast experience in delivering SOA and BPM complex solutions that mainly rely on IBM products like WAS, WBM, WPS, WMB, WMQ, iLog/JRuler, and IBM-BPM.  \n \nLocated in different countries including US UK Netherland Argentina India UAE Libya and Egypt, I served wide range of IBM clients in different sectors including e-Gov, Banking, Media/Press, and Telecom with proven records of successful delivery and outstanding technical performance. \n \nEngaged with different organizational levels personas including client representatives in a multicultural environment with wide range of delivery models, I played many technical roles in different areas including service development, integration development, reusable assets development, system administration, product support, client consulting, projects scoping and estimating, tech leadership, and complex solutions architecture. \n \n \nIBM Certified Deployment Professional- Business Process Manager Advanced V7.5.1 (000-271). \nIBM Certified Deployment Professional- WebSphere Application Server Network Deployment V7.0 (000-377) \nIBM Certified Deployment Professional- WebSphere Process Server V7.0 (000-608). \nIBM Certified Solution Developer- WebSphere Integration Developer V6.2 (000-379). \nIBM Certified Application Developer - WebSphere Commerce V7.0 (000-723). Specialties:IBM SOA Suite including : \n- Websphere Process Server. \n- Websphere Enterprise Service Bus. \n- Websphere Message Broker. \n- Websphere MQ.  \n- IBM BPM 7.5.1 Summary My primary focus is to design complex solutions that enable existing and new systems to perform automated business functions by scoping all levels of integration (User Access, Application, Extended Enterprise, Process, and Information Integration), considering different aspects of operational costs, security, performance engineering, application development , and systems management. \n \nWith enthusiasm and genuine passion for gaining knowledge and achieving business goals during a 9 years career, including 7 years of IBM working journey, I've acquired a vast experience in delivering SOA and BPM complex solutions that mainly rely on IBM products like WAS, WBM, WPS, WMB, WMQ, iLog/JRuler, and IBM-BPM.  \n \nLocated in different countries including US UK Netherland Argentina India UAE Libya and Egypt, I served wide range of IBM clients in different sectors including e-Gov, Banking, Media/Press, and Telecom with proven records of successful delivery and outstanding technical performance. \n \nEngaged with different organizational levels personas including client representatives in a multicultural environment with wide range of delivery models, I played many technical roles in different areas including service development, integration development, reusable assets development, system administration, product support, client consulting, projects scoping and estimating, tech leadership, and complex solutions architecture. \n \n \nIBM Certified Deployment Professional- Business Process Manager Advanced V7.5.1 (000-271). \nIBM Certified Deployment Professional- WebSphere Application Server Network Deployment V7.0 (000-377) \nIBM Certified Deployment Professional- WebSphere Process Server V7.0 (000-608). \nIBM Certified Solution Developer- WebSphere Integration Developer V6.2 (000-379). \nIBM Certified Application Developer - WebSphere Commerce V7.0 (000-723). Specialties:IBM SOA Suite including : \n- Websphere Process Server. \n- Websphere Enterprise Service Bus. \n- Websphere Message Broker. \n- Websphere MQ.  \n- IBM BPM 7.5.1 My primary focus is to design complex solutions that enable existing and new systems to perform automated business functions by scoping all levels of integration (User Access, Application, Extended Enterprise, Process, and Information Integration), considering different aspects of operational costs, security, performance engineering, application development , and systems management. \n \nWith enthusiasm and genuine passion for gaining knowledge and achieving business goals during a 9 years career, including 7 years of IBM working journey, I've acquired a vast experience in delivering SOA and BPM complex solutions that mainly rely on IBM products like WAS, WBM, WPS, WMB, WMQ, iLog/JRuler, and IBM-BPM.  \n \nLocated in different countries including US UK Netherland Argentina India UAE Libya and Egypt, I served wide range of IBM clients in different sectors including e-Gov, Banking, Media/Press, and Telecom with proven records of successful delivery and outstanding technical performance. \n \nEngaged with different organizational levels personas including client representatives in a multicultural environment with wide range of delivery models, I played many technical roles in different areas including service development, integration development, reusable assets development, system administration, product support, client consulting, projects scoping and estimating, tech leadership, and complex solutions architecture. \n \n \nIBM Certified Deployment Professional- Business Process Manager Advanced V7.5.1 (000-271). \nIBM Certified Deployment Professional- WebSphere Application Server Network Deployment V7.0 (000-377) \nIBM Certified Deployment Professional- WebSphere Process Server V7.0 (000-608). \nIBM Certified Solution Developer- WebSphere Integration Developer V6.2 (000-379). \nIBM Certified Application Developer - WebSphere Commerce V7.0 (000-723). Specialties:IBM SOA Suite including : \n- Websphere Process Server. \n- Websphere Enterprise Service Bus. \n- Websphere Message Broker. \n- Websphere MQ.  \n- IBM BPM 7.5.1 My primary focus is to design complex solutions that enable existing and new systems to perform automated business functions by scoping all levels of integration (User Access, Application, Extended Enterprise, Process, and Information Integration), considering different aspects of operational costs, security, performance engineering, application development , and systems management. \n \nWith enthusiasm and genuine passion for gaining knowledge and achieving business goals during a 9 years career, including 7 years of IBM working journey, I've acquired a vast experience in delivering SOA and BPM complex solutions that mainly rely on IBM products like WAS, WBM, WPS, WMB, WMQ, iLog/JRuler, and IBM-BPM.  \n \nLocated in different countries including US UK Netherland Argentina India UAE Libya and Egypt, I served wide range of IBM clients in different sectors including e-Gov, Banking, Media/Press, and Telecom with proven records of successful delivery and outstanding technical performance. \n \nEngaged with different organizational levels personas including client representatives in a multicultural environment with wide range of delivery models, I played many technical roles in different areas including service development, integration development, reusable assets development, system administration, product support, client consulting, projects scoping and estimating, tech leadership, and complex solutions architecture. \n \n \nIBM Certified Deployment Professional- Business Process Manager Advanced V7.5.1 (000-271). \nIBM Certified Deployment Professional- WebSphere Application Server Network Deployment V7.0 (000-377) \nIBM Certified Deployment Professional- WebSphere Process Server V7.0 (000-608). \nIBM Certified Solution Developer- WebSphere Integration Developer V6.2 (000-379). \nIBM Certified Application Developer - WebSphere Commerce V7.0 (000-723). Specialties:IBM SOA Suite including : \n- Websphere Process Server. \n- Websphere Enterprise Service Bus. \n- Websphere Message Broker. \n- Websphere MQ.  \n- IBM BPM 7.5.1 Experience Technical Sales Specialist IBM October 2012  – Present (2 years 11 months) Greater New York City Area SOA Architect IBM - AT&T January 2010  –  September 2012  (2 years 9 months) United States SOA Architect IBM July 2005  –  September 2012  (7 years 3 months) Global Delivery ( Egypt , Middle East , USA , UK , Netherland , India ) Independent J2EE service provider iDeliver January 2002  –  June 2005  (3 years 6 months) Egypt Technical Sales Specialist IBM October 2012  – Present (2 years 11 months) Greater New York City Area Technical Sales Specialist IBM October 2012  – Present (2 years 11 months) Greater New York City Area SOA Architect IBM - AT&T January 2010  –  September 2012  (2 years 9 months) United States SOA Architect IBM - AT&T January 2010  –  September 2012  (2 years 9 months) United States SOA Architect IBM July 2005  –  September 2012  (7 years 3 months) Global Delivery ( Egypt , Middle East , USA , UK , Netherland , India ) SOA Architect IBM July 2005  –  September 2012  (7 years 3 months) Global Delivery ( Egypt , Middle East , USA , UK , Netherland , India ) Independent J2EE service provider iDeliver January 2002  –  June 2005  (3 years 6 months) Egypt Independent J2EE service provider iDeliver January 2002  –  June 2005  (3 years 6 months) Egypt Skills WebSphere Application... WebSphere Process Server WebSphere Integration... WebSphere Message Broker Rational Software... Enterprise Architecture Technical Leadership J2EE SOA Middleware J2EE Architecture WebSphere ESB Solution Architecture JMS JAX-WS EJB ESB Application Servers Web Services SOA Governance SOAP Message Broker BPEL JSF Agile Java RUP Pre-sales Business Management Servlets Integration Architecture JDBC Struts Spring Hibernate Software Development UML Integration Architecture EAI Websphere IBM BPM IBM Websphere Commerce Java Enterprise Edition WebSphere Portal Business Process Design Application Architecture WSAD Weblogic Enterprise Software See 35+     See less Skills  WebSphere Application... WebSphere Process Server WebSphere Integration... WebSphere Message Broker Rational Software... Enterprise Architecture Technical Leadership J2EE SOA Middleware J2EE Architecture WebSphere ESB Solution Architecture JMS JAX-WS EJB ESB Application Servers Web Services SOA Governance SOAP Message Broker BPEL JSF Agile Java RUP Pre-sales Business Management Servlets Integration Architecture JDBC Struts Spring Hibernate Software Development UML Integration Architecture EAI Websphere IBM BPM IBM Websphere Commerce Java Enterprise Edition WebSphere Portal Business Process Design Application Architecture WSAD Weblogic Enterprise Software See 35+     See less WebSphere Application... WebSphere Process Server WebSphere Integration... WebSphere Message Broker Rational Software... Enterprise Architecture Technical Leadership J2EE SOA Middleware J2EE Architecture WebSphere ESB Solution Architecture JMS JAX-WS EJB ESB Application Servers Web Services SOA Governance SOAP Message Broker BPEL JSF Agile Java RUP Pre-sales Business Management Servlets Integration Architecture JDBC Struts Spring Hibernate Software Development UML Integration Architecture EAI Websphere IBM BPM IBM Websphere Commerce Java Enterprise Edition WebSphere Portal Business Process Design Application Architecture WSAD Weblogic Enterprise Software See 35+     See less WebSphere Application... WebSphere Process Server WebSphere Integration... WebSphere Message Broker Rational Software... Enterprise Architecture Technical Leadership J2EE SOA Middleware J2EE Architecture WebSphere ESB Solution Architecture JMS JAX-WS EJB ESB Application Servers Web Services SOA Governance SOAP Message Broker BPEL JSF Agile Java RUP Pre-sales Business Management Servlets Integration Architecture JDBC Struts Spring Hibernate Software Development UML Integration Architecture EAI Websphere IBM BPM IBM Websphere Commerce Java Enterprise Edition WebSphere Portal Business Process Design Application Architecture WSAD Weblogic Enterprise Software See 35+     See less Education Cairo University Engineering,  Electronics and Communication 1996  – 2001 Cairo University Engineering,  Electronics and Communication 1996  – 2001 Cairo University Engineering,  Electronics and Communication 1996  – 2001 Cairo University Engineering,  Electronics and Communication 1996  – 2001 ", "Experience SOA Architect IBM SOA Architect IBM SOA Architect IBM Education California State University California State University California State University California State University ", "Experience SOA Architect IBM Global Services SOA Architect IBM Global Services SOA Architect IBM Global Services Education Anna University BTech,  production 1993  – 1996 Anna University BTech,  production 1993  – 1996 Anna University BTech,  production 1993  – 1996 Anna University BTech,  production 1993  – 1996 ", "Experience Executive SOA Architect IBM May 1999  – Present (16 years 4 months) Worldwide SOA Technical Sales IBM January 2006  –  February 2009  (3 years 2 months) Led the Worldwide SOA Demo development strategy with a development team from the IBM China Development lab. Architected and implemented the SOA Demo and Enablement Platform to support this demo strategy - utilizing hardware and software virtualization. Trained thousands of IBM employees on sophisticated solutions, and led the development of a complete SOA end-to-end demo scenario. Engaged directly with major customers on complex architectural problems, patterns and solutions. Worldwide WebSphere Technical Sales IBM January 2005  –  July 2006  (1 year 7 months) Technical Sales leader for Workflow and Business Process Monitor. Led the development, deployment and delivery of deep technical skills and education around major IBM products (WebSphere products) to a worldwide audience. Drove product features through requirements boards, led development of customer facing material for sales and technical sales. Frequently engaged directly with customers world wide on complex sales opportunities. Led numerous technical sales of WebSphere products across various platforms including zSeries (mainframe). Executive Technical Specialist IBM May 1999  –  December 2004  (5 years 8 months) Technical specialist with the WebSphere brand supporting key NE customers. Included understanding cutomer needs, mapping out product solutions, performing POC's, deep technical knowledge of product protfolio, executive briefings and negotations. Sr. IT Architect State Street January 1997  –  May 1999  (2 years 5 months) Senior Architect in the internal messaging division. Evaluated new technologies, architected technology solutions, interfaced with internal customers across all divisions and recommended system enhancements to meet global delivery challanges. Development Manager Computer Associates January 1990  –  January 1997  (7 years 1 month) Development Manager for the IDMS/DC family product line. Project Leader Cullinet Software January 1988  –  January 1990  (2 years 1 month) Project leader managing the implementation of Client Server within the IDMS product family. Software Developer Cullinet Software January 1986  –  January 1988  (2 years 1 month) Software developer responsible for many projects across the IDMS family of products - Data Communications, CICS, Operating Systems, Performance, Data Base, etc. Consultant Computer Task Group January 1985  –  January 1986  (1 year 1 month) Consultant supporting large customers using IDMS, IMS, CICS and more in the New England area. Database Administrator Grumman Data Systems January 1984  –  January 1985  (1 year 1 month) Database administrator supporting IDMS and IMS databases and applications. Communications Systems Analyst Grumman Data Systems January 1982  –  January 1984  (2 years 1 month) Managed and maintained systems running on IBM 8100's and IBM 364x systems. Included systems support, maintenance and programming. Programmer Grumman Data Systems December 1980  –  January 1982  (1 year 2 months) Cobol, RPG II, Assembler, IMS programmer on IBM mainframes and Distributed systems. Executive SOA Architect IBM May 1999  – Present (16 years 4 months) Executive SOA Architect IBM May 1999  – Present (16 years 4 months) Worldwide SOA Technical Sales IBM January 2006  –  February 2009  (3 years 2 months) Led the Worldwide SOA Demo development strategy with a development team from the IBM China Development lab. Architected and implemented the SOA Demo and Enablement Platform to support this demo strategy - utilizing hardware and software virtualization. Trained thousands of IBM employees on sophisticated solutions, and led the development of a complete SOA end-to-end demo scenario. Engaged directly with major customers on complex architectural problems, patterns and solutions. Worldwide SOA Technical Sales IBM January 2006  –  February 2009  (3 years 2 months) Led the Worldwide SOA Demo development strategy with a development team from the IBM China Development lab. Architected and implemented the SOA Demo and Enablement Platform to support this demo strategy - utilizing hardware and software virtualization. Trained thousands of IBM employees on sophisticated solutions, and led the development of a complete SOA end-to-end demo scenario. Engaged directly with major customers on complex architectural problems, patterns and solutions. Worldwide WebSphere Technical Sales IBM January 2005  –  July 2006  (1 year 7 months) Technical Sales leader for Workflow and Business Process Monitor. Led the development, deployment and delivery of deep technical skills and education around major IBM products (WebSphere products) to a worldwide audience. Drove product features through requirements boards, led development of customer facing material for sales and technical sales. Frequently engaged directly with customers world wide on complex sales opportunities. Led numerous technical sales of WebSphere products across various platforms including zSeries (mainframe). Worldwide WebSphere Technical Sales IBM January 2005  –  July 2006  (1 year 7 months) Technical Sales leader for Workflow and Business Process Monitor. Led the development, deployment and delivery of deep technical skills and education around major IBM products (WebSphere products) to a worldwide audience. Drove product features through requirements boards, led development of customer facing material for sales and technical sales. Frequently engaged directly with customers world wide on complex sales opportunities. Led numerous technical sales of WebSphere products across various platforms including zSeries (mainframe). Executive Technical Specialist IBM May 1999  –  December 2004  (5 years 8 months) Technical specialist with the WebSphere brand supporting key NE customers. Included understanding cutomer needs, mapping out product solutions, performing POC's, deep technical knowledge of product protfolio, executive briefings and negotations. Executive Technical Specialist IBM May 1999  –  December 2004  (5 years 8 months) Technical specialist with the WebSphere brand supporting key NE customers. Included understanding cutomer needs, mapping out product solutions, performing POC's, deep technical knowledge of product protfolio, executive briefings and negotations. Sr. IT Architect State Street January 1997  –  May 1999  (2 years 5 months) Senior Architect in the internal messaging division. Evaluated new technologies, architected technology solutions, interfaced with internal customers across all divisions and recommended system enhancements to meet global delivery challanges. Sr. IT Architect State Street January 1997  –  May 1999  (2 years 5 months) Senior Architect in the internal messaging division. Evaluated new technologies, architected technology solutions, interfaced with internal customers across all divisions and recommended system enhancements to meet global delivery challanges. Development Manager Computer Associates January 1990  –  January 1997  (7 years 1 month) Development Manager for the IDMS/DC family product line. Development Manager Computer Associates January 1990  –  January 1997  (7 years 1 month) Development Manager for the IDMS/DC family product line. Project Leader Cullinet Software January 1988  –  January 1990  (2 years 1 month) Project leader managing the implementation of Client Server within the IDMS product family. Project Leader Cullinet Software January 1988  –  January 1990  (2 years 1 month) Project leader managing the implementation of Client Server within the IDMS product family. Software Developer Cullinet Software January 1986  –  January 1988  (2 years 1 month) Software developer responsible for many projects across the IDMS family of products - Data Communications, CICS, Operating Systems, Performance, Data Base, etc. Software Developer Cullinet Software January 1986  –  January 1988  (2 years 1 month) Software developer responsible for many projects across the IDMS family of products - Data Communications, CICS, Operating Systems, Performance, Data Base, etc. Consultant Computer Task Group January 1985  –  January 1986  (1 year 1 month) Consultant supporting large customers using IDMS, IMS, CICS and more in the New England area. Consultant Computer Task Group January 1985  –  January 1986  (1 year 1 month) Consultant supporting large customers using IDMS, IMS, CICS and more in the New England area. Database Administrator Grumman Data Systems January 1984  –  January 1985  (1 year 1 month) Database administrator supporting IDMS and IMS databases and applications. Database Administrator Grumman Data Systems January 1984  –  January 1985  (1 year 1 month) Database administrator supporting IDMS and IMS databases and applications. Communications Systems Analyst Grumman Data Systems January 1982  –  January 1984  (2 years 1 month) Managed and maintained systems running on IBM 8100's and IBM 364x systems. Included systems support, maintenance and programming. Communications Systems Analyst Grumman Data Systems January 1982  –  January 1984  (2 years 1 month) Managed and maintained systems running on IBM 8100's and IBM 364x systems. Included systems support, maintenance and programming. Programmer Grumman Data Systems December 1980  –  January 1982  (1 year 2 months) Cobol, RPG II, Assembler, IMS programmer on IBM mainframes and Distributed systems. Programmer Grumman Data Systems December 1980  –  January 1982  (1 year 2 months) Cobol, RPG II, Assembler, IMS programmer on IBM mainframes and Distributed systems. Skills Websphere Middleware SOA ESB Data Center EAI WebSphere Application... WebSphere Process Server Solution Architecture Enterprise Architecture Java Enterprise Edition Performance Tuning Mainframe COBOL Cloud Computing DB2 BPEL Distributed Systems CICS See 4+     See less Skills  Websphere Middleware SOA ESB Data Center EAI WebSphere Application... WebSphere Process Server Solution Architecture Enterprise Architecture Java Enterprise Edition Performance Tuning Mainframe COBOL Cloud Computing DB2 BPEL Distributed Systems CICS See 4+     See less Websphere Middleware SOA ESB Data Center EAI WebSphere Application... WebSphere Process Server Solution Architecture Enterprise Architecture Java Enterprise Edition Performance Tuning Mainframe COBOL Cloud Computing DB2 BPEL Distributed Systems CICS See 4+     See less Websphere Middleware SOA ESB Data Center EAI WebSphere Application... WebSphere Process Server Solution Architecture Enterprise Architecture Java Enterprise Edition Performance Tuning Mainframe COBOL Cloud Computing DB2 BPEL Distributed Systems CICS See 4+     See less Education Boston College Boston College Boston College Boston College ", "Experience SOA Architect IBM SOA Architect IBM SOA Architect IBM ", "Summary Senior Information Technology Business Leader with 18 years of extensive global experience covering multiple areas of Enterprise Information Technologies including several years of business and technical consulting and software sales experience. I bring technical skills and business acumen, together with an entrepreneurial spirit and attitude, to a variety of areas of expertise \n \nHandle complex client engagements: \nExperience in industry domains such as banking and telecom with complex enterprise requirements \nDeliver complex solutions involving multiple IBM hardware and software products \nManage troubled projects to meet client expectation through mid-course correction of the \nsolution, resources and project plan \nNavigate complexities of managing multiple stakeholders with strong references from several key \nclients of IBM \n \nBuild and Manage Profitable Services Businesses \nExperience across the Services spectrum of Management, Sales, Delivery, and Support in multiple Enterprise Technologies at several management levels \nManaged Software Lab Services in Malaysia, Singapore, Philippines and Vietnam \nAssigned as Country Manager for IBM Software Lab Services in Vietnam to build Software Lab \nServices business for IBM Vietnam in 2010 \nTurned around the WebSphere Services (ISSW) business for ASEAN and Malaysia. In these \nroles, I successfully steered the WebSphere Services Practice to revenue growth and profitability \n \nExtensive Regional Expertise and Leadership in AP \nResided and worked extensively throughout Asia Pacific: India, Malaysia, Singapore, Australia, Vietnam, Philippines, Thailand, Indonesia and Korea \nWorked closely with customers, partners, and vendors throughout Asia to build businesses \n \nTechnical Areas of Expertise \nStrong knowledge of IBM software brands such as WebSphere, Rational, Tivoli and Information Management \nTOGAF 8 Certified Enterprise Architect; an IBM Certified ITS and IBM Certified ITA \nA total of 3 published patents Specialties:BPM, Business Process Management, SOA, Service Oriented Architecure, EA, Enterprise Architecture, WebSphere, EAI, Client Relations Summary Senior Information Technology Business Leader with 18 years of extensive global experience covering multiple areas of Enterprise Information Technologies including several years of business and technical consulting and software sales experience. I bring technical skills and business acumen, together with an entrepreneurial spirit and attitude, to a variety of areas of expertise \n \nHandle complex client engagements: \nExperience in industry domains such as banking and telecom with complex enterprise requirements \nDeliver complex solutions involving multiple IBM hardware and software products \nManage troubled projects to meet client expectation through mid-course correction of the \nsolution, resources and project plan \nNavigate complexities of managing multiple stakeholders with strong references from several key \nclients of IBM \n \nBuild and Manage Profitable Services Businesses \nExperience across the Services spectrum of Management, Sales, Delivery, and Support in multiple Enterprise Technologies at several management levels \nManaged Software Lab Services in Malaysia, Singapore, Philippines and Vietnam \nAssigned as Country Manager for IBM Software Lab Services in Vietnam to build Software Lab \nServices business for IBM Vietnam in 2010 \nTurned around the WebSphere Services (ISSW) business for ASEAN and Malaysia. In these \nroles, I successfully steered the WebSphere Services Practice to revenue growth and profitability \n \nExtensive Regional Expertise and Leadership in AP \nResided and worked extensively throughout Asia Pacific: India, Malaysia, Singapore, Australia, Vietnam, Philippines, Thailand, Indonesia and Korea \nWorked closely with customers, partners, and vendors throughout Asia to build businesses \n \nTechnical Areas of Expertise \nStrong knowledge of IBM software brands such as WebSphere, Rational, Tivoli and Information Management \nTOGAF 8 Certified Enterprise Architect; an IBM Certified ITS and IBM Certified ITA \nA total of 3 published patents Specialties:BPM, Business Process Management, SOA, Service Oriented Architecure, EA, Enterprise Architecture, WebSphere, EAI, Client Relations Senior Information Technology Business Leader with 18 years of extensive global experience covering multiple areas of Enterprise Information Technologies including several years of business and technical consulting and software sales experience. I bring technical skills and business acumen, together with an entrepreneurial spirit and attitude, to a variety of areas of expertise \n \nHandle complex client engagements: \nExperience in industry domains such as banking and telecom with complex enterprise requirements \nDeliver complex solutions involving multiple IBM hardware and software products \nManage troubled projects to meet client expectation through mid-course correction of the \nsolution, resources and project plan \nNavigate complexities of managing multiple stakeholders with strong references from several key \nclients of IBM \n \nBuild and Manage Profitable Services Businesses \nExperience across the Services spectrum of Management, Sales, Delivery, and Support in multiple Enterprise Technologies at several management levels \nManaged Software Lab Services in Malaysia, Singapore, Philippines and Vietnam \nAssigned as Country Manager for IBM Software Lab Services in Vietnam to build Software Lab \nServices business for IBM Vietnam in 2010 \nTurned around the WebSphere Services (ISSW) business for ASEAN and Malaysia. In these \nroles, I successfully steered the WebSphere Services Practice to revenue growth and profitability \n \nExtensive Regional Expertise and Leadership in AP \nResided and worked extensively throughout Asia Pacific: India, Malaysia, Singapore, Australia, Vietnam, Philippines, Thailand, Indonesia and Korea \nWorked closely with customers, partners, and vendors throughout Asia to build businesses \n \nTechnical Areas of Expertise \nStrong knowledge of IBM software brands such as WebSphere, Rational, Tivoli and Information Management \nTOGAF 8 Certified Enterprise Architect; an IBM Certified ITS and IBM Certified ITA \nA total of 3 published patents Specialties:BPM, Business Process Management, SOA, Service Oriented Architecure, EA, Enterprise Architecture, WebSphere, EAI, Client Relations Senior Information Technology Business Leader with 18 years of extensive global experience covering multiple areas of Enterprise Information Technologies including several years of business and technical consulting and software sales experience. I bring technical skills and business acumen, together with an entrepreneurial spirit and attitude, to a variety of areas of expertise \n \nHandle complex client engagements: \nExperience in industry domains such as banking and telecom with complex enterprise requirements \nDeliver complex solutions involving multiple IBM hardware and software products \nManage troubled projects to meet client expectation through mid-course correction of the \nsolution, resources and project plan \nNavigate complexities of managing multiple stakeholders with strong references from several key \nclients of IBM \n \nBuild and Manage Profitable Services Businesses \nExperience across the Services spectrum of Management, Sales, Delivery, and Support in multiple Enterprise Technologies at several management levels \nManaged Software Lab Services in Malaysia, Singapore, Philippines and Vietnam \nAssigned as Country Manager for IBM Software Lab Services in Vietnam to build Software Lab \nServices business for IBM Vietnam in 2010 \nTurned around the WebSphere Services (ISSW) business for ASEAN and Malaysia. In these \nroles, I successfully steered the WebSphere Services Practice to revenue growth and profitability \n \nExtensive Regional Expertise and Leadership in AP \nResided and worked extensively throughout Asia Pacific: India, Malaysia, Singapore, Australia, Vietnam, Philippines, Thailand, Indonesia and Korea \nWorked closely with customers, partners, and vendors throughout Asia to build businesses \n \nTechnical Areas of Expertise \nStrong knowledge of IBM software brands such as WebSphere, Rational, Tivoli and Information Management \nTOGAF 8 Certified Enterprise Architect; an IBM Certified ITS and IBM Certified ITA \nA total of 3 published patents Specialties:BPM, Business Process Management, SOA, Service Oriented Architecure, EA, Enterprise Architecture, WebSphere, EAI, Client Relations Experience Executive - Client Success, IBM Systems Middleware IBM May 2015  – Present (4 months) Dubai Executive - IBM Systems Middleware Lab Services (Middle East & Arfrica) IBM July 2013  –  May 2015  (1 year 11 months) Johannesburg Area, South Africa Business Sales and Delivery Executive IBM May 2012  –  May 2014  (2 years 1 month) Melbourne Area, Australia Business Process Management & Integration (BPM&I) \n• Identify and qualify opportunities & work with clients on solving their business problems and lead services sales effort \n• Engage with clients to assist them with Process Simplification/Automation/Optimization \n• Manage, develop and grow strategic customer relationships. Drive revenue generation to achieve \nspecified revenue targets \n• Manage all aspects of the sales cycle including prospecting, developing customer relationship at \nall levels and implementing account plans \n• Develop relationships with a diverse set of internal and external constituents, including senior \nlevel executives, legal, technical, finance, support, marketing and delivery heads. \n• Drive sales and revenue for BPM&I practice within AIS in GBS Asia Pacific BPM Solution Architect IBM January 2011  –  April 2012  (1 year 4 months) Singapore •\tLead the Asia/Pacific Software Lab Services BPM team to accelerate the contribution to IBM revenue and profits, and build delivery capabilities of Software Lab Services  \n•\tManage, develop and grow strategic customer relationships. Drive revenue generation to achieve specified revenue targets \n•\tIdentify, qualify and quantify all opportunities and lead services sales effort \n•\tDevelop and deliver compelling sales presentations to potential customers \n•\tManage all aspects of the sales cycle including prospecting, developing customer relationship at all levels and implementing account plans \n•\tManage activities dealing with the planning, direction, communication and control of sales efforts in Vietnam \n•\tBuild proposals outlining proposed deliverables and associated cost. Assist Engagement Managers in writing statement of work (SOW), outlining the specific services solutions to be delivered to the customer \n•\tDevelop relationships with a diverse set of internal and external constituents, including senior level executives, legal, technical, finance, support, marketing and delivery heads. \n•\tDefine the business and technical strategy for the business unit. Build a strategic vision for the unit and ensure the vision is applied in customer engagements \n•\tProvide guidance to the team and review projects at Steering Committee meetings with the customers Country Manager, Client Technical Professionals and Software Lab Services, Vietnam IBM January 2010  –  December 2010  (1 year) Lead the Client Technical Professionals team to support new software license sale, defend and grow IBM software install base and contribute to IBM and IBM Software growth and ensure delivery of client value. \n \nLead the Software Lab Services team to accelerate the contribution to IBM revenue and profits and build up the capability and capacity of Software Lab Services to support the IBM Software business in Vietnam. WebSphere Services Practice Manager, Asean IBM June 2007  –  December 2009  (2 years 7 months) •\tManages, develops and grows strategic customer relationships. Drive revenue generation to achieve specified revenue targets, while managing costs, in order to achieve 22% margin target for the region across Consulting, Education and Support line of business (LOBs). \n•\tDevelops and delivers accurate and technically correct sales presentations to potential customers \n•\tManages all aspects of the sales cycle including prospecting, development of the customer relationship at all levels and the implementation of the account plans \n•\tManage activities dealing with the planning, direction, communication and control of sales efforts \n•\tWork with prospects and customers to position, scope, and price services including new implementations, expansion of the application, training, integration, and customization services. \n•\tBuild proposals outlining proposed deliverables and associated cost. Write statement of work (SOW) based on accepted proposals outlining the specific services solutions to be delivered to the customer \n•\tManage a 50 member team across Asean to drive a profitable business  \n•\tUtilize available resources and knowledge to orchestrate solutions that increase market share and profitability \n•\tDefine the business and technical strategy for the business unit. Build a strategic vision for the unit and ensure the vision is applied in customer engagements \n•\tProvide architecture direction for projects and QA architecture decisions taken by application/project teams \n•\tArticulate the value of SOA solution in the context of customer’s business strategy; Assesses the client's readiness for SOA organizationally and technically \n•\tOptimize solutions based on client requirement, commercial constraints, and risk trade-offs \n•\tProvides guidance to the team and review SOA implementation, deployment and management \n•\tAt times also serve as a Project Manager and also as Project Executive for Services Delivery Projects in Asean WebSphere Services Lead (Malaysia) and SOA Architect IBM February 2005  –  June 2007  (2 years 5 months) •\tDrive revenue generation for WebSphere Services in the country across all 3 LOBs; Consulting, Education and Support. \n•\tLead the team of ISSW Consultants to deliver successful projectes for Software Lab Services, Malaysia \n•\tAs Lead Architect develop Technical Architectures for the clients \n•\tAssist WebSphere Sales and Technical Sales team in the country to sell products and introduce WebSphere Services to implement the solutions. Lead Consultant (Australia) Satyam Computer services Limited April 2004  –  February 2005  (11 months) •\tLead the Enterprise Application integration Competency Centre (CoE) for one of the clients of Satyam. \n•\tTechnical Design and Architecture of the B2B implementation using WebSphere \n•\tDevelop solutions using WebSphere InterChange Server and WBI Adapters. \n•\tManaging a team (12) of developers, designers and analysts. Advisory IT Specialist (India) IBM July 2000  –  February 2004  (3 years 8 months) As an Advisory IT Specialist in IBM India Ltd, primary function is to be the lead individual contributor responsible for providing software solution in an EAI engagement. Guide other professionals and assume overall technical responsibility for the success of the solution construction, implementation & system integration in a technology, industry or business specialty. Utilize in-depth knowledge of IBM’s WebSphere suite of products & technology in conjunction with industry and business skills to influence functional strategy. \n \nIn 2004, Ashir was the Country Technical Leader for Software Innovation Centre (SWIC), an initiative by the WW team for dedicated technical assistance to all the Business Partner across the country. Ashir had 2 Technical Sales Specialists assisting him in this mission, one handling North and the other handling South region. \n \nAs a Technical Sales Specialist for WebSphere and he was instrumental in evangelizing and increasing the awareness and deployment of WebSphere products in India. I was part of the team that was responsible for closing the largest WebSphere MQ opportunity with Reserve Bank of India, which mandated all the Banks in India to use WebSphere MQ for RTGS (Real-time Gross Settlement). Since then, WebSphere MQ has become the de facto standard for all the banks in India. Team Leader Dimension India Networks August 1998  –  May 2000  (1 year 10 months) Ashir was heading a team of 18 members comprising of Web Strategists, Systems and Database Administrators, Visualisers and Developers.  \n \nAshir had overall responsibility for project development and implementation for the customer. System analysis and designing documents. Offering technical consultancy to Clients. Administrative – Budgeting for Man and Machine requirement. Selection of Vendors for procuring hardware and solution outsourcing. Senior IT Officer The Times of India July 1995  –  July 1998  (3 years 1 month) •\tIngres Database Administration, performance testing and tuning. \n•\tExtensive development of iSQL \n•\tRegular optimization and taking dynamic and static backups on a regular basis. \n•\tUnix System administration, including user profile management and ensuring Security Executive - Client Success, IBM Systems Middleware IBM May 2015  – Present (4 months) Dubai Executive - Client Success, IBM Systems Middleware IBM May 2015  – Present (4 months) Dubai Executive - IBM Systems Middleware Lab Services (Middle East & Arfrica) IBM July 2013  –  May 2015  (1 year 11 months) Johannesburg Area, South Africa Executive - IBM Systems Middleware Lab Services (Middle East & Arfrica) IBM July 2013  –  May 2015  (1 year 11 months) Johannesburg Area, South Africa Business Sales and Delivery Executive IBM May 2012  –  May 2014  (2 years 1 month) Melbourne Area, Australia Business Process Management & Integration (BPM&I) \n• Identify and qualify opportunities & work with clients on solving their business problems and lead services sales effort \n• Engage with clients to assist them with Process Simplification/Automation/Optimization \n• Manage, develop and grow strategic customer relationships. Drive revenue generation to achieve \nspecified revenue targets \n• Manage all aspects of the sales cycle including prospecting, developing customer relationship at \nall levels and implementing account plans \n• Develop relationships with a diverse set of internal and external constituents, including senior \nlevel executives, legal, technical, finance, support, marketing and delivery heads. \n• Drive sales and revenue for BPM&I practice within AIS in GBS Business Sales and Delivery Executive IBM May 2012  –  May 2014  (2 years 1 month) Melbourne Area, Australia Business Process Management & Integration (BPM&I) \n• Identify and qualify opportunities & work with clients on solving their business problems and lead services sales effort \n• Engage with clients to assist them with Process Simplification/Automation/Optimization \n• Manage, develop and grow strategic customer relationships. Drive revenue generation to achieve \nspecified revenue targets \n• Manage all aspects of the sales cycle including prospecting, developing customer relationship at \nall levels and implementing account plans \n• Develop relationships with a diverse set of internal and external constituents, including senior \nlevel executives, legal, technical, finance, support, marketing and delivery heads. \n• Drive sales and revenue for BPM&I practice within AIS in GBS Asia Pacific BPM Solution Architect IBM January 2011  –  April 2012  (1 year 4 months) Singapore •\tLead the Asia/Pacific Software Lab Services BPM team to accelerate the contribution to IBM revenue and profits, and build delivery capabilities of Software Lab Services  \n•\tManage, develop and grow strategic customer relationships. Drive revenue generation to achieve specified revenue targets \n•\tIdentify, qualify and quantify all opportunities and lead services sales effort \n•\tDevelop and deliver compelling sales presentations to potential customers \n•\tManage all aspects of the sales cycle including prospecting, developing customer relationship at all levels and implementing account plans \n•\tManage activities dealing with the planning, direction, communication and control of sales efforts in Vietnam \n•\tBuild proposals outlining proposed deliverables and associated cost. Assist Engagement Managers in writing statement of work (SOW), outlining the specific services solutions to be delivered to the customer \n•\tDevelop relationships with a diverse set of internal and external constituents, including senior level executives, legal, technical, finance, support, marketing and delivery heads. \n•\tDefine the business and technical strategy for the business unit. Build a strategic vision for the unit and ensure the vision is applied in customer engagements \n•\tProvide guidance to the team and review projects at Steering Committee meetings with the customers Asia Pacific BPM Solution Architect IBM January 2011  –  April 2012  (1 year 4 months) Singapore •\tLead the Asia/Pacific Software Lab Services BPM team to accelerate the contribution to IBM revenue and profits, and build delivery capabilities of Software Lab Services  \n•\tManage, develop and grow strategic customer relationships. Drive revenue generation to achieve specified revenue targets \n•\tIdentify, qualify and quantify all opportunities and lead services sales effort \n•\tDevelop and deliver compelling sales presentations to potential customers \n•\tManage all aspects of the sales cycle including prospecting, developing customer relationship at all levels and implementing account plans \n•\tManage activities dealing with the planning, direction, communication and control of sales efforts in Vietnam \n•\tBuild proposals outlining proposed deliverables and associated cost. Assist Engagement Managers in writing statement of work (SOW), outlining the specific services solutions to be delivered to the customer \n•\tDevelop relationships with a diverse set of internal and external constituents, including senior level executives, legal, technical, finance, support, marketing and delivery heads. \n•\tDefine the business and technical strategy for the business unit. Build a strategic vision for the unit and ensure the vision is applied in customer engagements \n•\tProvide guidance to the team and review projects at Steering Committee meetings with the customers Country Manager, Client Technical Professionals and Software Lab Services, Vietnam IBM January 2010  –  December 2010  (1 year) Lead the Client Technical Professionals team to support new software license sale, defend and grow IBM software install base and contribute to IBM and IBM Software growth and ensure delivery of client value. \n \nLead the Software Lab Services team to accelerate the contribution to IBM revenue and profits and build up the capability and capacity of Software Lab Services to support the IBM Software business in Vietnam. Country Manager, Client Technical Professionals and Software Lab Services, Vietnam IBM January 2010  –  December 2010  (1 year) Lead the Client Technical Professionals team to support new software license sale, defend and grow IBM software install base and contribute to IBM and IBM Software growth and ensure delivery of client value. \n \nLead the Software Lab Services team to accelerate the contribution to IBM revenue and profits and build up the capability and capacity of Software Lab Services to support the IBM Software business in Vietnam. WebSphere Services Practice Manager, Asean IBM June 2007  –  December 2009  (2 years 7 months) •\tManages, develops and grows strategic customer relationships. Drive revenue generation to achieve specified revenue targets, while managing costs, in order to achieve 22% margin target for the region across Consulting, Education and Support line of business (LOBs). \n•\tDevelops and delivers accurate and technically correct sales presentations to potential customers \n•\tManages all aspects of the sales cycle including prospecting, development of the customer relationship at all levels and the implementation of the account plans \n•\tManage activities dealing with the planning, direction, communication and control of sales efforts \n•\tWork with prospects and customers to position, scope, and price services including new implementations, expansion of the application, training, integration, and customization services. \n•\tBuild proposals outlining proposed deliverables and associated cost. Write statement of work (SOW) based on accepted proposals outlining the specific services solutions to be delivered to the customer \n•\tManage a 50 member team across Asean to drive a profitable business  \n•\tUtilize available resources and knowledge to orchestrate solutions that increase market share and profitability \n•\tDefine the business and technical strategy for the business unit. Build a strategic vision for the unit and ensure the vision is applied in customer engagements \n•\tProvide architecture direction for projects and QA architecture decisions taken by application/project teams \n•\tArticulate the value of SOA solution in the context of customer’s business strategy; Assesses the client's readiness for SOA organizationally and technically \n•\tOptimize solutions based on client requirement, commercial constraints, and risk trade-offs \n•\tProvides guidance to the team and review SOA implementation, deployment and management \n•\tAt times also serve as a Project Manager and also as Project Executive for Services Delivery Projects in Asean WebSphere Services Practice Manager, Asean IBM June 2007  –  December 2009  (2 years 7 months) •\tManages, develops and grows strategic customer relationships. Drive revenue generation to achieve specified revenue targets, while managing costs, in order to achieve 22% margin target for the region across Consulting, Education and Support line of business (LOBs). \n•\tDevelops and delivers accurate and technically correct sales presentations to potential customers \n•\tManages all aspects of the sales cycle including prospecting, development of the customer relationship at all levels and the implementation of the account plans \n•\tManage activities dealing with the planning, direction, communication and control of sales efforts \n•\tWork with prospects and customers to position, scope, and price services including new implementations, expansion of the application, training, integration, and customization services. \n•\tBuild proposals outlining proposed deliverables and associated cost. Write statement of work (SOW) based on accepted proposals outlining the specific services solutions to be delivered to the customer \n•\tManage a 50 member team across Asean to drive a profitable business  \n•\tUtilize available resources and knowledge to orchestrate solutions that increase market share and profitability \n•\tDefine the business and technical strategy for the business unit. Build a strategic vision for the unit and ensure the vision is applied in customer engagements \n•\tProvide architecture direction for projects and QA architecture decisions taken by application/project teams \n•\tArticulate the value of SOA solution in the context of customer’s business strategy; Assesses the client's readiness for SOA organizationally and technically \n•\tOptimize solutions based on client requirement, commercial constraints, and risk trade-offs \n•\tProvides guidance to the team and review SOA implementation, deployment and management \n•\tAt times also serve as a Project Manager and also as Project Executive for Services Delivery Projects in Asean WebSphere Services Lead (Malaysia) and SOA Architect IBM February 2005  –  June 2007  (2 years 5 months) •\tDrive revenue generation for WebSphere Services in the country across all 3 LOBs; Consulting, Education and Support. \n•\tLead the team of ISSW Consultants to deliver successful projectes for Software Lab Services, Malaysia \n•\tAs Lead Architect develop Technical Architectures for the clients \n•\tAssist WebSphere Sales and Technical Sales team in the country to sell products and introduce WebSphere Services to implement the solutions. WebSphere Services Lead (Malaysia) and SOA Architect IBM February 2005  –  June 2007  (2 years 5 months) •\tDrive revenue generation for WebSphere Services in the country across all 3 LOBs; Consulting, Education and Support. \n•\tLead the team of ISSW Consultants to deliver successful projectes for Software Lab Services, Malaysia \n•\tAs Lead Architect develop Technical Architectures for the clients \n•\tAssist WebSphere Sales and Technical Sales team in the country to sell products and introduce WebSphere Services to implement the solutions. Lead Consultant (Australia) Satyam Computer services Limited April 2004  –  February 2005  (11 months) •\tLead the Enterprise Application integration Competency Centre (CoE) for one of the clients of Satyam. \n•\tTechnical Design and Architecture of the B2B implementation using WebSphere \n•\tDevelop solutions using WebSphere InterChange Server and WBI Adapters. \n•\tManaging a team (12) of developers, designers and analysts. Lead Consultant (Australia) Satyam Computer services Limited April 2004  –  February 2005  (11 months) •\tLead the Enterprise Application integration Competency Centre (CoE) for one of the clients of Satyam. \n•\tTechnical Design and Architecture of the B2B implementation using WebSphere \n•\tDevelop solutions using WebSphere InterChange Server and WBI Adapters. \n•\tManaging a team (12) of developers, designers and analysts. Advisory IT Specialist (India) IBM July 2000  –  February 2004  (3 years 8 months) As an Advisory IT Specialist in IBM India Ltd, primary function is to be the lead individual contributor responsible for providing software solution in an EAI engagement. Guide other professionals and assume overall technical responsibility for the success of the solution construction, implementation & system integration in a technology, industry or business specialty. Utilize in-depth knowledge of IBM’s WebSphere suite of products & technology in conjunction with industry and business skills to influence functional strategy. \n \nIn 2004, Ashir was the Country Technical Leader for Software Innovation Centre (SWIC), an initiative by the WW team for dedicated technical assistance to all the Business Partner across the country. Ashir had 2 Technical Sales Specialists assisting him in this mission, one handling North and the other handling South region. \n \nAs a Technical Sales Specialist for WebSphere and he was instrumental in evangelizing and increasing the awareness and deployment of WebSphere products in India. I was part of the team that was responsible for closing the largest WebSphere MQ opportunity with Reserve Bank of India, which mandated all the Banks in India to use WebSphere MQ for RTGS (Real-time Gross Settlement). Since then, WebSphere MQ has become the de facto standard for all the banks in India. Advisory IT Specialist (India) IBM July 2000  –  February 2004  (3 years 8 months) As an Advisory IT Specialist in IBM India Ltd, primary function is to be the lead individual contributor responsible for providing software solution in an EAI engagement. Guide other professionals and assume overall technical responsibility for the success of the solution construction, implementation & system integration in a technology, industry or business specialty. Utilize in-depth knowledge of IBM’s WebSphere suite of products & technology in conjunction with industry and business skills to influence functional strategy. \n \nIn 2004, Ashir was the Country Technical Leader for Software Innovation Centre (SWIC), an initiative by the WW team for dedicated technical assistance to all the Business Partner across the country. Ashir had 2 Technical Sales Specialists assisting him in this mission, one handling North and the other handling South region. \n \nAs a Technical Sales Specialist for WebSphere and he was instrumental in evangelizing and increasing the awareness and deployment of WebSphere products in India. I was part of the team that was responsible for closing the largest WebSphere MQ opportunity with Reserve Bank of India, which mandated all the Banks in India to use WebSphere MQ for RTGS (Real-time Gross Settlement). Since then, WebSphere MQ has become the de facto standard for all the banks in India. Team Leader Dimension India Networks August 1998  –  May 2000  (1 year 10 months) Ashir was heading a team of 18 members comprising of Web Strategists, Systems and Database Administrators, Visualisers and Developers.  \n \nAshir had overall responsibility for project development and implementation for the customer. System analysis and designing documents. Offering technical consultancy to Clients. Administrative – Budgeting for Man and Machine requirement. Selection of Vendors for procuring hardware and solution outsourcing. Team Leader Dimension India Networks August 1998  –  May 2000  (1 year 10 months) Ashir was heading a team of 18 members comprising of Web Strategists, Systems and Database Administrators, Visualisers and Developers.  \n \nAshir had overall responsibility for project development and implementation for the customer. System analysis and designing documents. Offering technical consultancy to Clients. Administrative – Budgeting for Man and Machine requirement. Selection of Vendors for procuring hardware and solution outsourcing. Senior IT Officer The Times of India July 1995  –  July 1998  (3 years 1 month) •\tIngres Database Administration, performance testing and tuning. \n•\tExtensive development of iSQL \n•\tRegular optimization and taking dynamic and static backups on a regular basis. \n•\tUnix System administration, including user profile management and ensuring Security Senior IT Officer The Times of India July 1995  –  July 1998  (3 years 1 month) •\tIngres Database Administration, performance testing and tuning. \n•\tExtensive development of iSQL \n•\tRegular optimization and taking dynamic and static backups on a regular basis. \n•\tUnix System administration, including user profile management and ensuring Security Languages English Hindi Malayalam Tamil English Hindi Malayalam Tamil English Hindi Malayalam Tamil Skills EAI SOA Enterprise Architecture Business Process Design IBM BPM BPMN WebSphere Message Broker WebSphere MQ Business Process... Governance Center of Excellence Professional Services Business Process... Business Development Global Business... Outstanding people... People Management Team Leadership Cross-functional Team... Program Management Integration Solution Architecture Outsourcing CRM Management Cloud Computing Websphere Team Management Middleware See 14+     See less Skills  EAI SOA Enterprise Architecture Business Process Design IBM BPM BPMN WebSphere Message Broker WebSphere MQ Business Process... Governance Center of Excellence Professional Services Business Process... Business Development Global Business... Outstanding people... People Management Team Leadership Cross-functional Team... Program Management Integration Solution Architecture Outsourcing CRM Management Cloud Computing Websphere Team Management Middleware See 14+     See less EAI SOA Enterprise Architecture Business Process Design IBM BPM BPMN WebSphere Message Broker WebSphere MQ Business Process... Governance Center of Excellence Professional Services Business Process... Business Development Global Business... Outstanding people... People Management Team Leadership Cross-functional Team... Program Management Integration Solution Architecture Outsourcing CRM Management Cloud Computing Websphere Team Management Middleware See 14+     See less EAI SOA Enterprise Architecture Business Process Design IBM BPM BPMN WebSphere Message Broker WebSphere MQ Business Process... Governance Center of Excellence Professional Services Business Process... Business Development Global Business... Outstanding people... People Management Team Leadership Cross-functional Team... Program Management Integration Solution Architecture Outsourcing CRM Management Cloud Computing Websphere Team Management Middleware See 14+     See less Honors & Awards ", "Experience SOA Architect IBM SOA Architect IBM SOA Architect IBM "]}