{"position": "Software Engineering", "company": "Intel Corporation", "profiles": ["Languages English Native or bilingual proficiency Polish Native or bilingual proficiency English Native or bilingual proficiency Polish Native or bilingual proficiency English Native or bilingual proficiency Polish Native or bilingual proficiency Native or bilingual proficiency Native or bilingual proficiency Skills C++ Perl Python Linux Debugging Simulation Software Engineering Subversion C Engineering Software Development Windows Programming Validation Testing Eclipse OOP Algorithms SQL Valgrind Project Management Team Management Team-oriented Dependable Team Player XML Processors Simulations See 12+     See less Skills  C++ Perl Python Linux Debugging Simulation Software Engineering Subversion C Engineering Software Development Windows Programming Validation Testing Eclipse OOP Algorithms SQL Valgrind Project Management Team Management Team-oriented Dependable Team Player XML Processors Simulations See 12+     See less C++ Perl Python Linux Debugging Simulation Software Engineering Subversion C Engineering Software Development Windows Programming Validation Testing Eclipse OOP Algorithms SQL Valgrind Project Management Team Management Team-oriented Dependable Team Player XML Processors Simulations See 12+     See less C++ Perl Python Linux Debugging Simulation Software Engineering Subversion C Engineering Software Development Windows Programming Validation Testing Eclipse OOP Algorithms SQL Valgrind Project Management Team Management Team-oriented Dependable Team Player XML Processors Simulations See 12+     See less ", "Summary Program Manager with experience in leading large-scale programs (more than 300 engineers) with great technical complexity across several disciplines. Has driven Platform Projects from definition phase to planning up to the management of day-to-day execution across internal engineering development sites (France, India, USA) as well as external third parties. Had direct customer interaction experiences in multicultural environments, including the management of high-pressure Product pre-commercialization phase.  \n \nVery good knowledge of Wireless industry eco-system, including direct interactions with a number of Tier-1 OEMs, ODMs, Operators and OS/Apps Framework providers. Summary Program Manager with experience in leading large-scale programs (more than 300 engineers) with great technical complexity across several disciplines. Has driven Platform Projects from definition phase to planning up to the management of day-to-day execution across internal engineering development sites (France, India, USA) as well as external third parties. Had direct customer interaction experiences in multicultural environments, including the management of high-pressure Product pre-commercialization phase.  \n \nVery good knowledge of Wireless industry eco-system, including direct interactions with a number of Tier-1 OEMs, ODMs, Operators and OS/Apps Framework providers. Program Manager with experience in leading large-scale programs (more than 300 engineers) with great technical complexity across several disciplines. Has driven Platform Projects from definition phase to planning up to the management of day-to-day execution across internal engineering development sites (France, India, USA) as well as external third parties. Had direct customer interaction experiences in multicultural environments, including the management of high-pressure Product pre-commercialization phase.  \n \nVery good knowledge of Wireless industry eco-system, including direct interactions with a number of Tier-1 OEMs, ODMs, Operators and OS/Apps Framework providers. Program Manager with experience in leading large-scale programs (more than 300 engineers) with great technical complexity across several disciplines. Has driven Platform Projects from definition phase to planning up to the management of day-to-day execution across internal engineering development sites (France, India, USA) as well as external third parties. Had direct customer interaction experiences in multicultural environments, including the management of high-pressure Product pre-commercialization phase.  \n \nVery good knowledge of Wireless industry eco-system, including direct interactions with a number of Tier-1 OEMs, ODMs, Operators and OS/Apps Framework providers. Skills Android Continuous Integration Software Development Embedded Systems Embedded Software Program Management Project Management Management Wireless Testing Mobile Devices Mobile Communications Semiconductors Debugging Leadership Linux Kernel C Software Engineering Quality Improvement Continuous Improvement GSM Project Planning Modems IC Digital Signal... ARM X86 SoC Integration See 14+     See less Skills  Android Continuous Integration Software Development Embedded Systems Embedded Software Program Management Project Management Management Wireless Testing Mobile Devices Mobile Communications Semiconductors Debugging Leadership Linux Kernel C Software Engineering Quality Improvement Continuous Improvement GSM Project Planning Modems IC Digital Signal... ARM X86 SoC Integration See 14+     See less Android Continuous Integration Software Development Embedded Systems Embedded Software Program Management Project Management Management Wireless Testing Mobile Devices Mobile Communications Semiconductors Debugging Leadership Linux Kernel C Software Engineering Quality Improvement Continuous Improvement GSM Project Planning Modems IC Digital Signal... ARM X86 SoC Integration See 14+     See less Android Continuous Integration Software Development Embedded Systems Embedded Software Program Management Project Management Management Wireless Testing Mobile Devices Mobile Communications Semiconductors Debugging Leadership Linux Kernel C Software Engineering Quality Improvement Continuous Improvement GSM Project Planning Modems IC Digital Signal... ARM X86 SoC Integration See 14+     See less ", "Skills C++ Object Oriented Design Debugging Agile Methodologies Visual Studio Software Development C# Software Design Perl Embedded Systems C Software Engineering Embedded Software Subversion Skills  C++ Object Oriented Design Debugging Agile Methodologies Visual Studio Software Development C# Software Design Perl Embedded Systems C Software Engineering Embedded Software Subversion C++ Object Oriented Design Debugging Agile Methodologies Visual Studio Software Development C# Software Design Perl Embedded Systems C Software Engineering Embedded Software Subversion C++ Object Oriented Design Debugging Agile Methodologies Visual Studio Software Development C# Software Design Perl Embedded Systems C Software Engineering Embedded Software Subversion ", "Experience Server and Workstation Product Planner Intel Corporation October 2006  – Present (8 years 11 months) Server and Workstation Product Planner Intel Corporation October 2006  – Present (8 years 11 months) Server and Workstation Product Planner Intel Corporation October 2006  – Present (8 years 11 months) ", "Skills Software Engineering Software Development Distributed Systems Debugging Agile Methodologies Algorithms Embedded Systems Technical Leadership Software Design C++ High Performance... Computer Architecture Embedded Software Intel Processors Device Drivers Software Project... Parallel Computing Semiconductors Multithreading System Architecture Perl SoC Object Oriented Design Firmware Embedded Linux Scalability ARM Linux Kernel Parallel Programming Compilers See 16+     See less Skills  Software Engineering Software Development Distributed Systems Debugging Agile Methodologies Algorithms Embedded Systems Technical Leadership Software Design C++ High Performance... Computer Architecture Embedded Software Intel Processors Device Drivers Software Project... Parallel Computing Semiconductors Multithreading System Architecture Perl SoC Object Oriented Design Firmware Embedded Linux Scalability ARM Linux Kernel Parallel Programming Compilers See 16+     See less Software Engineering Software Development Distributed Systems Debugging Agile Methodologies Algorithms Embedded Systems Technical Leadership Software Design C++ High Performance... Computer Architecture Embedded Software Intel Processors Device Drivers Software Project... Parallel Computing Semiconductors Multithreading System Architecture Perl SoC Object Oriented Design Firmware Embedded Linux Scalability ARM Linux Kernel Parallel Programming Compilers See 16+     See less Software Engineering Software Development Distributed Systems Debugging Agile Methodologies Algorithms Embedded Systems Technical Leadership Software Design C++ High Performance... Computer Architecture Embedded Software Intel Processors Device Drivers Software Project... Parallel Computing Semiconductors Multithreading System Architecture Perl SoC Object Oriented Design Firmware Embedded Linux Scalability ARM Linux Kernel Parallel Programming Compilers See 16+     See less ", "Experience Principal Staff Engineer motorola May 2003  –  February 2013  (9 years 10 months) Greater Chicago Area Principal staff engineer Intel Corporation 2012  –  2013  (1 year) Sr.software engineer satyam computers May 2000  –  May 2003  (3 years 1 month) Software engineer Embedded wireless Labs February 1999  –  May 2000  (1 year 4 months) Principal Staff Engineer motorola May 2003  –  February 2013  (9 years 10 months) Greater Chicago Area Principal Staff Engineer motorola May 2003  –  February 2013  (9 years 10 months) Greater Chicago Area Principal staff engineer Intel Corporation 2012  –  2013  (1 year) Principal staff engineer Intel Corporation 2012  –  2013  (1 year) Sr.software engineer satyam computers May 2000  –  May 2003  (3 years 1 month) Sr.software engineer satyam computers May 2000  –  May 2003  (3 years 1 month) Software engineer Embedded wireless Labs February 1999  –  May 2000  (1 year 4 months) Software engineer Embedded wireless Labs February 1999  –  May 2000  (1 year 4 months) Skills GSM UMTS GPRS 3G LTE 3GPP Protocol Stacks CDMA Wireless Embedded Systems Embedded Software 4G Integration Telecommunications Android RTOS Mobile Devices Cellular Communications HSPA ClearCase WiMAX Testing WCDMA Debugging See 9+     See less Skills  GSM UMTS GPRS 3G LTE 3GPP Protocol Stacks CDMA Wireless Embedded Systems Embedded Software 4G Integration Telecommunications Android RTOS Mobile Devices Cellular Communications HSPA ClearCase WiMAX Testing WCDMA Debugging See 9+     See less GSM UMTS GPRS 3G LTE 3GPP Protocol Stacks CDMA Wireless Embedded Systems Embedded Software 4G Integration Telecommunications Android RTOS Mobile Devices Cellular Communications HSPA ClearCase WiMAX Testing WCDMA Debugging See 9+     See less GSM UMTS GPRS 3G LTE 3GPP Protocol Stacks CDMA Wireless Embedded Systems Embedded Software 4G Integration Telecommunications Android RTOS Mobile Devices Cellular Communications HSPA ClearCase WiMAX Testing WCDMA Debugging See 9+     See less Education Birla Institute of Technology MS Kuvempu Vishwavidyanilaya B.E Birla Institute of Technology MS Birla Institute of Technology MS Birla Institute of Technology MS Kuvempu Vishwavidyanilaya B.E Kuvempu Vishwavidyanilaya B.E Kuvempu Vishwavidyanilaya B.E Honors & Awards Additional Honors & Awards Motorola Six SIgma GreenBelt Certification in 2008 \n3GSM Engine \"Continuous Improvement Leader\" for the year 2006. Additional Honors & Awards Motorola Six SIgma GreenBelt Certification in 2008 \n3GSM Engine \"Continuous Improvement Leader\" for the year 2006. Additional Honors & Awards Motorola Six SIgma GreenBelt Certification in 2008 \n3GSM Engine \"Continuous Improvement Leader\" for the year 2006. Additional Honors & Awards Motorola Six SIgma GreenBelt Certification in 2008 \n3GSM Engine \"Continuous Improvement Leader\" for the year 2006. ", "Experience Director Software Engineering Intel Corporation Director Software Engineering Intel Corporation Director Software Engineering Intel Corporation ", "Experience VP Engineering Intel Corporation VP Software Engineering Intel Corporation March 2011  – Present (4 years 6 months) San Francisco Bay Area Director of Engineering Technicolor July 2008  –  February 2011  (2 years 8 months) Indianapolis, Indiana Area Director of Engineering Comcast January 1999  –  June 2008  (9 years 6 months) VP Engineering Intel Corporation VP Engineering Intel Corporation VP Software Engineering Intel Corporation March 2011  – Present (4 years 6 months) San Francisco Bay Area VP Software Engineering Intel Corporation March 2011  – Present (4 years 6 months) San Francisco Bay Area Director of Engineering Technicolor July 2008  –  February 2011  (2 years 8 months) Indianapolis, Indiana Area Director of Engineering Technicolor July 2008  –  February 2011  (2 years 8 months) Indianapolis, Indiana Area Director of Engineering Comcast January 1999  –  June 2008  (9 years 6 months) Director of Engineering Comcast January 1999  –  June 2008  (9 years 6 months) Skills Software Engineering Engineering Software Development Embedded Systems Perl Linux Testing Product Management Wireless Cross-functional Team... Skills  Software Engineering Engineering Software Development Embedded Systems Perl Linux Testing Product Management Wireless Cross-functional Team... Software Engineering Engineering Software Development Embedded Systems Perl Linux Testing Product Management Wireless Cross-functional Team... Software Engineering Engineering Software Development Embedded Systems Perl Linux Testing Product Management Wireless Cross-functional Team... Education Michigan State University Bachelor of Science (B.S.),  Electrical and Electronics Engineering , A+ Michigan State University Bachelor of Science (B.S.),  Electrical and Electronics Engineering , A+ Michigan State University Bachelor of Science (B.S.),  Electrical and Electronics Engineering , A+ Michigan State University Bachelor of Science (B.S.),  Electrical and Electronics Engineering , A+ ", "Summary Senior project manager and PMO leader with a contagious and creative winning attitude focusing on bringing innovative solutions that deliver business value through implementation of IT technologies and business process improvement expertise. Specialties:Bringing PMBOK and Agile methodologies to Portfolio and program management. Program- and project-level metrics and success measurements. Integration and implementation of business requirements with IT technology solutions. Summary Senior project manager and PMO leader with a contagious and creative winning attitude focusing on bringing innovative solutions that deliver business value through implementation of IT technologies and business process improvement expertise. Specialties:Bringing PMBOK and Agile methodologies to Portfolio and program management. Program- and project-level metrics and success measurements. Integration and implementation of business requirements with IT technology solutions. Senior project manager and PMO leader with a contagious and creative winning attitude focusing on bringing innovative solutions that deliver business value through implementation of IT technologies and business process improvement expertise. Specialties:Bringing PMBOK and Agile methodologies to Portfolio and program management. Program- and project-level metrics and success measurements. Integration and implementation of business requirements with IT technology solutions. Senior project manager and PMO leader with a contagious and creative winning attitude focusing on bringing innovative solutions that deliver business value through implementation of IT technologies and business process improvement expertise. Specialties:Bringing PMBOK and Agile methodologies to Portfolio and program management. Program- and project-level metrics and success measurements. Integration and implementation of business requirements with IT technology solutions. Experience Senior Project Manager Sutter Health August 2013  – Present (2 years 1 month) mather, ca Delivering improvements to healthcare, specializing in Laboratory projects. Developer of BI and PM tools to better manage the financial aspects of project/program budgets. VP Finance Project Management Institute, Sacramento Valley Chapter January 2014  – Present (1 year 8 months) Sacramento, California Area Volunteer VP of Finance for the local chapter of PMI Consultant Limitless Sky Squadron September 2010  – Present (5 years) Providing consultative services to the ownership team. Specializing in project and organizational guidance for the leadership team. Sr. IT Project Manager Coventry Health Care April 2008  –  August 2013  (5 years 5 months) West Sacramento, CA Sr. Project Manager and SharePoint developer for SW development projects for Health Care company in Workers Comp and Provider & Pricing applications. Adjunct Instructor ITT Technical Institute August 2010  –  July 2013  (3 years) Rancho Cordova, CA Adjunct instructor of Project Management in the School of Information Technology at ITT Technical Institute. Teaching Decision-Making and Problem Solving Techniques, Leading Virtual teams, Leadership and Project Team Management, Introduction to Project Management and Project Management Tools and Techniques Principal Performer, \"My Car Did\" Television and Web Commercials Mercedes Benz USA June 2010  –  December 2011  (1 year 7 months) Nationwide Television Commercial and the MBUSA Website Software Solutions Manager Miles Consulting Corp. July 2007  –  February 2008  (8 months) Managed complete SDLC software projects from client requirements gathering and validation through delivery and implementation. Completed multiple IT infrastructure implementation projects for several clients & all internal company systems. Consulted on Operational Improvement Issues. Facilitated company management team meetings to align company efforts. Regional Training Manager EchoStar / Dish Network January 2007  –  July 2007  (7 months) Led regional training organization in delivering technical training to DNS Satellite installation offices. Identified need and initiated OE programs to standardize training systems and processes. Improved consistency in training programs throughout the region. Senior IT Manager Intel Corporation January 1995  –  July 2006  (11 years 7 months) Managed systems, networking and SW engineering teams in a zero-budget IT environment, recovering 103% of operational costs. Managed program life cycles, improving customer satisfaction and performance to schedule. US Technical Training Programs Manager, HR Intel Corporation January 1995  –  July 2006  (11 years 7 months) Led US training programs team in global development and rollout of technical training solutions supporting global design and engineering teams. Sr. Staff Software Testing Manager - Chipset Software Engineering Intel Corporation January 1995  –  July 2006  (11 years 7 months) Created and led SW test group, supporting application & driver software stack testing. Validated & certified chipset SW, meeting all delivery and quality guidelines. Improved Microsoft WHQL Certification testing throughput from six weeks to two weeks. Received several Divisional Recognition Awards Intel University Instructor Intel Corporation January 1995  –  July 2006  (11 years 7 months) Intel University Instructor for:  \nLeading Effective Meetings, Performing to Intel Values (New Hire Class), Management Skills Training Series, Management Task Cycle, & Goal Setting. Global Facilitator for Managing Through People (Offsite, Week-long, Front-line Manager training program). Senior Project Manager Sutter Health August 2013  – Present (2 years 1 month) mather, ca Delivering improvements to healthcare, specializing in Laboratory projects. Developer of BI and PM tools to better manage the financial aspects of project/program budgets. Senior Project Manager Sutter Health August 2013  – Present (2 years 1 month) mather, ca Delivering improvements to healthcare, specializing in Laboratory projects. Developer of BI and PM tools to better manage the financial aspects of project/program budgets. VP Finance Project Management Institute, Sacramento Valley Chapter January 2014  – Present (1 year 8 months) Sacramento, California Area Volunteer VP of Finance for the local chapter of PMI VP Finance Project Management Institute, Sacramento Valley Chapter January 2014  – Present (1 year 8 months) Sacramento, California Area Volunteer VP of Finance for the local chapter of PMI Consultant Limitless Sky Squadron September 2010  – Present (5 years) Providing consultative services to the ownership team. Specializing in project and organizational guidance for the leadership team. Consultant Limitless Sky Squadron September 2010  – Present (5 years) Providing consultative services to the ownership team. Specializing in project and organizational guidance for the leadership team. Sr. IT Project Manager Coventry Health Care April 2008  –  August 2013  (5 years 5 months) West Sacramento, CA Sr. Project Manager and SharePoint developer for SW development projects for Health Care company in Workers Comp and Provider & Pricing applications. Sr. IT Project Manager Coventry Health Care April 2008  –  August 2013  (5 years 5 months) West Sacramento, CA Sr. Project Manager and SharePoint developer for SW development projects for Health Care company in Workers Comp and Provider & Pricing applications. Adjunct Instructor ITT Technical Institute August 2010  –  July 2013  (3 years) Rancho Cordova, CA Adjunct instructor of Project Management in the School of Information Technology at ITT Technical Institute. Teaching Decision-Making and Problem Solving Techniques, Leading Virtual teams, Leadership and Project Team Management, Introduction to Project Management and Project Management Tools and Techniques Adjunct Instructor ITT Technical Institute August 2010  –  July 2013  (3 years) Rancho Cordova, CA Adjunct instructor of Project Management in the School of Information Technology at ITT Technical Institute. Teaching Decision-Making and Problem Solving Techniques, Leading Virtual teams, Leadership and Project Team Management, Introduction to Project Management and Project Management Tools and Techniques Principal Performer, \"My Car Did\" Television and Web Commercials Mercedes Benz USA June 2010  –  December 2011  (1 year 7 months) Nationwide Television Commercial and the MBUSA Website Principal Performer, \"My Car Did\" Television and Web Commercials Mercedes Benz USA June 2010  –  December 2011  (1 year 7 months) Nationwide Television Commercial and the MBUSA Website Software Solutions Manager Miles Consulting Corp. July 2007  –  February 2008  (8 months) Managed complete SDLC software projects from client requirements gathering and validation through delivery and implementation. Completed multiple IT infrastructure implementation projects for several clients & all internal company systems. Consulted on Operational Improvement Issues. Facilitated company management team meetings to align company efforts. Software Solutions Manager Miles Consulting Corp. July 2007  –  February 2008  (8 months) Managed complete SDLC software projects from client requirements gathering and validation through delivery and implementation. Completed multiple IT infrastructure implementation projects for several clients & all internal company systems. Consulted on Operational Improvement Issues. Facilitated company management team meetings to align company efforts. Regional Training Manager EchoStar / Dish Network January 2007  –  July 2007  (7 months) Led regional training organization in delivering technical training to DNS Satellite installation offices. Identified need and initiated OE programs to standardize training systems and processes. Improved consistency in training programs throughout the region. Regional Training Manager EchoStar / Dish Network January 2007  –  July 2007  (7 months) Led regional training organization in delivering technical training to DNS Satellite installation offices. Identified need and initiated OE programs to standardize training systems and processes. Improved consistency in training programs throughout the region. Senior IT Manager Intel Corporation January 1995  –  July 2006  (11 years 7 months) Managed systems, networking and SW engineering teams in a zero-budget IT environment, recovering 103% of operational costs. Managed program life cycles, improving customer satisfaction and performance to schedule. Senior IT Manager Intel Corporation January 1995  –  July 2006  (11 years 7 months) Managed systems, networking and SW engineering teams in a zero-budget IT environment, recovering 103% of operational costs. Managed program life cycles, improving customer satisfaction and performance to schedule. US Technical Training Programs Manager, HR Intel Corporation January 1995  –  July 2006  (11 years 7 months) Led US training programs team in global development and rollout of technical training solutions supporting global design and engineering teams. US Technical Training Programs Manager, HR Intel Corporation January 1995  –  July 2006  (11 years 7 months) Led US training programs team in global development and rollout of technical training solutions supporting global design and engineering teams. Sr. Staff Software Testing Manager - Chipset Software Engineering Intel Corporation January 1995  –  July 2006  (11 years 7 months) Created and led SW test group, supporting application & driver software stack testing. Validated & certified chipset SW, meeting all delivery and quality guidelines. Improved Microsoft WHQL Certification testing throughput from six weeks to two weeks. Received several Divisional Recognition Awards Sr. Staff Software Testing Manager - Chipset Software Engineering Intel Corporation January 1995  –  July 2006  (11 years 7 months) Created and led SW test group, supporting application & driver software stack testing. Validated & certified chipset SW, meeting all delivery and quality guidelines. Improved Microsoft WHQL Certification testing throughput from six weeks to two weeks. Received several Divisional Recognition Awards Intel University Instructor Intel Corporation January 1995  –  July 2006  (11 years 7 months) Intel University Instructor for:  \nLeading Effective Meetings, Performing to Intel Values (New Hire Class), Management Skills Training Series, Management Task Cycle, & Goal Setting. Global Facilitator for Managing Through People (Offsite, Week-long, Front-line Manager training program). Intel University Instructor Intel Corporation January 1995  –  July 2006  (11 years 7 months) Intel University Instructor for:  \nLeading Effective Meetings, Performing to Intel Values (New Hire Class), Management Skills Training Series, Management Task Cycle, & Goal Setting. Global Facilitator for Managing Through People (Offsite, Week-long, Front-line Manager training program). Skills PMP Certified Scrum Master... Program Management Integration Business Process... Agile Methodologies PMO Project Management Cross-functional Team... Visio SharePoint Business Analysis Change Management SDLC Voice of the Customer Business Requirements IV&V Requirements Analysis Leadership Management Strategy Testing Training Consulting Enterprise Architecture Team Building Vendor Management Project Portfolio... Organizational... Software Documentation Process Improvement IT Management Requirements Gathering Resource Management Information Technology Agile Project Management Business Process Business Intelligence Microsoft SQL Server CRM IT Strategy MS Project Networking Software Project... Disaster Recovery Software Development Human Resources Quality Assurance Team Leadership Systems Analysis See 35+     See less Skills  PMP Certified Scrum Master... Program Management Integration Business Process... Agile Methodologies PMO Project Management Cross-functional Team... Visio SharePoint Business Analysis Change Management SDLC Voice of the Customer Business Requirements IV&V Requirements Analysis Leadership Management Strategy Testing Training Consulting Enterprise Architecture Team Building Vendor Management Project Portfolio... Organizational... Software Documentation Process Improvement IT Management Requirements Gathering Resource Management Information Technology Agile Project Management Business Process Business Intelligence Microsoft SQL Server CRM IT Strategy MS Project Networking Software Project... Disaster Recovery Software Development Human Resources Quality Assurance Team Leadership Systems Analysis See 35+     See less PMP Certified Scrum Master... Program Management Integration Business Process... Agile Methodologies PMO Project Management Cross-functional Team... Visio SharePoint Business Analysis Change Management SDLC Voice of the Customer Business Requirements IV&V Requirements Analysis Leadership Management Strategy Testing Training Consulting Enterprise Architecture Team Building Vendor Management Project Portfolio... Organizational... Software Documentation Process Improvement IT Management Requirements Gathering Resource Management Information Technology Agile Project Management Business Process Business Intelligence Microsoft SQL Server CRM IT Strategy MS Project Networking Software Project... Disaster Recovery Software Development Human Resources Quality Assurance Team Leadership Systems Analysis See 35+     See less PMP Certified Scrum Master... Program Management Integration Business Process... Agile Methodologies PMO Project Management Cross-functional Team... Visio SharePoint Business Analysis Change Management SDLC Voice of the Customer Business Requirements IV&V Requirements Analysis Leadership Management Strategy Testing Training Consulting Enterprise Architecture Team Building Vendor Management Project Portfolio... Organizational... Software Documentation Process Improvement IT Management Requirements Gathering Resource Management Information Technology Agile Project Management Business Process Business Intelligence Microsoft SQL Server CRM IT Strategy MS Project Networking Software Project... Disaster Recovery Software Development Human Resources Quality Assurance Team Leadership Systems Analysis See 35+     See less Education California State University-East Bay Bachelors California State University-East Bay Bachelors California State University-East Bay Bachelors California State University-East Bay Bachelors ", "Languages English Hindi English Hindi English Hindi Skills SoC Specman Microprocessors ASIC Semiconductors Project Management Problem Solving Vendor Management Customer Engagement WiFi Bluetooth NFC GPS Software Engineering Platform Integration Android Windows 8 Debugging Integration Embedded Software Go-to-market Strategy Embedded Systems Digital TV See 8+     See less Skills  SoC Specman Microprocessors ASIC Semiconductors Project Management Problem Solving Vendor Management Customer Engagement WiFi Bluetooth NFC GPS Software Engineering Platform Integration Android Windows 8 Debugging Integration Embedded Software Go-to-market Strategy Embedded Systems Digital TV See 8+     See less SoC Specman Microprocessors ASIC Semiconductors Project Management Problem Solving Vendor Management Customer Engagement WiFi Bluetooth NFC GPS Software Engineering Platform Integration Android Windows 8 Debugging Integration Embedded Software Go-to-market Strategy Embedded Systems Digital TV See 8+     See less SoC Specman Microprocessors ASIC Semiconductors Project Management Problem Solving Vendor Management Customer Engagement WiFi Bluetooth NFC GPS Software Engineering Platform Integration Android Windows 8 Debugging Integration Embedded Software Go-to-market Strategy Embedded Systems Digital TV See 8+     See less ", "Summary OBJECTIVE  \nLooking for software development opportunities where I can apply my technical skills, work experience and good work ethics. Specialties:•\tExperienced with application development using C++ and JAVA on Visual Studio 2010 and Eclipse. \n•\t4 months work experience in web development using VB.NET, ASP.NET and JQuery Summary OBJECTIVE  \nLooking for software development opportunities where I can apply my technical skills, work experience and good work ethics. Specialties:•\tExperienced with application development using C++ and JAVA on Visual Studio 2010 and Eclipse. \n•\t4 months work experience in web development using VB.NET, ASP.NET and JQuery OBJECTIVE  \nLooking for software development opportunities where I can apply my technical skills, work experience and good work ethics. Specialties:•\tExperienced with application development using C++ and JAVA on Visual Studio 2010 and Eclipse. \n•\t4 months work experience in web development using VB.NET, ASP.NET and JQuery OBJECTIVE  \nLooking for software development opportunities where I can apply my technical skills, work experience and good work ethics. Specialties:•\tExperienced with application development using C++ and JAVA on Visual Studio 2010 and Eclipse. \n•\t4 months work experience in web development using VB.NET, ASP.NET and JQuery Experience Software Engineering Intel Corporation July 2011  – Present (4 years 2 months) Hillsboro, Oregon Application Developer (Part Time) North Carolina State University June 2010  –  June 2011  (1 year 1 month) o\tDesigned a website for golf course turf pest control and management. (http://www.terc.ncsu.edu/) \no\tDesigned and developed a website for turf management for athletic fields. (http://ncsportsturf.org/) \no\tPerformance improvement for a website dedicated to irrigation water management for home lawns.(http://www.turffiles.ncsu.edu/tims/) \no\tCurrently developing an iPhone/iPad application for home lawn maintenance.  \no\tDevelopment in VB.NET, ASP.NET, JQuery, JavaScript and SQL Server 2008. (Visual Studio 2010, Firebug, IE Developers Tool) Graduate Student North Carolina State University August 2009  –  June 2011  (1 year 11 months) •\tApplications: \no\tDeveloped a walkie-talkie(VoIP on WiFi) application on android.(Android SDK, TCP, UDP, JAVA) \no\tDesigned an android application which tracks the location via GPS and displays alerts for that location.(JAVA) \no\tDeveloped an application for indoor localization by WiFi. (C#) \no\tImplemented a linked list to exploit parallelism in parallel computer architecture.(C++) \no\tExploited parallelism and improved performance of Gaussian and Histogram algorithms. (C++) \no\tDeveloped a chat application using UNIX Sockets and Threads. (C, Pthread, Unix Sockets) \n•\tData Structures: \no\tDesigned and developed a File-based Record Store using in memory index and availability list. (C++) \no\tImplemented Insertion and Search in Btree algorithm. (C++) \no\tImplemented chained hashing providing insert, search and delete functionality. (C++) \n•\tOperating Systems: \no\tImplemented Linux Scheduling and Aging Scheduling in XINU. \no\tImplemented Reader’s and Writer’s lock in XINU kernel along with Priority Inheritance. \no\tDeveloped a Garbage Collection mechanism for XINU which collects free memory after process ends. \no\tImplemented Disk Scheduling and Buffer Management with Prefetching in XINU. B .Tech VEERMATA JIJABAI TECHNOLOGICAL INSTITUTE June 2005  –  May 2009  (4 years) Course Projects: \n•\tLocation based network surveillance system using WiFi: Developed a software which uses existing WiFi infrastructure to determine physical location of the WiFi device by retrieving RSSI value. \n•\tAutomatic ticket Vending Machine: Designed an application for Automatic ticket Vending Machine in suburban railway (JAVA) along with an Online Ticket-booking System in JSP. \n•\tAutonomous Robot: Created an autonomous robot using Motorola Microcontroller and sensors which traces and follows a path lighted by IR diodes. Software Engineering Intel Corporation July 2011  – Present (4 years 2 months) Hillsboro, Oregon Software Engineering Intel Corporation July 2011  – Present (4 years 2 months) Hillsboro, Oregon Application Developer (Part Time) North Carolina State University June 2010  –  June 2011  (1 year 1 month) o\tDesigned a website for golf course turf pest control and management. (http://www.terc.ncsu.edu/) \no\tDesigned and developed a website for turf management for athletic fields. (http://ncsportsturf.org/) \no\tPerformance improvement for a website dedicated to irrigation water management for home lawns.(http://www.turffiles.ncsu.edu/tims/) \no\tCurrently developing an iPhone/iPad application for home lawn maintenance.  \no\tDevelopment in VB.NET, ASP.NET, JQuery, JavaScript and SQL Server 2008. (Visual Studio 2010, Firebug, IE Developers Tool) Application Developer (Part Time) North Carolina State University June 2010  –  June 2011  (1 year 1 month) o\tDesigned a website for golf course turf pest control and management. (http://www.terc.ncsu.edu/) \no\tDesigned and developed a website for turf management for athletic fields. (http://ncsportsturf.org/) \no\tPerformance improvement for a website dedicated to irrigation water management for home lawns.(http://www.turffiles.ncsu.edu/tims/) \no\tCurrently developing an iPhone/iPad application for home lawn maintenance.  \no\tDevelopment in VB.NET, ASP.NET, JQuery, JavaScript and SQL Server 2008. (Visual Studio 2010, Firebug, IE Developers Tool) Graduate Student North Carolina State University August 2009  –  June 2011  (1 year 11 months) •\tApplications: \no\tDeveloped a walkie-talkie(VoIP on WiFi) application on android.(Android SDK, TCP, UDP, JAVA) \no\tDesigned an android application which tracks the location via GPS and displays alerts for that location.(JAVA) \no\tDeveloped an application for indoor localization by WiFi. (C#) \no\tImplemented a linked list to exploit parallelism in parallel computer architecture.(C++) \no\tExploited parallelism and improved performance of Gaussian and Histogram algorithms. (C++) \no\tDeveloped a chat application using UNIX Sockets and Threads. (C, Pthread, Unix Sockets) \n•\tData Structures: \no\tDesigned and developed a File-based Record Store using in memory index and availability list. (C++) \no\tImplemented Insertion and Search in Btree algorithm. (C++) \no\tImplemented chained hashing providing insert, search and delete functionality. (C++) \n•\tOperating Systems: \no\tImplemented Linux Scheduling and Aging Scheduling in XINU. \no\tImplemented Reader’s and Writer’s lock in XINU kernel along with Priority Inheritance. \no\tDeveloped a Garbage Collection mechanism for XINU which collects free memory after process ends. \no\tImplemented Disk Scheduling and Buffer Management with Prefetching in XINU. Graduate Student North Carolina State University August 2009  –  June 2011  (1 year 11 months) •\tApplications: \no\tDeveloped a walkie-talkie(VoIP on WiFi) application on android.(Android SDK, TCP, UDP, JAVA) \no\tDesigned an android application which tracks the location via GPS and displays alerts for that location.(JAVA) \no\tDeveloped an application for indoor localization by WiFi. (C#) \no\tImplemented a linked list to exploit parallelism in parallel computer architecture.(C++) \no\tExploited parallelism and improved performance of Gaussian and Histogram algorithms. (C++) \no\tDeveloped a chat application using UNIX Sockets and Threads. (C, Pthread, Unix Sockets) \n•\tData Structures: \no\tDesigned and developed a File-based Record Store using in memory index and availability list. (C++) \no\tImplemented Insertion and Search in Btree algorithm. (C++) \no\tImplemented chained hashing providing insert, search and delete functionality. (C++) \n•\tOperating Systems: \no\tImplemented Linux Scheduling and Aging Scheduling in XINU. \no\tImplemented Reader’s and Writer’s lock in XINU kernel along with Priority Inheritance. \no\tDeveloped a Garbage Collection mechanism for XINU which collects free memory after process ends. \no\tImplemented Disk Scheduling and Buffer Management with Prefetching in XINU. B .Tech VEERMATA JIJABAI TECHNOLOGICAL INSTITUTE June 2005  –  May 2009  (4 years) Course Projects: \n•\tLocation based network surveillance system using WiFi: Developed a software which uses existing WiFi infrastructure to determine physical location of the WiFi device by retrieving RSSI value. \n•\tAutomatic ticket Vending Machine: Designed an application for Automatic ticket Vending Machine in suburban railway (JAVA) along with an Online Ticket-booking System in JSP. \n•\tAutonomous Robot: Created an autonomous robot using Motorola Microcontroller and sensors which traces and follows a path lighted by IR diodes. B .Tech VEERMATA JIJABAI TECHNOLOGICAL INSTITUTE June 2005  –  May 2009  (4 years) Course Projects: \n•\tLocation based network surveillance system using WiFi: Developed a software which uses existing WiFi infrastructure to determine physical location of the WiFi device by retrieving RSSI value. \n•\tAutomatic ticket Vending Machine: Designed an application for Automatic ticket Vending Machine in suburban railway (JAVA) along with an Online Ticket-booking System in JSP. \n•\tAutonomous Robot: Created an autonomous robot using Motorola Microcontroller and sensors which traces and follows a path lighted by IR diodes. Languages English Native or bilingual proficiency Marathi Native or bilingual proficiency Hindi Native or bilingual proficiency English Native or bilingual proficiency Marathi Native or bilingual proficiency Hindi Native or bilingual proficiency English Native or bilingual proficiency Marathi Native or bilingual proficiency Hindi Native or bilingual proficiency Native or bilingual proficiency Native or bilingual proficiency Native or bilingual proficiency Skills Visual Studio 2010 Eclipse C++ C Java TCP, UDP Sockets Unix/Linux Skills  Visual Studio 2010 Eclipse C++ C Java TCP, UDP Sockets Unix/Linux Visual Studio 2010 Eclipse C++ C Java TCP, UDP Sockets Unix/Linux Visual Studio 2010 Eclipse C++ C Java TCP, UDP Sockets Unix/Linux Education North Carolina State University MS,  Computer Science 2009  – 2010 Courses Undertaken:  \nOperating Systems Concepts, Architecture of Parallel Computers, Computer Networks, Network Security, Design and Analysis of Algorithms, Service Oriented Computing, Wireless Networks, Internet Protocols, Database Management System, Advanced Data Structures. Veermata Jijabai Technological Institute BTech,  Computer Science 2005  – 2009 North Carolina State University MS,  Computer Science 2009  – 2010 Courses Undertaken:  \nOperating Systems Concepts, Architecture of Parallel Computers, Computer Networks, Network Security, Design and Analysis of Algorithms, Service Oriented Computing, Wireless Networks, Internet Protocols, Database Management System, Advanced Data Structures. North Carolina State University MS,  Computer Science 2009  – 2010 Courses Undertaken:  \nOperating Systems Concepts, Architecture of Parallel Computers, Computer Networks, Network Security, Design and Analysis of Algorithms, Service Oriented Computing, Wireless Networks, Internet Protocols, Database Management System, Advanced Data Structures. North Carolina State University MS,  Computer Science 2009  – 2010 Courses Undertaken:  \nOperating Systems Concepts, Architecture of Parallel Computers, Computer Networks, Network Security, Design and Analysis of Algorithms, Service Oriented Computing, Wireless Networks, Internet Protocols, Database Management System, Advanced Data Structures. Veermata Jijabai Technological Institute BTech,  Computer Science 2005  – 2009 Veermata Jijabai Technological Institute BTech,  Computer Science 2005  – 2009 Veermata Jijabai Technological Institute BTech,  Computer Science 2005  – 2009 Honors & Awards Additional Honors & Awards •\tSecured Sun Certification For JAVA 2 Programmer (SCJP), Standard Edition 5.0 with 70% \n•\tRecipient of the JRD TATA Scholarship for academic excellence in year 2006-2007 and 2007-2008 Additional Honors & Awards •\tSecured Sun Certification For JAVA 2 Programmer (SCJP), Standard Edition 5.0 with 70% \n•\tRecipient of the JRD TATA Scholarship for academic excellence in year 2006-2007 and 2007-2008 Additional Honors & Awards •\tSecured Sun Certification For JAVA 2 Programmer (SCJP), Standard Edition 5.0 with 70% \n•\tRecipient of the JRD TATA Scholarship for academic excellence in year 2006-2007 and 2007-2008 Additional Honors & Awards •\tSecured Sun Certification For JAVA 2 Programmer (SCJP), Standard Edition 5.0 with 70% \n•\tRecipient of the JRD TATA Scholarship for academic excellence in year 2006-2007 and 2007-2008 ", "Skills Embedded Software Debugging Embedded Systems ClearCase Software Development Linux Perl C Software Engineering XML Device Drivers Programming Java Software Design Solaris Unix Agile Methodologies System Architecture Operating Systems Object Oriented Design Distributed Systems Shell Scripting Firmware See 8+     See less Skills  Embedded Software Debugging Embedded Systems ClearCase Software Development Linux Perl C Software Engineering XML Device Drivers Programming Java Software Design Solaris Unix Agile Methodologies System Architecture Operating Systems Object Oriented Design Distributed Systems Shell Scripting Firmware See 8+     See less Embedded Software Debugging Embedded Systems ClearCase Software Development Linux Perl C Software Engineering XML Device Drivers Programming Java Software Design Solaris Unix Agile Methodologies System Architecture Operating Systems Object Oriented Design Distributed Systems Shell Scripting Firmware See 8+     See less Embedded Software Debugging Embedded Systems ClearCase Software Development Linux Perl C Software Engineering XML Device Drivers Programming Java Software Design Solaris Unix Agile Methodologies System Architecture Operating Systems Object Oriented Design Distributed Systems Shell Scripting Firmware See 8+     See less ", "Summary Recognized Technical Engineering Management & Leadership ◈ High Performing Global Manager \n \n◈ During my time at Intel, I have provided exceptional technical leadership driving efficiency, motivating teams and delivering products and solutions. Championed many products and programs through definition, planning, and implementation. Consistently delivering high quality results and meeting aggressive deadlines brings great satisfaction to my work.  \n \nPROJECT LEADERSHIP: I am passionate about building and leading skilled teams, focusing on exceeding results at every opportunity. A great example of this is when I relocated to Shanghai for a 2 year assignment as the Business Unit Site Manager to lead the overall Windows and Android tablet site activities accountable to both SW and HW engineering teams. During those years, I excelled in streamlining processes, creating more efficiency and becoming a key contributor to the overall organization.  \n \nRESULTS: My team delivered two major products within 6 months- one of the fastest accelerating product deliveries ever.  \n \n◈ Throughout my experience, I have developed excellent management skills, providing clear and visible leadership to the teams I have collaborated with. It is rewarding to effectively communicate with both internal and external vendors and customers. \n \nSPECIALTIES: \nLeadership Skills ▹ High Performing Global Contributor ▹ Excellent Communication Skills \nCreative Problem Solving ▹ Technical Engineering Management ▹ Builds & Strengthens High Performing Teams ▹ Product Program Management & Coordination \n \n \n◈ Professional Connections Welcome.  Summary Recognized Technical Engineering Management & Leadership ◈ High Performing Global Manager \n \n◈ During my time at Intel, I have provided exceptional technical leadership driving efficiency, motivating teams and delivering products and solutions. Championed many products and programs through definition, planning, and implementation. Consistently delivering high quality results and meeting aggressive deadlines brings great satisfaction to my work.  \n \nPROJECT LEADERSHIP: I am passionate about building and leading skilled teams, focusing on exceeding results at every opportunity. A great example of this is when I relocated to Shanghai for a 2 year assignment as the Business Unit Site Manager to lead the overall Windows and Android tablet site activities accountable to both SW and HW engineering teams. During those years, I excelled in streamlining processes, creating more efficiency and becoming a key contributor to the overall organization.  \n \nRESULTS: My team delivered two major products within 6 months- one of the fastest accelerating product deliveries ever.  \n \n◈ Throughout my experience, I have developed excellent management skills, providing clear and visible leadership to the teams I have collaborated with. It is rewarding to effectively communicate with both internal and external vendors and customers. \n \nSPECIALTIES: \nLeadership Skills ▹ High Performing Global Contributor ▹ Excellent Communication Skills \nCreative Problem Solving ▹ Technical Engineering Management ▹ Builds & Strengthens High Performing Teams ▹ Product Program Management & Coordination \n \n \n◈ Professional Connections Welcome.  Recognized Technical Engineering Management & Leadership ◈ High Performing Global Manager \n \n◈ During my time at Intel, I have provided exceptional technical leadership driving efficiency, motivating teams and delivering products and solutions. Championed many products and programs through definition, planning, and implementation. Consistently delivering high quality results and meeting aggressive deadlines brings great satisfaction to my work.  \n \nPROJECT LEADERSHIP: I am passionate about building and leading skilled teams, focusing on exceeding results at every opportunity. A great example of this is when I relocated to Shanghai for a 2 year assignment as the Business Unit Site Manager to lead the overall Windows and Android tablet site activities accountable to both SW and HW engineering teams. During those years, I excelled in streamlining processes, creating more efficiency and becoming a key contributor to the overall organization.  \n \nRESULTS: My team delivered two major products within 6 months- one of the fastest accelerating product deliveries ever.  \n \n◈ Throughout my experience, I have developed excellent management skills, providing clear and visible leadership to the teams I have collaborated with. It is rewarding to effectively communicate with both internal and external vendors and customers. \n \nSPECIALTIES: \nLeadership Skills ▹ High Performing Global Contributor ▹ Excellent Communication Skills \nCreative Problem Solving ▹ Technical Engineering Management ▹ Builds & Strengthens High Performing Teams ▹ Product Program Management & Coordination \n \n \n◈ Professional Connections Welcome.  Recognized Technical Engineering Management & Leadership ◈ High Performing Global Manager \n \n◈ During my time at Intel, I have provided exceptional technical leadership driving efficiency, motivating teams and delivering products and solutions. Championed many products and programs through definition, planning, and implementation. Consistently delivering high quality results and meeting aggressive deadlines brings great satisfaction to my work.  \n \nPROJECT LEADERSHIP: I am passionate about building and leading skilled teams, focusing on exceeding results at every opportunity. A great example of this is when I relocated to Shanghai for a 2 year assignment as the Business Unit Site Manager to lead the overall Windows and Android tablet site activities accountable to both SW and HW engineering teams. During those years, I excelled in streamlining processes, creating more efficiency and becoming a key contributor to the overall organization.  \n \nRESULTS: My team delivered two major products within 6 months- one of the fastest accelerating product deliveries ever.  \n \n◈ Throughout my experience, I have developed excellent management skills, providing clear and visible leadership to the teams I have collaborated with. It is rewarding to effectively communicate with both internal and external vendors and customers. \n \nSPECIALTIES: \nLeadership Skills ▹ High Performing Global Contributor ▹ Excellent Communication Skills \nCreative Problem Solving ▹ Technical Engineering Management ▹ Builds & Strengthens High Performing Teams ▹ Product Program Management & Coordination \n \n \n◈ Professional Connections Welcome.  Experience Director - Mobile Software Engineering Intel Corporation March 2012  – Present (3 years 6 months) Santa Clara/CA , Shanghai/China, Bellevue/WA ▸ I responded to the request to head to Shanghai, China to serve as the Business Unit Site Manager in January 2013. I took advantage of the opportunity and spearheaded the Windows and Android Tablet Site activities for both software and hardware engineering teams.  \n \n▸ Currently, I hold the responsibility of serving as the Business Unit Site Manager and Windows Mobile Project Manager in Washington. In the Washington location, I drive the overall Windows Mobile SW Development and co-engineering activities with Microsoft. \n \n▸ Along with my large highly skilled team, I consistently deliver high quality software projects, exceeding stakeholder expectations. As the senior leader tasked with the development, validation and delivery of software for Intel's flagship SOC-based Windows Mobile design, I collaborate closely with a team of 120+ to deliver the Intel Windows Tablet. \n \n▸ The scope of my role also includes, driver and test content development, system integration, debug testing and delivery of high quality software to internal / external stakeholders.  \n \nRESULTS: Delivered two major products within six months- one of the fastest accelerating product deliveries ever.  \n Director - Mobile Software Engineering Intel Corporation March 2012  – Present (3 years 6 months) Santa Clara/CA , Shanghai/China, Bellevue/WA ▸ I responded to the request to head to Shanghai, China to serve as the Business Unit Site Manager in January 2013. I took advantage of the opportunity and spearheaded the Windows and Android Tablet Site activities for both software and hardware engineering teams.  \n \n▸ Currently, I hold the responsibility of serving as the Business Unit Site Manager and Windows Mobile Project Manager in Washington. In the Washington location, I drive the overall Windows Mobile SW Development and co-engineering activities with Microsoft. \n \n▸ Along with my large highly skilled team, I consistently deliver high quality software projects, exceeding stakeholder expectations. As the senior leader tasked with the development, validation and delivery of software for Intel's flagship SOC-based Windows Mobile design, I collaborate closely with a team of 120+ to deliver the Intel Windows Tablet. \n \n▸ The scope of my role also includes, driver and test content development, system integration, debug testing and delivery of high quality software to internal / external stakeholders.  \n \nRESULTS: Delivered two major products within six months- one of the fastest accelerating product deliveries ever.  \n Director - Mobile Software Engineering Intel Corporation March 2012  – Present (3 years 6 months) Santa Clara/CA , Shanghai/China, Bellevue/WA ▸ I responded to the request to head to Shanghai, China to serve as the Business Unit Site Manager in January 2013. I took advantage of the opportunity and spearheaded the Windows and Android Tablet Site activities for both software and hardware engineering teams.  \n \n▸ Currently, I hold the responsibility of serving as the Business Unit Site Manager and Windows Mobile Project Manager in Washington. In the Washington location, I drive the overall Windows Mobile SW Development and co-engineering activities with Microsoft. \n \n▸ Along with my large highly skilled team, I consistently deliver high quality software projects, exceeding stakeholder expectations. As the senior leader tasked with the development, validation and delivery of software for Intel's flagship SOC-based Windows Mobile design, I collaborate closely with a team of 120+ to deliver the Intel Windows Tablet. \n \n▸ The scope of my role also includes, driver and test content development, system integration, debug testing and delivery of high quality software to internal / external stakeholders.  \n \nRESULTS: Delivered two major products within six months- one of the fastest accelerating product deliveries ever.  \n Languages   Skills Skills     Honors & Awards ", "Experience Administrative Support TCG Software Engineering-Intel Corporation Intel Corporation January 2011  – Present (4 years 8 months) Administrative Support TCG Software Engineering-Intel Corporation Intel Corporation January 2011  – Present (4 years 8 months) Administrative Support TCG Software Engineering-Intel Corporation Intel Corporation January 2011  – Present (4 years 8 months) Skills Microsoft Excel Microsoft Word Training Microsoft Office Process Improvement Lean Manufacturing Manufacturing Management Team Leadership Leadership Customer Service Skills  Microsoft Excel Microsoft Word Training Microsoft Office Process Improvement Lean Manufacturing Manufacturing Management Team Leadership Leadership Customer Service Microsoft Excel Microsoft Word Training Microsoft Office Process Improvement Lean Manufacturing Manufacturing Management Team Leadership Leadership Customer Service Microsoft Excel Microsoft Word Training Microsoft Office Process Improvement Lean Manufacturing Manufacturing Management Team Leadership Leadership Customer Service ", "Skills Intel Software Engineering Algorithms Architecture Technology Development Device Drivers User-centered Design Processors Cloud Computing Firmware Software Development Operating Systems C Semiconductors Testing Debugging Embedded Systems Unix System Architecture Engineering Management Embedded Software Wireless TCP/IP Test Automation Software Design High Performance... Perl See 12+     See less Skills  Intel Software Engineering Algorithms Architecture Technology Development Device Drivers User-centered Design Processors Cloud Computing Firmware Software Development Operating Systems C Semiconductors Testing Debugging Embedded Systems Unix System Architecture Engineering Management Embedded Software Wireless TCP/IP Test Automation Software Design High Performance... Perl See 12+     See less Intel Software Engineering Algorithms Architecture Technology Development Device Drivers User-centered Design Processors Cloud Computing Firmware Software Development Operating Systems C Semiconductors Testing Debugging Embedded Systems Unix System Architecture Engineering Management Embedded Software Wireless TCP/IP Test Automation Software Design High Performance... Perl See 12+     See less Intel Software Engineering Algorithms Architecture Technology Development Device Drivers User-centered Design Processors Cloud Computing Firmware Software Development Operating Systems C Semiconductors Testing Debugging Embedded Systems Unix System Architecture Engineering Management Embedded Software Wireless TCP/IP Test Automation Software Design High Performance... Perl See 12+     See less ", "Summary Experienced product management, marketing, and engineering leader with a strong track record of building and leading high-performing organizations to deliver next generation products to market. University of Michigan undergraduate and Haas MBA with 14+ years of high tech industry experience including senior management positions.  \n \nAdept at identifying and understanding business opportunities, influencing C-level executives, defining product strategy, building strong execution teams, leading projects across regions, and working with industry partners to launch with success.  \n \nPrevious work experience at Intel Corporation, Digital Equipment Corporation, HP/Compaq. \n \nSpecialties: \n- Leading world-class engineering and marketing organizations \n- Product Management and strategy \n- Strategic partner relationships  \n- Business plan development \n- Competitive Analysis \n- Business plan and market development \n \nInterest/Focus:  \n- Computer graphics market across leading OSes \n- Consumer electronics \n- Graphics virtualization  \n- Cloud media processing (H.264, HEVC, video transcoding) \n- Embedded SoC Development \n- Advanced 3D and compute API’s (OpenCL, OpenGL, OpenGL-ES) Summary Experienced product management, marketing, and engineering leader with a strong track record of building and leading high-performing organizations to deliver next generation products to market. University of Michigan undergraduate and Haas MBA with 14+ years of high tech industry experience including senior management positions.  \n \nAdept at identifying and understanding business opportunities, influencing C-level executives, defining product strategy, building strong execution teams, leading projects across regions, and working with industry partners to launch with success.  \n \nPrevious work experience at Intel Corporation, Digital Equipment Corporation, HP/Compaq. \n \nSpecialties: \n- Leading world-class engineering and marketing organizations \n- Product Management and strategy \n- Strategic partner relationships  \n- Business plan development \n- Competitive Analysis \n- Business plan and market development \n \nInterest/Focus:  \n- Computer graphics market across leading OSes \n- Consumer electronics \n- Graphics virtualization  \n- Cloud media processing (H.264, HEVC, video transcoding) \n- Embedded SoC Development \n- Advanced 3D and compute API’s (OpenCL, OpenGL, OpenGL-ES) Experienced product management, marketing, and engineering leader with a strong track record of building and leading high-performing organizations to deliver next generation products to market. University of Michigan undergraduate and Haas MBA with 14+ years of high tech industry experience including senior management positions.  \n \nAdept at identifying and understanding business opportunities, influencing C-level executives, defining product strategy, building strong execution teams, leading projects across regions, and working with industry partners to launch with success.  \n \nPrevious work experience at Intel Corporation, Digital Equipment Corporation, HP/Compaq. \n \nSpecialties: \n- Leading world-class engineering and marketing organizations \n- Product Management and strategy \n- Strategic partner relationships  \n- Business plan development \n- Competitive Analysis \n- Business plan and market development \n \nInterest/Focus:  \n- Computer graphics market across leading OSes \n- Consumer electronics \n- Graphics virtualization  \n- Cloud media processing (H.264, HEVC, video transcoding) \n- Embedded SoC Development \n- Advanced 3D and compute API’s (OpenCL, OpenGL, OpenGL-ES) Experienced product management, marketing, and engineering leader with a strong track record of building and leading high-performing organizations to deliver next generation products to market. University of Michigan undergraduate and Haas MBA with 14+ years of high tech industry experience including senior management positions.  \n \nAdept at identifying and understanding business opportunities, influencing C-level executives, defining product strategy, building strong execution teams, leading projects across regions, and working with industry partners to launch with success.  \n \nPrevious work experience at Intel Corporation, Digital Equipment Corporation, HP/Compaq. \n \nSpecialties: \n- Leading world-class engineering and marketing organizations \n- Product Management and strategy \n- Strategic partner relationships  \n- Business plan development \n- Competitive Analysis \n- Business plan and market development \n \nInterest/Focus:  \n- Computer graphics market across leading OSes \n- Consumer electronics \n- Graphics virtualization  \n- Cloud media processing (H.264, HEVC, video transcoding) \n- Embedded SoC Development \n- Advanced 3D and compute API’s (OpenCL, OpenGL, OpenGL-ES) Skills Product Life Cycle... Strategic Planning Product Launch Channel Product Development Product Management Product Marketing Sales Management Team Building Go-to-market Strategy Negotiation SoC Strategy Business Development Strategic Partnerships Mobile Devices Business Operations Linux Business Strategy GPU Android Cloud Computing Intel Processors Device Drivers See 10+     See less Skills  Product Life Cycle... Strategic Planning Product Launch Channel Product Development Product Management Product Marketing Sales Management Team Building Go-to-market Strategy Negotiation SoC Strategy Business Development Strategic Partnerships Mobile Devices Business Operations Linux Business Strategy GPU Android Cloud Computing Intel Processors Device Drivers See 10+     See less Product Life Cycle... Strategic Planning Product Launch Channel Product Development Product Management Product Marketing Sales Management Team Building Go-to-market Strategy Negotiation SoC Strategy Business Development Strategic Partnerships Mobile Devices Business Operations Linux Business Strategy GPU Android Cloud Computing Intel Processors Device Drivers See 10+     See less Product Life Cycle... Strategic Planning Product Launch Channel Product Development Product Management Product Marketing Sales Management Team Building Go-to-market Strategy Negotiation SoC Strategy Business Development Strategic Partnerships Mobile Devices Business Operations Linux Business Strategy GPU Android Cloud Computing Intel Processors Device Drivers See 10+     See less Education University of California, Berkeley - Walter A. Haas School of Business MBA 2005  – 2008 Stanford University Certificate,  Management Science and Engineering 2003  – 2005 Product Management focus: Product strategy, launch, and marcom University of Michigan BSE,  Computer Engineering 1995  – 2000 Activities and Societies:  Michigan Future Car Team ,  SAE ,  Student Mentor University of California, Berkeley - Walter A. Haas School of Business MBA 2005  – 2008 University of California, Berkeley - Walter A. Haas School of Business MBA 2005  – 2008 University of California, Berkeley - Walter A. Haas School of Business MBA 2005  – 2008 Stanford University Certificate,  Management Science and Engineering 2003  – 2005 Product Management focus: Product strategy, launch, and marcom Stanford University Certificate,  Management Science and Engineering 2003  – 2005 Product Management focus: Product strategy, launch, and marcom Stanford University Certificate,  Management Science and Engineering 2003  – 2005 Product Management focus: Product strategy, launch, and marcom University of Michigan BSE,  Computer Engineering 1995  – 2000 Activities and Societies:  Michigan Future Car Team ,  SAE ,  Student Mentor University of Michigan BSE,  Computer Engineering 1995  – 2000 Activities and Societies:  Michigan Future Car Team ,  SAE ,  Student Mentor University of Michigan BSE,  Computer Engineering 1995  – 2000 Activities and Societies:  Michigan Future Car Team ,  SAE ,  Student Mentor ", "Experience Software Engineering Intel Corporation Software Engineering Intel Corporation Software Engineering Intel Corporation ", "Experience Sr Manager, Global Product Management Expedia May 2011  – Present (4 years 4 months) Product Marketing Engineer Intel Corporation May 2009  –  October 2010  (1 year 6 months) Project Manager - Software Engineering Intel Corporation May 2007  –  May 2009  (2 years 1 month) Project Manager/ Lead Test Engineer Inter-Tel Inc April 2004  –  May 2007  (3 years 2 months) Software Engineer Motorola July 2001  –  February 2003  (1 year 8 months) Sr Manager, Global Product Management Expedia May 2011  – Present (4 years 4 months) Sr Manager, Global Product Management Expedia May 2011  – Present (4 years 4 months) Product Marketing Engineer Intel Corporation May 2009  –  October 2010  (1 year 6 months) Product Marketing Engineer Intel Corporation May 2009  –  October 2010  (1 year 6 months) Project Manager - Software Engineering Intel Corporation May 2007  –  May 2009  (2 years 1 month) Project Manager - Software Engineering Intel Corporation May 2007  –  May 2009  (2 years 1 month) Project Manager/ Lead Test Engineer Inter-Tel Inc April 2004  –  May 2007  (3 years 2 months) Project Manager/ Lead Test Engineer Inter-Tel Inc April 2004  –  May 2007  (3 years 2 months) Software Engineer Motorola July 2001  –  February 2003  (1 year 8 months) Software Engineer Motorola July 2001  –  February 2003  (1 year 8 months) Skills Agile Methodologies Program Management Software Development Product Management Software Engineering Software Project... Agile Project Management Requirements Analysis Integration Telecommunications Scrum Product Marketing Project Management SDLC Testing Cloud Computing Mobile Devices SaaS E-commerce XML See 5+     See less Skills  Agile Methodologies Program Management Software Development Product Management Software Engineering Software Project... Agile Project Management Requirements Analysis Integration Telecommunications Scrum Product Marketing Project Management SDLC Testing Cloud Computing Mobile Devices SaaS E-commerce XML See 5+     See less Agile Methodologies Program Management Software Development Product Management Software Engineering Software Project... Agile Project Management Requirements Analysis Integration Telecommunications Scrum Product Marketing Project Management SDLC Testing Cloud Computing Mobile Devices SaaS E-commerce XML See 5+     See less Agile Methodologies Program Management Software Development Product Management Software Engineering Software Project... Agile Project Management Requirements Analysis Integration Telecommunications Scrum Product Marketing Project Management SDLC Testing Cloud Computing Mobile Devices SaaS E-commerce XML See 5+     See less Education University of Massachusetts, Amherst 1999  – 2001 Regional Engineering College, Trichy BE 1995  – 1999 University of Massachusetts, Amherst 1999  – 2001 University of Massachusetts, Amherst 1999  – 2001 University of Massachusetts, Amherst 1999  – 2001 Regional Engineering College, Trichy BE 1995  – 1999 Regional Engineering College, Trichy BE 1995  – 1999 Regional Engineering College, Trichy BE 1995  – 1999 ", "Skills Agile Methodologies Robotics Graphics Software Engineering Debugging Device Drivers GPU C++ Embedded Systems Intel C Computer Architecture OpenGL Embedded Software Software Development System Architecture High Performance... Processors Engineering Management OpenCV ROS Electronic Circuit... Unix X86 Software Design Hardware SoC Algorithms See 13+     See less Skills  Agile Methodologies Robotics Graphics Software Engineering Debugging Device Drivers GPU C++ Embedded Systems Intel C Computer Architecture OpenGL Embedded Software Software Development System Architecture High Performance... Processors Engineering Management OpenCV ROS Electronic Circuit... Unix X86 Software Design Hardware SoC Algorithms See 13+     See less Agile Methodologies Robotics Graphics Software Engineering Debugging Device Drivers GPU C++ Embedded Systems Intel C Computer Architecture OpenGL Embedded Software Software Development System Architecture High Performance... Processors Engineering Management OpenCV ROS Electronic Circuit... Unix X86 Software Design Hardware SoC Algorithms See 13+     See less Agile Methodologies Robotics Graphics Software Engineering Debugging Device Drivers GPU C++ Embedded Systems Intel C Computer Architecture OpenGL Embedded Software Software Development System Architecture High Performance... Processors Engineering Management OpenCV ROS Electronic Circuit... Unix X86 Software Design Hardware SoC Algorithms See 13+     See less ", "Experience Software Engineering Intel Corporation February 2013  – Present (2 years 7 months) Lake Zurich, IL Distinguished Member of the Technical Staff Motorola Mobility powered by Google January 1990  –  February 2013  (23 years 2 months) Libertyville, IL SW Engineer Rockwell Collins 1986  –  1990  (4 years) SW/HW Engineer American Business Computers 1982  –  1984  (2 years) Software Engineering Intel Corporation February 2013  – Present (2 years 7 months) Lake Zurich, IL Software Engineering Intel Corporation February 2013  – Present (2 years 7 months) Lake Zurich, IL Distinguished Member of the Technical Staff Motorola Mobility powered by Google January 1990  –  February 2013  (23 years 2 months) Libertyville, IL Distinguished Member of the Technical Staff Motorola Mobility powered by Google January 1990  –  February 2013  (23 years 2 months) Libertyville, IL SW Engineer Rockwell Collins 1986  –  1990  (4 years) SW Engineer Rockwell Collins 1986  –  1990  (4 years) SW/HW Engineer American Business Computers 1982  –  1984  (2 years) SW/HW Engineer American Business Computers 1982  –  1984  (2 years) Skills Management Linux Software Engineering Mobile Devices UMTS Debugging Embedded Software LTE ClearCase Testing Perl Wireless CDMA RF Embedded Systems 3G Project Management Unix Software Development Android Test Automation Telecommunications GSM Mobile Communications Cellular Communications Device Drivers RTOS C 3GPP See 14+     See less Skills  Management Linux Software Engineering Mobile Devices UMTS Debugging Embedded Software LTE ClearCase Testing Perl Wireless CDMA RF Embedded Systems 3G Project Management Unix Software Development Android Test Automation Telecommunications GSM Mobile Communications Cellular Communications Device Drivers RTOS C 3GPP See 14+     See less Management Linux Software Engineering Mobile Devices UMTS Debugging Embedded Software LTE ClearCase Testing Perl Wireless CDMA RF Embedded Systems 3G Project Management Unix Software Development Android Test Automation Telecommunications GSM Mobile Communications Cellular Communications Device Drivers RTOS C 3GPP See 14+     See less Management Linux Software Engineering Mobile Devices UMTS Debugging Embedded Software LTE ClearCase Testing Perl Wireless CDMA RF Embedded Systems 3G Project Management Unix Software Development Android Test Automation Telecommunications GSM Mobile Communications Cellular Communications Device Drivers RTOS C 3GPP See 14+     See less Education Purdue University 1978  – 1982 Purdue University 1978  – 1982 Purdue University 1978  – 1982 Purdue University 1978  – 1982 ", "Summary Technology executive with 15 years’ experience in the development of new software products for the global market in high end Internet technologies. Passionate leader with track record in the creation of high performing teams, and management within complexity and uncertainty. General management experience across the entire product lifecycle and organizational boundaries. \n \nSkills Profile: \n-\tPassionate people leader, flexible and eager to learn, able to drive change at all organizational levels. \n-\tBusiness and strategic acumen. Demonstrated ability to lead team towards identifying patterns of change in the industry, prioritizing customer input and synthesizing strategic business opportunities. \n-\tHands on experience on the latest software product development practices, such as lean product management, user centered design, business modeling, high maturity & Agile software engineering practices. \n-\tOutstanding communication and interpersonal skills, applied to harmonically manage internal and external stakeholders. Experience in international environments. Summary Technology executive with 15 years’ experience in the development of new software products for the global market in high end Internet technologies. Passionate leader with track record in the creation of high performing teams, and management within complexity and uncertainty. General management experience across the entire product lifecycle and organizational boundaries. \n \nSkills Profile: \n-\tPassionate people leader, flexible and eager to learn, able to drive change at all organizational levels. \n-\tBusiness and strategic acumen. Demonstrated ability to lead team towards identifying patterns of change in the industry, prioritizing customer input and synthesizing strategic business opportunities. \n-\tHands on experience on the latest software product development practices, such as lean product management, user centered design, business modeling, high maturity & Agile software engineering practices. \n-\tOutstanding communication and interpersonal skills, applied to harmonically manage internal and external stakeholders. Experience in international environments. Technology executive with 15 years’ experience in the development of new software products for the global market in high end Internet technologies. Passionate leader with track record in the creation of high performing teams, and management within complexity and uncertainty. General management experience across the entire product lifecycle and organizational boundaries. \n \nSkills Profile: \n-\tPassionate people leader, flexible and eager to learn, able to drive change at all organizational levels. \n-\tBusiness and strategic acumen. Demonstrated ability to lead team towards identifying patterns of change in the industry, prioritizing customer input and synthesizing strategic business opportunities. \n-\tHands on experience on the latest software product development practices, such as lean product management, user centered design, business modeling, high maturity & Agile software engineering practices. \n-\tOutstanding communication and interpersonal skills, applied to harmonically manage internal and external stakeholders. Experience in international environments. Technology executive with 15 years’ experience in the development of new software products for the global market in high end Internet technologies. Passionate leader with track record in the creation of high performing teams, and management within complexity and uncertainty. General management experience across the entire product lifecycle and organizational boundaries. \n \nSkills Profile: \n-\tPassionate people leader, flexible and eager to learn, able to drive change at all organizational levels. \n-\tBusiness and strategic acumen. Demonstrated ability to lead team towards identifying patterns of change in the industry, prioritizing customer input and synthesizing strategic business opportunities. \n-\tHands on experience on the latest software product development practices, such as lean product management, user centered design, business modeling, high maturity & Agile software engineering practices. \n-\tOutstanding communication and interpersonal skills, applied to harmonically manage internal and external stakeholders. Experience in international environments. Experience Director Software Engineering Intel Corporation June 2014  – Present (1 year 3 months) Cordoba, Argentina Software Design Center - Responsible to lead a large engineering organization that develops and ships several software products, within Intel Security (McAfee) Security Manageability portfolio, to materialize the company's Security Connected vision. \n \nhttp://www.mcafee.com/us/enterprise/security-connected/index.aspx ASDC Site Staff Member Intel Corporation May 2006  – Present (9 years 4 months) Cordoba, Argentina Software Design Center -\tMember of site management team, responsible for organizational development, from Mission/Vision/Strategic goals formulation up to Talent Management programs, with broad general management scope, spanning engineering & product supervision, facilities, finance, HR, government & ecosystem management.  \n \n-\tAugmented ASDC & SSG organizational capabilities by creating the first SSG Product Management organization focused exclusively in consumer software & services, creating the first AppUp User Experience team, creating the Innovation & Pathfinding organization within Cordoba. Director, New Business Opportunities Intel Corporation January 2012  –  June 2014  (2 years 6 months) Cordoba, Argentina Software Design Center -\tResponsible to drive the strategic exploration, market identification, business planning and product definition of new software services lines of business that bring new recurrent revenue exploiting synergies with Intel hardware platforms. \n \n-\tLed cross geo, multi-disciplinary team which delivered: market opportunity sizing, customer segmentation and value proposition, business case & DCF financial projections, competitive analysis, preliminary GTM plans, product strategy and roadmap, M&A due diligence. Director, Product Management Intel Corporation January 2010  –  December 2011  (2 years) Portland, OR, USA – Cordoba, Argentina Software Design Center -\tLeader of worldwide product management team responsible for driving Intel AppUp Center (www.appup.com) product strategy and roadmap; developing the market requirements, market assessment and competitive analysis; driving the product release planning and ensuring that the product was delivered on time and also meeting the users’ needs through a strong focus on User Experience practices. \n \n-\tLed the strategic expansion of Intel AppUp into PCs and Ultrabooks; launched by CEO at Consumer Electronics Show 2010 & 2012. His team defined and managed about 20 product releases with over 100 features for multiple consumer platforms (netbooks, tablets, PCs, smartphones) and operating environments (Windows, MeeGo, Moblin) Engineering & Innovation Manager Intel January 2007  –  December 2009  (3 years) Cordoba, Argentina Software Design Center -\tLeader of engineering and innovation teams, responsible for the ideation, incubation and later productization of new software services for future Intel based hardware platforms. Applied strategic innovation methodologies combining usage, technology and business vectors.  \n \n-\tSuccessfully drove the incubation of a new product - Intel’s application store - from idea to project start up, delivering a key contribution to a new corporate strategic program aimed to grow Intel’s leadership in the netbooks market worldwide. Senior Software Engineer Intel May 2006  –  December 2006  (8 months) Senior Software Engineer Motorola July 2002  –  May 2006  (3 years 11 months) Cordoba, Argentina -\tTechnical leader in simultaneous development projects over BTS embedded architectures (15+ engineers). Introduction of new 3G UMTS firmware features into a production environment with a highly complex configuration management schema. Conduct project technical tasks and responsible for the quality of the produced artifacts. \n \n-\tSoftware development according to SEI CMM Level 5 practices. Participated in the deployment of organizational maturity processes from CMM L1 to L5. Systems Engineer Siemens February 1999  –  July 2002  (3 years 6 months) Buenos Aires, Argentina -\tCreation of mobile solutions portfolio. System and software design, implementation, test and deployment of solutions based on the integration of mobile services (SMS and WAP) with Internet technologies with focus on solutions for vertical markets and customers in Latin America (e.g. workforce management, infotainment, delivery, and automatic vehicle location).  \n \n-\tInternet Service Provider Nodes technical leader. Network design and configuration. Integration of tailored solutions from off-the-shelf components. Field deployment including customer know-how building and training for Small/Medium sized Telecommunication Operators across Argentina Director Software Engineering Intel Corporation June 2014  – Present (1 year 3 months) Cordoba, Argentina Software Design Center - Responsible to lead a large engineering organization that develops and ships several software products, within Intel Security (McAfee) Security Manageability portfolio, to materialize the company's Security Connected vision. \n \nhttp://www.mcafee.com/us/enterprise/security-connected/index.aspx Director Software Engineering Intel Corporation June 2014  – Present (1 year 3 months) Cordoba, Argentina Software Design Center - Responsible to lead a large engineering organization that develops and ships several software products, within Intel Security (McAfee) Security Manageability portfolio, to materialize the company's Security Connected vision. \n \nhttp://www.mcafee.com/us/enterprise/security-connected/index.aspx ASDC Site Staff Member Intel Corporation May 2006  – Present (9 years 4 months) Cordoba, Argentina Software Design Center -\tMember of site management team, responsible for organizational development, from Mission/Vision/Strategic goals formulation up to Talent Management programs, with broad general management scope, spanning engineering & product supervision, facilities, finance, HR, government & ecosystem management.  \n \n-\tAugmented ASDC & SSG organizational capabilities by creating the first SSG Product Management organization focused exclusively in consumer software & services, creating the first AppUp User Experience team, creating the Innovation & Pathfinding organization within Cordoba. ASDC Site Staff Member Intel Corporation May 2006  – Present (9 years 4 months) Cordoba, Argentina Software Design Center -\tMember of site management team, responsible for organizational development, from Mission/Vision/Strategic goals formulation up to Talent Management programs, with broad general management scope, spanning engineering & product supervision, facilities, finance, HR, government & ecosystem management.  \n \n-\tAugmented ASDC & SSG organizational capabilities by creating the first SSG Product Management organization focused exclusively in consumer software & services, creating the first AppUp User Experience team, creating the Innovation & Pathfinding organization within Cordoba. Director, New Business Opportunities Intel Corporation January 2012  –  June 2014  (2 years 6 months) Cordoba, Argentina Software Design Center -\tResponsible to drive the strategic exploration, market identification, business planning and product definition of new software services lines of business that bring new recurrent revenue exploiting synergies with Intel hardware platforms. \n \n-\tLed cross geo, multi-disciplinary team which delivered: market opportunity sizing, customer segmentation and value proposition, business case & DCF financial projections, competitive analysis, preliminary GTM plans, product strategy and roadmap, M&A due diligence. Director, New Business Opportunities Intel Corporation January 2012  –  June 2014  (2 years 6 months) Cordoba, Argentina Software Design Center -\tResponsible to drive the strategic exploration, market identification, business planning and product definition of new software services lines of business that bring new recurrent revenue exploiting synergies with Intel hardware platforms. \n \n-\tLed cross geo, multi-disciplinary team which delivered: market opportunity sizing, customer segmentation and value proposition, business case & DCF financial projections, competitive analysis, preliminary GTM plans, product strategy and roadmap, M&A due diligence. Director, Product Management Intel Corporation January 2010  –  December 2011  (2 years) Portland, OR, USA – Cordoba, Argentina Software Design Center -\tLeader of worldwide product management team responsible for driving Intel AppUp Center (www.appup.com) product strategy and roadmap; developing the market requirements, market assessment and competitive analysis; driving the product release planning and ensuring that the product was delivered on time and also meeting the users’ needs through a strong focus on User Experience practices. \n \n-\tLed the strategic expansion of Intel AppUp into PCs and Ultrabooks; launched by CEO at Consumer Electronics Show 2010 & 2012. His team defined and managed about 20 product releases with over 100 features for multiple consumer platforms (netbooks, tablets, PCs, smartphones) and operating environments (Windows, MeeGo, Moblin) Director, Product Management Intel Corporation January 2010  –  December 2011  (2 years) Portland, OR, USA – Cordoba, Argentina Software Design Center -\tLeader of worldwide product management team responsible for driving Intel AppUp Center (www.appup.com) product strategy and roadmap; developing the market requirements, market assessment and competitive analysis; driving the product release planning and ensuring that the product was delivered on time and also meeting the users’ needs through a strong focus on User Experience practices. \n \n-\tLed the strategic expansion of Intel AppUp into PCs and Ultrabooks; launched by CEO at Consumer Electronics Show 2010 & 2012. His team defined and managed about 20 product releases with over 100 features for multiple consumer platforms (netbooks, tablets, PCs, smartphones) and operating environments (Windows, MeeGo, Moblin) Engineering & Innovation Manager Intel January 2007  –  December 2009  (3 years) Cordoba, Argentina Software Design Center -\tLeader of engineering and innovation teams, responsible for the ideation, incubation and later productization of new software services for future Intel based hardware platforms. Applied strategic innovation methodologies combining usage, technology and business vectors.  \n \n-\tSuccessfully drove the incubation of a new product - Intel’s application store - from idea to project start up, delivering a key contribution to a new corporate strategic program aimed to grow Intel’s leadership in the netbooks market worldwide. Engineering & Innovation Manager Intel January 2007  –  December 2009  (3 years) Cordoba, Argentina Software Design Center -\tLeader of engineering and innovation teams, responsible for the ideation, incubation and later productization of new software services for future Intel based hardware platforms. Applied strategic innovation methodologies combining usage, technology and business vectors.  \n \n-\tSuccessfully drove the incubation of a new product - Intel’s application store - from idea to project start up, delivering a key contribution to a new corporate strategic program aimed to grow Intel’s leadership in the netbooks market worldwide. Senior Software Engineer Intel May 2006  –  December 2006  (8 months) Senior Software Engineer Intel May 2006  –  December 2006  (8 months) Senior Software Engineer Motorola July 2002  –  May 2006  (3 years 11 months) Cordoba, Argentina -\tTechnical leader in simultaneous development projects over BTS embedded architectures (15+ engineers). Introduction of new 3G UMTS firmware features into a production environment with a highly complex configuration management schema. Conduct project technical tasks and responsible for the quality of the produced artifacts. \n \n-\tSoftware development according to SEI CMM Level 5 practices. Participated in the deployment of organizational maturity processes from CMM L1 to L5. Senior Software Engineer Motorola July 2002  –  May 2006  (3 years 11 months) Cordoba, Argentina -\tTechnical leader in simultaneous development projects over BTS embedded architectures (15+ engineers). Introduction of new 3G UMTS firmware features into a production environment with a highly complex configuration management schema. Conduct project technical tasks and responsible for the quality of the produced artifacts. \n \n-\tSoftware development according to SEI CMM Level 5 practices. Participated in the deployment of organizational maturity processes from CMM L1 to L5. Systems Engineer Siemens February 1999  –  July 2002  (3 years 6 months) Buenos Aires, Argentina -\tCreation of mobile solutions portfolio. System and software design, implementation, test and deployment of solutions based on the integration of mobile services (SMS and WAP) with Internet technologies with focus on solutions for vertical markets and customers in Latin America (e.g. workforce management, infotainment, delivery, and automatic vehicle location).  \n \n-\tInternet Service Provider Nodes technical leader. Network design and configuration. Integration of tailored solutions from off-the-shelf components. Field deployment including customer know-how building and training for Small/Medium sized Telecommunication Operators across Argentina Systems Engineer Siemens February 1999  –  July 2002  (3 years 6 months) Buenos Aires, Argentina -\tCreation of mobile solutions portfolio. System and software design, implementation, test and deployment of solutions based on the integration of mobile services (SMS and WAP) with Internet technologies with focus on solutions for vertical markets and customers in Latin America (e.g. workforce management, infotainment, delivery, and automatic vehicle location).  \n \n-\tInternet Service Provider Nodes technical leader. Network design and configuration. Integration of tailored solutions from off-the-shelf components. Field deployment including customer know-how building and training for Small/Medium sized Telecommunication Operators across Argentina Languages English Full professional proficiency Spanish Native or bilingual proficiency German Elementary proficiency English Full professional proficiency Spanish Native or bilingual proficiency German Elementary proficiency English Full professional proficiency Spanish Native or bilingual proficiency German Elementary proficiency Full professional proficiency Native or bilingual proficiency Elementary proficiency Skills Product Management Software Development Software Engineering Agile Methodologies Leadership Strategy Competitive Analysis Embedded Systems Integration Mobile Devices Telecommunications Software Project... Product Development Engineering Management Wireless Software Design Technical Leadership Cloud Computing Go-to-market Strategy Cross-functional Team... Product Lifecycle... System Architecture Agile Project Management Scrum Management Team Leadership Enterprise Software Business Strategy Distributed Systems SaaS Testing Architectures Product Marketing Technical Marketing Mobile Technology Market Research User Experience Mobile Communications Business Planning See 24+     See less Skills  Product Management Software Development Software Engineering Agile Methodologies Leadership Strategy Competitive Analysis Embedded Systems Integration Mobile Devices Telecommunications Software Project... Product Development Engineering Management Wireless Software Design Technical Leadership Cloud Computing Go-to-market Strategy Cross-functional Team... Product Lifecycle... System Architecture Agile Project Management Scrum Management Team Leadership Enterprise Software Business Strategy Distributed Systems SaaS Testing Architectures Product Marketing Technical Marketing Mobile Technology Market Research User Experience Mobile Communications Business Planning See 24+     See less Product Management Software Development Software Engineering Agile Methodologies Leadership Strategy Competitive Analysis Embedded Systems Integration Mobile Devices Telecommunications Software Project... Product Development Engineering Management Wireless Software Design Technical Leadership Cloud Computing Go-to-market Strategy Cross-functional Team... Product Lifecycle... System Architecture Agile Project Management Scrum Management Team Leadership Enterprise Software Business Strategy Distributed Systems SaaS Testing Architectures Product Marketing Technical Marketing Mobile Technology Market Research User Experience Mobile Communications Business Planning See 24+     See less Product Management Software Development Software Engineering Agile Methodologies Leadership Strategy Competitive Analysis Embedded Systems Integration Mobile Devices Telecommunications Software Project... Product Development Engineering Management Wireless Software Design Technical Leadership Cloud Computing Go-to-market Strategy Cross-functional Team... Product Lifecycle... System Architecture Agile Project Management Scrum Management Team Leadership Enterprise Software Business Strategy Distributed Systems SaaS Testing Architectures Product Marketing Technical Marketing Mobile Technology Market Research User Experience Mobile Communications Business Planning See 24+     See less Education IAE Business School Executive Master of Business Administration (MBA),  Business Administration and Management , General 2012  – 2013 Magna Cum Laude, GPA 9.2/10 Universidad de Buenos Aires MEE,  Electronics Engineering 1993  – 2001 Honor Diploma, GPA: 8.6/10 Marianista Bachelor's degree 1981  – 1992 IAE Business School Executive Master of Business Administration (MBA),  Business Administration and Management , General 2012  – 2013 Magna Cum Laude, GPA 9.2/10 IAE Business School Executive Master of Business Administration (MBA),  Business Administration and Management , General 2012  – 2013 Magna Cum Laude, GPA 9.2/10 IAE Business School Executive Master of Business Administration (MBA),  Business Administration and Management , General 2012  – 2013 Magna Cum Laude, GPA 9.2/10 Universidad de Buenos Aires MEE,  Electronics Engineering 1993  – 2001 Honor Diploma, GPA: 8.6/10 Universidad de Buenos Aires MEE,  Electronics Engineering 1993  – 2001 Honor Diploma, GPA: 8.6/10 Universidad de Buenos Aires MEE,  Electronics Engineering 1993  – 2001 Honor Diploma, GPA: 8.6/10 Marianista Bachelor's degree 1981  – 1992 Marianista Bachelor's degree 1981  – 1992 Marianista Bachelor's degree 1981  – 1992 Honors & Awards ", "Summary Respected, self-managed, and highly adaptable Software / Applications Developer with a reputation for meeting deliverable goals using strong team-building, proven process planning skills, and 14-years of Applications/Software Development, Project Leadership, and Systems Analysis success with Intel. Particularly interested in web\\client application development and relational database design using MS-SQL Server. Always interested in migration projects, as well as evaluating current and future technologies that can improve employee productivity. Specialties:ASP.NET (C# & VB), Classic ASP, Scripting, SQL, XML, CSS, ISS, MS Visual Studio, MS Enterprise Manager, MS FrontPage, MS Office Suite, MS SharePoint, Wikis, DotNetNuke,MS Project, Photoshop, MS Access, Crystal Reports, Crystal Reports Server Summary Respected, self-managed, and highly adaptable Software / Applications Developer with a reputation for meeting deliverable goals using strong team-building, proven process planning skills, and 14-years of Applications/Software Development, Project Leadership, and Systems Analysis success with Intel. Particularly interested in web\\client application development and relational database design using MS-SQL Server. Always interested in migration projects, as well as evaluating current and future technologies that can improve employee productivity. Specialties:ASP.NET (C# & VB), Classic ASP, Scripting, SQL, XML, CSS, ISS, MS Visual Studio, MS Enterprise Manager, MS FrontPage, MS Office Suite, MS SharePoint, Wikis, DotNetNuke,MS Project, Photoshop, MS Access, Crystal Reports, Crystal Reports Server Respected, self-managed, and highly adaptable Software / Applications Developer with a reputation for meeting deliverable goals using strong team-building, proven process planning skills, and 14-years of Applications/Software Development, Project Leadership, and Systems Analysis success with Intel. Particularly interested in web\\client application development and relational database design using MS-SQL Server. Always interested in migration projects, as well as evaluating current and future technologies that can improve employee productivity. Specialties:ASP.NET (C# & VB), Classic ASP, Scripting, SQL, XML, CSS, ISS, MS Visual Studio, MS Enterprise Manager, MS FrontPage, MS Office Suite, MS SharePoint, Wikis, DotNetNuke,MS Project, Photoshop, MS Access, Crystal Reports, Crystal Reports Server Respected, self-managed, and highly adaptable Software / Applications Developer with a reputation for meeting deliverable goals using strong team-building, proven process planning skills, and 14-years of Applications/Software Development, Project Leadership, and Systems Analysis success with Intel. Particularly interested in web\\client application development and relational database design using MS-SQL Server. Always interested in migration projects, as well as evaluating current and future technologies that can improve employee productivity. Specialties:ASP.NET (C# & VB), Classic ASP, Scripting, SQL, XML, CSS, ISS, MS Visual Studio, MS Enterprise Manager, MS FrontPage, MS Office Suite, MS SharePoint, Wikis, DotNetNuke,MS Project, Photoshop, MS Access, Crystal Reports, Crystal Reports Server Experience Application Developer River City Bank 2007  – Present (8 years) PRODUCT MANAGER / PROJECT MANAGER Intel Corporation January 2006  –  December 2006  (1 year) •\tDirectly responsible for determining product requirements, establishing roadmaps, managing project milestones, controlling costs, establishing user training plans, and delivering product applications designed to enable successful customer adoption and maximize cost recovery for the Terminal Emulator product line with annual maintenance contracts worth over $600,000. \n \n•\tServed as Vendor Relationship Manager and maintained positive relationships with the IT service offering supply chain and its customers. Also ensured compliance with Intel’s quality assurance goals and prepared well-organized software application documentation.  \n \n•\tPartnered with internal cross-functional teams to update and improve terminal emulation product offerings and Wikis functionality; performed a full-range of software component improvements and project management functions for the Enterprise Portal’s personalized section. APPLICATIONS DEVELOPER / SOFTWARE ENGINEERING Intel Corporation March 1998  –  December 2005  (7 years 10 months) •\tApplied proficiency in .NET development, good C# programming skills, strong object oriented programming abilities, and experience using MS Visual Studio, MS SQL, MS SharePoint, MS Content Management Server, Wikis, MS FrontPage, IIS, JRun, and MS Access to support existing software applications, meet rapidly changing priorities, and achieve Intel’s internal mission. \n \n•\tDeveloped automated tools for the support of the Employee Productivity Group’s operational environment and a major application developer to the SharePoint automated site provisioning module.  \n \n•\tConducted comprehensive data analysis, defined requirements, identified risks, and used a thorough understanding of the software development lifecycle to update, configure, test, and implement critical applications and technical components to meet Intel’s existing and long-range continuous quality improvement goals and achieve customer satisfaction. Rater Calfarm Insurance 1992  –  1994  (2 years) Rater Calfarm Insurance 1992  –  1994  (2 years) Application Developer River City Bank 2007  – Present (8 years) Application Developer River City Bank 2007  – Present (8 years) PRODUCT MANAGER / PROJECT MANAGER Intel Corporation January 2006  –  December 2006  (1 year) •\tDirectly responsible for determining product requirements, establishing roadmaps, managing project milestones, controlling costs, establishing user training plans, and delivering product applications designed to enable successful customer adoption and maximize cost recovery for the Terminal Emulator product line with annual maintenance contracts worth over $600,000. \n \n•\tServed as Vendor Relationship Manager and maintained positive relationships with the IT service offering supply chain and its customers. Also ensured compliance with Intel’s quality assurance goals and prepared well-organized software application documentation.  \n \n•\tPartnered with internal cross-functional teams to update and improve terminal emulation product offerings and Wikis functionality; performed a full-range of software component improvements and project management functions for the Enterprise Portal’s personalized section. PRODUCT MANAGER / PROJECT MANAGER Intel Corporation January 2006  –  December 2006  (1 year) •\tDirectly responsible for determining product requirements, establishing roadmaps, managing project milestones, controlling costs, establishing user training plans, and delivering product applications designed to enable successful customer adoption and maximize cost recovery for the Terminal Emulator product line with annual maintenance contracts worth over $600,000. \n \n•\tServed as Vendor Relationship Manager and maintained positive relationships with the IT service offering supply chain and its customers. Also ensured compliance with Intel’s quality assurance goals and prepared well-organized software application documentation.  \n \n•\tPartnered with internal cross-functional teams to update and improve terminal emulation product offerings and Wikis functionality; performed a full-range of software component improvements and project management functions for the Enterprise Portal’s personalized section. APPLICATIONS DEVELOPER / SOFTWARE ENGINEERING Intel Corporation March 1998  –  December 2005  (7 years 10 months) •\tApplied proficiency in .NET development, good C# programming skills, strong object oriented programming abilities, and experience using MS Visual Studio, MS SQL, MS SharePoint, MS Content Management Server, Wikis, MS FrontPage, IIS, JRun, and MS Access to support existing software applications, meet rapidly changing priorities, and achieve Intel’s internal mission. \n \n•\tDeveloped automated tools for the support of the Employee Productivity Group’s operational environment and a major application developer to the SharePoint automated site provisioning module.  \n \n•\tConducted comprehensive data analysis, defined requirements, identified risks, and used a thorough understanding of the software development lifecycle to update, configure, test, and implement critical applications and technical components to meet Intel’s existing and long-range continuous quality improvement goals and achieve customer satisfaction. APPLICATIONS DEVELOPER / SOFTWARE ENGINEERING Intel Corporation March 1998  –  December 2005  (7 years 10 months) •\tApplied proficiency in .NET development, good C# programming skills, strong object oriented programming abilities, and experience using MS Visual Studio, MS SQL, MS SharePoint, MS Content Management Server, Wikis, MS FrontPage, IIS, JRun, and MS Access to support existing software applications, meet rapidly changing priorities, and achieve Intel’s internal mission. \n \n•\tDeveloped automated tools for the support of the Employee Productivity Group’s operational environment and a major application developer to the SharePoint automated site provisioning module.  \n \n•\tConducted comprehensive data analysis, defined requirements, identified risks, and used a thorough understanding of the software development lifecycle to update, configure, test, and implement critical applications and technical components to meet Intel’s existing and long-range continuous quality improvement goals and achieve customer satisfaction. Rater Calfarm Insurance 1992  –  1994  (2 years) Rater Calfarm Insurance 1992  –  1994  (2 years) Rater Calfarm Insurance 1992  –  1994  (2 years) Rater Calfarm Insurance 1992  –  1994  (2 years) Skills XML C# Microsoft SQL Server Nautilus DotNetNuke Project Management IIS Visual Studio Scripting CSS Photoshop Skills  XML C# Microsoft SQL Server Nautilus DotNetNuke Project Management IIS Visual Studio Scripting CSS Photoshop XML C# Microsoft SQL Server Nautilus DotNetNuke Project Management IIS Visual Studio Scripting CSS Photoshop XML C# Microsoft SQL Server Nautilus DotNetNuke Project Management IIS Visual Studio Scripting CSS Photoshop Education National University Bachelor of Science (B.S.),  Computer Science 1991  – 1993 National University Bachelor of Science (B.S.),  Computer Science 1991  – 1993 National University Bachelor of Science (B.S.),  Computer Science 1991  – 1993 National University Bachelor of Science (B.S.),  Computer Science 1991  – 1993 ", "Summary A global leader with a well rounded experience spanning key aspects of building & leading multinational organizations. \n \nResults oriented professional with multi domain expertise spanning engineering, operations, corporate affairs, strategy, business development as well as cross geography program & people management. \n \nSetup and lead various small and large organizations in various parts of the world in areas of Mobile software, Internet of Things (IoT), embedded software, strategic planning & corporate affairs. \n \nSuccessfully led various challenging business critical programs and organizational transformation efforts. Summary A global leader with a well rounded experience spanning key aspects of building & leading multinational organizations. \n \nResults oriented professional with multi domain expertise spanning engineering, operations, corporate affairs, strategy, business development as well as cross geography program & people management. \n \nSetup and lead various small and large organizations in various parts of the world in areas of Mobile software, Internet of Things (IoT), embedded software, strategic planning & corporate affairs. \n \nSuccessfully led various challenging business critical programs and organizational transformation efforts. A global leader with a well rounded experience spanning key aspects of building & leading multinational organizations. \n \nResults oriented professional with multi domain expertise spanning engineering, operations, corporate affairs, strategy, business development as well as cross geography program & people management. \n \nSetup and lead various small and large organizations in various parts of the world in areas of Mobile software, Internet of Things (IoT), embedded software, strategic planning & corporate affairs. \n \nSuccessfully led various challenging business critical programs and organizational transformation efforts. A global leader with a well rounded experience spanning key aspects of building & leading multinational organizations. \n \nResults oriented professional with multi domain expertise spanning engineering, operations, corporate affairs, strategy, business development as well as cross geography program & people management. \n \nSetup and lead various small and large organizations in various parts of the world in areas of Mobile software, Internet of Things (IoT), embedded software, strategic planning & corporate affairs. \n \nSuccessfully led various challenging business critical programs and organizational transformation efforts. Experience Sr. Director, Mobile Software Engineering Intel Corporation December 2012  – Present (2 years 9 months) Bangalore, India Lead a global AGILE team that is driving the creation of core Android and Windows SW products for future generation phones, tablets & Internet of Things (IoT) products. Global SW leader for the latest generation of Intel's Windows tablet program.  \n \n Director, SoC Software Strategic Planning Intel Corporation January 2011  –  December 2012  (2 years) Santa Clara, USA Drove the long term software strategy for core software for Intel Atom SoCs as well as the organizational transformation to infuse software thinking in a predominantly hardware organization. Also lead the HW/SW co-design efforts to help reduce time to market for products.  Director, Corporate Affairs Intel Technolgy India April 2007  –  February 2011  (3 years 11 months) Bangalore, India As Director of Corporate Affairs, Rahul was responsible for Intel’s government engagements, education, environmental and rural inclusion programs including media engagements, industry body relations as well as corporate social responsibility programs for South Asia including India, Pakistan, Bangladesh and Sri Lanka. \n \nUnder his leadership, Intel reached an enviable milestone of training more than a 1 million of India’s 6 million or so teachers in 21st century teaching skills using Information and Communication technology. India Business Operations Manager Intel November 2005  –  June 2008  (2 years 8 months) Rahul was in charge of India Operations, with responsibility for ensuring that various aspects of running operations including people systems, process, risks & controls and infrastructure systems operated smoothly enabling various business units to function in an operationally excellent manner in India. In that role he led Intel India towards focused operational excellence.  \n \nRahul took on this role at times of significant upheaval in the India design center and lead various efforts to rebuild a sustainable organization that successfully managed through the challenges. Business Development Manager - APAC Intel January 2002  –  October 2005  (3 years 10 months) Managed the business development for support & service for the Communications Infrastructure Group of Intel in Asia Pacific and Japan. Developed Intel's SW services revenue business in APAC. Technical Architect Intel August 2001  –  December 2002  (1 year 5 months) Drove customer solutions based on Intel communication SW stacks, Network Processors etc. Engineering Manager Nortel Networks 1997  –  2001  (4 years) New Delhi, India Lead the router products development team in India. Was part of the core team that started the design center and also lead the transformation through the economy down turn which finally resulted in closure of the design center. Sr. Engineer HCL Technologies 1994  –  1997  (3 years) Chennai, India Remote access servers & Unix internals Sr. Director, Mobile Software Engineering Intel Corporation December 2012  – Present (2 years 9 months) Bangalore, India Lead a global AGILE team that is driving the creation of core Android and Windows SW products for future generation phones, tablets & Internet of Things (IoT) products. Global SW leader for the latest generation of Intel's Windows tablet program.  \n \n Sr. Director, Mobile Software Engineering Intel Corporation December 2012  – Present (2 years 9 months) Bangalore, India Lead a global AGILE team that is driving the creation of core Android and Windows SW products for future generation phones, tablets & Internet of Things (IoT) products. Global SW leader for the latest generation of Intel's Windows tablet program.  \n \n Director, SoC Software Strategic Planning Intel Corporation January 2011  –  December 2012  (2 years) Santa Clara, USA Drove the long term software strategy for core software for Intel Atom SoCs as well as the organizational transformation to infuse software thinking in a predominantly hardware organization. Also lead the HW/SW co-design efforts to help reduce time to market for products.  Director, SoC Software Strategic Planning Intel Corporation January 2011  –  December 2012  (2 years) Santa Clara, USA Drove the long term software strategy for core software for Intel Atom SoCs as well as the organizational transformation to infuse software thinking in a predominantly hardware organization. Also lead the HW/SW co-design efforts to help reduce time to market for products.  Director, Corporate Affairs Intel Technolgy India April 2007  –  February 2011  (3 years 11 months) Bangalore, India As Director of Corporate Affairs, Rahul was responsible for Intel’s government engagements, education, environmental and rural inclusion programs including media engagements, industry body relations as well as corporate social responsibility programs for South Asia including India, Pakistan, Bangladesh and Sri Lanka. \n \nUnder his leadership, Intel reached an enviable milestone of training more than a 1 million of India’s 6 million or so teachers in 21st century teaching skills using Information and Communication technology. Director, Corporate Affairs Intel Technolgy India April 2007  –  February 2011  (3 years 11 months) Bangalore, India As Director of Corporate Affairs, Rahul was responsible for Intel’s government engagements, education, environmental and rural inclusion programs including media engagements, industry body relations as well as corporate social responsibility programs for South Asia including India, Pakistan, Bangladesh and Sri Lanka. \n \nUnder his leadership, Intel reached an enviable milestone of training more than a 1 million of India’s 6 million or so teachers in 21st century teaching skills using Information and Communication technology. India Business Operations Manager Intel November 2005  –  June 2008  (2 years 8 months) Rahul was in charge of India Operations, with responsibility for ensuring that various aspects of running operations including people systems, process, risks & controls and infrastructure systems operated smoothly enabling various business units to function in an operationally excellent manner in India. In that role he led Intel India towards focused operational excellence.  \n \nRahul took on this role at times of significant upheaval in the India design center and lead various efforts to rebuild a sustainable organization that successfully managed through the challenges. India Business Operations Manager Intel November 2005  –  June 2008  (2 years 8 months) Rahul was in charge of India Operations, with responsibility for ensuring that various aspects of running operations including people systems, process, risks & controls and infrastructure systems operated smoothly enabling various business units to function in an operationally excellent manner in India. In that role he led Intel India towards focused operational excellence.  \n \nRahul took on this role at times of significant upheaval in the India design center and lead various efforts to rebuild a sustainable organization that successfully managed through the challenges. Business Development Manager - APAC Intel January 2002  –  October 2005  (3 years 10 months) Managed the business development for support & service for the Communications Infrastructure Group of Intel in Asia Pacific and Japan. Developed Intel's SW services revenue business in APAC. Business Development Manager - APAC Intel January 2002  –  October 2005  (3 years 10 months) Managed the business development for support & service for the Communications Infrastructure Group of Intel in Asia Pacific and Japan. Developed Intel's SW services revenue business in APAC. Technical Architect Intel August 2001  –  December 2002  (1 year 5 months) Drove customer solutions based on Intel communication SW stacks, Network Processors etc. Technical Architect Intel August 2001  –  December 2002  (1 year 5 months) Drove customer solutions based on Intel communication SW stacks, Network Processors etc. Engineering Manager Nortel Networks 1997  –  2001  (4 years) New Delhi, India Lead the router products development team in India. Was part of the core team that started the design center and also lead the transformation through the economy down turn which finally resulted in closure of the design center. Engineering Manager Nortel Networks 1997  –  2001  (4 years) New Delhi, India Lead the router products development team in India. Was part of the core team that started the design center and also lead the transformation through the economy down turn which finally resulted in closure of the design center. Sr. Engineer HCL Technologies 1994  –  1997  (3 years) Chennai, India Remote access servers & Unix internals Sr. Engineer HCL Technologies 1994  –  1997  (3 years) Chennai, India Remote access servers & Unix internals Languages English Hindi Punjabi English Hindi Punjabi English Hindi Punjabi Skills Product Management Program Management Cross-functional Team... Intel Product Development Semiconductors Product Marketing Business Development Business Strategy Project Management Go-to-market Strategy Engineering Management Strategic Planning Consumer Electronics Entrepreneurship Product Launch Wireless Leadership Software Project... Operations Management Product Lifecycle... IC Strategy SoC Marketing Strategy Technical Marketing Start-ups Strategic Partnerships ASIC Manufacturing Management Process Improvement Telecommunications Market Analysis Business Planning International Business Training Team Management Mobile Devices Project Planning Competitive Analysis Processors Business Alliances Supply Chain Management Embedded Systems Semiconductor Industry Key Account Management New Business Development See 33+     See less Skills  Product Management Program Management Cross-functional Team... Intel Product Development Semiconductors Product Marketing Business Development Business Strategy Project Management Go-to-market Strategy Engineering Management Strategic Planning Consumer Electronics Entrepreneurship Product Launch Wireless Leadership Software Project... Operations Management Product Lifecycle... IC Strategy SoC Marketing Strategy Technical Marketing Start-ups Strategic Partnerships ASIC Manufacturing Management Process Improvement Telecommunications Market Analysis Business Planning International Business Training Team Management Mobile Devices Project Planning Competitive Analysis Processors Business Alliances Supply Chain Management Embedded Systems Semiconductor Industry Key Account Management New Business Development See 33+     See less Product Management Program Management Cross-functional Team... Intel Product Development Semiconductors Product Marketing Business Development Business Strategy Project Management Go-to-market Strategy Engineering Management Strategic Planning Consumer Electronics Entrepreneurship Product Launch Wireless Leadership Software Project... Operations Management Product Lifecycle... IC Strategy SoC Marketing Strategy Technical Marketing Start-ups Strategic Partnerships ASIC Manufacturing Management Process Improvement Telecommunications Market Analysis Business Planning International Business Training Team Management Mobile Devices Project Planning Competitive Analysis Processors Business Alliances Supply Chain Management Embedded Systems Semiconductor Industry Key Account Management New Business Development See 33+     See less Product Management Program Management Cross-functional Team... Intel Product Development Semiconductors Product Marketing Business Development Business Strategy Project Management Go-to-market Strategy Engineering Management Strategic Planning Consumer Electronics Entrepreneurship Product Launch Wireless Leadership Software Project... Operations Management Product Lifecycle... IC Strategy SoC Marketing Strategy Technical Marketing Start-ups Strategic Partnerships ASIC Manufacturing Management Process Improvement Telecommunications Market Analysis Business Planning International Business Training Team Management Mobile Devices Project Planning Competitive Analysis Processors Business Alliances Supply Chain Management Embedded Systems Semiconductor Industry Key Account Management New Business Development See 33+     See less "]}