{"position": "Software Developer, Research", "company": "Stanford University", "profiles": ["Experience Systems Analyst Stanford University January 2015  – Present (8 months) Stanford, CA I'm the systems analyst for a multi-institutional software development team involved in designing tools for an open-source web-based software-suite to store, search, and process biomedical images. My core responsibilities include systems administration and systems planning, software engineering, and resource management. Software Developer - Research Stanford University December 2013  – Present (1 year 9 months) Stanford, CA Developed software for analyzing neuroimaging data. Developed a web-based data processing pipeline for automated processing of neuroimaging data. Worked as part of a multi-institutional software development team involved in designing tools for an open-source web-based software-suite to store, search, and process biomedical images. Co-Director and Lead Developer Stanford Talks (talks.stanford.edu) May 2012  – Present (3 years 4 months) Stanford, CA Stanford Talks is dedicated to collecting talks given around the Stanford campus and \nmaking them accessible to the Stanford community. Our mission is to create a searchable archive of inspiring and educational talks that will enrich the community and foster the educational spirit of Stanford. We currently host over hundreds of talks and continue to collect content. \n \nI am responsible for all aspects of the site and content including: web design and \ndevelopment, sever configuration and maintenance. I oversee audio and video capture, post- processing of content, website analytics, account development and billing. Systems Administrator Stanford University November 2011  –  December 2013  (2 years 2 months) Stanford, CA Managed all aspects of the computer system infrastructure for a research lab consisting of 40+ Linux systems including web and compute servers. Sr. Laboratory Manager Stanford University August 2009  –  November 2011  (2 years 4 months) Stanford, CA Laboratory uses neuroimaging methods (fMRI, DTI) and behavior to study the human \nvisual system. We study the visual pathways that contribute to reading development as well as making measurements of reorganization following injury and disease. Our work includes extensive software development of tools and simulations. We collaborate extensively with groups in Neuroscience, Electrical Engineering, and Computer Science. Laboratory Manager / Research Assistant Stanford University August 2007  –  August 2009  (2 years 1 month) Stanford, CA Laboratory uses neuroimaging methods (fMRI, DTI) and behavior to study the human \nvisual system. We are presently studying the visual pathways that contribute to reading development as well as making measurements of reorganization following injury and disease. Our work includes extensive software development of tools and simulations. We collaborate extensively with groups in Neuroscience, Electrical Engineering, and Computer Science. Staff Research Associate II UC Berkeley School of Public Health September 2006  –  July 2007  (11 months) Berkeley, CA Principal investigator: W. Thomas Boyce, MD. Supervisor: Mark Kishiyama, PhD. \n§ Cross-disciplinary research investigating the effects of socioeconomic inequalities on \nneurological and cognitive development in children utilizing fMRI, EEG, ANS recording \ntechniques, and behavioral data. \n§ Recruitment, scheduling, and training of child subjects. EEG, ANS, fMRI, and behavioral \ndata collection and analysis. Manage financial accounts, petty cash, and participant reimbursement. Conduct literature reviews. Administration of neuropsychological measures to children, as well as sociodemographic questionnaires to families, both in the lab and in the home. Collaborate and coordinate with researchers in other fields. Research Associate Helen Wills Neuroscience Institute at University of California, Berkeley April 2005  –  July 2007  (2 years 4 months) Berkeley, CA Principal investigator: Robert T. Knight, MD. Supervisor: Mark Kishiyama, PhD. \nResearch investigating the effects of emotion and novelty on attention utilizing EEG and \nfMRI technology across multiple populations. \nSubject recruitment, scheduling, and training. EEG and fMRI data collection and analysis. \nReview of scientific literature. Training and supervision of undergraduate research assistants in EEG recording and analysis techniques, as well as fMRI scanning procedures. Systems Analyst Stanford University January 2015  – Present (8 months) Stanford, CA I'm the systems analyst for a multi-institutional software development team involved in designing tools for an open-source web-based software-suite to store, search, and process biomedical images. My core responsibilities include systems administration and systems planning, software engineering, and resource management. Systems Analyst Stanford University January 2015  – Present (8 months) Stanford, CA I'm the systems analyst for a multi-institutional software development team involved in designing tools for an open-source web-based software-suite to store, search, and process biomedical images. My core responsibilities include systems administration and systems planning, software engineering, and resource management. Software Developer - Research Stanford University December 2013  – Present (1 year 9 months) Stanford, CA Developed software for analyzing neuroimaging data. Developed a web-based data processing pipeline for automated processing of neuroimaging data. Worked as part of a multi-institutional software development team involved in designing tools for an open-source web-based software-suite to store, search, and process biomedical images. Software Developer - Research Stanford University December 2013  – Present (1 year 9 months) Stanford, CA Developed software for analyzing neuroimaging data. Developed a web-based data processing pipeline for automated processing of neuroimaging data. Worked as part of a multi-institutional software development team involved in designing tools for an open-source web-based software-suite to store, search, and process biomedical images. Co-Director and Lead Developer Stanford Talks (talks.stanford.edu) May 2012  – Present (3 years 4 months) Stanford, CA Stanford Talks is dedicated to collecting talks given around the Stanford campus and \nmaking them accessible to the Stanford community. Our mission is to create a searchable archive of inspiring and educational talks that will enrich the community and foster the educational spirit of Stanford. We currently host over hundreds of talks and continue to collect content. \n \nI am responsible for all aspects of the site and content including: web design and \ndevelopment, sever configuration and maintenance. I oversee audio and video capture, post- processing of content, website analytics, account development and billing. Co-Director and Lead Developer Stanford Talks (talks.stanford.edu) May 2012  – Present (3 years 4 months) Stanford, CA Stanford Talks is dedicated to collecting talks given around the Stanford campus and \nmaking them accessible to the Stanford community. Our mission is to create a searchable archive of inspiring and educational talks that will enrich the community and foster the educational spirit of Stanford. We currently host over hundreds of talks and continue to collect content. \n \nI am responsible for all aspects of the site and content including: web design and \ndevelopment, sever configuration and maintenance. I oversee audio and video capture, post- processing of content, website analytics, account development and billing. Systems Administrator Stanford University November 2011  –  December 2013  (2 years 2 months) Stanford, CA Managed all aspects of the computer system infrastructure for a research lab consisting of 40+ Linux systems including web and compute servers. Systems Administrator Stanford University November 2011  –  December 2013  (2 years 2 months) Stanford, CA Managed all aspects of the computer system infrastructure for a research lab consisting of 40+ Linux systems including web and compute servers. Sr. Laboratory Manager Stanford University August 2009  –  November 2011  (2 years 4 months) Stanford, CA Laboratory uses neuroimaging methods (fMRI, DTI) and behavior to study the human \nvisual system. We study the visual pathways that contribute to reading development as well as making measurements of reorganization following injury and disease. Our work includes extensive software development of tools and simulations. We collaborate extensively with groups in Neuroscience, Electrical Engineering, and Computer Science. Sr. Laboratory Manager Stanford University August 2009  –  November 2011  (2 years 4 months) Stanford, CA Laboratory uses neuroimaging methods (fMRI, DTI) and behavior to study the human \nvisual system. We study the visual pathways that contribute to reading development as well as making measurements of reorganization following injury and disease. Our work includes extensive software development of tools and simulations. We collaborate extensively with groups in Neuroscience, Electrical Engineering, and Computer Science. Laboratory Manager / Research Assistant Stanford University August 2007  –  August 2009  (2 years 1 month) Stanford, CA Laboratory uses neuroimaging methods (fMRI, DTI) and behavior to study the human \nvisual system. We are presently studying the visual pathways that contribute to reading development as well as making measurements of reorganization following injury and disease. Our work includes extensive software development of tools and simulations. We collaborate extensively with groups in Neuroscience, Electrical Engineering, and Computer Science. Laboratory Manager / Research Assistant Stanford University August 2007  –  August 2009  (2 years 1 month) Stanford, CA Laboratory uses neuroimaging methods (fMRI, DTI) and behavior to study the human \nvisual system. We are presently studying the visual pathways that contribute to reading development as well as making measurements of reorganization following injury and disease. Our work includes extensive software development of tools and simulations. We collaborate extensively with groups in Neuroscience, Electrical Engineering, and Computer Science. Staff Research Associate II UC Berkeley School of Public Health September 2006  –  July 2007  (11 months) Berkeley, CA Principal investigator: W. Thomas Boyce, MD. Supervisor: Mark Kishiyama, PhD. \n§ Cross-disciplinary research investigating the effects of socioeconomic inequalities on \nneurological and cognitive development in children utilizing fMRI, EEG, ANS recording \ntechniques, and behavioral data. \n§ Recruitment, scheduling, and training of child subjects. EEG, ANS, fMRI, and behavioral \ndata collection and analysis. Manage financial accounts, petty cash, and participant reimbursement. Conduct literature reviews. Administration of neuropsychological measures to children, as well as sociodemographic questionnaires to families, both in the lab and in the home. Collaborate and coordinate with researchers in other fields. Staff Research Associate II UC Berkeley School of Public Health September 2006  –  July 2007  (11 months) Berkeley, CA Principal investigator: W. Thomas Boyce, MD. Supervisor: Mark Kishiyama, PhD. \n§ Cross-disciplinary research investigating the effects of socioeconomic inequalities on \nneurological and cognitive development in children utilizing fMRI, EEG, ANS recording \ntechniques, and behavioral data. \n§ Recruitment, scheduling, and training of child subjects. EEG, ANS, fMRI, and behavioral \ndata collection and analysis. Manage financial accounts, petty cash, and participant reimbursement. Conduct literature reviews. Administration of neuropsychological measures to children, as well as sociodemographic questionnaires to families, both in the lab and in the home. Collaborate and coordinate with researchers in other fields. Research Associate Helen Wills Neuroscience Institute at University of California, Berkeley April 2005  –  July 2007  (2 years 4 months) Berkeley, CA Principal investigator: Robert T. Knight, MD. Supervisor: Mark Kishiyama, PhD. \nResearch investigating the effects of emotion and novelty on attention utilizing EEG and \nfMRI technology across multiple populations. \nSubject recruitment, scheduling, and training. EEG and fMRI data collection and analysis. \nReview of scientific literature. Training and supervision of undergraduate research assistants in EEG recording and analysis techniques, as well as fMRI scanning procedures. Research Associate Helen Wills Neuroscience Institute at University of California, Berkeley April 2005  –  July 2007  (2 years 4 months) Berkeley, CA Principal investigator: Robert T. Knight, MD. Supervisor: Mark Kishiyama, PhD. \nResearch investigating the effects of emotion and novelty on attention utilizing EEG and \nfMRI technology across multiple populations. \nSubject recruitment, scheduling, and training. EEG and fMRI data collection and analysis. \nReview of scientific literature. Training and supervision of undergraduate research assistants in EEG recording and analysis techniques, as well as fMRI scanning procedures. Skills Data Analysis Matlab System Administration Research Statistics Molecular Biology Science Project Management Python Operating Systems IT Operations IT Management Bioinformatics Neuroscience Experimental Design Scientific Writing Research Design HTML CSS PHP See 5+     See less Skills  Data Analysis Matlab System Administration Research Statistics Molecular Biology Science Project Management Python Operating Systems IT Operations IT Management Bioinformatics Neuroscience Experimental Design Scientific Writing Research Design HTML CSS PHP See 5+     See less Data Analysis Matlab System Administration Research Statistics Molecular Biology Science Project Management Python Operating Systems IT Operations IT Management Bioinformatics Neuroscience Experimental Design Scientific Writing Research Design HTML CSS PHP See 5+     See less Data Analysis Matlab System Administration Research Statistics Molecular Biology Science Project Management Python Operating Systems IT Operations IT Management Bioinformatics Neuroscience Experimental Design Scientific Writing Research Design HTML CSS PHP See 5+     See less Education University of California, Berkeley Bachelor's degree,  Psychology ,  Neuroscience 2006 Graduated with High Honors and High Academic Distiction Activities and Societies:  Psi Chi Honors Society\nDean's List University of California, Berkeley Bachelor's degree,  Psychology ,  Neuroscience 2006 Graduated with High Honors and High Academic Distiction Activities and Societies:  Psi Chi Honors Society\nDean's List University of California, Berkeley Bachelor's degree,  Psychology ,  Neuroscience 2006 Graduated with High Honors and High Academic Distiction Activities and Societies:  Psi Chi Honors Society\nDean's List University of California, Berkeley Bachelor's degree,  Psychology ,  Neuroscience 2006 Graduated with High Honors and High Academic Distiction Activities and Societies:  Psi Chi Honors Society\nDean's List ", "Skills Computer Science Web Applications REST XML Python JavaScript Software Engineering Java SOAP Eclipse CSS Web Services Unix Cloud Computing Apache Software Development Test Automation Distributed Systems Shell Scripting Scrum Object Oriented Design Subversion Java Enterprise Edition Linux JUnit Software Design Ant See 12+     See less Skills  Computer Science Web Applications REST XML Python JavaScript Software Engineering Java SOAP Eclipse CSS Web Services Unix Cloud Computing Apache Software Development Test Automation Distributed Systems Shell Scripting Scrum Object Oriented Design Subversion Java Enterprise Edition Linux JUnit Software Design Ant See 12+     See less Computer Science Web Applications REST XML Python JavaScript Software Engineering Java SOAP Eclipse CSS Web Services Unix Cloud Computing Apache Software Development Test Automation Distributed Systems Shell Scripting Scrum Object Oriented Design Subversion Java Enterprise Edition Linux JUnit Software Design Ant See 12+     See less Computer Science Web Applications REST XML Python JavaScript Software Engineering Java SOAP Eclipse CSS Web Services Unix Cloud Computing Apache Software Development Test Automation Distributed Systems Shell Scripting Scrum Object Oriented Design Subversion Java Enterprise Edition Linux JUnit Software Design Ant See 12+     See less ", "Skills Perl Databases Linux Programming Bioinformatics Python MySQL Database Design Data Mining Algorithms Skills  Perl Databases Linux Programming Bioinformatics Python MySQL Database Design Data Mining Algorithms Perl Databases Linux Programming Bioinformatics Python MySQL Database Design Data Mining Algorithms Perl Databases Linux Programming Bioinformatics Python MySQL Database Design Data Mining Algorithms ", "Skills C++ Programming Troubleshooting Algorithms Java Research C Perl Python Linux HTML Unix Skills  C++ Programming Troubleshooting Algorithms Java Research C Perl Python Linux HTML Unix C++ Programming Troubleshooting Algorithms Java Research C Perl Python Linux HTML Unix C++ Programming Troubleshooting Algorithms Java Research C Perl Python Linux HTML Unix ", "Experience Sr Software Developer - Research Stanford University June 2004  – Present (11 years 3 months) Sr Software Developer - Research Stanford University June 2004  – Present (11 years 3 months) Sr Software Developer - Research Stanford University June 2004  – Present (11 years 3 months) Education Stanford University PhD,  Geological and Environmental Sciences/Material Sciences and Engineering 1992  – 1997 Stanford University PhD,  Geological and Environmental Sciences/Material Sciences and Engineering 1992  – 1997 Stanford University PhD,  Geological and Environmental Sciences/Material Sciences and Engineering 1992  – 1997 Stanford University PhD,  Geological and Environmental Sciences/Material Sciences and Engineering 1992  – 1997 ", "Experience Software Developer, Research Stanford University September 2006  – Present (9 years) Software Developer CTB CAMTEC Software GmbH March 2005  –  June 2006  (1 year 4 months) Design and development of different business software applications. PhD Student DaimlerChrysler March 2002  –  February 2005  (3 years) Research, software design and development for building a simulation tool used for hybrid system testing. Diploma Student DaimlerChrysler March 2001  –  August 2001  (6 months) Software Developer, Research Stanford University September 2006  – Present (9 years) Software Developer, Research Stanford University September 2006  – Present (9 years) Software Developer CTB CAMTEC Software GmbH March 2005  –  June 2006  (1 year 4 months) Design and development of different business software applications. Software Developer CTB CAMTEC Software GmbH March 2005  –  June 2006  (1 year 4 months) Design and development of different business software applications. PhD Student DaimlerChrysler March 2002  –  February 2005  (3 years) Research, software design and development for building a simulation tool used for hybrid system testing. PhD Student DaimlerChrysler March 2002  –  February 2005  (3 years) Research, software design and development for building a simulation tool used for hybrid system testing. Diploma Student DaimlerChrysler March 2001  –  August 2001  (6 months) Diploma Student DaimlerChrysler March 2001  –  August 2001  (6 months) Skills Java Machine Learning Ontologies Semantic Web OWL RDF Distributed Systems Linux Natural Language... Python Informatics Computer Science Artificial Intelligence Data Mining Algorithms LaTeX Software Engineering Eclipse See 3+     See less Skills  Java Machine Learning Ontologies Semantic Web OWL RDF Distributed Systems Linux Natural Language... Python Informatics Computer Science Artificial Intelligence Data Mining Algorithms LaTeX Software Engineering Eclipse See 3+     See less Java Machine Learning Ontologies Semantic Web OWL RDF Distributed Systems Linux Natural Language... Python Informatics Computer Science Artificial Intelligence Data Mining Algorithms LaTeX Software Engineering Eclipse See 3+     See less Java Machine Learning Ontologies Semantic Web OWL RDF Distributed Systems Linux Natural Language... Python Informatics Computer Science Artificial Intelligence Data Mining Algorithms LaTeX Software Engineering Eclipse See 3+     See less Education Dipl. Eng.,  Computer Science 1996  – 2001 Dipl. Eng.,  Computer Science 1996  – 2001 Dipl. Eng.,  Computer Science 1996  – 2001 Dipl. Eng.,  Computer Science 1996  – 2001 ", "Experience Software Developer, Research Stanford University November 2011  – Present (3 years 10 months) Junior Software Developer Chronic Logic LLC November 2010  –  January 2011  (3 months) Santa Cruz, California Junior Software Developer Cryptic Sea July 2010  –  September 2010  (3 months) Santa Cruz, California Software Developer, Research Stanford University November 2011  – Present (3 years 10 months) Software Developer, Research Stanford University November 2011  – Present (3 years 10 months) Junior Software Developer Chronic Logic LLC November 2010  –  January 2011  (3 months) Santa Cruz, California Junior Software Developer Chronic Logic LLC November 2010  –  January 2011  (3 months) Santa Cruz, California Junior Software Developer Cryptic Sea July 2010  –  September 2010  (3 months) Santa Cruz, California Junior Software Developer Cryptic Sea July 2010  –  September 2010  (3 months) Santa Cruz, California ", "Experience Systems Librarian National Agricultural Library April 2010  – Present (5 years 5 months) Sr. Data Analyst Innovitive Interfaces, Inc. 2005  –  2010  (5 years) System Admin/Software Developer (Research) Stanford University 1994  –  2005  (11 years) Systems Librarian National Agricultural Library April 2010  – Present (5 years 5 months) Systems Librarian National Agricultural Library April 2010  – Present (5 years 5 months) Sr. Data Analyst Innovitive Interfaces, Inc. 2005  –  2010  (5 years) Sr. Data Analyst Innovitive Interfaces, Inc. 2005  –  2010  (5 years) System Admin/Software Developer (Research) Stanford University 1994  –  2005  (11 years) System Admin/Software Developer (Research) Stanford University 1994  –  2005  (11 years) Skills Databases Library HTML Research Metadata Information Management Cataloging Content Management Knowledge Management Digital Libraries Taxonomy Skills  Databases Library HTML Research Metadata Information Management Cataloging Content Management Knowledge Management Digital Libraries Taxonomy Databases Library HTML Research Metadata Information Management Cataloging Content Management Knowledge Management Digital Libraries Taxonomy Databases Library HTML Research Metadata Information Management Cataloging Content Management Knowledge Management Digital Libraries Taxonomy Education University of California, Berkeley Peking University University of California, Berkeley University of California, Berkeley University of California, Berkeley Peking University Peking University Peking University ", "Summary https://github.com/lrowe \n \nI build web applications for the biologists and biocurators of the ENCODE project, primarily using Python (Pyramid, SQLAlchemy) and Javascript (Backbone, JQuery, React). \n \nI spent many years working on the Open Source CMS Plone, and was responsible for the Diazo XSLT theming system. Much of my Plone consulting involved systems integration, including RDBMS, web services, LDAP and Single Sign On. Summary https://github.com/lrowe \n \nI build web applications for the biologists and biocurators of the ENCODE project, primarily using Python (Pyramid, SQLAlchemy) and Javascript (Backbone, JQuery, React). \n \nI spent many years working on the Open Source CMS Plone, and was responsible for the Diazo XSLT theming system. Much of my Plone consulting involved systems integration, including RDBMS, web services, LDAP and Single Sign On. https://github.com/lrowe \n \nI build web applications for the biologists and biocurators of the ENCODE project, primarily using Python (Pyramid, SQLAlchemy) and Javascript (Backbone, JQuery, React). \n \nI spent many years working on the Open Source CMS Plone, and was responsible for the Diazo XSLT theming system. Much of my Plone consulting involved systems integration, including RDBMS, web services, LDAP and Single Sign On. https://github.com/lrowe \n \nI build web applications for the biologists and biocurators of the ENCODE project, primarily using Python (Pyramid, SQLAlchemy) and Javascript (Backbone, JQuery, React). \n \nI spent many years working on the Open Source CMS Plone, and was responsible for the Diazo XSLT theming system. Much of my Plone consulting involved systems integration, including RDBMS, web services, LDAP and Single Sign On. Experience Software Developer, Research Stanford University November 2012  – Present (2 years 10 months) Department of Genetics Director Shuttle Thread Limited October 2010  –  November 2012  (2 years 2 months) Framework Team Plone Foundation December 2008  –  July 2012  (3 years 8 months) Technical Project Manager / Developer Jarn AS November 2008  –  February 2010  (1 year 4 months) Senior Developer Blue Fountain Systems September 2004  –  October 2008  (4 years 2 months) Worked on a variety of projects Plone Consultant Deloitte July 2008  –  September 2008  (3 months) Project with Blue Fountain Systems for the Really Useful Group Workflow Developer The Bank of Tokyo-Mitsubishi UFJ, Ltd. July 2007  –  March 2008  (9 months) Plone Developer Oxfam September 2005  –  May 2006  (9 months) Education Officer UMIST Students' Association June 2002  –  September 2004  (2 years 4 months) Software Developer, Research Stanford University November 2012  – Present (2 years 10 months) Department of Genetics Software Developer, Research Stanford University November 2012  – Present (2 years 10 months) Department of Genetics Director Shuttle Thread Limited October 2010  –  November 2012  (2 years 2 months) Director Shuttle Thread Limited October 2010  –  November 2012  (2 years 2 months) Framework Team Plone Foundation December 2008  –  July 2012  (3 years 8 months) Framework Team Plone Foundation December 2008  –  July 2012  (3 years 8 months) Technical Project Manager / Developer Jarn AS November 2008  –  February 2010  (1 year 4 months) Technical Project Manager / Developer Jarn AS November 2008  –  February 2010  (1 year 4 months) Senior Developer Blue Fountain Systems September 2004  –  October 2008  (4 years 2 months) Worked on a variety of projects Senior Developer Blue Fountain Systems September 2004  –  October 2008  (4 years 2 months) Worked on a variety of projects Plone Consultant Deloitte July 2008  –  September 2008  (3 months) Project with Blue Fountain Systems for the Really Useful Group Plone Consultant Deloitte July 2008  –  September 2008  (3 months) Project with Blue Fountain Systems for the Really Useful Group Workflow Developer The Bank of Tokyo-Mitsubishi UFJ, Ltd. July 2007  –  March 2008  (9 months) Workflow Developer The Bank of Tokyo-Mitsubishi UFJ, Ltd. July 2007  –  March 2008  (9 months) Plone Developer Oxfam September 2005  –  May 2006  (9 months) Plone Developer Oxfam September 2005  –  May 2006  (9 months) Education Officer UMIST Students' Association June 2002  –  September 2004  (2 years 4 months) Education Officer UMIST Students' Association June 2002  –  September 2004  (2 years 4 months) Skills Plone Python Zope Apache Web Applications JavaScript jQuery Open Source SQL CMS XSLT Git CSS Linux LDAP Web Development Software Development PostgreSQL HTML 5 Pyramid SQLAlchemy C Nginx Twisted See 9+     See less Skills  Plone Python Zope Apache Web Applications JavaScript jQuery Open Source SQL CMS XSLT Git CSS Linux LDAP Web Development Software Development PostgreSQL HTML 5 Pyramid SQLAlchemy C Nginx Twisted See 9+     See less Plone Python Zope Apache Web Applications JavaScript jQuery Open Source SQL CMS XSLT Git CSS Linux LDAP Web Development Software Development PostgreSQL HTML 5 Pyramid SQLAlchemy C Nginx Twisted See 9+     See less Plone Python Zope Apache Web Applications JavaScript jQuery Open Source SQL CMS XSLT Git CSS Linux LDAP Web Development Software Development PostgreSQL HTML 5 Pyramid SQLAlchemy C Nginx Twisted See 9+     See less Education University of Manchester - Institute of Science and Technology Bachelor of Engineering (BEng),  Software Engineering 1999  – 2002 University of Manchester - Institute of Science and Technology Bachelor of Engineering (BEng),  Software Engineering 1999  – 2002 University of Manchester - Institute of Science and Technology Bachelor of Engineering (BEng),  Software Engineering 1999  – 2002 University of Manchester - Institute of Science and Technology Bachelor of Engineering (BEng),  Software Engineering 1999  – 2002 "]}