{"position": "Software Engineering Intern", "company": "Intel Corporation", "profiles": ["Summary Software Development Engineer with 3 years of experience in designing, developing and delivering platform independent solutions and performance optimized tools and frameworks, and working in a short-cycle, agile, iterative development team. \n \nWith a strong foundation in computer science concepts at USC in addition to hands on experience in software development through Intel work experience, academic projects, internships and a couple of entrepreneurial endeavors, my learning curve has been huge. I want to be a part of projects where I can make a significant contribution to the company and helps me grow my passion for technology. Summary Software Development Engineer with 3 years of experience in designing, developing and delivering platform independent solutions and performance optimized tools and frameworks, and working in a short-cycle, agile, iterative development team. \n \nWith a strong foundation in computer science concepts at USC in addition to hands on experience in software development through Intel work experience, academic projects, internships and a couple of entrepreneurial endeavors, my learning curve has been huge. I want to be a part of projects where I can make a significant contribution to the company and helps me grow my passion for technology. Software Development Engineer with 3 years of experience in designing, developing and delivering platform independent solutions and performance optimized tools and frameworks, and working in a short-cycle, agile, iterative development team. \n \nWith a strong foundation in computer science concepts at USC in addition to hands on experience in software development through Intel work experience, academic projects, internships and a couple of entrepreneurial endeavors, my learning curve has been huge. I want to be a part of projects where I can make a significant contribution to the company and helps me grow my passion for technology. Software Development Engineer with 3 years of experience in designing, developing and delivering platform independent solutions and performance optimized tools and frameworks, and working in a short-cycle, agile, iterative development team. \n \nWith a strong foundation in computer science concepts at USC in addition to hands on experience in software development through Intel work experience, academic projects, internships and a couple of entrepreneurial endeavors, my learning curve has been huge. I want to be a part of projects where I can make a significant contribution to the company and helps me grow my passion for technology. Experience Associate Software Engineer Salesforce February 2015  – Present (7 months) San Francisco Bay Area Strategic Analyst Software Engineering Intern Intel Corporation June 2014  –  August 2014  (3 months) Santa Clara, California > Focused on identifying business client and Line of business enabling requirements for core based platform along with segment analysis \n> Played a key role in enabling certain features of the client's requirements on the Core platform for Desktops and servers. Data Analyst University of Southern California September 2013  –  May 2014  (9 months) Collect, manage, analyze and maintain Student's data in a central database. Send reports to the management for their inputs and feedbacks. Software Engineer Intel Corporation December 2010  –  July 2013  (2 years 8 months) •\tDesigned and developed a generalized reusable framework in C++ that takes care of test automation and uploads test results from different test environments to a central database and deployed it in various server and client projects. The tool ensured that the previously modular, Windows-specific validation solution now supported multiple file formats in both Windows and Linux and reduced data upload time from many hours to a few minutes.  \n•\tReceived the Spontaneous Recognition Award for identifying and validating a major firmware issue in the Phone Sensor Protocol through content development tests in C. The system level, unit and API tests revealed memory cache leak and identified the root cause thus saving the cost of an additional production cycle of the processor.  \n•\tAs an individual contributor, I developed and deployed Intel's first automated debug and coverage solution for SoC validation on Android - Jellybean. The objective was to automate the manual process of setting up the environment and running tests, thus validating the CPU performance and providing feedback for further analysis by the design engineers. I received Department recognition award from a senior principle engineer for delivering the solution with excellence. Software Engineering Intern Intel Corporation December 2010  –  June 2011  (7 months) Bengaluru Area, India > Developed a tool in Python that performs intelligent classification and bucketing of failures, based on signatures, that occur while running functional tests in a fabricated system.The tool reduced the processing and debugging time by 70%. \n \n> Developed a C# library that provided APIs to convert raw test failure data to analysis data. \n \n> Developed a regression framework that runs nightly regressions and performs analysis of data by comparing the golden test results with the regression results. The framework also included the feature of email delivery, reporting the test status and its results. Associate Software Engineer Salesforce February 2015  – Present (7 months) San Francisco Bay Area Associate Software Engineer Salesforce February 2015  – Present (7 months) San Francisco Bay Area Strategic Analyst Software Engineering Intern Intel Corporation June 2014  –  August 2014  (3 months) Santa Clara, California > Focused on identifying business client and Line of business enabling requirements for core based platform along with segment analysis \n> Played a key role in enabling certain features of the client's requirements on the Core platform for Desktops and servers. Strategic Analyst Software Engineering Intern Intel Corporation June 2014  –  August 2014  (3 months) Santa Clara, California > Focused on identifying business client and Line of business enabling requirements for core based platform along with segment analysis \n> Played a key role in enabling certain features of the client's requirements on the Core platform for Desktops and servers. Data Analyst University of Southern California September 2013  –  May 2014  (9 months) Collect, manage, analyze and maintain Student's data in a central database. Send reports to the management for their inputs and feedbacks. Data Analyst University of Southern California September 2013  –  May 2014  (9 months) Collect, manage, analyze and maintain Student's data in a central database. Send reports to the management for their inputs and feedbacks. Software Engineer Intel Corporation December 2010  –  July 2013  (2 years 8 months) •\tDesigned and developed a generalized reusable framework in C++ that takes care of test automation and uploads test results from different test environments to a central database and deployed it in various server and client projects. The tool ensured that the previously modular, Windows-specific validation solution now supported multiple file formats in both Windows and Linux and reduced data upload time from many hours to a few minutes.  \n•\tReceived the Spontaneous Recognition Award for identifying and validating a major firmware issue in the Phone Sensor Protocol through content development tests in C. The system level, unit and API tests revealed memory cache leak and identified the root cause thus saving the cost of an additional production cycle of the processor.  \n•\tAs an individual contributor, I developed and deployed Intel's first automated debug and coverage solution for SoC validation on Android - Jellybean. The objective was to automate the manual process of setting up the environment and running tests, thus validating the CPU performance and providing feedback for further analysis by the design engineers. I received Department recognition award from a senior principle engineer for delivering the solution with excellence. Software Engineer Intel Corporation December 2010  –  July 2013  (2 years 8 months) •\tDesigned and developed a generalized reusable framework in C++ that takes care of test automation and uploads test results from different test environments to a central database and deployed it in various server and client projects. The tool ensured that the previously modular, Windows-specific validation solution now supported multiple file formats in both Windows and Linux and reduced data upload time from many hours to a few minutes.  \n•\tReceived the Spontaneous Recognition Award for identifying and validating a major firmware issue in the Phone Sensor Protocol through content development tests in C. The system level, unit and API tests revealed memory cache leak and identified the root cause thus saving the cost of an additional production cycle of the processor.  \n•\tAs an individual contributor, I developed and deployed Intel's first automated debug and coverage solution for SoC validation on Android - Jellybean. The objective was to automate the manual process of setting up the environment and running tests, thus validating the CPU performance and providing feedback for further analysis by the design engineers. I received Department recognition award from a senior principle engineer for delivering the solution with excellence. Software Engineering Intern Intel Corporation December 2010  –  June 2011  (7 months) Bengaluru Area, India > Developed a tool in Python that performs intelligent classification and bucketing of failures, based on signatures, that occur while running functional tests in a fabricated system.The tool reduced the processing and debugging time by 70%. \n \n> Developed a C# library that provided APIs to convert raw test failure data to analysis data. \n \n> Developed a regression framework that runs nightly regressions and performs analysis of data by comparing the golden test results with the regression results. The framework also included the feature of email delivery, reporting the test status and its results. Software Engineering Intern Intel Corporation December 2010  –  June 2011  (7 months) Bengaluru Area, India > Developed a tool in Python that performs intelligent classification and bucketing of failures, based on signatures, that occur while running functional tests in a fabricated system.The tool reduced the processing and debugging time by 70%. \n \n> Developed a C# library that provided APIs to convert raw test failure data to analysis data. \n \n> Developed a regression framework that runs nightly regressions and performs analysis of data by comparing the golden test results with the regression results. The framework also included the feature of email delivery, reporting the test status and its results. Languages English, Old (ca.450-1100) Tamil Hindi English, Old (ca.450-1100) Tamil Hindi English, Old (ca.450-1100) Tamil Hindi Skills Operating Systems Algorithms Kernel Programming Debugging C++ Python C Data Structures Software Engineering Unix Linux Software Development Object Oriented Design Java Eclipse C# OOP Visual Studio Programming Test Automation... Test Planning See 6+     See less Skills  Operating Systems Algorithms Kernel Programming Debugging C++ Python C Data Structures Software Engineering Unix Linux Software Development Object Oriented Design Java Eclipse C# OOP Visual Studio Programming Test Automation... Test Planning See 6+     See less Operating Systems Algorithms Kernel Programming Debugging C++ Python C Data Structures Software Engineering Unix Linux Software Development Object Oriented Design Java Eclipse C# OOP Visual Studio Programming Test Automation... Test Planning See 6+     See less Operating Systems Algorithms Kernel Programming Debugging C++ Python C Data Structures Software Engineering Unix Linux Software Development Object Oriented Design Java Eclipse C# OOP Visual Studio Programming Test Automation... Test Planning See 6+     See less Education University of Southern California Master's degree,  Computer Science , 3.85/4 2013  – 2015 Subjects taken: \n \n> Analysis of algorithms \n> Operating Systems \n> Web technology \n> Foundations of Artificial Intelligence \n> Software Engineering \n> Advanced Operating Systems \n> Social Media Analysis PSG College of Technology Bachelor's degree,  Information Technology , 3.75/4 2007  – 2011 > Placement Representative and Class Representative for the Department of Information Technology \n> Secretary of the Youth Red Cross \n> Executive member of the Dramatix club (a dance club) \n> Member of Indian Society of Technical Education Don Bosco Bachelor of Technology (B.Tech.),  Information Technology 1998  – 2007 > Achieved Don Bosco 'Best Outgoing Student' Award in 2007 \n> Won the General Proficiency Medal for retaining the 1st rank position from 9th grade to 12th grade  \n> School topper in 12th grade and School second topper in 10th grade \n> House Captain and Class Leader for 3 consecutive years \n> Member of school throw-ball and kho-kho teams \n> Won the junior sports championship trophy in 2005 University of Southern California Master's degree,  Computer Science , 3.85/4 2013  – 2015 Subjects taken: \n \n> Analysis of algorithms \n> Operating Systems \n> Web technology \n> Foundations of Artificial Intelligence \n> Software Engineering \n> Advanced Operating Systems \n> Social Media Analysis University of Southern California Master's degree,  Computer Science , 3.85/4 2013  – 2015 Subjects taken: \n \n> Analysis of algorithms \n> Operating Systems \n> Web technology \n> Foundations of Artificial Intelligence \n> Software Engineering \n> Advanced Operating Systems \n> Social Media Analysis University of Southern California Master's degree,  Computer Science , 3.85/4 2013  – 2015 Subjects taken: \n \n> Analysis of algorithms \n> Operating Systems \n> Web technology \n> Foundations of Artificial Intelligence \n> Software Engineering \n> Advanced Operating Systems \n> Social Media Analysis PSG College of Technology Bachelor's degree,  Information Technology , 3.75/4 2007  – 2011 > Placement Representative and Class Representative for the Department of Information Technology \n> Secretary of the Youth Red Cross \n> Executive member of the Dramatix club (a dance club) \n> Member of Indian Society of Technical Education PSG College of Technology Bachelor's degree,  Information Technology , 3.75/4 2007  – 2011 > Placement Representative and Class Representative for the Department of Information Technology \n> Secretary of the Youth Red Cross \n> Executive member of the Dramatix club (a dance club) \n> Member of Indian Society of Technical Education PSG College of Technology Bachelor's degree,  Information Technology , 3.75/4 2007  – 2011 > Placement Representative and Class Representative for the Department of Information Technology \n> Secretary of the Youth Red Cross \n> Executive member of the Dramatix club (a dance club) \n> Member of Indian Society of Technical Education Don Bosco Bachelor of Technology (B.Tech.),  Information Technology 1998  – 2007 > Achieved Don Bosco 'Best Outgoing Student' Award in 2007 \n> Won the General Proficiency Medal for retaining the 1st rank position from 9th grade to 12th grade  \n> School topper in 12th grade and School second topper in 10th grade \n> House Captain and Class Leader for 3 consecutive years \n> Member of school throw-ball and kho-kho teams \n> Won the junior sports championship trophy in 2005 Don Bosco Bachelor of Technology (B.Tech.),  Information Technology 1998  – 2007 > Achieved Don Bosco 'Best Outgoing Student' Award in 2007 \n> Won the General Proficiency Medal for retaining the 1st rank position from 9th grade to 12th grade  \n> School topper in 12th grade and School second topper in 10th grade \n> House Captain and Class Leader for 3 consecutive years \n> Member of school throw-ball and kho-kho teams \n> Won the junior sports championship trophy in 2005 Don Bosco Bachelor of Technology (B.Tech.),  Information Technology 1998  – 2007 > Achieved Don Bosco 'Best Outgoing Student' Award in 2007 \n> Won the General Proficiency Medal for retaining the 1st rank position from 9th grade to 12th grade  \n> School topper in 12th grade and School second topper in 10th grade \n> House Captain and Class Leader for 3 consecutive years \n> Member of school throw-ball and kho-kho teams \n> Won the junior sports championship trophy in 2005 Honors & Awards Department Recognition Award April 2013 Received the Department Recognition Award for developing an Automated Data Collection Methodology in Python for Intel's future generation chips to validate and analyze data on Android Operating System. This methodology was the first of its kind in Intel and the data collected revealed some critical silicon issues. Tech Champion of EMC Technology Day EMC Corporation March 2010 Champion of the EMC Technology Day conducted in PSG College of Technology, Dept. of Information Technology for outstanding coding and debugging skills from a participation count of 500 - 600 students.  Department Recognition Award April 2013 Received the Department Recognition Award for developing an Automated Data Collection Methodology in Python for Intel's future generation chips to validate and analyze data on Android Operating System. This methodology was the first of its kind in Intel and the data collected revealed some critical silicon issues. Department Recognition Award April 2013 Received the Department Recognition Award for developing an Automated Data Collection Methodology in Python for Intel's future generation chips to validate and analyze data on Android Operating System. This methodology was the first of its kind in Intel and the data collected revealed some critical silicon issues. Department Recognition Award April 2013 Received the Department Recognition Award for developing an Automated Data Collection Methodology in Python for Intel's future generation chips to validate and analyze data on Android Operating System. This methodology was the first of its kind in Intel and the data collected revealed some critical silicon issues. Tech Champion of EMC Technology Day EMC Corporation March 2010 Champion of the EMC Technology Day conducted in PSG College of Technology, Dept. of Information Technology for outstanding coding and debugging skills from a participation count of 500 - 600 students.  Tech Champion of EMC Technology Day EMC Corporation March 2010 Champion of the EMC Technology Day conducted in PSG College of Technology, Dept. of Information Technology for outstanding coding and debugging skills from a participation count of 500 - 600 students.  Tech Champion of EMC Technology Day EMC Corporation March 2010 Champion of the EMC Technology Day conducted in PSG College of Technology, Dept. of Information Technology for outstanding coding and debugging skills from a participation count of 500 - 600 students.  ", "Experience Research and Development Associate Engineer (Intern) W2BI, Inc. (a member of the Advantest Group) June 2015  – Present (3 months) San Jose, CA Android Support/QA Testing WeVideo January 2014  –  September 2014  (9 months) Moutain View, CA Software Engineering Intern Intel Corporation June 2013  –  September 2013  (4 months) Folsom, CA Software Engineering Intern Intel Corporation May 2012  –  August 2012  (4 months) Research and Development Associate Engineer (Intern) W2BI, Inc. (a member of the Advantest Group) June 2015  – Present (3 months) San Jose, CA Research and Development Associate Engineer (Intern) W2BI, Inc. (a member of the Advantest Group) June 2015  – Present (3 months) San Jose, CA Android Support/QA Testing WeVideo January 2014  –  September 2014  (9 months) Moutain View, CA Android Support/QA Testing WeVideo January 2014  –  September 2014  (9 months) Moutain View, CA Software Engineering Intern Intel Corporation June 2013  –  September 2013  (4 months) Folsom, CA Software Engineering Intern Intel Corporation June 2013  –  September 2013  (4 months) Folsom, CA Software Engineering Intern Intel Corporation May 2012  –  August 2012  (4 months) Software Engineering Intern Intel Corporation May 2012  –  August 2012  (4 months) Skills Verilog Debugging Embedded Systems VHDL Device Drivers SoC C FPGA Computer Architecture Python TCL Programming Team Leadership C++ Skills  Verilog Debugging Embedded Systems VHDL Device Drivers SoC C FPGA Computer Architecture Python TCL Programming Team Leadership C++ Verilog Debugging Embedded Systems VHDL Device Drivers SoC C FPGA Computer Architecture Python TCL Programming Team Leadership C++ Verilog Debugging Embedded Systems VHDL Device Drivers SoC C FPGA Computer Architecture Python TCL Programming Team Leadership C++ Education Santa Clara University Computer Science and Engineering 2013  – 2016 California Baptist University 2011  – 2012 Folsom Lake College 2010  – 2011 La Sierra University 2013 Santa Clara University Computer Science and Engineering 2013  – 2016 Santa Clara University Computer Science and Engineering 2013  – 2016 Santa Clara University Computer Science and Engineering 2013  – 2016 California Baptist University 2011  – 2012 California Baptist University 2011  – 2012 California Baptist University 2011  – 2012 Folsom Lake College 2010  – 2011 Folsom Lake College 2010  – 2011 Folsom Lake College 2010  – 2011 La Sierra University 2013 La Sierra University 2013 La Sierra University 2013 ", "Summary Actively seeking full time opportunities in the field of software development/engineering. \n \nI enjoy working in the fields of Big Data Analytics, Cloud Computing, Statistics, AI, and Machine Learning areas coupled with Object oriented design. \n \nLove to work in a team involved in developing or testing software and contribute to the growth of the organization in the best way possible by using my knowledge and skills. \n \nCurrently pursuing Masters degree in Computer Science at University of Texas, Dallas with a specialization in Data Science. \n \nI have an international paper published in an IEEE journal. The paper talks about the creation of virtual vocational training scenario for a fabric painting application. \n \nFew academic projects in which I was involved: \n•\tArtificial Intelligence, Summer 2014: Implementation of Chess Engine using Python. \n•\tDatabase Design, Fall 2013: Implementation of B+ Tree indexing on a text file with variable key length using Java. \n•\tSemantic Web, Fall 2013: Visualization of trends in petroleum imports and prices in USA. Technology used: RDF, SPARQL, JavaScript, HTML. \n•\tUndergraduate Trainee in Electronics and Radar Development Establishment (LRDE). Developed a Web based Built-in-Test Display for RADAR Systems, using Java which prioritizing component status messages from mission critical RADAR systems through a secured wireless network thereby increasing overall performance. \n•\tVirtual Fabric Paint Environment using Touch and Gesture technology for Vocational Training, sponsored by Government of India. Tools Used: Visual C# 2008, Microsoft Tablet PC SDK 1.7. \n \nI worked as a Technology Consultant - I for Hewlett Packard Globalsoft Ltd, Bangalore. My daily duties consisted of translating user requirements into well designed Web applications. I dabbled with front-end, middleware, and back-end code and improved the design of the client applications thereby decreasing manual intervention. Summary Actively seeking full time opportunities in the field of software development/engineering. \n \nI enjoy working in the fields of Big Data Analytics, Cloud Computing, Statistics, AI, and Machine Learning areas coupled with Object oriented design. \n \nLove to work in a team involved in developing or testing software and contribute to the growth of the organization in the best way possible by using my knowledge and skills. \n \nCurrently pursuing Masters degree in Computer Science at University of Texas, Dallas with a specialization in Data Science. \n \nI have an international paper published in an IEEE journal. The paper talks about the creation of virtual vocational training scenario for a fabric painting application. \n \nFew academic projects in which I was involved: \n•\tArtificial Intelligence, Summer 2014: Implementation of Chess Engine using Python. \n•\tDatabase Design, Fall 2013: Implementation of B+ Tree indexing on a text file with variable key length using Java. \n•\tSemantic Web, Fall 2013: Visualization of trends in petroleum imports and prices in USA. Technology used: RDF, SPARQL, JavaScript, HTML. \n•\tUndergraduate Trainee in Electronics and Radar Development Establishment (LRDE). Developed a Web based Built-in-Test Display for RADAR Systems, using Java which prioritizing component status messages from mission critical RADAR systems through a secured wireless network thereby increasing overall performance. \n•\tVirtual Fabric Paint Environment using Touch and Gesture technology for Vocational Training, sponsored by Government of India. Tools Used: Visual C# 2008, Microsoft Tablet PC SDK 1.7. \n \nI worked as a Technology Consultant - I for Hewlett Packard Globalsoft Ltd, Bangalore. My daily duties consisted of translating user requirements into well designed Web applications. I dabbled with front-end, middleware, and back-end code and improved the design of the client applications thereby decreasing manual intervention. Actively seeking full time opportunities in the field of software development/engineering. \n \nI enjoy working in the fields of Big Data Analytics, Cloud Computing, Statistics, AI, and Machine Learning areas coupled with Object oriented design. \n \nLove to work in a team involved in developing or testing software and contribute to the growth of the organization in the best way possible by using my knowledge and skills. \n \nCurrently pursuing Masters degree in Computer Science at University of Texas, Dallas with a specialization in Data Science. \n \nI have an international paper published in an IEEE journal. The paper talks about the creation of virtual vocational training scenario for a fabric painting application. \n \nFew academic projects in which I was involved: \n•\tArtificial Intelligence, Summer 2014: Implementation of Chess Engine using Python. \n•\tDatabase Design, Fall 2013: Implementation of B+ Tree indexing on a text file with variable key length using Java. \n•\tSemantic Web, Fall 2013: Visualization of trends in petroleum imports and prices in USA. Technology used: RDF, SPARQL, JavaScript, HTML. \n•\tUndergraduate Trainee in Electronics and Radar Development Establishment (LRDE). Developed a Web based Built-in-Test Display for RADAR Systems, using Java which prioritizing component status messages from mission critical RADAR systems through a secured wireless network thereby increasing overall performance. \n•\tVirtual Fabric Paint Environment using Touch and Gesture technology for Vocational Training, sponsored by Government of India. Tools Used: Visual C# 2008, Microsoft Tablet PC SDK 1.7. \n \nI worked as a Technology Consultant - I for Hewlett Packard Globalsoft Ltd, Bangalore. My daily duties consisted of translating user requirements into well designed Web applications. I dabbled with front-end, middleware, and back-end code and improved the design of the client applications thereby decreasing manual intervention. Actively seeking full time opportunities in the field of software development/engineering. \n \nI enjoy working in the fields of Big Data Analytics, Cloud Computing, Statistics, AI, and Machine Learning areas coupled with Object oriented design. \n \nLove to work in a team involved in developing or testing software and contribute to the growth of the organization in the best way possible by using my knowledge and skills. \n \nCurrently pursuing Masters degree in Computer Science at University of Texas, Dallas with a specialization in Data Science. \n \nI have an international paper published in an IEEE journal. The paper talks about the creation of virtual vocational training scenario for a fabric painting application. \n \nFew academic projects in which I was involved: \n•\tArtificial Intelligence, Summer 2014: Implementation of Chess Engine using Python. \n•\tDatabase Design, Fall 2013: Implementation of B+ Tree indexing on a text file with variable key length using Java. \n•\tSemantic Web, Fall 2013: Visualization of trends in petroleum imports and prices in USA. Technology used: RDF, SPARQL, JavaScript, HTML. \n•\tUndergraduate Trainee in Electronics and Radar Development Establishment (LRDE). Developed a Web based Built-in-Test Display for RADAR Systems, using Java which prioritizing component status messages from mission critical RADAR systems through a secured wireless network thereby increasing overall performance. \n•\tVirtual Fabric Paint Environment using Touch and Gesture technology for Vocational Training, sponsored by Government of India. Tools Used: Visual C# 2008, Microsoft Tablet PC SDK 1.7. \n \nI worked as a Technology Consultant - I for Hewlett Packard Globalsoft Ltd, Bangalore. My daily duties consisted of translating user requirements into well designed Web applications. I dabbled with front-end, middleware, and back-end code and improved the design of the client applications thereby decreasing manual intervention. Experience Software Engineering Intern Intel Corporation January 2015  – Present (8 months) Phoenix, Arizona Area Part of Mobile User Experience (SSG) team developing Proof of Concept Android (Java/native) apps for tablets running on Intel chips to enable ISVs.  \nWorking on apps using Intel RealSense SDK. \nInvolved in bug fixes, UI enhancements, incorporation of Intel Labs algorithms in apps. \nWorking on several Patent Invention Discovery Forms based on original ideas. Graduate Student University of Texas at Dallas Pursuing Master of Science in Computer Science with a specialization in Data Science. Technology Consultant-I Hewlett-Packard August 2010  –  June 2013  (2 years 11 months) Bangalore, India As a Technology Consultant-I my roles included \n•\tImplementation of UI and business components using Yahoo UI and Freemarker Template; maintenance of critical enterprise financial application as a part of OSG Offshore Delivery Team. \n•\tDevelopment of business logic for Chartering Operations for one of the largest shipping group as a part of OSG Offshore Delivery Team. \n•\tImplementation of custom reusable GWT UI components and business logic for few functional modules as a part of MLP Offshore Delivery Team. \n•\tStudies on JUnit test cases for GWT screens, maintenance of code quality using open source tools like Sonar as a part of MLP Offshore Delivery Team. \n•\tFeasibility studies for UI performance enhancements for GWT Screens based on Gin-Guice dependency injection framework as a part of MLP Offshore Delivery Team. \n•\tImplementation of PoC to migrate an Oracle Forms and Reports application to J2EE web application using Struts and Hibernate frameworks. Case studies on DB migration from Sybase to Oracle as a part of Application Modernization Team. Project Trainee Electronics and Radar Development Establishment (LRDE) December 2009  –  May 2010  (6 months) As a trainee in Electronics and Radar Development Establishment (LRDE), developed a Web based Built-in-Test Display for RADAR Systems, using Java. Final Year Undergraduate Amrita University 2006  –  2010  (4 years) Software Engineering Intern Intel Corporation January 2015  – Present (8 months) Phoenix, Arizona Area Part of Mobile User Experience (SSG) team developing Proof of Concept Android (Java/native) apps for tablets running on Intel chips to enable ISVs.  \nWorking on apps using Intel RealSense SDK. \nInvolved in bug fixes, UI enhancements, incorporation of Intel Labs algorithms in apps. \nWorking on several Patent Invention Discovery Forms based on original ideas. Software Engineering Intern Intel Corporation January 2015  – Present (8 months) Phoenix, Arizona Area Part of Mobile User Experience (SSG) team developing Proof of Concept Android (Java/native) apps for tablets running on Intel chips to enable ISVs.  \nWorking on apps using Intel RealSense SDK. \nInvolved in bug fixes, UI enhancements, incorporation of Intel Labs algorithms in apps. \nWorking on several Patent Invention Discovery Forms based on original ideas. Graduate Student University of Texas at Dallas Pursuing Master of Science in Computer Science with a specialization in Data Science. Graduate Student University of Texas at Dallas Pursuing Master of Science in Computer Science with a specialization in Data Science. Technology Consultant-I Hewlett-Packard August 2010  –  June 2013  (2 years 11 months) Bangalore, India As a Technology Consultant-I my roles included \n•\tImplementation of UI and business components using Yahoo UI and Freemarker Template; maintenance of critical enterprise financial application as a part of OSG Offshore Delivery Team. \n•\tDevelopment of business logic for Chartering Operations for one of the largest shipping group as a part of OSG Offshore Delivery Team. \n•\tImplementation of custom reusable GWT UI components and business logic for few functional modules as a part of MLP Offshore Delivery Team. \n•\tStudies on JUnit test cases for GWT screens, maintenance of code quality using open source tools like Sonar as a part of MLP Offshore Delivery Team. \n•\tFeasibility studies for UI performance enhancements for GWT Screens based on Gin-Guice dependency injection framework as a part of MLP Offshore Delivery Team. \n•\tImplementation of PoC to migrate an Oracle Forms and Reports application to J2EE web application using Struts and Hibernate frameworks. Case studies on DB migration from Sybase to Oracle as a part of Application Modernization Team. Technology Consultant-I Hewlett-Packard August 2010  –  June 2013  (2 years 11 months) Bangalore, India As a Technology Consultant-I my roles included \n•\tImplementation of UI and business components using Yahoo UI and Freemarker Template; maintenance of critical enterprise financial application as a part of OSG Offshore Delivery Team. \n•\tDevelopment of business logic for Chartering Operations for one of the largest shipping group as a part of OSG Offshore Delivery Team. \n•\tImplementation of custom reusable GWT UI components and business logic for few functional modules as a part of MLP Offshore Delivery Team. \n•\tStudies on JUnit test cases for GWT screens, maintenance of code quality using open source tools like Sonar as a part of MLP Offshore Delivery Team. \n•\tFeasibility studies for UI performance enhancements for GWT Screens based on Gin-Guice dependency injection framework as a part of MLP Offshore Delivery Team. \n•\tImplementation of PoC to migrate an Oracle Forms and Reports application to J2EE web application using Struts and Hibernate frameworks. Case studies on DB migration from Sybase to Oracle as a part of Application Modernization Team. Project Trainee Electronics and Radar Development Establishment (LRDE) December 2009  –  May 2010  (6 months) As a trainee in Electronics and Radar Development Establishment (LRDE), developed a Web based Built-in-Test Display for RADAR Systems, using Java. Project Trainee Electronics and Radar Development Establishment (LRDE) December 2009  –  May 2010  (6 months) As a trainee in Electronics and Radar Development Establishment (LRDE), developed a Web based Built-in-Test Display for RADAR Systems, using Java. Final Year Undergraduate Amrita University 2006  –  2010  (4 years) Final Year Undergraduate Amrita University 2006  –  2010  (4 years) Languages English Professional working proficiency Kannada Native or bilingual proficiency Hindi Elementary proficiency English Professional working proficiency Kannada Native or bilingual proficiency Hindi Elementary proficiency English Professional working proficiency Kannada Native or bilingual proficiency Hindi Elementary proficiency Professional working proficiency Native or bilingual proficiency Elementary proficiency Skills Java Hadoop Apache Spark MapReduce Cloud Computing IaaS Apache Pig Hive Cassandra Ganglia OpenStack Linux KVM Java Enterprise Edition JavaScript Oracle PL/SQL... Struts C Python R J2EE C++ PL/SQL HTML JSP SPARQL J2SE Google Web Toolkit Adobe Flex Yahoo UI Freemarker Template Oracle Forms Oracle Reports Unix Shell Scripting Awk Sed Servlets Spring CSS OpenCV Hibernate See 24+     See less Skills  Java Hadoop Apache Spark MapReduce Cloud Computing IaaS Apache Pig Hive Cassandra Ganglia OpenStack Linux KVM Java Enterprise Edition JavaScript Oracle PL/SQL... Struts C Python R J2EE C++ PL/SQL HTML JSP SPARQL J2SE Google Web Toolkit Adobe Flex Yahoo UI Freemarker Template Oracle Forms Oracle Reports Unix Shell Scripting Awk Sed Servlets Spring CSS OpenCV Hibernate See 24+     See less Java Hadoop Apache Spark MapReduce Cloud Computing IaaS Apache Pig Hive Cassandra Ganglia OpenStack Linux KVM Java Enterprise Edition JavaScript Oracle PL/SQL... Struts C Python R J2EE C++ PL/SQL HTML JSP SPARQL J2SE Google Web Toolkit Adobe Flex Yahoo UI Freemarker Template Oracle Forms Oracle Reports Unix Shell Scripting Awk Sed Servlets Spring CSS OpenCV Hibernate See 24+     See less Java Hadoop Apache Spark MapReduce Cloud Computing IaaS Apache Pig Hive Cassandra Ganglia OpenStack Linux KVM Java Enterprise Edition JavaScript Oracle PL/SQL... Struts C Python R J2EE C++ PL/SQL HTML JSP SPARQL J2SE Google Web Toolkit Adobe Flex Yahoo UI Freemarker Template Oracle Forms Oracle Reports Unix Shell Scripting Awk Sed Servlets Spring CSS OpenCV Hibernate See 24+     See less Education The University of Texas at Dallas Master of Science (MS),  Computer Science , 4.00 2013  – 2015 Pursuing Masters in Computer Science with a specialization in Data Sciences. Amrita School of Engineering, Bangalore B.Tech,  Computer Science and Engineering , 9.28/10 2006  – 2010 MES PU College for Arts, Commerce and Science 2004  – 2006 Vidya Vardhaka Sangha High School 2001  – 2004 Sangha High School Arts; S.S.L,  Science and Commerce; C The University of Texas at Dallas Master of Science (MS),  Computer Science , 4.00 2013  – 2015 Pursuing Masters in Computer Science with a specialization in Data Sciences. The University of Texas at Dallas Master of Science (MS),  Computer Science , 4.00 2013  – 2015 Pursuing Masters in Computer Science with a specialization in Data Sciences. The University of Texas at Dallas Master of Science (MS),  Computer Science , 4.00 2013  – 2015 Pursuing Masters in Computer Science with a specialization in Data Sciences. Amrita School of Engineering, Bangalore B.Tech,  Computer Science and Engineering , 9.28/10 2006  – 2010 Amrita School of Engineering, Bangalore B.Tech,  Computer Science and Engineering , 9.28/10 2006  – 2010 Amrita School of Engineering, Bangalore B.Tech,  Computer Science and Engineering , 9.28/10 2006  – 2010 MES PU College for Arts, Commerce and Science 2004  – 2006 MES PU College for Arts, Commerce and Science 2004  – 2006 MES PU College for Arts, Commerce and Science 2004  – 2006 Vidya Vardhaka Sangha High School 2001  – 2004 Vidya Vardhaka Sangha High School 2001  – 2004 Vidya Vardhaka Sangha High School 2001  – 2004 Sangha High School Arts; S.S.L,  Science and Commerce; C Sangha High School Arts; S.S.L,  Science and Commerce; C Sangha High School Arts; S.S.L,  Science and Commerce; C Honors & Awards ECS Jonsson Graduate Scholarship Erik Jonsson School of Engineering and Computer Science at The University of Texas at Dallas September 2013 A competitive, merit based scholarship awarded to selected incoming graduate students which also qualifies for an out of state tuition waiver.  ECS Jonsson Graduate Scholarship Erik Jonsson School of Engineering and Computer Science at The University of Texas at Dallas September 2013 A competitive, merit based scholarship awarded to selected incoming graduate students which also qualifies for an out of state tuition waiver.  ECS Jonsson Graduate Scholarship Erik Jonsson School of Engineering and Computer Science at The University of Texas at Dallas September 2013 A competitive, merit based scholarship awarded to selected incoming graduate students which also qualifies for an out of state tuition waiver.  ECS Jonsson Graduate Scholarship Erik Jonsson School of Engineering and Computer Science at The University of Texas at Dallas September 2013 A competitive, merit based scholarship awarded to selected incoming graduate students which also qualifies for an out of state tuition waiver.  ", "Summary • Knowledgeable in Embedded Systems, Driver Development and Computer Architecture \n• Proficient in C, C++ and x86 Assembly Language. \n• Developed SPI and I2C drivers for Intel Galileo Gen2 board using C in Linux (Ubuntu) \n• Proficient in Java, JSP, Servlets, C#, ASP.NET, WebApi, Entity Framework. \n• Software Developer at Arizona State University (Department of Behavioral Health). \n• Responsibilities include developing and maintaining their website and student database.  \n• Proficient in HTML5, CSS3, JavaScript and JQuery. \n• Proficient in MATLAB. Worked with Digital Signal/Image Processing tools.  \n• Worked with Logical Analyzers in ModelSim/SimuLink.  \n• Programmed Cyclone III FPGA in Verilog using Altera Quartus to develop novel median filters that utilizes data structure algorithms (quick sort and heap sort). \n• Knowledgeable in networking protocols and socket programming using Java (TCP/IP, UDP). \n• Knowledgeable in cryptographic algorithms (DES, AES) Summary • Knowledgeable in Embedded Systems, Driver Development and Computer Architecture \n• Proficient in C, C++ and x86 Assembly Language. \n• Developed SPI and I2C drivers for Intel Galileo Gen2 board using C in Linux (Ubuntu) \n• Proficient in Java, JSP, Servlets, C#, ASP.NET, WebApi, Entity Framework. \n• Software Developer at Arizona State University (Department of Behavioral Health). \n• Responsibilities include developing and maintaining their website and student database.  \n• Proficient in HTML5, CSS3, JavaScript and JQuery. \n• Proficient in MATLAB. Worked with Digital Signal/Image Processing tools.  \n• Worked with Logical Analyzers in ModelSim/SimuLink.  \n• Programmed Cyclone III FPGA in Verilog using Altera Quartus to develop novel median filters that utilizes data structure algorithms (quick sort and heap sort). \n• Knowledgeable in networking protocols and socket programming using Java (TCP/IP, UDP). \n• Knowledgeable in cryptographic algorithms (DES, AES) • Knowledgeable in Embedded Systems, Driver Development and Computer Architecture \n• Proficient in C, C++ and x86 Assembly Language. \n• Developed SPI and I2C drivers for Intel Galileo Gen2 board using C in Linux (Ubuntu) \n• Proficient in Java, JSP, Servlets, C#, ASP.NET, WebApi, Entity Framework. \n• Software Developer at Arizona State University (Department of Behavioral Health). \n• Responsibilities include developing and maintaining their website and student database.  \n• Proficient in HTML5, CSS3, JavaScript and JQuery. \n• Proficient in MATLAB. Worked with Digital Signal/Image Processing tools.  \n• Worked with Logical Analyzers in ModelSim/SimuLink.  \n• Programmed Cyclone III FPGA in Verilog using Altera Quartus to develop novel median filters that utilizes data structure algorithms (quick sort and heap sort). \n• Knowledgeable in networking protocols and socket programming using Java (TCP/IP, UDP). \n• Knowledgeable in cryptographic algorithms (DES, AES) • Knowledgeable in Embedded Systems, Driver Development and Computer Architecture \n• Proficient in C, C++ and x86 Assembly Language. \n• Developed SPI and I2C drivers for Intel Galileo Gen2 board using C in Linux (Ubuntu) \n• Proficient in Java, JSP, Servlets, C#, ASP.NET, WebApi, Entity Framework. \n• Software Developer at Arizona State University (Department of Behavioral Health). \n• Responsibilities include developing and maintaining their website and student database.  \n• Proficient in HTML5, CSS3, JavaScript and JQuery. \n• Proficient in MATLAB. Worked with Digital Signal/Image Processing tools.  \n• Worked with Logical Analyzers in ModelSim/SimuLink.  \n• Programmed Cyclone III FPGA in Verilog using Altera Quartus to develop novel median filters that utilizes data structure algorithms (quick sort and heap sort). \n• Knowledgeable in networking protocols and socket programming using Java (TCP/IP, UDP). \n• Knowledgeable in cryptographic algorithms (DES, AES) Experience Software Engineering Intern Intel Corporation May 2015  – Present (4 months) Chandler, Arizona Develop and maintain driver components for camera sensors. Software Developer Arizona State University May 2014  –  May 2015  (1 year 1 month) Phoenix, Arizona Involved in design, development and maintenance of student database and web pages using JQuery, Javascript, C# and ASP.NET using Visual Studio IDE. Assistant System Engineer Tata Consultancy Services August 2012  –  December 2013  (1 year 5 months) chennai, tamil nadu Developer for main frames Software Engineering Intern Intel Corporation May 2015  – Present (4 months) Chandler, Arizona Develop and maintain driver components for camera sensors. Software Engineering Intern Intel Corporation May 2015  – Present (4 months) Chandler, Arizona Develop and maintain driver components for camera sensors. Software Developer Arizona State University May 2014  –  May 2015  (1 year 1 month) Phoenix, Arizona Involved in design, development and maintenance of student database and web pages using JQuery, Javascript, C# and ASP.NET using Visual Studio IDE. Software Developer Arizona State University May 2014  –  May 2015  (1 year 1 month) Phoenix, Arizona Involved in design, development and maintenance of student database and web pages using JQuery, Javascript, C# and ASP.NET using Visual Studio IDE. Assistant System Engineer Tata Consultancy Services August 2012  –  December 2013  (1 year 5 months) chennai, tamil nadu Developer for main frames Assistant System Engineer Tata Consultancy Services August 2012  –  December 2013  (1 year 5 months) chennai, tamil nadu Developer for main frames Languages English Native or bilingual proficiency Tamil Native or bilingual proficiency Hindi Full professional proficiency Telugu Professional working proficiency English Native or bilingual proficiency Tamil Native or bilingual proficiency Hindi Full professional proficiency Telugu Professional working proficiency English Native or bilingual proficiency Tamil Native or bilingual proficiency Hindi Full professional proficiency Telugu Professional working proficiency Native or bilingual proficiency Native or bilingual proficiency Full professional proficiency Professional working proficiency Skills C C++ C# Java ASP.NET Web API ASP.NET MVC .NET Visual Studio Device Drivers Algorithms HTML CSS JavaScript jQuery jQuery UI Entity Framework AngularJS Eclipse NetBeans Windows Linux Ubuntu Matlab Programming MySQL Android Development Embedded Systems Data Structures ASP.NET See 14+     See less Skills  C C++ C# Java ASP.NET Web API ASP.NET MVC .NET Visual Studio Device Drivers Algorithms HTML CSS JavaScript jQuery jQuery UI Entity Framework AngularJS Eclipse NetBeans Windows Linux Ubuntu Matlab Programming MySQL Android Development Embedded Systems Data Structures ASP.NET See 14+     See less C C++ C# Java ASP.NET Web API ASP.NET MVC .NET Visual Studio Device Drivers Algorithms HTML CSS JavaScript jQuery jQuery UI Entity Framework AngularJS Eclipse NetBeans Windows Linux Ubuntu Matlab Programming MySQL Android Development Embedded Systems Data Structures ASP.NET See 14+     See less C C++ C# Java ASP.NET Web API ASP.NET MVC .NET Visual Studio Device Drivers Algorithms HTML CSS JavaScript jQuery jQuery UI Entity Framework AngularJS Eclipse NetBeans Windows Linux Ubuntu Matlab Programming MySQL Android Development Embedded Systems Data Structures ASP.NET See 14+     See less Education Arizona State University Master of Science (MS),  Computer Engineering , 3.4/4.0 2014  – 2015 Graduate Student in Computer Engineering. Working as a Software Developer for Arizona State University. Activities and Societies:  Indian Students Association Anna University Bachelor of Engineering (B.E.),  Electrical , Electronics and Communications Engineering , 8.9 2008  – 2012 Graduated with a Bachelor's Degree in Electronics and Communication Engineering - Active Member of IEEE Student Branch - Joint Secretary, Women In Engineering, IEEE - Organized technical symposiums - Published papers at International Conferences Activities and Societies:  Joint Secretary ,  Women In Engineering ,  IEEE.\nVice President ,  Club Robotica ,  Easwari Engineering College. Arizona State University Master of Science (MS),  Computer Engineering , 3.4/4.0 2014  – 2015 Graduate Student in Computer Engineering. Working as a Software Developer for Arizona State University. Activities and Societies:  Indian Students Association Arizona State University Master of Science (MS),  Computer Engineering , 3.4/4.0 2014  – 2015 Graduate Student in Computer Engineering. Working as a Software Developer for Arizona State University. Activities and Societies:  Indian Students Association Arizona State University Master of Science (MS),  Computer Engineering , 3.4/4.0 2014  – 2015 Graduate Student in Computer Engineering. Working as a Software Developer for Arizona State University. Activities and Societies:  Indian Students Association Anna University Bachelor of Engineering (B.E.),  Electrical , Electronics and Communications Engineering , 8.9 2008  – 2012 Graduated with a Bachelor's Degree in Electronics and Communication Engineering - Active Member of IEEE Student Branch - Joint Secretary, Women In Engineering, IEEE - Organized technical symposiums - Published papers at International Conferences Activities and Societies:  Joint Secretary ,  Women In Engineering ,  IEEE.\nVice President ,  Club Robotica ,  Easwari Engineering College. Anna University Bachelor of Engineering (B.E.),  Electrical , Electronics and Communications Engineering , 8.9 2008  – 2012 Graduated with a Bachelor's Degree in Electronics and Communication Engineering - Active Member of IEEE Student Branch - Joint Secretary, Women In Engineering, IEEE - Organized technical symposiums - Published papers at International Conferences Activities and Societies:  Joint Secretary ,  Women In Engineering ,  IEEE.\nVice President ,  Club Robotica ,  Easwari Engineering College. Anna University Bachelor of Engineering (B.E.),  Electrical , Electronics and Communications Engineering , 8.9 2008  – 2012 Graduated with a Bachelor's Degree in Electronics and Communication Engineering - Active Member of IEEE Student Branch - Joint Secretary, Women In Engineering, IEEE - Organized technical symposiums - Published papers at International Conferences Activities and Societies:  Joint Secretary ,  Women In Engineering ,  IEEE.\nVice President ,  Club Robotica ,  Easwari Engineering College. ", "Experience Software Engineering Intern Intel Corporation July 2014  –  September 2014  (3 months) Hillsboro, OR Wrote and documented a simpler API for the configuration package Buxton. Developed a new notification system for the Tizen-specific Buxton package. Research Assistant Portland State University January 2014  –  July 2014  (7 months) Portland, OR Complete broad range of work on a Corpus Linguistics study \nFormat documents to preserve anonymity and prepare for concordancing software \nWrote a program to aid researchers in quickly fixing commonly mis-tagged words Grader Portland State University September 2013  –  April 2014  (8 months) Portland, Oregon Area Graded programs for a Programming Systems class Software Engineering Intern Intel Corporation June 2013  –  September 2013  (4 months) Hillsboro, OR Worked with a team to leverage my linguistics background to develop an algorithm for detecting question syntax in a natural language text. I cut costs for the implementation by replacing 3rd party software with a solution implemented with open source software. I compiled training and testing sets from available source corpora. Precision and recall both increased after using the system I developed. At the end of the internship, I demonstrated the uses for a group of managers by integrating it with Outlook as a plug-in. \n \nPatent pending for Question Detection in Natural Language. Software Engineering Intern Intel Corporation June 2012  –  September 2012  (4 months) Hillsboro, OR Developed open source ConnMan network manager command line interface and successfully finished, merged and distributed it online within deadline. \nBecame proficient in C programming language and Linux/ Unix tools with no prior experience. \nLearned the open source software development work flow Software Engineering Intern Intel Corporation July 2014  –  September 2014  (3 months) Hillsboro, OR Wrote and documented a simpler API for the configuration package Buxton. Developed a new notification system for the Tizen-specific Buxton package. Software Engineering Intern Intel Corporation July 2014  –  September 2014  (3 months) Hillsboro, OR Wrote and documented a simpler API for the configuration package Buxton. Developed a new notification system for the Tizen-specific Buxton package. Research Assistant Portland State University January 2014  –  July 2014  (7 months) Portland, OR Complete broad range of work on a Corpus Linguistics study \nFormat documents to preserve anonymity and prepare for concordancing software \nWrote a program to aid researchers in quickly fixing commonly mis-tagged words Research Assistant Portland State University January 2014  –  July 2014  (7 months) Portland, OR Complete broad range of work on a Corpus Linguistics study \nFormat documents to preserve anonymity and prepare for concordancing software \nWrote a program to aid researchers in quickly fixing commonly mis-tagged words Grader Portland State University September 2013  –  April 2014  (8 months) Portland, Oregon Area Graded programs for a Programming Systems class Grader Portland State University September 2013  –  April 2014  (8 months) Portland, Oregon Area Graded programs for a Programming Systems class Software Engineering Intern Intel Corporation June 2013  –  September 2013  (4 months) Hillsboro, OR Worked with a team to leverage my linguistics background to develop an algorithm for detecting question syntax in a natural language text. I cut costs for the implementation by replacing 3rd party software with a solution implemented with open source software. I compiled training and testing sets from available source corpora. Precision and recall both increased after using the system I developed. At the end of the internship, I demonstrated the uses for a group of managers by integrating it with Outlook as a plug-in. \n \nPatent pending for Question Detection in Natural Language. Software Engineering Intern Intel Corporation June 2013  –  September 2013  (4 months) Hillsboro, OR Worked with a team to leverage my linguistics background to develop an algorithm for detecting question syntax in a natural language text. I cut costs for the implementation by replacing 3rd party software with a solution implemented with open source software. I compiled training and testing sets from available source corpora. Precision and recall both increased after using the system I developed. At the end of the internship, I demonstrated the uses for a group of managers by integrating it with Outlook as a plug-in. \n \nPatent pending for Question Detection in Natural Language. Software Engineering Intern Intel Corporation June 2012  –  September 2012  (4 months) Hillsboro, OR Developed open source ConnMan network manager command line interface and successfully finished, merged and distributed it online within deadline. \nBecame proficient in C programming language and Linux/ Unix tools with no prior experience. \nLearned the open source software development work flow Software Engineering Intern Intel Corporation June 2012  –  September 2012  (4 months) Hillsboro, OR Developed open source ConnMan network manager command line interface and successfully finished, merged and distributed it online within deadline. \nBecame proficient in C programming language and Linux/ Unix tools with no prior experience. \nLearned the open source software development work flow Languages English French English French English French Skills Natural Language... Computational... Applied Linguistics Linguistics Software Development Software Engineering Corpus Linguistics Machine Learning Skills  Natural Language... Computational... Applied Linguistics Linguistics Software Development Software Engineering Corpus Linguistics Machine Learning Natural Language... Computational... Applied Linguistics Linguistics Software Development Software Engineering Corpus Linguistics Machine Learning Natural Language... Computational... Applied Linguistics Linguistics Software Development Software Engineering Corpus Linguistics Machine Learning Education University of Washington Master of Science (M.S.),  Computational Linguistics 2014  – 2015 Received a Computational Linguistics Scholarship \nImplemented a grammar fragment of Yakima Sahaptin in the HPSG framework using the Delph-in LinGo grammar matrix \nImplemented a variety of machine learning algorithms \nImplemented various types of gammars and parsers Portland State University Bachelor of Arts (B.A.),  Applied Linguistics , 3.8 2010  – 2014 Minors in Computer Science and French University of Washington Master of Science (M.S.),  Computational Linguistics 2014  – 2015 Received a Computational Linguistics Scholarship \nImplemented a grammar fragment of Yakima Sahaptin in the HPSG framework using the Delph-in LinGo grammar matrix \nImplemented a variety of machine learning algorithms \nImplemented various types of gammars and parsers University of Washington Master of Science (M.S.),  Computational Linguistics 2014  – 2015 Received a Computational Linguistics Scholarship \nImplemented a grammar fragment of Yakima Sahaptin in the HPSG framework using the Delph-in LinGo grammar matrix \nImplemented a variety of machine learning algorithms \nImplemented various types of gammars and parsers University of Washington Master of Science (M.S.),  Computational Linguistics 2014  – 2015 Received a Computational Linguistics Scholarship \nImplemented a grammar fragment of Yakima Sahaptin in the HPSG framework using the Delph-in LinGo grammar matrix \nImplemented a variety of machine learning algorithms \nImplemented various types of gammars and parsers Portland State University Bachelor of Arts (B.A.),  Applied Linguistics , 3.8 2010  – 2014 Minors in Computer Science and French Portland State University Bachelor of Arts (B.A.),  Applied Linguistics , 3.8 2010  – 2014 Minors in Computer Science and French Portland State University Bachelor of Arts (B.A.),  Applied Linguistics , 3.8 2010  – 2014 Minors in Computer Science and French ", "Summary I am a PhD student in Electrical and Computer Engineering at UC Davis. Summary I am a PhD student in Electrical and Computer Engineering at UC Davis. I am a PhD student in Electrical and Computer Engineering at UC Davis. I am a PhD student in Electrical and Computer Engineering at UC Davis. Experience Graduate Student UC Davis September 2011  – Present (4 years) Software Engineering Intern Intel Corporation June 2013  –  September 2013  (4 months) Hillsboro, OR Software Engineering Intern Intel Corporation June 2012  –  September 2012  (4 months) Hillsboro, OR Water Resources Intern San Antonio Water System June 2011  –  August 2011  (3 months) San Antonio, Texas Area NSF Research Experience for Undergraduates University of Houston May 2009  –  July 2009  (3 months) Graduate Student UC Davis September 2011  – Present (4 years) Graduate Student UC Davis September 2011  – Present (4 years) Software Engineering Intern Intel Corporation June 2013  –  September 2013  (4 months) Hillsboro, OR Software Engineering Intern Intel Corporation June 2013  –  September 2013  (4 months) Hillsboro, OR Software Engineering Intern Intel Corporation June 2012  –  September 2012  (4 months) Hillsboro, OR Software Engineering Intern Intel Corporation June 2012  –  September 2012  (4 months) Hillsboro, OR Water Resources Intern San Antonio Water System June 2011  –  August 2011  (3 months) San Antonio, Texas Area Water Resources Intern San Antonio Water System June 2011  –  August 2011  (3 months) San Antonio, Texas Area NSF Research Experience for Undergraduates University of Houston May 2009  –  July 2009  (3 months) NSF Research Experience for Undergraduates University of Houston May 2009  –  July 2009  (3 months) Education University of California, Davis 2011  – 2016 Trinity University BS, BA,  Engineering Science ,  Physics 2007  – 2011 Activities and Societies:  SWE ,  Water Polo ,  Graffiti Wipeout ,  IEEE ,  Cat Alliance University of California, Davis 2011  – 2016 University of California, Davis 2011  – 2016 University of California, Davis 2011  – 2016 Trinity University BS, BA,  Engineering Science ,  Physics 2007  – 2011 Activities and Societies:  SWE ,  Water Polo ,  Graffiti Wipeout ,  IEEE ,  Cat Alliance Trinity University BS, BA,  Engineering Science ,  Physics 2007  – 2011 Activities and Societies:  SWE ,  Water Polo ,  Graffiti Wipeout ,  IEEE ,  Cat Alliance Trinity University BS, BA,  Engineering Science ,  Physics 2007  – 2011 Activities and Societies:  SWE ,  Water Polo ,  Graffiti Wipeout ,  IEEE ,  Cat Alliance ", "Experience Physical Design Engineer Intel Corporation June 2013  – Present (2 years 3 months) Hillsboro, OR Circuit and physical design engineering. Tutor California State Polytechnic University, Pomona, EOP September 2010  –  June 2013  (2 years 10 months) Guided students in understanding elementary physics, mathematics, and various courses in the Electrical and Computer Engineering curriculum. Software Engineering Intern Intel Corporation June 2012  –  September 2012  (4 months) Hillsboro, OR Xeon Phi Coprocessor (Intel MIC Architecture) software performance validation. Software Engineering Intern Intel Corporation June 2011  –  December 2011  (7 months) MIC is a multiprocessor computer architecture delivering highly parallelized applications and high performance computing capabilities with familiar programming models, techniques, and tools.  \n \nWorked with developers on API libraries to assist with the automation of test content and reports. \n \nDeveloped data analysis tools to produce reports on SQL and .NET C# platform. \n \nDeveloped and maintained automation tools using C++, Perl, Python, and Shell scripting to facilitate performance benchmark testing of hardware and software components on a Linux Platform. Undergraduate Technical Intern Kaiser Permanente June 2010  –  September 2010  (4 months) Developed maintenance modules for a web based application on a Java platform to manage Contract and Labor agreements. \n \nDesigned maintenance modules to be self-contained, easy to use screens that will allow users to add, remove, and modify contract and labor agreement information with minimal training. Physical Design Engineer Intel Corporation June 2013  – Present (2 years 3 months) Hillsboro, OR Circuit and physical design engineering. Physical Design Engineer Intel Corporation June 2013  – Present (2 years 3 months) Hillsboro, OR Circuit and physical design engineering. Tutor California State Polytechnic University, Pomona, EOP September 2010  –  June 2013  (2 years 10 months) Guided students in understanding elementary physics, mathematics, and various courses in the Electrical and Computer Engineering curriculum. Tutor California State Polytechnic University, Pomona, EOP September 2010  –  June 2013  (2 years 10 months) Guided students in understanding elementary physics, mathematics, and various courses in the Electrical and Computer Engineering curriculum. Software Engineering Intern Intel Corporation June 2012  –  September 2012  (4 months) Hillsboro, OR Xeon Phi Coprocessor (Intel MIC Architecture) software performance validation. Software Engineering Intern Intel Corporation June 2012  –  September 2012  (4 months) Hillsboro, OR Xeon Phi Coprocessor (Intel MIC Architecture) software performance validation. Software Engineering Intern Intel Corporation June 2011  –  December 2011  (7 months) MIC is a multiprocessor computer architecture delivering highly parallelized applications and high performance computing capabilities with familiar programming models, techniques, and tools.  \n \nWorked with developers on API libraries to assist with the automation of test content and reports. \n \nDeveloped data analysis tools to produce reports on SQL and .NET C# platform. \n \nDeveloped and maintained automation tools using C++, Perl, Python, and Shell scripting to facilitate performance benchmark testing of hardware and software components on a Linux Platform. Software Engineering Intern Intel Corporation June 2011  –  December 2011  (7 months) MIC is a multiprocessor computer architecture delivering highly parallelized applications and high performance computing capabilities with familiar programming models, techniques, and tools.  \n \nWorked with developers on API libraries to assist with the automation of test content and reports. \n \nDeveloped data analysis tools to produce reports on SQL and .NET C# platform. \n \nDeveloped and maintained automation tools using C++, Perl, Python, and Shell scripting to facilitate performance benchmark testing of hardware and software components on a Linux Platform. Undergraduate Technical Intern Kaiser Permanente June 2010  –  September 2010  (4 months) Developed maintenance modules for a web based application on a Java platform to manage Contract and Labor agreements. \n \nDesigned maintenance modules to be self-contained, easy to use screens that will allow users to add, remove, and modify contract and labor agreement information with minimal training. Undergraduate Technical Intern Kaiser Permanente June 2010  –  September 2010  (4 months) Developed maintenance modules for a web based application on a Java platform to manage Contract and Labor agreements. \n \nDesigned maintenance modules to be self-contained, easy to use screens that will allow users to add, remove, and modify contract and labor agreement information with minimal training. Skills Python Perl C++ Shell Scripting Java VHDL Verilog Digital Circuit Design FPGA Microcontrollers C C# Matlab Visual Basic Integrated Circuit... Labview Physical Design VLSI CAD Linux Testing See 5+     See less Skills  Python Perl C++ Shell Scripting Java VHDL Verilog Digital Circuit Design FPGA Microcontrollers C C# Matlab Visual Basic Integrated Circuit... Labview Physical Design VLSI CAD Linux Testing See 5+     See less Python Perl C++ Shell Scripting Java VHDL Verilog Digital Circuit Design FPGA Microcontrollers C C# Matlab Visual Basic Integrated Circuit... Labview Physical Design VLSI CAD Linux Testing See 5+     See less Python Perl C++ Shell Scripting Java VHDL Verilog Digital Circuit Design FPGA Microcontrollers C C# Matlab Visual Basic Integrated Circuit... Labview Physical Design VLSI CAD Linux Testing See 5+     See less Education California State Polytechnic University-Pomona Bachelor of Science (B.S.),  Computer Engineering 2008  – 2013 Activities and Societies:  IEEE ,  Tau Beta Pi ,  Maximizing Engineering Potential (MEP) California State Polytechnic University-Pomona Bachelor of Science (B.S.),  Computer Engineering 2008  – 2013 Activities and Societies:  IEEE ,  Tau Beta Pi ,  Maximizing Engineering Potential (MEP) California State Polytechnic University-Pomona Bachelor of Science (B.S.),  Computer Engineering 2008  – 2013 Activities and Societies:  IEEE ,  Tau Beta Pi ,  Maximizing Engineering Potential (MEP) California State Polytechnic University-Pomona Bachelor of Science (B.S.),  Computer Engineering 2008  – 2013 Activities and Societies:  IEEE ,  Tau Beta Pi ,  Maximizing Engineering Potential (MEP) ", "Summary I am a hard working and determined student at Wartburg College, majoring in Computer Science. I have a significant amount of Internship experience that has been monumental for the development of my engineering and communication skills. Summary I am a hard working and determined student at Wartburg College, majoring in Computer Science. I have a significant amount of Internship experience that has been monumental for the development of my engineering and communication skills. I am a hard working and determined student at Wartburg College, majoring in Computer Science. I have a significant amount of Internship experience that has been monumental for the development of my engineering and communication skills. I am a hard working and determined student at Wartburg College, majoring in Computer Science. I have a significant amount of Internship experience that has been monumental for the development of my engineering and communication skills. Experience Undergrad Software Engineering Intern Intel Corporation June 2015  – Present (3 months) Folsom, California Utilizing the robust programming language of Python, and more specifically, the PyVisa library, I am automating several engineering tools(oscilloscope, network analyzer, external power supply). Through enabling the automation of these tools, I have saved many hours of, what would be, in-person debugging on computer memory technologies. \n \nI am also in charge of low power DDR3 and DDR4 memory test execution, as well as automating the validation and failure characterization of those devices. The automation is done via a Python program which parses the log file and organizes the data in a logical and easy to understand matter. The program then produces a very readable excel report. Web Developer Intern Field Squared January 2015  –  April 2015  (4 months) Denver, CO At Field Squared I worked on the Web App aspect of their product, fixing bugs and defects, and also implementing requested features. \n \nWhile working here, I am contributed many client side AngularJS (JavaScript), HTML and CSS bug fixes in a fast paced development environment. Undergraduate Software Engineering Intern Intel Corporation May 2014  –  December 2014  (8 months) Folsom, CA I worked in Test and Validation for PMO(Platform Memory Operations). PMO works with memory suppliers to help test, develop, and validate computer memory.  \n \nWhile at Intel: \n \n• Conducted functional and environmental tests on Dynamic Random-Access \nMemory (DRAM) chips, in Platform Memory Operations. \n• Automated validation processes by developing Python scripts, reducing task \ntime from 3 hours to 0 hours per chip. \n• Developed test flow code that helps test and debug DRAM chips, using C/C++. \n• Enabled remote control over environmental testing through a GPIB cable, and \nworked on a C program that allowed for scripting the temperature changes. Software Engineering Undergraduate Intern Rockwell Collins August 2011  –  March 2014  (2 years 8 months) Cedar Rapids, Iowa Area At Rockwell Collins I started out in the high school internship program. It was a select program that gave Juniors and Seniors in highschoolers a chance to intern with several groups at Rockwell. After I graduated high school my position changed to a software engineering undergrad intern. Between the various groups i interned with, I learned a lot of technical and soft skills. \n \nSome achievements are: \n• Obtained a United States Government security clearance in order to \nautomate classified XML data retrieval and testing, using Java. \n• Helped to create a streamlined Linux development environment that nearly \neliminated the lengthy process of setting up a working environment for the \ntarget hardware. \n• Wrote a front-end in Java for the UCC (Unified Code Count) tool, which \nhelped to drastically reduce user interaction time amongst team members. \n• Wrote Python scripts that simulated communication between a Rockwell \nCollins product and an airport’s ground control which helped release the \nproduct within its intended schedule. \n• Participant of a select high school internship program from 2011 to 2012. Undergrad Software Engineering Intern Intel Corporation June 2015  – Present (3 months) Folsom, California Utilizing the robust programming language of Python, and more specifically, the PyVisa library, I am automating several engineering tools(oscilloscope, network analyzer, external power supply). Through enabling the automation of these tools, I have saved many hours of, what would be, in-person debugging on computer memory technologies. \n \nI am also in charge of low power DDR3 and DDR4 memory test execution, as well as automating the validation and failure characterization of those devices. The automation is done via a Python program which parses the log file and organizes the data in a logical and easy to understand matter. The program then produces a very readable excel report. Undergrad Software Engineering Intern Intel Corporation June 2015  – Present (3 months) Folsom, California Utilizing the robust programming language of Python, and more specifically, the PyVisa library, I am automating several engineering tools(oscilloscope, network analyzer, external power supply). Through enabling the automation of these tools, I have saved many hours of, what would be, in-person debugging on computer memory technologies. \n \nI am also in charge of low power DDR3 and DDR4 memory test execution, as well as automating the validation and failure characterization of those devices. The automation is done via a Python program which parses the log file and organizes the data in a logical and easy to understand matter. The program then produces a very readable excel report. Web Developer Intern Field Squared January 2015  –  April 2015  (4 months) Denver, CO At Field Squared I worked on the Web App aspect of their product, fixing bugs and defects, and also implementing requested features. \n \nWhile working here, I am contributed many client side AngularJS (JavaScript), HTML and CSS bug fixes in a fast paced development environment. Web Developer Intern Field Squared January 2015  –  April 2015  (4 months) Denver, CO At Field Squared I worked on the Web App aspect of their product, fixing bugs and defects, and also implementing requested features. \n \nWhile working here, I am contributed many client side AngularJS (JavaScript), HTML and CSS bug fixes in a fast paced development environment. Undergraduate Software Engineering Intern Intel Corporation May 2014  –  December 2014  (8 months) Folsom, CA I worked in Test and Validation for PMO(Platform Memory Operations). PMO works with memory suppliers to help test, develop, and validate computer memory.  \n \nWhile at Intel: \n \n• Conducted functional and environmental tests on Dynamic Random-Access \nMemory (DRAM) chips, in Platform Memory Operations. \n• Automated validation processes by developing Python scripts, reducing task \ntime from 3 hours to 0 hours per chip. \n• Developed test flow code that helps test and debug DRAM chips, using C/C++. \n• Enabled remote control over environmental testing through a GPIB cable, and \nworked on a C program that allowed for scripting the temperature changes. Undergraduate Software Engineering Intern Intel Corporation May 2014  –  December 2014  (8 months) Folsom, CA I worked in Test and Validation for PMO(Platform Memory Operations). PMO works with memory suppliers to help test, develop, and validate computer memory.  \n \nWhile at Intel: \n \n• Conducted functional and environmental tests on Dynamic Random-Access \nMemory (DRAM) chips, in Platform Memory Operations. \n• Automated validation processes by developing Python scripts, reducing task \ntime from 3 hours to 0 hours per chip. \n• Developed test flow code that helps test and debug DRAM chips, using C/C++. \n• Enabled remote control over environmental testing through a GPIB cable, and \nworked on a C program that allowed for scripting the temperature changes. Software Engineering Undergraduate Intern Rockwell Collins August 2011  –  March 2014  (2 years 8 months) Cedar Rapids, Iowa Area At Rockwell Collins I started out in the high school internship program. It was a select program that gave Juniors and Seniors in highschoolers a chance to intern with several groups at Rockwell. After I graduated high school my position changed to a software engineering undergrad intern. Between the various groups i interned with, I learned a lot of technical and soft skills. \n \nSome achievements are: \n• Obtained a United States Government security clearance in order to \nautomate classified XML data retrieval and testing, using Java. \n• Helped to create a streamlined Linux development environment that nearly \neliminated the lengthy process of setting up a working environment for the \ntarget hardware. \n• Wrote a front-end in Java for the UCC (Unified Code Count) tool, which \nhelped to drastically reduce user interaction time amongst team members. \n• Wrote Python scripts that simulated communication between a Rockwell \nCollins product and an airport’s ground control which helped release the \nproduct within its intended schedule. \n• Participant of a select high school internship program from 2011 to 2012. Software Engineering Undergraduate Intern Rockwell Collins August 2011  –  March 2014  (2 years 8 months) Cedar Rapids, Iowa Area At Rockwell Collins I started out in the high school internship program. It was a select program that gave Juniors and Seniors in highschoolers a chance to intern with several groups at Rockwell. After I graduated high school my position changed to a software engineering undergrad intern. Between the various groups i interned with, I learned a lot of technical and soft skills. \n \nSome achievements are: \n• Obtained a United States Government security clearance in order to \nautomate classified XML data retrieval and testing, using Java. \n• Helped to create a streamlined Linux development environment that nearly \neliminated the lengthy process of setting up a working environment for the \ntarget hardware. \n• Wrote a front-end in Java for the UCC (Unified Code Count) tool, which \nhelped to drastically reduce user interaction time amongst team members. \n• Wrote Python scripts that simulated communication between a Rockwell \nCollins product and an airport’s ground control which helped release the \nproduct within its intended schedule. \n• Participant of a select high school internship program from 2011 to 2012. Languages English Native or bilingual proficiency Spanish Elementary proficiency English Native or bilingual proficiency Spanish Elementary proficiency English Native or bilingual proficiency Spanish Elementary proficiency Native or bilingual proficiency Elementary proficiency Skills Software Engineering Python C++ Testing Linux Web Development JavaScript HTML5 Test Automation AngularJS jQuery Automation Team Leadership People Skills Object Oriented Design Java GUI development Microsoft Office See 3+     See less Skills  Software Engineering Python C++ Testing Linux Web Development JavaScript HTML5 Test Automation AngularJS jQuery Automation Team Leadership People Skills Object Oriented Design Java GUI development Microsoft Office See 3+     See less Software Engineering Python C++ Testing Linux Web Development JavaScript HTML5 Test Automation AngularJS jQuery Automation Team Leadership People Skills Object Oriented Design Java GUI development Microsoft Office See 3+     See less Software Engineering Python C++ Testing Linux Web Development JavaScript HTML5 Test Automation AngularJS jQuery Automation Team Leadership People Skills Object Oriented Design Java GUI development Microsoft Office See 3+     See less Education Wartburg College Bachelor's Degree,  Computer Science , Junior 2012  – 2016 Wartburg College is a small, liberal arts college in Waverly, Iowa. Here, I am pursuing my degree in Computer Science. Activities and Societies:  Symphonic Band ,  and private lessons for Alto Saxophone.\nWartburg Service trips. Linn-mar High School Wartburg College Bachelor's Degree,  Computer Science , Junior 2012  – 2016 Wartburg College is a small, liberal arts college in Waverly, Iowa. Here, I am pursuing my degree in Computer Science. Activities and Societies:  Symphonic Band ,  and private lessons for Alto Saxophone.\nWartburg Service trips. Wartburg College Bachelor's Degree,  Computer Science , Junior 2012  – 2016 Wartburg College is a small, liberal arts college in Waverly, Iowa. Here, I am pursuing my degree in Computer Science. Activities and Societies:  Symphonic Band ,  and private lessons for Alto Saxophone.\nWartburg Service trips. Wartburg College Bachelor's Degree,  Computer Science , Junior 2012  – 2016 Wartburg College is a small, liberal arts college in Waverly, Iowa. Here, I am pursuing my degree in Computer Science. Activities and Societies:  Symphonic Band ,  and private lessons for Alto Saxophone.\nWartburg Service trips. Linn-mar High School Linn-mar High School Linn-mar High School Honors & Awards ", "Experience Winter Analyst Goldman Sachs January 2015  –  January 2015  (1 month) Greater New York City Area Software Engineering Intern Intel Corporation June 2014  –  August 2014  (3 months) Hillsboro, Oregon Equity Technologies Intern Merrill Lynch January 2014  –  January 2014  (1 month) Greater New York City Area Software Engineering Intern Intel Corporation May 2013  –  August 2013  (4 months) Hillsboro, Oregon Area Undergraduate Researcher MIT Media Lab September 2012  –  February 2013  (6 months) MIT Media Lab Technology Intern TD Ameritrade June 2012  –  August 2012  (3 months) Jersey City, New Jersey Summer Intern The Cooper Union July 2011  –  August 2011  (2 months) Greater New York City Area Winter Analyst Goldman Sachs January 2015  –  January 2015  (1 month) Greater New York City Area Winter Analyst Goldman Sachs January 2015  –  January 2015  (1 month) Greater New York City Area Software Engineering Intern Intel Corporation June 2014  –  August 2014  (3 months) Hillsboro, Oregon Software Engineering Intern Intel Corporation June 2014  –  August 2014  (3 months) Hillsboro, Oregon Equity Technologies Intern Merrill Lynch January 2014  –  January 2014  (1 month) Greater New York City Area Equity Technologies Intern Merrill Lynch January 2014  –  January 2014  (1 month) Greater New York City Area Software Engineering Intern Intel Corporation May 2013  –  August 2013  (4 months) Hillsboro, Oregon Area Software Engineering Intern Intel Corporation May 2013  –  August 2013  (4 months) Hillsboro, Oregon Area Undergraduate Researcher MIT Media Lab September 2012  –  February 2013  (6 months) MIT Media Lab Undergraduate Researcher MIT Media Lab September 2012  –  February 2013  (6 months) MIT Media Lab Technology Intern TD Ameritrade June 2012  –  August 2012  (3 months) Jersey City, New Jersey Technology Intern TD Ameritrade June 2012  –  August 2012  (3 months) Jersey City, New Jersey Summer Intern The Cooper Union July 2011  –  August 2011  (2 months) Greater New York City Area Summer Intern The Cooper Union July 2011  –  August 2011  (2 months) Greater New York City Area Languages English Native or bilingual proficiency Burmese Limited working proficiency Russian Elementary proficiency English Native or bilingual proficiency Burmese Limited working proficiency Russian Elementary proficiency English Native or bilingual proficiency Burmese Limited working proficiency Russian Elementary proficiency Native or bilingual proficiency Limited working proficiency Elementary proficiency Skills Skills     Education MIT Candidate for a Bachelor of Science Degree 2012  – 2016 Staten Island Technical High School High School Diploma 2008  – 2012 MIT Candidate for a Bachelor of Science Degree 2012  – 2016 MIT Candidate for a Bachelor of Science Degree 2012  – 2016 MIT Candidate for a Bachelor of Science Degree 2012  – 2016 Staten Island Technical High School High School Diploma 2008  – 2012 Staten Island Technical High School High School Diploma 2008  – 2012 Staten Island Technical High School High School Diploma 2008  – 2012 Honors & Awards ", "Experience Software Engineer Internship Google June 2015  – Present (3 months) Mountain View, California Software Engineering Intern Intel Corporation January 2014  –  July 2014  (7 months) Software Engineering Intern Intel Corporation January 2013  –  May 2013  (5 months) Software Engineer Internship Google June 2015  – Present (3 months) Mountain View, California Software Engineer Internship Google June 2015  – Present (3 months) Mountain View, California Software Engineering Intern Intel Corporation January 2014  –  July 2014  (7 months) Software Engineering Intern Intel Corporation January 2014  –  July 2014  (7 months) Software Engineering Intern Intel Corporation January 2013  –  May 2013  (5 months) Software Engineering Intern Intel Corporation January 2013  –  May 2013  (5 months) Skills Software Engineering C++ C Algorithms Java Android Development LaTeX PHP Matlab Hadoop RakNet MATLAB Skills  Software Engineering C++ C Algorithms Java Android Development LaTeX PHP Matlab Hadoop RakNet MATLAB Software Engineering C++ C Algorithms Java Android Development LaTeX PHP Matlab Hadoop RakNet MATLAB Software Engineering C++ C Algorithms Java Android Development LaTeX PHP Matlab Hadoop RakNet MATLAB Education University of California, Los Angeles Master's Degree,  Computer Science 2014  – 2016 Shanghai Jiao Tong University Bachelor's degree,  Electrical and Computer Engineering 2010  – 2014 Zhenhai High School 2007  – 2010 University of California, Los Angeles Master's Degree,  Computer Science 2014  – 2016 University of California, Los Angeles Master's Degree,  Computer Science 2014  – 2016 University of California, Los Angeles Master's Degree,  Computer Science 2014  – 2016 Shanghai Jiao Tong University Bachelor's degree,  Electrical and Computer Engineering 2010  – 2014 Shanghai Jiao Tong University Bachelor's degree,  Electrical and Computer Engineering 2010  – 2014 Shanghai Jiao Tong University Bachelor's degree,  Electrical and Computer Engineering 2010  – 2014 Zhenhai High School 2007  – 2010 Zhenhai High School 2007  – 2010 Zhenhai High School 2007  – 2010 ", "Summary Experienced Software Developer in the realms of Visual Studio/C#/.Net development and Java/Eclipse. Strong and creative development skills utilizing Object-Oriented Design and other design methodologies. I graduated from ASU with a Bachelors in Computer Science, and enjoy Software Development. \n \nSpecialties: C#, Entity Framework, MVC, .Net, ASP, Visual Studio, Java, Eclipse, T-SQL, Hadoop Summary Experienced Software Developer in the realms of Visual Studio/C#/.Net development and Java/Eclipse. Strong and creative development skills utilizing Object-Oriented Design and other design methodologies. I graduated from ASU with a Bachelors in Computer Science, and enjoy Software Development. \n \nSpecialties: C#, Entity Framework, MVC, .Net, ASP, Visual Studio, Java, Eclipse, T-SQL, Hadoop Experienced Software Developer in the realms of Visual Studio/C#/.Net development and Java/Eclipse. Strong and creative development skills utilizing Object-Oriented Design and other design methodologies. I graduated from ASU with a Bachelors in Computer Science, and enjoy Software Development. \n \nSpecialties: C#, Entity Framework, MVC, .Net, ASP, Visual Studio, Java, Eclipse, T-SQL, Hadoop Experienced Software Developer in the realms of Visual Studio/C#/.Net development and Java/Eclipse. Strong and creative development skills utilizing Object-Oriented Design and other design methodologies. I graduated from ASU with a Bachelors in Computer Science, and enjoy Software Development. \n \nSpecialties: C#, Entity Framework, MVC, .Net, ASP, Visual Studio, Java, Eclipse, T-SQL, Hadoop Experience Software Engineer Intel Corporation January 2013  – Present (2 years 8 months) Software Engineering Intern Intel Corporation September 2012  –  January 2013  (5 months) Software Engineering Intern. Developing in Eclipse with Java and Hadoop libraries for Big Data applications. Software Engineering Intern Intel Corporation May 2012  –  September 2012  (5 months) Chandler, AZ Software Engineering Intern. Developing in Visual Studio with C#/.Net, ASP, MVC, Entity Framework, and T-SQL. Software Engineering Intern DDC-I January 2011  –  May 2012  (1 year 5 months) 4600 E. Shea Blvd. Software Engineering Intern for the OpenArbor IDE Project, based on the Eclipse IDE. This involves Eclipse Plugin development in Java using the Eclipse IDE. Also responsible for the testing system and testing of the software. Skill-sets developed include (Subversion, Java, SWT GUI, Linux, Eclipse, Eclipse Plugin, and Batch). Software Engineer Intel Corporation January 2013  – Present (2 years 8 months) Software Engineer Intel Corporation January 2013  – Present (2 years 8 months) Software Engineering Intern Intel Corporation September 2012  –  January 2013  (5 months) Software Engineering Intern. Developing in Eclipse with Java and Hadoop libraries for Big Data applications. Software Engineering Intern Intel Corporation September 2012  –  January 2013  (5 months) Software Engineering Intern. Developing in Eclipse with Java and Hadoop libraries for Big Data applications. Software Engineering Intern Intel Corporation May 2012  –  September 2012  (5 months) Chandler, AZ Software Engineering Intern. Developing in Visual Studio with C#/.Net, ASP, MVC, Entity Framework, and T-SQL. Software Engineering Intern Intel Corporation May 2012  –  September 2012  (5 months) Chandler, AZ Software Engineering Intern. Developing in Visual Studio with C#/.Net, ASP, MVC, Entity Framework, and T-SQL. Software Engineering Intern DDC-I January 2011  –  May 2012  (1 year 5 months) 4600 E. Shea Blvd. Software Engineering Intern for the OpenArbor IDE Project, based on the Eclipse IDE. This involves Eclipse Plugin development in Java using the Eclipse IDE. Also responsible for the testing system and testing of the software. Skill-sets developed include (Subversion, Java, SWT GUI, Linux, Eclipse, Eclipse Plugin, and Batch). Software Engineering Intern DDC-I January 2011  –  May 2012  (1 year 5 months) 4600 E. Shea Blvd. Software Engineering Intern for the OpenArbor IDE Project, based on the Eclipse IDE. This involves Eclipse Plugin development in Java using the Eclipse IDE. Also responsible for the testing system and testing of the software. Skill-sets developed include (Subversion, Java, SWT GUI, Linux, Eclipse, Eclipse Plugin, and Batch). Skills C# Visual Studio T-SQL Java JavaScript HTML 5 CSS Eclipse MVC ASP.NET .NET Hadoop XML Android iPhone Enterprise Software Mobile Applications Big Data Web Applications See 4+     See less Skills  C# Visual Studio T-SQL Java JavaScript HTML 5 CSS Eclipse MVC ASP.NET .NET Hadoop XML Android iPhone Enterprise Software Mobile Applications Big Data Web Applications See 4+     See less C# Visual Studio T-SQL Java JavaScript HTML 5 CSS Eclipse MVC ASP.NET .NET Hadoop XML Android iPhone Enterprise Software Mobile Applications Big Data Web Applications See 4+     See less C# Visual Studio T-SQL Java JavaScript HTML 5 CSS Eclipse MVC ASP.NET .NET Hadoop XML Android iPhone Enterprise Software Mobile Applications Big Data Web Applications See 4+     See less Education Arizona State University Bachelors of Computer Science,  Computer Science (Software Engineering) 2010  – 2012 Activities and Societies:  Undergraduate Research in Affective Computing (Human Computer Interaction) ,  S.O.D.A (Software Developers Association) ,  5th place in AVNET Tech Games Android App Challenge Glendale Community College Associates of Science,  Computer Science 2008  – 2010 Activities and Societies:  1st place in AVNET Tech Games Digital Design Competition ,  S.T.E.M. (Science Technology Engineering and Mathematics) Club ,  Phi Theta Kappa Honors Society ,  President's List Arizona State University Bachelors of Computer Science,  Computer Science (Software Engineering) 2010  – 2012 Activities and Societies:  Undergraduate Research in Affective Computing (Human Computer Interaction) ,  S.O.D.A (Software Developers Association) ,  5th place in AVNET Tech Games Android App Challenge Arizona State University Bachelors of Computer Science,  Computer Science (Software Engineering) 2010  – 2012 Activities and Societies:  Undergraduate Research in Affective Computing (Human Computer Interaction) ,  S.O.D.A (Software Developers Association) ,  5th place in AVNET Tech Games Android App Challenge Arizona State University Bachelors of Computer Science,  Computer Science (Software Engineering) 2010  – 2012 Activities and Societies:  Undergraduate Research in Affective Computing (Human Computer Interaction) ,  S.O.D.A (Software Developers Association) ,  5th place in AVNET Tech Games Android App Challenge Glendale Community College Associates of Science,  Computer Science 2008  – 2010 Activities and Societies:  1st place in AVNET Tech Games Digital Design Competition ,  S.T.E.M. (Science Technology Engineering and Mathematics) Club ,  Phi Theta Kappa Honors Society ,  President's List Glendale Community College Associates of Science,  Computer Science 2008  – 2010 Activities and Societies:  1st place in AVNET Tech Games Digital Design Competition ,  S.T.E.M. (Science Technology Engineering and Mathematics) Club ,  Phi Theta Kappa Honors Society ,  President's List Glendale Community College Associates of Science,  Computer Science 2008  – 2010 Activities and Societies:  1st place in AVNET Tech Games Digital Design Competition ,  S.T.E.M. (Science Technology Engineering and Mathematics) Club ,  Phi Theta Kappa Honors Society ,  President's List Honors & Awards Additional Honors & Awards • Top 5 participant AVNET Android App Challenge (2011) \n• Winner of the 2010 AVNET Tech Games – Digital Design Challenge (2010) \n• Member of Mensa Additional Honors & Awards • Top 5 participant AVNET Android App Challenge (2011) \n• Winner of the 2010 AVNET Tech Games – Digital Design Challenge (2010) \n• Member of Mensa Additional Honors & Awards • Top 5 participant AVNET Android App Challenge (2011) \n• Winner of the 2010 AVNET Tech Games – Digital Design Challenge (2010) \n• Member of Mensa Additional Honors & Awards • Top 5 participant AVNET Android App Challenge (2011) \n• Winner of the 2010 AVNET Tech Games – Digital Design Challenge (2010) \n• Member of Mensa ", "Experience Software Engineer Intel Corporation June 2014  – Present (1 year 3 months) Santa Clara Software Engineer Intel Corporation June 2014  – Present (1 year 3 months) Santa Clara Software Engineer Intel Corporation June 2014  – Present (1 year 3 months) Santa Clara Languages   Skills Skills     Education University of Southern California Master of Science (MS) 2012  – 2014 P. E. S. Institute of Technology Bachelor of Engineering 2004  – 2008 University of Southern California Master of Science (MS) 2012  – 2014 University of Southern California Master of Science (MS) 2012  – 2014 University of Southern California Master of Science (MS) 2012  – 2014 P. E. S. Institute of Technology Bachelor of Engineering 2004  – 2008 P. E. S. Institute of Technology Bachelor of Engineering 2004  – 2008 P. E. S. Institute of Technology Bachelor of Engineering 2004  – 2008 ", "Summary Strong skills to Ensure effective SQA practices implementation across the organization and Identify key process improvement opportunities for supported business groups \nExperienced with QA processes and tools, test management systems, QA automation, analyzing bug trends and indicators, Root Cause Analysis, Code reviews etc. Summary Strong skills to Ensure effective SQA practices implementation across the organization and Identify key process improvement opportunities for supported business groups \nExperienced with QA processes and tools, test management systems, QA automation, analyzing bug trends and indicators, Root Cause Analysis, Code reviews etc. Strong skills to Ensure effective SQA practices implementation across the organization and Identify key process improvement opportunities for supported business groups \nExperienced with QA processes and tools, test management systems, QA automation, analyzing bug trends and indicators, Root Cause Analysis, Code reviews etc. Strong skills to Ensure effective SQA practices implementation across the organization and Identify key process improvement opportunities for supported business groups \nExperienced with QA processes and tools, test management systems, QA automation, analyzing bug trends and indicators, Root Cause Analysis, Code reviews etc. Experience Software Quality Lead / Quality Analyst Intel Corporation September 2011  – Present (4 years) Santa Clara, CA Guest Speaker Various conferences/events February 2012  – Present (3 years 7 months) Software Engineering Intern Intel Corporation January 2011  –  August 2011  (8 months) Hillsboro, OR Software Engineering Intern Bloom Energy October 2010  –  December 2010  (3 months) Software Engineering Intern Intel Corporation June 2010  –  August 2010  (3 months) Software Developer Infotrack systems (P) Ltd. January 2009  –  May 2009  (5 months) India Software Quality Lead / Quality Analyst Intel Corporation September 2011  – Present (4 years) Santa Clara, CA Software Quality Lead / Quality Analyst Intel Corporation September 2011  – Present (4 years) Santa Clara, CA Guest Speaker Various conferences/events February 2012  – Present (3 years 7 months) Guest Speaker Various conferences/events February 2012  – Present (3 years 7 months) Software Engineering Intern Intel Corporation January 2011  –  August 2011  (8 months) Hillsboro, OR Software Engineering Intern Intel Corporation January 2011  –  August 2011  (8 months) Hillsboro, OR Software Engineering Intern Bloom Energy October 2010  –  December 2010  (3 months) Software Engineering Intern Bloom Energy October 2010  –  December 2010  (3 months) Software Engineering Intern Intel Corporation June 2010  –  August 2010  (3 months) Software Engineering Intern Intel Corporation June 2010  –  August 2010  (3 months) Software Developer Infotrack systems (P) Ltd. January 2009  –  May 2009  (5 months) India Software Developer Infotrack systems (P) Ltd. January 2009  –  May 2009  (5 months) India Languages French French French Skills XML Java Python SQL MySQL SOAP Perl Data Mining Spring HTML Software Quality... Test Automation Perl Script Statistical Data... Intel Tableau Business Intelligence... Hadoop Teradata Big Data Big Data Synthesis Spotfire JMP Atlassian JIRA Klocwork Coverity Root Cause Analysis SharePoint Risk Assessment Software Requirements Software Planning Testing Software Engineering Android Databases See 20+     See less Skills  XML Java Python SQL MySQL SOAP Perl Data Mining Spring HTML Software Quality... Test Automation Perl Script Statistical Data... Intel Tableau Business Intelligence... Hadoop Teradata Big Data Big Data Synthesis Spotfire JMP Atlassian JIRA Klocwork Coverity Root Cause Analysis SharePoint Risk Assessment Software Requirements Software Planning Testing Software Engineering Android Databases See 20+     See less XML Java Python SQL MySQL SOAP Perl Data Mining Spring HTML Software Quality... Test Automation Perl Script Statistical Data... Intel Tableau Business Intelligence... Hadoop Teradata Big Data Big Data Synthesis Spotfire JMP Atlassian JIRA Klocwork Coverity Root Cause Analysis SharePoint Risk Assessment Software Requirements Software Planning Testing Software Engineering Android Databases See 20+     See less XML Java Python SQL MySQL SOAP Perl Data Mining Spring HTML Software Quality... Test Automation Perl Script Statistical Data... Intel Tableau Business Intelligence... Hadoop Teradata Big Data Big Data Synthesis Spotfire JMP Atlassian JIRA Klocwork Coverity Root Cause Analysis SharePoint Risk Assessment Software Requirements Software Planning Testing Software Engineering Android Databases See 20+     See less Education San Jose State University MS 2009  – 2011 Nirma University B.tech 2005  – 2009 San Jose State University MS 2009  – 2011 San Jose State University MS 2009  – 2011 San Jose State University MS 2009  – 2011 Nirma University B.tech 2005  – 2009 Nirma University B.tech 2005  – 2009 Nirma University B.tech 2005  – 2009 ", "Summary I am a computer engineer and computer scientist looking for an exciting career in industry-leading technologies. I have special interests in parallel computing and high-speed networking. Summary I am a computer engineer and computer scientist looking for an exciting career in industry-leading technologies. I have special interests in parallel computing and high-speed networking. I am a computer engineer and computer scientist looking for an exciting career in industry-leading technologies. I have special interests in parallel computing and high-speed networking. I am a computer engineer and computer scientist looking for an exciting career in industry-leading technologies. I have special interests in parallel computing and high-speed networking. Experience Computer and Software Engineering Intern Intel Corporation August 2014  – Present (1 year 1 month) Santa Clara, California Collect usability metrics and component information for tablet devices, and use this information to generate component suggestions for future tablet designs. \nWork with multiple teams on several testing and implementation projects. Software Engineer New Classic Home Furnishings April 2014  –  August 2014  (5 months) Fontana, California Handle the design, development, integration, and deployment of software systems and associated systems including database architecture, application design, and interface design. Analyze and optimize currently implemented software systems to improve scalability and reliability. Promote best practices in software design to improve quality and enable software autonomy, diminishing third party reliance within the company. Graduate Assistant California State University San Bernardino April 2014  –  June 2014  (3 months) Computer Science and Engineering Supervised and assisted bachelor level students in an advanced computer architecture class. Read reports and assisted in determining their comprehension of the material. Process Control Engineer Intern California Steel Industries July 2012  –  June 2014  (2 years) Fontana, California Software Engineering, Web Design, Web Programming, Software Design, Systems Administration, Database Administration Engineering Intern Optivus Technology September 2012  –  June 2013  (10 months) San Bernardino, Ca Small group dynamic working to develop testing systems for medical treatment systems. Involves hardware, schematic, and printed circuit board design and layout. Computer and Software Engineering Intern Intel Corporation August 2014  – Present (1 year 1 month) Santa Clara, California Collect usability metrics and component information for tablet devices, and use this information to generate component suggestions for future tablet designs. \nWork with multiple teams on several testing and implementation projects. Computer and Software Engineering Intern Intel Corporation August 2014  – Present (1 year 1 month) Santa Clara, California Collect usability metrics and component information for tablet devices, and use this information to generate component suggestions for future tablet designs. \nWork with multiple teams on several testing and implementation projects. Software Engineer New Classic Home Furnishings April 2014  –  August 2014  (5 months) Fontana, California Handle the design, development, integration, and deployment of software systems and associated systems including database architecture, application design, and interface design. Analyze and optimize currently implemented software systems to improve scalability and reliability. Promote best practices in software design to improve quality and enable software autonomy, diminishing third party reliance within the company. Software Engineer New Classic Home Furnishings April 2014  –  August 2014  (5 months) Fontana, California Handle the design, development, integration, and deployment of software systems and associated systems including database architecture, application design, and interface design. Analyze and optimize currently implemented software systems to improve scalability and reliability. Promote best practices in software design to improve quality and enable software autonomy, diminishing third party reliance within the company. Graduate Assistant California State University San Bernardino April 2014  –  June 2014  (3 months) Computer Science and Engineering Supervised and assisted bachelor level students in an advanced computer architecture class. Read reports and assisted in determining their comprehension of the material. Graduate Assistant California State University San Bernardino April 2014  –  June 2014  (3 months) Computer Science and Engineering Supervised and assisted bachelor level students in an advanced computer architecture class. Read reports and assisted in determining their comprehension of the material. Process Control Engineer Intern California Steel Industries July 2012  –  June 2014  (2 years) Fontana, California Software Engineering, Web Design, Web Programming, Software Design, Systems Administration, Database Administration Process Control Engineer Intern California Steel Industries July 2012  –  June 2014  (2 years) Fontana, California Software Engineering, Web Design, Web Programming, Software Design, Systems Administration, Database Administration Engineering Intern Optivus Technology September 2012  –  June 2013  (10 months) San Bernardino, Ca Small group dynamic working to develop testing systems for medical treatment systems. Involves hardware, schematic, and printed circuit board design and layout. Engineering Intern Optivus Technology September 2012  –  June 2013  (10 months) San Bernardino, Ca Small group dynamic working to develop testing systems for medical treatment systems. Involves hardware, schematic, and printed circuit board design and layout. Languages English Native or bilingual proficiency Spanish Limited working proficiency English Native or bilingual proficiency Spanish Limited working proficiency English Native or bilingual proficiency Spanish Limited working proficiency Native or bilingual proficiency Limited working proficiency Skills Software Engineering Operating Systems Programming Testing C++ Java Computer Science Eclipse Python C# JavaScript PHP HTML Visual Studio Matlab Unix Linux SQL Visual Basic Databases MySQL Software Project... C Web Development .NET R Git Flex Object Oriented Design Software Design OOP Android UML Agile Methodologies Database Design Programming Languages AJAX Software Development System Architecture Formal Languages Algorithms CSS Verilog LaTeX Swift See 30+     See less Skills  Software Engineering Operating Systems Programming Testing C++ Java Computer Science Eclipse Python C# JavaScript PHP HTML Visual Studio Matlab Unix Linux SQL Visual Basic Databases MySQL Software Project... C Web Development .NET R Git Flex Object Oriented Design Software Design OOP Android UML Agile Methodologies Database Design Programming Languages AJAX Software Development System Architecture Formal Languages Algorithms CSS Verilog LaTeX Swift See 30+     See less Software Engineering Operating Systems Programming Testing C++ Java Computer Science Eclipse Python C# JavaScript PHP HTML Visual Studio Matlab Unix Linux SQL Visual Basic Databases MySQL Software Project... C Web Development .NET R Git Flex Object Oriented Design Software Design OOP Android UML Agile Methodologies Database Design Programming Languages AJAX Software Development System Architecture Formal Languages Algorithms CSS Verilog LaTeX Swift See 30+     See less Software Engineering Operating Systems Programming Testing C++ Java Computer Science Eclipse Python C# JavaScript PHP HTML Visual Studio Matlab Unix Linux SQL Visual Basic Databases MySQL Software Project... C Web Development .NET R Git Flex Object Oriented Design Software Design OOP Android UML Agile Methodologies Database Design Programming Languages AJAX Software Development System Architecture Formal Languages Algorithms CSS Verilog LaTeX Swift See 30+     See less Education San Jose State University Master's Degree,  Computer Science , 3.75 2014  – 2017 Worked with projects in statistical/machine learning and symbolic-learning automata. California State University-San Bernardino Bachelor of Science (BS),  Computer Engineering , 3.2 2010  – 2014 Obtained a double major in Computer Science and Computer Engineering. Activities and Societies:  Computer Science Club ,  IEEE Club California State University-San Bernardino Bachelor of Science (BS),  Computer Science , 3.3 2010  – 2014 Worked on projects relating to compiler design and emulation. Activities and Societies:  Association for Computing Machinery Student Chapter Victor Valley College Associates of Science,  Natural Sciences , 3.2 2008  – 2010 San Jose State University Master's Degree,  Computer Science , 3.75 2014  – 2017 Worked with projects in statistical/machine learning and symbolic-learning automata. San Jose State University Master's Degree,  Computer Science , 3.75 2014  – 2017 Worked with projects in statistical/machine learning and symbolic-learning automata. San Jose State University Master's Degree,  Computer Science , 3.75 2014  – 2017 Worked with projects in statistical/machine learning and symbolic-learning automata. California State University-San Bernardino Bachelor of Science (BS),  Computer Engineering , 3.2 2010  – 2014 Obtained a double major in Computer Science and Computer Engineering. Activities and Societies:  Computer Science Club ,  IEEE Club California State University-San Bernardino Bachelor of Science (BS),  Computer Engineering , 3.2 2010  – 2014 Obtained a double major in Computer Science and Computer Engineering. Activities and Societies:  Computer Science Club ,  IEEE Club California State University-San Bernardino Bachelor of Science (BS),  Computer Engineering , 3.2 2010  – 2014 Obtained a double major in Computer Science and Computer Engineering. Activities and Societies:  Computer Science Club ,  IEEE Club California State University-San Bernardino Bachelor of Science (BS),  Computer Science , 3.3 2010  – 2014 Worked on projects relating to compiler design and emulation. Activities and Societies:  Association for Computing Machinery Student Chapter California State University-San Bernardino Bachelor of Science (BS),  Computer Science , 3.3 2010  – 2014 Worked on projects relating to compiler design and emulation. Activities and Societies:  Association for Computing Machinery Student Chapter California State University-San Bernardino Bachelor of Science (BS),  Computer Science , 3.3 2010  – 2014 Worked on projects relating to compiler design and emulation. Activities and Societies:  Association for Computing Machinery Student Chapter Victor Valley College Associates of Science,  Natural Sciences , 3.2 2008  – 2010 Victor Valley College Associates of Science,  Natural Sciences , 3.2 2008  – 2010 Victor Valley College Associates of Science,  Natural Sciences , 3.2 2008  – 2010 Honors & Awards Second Place Winner - Yahoo! Hackathon @ SJSU Yahoo! February 2015 I provided the solution concept, system architecture and design, and direction to the team. I also implemented the online density-based spatial clustering algorithm used in the design to group similar records. Additional Honors & Awards Dean's List California State University of San Bernardino Second Place Winner - Yahoo! Hackathon @ SJSU Yahoo! February 2015 I provided the solution concept, system architecture and design, and direction to the team. I also implemented the online density-based spatial clustering algorithm used in the design to group similar records. Second Place Winner - Yahoo! Hackathon @ SJSU Yahoo! February 2015 I provided the solution concept, system architecture and design, and direction to the team. I also implemented the online density-based spatial clustering algorithm used in the design to group similar records. Second Place Winner - Yahoo! Hackathon @ SJSU Yahoo! February 2015 I provided the solution concept, system architecture and design, and direction to the team. I also implemented the online density-based spatial clustering algorithm used in the design to group similar records. Additional Honors & Awards Dean's List California State University of San Bernardino Additional Honors & Awards Dean's List California State University of San Bernardino Additional Honors & Awards Dean's List California State University of San Bernardino ", "Experience Software Engineering Intern Intel Corporation June 2015  –  August 2015  (3 months) Phoenix, Arizona Area Senior Software Engineer Samsung R&D Institute Delhi July 2012  –  August 2014  (2 years 2 months) Noida Area, India Software Development Engineer (Android Application development, Android Multimedia Framework, Windows Programming) \nRoles and Responsibilities: \n1. Development.  \n2. Analysis/Debugging/Maintenance. \n3. Design and Development of new modules in Android. \n4. Collaboration with Testing team to ensure system performance. \n5. Providing training on Android optimization techniques. \n6. Participated in Samsung Best Paper Contest and published research paper in Breast Cancer Diagnosis using Modular Neural Network. SME (Subject Matter Expert) Amdocs July 2011  –  July 2012  (1 year 1 month) Pune Area, India Enhancements in the billing application: \n1. Wrote shell scripts for batch jobs to process billing files. \n2. Implemented new EJBs (Enterprise Java Beans) in J2EE architecture and deployed them on application servers. \n3. Developed UI Screen’s as per the client requirement. \n4. Understanding the functional requirement and involved in Detailed Design Preparation \n5. Analyzing and developing new change request while maintaining the existing functionality. \nSkill set: J2SE, J2EE (EJB, Servlets ,JSP, MVC) , Oracle 9i , Linux , Weblogic v9.2 , TOAD Intern Samsung Software Engineering Lab January 2011  –  July 2011  (7 months) Noida Area, India Android application development. \n1. Mobile Shaker: A number of options were given to the user which he could use by shaking the phone in \nany particular direction during a call or while playing music player. \n2. Unit Converter: Uploaded on Samsung app store. Software Engineering Intern Intel Corporation June 2015  –  August 2015  (3 months) Phoenix, Arizona Area Software Engineering Intern Intel Corporation June 2015  –  August 2015  (3 months) Phoenix, Arizona Area Senior Software Engineer Samsung R&D Institute Delhi July 2012  –  August 2014  (2 years 2 months) Noida Area, India Software Development Engineer (Android Application development, Android Multimedia Framework, Windows Programming) \nRoles and Responsibilities: \n1. Development.  \n2. Analysis/Debugging/Maintenance. \n3. Design and Development of new modules in Android. \n4. Collaboration with Testing team to ensure system performance. \n5. Providing training on Android optimization techniques. \n6. Participated in Samsung Best Paper Contest and published research paper in Breast Cancer Diagnosis using Modular Neural Network. Senior Software Engineer Samsung R&D Institute Delhi July 2012  –  August 2014  (2 years 2 months) Noida Area, India Software Development Engineer (Android Application development, Android Multimedia Framework, Windows Programming) \nRoles and Responsibilities: \n1. Development.  \n2. Analysis/Debugging/Maintenance. \n3. Design and Development of new modules in Android. \n4. Collaboration with Testing team to ensure system performance. \n5. Providing training on Android optimization techniques. \n6. Participated in Samsung Best Paper Contest and published research paper in Breast Cancer Diagnosis using Modular Neural Network. SME (Subject Matter Expert) Amdocs July 2011  –  July 2012  (1 year 1 month) Pune Area, India Enhancements in the billing application: \n1. Wrote shell scripts for batch jobs to process billing files. \n2. Implemented new EJBs (Enterprise Java Beans) in J2EE architecture and deployed them on application servers. \n3. Developed UI Screen’s as per the client requirement. \n4. Understanding the functional requirement and involved in Detailed Design Preparation \n5. Analyzing and developing new change request while maintaining the existing functionality. \nSkill set: J2SE, J2EE (EJB, Servlets ,JSP, MVC) , Oracle 9i , Linux , Weblogic v9.2 , TOAD SME (Subject Matter Expert) Amdocs July 2011  –  July 2012  (1 year 1 month) Pune Area, India Enhancements in the billing application: \n1. Wrote shell scripts for batch jobs to process billing files. \n2. Implemented new EJBs (Enterprise Java Beans) in J2EE architecture and deployed them on application servers. \n3. Developed UI Screen’s as per the client requirement. \n4. Understanding the functional requirement and involved in Detailed Design Preparation \n5. Analyzing and developing new change request while maintaining the existing functionality. \nSkill set: J2SE, J2EE (EJB, Servlets ,JSP, MVC) , Oracle 9i , Linux , Weblogic v9.2 , TOAD Intern Samsung Software Engineering Lab January 2011  –  July 2011  (7 months) Noida Area, India Android application development. \n1. Mobile Shaker: A number of options were given to the user which he could use by shaking the phone in \nany particular direction during a call or while playing music player. \n2. Unit Converter: Uploaded on Samsung app store. Intern Samsung Software Engineering Lab January 2011  –  July 2011  (7 months) Noida Area, India Android application development. \n1. Mobile Shaker: A number of options were given to the user which he could use by shaking the phone in \nany particular direction during a call or while playing music player. \n2. Unit Converter: Uploaded on Samsung app store. Languages   Skills C BMC Remedy JSP Servlets EJB Weblogic Oracle Linux JavaSE MVC Android Development Java SQL Unix Core Java C++ J2EE Web Services MFC Unix Shell Scripting Eclipse Shell Scripting Python See 7+     See less Skills  C BMC Remedy JSP Servlets EJB Weblogic Oracle Linux JavaSE MVC Android Development Java SQL Unix Core Java C++ J2EE Web Services MFC Unix Shell Scripting Eclipse Shell Scripting Python See 7+     See less C BMC Remedy JSP Servlets EJB Weblogic Oracle Linux JavaSE MVC Android Development Java SQL Unix Core Java C++ J2EE Web Services MFC Unix Shell Scripting Eclipse Shell Scripting Python See 7+     See less C BMC Remedy JSP Servlets EJB Weblogic Oracle Linux JavaSE MVC Android Development Java SQL Unix Core Java C++ J2EE Web Services MFC Unix Shell Scripting Eclipse Shell Scripting Python See 7+     See less Education Stony Brook University Master's Degree,  Computer Science , 3.83/4 2014  – 2015 Thapar Institute of Engineering and Technology Bachelor of Technology (BTech),  Computer Science , 9.13/10 2007  – 2011 Stony Brook University Master's Degree,  Computer Science , 3.83/4 2014  – 2015 Stony Brook University Master's Degree,  Computer Science , 3.83/4 2014  – 2015 Stony Brook University Master's Degree,  Computer Science , 3.83/4 2014  – 2015 Thapar Institute of Engineering and Technology Bachelor of Technology (BTech),  Computer Science , 9.13/10 2007  – 2011 Thapar Institute of Engineering and Technology Bachelor of Technology (BTech),  Computer Science , 9.13/10 2007  – 2011 Thapar Institute of Engineering and Technology Bachelor of Technology (BTech),  Computer Science , 9.13/10 2007  – 2011 Honors & Awards National Talent Search Examination scholar Government of India October 2005 National Talent Search Examination (NTSE) is a national-level scholarship program in India to identify and recognize students with high intellect and academic talent. It is one of the most prestigious exams in India. Close to 300,000 students (a largely self selective group of students) appear in this scholarship exam every year, and 1,000 scholarships are awarded, out of which 775 are not reserved. \n(Source: Wikipedia) National Talent Search Examination scholar Government of India October 2005 National Talent Search Examination (NTSE) is a national-level scholarship program in India to identify and recognize students with high intellect and academic talent. It is one of the most prestigious exams in India. Close to 300,000 students (a largely self selective group of students) appear in this scholarship exam every year, and 1,000 scholarships are awarded, out of which 775 are not reserved. \n(Source: Wikipedia) National Talent Search Examination scholar Government of India October 2005 National Talent Search Examination (NTSE) is a national-level scholarship program in India to identify and recognize students with high intellect and academic talent. It is one of the most prestigious exams in India. Close to 300,000 students (a largely self selective group of students) appear in this scholarship exam every year, and 1,000 scholarships are awarded, out of which 775 are not reserved. \n(Source: Wikipedia) National Talent Search Examination scholar Government of India October 2005 National Talent Search Examination (NTSE) is a national-level scholarship program in India to identify and recognize students with high intellect and academic talent. It is one of the most prestigious exams in India. Close to 300,000 students (a largely self selective group of students) appear in this scholarship exam every year, and 1,000 scholarships are awarded, out of which 775 are not reserved. \n(Source: Wikipedia) ", "Experience Software Engineering Intern Intel Corporation May 2015  – Present (4 months) Phoenix, Arizona Area - Implemented a new web-system for version/approval control of different files/packages across various teams. \n- Responsible for requirements specification, UI design, DB schema, architecture and code implementation. \n- Designed application in MVVM pattern, and also worked on modules for mail-server, TFS-server, WCF-services. \n Web Developer University of Southern California January 2015  – Present (8 months) The Financial Aid Office - Responsible for development of backend/frontend of web-systems using ASP.NET and HTML/CSS/jQuery/JavaScript. \n- Responsible for complete development of site including front-end, back-end, database-design and deployment for the commencement site - https://camel2.usc.edu/CommBook/ Software Development Engineer Optym November 2013  –  July 2014  (9 months) Bangalore Optym leverages the use of operations research, algorithms, large scale optimization and simulation to provide advanced analytical solutions in the fields of transportation and logistics.  \n \nAs part of the software development team, I was responsible for developing efficient and responsive software solutions to complex decision problems for different industries. I was also in the hiring team responsible for taking interviews/tests for software developer, database developer and analyst positions. Developer Intern Kuliza Technologies July 2013  –  October 2013  (4 months) Bangalore As a part of the product development team, I was involved in the development of social web-apps on Django platform, from requirements definition to successful deployment. Also, I worked on one of company’s primary products - Evoke, a complete suite and management system of referral applications, and a project on a cloud based project management system for Upland Software. Research Intern Depatment of Computer Science and Engineering, I.I.T. Delhi May 2012  –  July 2012  (3 months) IIT Delhi, Hauz Khas, New Delhi The software developed was an SVM Solver which had options to choose among the various feature selection methods in order to solve problems with large scale data. An independent Localized Linear SVM solver was also implemented that used clustering as a pre-processing step. The program was later expanded to have multiple kernel options, and then an approximation of the RBF kernel was added, using Random Fourier Features. Final results were reported in terms of classification accuracy and training time. \n \nProject Guide - Prof. K. K. Biswas Software Engineering Intern Intel Corporation May 2015  – Present (4 months) Phoenix, Arizona Area - Implemented a new web-system for version/approval control of different files/packages across various teams. \n- Responsible for requirements specification, UI design, DB schema, architecture and code implementation. \n- Designed application in MVVM pattern, and also worked on modules for mail-server, TFS-server, WCF-services. \n Software Engineering Intern Intel Corporation May 2015  – Present (4 months) Phoenix, Arizona Area - Implemented a new web-system for version/approval control of different files/packages across various teams. \n- Responsible for requirements specification, UI design, DB schema, architecture and code implementation. \n- Designed application in MVVM pattern, and also worked on modules for mail-server, TFS-server, WCF-services. \n Web Developer University of Southern California January 2015  – Present (8 months) The Financial Aid Office - Responsible for development of backend/frontend of web-systems using ASP.NET and HTML/CSS/jQuery/JavaScript. \n- Responsible for complete development of site including front-end, back-end, database-design and deployment for the commencement site - https://camel2.usc.edu/CommBook/ Web Developer University of Southern California January 2015  – Present (8 months) The Financial Aid Office - Responsible for development of backend/frontend of web-systems using ASP.NET and HTML/CSS/jQuery/JavaScript. \n- Responsible for complete development of site including front-end, back-end, database-design and deployment for the commencement site - https://camel2.usc.edu/CommBook/ Software Development Engineer Optym November 2013  –  July 2014  (9 months) Bangalore Optym leverages the use of operations research, algorithms, large scale optimization and simulation to provide advanced analytical solutions in the fields of transportation and logistics.  \n \nAs part of the software development team, I was responsible for developing efficient and responsive software solutions to complex decision problems for different industries. I was also in the hiring team responsible for taking interviews/tests for software developer, database developer and analyst positions. Software Development Engineer Optym November 2013  –  July 2014  (9 months) Bangalore Optym leverages the use of operations research, algorithms, large scale optimization and simulation to provide advanced analytical solutions in the fields of transportation and logistics.  \n \nAs part of the software development team, I was responsible for developing efficient and responsive software solutions to complex decision problems for different industries. I was also in the hiring team responsible for taking interviews/tests for software developer, database developer and analyst positions. Developer Intern Kuliza Technologies July 2013  –  October 2013  (4 months) Bangalore As a part of the product development team, I was involved in the development of social web-apps on Django platform, from requirements definition to successful deployment. Also, I worked on one of company’s primary products - Evoke, a complete suite and management system of referral applications, and a project on a cloud based project management system for Upland Software. Developer Intern Kuliza Technologies July 2013  –  October 2013  (4 months) Bangalore As a part of the product development team, I was involved in the development of social web-apps on Django platform, from requirements definition to successful deployment. Also, I worked on one of company’s primary products - Evoke, a complete suite and management system of referral applications, and a project on a cloud based project management system for Upland Software. Research Intern Depatment of Computer Science and Engineering, I.I.T. Delhi May 2012  –  July 2012  (3 months) IIT Delhi, Hauz Khas, New Delhi The software developed was an SVM Solver which had options to choose among the various feature selection methods in order to solve problems with large scale data. An independent Localized Linear SVM solver was also implemented that used clustering as a pre-processing step. The program was later expanded to have multiple kernel options, and then an approximation of the RBF kernel was added, using Random Fourier Features. Final results were reported in terms of classification accuracy and training time. \n \nProject Guide - Prof. K. K. Biswas Research Intern Depatment of Computer Science and Engineering, I.I.T. Delhi May 2012  –  July 2012  (3 months) IIT Delhi, Hauz Khas, New Delhi The software developed was an SVM Solver which had options to choose among the various feature selection methods in order to solve problems with large scale data. An independent Localized Linear SVM solver was also implemented that used clustering as a pre-processing step. The program was later expanded to have multiple kernel options, and then an approximation of the RBF kernel was added, using Random Fourier Features. Final results were reported in terms of classification accuracy and training time. \n \nProject Guide - Prof. K. K. Biswas Languages English Hindi English Hindi English Hindi Skills Algorithms C++ C Python Computer Science Data Structures Java Machine Learning OOP Django Software Engineering JavaScript PHP AJAX SQL Linux Algorithm Design Robotics OpenGL C/C++ STL Subversion jQuery Boost C++ Git C# HTML 5 CSS3 XML Schema XQuery See 14+     See less Skills  Algorithms C++ C Python Computer Science Data Structures Java Machine Learning OOP Django Software Engineering JavaScript PHP AJAX SQL Linux Algorithm Design Robotics OpenGL C/C++ STL Subversion jQuery Boost C++ Git C# HTML 5 CSS3 XML Schema XQuery See 14+     See less Algorithms C++ C Python Computer Science Data Structures Java Machine Learning OOP Django Software Engineering JavaScript PHP AJAX SQL Linux Algorithm Design Robotics OpenGL C/C++ STL Subversion jQuery Boost C++ Git C# HTML 5 CSS3 XML Schema XQuery See 14+     See less Algorithms C++ C Python Computer Science Data Structures Java Machine Learning OOP Django Software Engineering JavaScript PHP AJAX SQL Linux Algorithm Design Robotics OpenGL C/C++ STL Subversion jQuery Boost C++ Git C# HTML 5 CSS3 XML Schema XQuery See 14+     See less Education University of Southern California Master's Degree,  Computer Science (Data Science) , 3.76/4 2014  – 2015 Activities and Societies:  USC Marathon Team Jaypee Institute of Information Technology Bachelor of Technology (B.Tech.),  Computer Science and Engineering , 8.5/10 2009  – 2013 Student Coordinator and Cofounder. Activities and Societies:  JIIT Programming Hub St. Peter's College, Agra Senior Secondary Examination,  Mathematics and Computer Science 2006  – 2008 Passed with 90.75% (with 99% in Computer Science and 95% in Mathematics) Activities and Societies:  Captain of College Programming Team ,  Member of College Science Quiz Team ,  Captain of Tug of War Team ,  Member of Volleyball Team St. Joseph's Inter College, Gorakhpur High School Examination (Grade X),  Science with Computer Applications 1994  – 2006 Passed with 94% in Computer Applications Activities and Societies:  Member of Badminton and Quiz Team University of Southern California Master's Degree,  Computer Science (Data Science) , 3.76/4 2014  – 2015 Activities and Societies:  USC Marathon Team University of Southern California Master's Degree,  Computer Science (Data Science) , 3.76/4 2014  – 2015 Activities and Societies:  USC Marathon Team University of Southern California Master's Degree,  Computer Science (Data Science) , 3.76/4 2014  – 2015 Activities and Societies:  USC Marathon Team Jaypee Institute of Information Technology Bachelor of Technology (B.Tech.),  Computer Science and Engineering , 8.5/10 2009  – 2013 Student Coordinator and Cofounder. Activities and Societies:  JIIT Programming Hub Jaypee Institute of Information Technology Bachelor of Technology (B.Tech.),  Computer Science and Engineering , 8.5/10 2009  – 2013 Student Coordinator and Cofounder. Activities and Societies:  JIIT Programming Hub Jaypee Institute of Information Technology Bachelor of Technology (B.Tech.),  Computer Science and Engineering , 8.5/10 2009  – 2013 Student Coordinator and Cofounder. Activities and Societies:  JIIT Programming Hub St. Peter's College, Agra Senior Secondary Examination,  Mathematics and Computer Science 2006  – 2008 Passed with 90.75% (with 99% in Computer Science and 95% in Mathematics) Activities and Societies:  Captain of College Programming Team ,  Member of College Science Quiz Team ,  Captain of Tug of War Team ,  Member of Volleyball Team St. Peter's College, Agra Senior Secondary Examination,  Mathematics and Computer Science 2006  – 2008 Passed with 90.75% (with 99% in Computer Science and 95% in Mathematics) Activities and Societies:  Captain of College Programming Team ,  Member of College Science Quiz Team ,  Captain of Tug of War Team ,  Member of Volleyball Team St. Peter's College, Agra Senior Secondary Examination,  Mathematics and Computer Science 2006  – 2008 Passed with 90.75% (with 99% in Computer Science and 95% in Mathematics) Activities and Societies:  Captain of College Programming Team ,  Member of College Science Quiz Team ,  Captain of Tug of War Team ,  Member of Volleyball Team St. Joseph's Inter College, Gorakhpur High School Examination (Grade X),  Science with Computer Applications 1994  – 2006 Passed with 94% in Computer Applications Activities and Societies:  Member of Badminton and Quiz Team St. Joseph's Inter College, Gorakhpur High School Examination (Grade X),  Science with Computer Applications 1994  – 2006 Passed with 94% in Computer Applications Activities and Societies:  Member of Badminton and Quiz Team St. Joseph's Inter College, Gorakhpur High School Examination (Grade X),  Science with Computer Applications 1994  – 2006 Passed with 94% in Computer Applications Activities and Societies:  Member of Badminton and Quiz Team Honors & Awards Certificate of Merit Jaypee Institue of Information Technology February 2012 Received a Certificate of Merit for securing and maintaining a department rank of under 10 in a class of 190 students. ACM ICPC-2012 South Asia Regional (Amritapuri Site) December 2012 Ranked 26 (out of 258 selected) during the onsite round of the ACM ICPC-2012 South Asia Regional at Amritapuri (Kerela), India. ACM ICPC-2012 South Asia Regional (Kanpur Site) December 2012 Ranked 43 during the onsite round of the ACM ICPC-2012 South Asia Regional at Kanpur(U.P.), India. ACM ICPC-2011 South Asia Regional (Amritapuri Site) December 2011 Ranked 115 during the onsite round of the ACM ICPC-2011 South Asia Regional at Amritapuri (Kerela), India. International Computer Olympiad COFAS–08 2008 Awarded 2nd Prize in Coding Event ‘Computer Wizard’ during International Computer Olympiad COFAS–08 organized by CMS, Lucknow. National Cyber Olympiad – 2008 Science Olympiad Foundation City Rank 1 (City - Agra) in National Cyber Olympiad – 2008, India. Certificate of Merit Jaypee Institue of Information Technology February 2012 Received a Certificate of Merit for securing and maintaining a department rank of under 10 in a class of 190 students. Certificate of Merit Jaypee Institue of Information Technology February 2012 Received a Certificate of Merit for securing and maintaining a department rank of under 10 in a class of 190 students. Certificate of Merit Jaypee Institue of Information Technology February 2012 Received a Certificate of Merit for securing and maintaining a department rank of under 10 in a class of 190 students. ACM ICPC-2012 South Asia Regional (Amritapuri Site) December 2012 Ranked 26 (out of 258 selected) during the onsite round of the ACM ICPC-2012 South Asia Regional at Amritapuri (Kerela), India. ACM ICPC-2012 South Asia Regional (Amritapuri Site) December 2012 Ranked 26 (out of 258 selected) during the onsite round of the ACM ICPC-2012 South Asia Regional at Amritapuri (Kerela), India. ACM ICPC-2012 South Asia Regional (Amritapuri Site) December 2012 Ranked 26 (out of 258 selected) during the onsite round of the ACM ICPC-2012 South Asia Regional at Amritapuri (Kerela), India. ACM ICPC-2012 South Asia Regional (Kanpur Site) December 2012 Ranked 43 during the onsite round of the ACM ICPC-2012 South Asia Regional at Kanpur(U.P.), India. ACM ICPC-2012 South Asia Regional (Kanpur Site) December 2012 Ranked 43 during the onsite round of the ACM ICPC-2012 South Asia Regional at Kanpur(U.P.), India. ACM ICPC-2012 South Asia Regional (Kanpur Site) December 2012 Ranked 43 during the onsite round of the ACM ICPC-2012 South Asia Regional at Kanpur(U.P.), India. ACM ICPC-2011 South Asia Regional (Amritapuri Site) December 2011 Ranked 115 during the onsite round of the ACM ICPC-2011 South Asia Regional at Amritapuri (Kerela), India. ACM ICPC-2011 South Asia Regional (Amritapuri Site) December 2011 Ranked 115 during the onsite round of the ACM ICPC-2011 South Asia Regional at Amritapuri (Kerela), India. ACM ICPC-2011 South Asia Regional (Amritapuri Site) December 2011 Ranked 115 during the onsite round of the ACM ICPC-2011 South Asia Regional at Amritapuri (Kerela), India. International Computer Olympiad COFAS–08 2008 Awarded 2nd Prize in Coding Event ‘Computer Wizard’ during International Computer Olympiad COFAS–08 organized by CMS, Lucknow. International Computer Olympiad COFAS–08 2008 Awarded 2nd Prize in Coding Event ‘Computer Wizard’ during International Computer Olympiad COFAS–08 organized by CMS, Lucknow. International Computer Olympiad COFAS–08 2008 Awarded 2nd Prize in Coding Event ‘Computer Wizard’ during International Computer Olympiad COFAS–08 organized by CMS, Lucknow. National Cyber Olympiad – 2008 Science Olympiad Foundation City Rank 1 (City - Agra) in National Cyber Olympiad – 2008, India. National Cyber Olympiad – 2008 Science Olympiad Foundation City Rank 1 (City - Agra) in National Cyber Olympiad – 2008, India. National Cyber Olympiad – 2008 Science Olympiad Foundation City Rank 1 (City - Agra) in National Cyber Olympiad – 2008, India. ", "Experience Software Engineering Intern Intel Corporation July 2015  – Present (2 months) Bengaluru Area, India Software Engineering Intern Intel Corporation July 2015  – Present (2 months) Bengaluru Area, India Software Engineering Intern Intel Corporation July 2015  – Present (2 months) Bengaluru Area, India Skills C C++ HTML CSS C# MySQL JavaScript Microsoft Office Core Java Skills  C C++ HTML CSS C# MySQL JavaScript Microsoft Office Core Java C C++ HTML CSS C# MySQL JavaScript Microsoft Office Core Java C C++ HTML CSS C# MySQL JavaScript Microsoft Office Core Java Education Manipal University Master’s Degree,  Computer Science , 8.2 2014  – 2016 I studied my core subjects in-depth, to get expertise in my domain(CSE). With studies i learned many new things, developed projects and presented many presentations.  Rajasthan Technical Univercity Engineer's Degree,  Information Technology 2008  – 2012 Manipal University Master’s Degree,  Computer Science , 8.2 2014  – 2016 I studied my core subjects in-depth, to get expertise in my domain(CSE). With studies i learned many new things, developed projects and presented many presentations.  Manipal University Master’s Degree,  Computer Science , 8.2 2014  – 2016 I studied my core subjects in-depth, to get expertise in my domain(CSE). With studies i learned many new things, developed projects and presented many presentations.  Manipal University Master’s Degree,  Computer Science , 8.2 2014  – 2016 I studied my core subjects in-depth, to get expertise in my domain(CSE). With studies i learned many new things, developed projects and presented many presentations.  Rajasthan Technical Univercity Engineer's Degree,  Information Technology 2008  – 2012 Rajasthan Technical Univercity Engineer's Degree,  Information Technology 2008  – 2012 Rajasthan Technical Univercity Engineer's Degree,  Information Technology 2008  – 2012 ", "Experience Firmware Development Engineer Western Digital August 2011  – Present (4 years 1 month) Software Development Engineer Western Digital July 2010  –  August 2011  (1 year 2 months) Orange County, California Area Responsible for developing and optimizing high level test scripts to validate firmware code for SAS enterprise hard drives \n \nProvided extensive failure analysis of various test logs to firmware engineers, program managers, and technicians so drive issues can be fixed and revalidated in a timely manner \n \nDesigned a background application running behind Western Digital’s SAS testing platforms to periodically upload vital drive and test information to the FIT databases for easy access \n \nInvented a pre-release validation system (PRV) to ensure developers’ test scripts are fit to validate firmware code before they are released to other groups \n \nCreated an automation system to remotely launch tests and perform firmware updates on specific systems from a website without any hands on access Volunteer Rolando Park Elementary School March 2009  –  June 2009  (4 months) Greater San Diego Area Mentored two third grade students in math, reading, and social skills and served as a role model for them Software Engineering Intern Intel Corporation June 2008  –  September 2008  (4 months) Portland, Oregon Area Proposed new values and standardization for NDA Customer records deemed invalid by Trillium Software Discovery to improve overall customer record integrity  \n \nCleansed invalid direct customer data from Intel’s Europe and Asia databases helping Intel save thousands of dollars Software Engineering Intern Intel Corporation June 2007  –  September 2007  (4 months) Portland, Oregon Area Invented a new record standardization for all direct Dell and Hewlett Packard customers \n \nPerformed various analysis of customer record integrity using SQL through Microsoft Access Firmware Development Engineer Western Digital August 2011  – Present (4 years 1 month) Firmware Development Engineer Western Digital August 2011  – Present (4 years 1 month) Software Development Engineer Western Digital July 2010  –  August 2011  (1 year 2 months) Orange County, California Area Responsible for developing and optimizing high level test scripts to validate firmware code for SAS enterprise hard drives \n \nProvided extensive failure analysis of various test logs to firmware engineers, program managers, and technicians so drive issues can be fixed and revalidated in a timely manner \n \nDesigned a background application running behind Western Digital’s SAS testing platforms to periodically upload vital drive and test information to the FIT databases for easy access \n \nInvented a pre-release validation system (PRV) to ensure developers’ test scripts are fit to validate firmware code before they are released to other groups \n \nCreated an automation system to remotely launch tests and perform firmware updates on specific systems from a website without any hands on access Software Development Engineer Western Digital July 2010  –  August 2011  (1 year 2 months) Orange County, California Area Responsible for developing and optimizing high level test scripts to validate firmware code for SAS enterprise hard drives \n \nProvided extensive failure analysis of various test logs to firmware engineers, program managers, and technicians so drive issues can be fixed and revalidated in a timely manner \n \nDesigned a background application running behind Western Digital’s SAS testing platforms to periodically upload vital drive and test information to the FIT databases for easy access \n \nInvented a pre-release validation system (PRV) to ensure developers’ test scripts are fit to validate firmware code before they are released to other groups \n \nCreated an automation system to remotely launch tests and perform firmware updates on specific systems from a website without any hands on access Volunteer Rolando Park Elementary School March 2009  –  June 2009  (4 months) Greater San Diego Area Mentored two third grade students in math, reading, and social skills and served as a role model for them Volunteer Rolando Park Elementary School March 2009  –  June 2009  (4 months) Greater San Diego Area Mentored two third grade students in math, reading, and social skills and served as a role model for them Software Engineering Intern Intel Corporation June 2008  –  September 2008  (4 months) Portland, Oregon Area Proposed new values and standardization for NDA Customer records deemed invalid by Trillium Software Discovery to improve overall customer record integrity  \n \nCleansed invalid direct customer data from Intel’s Europe and Asia databases helping Intel save thousands of dollars Software Engineering Intern Intel Corporation June 2008  –  September 2008  (4 months) Portland, Oregon Area Proposed new values and standardization for NDA Customer records deemed invalid by Trillium Software Discovery to improve overall customer record integrity  \n \nCleansed invalid direct customer data from Intel’s Europe and Asia databases helping Intel save thousands of dollars Software Engineering Intern Intel Corporation June 2007  –  September 2007  (4 months) Portland, Oregon Area Invented a new record standardization for all direct Dell and Hewlett Packard customers \n \nPerformed various analysis of customer record integrity using SQL through Microsoft Access Software Engineering Intern Intel Corporation June 2007  –  September 2007  (4 months) Portland, Oregon Area Invented a new record standardization for all direct Dell and Hewlett Packard customers \n \nPerformed various analysis of customer record integrity using SQL through Microsoft Access Skills Testing SQL Databases Firmware Automation Analysis Debugging Embedded Systems Algorithms C C++ Software Engineering Skills  Testing SQL Databases Firmware Automation Analysis Debugging Embedded Systems Algorithms C C++ Software Engineering Testing SQL Databases Firmware Automation Analysis Debugging Embedded Systems Algorithms C C++ Software Engineering Testing SQL Databases Firmware Automation Analysis Debugging Embedded Systems Algorithms C C++ Software Engineering Education University of California, San Diego Bachelor of Science,  Computer Engineering 2006  – 2010 University of California, San Diego Bachelor of Science,  Computer Engineering 2006  – 2010 University of California, San Diego Bachelor of Science,  Computer Engineering 2006  – 2010 University of California, San Diego Bachelor of Science,  Computer Engineering 2006  – 2010 ", "Summary Chris S. Crawford Jr. is a Computer and Information Science Ph.D. student at the University of Florida (UF). Before attending UF, Chris received his B.S. in Computer Science from the University of Alabama. Currently he is looking into ways to integrate new leading edge technologies with his research in Brain-Robot Interaction. Chis currently also serves as Technical Architect for Ubind and Lead Software Engineer for SeniorGeek Communications, LLC. Summary Chris S. Crawford Jr. is a Computer and Information Science Ph.D. student at the University of Florida (UF). Before attending UF, Chris received his B.S. in Computer Science from the University of Alabama. Currently he is looking into ways to integrate new leading edge technologies with his research in Brain-Robot Interaction. Chis currently also serves as Technical Architect for Ubind and Lead Software Engineer for SeniorGeek Communications, LLC. Chris S. Crawford Jr. is a Computer and Information Science Ph.D. student at the University of Florida (UF). Before attending UF, Chris received his B.S. in Computer Science from the University of Alabama. Currently he is looking into ways to integrate new leading edge technologies with his research in Brain-Robot Interaction. Chis currently also serves as Technical Architect for Ubind and Lead Software Engineer for SeniorGeek Communications, LLC. Chris S. Crawford Jr. is a Computer and Information Science Ph.D. student at the University of Florida (UF). Before attending UF, Chris received his B.S. in Computer Science from the University of Alabama. Currently he is looking into ways to integrate new leading edge technologies with his research in Brain-Robot Interaction. Chis currently also serves as Technical Architect for Ubind and Lead Software Engineer for SeniorGeek Communications, LLC. Experience Software Engineering Intern Intel Corporation May 2014  – Present (1 year 4 months) Santa Clara, CA Working on perceptual computing project. Lead Software Engineer SeniorGeek Communications, LLC April 2013  – Present (2 years 5 months) Overseas software product development/design. Technical Architect Ubind August 2011  – Present (4 years 1 month) Consulted Ubind business development team on overall architecture helping to stream line the  \ntechnical design and development process. \nConstructed Ubind’s Drupal platform as well as, the company’s overall infrastructure, also \nconfigured the mySQL database and Apache server. \nCreated and initiated development standards including but not limited to spacing, naming  \nconventions, and letter case; which in turn made the code easier to read and uniform. Software Engineering Intern Intel Corporation May 2013  –  August 2013  (4 months) Santa Clara, CA Developed real-time interactive programming tool to assist developers. Computer Science Department Undergradute Reseracher University of Alabama May 2010  –  May 2012  (2 years 1 month) Robotics research \nWeb-based application development \nRobotic simulation development \nClient server system development Software Engineering Intern Intel Corporation May 2014  – Present (1 year 4 months) Santa Clara, CA Working on perceptual computing project. Software Engineering Intern Intel Corporation May 2014  – Present (1 year 4 months) Santa Clara, CA Working on perceptual computing project. Lead Software Engineer SeniorGeek Communications, LLC April 2013  – Present (2 years 5 months) Overseas software product development/design. Lead Software Engineer SeniorGeek Communications, LLC April 2013  – Present (2 years 5 months) Overseas software product development/design. Technical Architect Ubind August 2011  – Present (4 years 1 month) Consulted Ubind business development team on overall architecture helping to stream line the  \ntechnical design and development process. \nConstructed Ubind’s Drupal platform as well as, the company’s overall infrastructure, also \nconfigured the mySQL database and Apache server. \nCreated and initiated development standards including but not limited to spacing, naming  \nconventions, and letter case; which in turn made the code easier to read and uniform. Technical Architect Ubind August 2011  – Present (4 years 1 month) Consulted Ubind business development team on overall architecture helping to stream line the  \ntechnical design and development process. \nConstructed Ubind’s Drupal platform as well as, the company’s overall infrastructure, also \nconfigured the mySQL database and Apache server. \nCreated and initiated development standards including but not limited to spacing, naming  \nconventions, and letter case; which in turn made the code easier to read and uniform. Software Engineering Intern Intel Corporation May 2013  –  August 2013  (4 months) Santa Clara, CA Developed real-time interactive programming tool to assist developers. Software Engineering Intern Intel Corporation May 2013  –  August 2013  (4 months) Santa Clara, CA Developed real-time interactive programming tool to assist developers. Computer Science Department Undergradute Reseracher University of Alabama May 2010  –  May 2012  (2 years 1 month) Robotics research \nWeb-based application development \nRobotic simulation development \nClient server system development Computer Science Department Undergradute Reseracher University of Alabama May 2010  –  May 2012  (2 years 1 month) Robotics research \nWeb-based application development \nRobotic simulation development \nClient server system development Skills HTML SQL C++ Java jQuery Node.js C Python JavaScript Robotics Skills  HTML SQL C++ Java jQuery Node.js C Python JavaScript Robotics HTML SQL C++ Java jQuery Node.js C Python JavaScript Robotics HTML SQL C++ Java jQuery Node.js C Python JavaScript Robotics Education University of Florida Doctor of Philosophy (PhD),  Computer & Information Science & Engineering Department 2014  – 2017 University of Alabama Bachelor of Science (BS),  Computer Science , 3.64 2008  – 2012 University of Florida Doctor of Philosophy (PhD),  Computer & Information Science & Engineering Department 2014  – 2017 University of Florida Doctor of Philosophy (PhD),  Computer & Information Science & Engineering Department 2014  – 2017 University of Florida Doctor of Philosophy (PhD),  Computer & Information Science & Engineering Department 2014  – 2017 University of Alabama Bachelor of Science (BS),  Computer Science , 3.64 2008  – 2012 University of Alabama Bachelor of Science (BS),  Computer Science , 3.64 2008  – 2012 University of Alabama Bachelor of Science (BS),  Computer Science , 3.64 2008  – 2012 ", "Summary Graduate Student at Oregon State University (MS in Computer Science, 2016, Software Engineering) \nB.Tech. 2014 from Indian Institute of Technology (BHU), Varanasi. Summary Graduate Student at Oregon State University (MS in Computer Science, 2016, Software Engineering) \nB.Tech. 2014 from Indian Institute of Technology (BHU), Varanasi. Graduate Student at Oregon State University (MS in Computer Science, 2016, Software Engineering) \nB.Tech. 2014 from Indian Institute of Technology (BHU), Varanasi. Graduate Student at Oregon State University (MS in Computer Science, 2016, Software Engineering) \nB.Tech. 2014 from Indian Institute of Technology (BHU), Varanasi. Experience Software Engineering Intern Intel Corporation June 2015  – Present (3 months) Hillsboro, OR MS in Computer Science Oregon State University September 2014  – Present (1 year) Corvallis, Oregon Graduate Teaching Assistant Oregon State University September 2014  – Present (1 year) Corvallis, Oregon Area Spring 2015: \n- CS 496 Mobile & Cloud Software Development \n \nWinter 2015: \n- CS 290 Web Development \n- CS 496 Mobile & Cloud Software Development \n \nFall 2014: \n- CS 494: Web Development \n Developer makemymails.com August 2013  – Present (2 years 1 month) New Delhi Area, India makemymails.com (Beta) is a a powerful cloud based email marketing and transactional messaging technology. Finalist at Google Cloud Developer Challenge 2013 [1] and winner of Startupdash by Inc42 and TLabs (Times Group accelerator) \n \n[1] https://www.google.com/events/gcdc2013/finalists.html Google Summer of Code 2014 Google May 2014  –  August 2014  (4 months) Google sponsored project, under mentorship of Open Source Lab (osuosl.org). Rearchitecture and implementation of tools for FTP Mirror Syncing. B.Tech. 2014 Indian Institute of Technology, BHU, Varanasi July 2010  –  May 2014  (3 years 11 months) Varanasi Area, India Speaker Pycon UK 2013 September 2013  –  September 2013  (1 month) Coventry, United Kingdom Slides of my talk on \"Virtualization with Ganeti\" at Pycon UK 2013, (available) \nThe talk is from a beginner perspective (and I am myself a beginner with this tool) . Its a top level view at a Ganeti Cluster's architecture and does not cover the installation details which is well documented already. \nGaneti is an Open Source Cloud Computing or Cluster Management Software developed by Google. \n \nhttp://en.wikipedia.org/wiki/Ganeti Google Summer of Code 2013 Google June 2013  –  September 2013  (4 months) Google sponsored Project with OSU's Open Source Lab via Google Summer of Code 2013 Program. \nI worked on the Ganeti Web Manager project, which is a web application console for \"Ganeti\" (A cloud computing / cluster management platform.) \n \nI made a blog update on my project half way down: \nhttp://www.pranjalmittal.in/2013/07/google-summer-of-code-update-1.html \n \nOpen Source Lab (osuosl.org)- provides hosting for more than 160 projects, including those of worldwide leaders like the Apache Software Foundation, the Linux Foundation, Drupal, Python Software Foundation. OSL’s hosted sites deliver nearly 430 terabytes of information every month to people around the world. Application Developer Webfuel Technologies September 2011  –  April 2013  (1 year 8 months) Varanasi Area, India Webfuel Technologies (Bright Ants): Webfuel technologies aims at building data intensive web applications and products. \n \nA brief description on a project that I have worked on as a part of the Webfuel team: \n \netlint.com \n \nEtlint is a cloud conversion and processing software which currently runs a SaaS based Excel to MySQL based data conversion software in production for free. \nThe initial problem addressed was to convert Excel data to MySQL on the cloud with the idea: Convert Here, Import Anywhere. \nThe application supports innovative ways to carry out the optimized conversion process on the cloud. Summer Intern (2012) Senocad Research GmbH May 2012  –  July 2012  (3 months) Karlsruhe Area, Germany Worked on developing Medical Applications for the Healthcare Industry and Hospitals, which included conducting software research and programming applications. \nApplications were built to be compliant with DICOM standard in medicine. \nExperience Gained: Digital Imaging and Communication in Medicine, QT, C++, Python, TCP/IP Networking, MySQL. Web Application Programmer Technex June 2011  –  January 2012  (8 months) Varanasi Area, India Technex is the annual Technology and Entrepreneaurship festival of Indian Institute of Technology, BHU, Varanasi \nIt involves national participation, in a variety of competitions, workshops, exhibitions and lecture series by leading scientists/professors and research faculty. Web Administrator, Technical Assistance Bakliwal Tutorials IIT December 2011  –  December 2011  (1 month) Pune Area, India Developed Technical & Software solutions for the educational institute. Brought a shift of internal documents,material & data to the cloud, leading to the better efficiency of staff. \nAlso developed Web Applcations & handled web administration for the organisation. Web Developer AutomotionAds May 2011  –  July 2011  (3 months) Software Engineering Intern Intel Corporation June 2015  – Present (3 months) Hillsboro, OR Software Engineering Intern Intel Corporation June 2015  – Present (3 months) Hillsboro, OR MS in Computer Science Oregon State University September 2014  – Present (1 year) Corvallis, Oregon MS in Computer Science Oregon State University September 2014  – Present (1 year) Corvallis, Oregon Graduate Teaching Assistant Oregon State University September 2014  – Present (1 year) Corvallis, Oregon Area Spring 2015: \n- CS 496 Mobile & Cloud Software Development \n \nWinter 2015: \n- CS 290 Web Development \n- CS 496 Mobile & Cloud Software Development \n \nFall 2014: \n- CS 494: Web Development \n Graduate Teaching Assistant Oregon State University September 2014  – Present (1 year) Corvallis, Oregon Area Spring 2015: \n- CS 496 Mobile & Cloud Software Development \n \nWinter 2015: \n- CS 290 Web Development \n- CS 496 Mobile & Cloud Software Development \n \nFall 2014: \n- CS 494: Web Development \n Developer makemymails.com August 2013  – Present (2 years 1 month) New Delhi Area, India makemymails.com (Beta) is a a powerful cloud based email marketing and transactional messaging technology. Finalist at Google Cloud Developer Challenge 2013 [1] and winner of Startupdash by Inc42 and TLabs (Times Group accelerator) \n \n[1] https://www.google.com/events/gcdc2013/finalists.html Developer makemymails.com August 2013  – Present (2 years 1 month) New Delhi Area, India makemymails.com (Beta) is a a powerful cloud based email marketing and transactional messaging technology. Finalist at Google Cloud Developer Challenge 2013 [1] and winner of Startupdash by Inc42 and TLabs (Times Group accelerator) \n \n[1] https://www.google.com/events/gcdc2013/finalists.html Google Summer of Code 2014 Google May 2014  –  August 2014  (4 months) Google sponsored project, under mentorship of Open Source Lab (osuosl.org). Rearchitecture and implementation of tools for FTP Mirror Syncing. Google Summer of Code 2014 Google May 2014  –  August 2014  (4 months) Google sponsored project, under mentorship of Open Source Lab (osuosl.org). Rearchitecture and implementation of tools for FTP Mirror Syncing. B.Tech. 2014 Indian Institute of Technology, BHU, Varanasi July 2010  –  May 2014  (3 years 11 months) Varanasi Area, India B.Tech. 2014 Indian Institute of Technology, BHU, Varanasi July 2010  –  May 2014  (3 years 11 months) Varanasi Area, India Speaker Pycon UK 2013 September 2013  –  September 2013  (1 month) Coventry, United Kingdom Slides of my talk on \"Virtualization with Ganeti\" at Pycon UK 2013, (available) \nThe talk is from a beginner perspective (and I am myself a beginner with this tool) . Its a top level view at a Ganeti Cluster's architecture and does not cover the installation details which is well documented already. \nGaneti is an Open Source Cloud Computing or Cluster Management Software developed by Google. \n \nhttp://en.wikipedia.org/wiki/Ganeti Speaker Pycon UK 2013 September 2013  –  September 2013  (1 month) Coventry, United Kingdom Slides of my talk on \"Virtualization with Ganeti\" at Pycon UK 2013, (available) \nThe talk is from a beginner perspective (and I am myself a beginner with this tool) . Its a top level view at a Ganeti Cluster's architecture and does not cover the installation details which is well documented already. \nGaneti is an Open Source Cloud Computing or Cluster Management Software developed by Google. \n \nhttp://en.wikipedia.org/wiki/Ganeti Google Summer of Code 2013 Google June 2013  –  September 2013  (4 months) Google sponsored Project with OSU's Open Source Lab via Google Summer of Code 2013 Program. \nI worked on the Ganeti Web Manager project, which is a web application console for \"Ganeti\" (A cloud computing / cluster management platform.) \n \nI made a blog update on my project half way down: \nhttp://www.pranjalmittal.in/2013/07/google-summer-of-code-update-1.html \n \nOpen Source Lab (osuosl.org)- provides hosting for more than 160 projects, including those of worldwide leaders like the Apache Software Foundation, the Linux Foundation, Drupal, Python Software Foundation. OSL’s hosted sites deliver nearly 430 terabytes of information every month to people around the world. Google Summer of Code 2013 Google June 2013  –  September 2013  (4 months) Google sponsored Project with OSU's Open Source Lab via Google Summer of Code 2013 Program. \nI worked on the Ganeti Web Manager project, which is a web application console for \"Ganeti\" (A cloud computing / cluster management platform.) \n \nI made a blog update on my project half way down: \nhttp://www.pranjalmittal.in/2013/07/google-summer-of-code-update-1.html \n \nOpen Source Lab (osuosl.org)- provides hosting for more than 160 projects, including those of worldwide leaders like the Apache Software Foundation, the Linux Foundation, Drupal, Python Software Foundation. OSL’s hosted sites deliver nearly 430 terabytes of information every month to people around the world. Application Developer Webfuel Technologies September 2011  –  April 2013  (1 year 8 months) Varanasi Area, India Webfuel Technologies (Bright Ants): Webfuel technologies aims at building data intensive web applications and products. \n \nA brief description on a project that I have worked on as a part of the Webfuel team: \n \netlint.com \n \nEtlint is a cloud conversion and processing software which currently runs a SaaS based Excel to MySQL based data conversion software in production for free. \nThe initial problem addressed was to convert Excel data to MySQL on the cloud with the idea: Convert Here, Import Anywhere. \nThe application supports innovative ways to carry out the optimized conversion process on the cloud. Application Developer Webfuel Technologies September 2011  –  April 2013  (1 year 8 months) Varanasi Area, India Webfuel Technologies (Bright Ants): Webfuel technologies aims at building data intensive web applications and products. \n \nA brief description on a project that I have worked on as a part of the Webfuel team: \n \netlint.com \n \nEtlint is a cloud conversion and processing software which currently runs a SaaS based Excel to MySQL based data conversion software in production for free. \nThe initial problem addressed was to convert Excel data to MySQL on the cloud with the idea: Convert Here, Import Anywhere. \nThe application supports innovative ways to carry out the optimized conversion process on the cloud. Summer Intern (2012) Senocad Research GmbH May 2012  –  July 2012  (3 months) Karlsruhe Area, Germany Worked on developing Medical Applications for the Healthcare Industry and Hospitals, which included conducting software research and programming applications. \nApplications were built to be compliant with DICOM standard in medicine. \nExperience Gained: Digital Imaging and Communication in Medicine, QT, C++, Python, TCP/IP Networking, MySQL. Summer Intern (2012) Senocad Research GmbH May 2012  –  July 2012  (3 months) Karlsruhe Area, Germany Worked on developing Medical Applications for the Healthcare Industry and Hospitals, which included conducting software research and programming applications. \nApplications were built to be compliant with DICOM standard in medicine. \nExperience Gained: Digital Imaging and Communication in Medicine, QT, C++, Python, TCP/IP Networking, MySQL. Web Application Programmer Technex June 2011  –  January 2012  (8 months) Varanasi Area, India Technex is the annual Technology and Entrepreneaurship festival of Indian Institute of Technology, BHU, Varanasi \nIt involves national participation, in a variety of competitions, workshops, exhibitions and lecture series by leading scientists/professors and research faculty. Web Application Programmer Technex June 2011  –  January 2012  (8 months) Varanasi Area, India Technex is the annual Technology and Entrepreneaurship festival of Indian Institute of Technology, BHU, Varanasi \nIt involves national participation, in a variety of competitions, workshops, exhibitions and lecture series by leading scientists/professors and research faculty. Web Administrator, Technical Assistance Bakliwal Tutorials IIT December 2011  –  December 2011  (1 month) Pune Area, India Developed Technical & Software solutions for the educational institute. Brought a shift of internal documents,material & data to the cloud, leading to the better efficiency of staff. \nAlso developed Web Applcations & handled web administration for the organisation. Web Administrator, Technical Assistance Bakliwal Tutorials IIT December 2011  –  December 2011  (1 month) Pune Area, India Developed Technical & Software solutions for the educational institute. Brought a shift of internal documents,material & data to the cloud, leading to the better efficiency of staff. \nAlso developed Web Applcations & handled web administration for the organisation. Web Developer AutomotionAds May 2011  –  July 2011  (3 months) Web Developer AutomotionAds May 2011  –  July 2011  (3 months) Languages English Professional working proficiency Hindi Native or bilingual proficiency German Limited working proficiency English Professional working proficiency Hindi Native or bilingual proficiency German Limited working proficiency English Professional working proficiency Hindi Native or bilingual proficiency German Limited working proficiency Professional working proficiency Native or bilingual proficiency Limited working proficiency Skills Python Programming Linux C++ C MySQL Algorithms Web Applications Data Structures Open Source HTML Git JavaScript Web Development Django Software Development SQL CSS PHP Eclipse Apache AJAX HTML + CSS HTML 5 Shell Scripting Operating Systems Android Cloud Computing Cloud Applications Database Management Google Analytics XML Web Services HTML5 DICOM Ganeti Software Testing Automated Software... Unit Testing Product Management Leadership See 26+     See less Skills  Python Programming Linux C++ C MySQL Algorithms Web Applications Data Structures Open Source HTML Git JavaScript Web Development Django Software Development SQL CSS PHP Eclipse Apache AJAX HTML + CSS HTML 5 Shell Scripting Operating Systems Android Cloud Computing Cloud Applications Database Management Google Analytics XML Web Services HTML5 DICOM Ganeti Software Testing Automated Software... Unit Testing Product Management Leadership See 26+     See less Python Programming Linux C++ C MySQL Algorithms Web Applications Data Structures Open Source HTML Git JavaScript Web Development Django Software Development SQL CSS PHP Eclipse Apache AJAX HTML + CSS HTML 5 Shell Scripting Operating Systems Android Cloud Computing Cloud Applications Database Management Google Analytics XML Web Services HTML5 DICOM Ganeti Software Testing Automated Software... Unit Testing Product Management Leadership See 26+     See less Python Programming Linux C++ C MySQL Algorithms Web Applications Data Structures Open Source HTML Git JavaScript Web Development Django Software Development SQL CSS PHP Eclipse Apache AJAX HTML + CSS HTML 5 Shell Scripting Operating Systems Android Cloud Computing Cloud Applications Database Management Google Analytics XML Web Services HTML5 DICOM Ganeti Software Testing Automated Software... Unit Testing Product Management Leadership See 26+     See less Education Indian Institute of Technology, (BHU), Varanasi B.Tech.,  ECE 2010  – 2014 ARMY PUBLIC SCHOOL, PUNE X 2006  – 2010 Army Public School, Pune Physics ,  Chemistry , Mathematics,  Informatics Practices ,  English 2005  – 2010 Activities and Societies:  Quizzing ,  Olympiads Oregon State University Master of Science (MS),  Computer Science 2014 Indian Institute of Technology, BHU, Varanasi Indian Institute of Technology, (BHU), Varanasi B.Tech.,  ECE 2010  – 2014 Indian Institute of Technology, (BHU), Varanasi B.Tech.,  ECE 2010  – 2014 Indian Institute of Technology, (BHU), Varanasi B.Tech.,  ECE 2010  – 2014 ARMY PUBLIC SCHOOL, PUNE X 2006  – 2010 ARMY PUBLIC SCHOOL, PUNE X 2006  – 2010 ARMY PUBLIC SCHOOL, PUNE X 2006  – 2010 Army Public School, Pune Physics ,  Chemistry , Mathematics,  Informatics Practices ,  English 2005  – 2010 Activities and Societies:  Quizzing ,  Olympiads Army Public School, Pune Physics ,  Chemistry , Mathematics,  Informatics Practices ,  English 2005  – 2010 Activities and Societies:  Quizzing ,  Olympiads Army Public School, Pune Physics ,  Chemistry , Mathematics,  Informatics Practices ,  English 2005  – 2010 Activities and Societies:  Quizzing ,  Olympiads Oregon State University Master of Science (MS),  Computer Science 2014 Oregon State University Master of Science (MS),  Computer Science 2014 Oregon State University Master of Science (MS),  Computer Science 2014 Indian Institute of Technology, BHU, Varanasi Indian Institute of Technology, BHU, Varanasi Indian Institute of Technology, BHU, Varanasi Honors & Awards Maths Olympiad: India Rank 2 www.silverzone.org 2009 Ranked 2nd in India in Mathematics Olympiad conducted by Silverzone in High School. (Class 12) \nhttp://www.silverzone.org/iOM09_Top3.asp Maths Olympiad: India Rank 2 www.silverzone.org 2009 Ranked 2nd in India in Mathematics Olympiad conducted by Silverzone in High School. (Class 12) \nhttp://www.silverzone.org/iOM09_Top3.asp Maths Olympiad: India Rank 2 www.silverzone.org 2009 Ranked 2nd in India in Mathematics Olympiad conducted by Silverzone in High School. (Class 12) \nhttp://www.silverzone.org/iOM09_Top3.asp Maths Olympiad: India Rank 2 www.silverzone.org 2009 Ranked 2nd in India in Mathematics Olympiad conducted by Silverzone in High School. (Class 12) \nhttp://www.silverzone.org/iOM09_Top3.asp ", "Experience Mobile Communications Software Engineering Intern Intel Corporation May 2012  – Present (3 years 4 months) Allentown, PA Intern - Wireless Test Engineer Intel Mobile Communications July 2011  –  August 2011  (2 months) Allentown, Pennsylvania Area Mobile Communications Software Engineering Intern Intel Corporation May 2012  – Present (3 years 4 months) Allentown, PA Mobile Communications Software Engineering Intern Intel Corporation May 2012  – Present (3 years 4 months) Allentown, PA Intern - Wireless Test Engineer Intel Mobile Communications July 2011  –  August 2011  (2 months) Allentown, Pennsylvania Area Intern - Wireless Test Engineer Intel Mobile Communications July 2011  –  August 2011  (2 months) Allentown, Pennsylvania Area Skills Customer Service Wireless Skills  Customer Service Wireless Customer Service Wireless Customer Service Wireless Education Kutztown University of Pennsylvania Bachelor's degree,  Computer Science 2013  – 2014 University of Delaware 2007  – 2012 Kutztown University of Pennsylvania Bachelor's degree,  Computer Science 2013  – 2014 Kutztown University of Pennsylvania Bachelor's degree,  Computer Science 2013  – 2014 Kutztown University of Pennsylvania Bachelor's degree,  Computer Science 2013  – 2014 University of Delaware 2007  – 2012 University of Delaware 2007  – 2012 University of Delaware 2007  – 2012 ", "Experience Research Intern Microsoft June 2015  – Present (3 months) Greater New York City Area Research Assistant Brown University 2013  – Present (2 years) Teaching Assistant - First Byte of Computer Science Brown University January 2015  –  May 2015  (5 months) Teaching Assistant - Artificial Intelligence Brown University September 2014  –  December 2014  (4 months) Teaching Assistant - Data Structures Carleton College January 2013  –  March 2013  (3 months) Teaching Assistant - Logic Carleton College September 2012  –  November 2012  (3 months) Northfield, MN Engineering Intern - Graphics Qualcomm June 2012  –  August 2012  (3 months) Boulder, CO Teaching Assistant - Intro To Computer Science Carleton College May 2011  –  June 2012  (1 year 2 months) Northfield, MN Software Engineering Intern Qualcomm June 2011  –  August 2011  (3 months) Boulder, CO Software Engineering Intern Intel Corporation June 2009  –  August 2009  (3 months) Hillsboro, Oregon Software Engineering Intern Intel Corporation June 2009  –  August 2009  (3 months) Hillsboro, OR Software Engineering Intern Intel Corporation June 2008  –  August 2008  (3 months) Hillsboro, OR Research Intern Microsoft June 2015  – Present (3 months) Greater New York City Area Research Intern Microsoft June 2015  – Present (3 months) Greater New York City Area Research Assistant Brown University 2013  – Present (2 years) Research Assistant Brown University 2013  – Present (2 years) Teaching Assistant - First Byte of Computer Science Brown University January 2015  –  May 2015  (5 months) Teaching Assistant - First Byte of Computer Science Brown University January 2015  –  May 2015  (5 months) Teaching Assistant - Artificial Intelligence Brown University September 2014  –  December 2014  (4 months) Teaching Assistant - Artificial Intelligence Brown University September 2014  –  December 2014  (4 months) Teaching Assistant - Data Structures Carleton College January 2013  –  March 2013  (3 months) Teaching Assistant - Data Structures Carleton College January 2013  –  March 2013  (3 months) Teaching Assistant - Logic Carleton College September 2012  –  November 2012  (3 months) Northfield, MN Teaching Assistant - Logic Carleton College September 2012  –  November 2012  (3 months) Northfield, MN Engineering Intern - Graphics Qualcomm June 2012  –  August 2012  (3 months) Boulder, CO Engineering Intern - Graphics Qualcomm June 2012  –  August 2012  (3 months) Boulder, CO Teaching Assistant - Intro To Computer Science Carleton College May 2011  –  June 2012  (1 year 2 months) Northfield, MN Teaching Assistant - Intro To Computer Science Carleton College May 2011  –  June 2012  (1 year 2 months) Northfield, MN Software Engineering Intern Qualcomm June 2011  –  August 2011  (3 months) Boulder, CO Software Engineering Intern Qualcomm June 2011  –  August 2011  (3 months) Boulder, CO Software Engineering Intern Intel Corporation June 2009  –  August 2009  (3 months) Hillsboro, Oregon Software Engineering Intern Intel Corporation June 2009  –  August 2009  (3 months) Hillsboro, Oregon Software Engineering Intern Intel Corporation June 2009  –  August 2009  (3 months) Hillsboro, OR Software Engineering Intern Intel Corporation June 2009  –  August 2009  (3 months) Hillsboro, OR Software Engineering Intern Intel Corporation June 2008  –  August 2008  (3 months) Hillsboro, OR Software Engineering Intern Intel Corporation June 2008  –  August 2008  (3 months) Hillsboro, OR Skills Algorithms Computer Science Artificial Intelligence Reinforcement Learning Philosophy Discrete Mathematics Teaching Machine Learning LaTeX Python Logic Software Development Java C Programming Matlab Academic Tutoring Research See 3+     See less Skills  Algorithms Computer Science Artificial Intelligence Reinforcement Learning Philosophy Discrete Mathematics Teaching Machine Learning LaTeX Python Logic Software Development Java C Programming Matlab Academic Tutoring Research See 3+     See less Algorithms Computer Science Artificial Intelligence Reinforcement Learning Philosophy Discrete Mathematics Teaching Machine Learning LaTeX Python Logic Software Development Java C Programming Matlab Academic Tutoring Research See 3+     See less Algorithms Computer Science Artificial Intelligence Reinforcement Learning Philosophy Discrete Mathematics Teaching Machine Learning LaTeX Python Logic Software Development Java C Programming Matlab Academic Tutoring Research See 3+     See less Education Brown University Doctor of Philosophy (Ph.D.) 2015  – 2020 Brown University Master of Science (M.S.) 2013  – 2015 Carleton College Bachelor of Arts (B.A.) 2009  – 2013 Brown University Doctor of Philosophy (Ph.D.) 2015  – 2020 Brown University Doctor of Philosophy (Ph.D.) 2015  – 2020 Brown University Doctor of Philosophy (Ph.D.) 2015  – 2020 Brown University Master of Science (M.S.) 2013  – 2015 Brown University Master of Science (M.S.) 2013  – 2015 Brown University Master of Science (M.S.) 2013  – 2015 Carleton College Bachelor of Arts (B.A.) 2009  – 2013 Carleton College Bachelor of Arts (B.A.) 2009  – 2013 Carleton College Bachelor of Arts (B.A.) 2009  – 2013 "]}