{"position": "Solution Lead", "company": "IBM", "profiles": ["Experience Stuff Software Engineer-Solution Lead IBM Stuff Software Engineer-Solution Lead IBM Stuff Software Engineer-Solution Lead IBM Education Cairo University 1995  – 1999 Cairo University 1995  – 1999 Cairo University 1995  – 1999 Cairo University 1995  – 1999 ", "Experience UKI Base Growth Technical Solution Lead IBM April 2013  – Present (2 years 5 months) Bristol Lead IBM's Base Growth 100+ Technical Solution Managers based in UK, India and Poland. The TSMs support the Base Growth sales organization to meet yearly targets of new increment revenue for IBM, by converting Customer business requirements into priced proposals. Base Growth Account Solution Manager IBM August 2008  –  March 2013  (4 years 8 months) Various Account Solution Manager for several IBM SO Accounts in the UK. Lead teams of Technical Solution managers on each account, responsible for convert Customer business requirement into priced proposals. UKI Base Growth Technical Solution Lead IBM April 2013  – Present (2 years 5 months) Bristol Lead IBM's Base Growth 100+ Technical Solution Managers based in UK, India and Poland. The TSMs support the Base Growth sales organization to meet yearly targets of new increment revenue for IBM, by converting Customer business requirements into priced proposals. UKI Base Growth Technical Solution Lead IBM April 2013  – Present (2 years 5 months) Bristol Lead IBM's Base Growth 100+ Technical Solution Managers based in UK, India and Poland. The TSMs support the Base Growth sales organization to meet yearly targets of new increment revenue for IBM, by converting Customer business requirements into priced proposals. Base Growth Account Solution Manager IBM August 2008  –  March 2013  (4 years 8 months) Various Account Solution Manager for several IBM SO Accounts in the UK. Lead teams of Technical Solution managers on each account, responsible for convert Customer business requirement into priced proposals. Base Growth Account Solution Manager IBM August 2008  –  March 2013  (4 years 8 months) Various Account Solution Manager for several IBM SO Accounts in the UK. Lead teams of Technical Solution managers on each account, responsible for convert Customer business requirement into priced proposals. Skills Management Business Requirements IT Outsourcing ITIL IT Strategy Skills  Management Business Requirements IT Outsourcing ITIL IT Strategy Management Business Requirements IT Outsourcing ITIL IT Strategy Management Business Requirements IT Outsourcing ITIL IT Strategy ", "Languages English Native or bilingual proficiency Français Native or bilingual proficiency English Native or bilingual proficiency Français Native or bilingual proficiency English Native or bilingual proficiency Français Native or bilingual proficiency Native or bilingual proficiency Native or bilingual proficiency Skills VMware Active Directory Virtualization System Administration Windows Server ITIL VDI Windows 7 Migration SCCM 2007 Infrastructure SCCM Windows 7 Integration Disaster Recovery IT Service Management IT Management Technical Support Enterprise Architecture VMware Infrastructure Citrix Service Delivery System Deployment See 7+     See less Skills  VMware Active Directory Virtualization System Administration Windows Server ITIL VDI Windows 7 Migration SCCM 2007 Infrastructure SCCM Windows 7 Integration Disaster Recovery IT Service Management IT Management Technical Support Enterprise Architecture VMware Infrastructure Citrix Service Delivery System Deployment See 7+     See less VMware Active Directory Virtualization System Administration Windows Server ITIL VDI Windows 7 Migration SCCM 2007 Infrastructure SCCM Windows 7 Integration Disaster Recovery IT Service Management IT Management Technical Support Enterprise Architecture VMware Infrastructure Citrix Service Delivery System Deployment See 7+     See less VMware Active Directory Virtualization System Administration Windows Server ITIL VDI Windows 7 Migration SCCM 2007 Infrastructure SCCM Windows 7 Integration Disaster Recovery IT Service Management IT Management Technical Support Enterprise Architecture VMware Infrastructure Citrix Service Delivery System Deployment See 7+     See less ", "Experience SAP Global Rollout Solution Lead IBM January 2013  – Present (2 years 8 months) Dublin Leading cross geography, cross lines of business subject matter expert teams to develop complex, multi-year solutions and optimised cost cases that meet client requirements. \n \nInteracting with global clients to understand the strategic priorities, business and technical requirements, issues and tactical problems, to develop and articulate robust and innovative technical solutions. Manager of SAP Enterprise & Business Intelligence Competency Centres AIB December 2005  –  January 2013  (7 years 2 months) Dublin Finance Solution Manager Health Service Executive September 2002  –  November 2005  (3 years 3 months) sligo Senior SAP Solutions Consultant/ Project and Account Manager IBM January 1997  –  August 2002  (5 years 8 months) Dublin Consultant AXS-One January 1994  –  January 1997  (3 years 1 month) Account Manager Donovan Data Systems January 1989  –  January 1994  (5 years 1 month) London, United Kingdom SAP Global Rollout Solution Lead IBM January 2013  – Present (2 years 8 months) Dublin Leading cross geography, cross lines of business subject matter expert teams to develop complex, multi-year solutions and optimised cost cases that meet client requirements. \n \nInteracting with global clients to understand the strategic priorities, business and technical requirements, issues and tactical problems, to develop and articulate robust and innovative technical solutions. SAP Global Rollout Solution Lead IBM January 2013  – Present (2 years 8 months) Dublin Leading cross geography, cross lines of business subject matter expert teams to develop complex, multi-year solutions and optimised cost cases that meet client requirements. \n \nInteracting with global clients to understand the strategic priorities, business and technical requirements, issues and tactical problems, to develop and articulate robust and innovative technical solutions. Manager of SAP Enterprise & Business Intelligence Competency Centres AIB December 2005  –  January 2013  (7 years 2 months) Dublin Manager of SAP Enterprise & Business Intelligence Competency Centres AIB December 2005  –  January 2013  (7 years 2 months) Dublin Finance Solution Manager Health Service Executive September 2002  –  November 2005  (3 years 3 months) sligo Finance Solution Manager Health Service Executive September 2002  –  November 2005  (3 years 3 months) sligo Senior SAP Solutions Consultant/ Project and Account Manager IBM January 1997  –  August 2002  (5 years 8 months) Dublin Senior SAP Solutions Consultant/ Project and Account Manager IBM January 1997  –  August 2002  (5 years 8 months) Dublin Consultant AXS-One January 1994  –  January 1997  (3 years 1 month) Consultant AXS-One January 1994  –  January 1997  (3 years 1 month) Account Manager Donovan Data Systems January 1989  –  January 1994  (5 years 1 month) London, United Kingdom Account Manager Donovan Data Systems January 1989  –  January 1994  (5 years 1 month) London, United Kingdom Skills Technology Enabled... Ability to communicate... Strategic change... Business Process... Requirements Analysis Solution Architecture Change Management Business Intelligence Business Transformation SAP Strategy Business Development Business Process Information Technology Business Analysis Enterprise Software ERP IT Strategy Outsourcing Program Management See 5+     See less Skills  Technology Enabled... Ability to communicate... Strategic change... Business Process... Requirements Analysis Solution Architecture Change Management Business Intelligence Business Transformation SAP Strategy Business Development Business Process Information Technology Business Analysis Enterprise Software ERP IT Strategy Outsourcing Program Management See 5+     See less Technology Enabled... Ability to communicate... Strategic change... Business Process... Requirements Analysis Solution Architecture Change Management Business Intelligence Business Transformation SAP Strategy Business Development Business Process Information Technology Business Analysis Enterprise Software ERP IT Strategy Outsourcing Program Management See 5+     See less Technology Enabled... Ability to communicate... Strategic change... Business Process... Requirements Analysis Solution Architecture Change Management Business Intelligence Business Transformation SAP Strategy Business Development Business Process Information Technology Business Analysis Enterprise Software ERP IT Strategy Outsourcing Program Management See 5+     See less ", "Summary Product development manager experienced with full lifecycle: requirements analysis, feature set definition, product launching, packaging and maintenance. Worked in multi time zone, multi culture environment. Managed projects involving assessment, acquisition and integration of various technology solutions. Built teams. Strong technology background. Enjoys and fosters innovation. \n \nSpecialties: ·\tFamiliar with both desktop applications & web based applications \n·\tTeam Collaboration software \n·\tModeling solutions (UML, BPMN, IDE, etc) \n·\tMiddleware \n·\tUsability focused design \n·\tCreative and innovative solutions Summary Product development manager experienced with full lifecycle: requirements analysis, feature set definition, product launching, packaging and maintenance. Worked in multi time zone, multi culture environment. Managed projects involving assessment, acquisition and integration of various technology solutions. Built teams. Strong technology background. Enjoys and fosters innovation. \n \nSpecialties: ·\tFamiliar with both desktop applications & web based applications \n·\tTeam Collaboration software \n·\tModeling solutions (UML, BPMN, IDE, etc) \n·\tMiddleware \n·\tUsability focused design \n·\tCreative and innovative solutions Product development manager experienced with full lifecycle: requirements analysis, feature set definition, product launching, packaging and maintenance. Worked in multi time zone, multi culture environment. Managed projects involving assessment, acquisition and integration of various technology solutions. Built teams. Strong technology background. Enjoys and fosters innovation. \n \nSpecialties: ·\tFamiliar with both desktop applications & web based applications \n·\tTeam Collaboration software \n·\tModeling solutions (UML, BPMN, IDE, etc) \n·\tMiddleware \n·\tUsability focused design \n·\tCreative and innovative solutions Product development manager experienced with full lifecycle: requirements analysis, feature set definition, product launching, packaging and maintenance. Worked in multi time zone, multi culture environment. Managed projects involving assessment, acquisition and integration of various technology solutions. Built teams. Strong technology background. Enjoys and fosters innovation. \n \nSpecialties: ·\tFamiliar with both desktop applications & web based applications \n·\tTeam Collaboration software \n·\tModeling solutions (UML, BPMN, IDE, etc) \n·\tMiddleware \n·\tUsability focused design \n·\tCreative and innovative solutions Skills Middleware BPMN IDE Requirements Management UML Creative Solutions System Architecture Enterprise Architecture Software Engineering Software Development Agile Methodologies Architecture Requirements Analysis TOGAF Software Design Skills  Middleware BPMN IDE Requirements Management UML Creative Solutions System Architecture Enterprise Architecture Software Engineering Software Development Agile Methodologies Architecture Requirements Analysis TOGAF Software Design Middleware BPMN IDE Requirements Management UML Creative Solutions System Architecture Enterprise Architecture Software Engineering Software Development Agile Methodologies Architecture Requirements Analysis TOGAF Software Design Middleware BPMN IDE Requirements Management UML Creative Solutions System Architecture Enterprise Architecture Software Engineering Software Development Agile Methodologies Architecture Requirements Analysis TOGAF Software Design ", "Summary PROFILE \n \n•\tOver 15 years of experience which includes projects for migration, integration and technical support of Client/Server hardware and software configuration, Windows Server (2012/2008/2003), Windows XP/VISTA/7/8 administration, MDT 2012/2010, SCCM2007/2012, SCOM, image build using different Imaging Technology, Scripting, software packaging and deployment in Active Directory based Infrastructure, administration of Wintel as well as UNIX/Linux, SAMBA v3/v4, Group Policy Management, SQL Server/ORACLE, IIS/APACHE, Exchange Server, Clustering, Network Load Balancing, DHCP, DNS, WDS/RIS, WINS, Firewall, Router, Switch, VPN, iSCSI/FC SAN, Virtualization using VMware/Hyper-V, VDI, APP-V, XenDesktop, AppSense, Antivirus, different network vulnerability analysis, monitoring and management systems as well as tools. \n \n•\tExperience in IT Services Delivery and Support functions based on ITIL framework, Change Management, Data Centre Services, Quality Assurance Testing / User Acceptance Testing in Development and Test LAB environment, Capacity planning and performance management, Disaster Recovery Planning, risk assessment and security administration to ensure safe, secure and reliable computing environment, User Support, Documentation of procedures and guidelines. \n \n•\tMicrosoft Certified Systems Engineer (MCSE), Microsoft E-Learning Training on Hyper-V, Terminal Services in Windows Server 2008, APP-V, Training on CISSP Course, Training on Information Systems Audit, Training on Quality Assurance, Health and Safety Programs etc. Summary PROFILE \n \n•\tOver 15 years of experience which includes projects for migration, integration and technical support of Client/Server hardware and software configuration, Windows Server (2012/2008/2003), Windows XP/VISTA/7/8 administration, MDT 2012/2010, SCCM2007/2012, SCOM, image build using different Imaging Technology, Scripting, software packaging and deployment in Active Directory based Infrastructure, administration of Wintel as well as UNIX/Linux, SAMBA v3/v4, Group Policy Management, SQL Server/ORACLE, IIS/APACHE, Exchange Server, Clustering, Network Load Balancing, DHCP, DNS, WDS/RIS, WINS, Firewall, Router, Switch, VPN, iSCSI/FC SAN, Virtualization using VMware/Hyper-V, VDI, APP-V, XenDesktop, AppSense, Antivirus, different network vulnerability analysis, monitoring and management systems as well as tools. \n \n•\tExperience in IT Services Delivery and Support functions based on ITIL framework, Change Management, Data Centre Services, Quality Assurance Testing / User Acceptance Testing in Development and Test LAB environment, Capacity planning and performance management, Disaster Recovery Planning, risk assessment and security administration to ensure safe, secure and reliable computing environment, User Support, Documentation of procedures and guidelines. \n \n•\tMicrosoft Certified Systems Engineer (MCSE), Microsoft E-Learning Training on Hyper-V, Terminal Services in Windows Server 2008, APP-V, Training on CISSP Course, Training on Information Systems Audit, Training on Quality Assurance, Health and Safety Programs etc. PROFILE \n \n•\tOver 15 years of experience which includes projects for migration, integration and technical support of Client/Server hardware and software configuration, Windows Server (2012/2008/2003), Windows XP/VISTA/7/8 administration, MDT 2012/2010, SCCM2007/2012, SCOM, image build using different Imaging Technology, Scripting, software packaging and deployment in Active Directory based Infrastructure, administration of Wintel as well as UNIX/Linux, SAMBA v3/v4, Group Policy Management, SQL Server/ORACLE, IIS/APACHE, Exchange Server, Clustering, Network Load Balancing, DHCP, DNS, WDS/RIS, WINS, Firewall, Router, Switch, VPN, iSCSI/FC SAN, Virtualization using VMware/Hyper-V, VDI, APP-V, XenDesktop, AppSense, Antivirus, different network vulnerability analysis, monitoring and management systems as well as tools. \n \n•\tExperience in IT Services Delivery and Support functions based on ITIL framework, Change Management, Data Centre Services, Quality Assurance Testing / User Acceptance Testing in Development and Test LAB environment, Capacity planning and performance management, Disaster Recovery Planning, risk assessment and security administration to ensure safe, secure and reliable computing environment, User Support, Documentation of procedures and guidelines. \n \n•\tMicrosoft Certified Systems Engineer (MCSE), Microsoft E-Learning Training on Hyper-V, Terminal Services in Windows Server 2008, APP-V, Training on CISSP Course, Training on Information Systems Audit, Training on Quality Assurance, Health and Safety Programs etc. PROFILE \n \n•\tOver 15 years of experience which includes projects for migration, integration and technical support of Client/Server hardware and software configuration, Windows Server (2012/2008/2003), Windows XP/VISTA/7/8 administration, MDT 2012/2010, SCCM2007/2012, SCOM, image build using different Imaging Technology, Scripting, software packaging and deployment in Active Directory based Infrastructure, administration of Wintel as well as UNIX/Linux, SAMBA v3/v4, Group Policy Management, SQL Server/ORACLE, IIS/APACHE, Exchange Server, Clustering, Network Load Balancing, DHCP, DNS, WDS/RIS, WINS, Firewall, Router, Switch, VPN, iSCSI/FC SAN, Virtualization using VMware/Hyper-V, VDI, APP-V, XenDesktop, AppSense, Antivirus, different network vulnerability analysis, monitoring and management systems as well as tools. \n \n•\tExperience in IT Services Delivery and Support functions based on ITIL framework, Change Management, Data Centre Services, Quality Assurance Testing / User Acceptance Testing in Development and Test LAB environment, Capacity planning and performance management, Disaster Recovery Planning, risk assessment and security administration to ensure safe, secure and reliable computing environment, User Support, Documentation of procedures and guidelines. \n \n•\tMicrosoft Certified Systems Engineer (MCSE), Microsoft E-Learning Training on Hyper-V, Terminal Services in Windows Server 2008, APP-V, Training on CISSP Course, Training on Information Systems Audit, Training on Quality Assurance, Health and Safety Programs etc. Experience System Integration Sr. Speialist CompuCom February 2015  – Present (7 months) Mississauga, ON SCCM Consultant Softchoice Corporation October 2014  –  December 2014  (3 months) Oakville,Ontario IT Consultant KPMG April 2014  –  September 2014  (6 months) Toronto,Ontario Microsoft Desktop Engineer Sears Canada December 2013  –  February 2014  (3 months) Toonto,Ontario Account Solution Lead IBM Canada Ltd. February 2013  –  August 2013  (7 months) Markham,ON Sr.Windows Support Subject Matter Expert Hewlett-Packard April 2012  –  September 2012  (6 months) Toronto,ON Account Solution Lead IBM Canada Ltd. January 2011  –  March 2012  (1 year 3 months) Markham,ON Systems Analyst-Desktop Services Shoppers Drug Mart September 2010  –  December 2010  (4 months) Toronto,ON Sr.Desktop Analyst-Infrastructure Solutions Department CIBC Mellon February 2010  –  July 2010  (6 months) Toronto,ON Systems Analyst-Desktop Services Shoppers Drug Mart June 2009  –  December 2009  (7 months) QA-Configuration Management Services Compugen Inc. September 2008  –  June 2009  (10 months) Richmond Hill,ON Technical Analyst -TECHNOLOGY SERVICES DEPARTMENT Canadian Tire October 2007  –  May 2008  (8 months) Toronto,ON Technical Support Analyst CBC May 2007  –  July 2007  (3 months) Toronto,ON QA-Configuration Management Services Compugen September 2004  –  April 2007  (2 years 8 months) Richmond Hill,ON Manager Infrastructure & Systems Support, IT EASTERN BANK LIMITED, Bangladesh March 2002  –  March 2004  (2 years 1 month) Manager Systems & Communication, IT STANDARD CHARTERED BANK September 1995  –  February 2002  (6 years 6 months) Assistant Manager, Systems Support & Hardware Department DESKTOP COMPUTER CONNECTION LIMITED February 1991  –  August 1994  (3 years 7 months) System Integration Sr. Speialist CompuCom February 2015  – Present (7 months) Mississauga, ON System Integration Sr. Speialist CompuCom February 2015  – Present (7 months) Mississauga, ON SCCM Consultant Softchoice Corporation October 2014  –  December 2014  (3 months) Oakville,Ontario SCCM Consultant Softchoice Corporation October 2014  –  December 2014  (3 months) Oakville,Ontario IT Consultant KPMG April 2014  –  September 2014  (6 months) Toronto,Ontario IT Consultant KPMG April 2014  –  September 2014  (6 months) Toronto,Ontario Microsoft Desktop Engineer Sears Canada December 2013  –  February 2014  (3 months) Toonto,Ontario Microsoft Desktop Engineer Sears Canada December 2013  –  February 2014  (3 months) Toonto,Ontario Account Solution Lead IBM Canada Ltd. February 2013  –  August 2013  (7 months) Markham,ON Account Solution Lead IBM Canada Ltd. February 2013  –  August 2013  (7 months) Markham,ON Sr.Windows Support Subject Matter Expert Hewlett-Packard April 2012  –  September 2012  (6 months) Toronto,ON Sr.Windows Support Subject Matter Expert Hewlett-Packard April 2012  –  September 2012  (6 months) Toronto,ON Account Solution Lead IBM Canada Ltd. January 2011  –  March 2012  (1 year 3 months) Markham,ON Account Solution Lead IBM Canada Ltd. January 2011  –  March 2012  (1 year 3 months) Markham,ON Systems Analyst-Desktop Services Shoppers Drug Mart September 2010  –  December 2010  (4 months) Toronto,ON Systems Analyst-Desktop Services Shoppers Drug Mart September 2010  –  December 2010  (4 months) Toronto,ON Sr.Desktop Analyst-Infrastructure Solutions Department CIBC Mellon February 2010  –  July 2010  (6 months) Toronto,ON Sr.Desktop Analyst-Infrastructure Solutions Department CIBC Mellon February 2010  –  July 2010  (6 months) Toronto,ON Systems Analyst-Desktop Services Shoppers Drug Mart June 2009  –  December 2009  (7 months) Systems Analyst-Desktop Services Shoppers Drug Mart June 2009  –  December 2009  (7 months) QA-Configuration Management Services Compugen Inc. September 2008  –  June 2009  (10 months) Richmond Hill,ON QA-Configuration Management Services Compugen Inc. September 2008  –  June 2009  (10 months) Richmond Hill,ON Technical Analyst -TECHNOLOGY SERVICES DEPARTMENT Canadian Tire October 2007  –  May 2008  (8 months) Toronto,ON Technical Analyst -TECHNOLOGY SERVICES DEPARTMENT Canadian Tire October 2007  –  May 2008  (8 months) Toronto,ON Technical Support Analyst CBC May 2007  –  July 2007  (3 months) Toronto,ON Technical Support Analyst CBC May 2007  –  July 2007  (3 months) Toronto,ON QA-Configuration Management Services Compugen September 2004  –  April 2007  (2 years 8 months) Richmond Hill,ON QA-Configuration Management Services Compugen September 2004  –  April 2007  (2 years 8 months) Richmond Hill,ON Manager Infrastructure & Systems Support, IT EASTERN BANK LIMITED, Bangladesh March 2002  –  March 2004  (2 years 1 month) Manager Infrastructure & Systems Support, IT EASTERN BANK LIMITED, Bangladesh March 2002  –  March 2004  (2 years 1 month) Manager Systems & Communication, IT STANDARD CHARTERED BANK September 1995  –  February 2002  (6 years 6 months) Manager Systems & Communication, IT STANDARD CHARTERED BANK September 1995  –  February 2002  (6 years 6 months) Assistant Manager, Systems Support & Hardware Department DESKTOP COMPUTER CONNECTION LIMITED February 1991  –  August 1994  (3 years 7 months) Assistant Manager, Systems Support & Hardware Department DESKTOP COMPUTER CONNECTION LIMITED February 1991  –  August 1994  (3 years 7 months) Skills Server/Desktop/Network... Technology architecture... Virtualization SCCM, APP-V WIndows Server LINUX/UNIX SAN/NAS Hyper-V / VMWARE Clustering, Network... Self-motivated Team... Hands-on Problem Solver DHCP Windows Server VMware Active Directory Skills  Server/Desktop/Network... Technology architecture... Virtualization SCCM, APP-V WIndows Server LINUX/UNIX SAN/NAS Hyper-V / VMWARE Clustering, Network... Self-motivated Team... Hands-on Problem Solver DHCP Windows Server VMware Active Directory Server/Desktop/Network... Technology architecture... Virtualization SCCM, APP-V WIndows Server LINUX/UNIX SAN/NAS Hyper-V / VMWARE Clustering, Network... Self-motivated Team... Hands-on Problem Solver DHCP Windows Server VMware Active Directory Server/Desktop/Network... Technology architecture... Virtualization SCCM, APP-V WIndows Server LINUX/UNIX SAN/NAS Hyper-V / VMWARE Clustering, Network... Self-motivated Team... Hands-on Problem Solver DHCP Windows Server VMware Active Directory Education UNIVERSITY OF DHAKA Master of Science,  Applied Physics & Electronics UNIVERSITY OF DHAKA Master of Science,  Applied Physics & Electronics UNIVERSITY OF DHAKA Master of Science,  Applied Physics & Electronics UNIVERSITY OF DHAKA Master of Science,  Applied Physics & Electronics ", "Summary •\tGoal-oriented & strategic thinking professional with 9 years of Supply Chain & transportation/Logistics consulting experience. Solved strategic & tactical challenges of clients across multiple verticals.  \n•\tDesigned/Deployed processes and solutions for clients across multiple geographies. \n•\tArchitected complex Supply Chain Solutions & Transportation Modeling/Optimization. \n•\tExtensive experience in – SAP TM/ EM/ EWM/ GTS/ SD/ CRM and i2/JDA Supply Chain product suites.  \n•\tIn-depth experience on 2 industry leading Transportation Mgmt. Solutions (SAP TM & i2/JDA TM).  \n•\tWell-versed with 3PL Air/Ocean & Shipper scenarios (import/export, customs/security filing, Tendering) and Liner Industry. \n•\tVast know-how of consumer goods industry globally (Proctor & Gamble, Pepsico, etc) and LSPs’. \n•\tGood understanding of BRF+/SAP TM BOPF structure, customizing, complex interfaces, etc. \n•\tInstrumental in pre-sales activities (POCs’/RFPs’), delivering demos. SAP TM Trainer to IBM for DHL. \n• Certifications - SAP TM(9.0/8.0), SAP BPX, CPIM-APICS Summary •\tGoal-oriented & strategic thinking professional with 9 years of Supply Chain & transportation/Logistics consulting experience. Solved strategic & tactical challenges of clients across multiple verticals.  \n•\tDesigned/Deployed processes and solutions for clients across multiple geographies. \n•\tArchitected complex Supply Chain Solutions & Transportation Modeling/Optimization. \n•\tExtensive experience in – SAP TM/ EM/ EWM/ GTS/ SD/ CRM and i2/JDA Supply Chain product suites.  \n•\tIn-depth experience on 2 industry leading Transportation Mgmt. Solutions (SAP TM & i2/JDA TM).  \n•\tWell-versed with 3PL Air/Ocean & Shipper scenarios (import/export, customs/security filing, Tendering) and Liner Industry. \n•\tVast know-how of consumer goods industry globally (Proctor & Gamble, Pepsico, etc) and LSPs’. \n•\tGood understanding of BRF+/SAP TM BOPF structure, customizing, complex interfaces, etc. \n•\tInstrumental in pre-sales activities (POCs’/RFPs’), delivering demos. SAP TM Trainer to IBM for DHL. \n• Certifications - SAP TM(9.0/8.0), SAP BPX, CPIM-APICS •\tGoal-oriented & strategic thinking professional with 9 years of Supply Chain & transportation/Logistics consulting experience. Solved strategic & tactical challenges of clients across multiple verticals.  \n•\tDesigned/Deployed processes and solutions for clients across multiple geographies. \n•\tArchitected complex Supply Chain Solutions & Transportation Modeling/Optimization. \n•\tExtensive experience in – SAP TM/ EM/ EWM/ GTS/ SD/ CRM and i2/JDA Supply Chain product suites.  \n•\tIn-depth experience on 2 industry leading Transportation Mgmt. Solutions (SAP TM & i2/JDA TM).  \n•\tWell-versed with 3PL Air/Ocean & Shipper scenarios (import/export, customs/security filing, Tendering) and Liner Industry. \n•\tVast know-how of consumer goods industry globally (Proctor & Gamble, Pepsico, etc) and LSPs’. \n•\tGood understanding of BRF+/SAP TM BOPF structure, customizing, complex interfaces, etc. \n•\tInstrumental in pre-sales activities (POCs’/RFPs’), delivering demos. SAP TM Trainer to IBM for DHL. \n• Certifications - SAP TM(9.0/8.0), SAP BPX, CPIM-APICS •\tGoal-oriented & strategic thinking professional with 9 years of Supply Chain & transportation/Logistics consulting experience. Solved strategic & tactical challenges of clients across multiple verticals.  \n•\tDesigned/Deployed processes and solutions for clients across multiple geographies. \n•\tArchitected complex Supply Chain Solutions & Transportation Modeling/Optimization. \n•\tExtensive experience in – SAP TM/ EM/ EWM/ GTS/ SD/ CRM and i2/JDA Supply Chain product suites.  \n•\tIn-depth experience on 2 industry leading Transportation Mgmt. Solutions (SAP TM & i2/JDA TM).  \n•\tWell-versed with 3PL Air/Ocean & Shipper scenarios (import/export, customs/security filing, Tendering) and Liner Industry. \n•\tVast know-how of consumer goods industry globally (Proctor & Gamble, Pepsico, etc) and LSPs’. \n•\tGood understanding of BRF+/SAP TM BOPF structure, customizing, complex interfaces, etc. \n•\tInstrumental in pre-sales activities (POCs’/RFPs’), delivering demos. SAP TM Trainer to IBM for DHL. \n• Certifications - SAP TM(9.0/8.0), SAP BPX, CPIM-APICS Experience SAP TM Process Lead IBM February 2015  – Present (7 months) Bengaluru Area, India Working as a Process Lead for EDI/Manifest Solution for Neptune Orient Lines (NOL). SAP TM SME/Solution Lead IBM December 2013  –  February 2014  (3 months) Singapore Working as a SME/Solution Lead for Rollouts for DHL Global Forwarding in Singapore Hub. SAP Transportation Management (TM) Consultant IBM February 2012  –  December 2013  (1 year 11 months) Bonn Area, Germany Worked as a SAP TM Consultant for 'DHL Global Forwarding SAP TM 9.0 Global Template Solution Implementation'. Business Processes Consultant - Transportation & Logistics SAP February 2011  –  February 2012  (1 year 1 month) Senior Business Consultant - Transportation Practice JDA Software October 2006  –  February 2011  (4 years 5 months) Information & Communication Technology Engineer (Trainee) Sterling Telecom & Net Systems Limited July 2004  –  November 2004  (5 months) SAP TM Process Lead IBM February 2015  – Present (7 months) Bengaluru Area, India Working as a Process Lead for EDI/Manifest Solution for Neptune Orient Lines (NOL). SAP TM Process Lead IBM February 2015  – Present (7 months) Bengaluru Area, India Working as a Process Lead for EDI/Manifest Solution for Neptune Orient Lines (NOL). SAP TM SME/Solution Lead IBM December 2013  –  February 2014  (3 months) Singapore Working as a SME/Solution Lead for Rollouts for DHL Global Forwarding in Singapore Hub. SAP TM SME/Solution Lead IBM December 2013  –  February 2014  (3 months) Singapore Working as a SME/Solution Lead for Rollouts for DHL Global Forwarding in Singapore Hub. SAP Transportation Management (TM) Consultant IBM February 2012  –  December 2013  (1 year 11 months) Bonn Area, Germany Worked as a SAP TM Consultant for 'DHL Global Forwarding SAP TM 9.0 Global Template Solution Implementation'. SAP Transportation Management (TM) Consultant IBM February 2012  –  December 2013  (1 year 11 months) Bonn Area, Germany Worked as a SAP TM Consultant for 'DHL Global Forwarding SAP TM 9.0 Global Template Solution Implementation'. Business Processes Consultant - Transportation & Logistics SAP February 2011  –  February 2012  (1 year 1 month) Business Processes Consultant - Transportation & Logistics SAP February 2011  –  February 2012  (1 year 1 month) Senior Business Consultant - Transportation Practice JDA Software October 2006  –  February 2011  (4 years 5 months) Senior Business Consultant - Transportation Practice JDA Software October 2006  –  February 2011  (4 years 5 months) Information & Communication Technology Engineer (Trainee) Sterling Telecom & Net Systems Limited July 2004  –  November 2004  (5 months) Information & Communication Technology Engineer (Trainee) Sterling Telecom & Net Systems Limited July 2004  –  November 2004  (5 months) Skills SDLC Strategy Software Project... Requirements Gathering Supply Chain Consulting Requirements Analysis ERP Process Consulting Change Management Pre-sales Business Process Business Analysis Master Data Management Logistics Consulting Solution Architecture SOA Enterprise Software Integration SAP Business Intelligence Enterprise Architecture Business Process Design Management Consulting Agile Methodologies Business Process... IT Strategy Supply Chain Program Management Business Transformation Project Management Supply Chain Management Business Process... Gap Analysis Software Development See 20+     See less Skills  SDLC Strategy Software Project... Requirements Gathering Supply Chain Consulting Requirements Analysis ERP Process Consulting Change Management Pre-sales Business Process Business Analysis Master Data Management Logistics Consulting Solution Architecture SOA Enterprise Software Integration SAP Business Intelligence Enterprise Architecture Business Process Design Management Consulting Agile Methodologies Business Process... IT Strategy Supply Chain Program Management Business Transformation Project Management Supply Chain Management Business Process... Gap Analysis Software Development See 20+     See less SDLC Strategy Software Project... Requirements Gathering Supply Chain Consulting Requirements Analysis ERP Process Consulting Change Management Pre-sales Business Process Business Analysis Master Data Management Logistics Consulting Solution Architecture SOA Enterprise Software Integration SAP Business Intelligence Enterprise Architecture Business Process Design Management Consulting Agile Methodologies Business Process... IT Strategy Supply Chain Program Management Business Transformation Project Management Supply Chain Management Business Process... Gap Analysis Software Development See 20+     See less SDLC Strategy Software Project... Requirements Gathering Supply Chain Consulting Requirements Analysis ERP Process Consulting Change Management Pre-sales Business Process Business Analysis Master Data Management Logistics Consulting Solution Architecture SOA Enterprise Software Integration SAP Business Intelligence Enterprise Architecture Business Process Design Management Consulting Agile Methodologies Business Process... IT Strategy Supply Chain Program Management Business Transformation Project Management Supply Chain Management Business Process... Gap Analysis Software Development See 20+     See less Education S.P. Jain Institute of Management & Research M.B.A,  Systems Management 2005  – 2007 Activities and Societies:  SAP:\nCertified in SAP Transportation Management (TM)\nCertified in SAP Business Process Expert (BPX)\nCPIM:\nCertified in Basics of Supply Chain Management (BSCM) module by APICS.\nCertified in Master Planning of Resources (MPR) module by APICS Virginia Polytechnic Institute and State University Masters in Information Technology 2005  – 2007 University of Rajasthan B.E,  Computer Science & Engineering 2000  – 2004 S.P. Jain Institute of Management & Research M.B.A,  Systems Management 2005  – 2007 Activities and Societies:  SAP:\nCertified in SAP Transportation Management (TM)\nCertified in SAP Business Process Expert (BPX)\nCPIM:\nCertified in Basics of Supply Chain Management (BSCM) module by APICS.\nCertified in Master Planning of Resources (MPR) module by APICS S.P. Jain Institute of Management & Research M.B.A,  Systems Management 2005  – 2007 Activities and Societies:  SAP:\nCertified in SAP Transportation Management (TM)\nCertified in SAP Business Process Expert (BPX)\nCPIM:\nCertified in Basics of Supply Chain Management (BSCM) module by APICS.\nCertified in Master Planning of Resources (MPR) module by APICS S.P. Jain Institute of Management & Research M.B.A,  Systems Management 2005  – 2007 Activities and Societies:  SAP:\nCertified in SAP Transportation Management (TM)\nCertified in SAP Business Process Expert (BPX)\nCPIM:\nCertified in Basics of Supply Chain Management (BSCM) module by APICS.\nCertified in Master Planning of Resources (MPR) module by APICS Virginia Polytechnic Institute and State University Masters in Information Technology 2005  – 2007 Virginia Polytechnic Institute and State University Masters in Information Technology 2005  – 2007 Virginia Polytechnic Institute and State University Masters in Information Technology 2005  – 2007 University of Rajasthan B.E,  Computer Science & Engineering 2000  – 2004 University of Rajasthan B.E,  Computer Science & Engineering 2000  – 2004 University of Rajasthan B.E,  Computer Science & Engineering 2000  – 2004 ", "Skills Telecommunications Embedded Software Product Management Medicine Cloud Computing Mobile Applications Marketing Communications Management Strategic Alliances Managed Services Market Research Marketing Strategy Hardware Integration Strategy Professional Services Start-ups Channel Partners Software Development Business Alliances Product Marketing Strategic Planning Software Project... Strategic Partnerships Go-to-market Strategy Leadership Business Strategy Mergers & Acquisitions Integrated Marketing Solution Selling Marketing Management SaaS Electronics Networking Business Development Pre-sales Wireless Team Management Channel Marketing Mobile Technology Embedded Systems New Business Development Mobile Devices IT Strategy IP Cross-functional Team... See 32+     See less Skills  Telecommunications Embedded Software Product Management Medicine Cloud Computing Mobile Applications Marketing Communications Management Strategic Alliances Managed Services Market Research Marketing Strategy Hardware Integration Strategy Professional Services Start-ups Channel Partners Software Development Business Alliances Product Marketing Strategic Planning Software Project... Strategic Partnerships Go-to-market Strategy Leadership Business Strategy Mergers & Acquisitions Integrated Marketing Solution Selling Marketing Management SaaS Electronics Networking Business Development Pre-sales Wireless Team Management Channel Marketing Mobile Technology Embedded Systems New Business Development Mobile Devices IT Strategy IP Cross-functional Team... See 32+     See less Telecommunications Embedded Software Product Management Medicine Cloud Computing Mobile Applications Marketing Communications Management Strategic Alliances Managed Services Market Research Marketing Strategy Hardware Integration Strategy Professional Services Start-ups Channel Partners Software Development Business Alliances Product Marketing Strategic Planning Software Project... Strategic Partnerships Go-to-market Strategy Leadership Business Strategy Mergers & Acquisitions Integrated Marketing Solution Selling Marketing Management SaaS Electronics Networking Business Development Pre-sales Wireless Team Management Channel Marketing Mobile Technology Embedded Systems New Business Development Mobile Devices IT Strategy IP Cross-functional Team... See 32+     See less Telecommunications Embedded Software Product Management Medicine Cloud Computing Mobile Applications Marketing Communications Management Strategic Alliances Managed Services Market Research Marketing Strategy Hardware Integration Strategy Professional Services Start-ups Channel Partners Software Development Business Alliances Product Marketing Strategic Planning Software Project... Strategic Partnerships Go-to-market Strategy Leadership Business Strategy Mergers & Acquisitions Integrated Marketing Solution Selling Marketing Management SaaS Electronics Networking Business Development Pre-sales Wireless Team Management Channel Marketing Mobile Technology Embedded Systems New Business Development Mobile Devices IT Strategy IP Cross-functional Team... See 32+     See less ", "Experience Account Solution Lead IBM December 2003  –  June 2014  (10 years 7 months) Account Solution Lead IBM December 2003  –  June 2014  (10 years 7 months) Account Solution Lead IBM December 2003  –  June 2014  (10 years 7 months) Skills Lotus Notes Project Management System Administration SAP Microsoft Office Business Analysis Management Team Leadership Databases Windows Microsoft Excel SQL Java ITIL Customer Service Skills  Lotus Notes Project Management System Administration SAP Microsoft Office Business Analysis Management Team Leadership Databases Windows Microsoft Excel SQL Java ITIL Customer Service Lotus Notes Project Management System Administration SAP Microsoft Office Business Analysis Management Team Leadership Databases Windows Microsoft Excel SQL Java ITIL Customer Service Lotus Notes Project Management System Administration SAP Microsoft Office Business Analysis Management Team Leadership Databases Windows Microsoft Excel SQL Java ITIL Customer Service Education Pace University-Pleasantville/Briarcliff Campus Bachelor of Science in Computer Science Pace University-Pleasantville/Briarcliff Campus Bachelor of Science in Computer Science Pace University-Pleasantville/Briarcliff Campus Bachelor of Science in Computer Science Pace University-Pleasantville/Briarcliff Campus Bachelor of Science in Computer Science ", "Summary Bikram Dasgupta has several years of experience in Pre-Sales, Solutioning ,Practice & Competency Leadership, Program and Delivery Management in both Consulting and Managed Services across various Services, Sectors and Industries. He has worked with top clients and project environments, providing him with invaluable experience to succeed under challenging conditions/scenarios.  \n \nAs a Certified Project Manager, he had an opportunity to manage both domestic and international engagements and played interesting roles. Bikram is also certified technology consultant - allowing him to provide deep technical insight on new opportunities and review solution feasibility.  \n \nBikram enjoys interacting with his team and clients, providing him opportunities to learn and improve from their feedback constantly. \n \nSpecialties: Engagement Expertise \n·\tLeading Business Units/Groups \n. Leading Large Program and Account  \n·\tComplex Project Management \n. Solutioning (Pre-sales) \n.\tLeading Managed Services \n·\tManagement Business Consulting \n. People Management Summary Bikram Dasgupta has several years of experience in Pre-Sales, Solutioning ,Practice & Competency Leadership, Program and Delivery Management in both Consulting and Managed Services across various Services, Sectors and Industries. He has worked with top clients and project environments, providing him with invaluable experience to succeed under challenging conditions/scenarios.  \n \nAs a Certified Project Manager, he had an opportunity to manage both domestic and international engagements and played interesting roles. Bikram is also certified technology consultant - allowing him to provide deep technical insight on new opportunities and review solution feasibility.  \n \nBikram enjoys interacting with his team and clients, providing him opportunities to learn and improve from their feedback constantly. \n \nSpecialties: Engagement Expertise \n·\tLeading Business Units/Groups \n. Leading Large Program and Account  \n·\tComplex Project Management \n. Solutioning (Pre-sales) \n.\tLeading Managed Services \n·\tManagement Business Consulting \n. People Management Bikram Dasgupta has several years of experience in Pre-Sales, Solutioning ,Practice & Competency Leadership, Program and Delivery Management in both Consulting and Managed Services across various Services, Sectors and Industries. He has worked with top clients and project environments, providing him with invaluable experience to succeed under challenging conditions/scenarios.  \n \nAs a Certified Project Manager, he had an opportunity to manage both domestic and international engagements and played interesting roles. Bikram is also certified technology consultant - allowing him to provide deep technical insight on new opportunities and review solution feasibility.  \n \nBikram enjoys interacting with his team and clients, providing him opportunities to learn and improve from their feedback constantly. \n \nSpecialties: Engagement Expertise \n·\tLeading Business Units/Groups \n. Leading Large Program and Account  \n·\tComplex Project Management \n. Solutioning (Pre-sales) \n.\tLeading Managed Services \n·\tManagement Business Consulting \n. People Management Bikram Dasgupta has several years of experience in Pre-Sales, Solutioning ,Practice & Competency Leadership, Program and Delivery Management in both Consulting and Managed Services across various Services, Sectors and Industries. He has worked with top clients and project environments, providing him with invaluable experience to succeed under challenging conditions/scenarios.  \n \nAs a Certified Project Manager, he had an opportunity to manage both domestic and international engagements and played interesting roles. Bikram is also certified technology consultant - allowing him to provide deep technical insight on new opportunities and review solution feasibility.  \n \nBikram enjoys interacting with his team and clients, providing him opportunities to learn and improve from their feedback constantly. \n \nSpecialties: Engagement Expertise \n·\tLeading Business Units/Groups \n. Leading Large Program and Account  \n·\tComplex Project Management \n. Solutioning (Pre-sales) \n.\tLeading Managed Services \n·\tManagement Business Consulting \n. People Management Experience Demand & Solution Lead IBM July 2014  – Present (1 year 2 months) United Kingdon Leading the following services for a premier Telecom Retailer \n \nDemand Management Core Service: \nThis service ensures that ideas raised by the business are properly scoped, costed, and delivered to the implementation team in a timely fashion and with the appropriate details required by the development teams together with appropriate impact assessments and solution design documents and business / technical requirements. \n \nTechnical Service:  \nThis is for the operation of a Centre of Excellence team to ensure that all deliverables are in alignment with Client business, architecture, security, and quality standards. The service will be involved in all areas of the project lifecycle from idea through to service introduction and are accountable for the solution Business Development Lead IBM Global Business Services May 2013  –  June 2014  (1 year 2 months) Sweden, India As a Consulting Business Development Lead, I am responsible for the following  \n \n•\tInitial qualification involving new and/or emerging business opportunities.  \n•\tCo-ordinate with IBM sales and marketing extended teams as well as customer/prospect executives/delivery executives to determine if an opportunity should be developed, transferred to another IBM provider or partner, or formally closed out as an invalid business opportunity.  \n•\tResponsible for creating and building relationships that will result in additional revenue and revenue opportunity within the geography or enterprise. \n•\tOperate as an expert in identifying and building discipline/specialty offerings/solutions in new markets.  \n•\tLead multifunctional teams to develop and close leading-edge, high-risk opportunities, planning and executing negotiations with all levels of customer/prospect management, including senior executive management.  \n•\tUse various IBM tools and metrics and financial analysis techniques in the opportunity qualification and assessment process.  \n•\tUnderstand IBM's strategies, organization and processes and is acknowledged by peers, senior management inside and outside IBM, as an expert in emerging industries (e.g., Internet and Web-based business and commerce, etc.).  \n•\tAct as a mentor to less experienced professionals within and outside the profession.  \n•\tExhibit entrepreneurial behavior with customers/prospects to instill confidence that IBM is committed to building solid relationships in new/emerging market spaces. Service Delivery Leader IBM Global Business Services July 2010  –  April 2013  (2 years 10 months) Service Delivery Leader for Oracle EBusiness, PeopleSoft & Fusion Middleware - Assembly Application & Optimization from India Advisory Project Manager IBM March 2007  –  July 2010  (3 years 5 months) Advisory Project Manager, Industrial (Chemicals & Petroleum) & General Business. Service Delivery Manager Oracle Corporation March 2004  –  March 2007  (3 years 1 month) Bangalore, US As a Service Delivery Manager in Oracle, I was involved in the following activities.  \n• Delivery Management (Project Start Up, Project Planning and \nExecution, Project Closure) – in line with ITIL Framework \n• Offshore Delivery Project Coordination with various Oracle Consulting Units and clients \n• Bid Reviews, Estimation, Negotiations \n• Transition Management (Start up Process) \n• Business Development - Up selling or extend service duration \n• Handling Operations (Recruitment, Leaves, Expenses, Bonus, Salary, \nRetention, Training, managing performance of directs and 3rd Party Vendor) \n• Process Improvement and contribution towards CMM I initiative \n• Customer Satisfaction and Escalation handling \n• Drive Quality Management - Entire Practice/Processes \n• Account Management (Cost Transfer, Contract Management) \n• Contributes towards the practice growth and service offerings \n• Anticipates the impact of new technology/ methods – New Service Offerings. Demand & Solution Lead IBM July 2014  – Present (1 year 2 months) United Kingdon Leading the following services for a premier Telecom Retailer \n \nDemand Management Core Service: \nThis service ensures that ideas raised by the business are properly scoped, costed, and delivered to the implementation team in a timely fashion and with the appropriate details required by the development teams together with appropriate impact assessments and solution design documents and business / technical requirements. \n \nTechnical Service:  \nThis is for the operation of a Centre of Excellence team to ensure that all deliverables are in alignment with Client business, architecture, security, and quality standards. The service will be involved in all areas of the project lifecycle from idea through to service introduction and are accountable for the solution Demand & Solution Lead IBM July 2014  – Present (1 year 2 months) United Kingdon Leading the following services for a premier Telecom Retailer \n \nDemand Management Core Service: \nThis service ensures that ideas raised by the business are properly scoped, costed, and delivered to the implementation team in a timely fashion and with the appropriate details required by the development teams together with appropriate impact assessments and solution design documents and business / technical requirements. \n \nTechnical Service:  \nThis is for the operation of a Centre of Excellence team to ensure that all deliverables are in alignment with Client business, architecture, security, and quality standards. The service will be involved in all areas of the project lifecycle from idea through to service introduction and are accountable for the solution Business Development Lead IBM Global Business Services May 2013  –  June 2014  (1 year 2 months) Sweden, India As a Consulting Business Development Lead, I am responsible for the following  \n \n•\tInitial qualification involving new and/or emerging business opportunities.  \n•\tCo-ordinate with IBM sales and marketing extended teams as well as customer/prospect executives/delivery executives to determine if an opportunity should be developed, transferred to another IBM provider or partner, or formally closed out as an invalid business opportunity.  \n•\tResponsible for creating and building relationships that will result in additional revenue and revenue opportunity within the geography or enterprise. \n•\tOperate as an expert in identifying and building discipline/specialty offerings/solutions in new markets.  \n•\tLead multifunctional teams to develop and close leading-edge, high-risk opportunities, planning and executing negotiations with all levels of customer/prospect management, including senior executive management.  \n•\tUse various IBM tools and metrics and financial analysis techniques in the opportunity qualification and assessment process.  \n•\tUnderstand IBM's strategies, organization and processes and is acknowledged by peers, senior management inside and outside IBM, as an expert in emerging industries (e.g., Internet and Web-based business and commerce, etc.).  \n•\tAct as a mentor to less experienced professionals within and outside the profession.  \n•\tExhibit entrepreneurial behavior with customers/prospects to instill confidence that IBM is committed to building solid relationships in new/emerging market spaces. Business Development Lead IBM Global Business Services May 2013  –  June 2014  (1 year 2 months) Sweden, India As a Consulting Business Development Lead, I am responsible for the following  \n \n•\tInitial qualification involving new and/or emerging business opportunities.  \n•\tCo-ordinate with IBM sales and marketing extended teams as well as customer/prospect executives/delivery executives to determine if an opportunity should be developed, transferred to another IBM provider or partner, or formally closed out as an invalid business opportunity.  \n•\tResponsible for creating and building relationships that will result in additional revenue and revenue opportunity within the geography or enterprise. \n•\tOperate as an expert in identifying and building discipline/specialty offerings/solutions in new markets.  \n•\tLead multifunctional teams to develop and close leading-edge, high-risk opportunities, planning and executing negotiations with all levels of customer/prospect management, including senior executive management.  \n•\tUse various IBM tools and metrics and financial analysis techniques in the opportunity qualification and assessment process.  \n•\tUnderstand IBM's strategies, organization and processes and is acknowledged by peers, senior management inside and outside IBM, as an expert in emerging industries (e.g., Internet and Web-based business and commerce, etc.).  \n•\tAct as a mentor to less experienced professionals within and outside the profession.  \n•\tExhibit entrepreneurial behavior with customers/prospects to instill confidence that IBM is committed to building solid relationships in new/emerging market spaces. Service Delivery Leader IBM Global Business Services July 2010  –  April 2013  (2 years 10 months) Service Delivery Leader for Oracle EBusiness, PeopleSoft & Fusion Middleware - Assembly Application & Optimization from India Service Delivery Leader IBM Global Business Services July 2010  –  April 2013  (2 years 10 months) Service Delivery Leader for Oracle EBusiness, PeopleSoft & Fusion Middleware - Assembly Application & Optimization from India Advisory Project Manager IBM March 2007  –  July 2010  (3 years 5 months) Advisory Project Manager, Industrial (Chemicals & Petroleum) & General Business. Advisory Project Manager IBM March 2007  –  July 2010  (3 years 5 months) Advisory Project Manager, Industrial (Chemicals & Petroleum) & General Business. Service Delivery Manager Oracle Corporation March 2004  –  March 2007  (3 years 1 month) Bangalore, US As a Service Delivery Manager in Oracle, I was involved in the following activities.  \n• Delivery Management (Project Start Up, Project Planning and \nExecution, Project Closure) – in line with ITIL Framework \n• Offshore Delivery Project Coordination with various Oracle Consulting Units and clients \n• Bid Reviews, Estimation, Negotiations \n• Transition Management (Start up Process) \n• Business Development - Up selling or extend service duration \n• Handling Operations (Recruitment, Leaves, Expenses, Bonus, Salary, \nRetention, Training, managing performance of directs and 3rd Party Vendor) \n• Process Improvement and contribution towards CMM I initiative \n• Customer Satisfaction and Escalation handling \n• Drive Quality Management - Entire Practice/Processes \n• Account Management (Cost Transfer, Contract Management) \n• Contributes towards the practice growth and service offerings \n• Anticipates the impact of new technology/ methods – New Service Offerings. Service Delivery Manager Oracle Corporation March 2004  –  March 2007  (3 years 1 month) Bangalore, US As a Service Delivery Manager in Oracle, I was involved in the following activities.  \n• Delivery Management (Project Start Up, Project Planning and \nExecution, Project Closure) – in line with ITIL Framework \n• Offshore Delivery Project Coordination with various Oracle Consulting Units and clients \n• Bid Reviews, Estimation, Negotiations \n• Transition Management (Start up Process) \n• Business Development - Up selling or extend service duration \n• Handling Operations (Recruitment, Leaves, Expenses, Bonus, Salary, \nRetention, Training, managing performance of directs and 3rd Party Vendor) \n• Process Improvement and contribution towards CMM I initiative \n• Customer Satisfaction and Escalation handling \n• Drive Quality Management - Entire Practice/Processes \n• Account Management (Cost Transfer, Contract Management) \n• Contributes towards the practice growth and service offerings \n• Anticipates the impact of new technology/ methods – New Service Offerings. Skills Project Management Oracle Applications Practice Management &... Management Consulting Engagement PMP Pre-sales People Management Skills  Project Management Oracle Applications Practice Management &... Management Consulting Engagement PMP Pre-sales People Management Project Management Oracle Applications Practice Management &... Management Consulting Engagement PMP Pre-sales People Management Project Management Oracle Applications Practice Management &... Management Consulting Engagement PMP Pre-sales People Management Honors & Awards Additional Honors & Awards - Excellence Award from General Manager Global Integrated Delivery for Outstanding Achievement & Growth in IBM AAO Services for Oracle  \n- Excellence Award in IBM for contribution in Oracle Upgrade Lab  \n- Consultant of the year by Group VP North America Consulting, Oracle Corp.  \n- Best Delivery Manager of the year for North America India Operations by Group VP, Oracle India. Additional Honors & Awards - Excellence Award from General Manager Global Integrated Delivery for Outstanding Achievement & Growth in IBM AAO Services for Oracle  \n- Excellence Award in IBM for contribution in Oracle Upgrade Lab  \n- Consultant of the year by Group VP North America Consulting, Oracle Corp.  \n- Best Delivery Manager of the year for North America India Operations by Group VP, Oracle India. Additional Honors & Awards - Excellence Award from General Manager Global Integrated Delivery for Outstanding Achievement & Growth in IBM AAO Services for Oracle  \n- Excellence Award in IBM for contribution in Oracle Upgrade Lab  \n- Consultant of the year by Group VP North America Consulting, Oracle Corp.  \n- Best Delivery Manager of the year for North America India Operations by Group VP, Oracle India. Additional Honors & Awards - Excellence Award from General Manager Global Integrated Delivery for Outstanding Achievement & Growth in IBM AAO Services for Oracle  \n- Excellence Award in IBM for contribution in Oracle Upgrade Lab  \n- Consultant of the year by Group VP North America Consulting, Oracle Corp.  \n- Best Delivery Manager of the year for North America India Operations by Group VP, Oracle India. ", "Languages English Native or bilingual proficiency Mandarin Native or bilingual proficiency English Native or bilingual proficiency Mandarin Native or bilingual proficiency English Native or bilingual proficiency Mandarin Native or bilingual proficiency Native or bilingual proficiency Native or bilingual proficiency Skills Business Transformation Business Process Strategy Shared Services Business Intelligence Solution Architecture Vendor Management Business Process... Program Management Strategic Planning Cross-functional Team... Supply Chain Management Management Procurement ERP Outsourcing Strategic Sourcing Supply Chain Business Strategy Integration See 5+     See less Skills  Business Transformation Business Process Strategy Shared Services Business Intelligence Solution Architecture Vendor Management Business Process... Program Management Strategic Planning Cross-functional Team... Supply Chain Management Management Procurement ERP Outsourcing Strategic Sourcing Supply Chain Business Strategy Integration See 5+     See less Business Transformation Business Process Strategy Shared Services Business Intelligence Solution Architecture Vendor Management Business Process... Program Management Strategic Planning Cross-functional Team... Supply Chain Management Management Procurement ERP Outsourcing Strategic Sourcing Supply Chain Business Strategy Integration See 5+     See less Business Transformation Business Process Strategy Shared Services Business Intelligence Solution Architecture Vendor Management Business Process... Program Management Strategic Planning Cross-functional Team... Supply Chain Management Management Procurement ERP Outsourcing Strategic Sourcing Supply Chain Business Strategy Integration See 5+     See less ", "Experience Owner PC Gateway Inc. Package Distribution Consultant Bank of Montreal - Win 7 - Office Connect Project 2013  – Present (2 years) Toronto ON Account Solution Lead IBM Canada – Air Canada Project 2013  –  2013  (less than a year) Montreal, QC Senior Application Packaging Consultant City of Brampton - Bucannan Project 2012  –  2013  (1 year) Brampton ON Package Distribution Consultant Bank of Montreal - Office Connect Project 2011  –  2012  (1 year) Toronto ON Senior Application Packaging Consultant Peel Regional Police - Bucannan Project 2011  –  2011  (less than a year) Brampton ON Account Solution Lead IBM / MillerCoors 2010  –  2011  (1 year) Markham ON Senior Application Packaging Consultant Bank of Montreal 2009  –  2010  (1 year) North York Software Packaging Consultant Costco Wholesale 2009  –  2009  (less than a year) Software Scripting Consultant Bank Of Montreal 2007  –  2008  (1 year) Software Packaging Consultant IBM Canada Ltd. / CMPA Project 2007  –  2007  (less than a year) Software Packaging Consultant Canadian Tire 2006  –  2007  (1 year) Software Packaging Consultant Sunlife 2005  –  2006  (1 year) Software Packaging Consultant New Horizion / Inergi /Hydro One 2005  –  2005  (less than a year) MSI / Wise Studio / Installshield Admin Studio / SMS Installer Software Packaging Consultant TD Bank 2004  –  2005  (1 year) Software Packaging Consultant The Dominion of Canada General Insurance Company 2004  –  2004  (less than a year) Software Packaging Consultant IBM Canada Ltd. / Deutsche Bank Project 2003  –  2004  (1 year) Software Packaging Consultant Nine Mile Point Nuclear Station - CEG 2003  –  2003  (less than a year) Packager / Scripter Kodak 2000  –  2002  (2 years) Y2K Tester St Lawrence Cement 1999  –  2000  (1 year) Scripter BMO Nesbitt Burns 1998  –  1999  (1 year) IT Support SAP Canada Inc. 1997  –  1998  (1 year) IT Support Canwest 1997  –  1997  (less than a year) Owner PC Gateway Inc. Owner PC Gateway Inc. Package Distribution Consultant Bank of Montreal - Win 7 - Office Connect Project 2013  – Present (2 years) Toronto ON Package Distribution Consultant Bank of Montreal - Win 7 - Office Connect Project 2013  – Present (2 years) Toronto ON Account Solution Lead IBM Canada – Air Canada Project 2013  –  2013  (less than a year) Montreal, QC Account Solution Lead IBM Canada – Air Canada Project 2013  –  2013  (less than a year) Montreal, QC Senior Application Packaging Consultant City of Brampton - Bucannan Project 2012  –  2013  (1 year) Brampton ON Senior Application Packaging Consultant City of Brampton - Bucannan Project 2012  –  2013  (1 year) Brampton ON Package Distribution Consultant Bank of Montreal - Office Connect Project 2011  –  2012  (1 year) Toronto ON Package Distribution Consultant Bank of Montreal - Office Connect Project 2011  –  2012  (1 year) Toronto ON Senior Application Packaging Consultant Peel Regional Police - Bucannan Project 2011  –  2011  (less than a year) Brampton ON Senior Application Packaging Consultant Peel Regional Police - Bucannan Project 2011  –  2011  (less than a year) Brampton ON Account Solution Lead IBM / MillerCoors 2010  –  2011  (1 year) Markham ON Account Solution Lead IBM / MillerCoors 2010  –  2011  (1 year) Markham ON Senior Application Packaging Consultant Bank of Montreal 2009  –  2010  (1 year) North York Senior Application Packaging Consultant Bank of Montreal 2009  –  2010  (1 year) North York Software Packaging Consultant Costco Wholesale 2009  –  2009  (less than a year) Software Packaging Consultant Costco Wholesale 2009  –  2009  (less than a year) Software Scripting Consultant Bank Of Montreal 2007  –  2008  (1 year) Software Scripting Consultant Bank Of Montreal 2007  –  2008  (1 year) Software Packaging Consultant IBM Canada Ltd. / CMPA Project 2007  –  2007  (less than a year) Software Packaging Consultant IBM Canada Ltd. / CMPA Project 2007  –  2007  (less than a year) Software Packaging Consultant Canadian Tire 2006  –  2007  (1 year) Software Packaging Consultant Canadian Tire 2006  –  2007  (1 year) Software Packaging Consultant Sunlife 2005  –  2006  (1 year) Software Packaging Consultant Sunlife 2005  –  2006  (1 year) Software Packaging Consultant New Horizion / Inergi /Hydro One 2005  –  2005  (less than a year) MSI / Wise Studio / Installshield Admin Studio / SMS Installer Software Packaging Consultant New Horizion / Inergi /Hydro One 2005  –  2005  (less than a year) MSI / Wise Studio / Installshield Admin Studio / SMS Installer Software Packaging Consultant TD Bank 2004  –  2005  (1 year) Software Packaging Consultant TD Bank 2004  –  2005  (1 year) Software Packaging Consultant The Dominion of Canada General Insurance Company 2004  –  2004  (less than a year) Software Packaging Consultant The Dominion of Canada General Insurance Company 2004  –  2004  (less than a year) Software Packaging Consultant IBM Canada Ltd. / Deutsche Bank Project 2003  –  2004  (1 year) Software Packaging Consultant IBM Canada Ltd. / Deutsche Bank Project 2003  –  2004  (1 year) Software Packaging Consultant Nine Mile Point Nuclear Station - CEG 2003  –  2003  (less than a year) Software Packaging Consultant Nine Mile Point Nuclear Station - CEG 2003  –  2003  (less than a year) Packager / Scripter Kodak 2000  –  2002  (2 years) Packager / Scripter Kodak 2000  –  2002  (2 years) Y2K Tester St Lawrence Cement 1999  –  2000  (1 year) Y2K Tester St Lawrence Cement 1999  –  2000  (1 year) Scripter BMO Nesbitt Burns 1998  –  1999  (1 year) Scripter BMO Nesbitt Burns 1998  –  1999  (1 year) IT Support SAP Canada Inc. 1997  –  1998  (1 year) IT Support SAP Canada Inc. 1997  –  1998  (1 year) IT Support Canwest 1997  –  1997  (less than a year) IT Support Canwest 1997  –  1997  (less than a year) Skills InstallShield SMS MSI Scripting XP Software Installation Windows Server Automation Active Directory Servers Quality Assurance Windows Deployment System Administration Troubleshooting Application Development Debugging Computer Hardware Hardware Testing Documentation XML Script Operating Systems SCCM VBScript Windows 7 VMware Group Policy Windows Server 2003 Virtualization App-V See 17+     See less Skills  InstallShield SMS MSI Scripting XP Software Installation Windows Server Automation Active Directory Servers Quality Assurance Windows Deployment System Administration Troubleshooting Application Development Debugging Computer Hardware Hardware Testing Documentation XML Script Operating Systems SCCM VBScript Windows 7 VMware Group Policy Windows Server 2003 Virtualization App-V See 17+     See less InstallShield SMS MSI Scripting XP Software Installation Windows Server Automation Active Directory Servers Quality Assurance Windows Deployment System Administration Troubleshooting Application Development Debugging Computer Hardware Hardware Testing Documentation XML Script Operating Systems SCCM VBScript Windows 7 VMware Group Policy Windows Server 2003 Virtualization App-V See 17+     See less InstallShield SMS MSI Scripting XP Software Installation Windows Server Automation Active Directory Servers Quality Assurance Windows Deployment System Administration Troubleshooting Application Development Debugging Computer Hardware Hardware Testing Documentation XML Script Operating Systems SCCM VBScript Windows 7 VMware Group Policy Windows Server 2003 Virtualization App-V See 17+     See less Education Centennial College Post-Diploma,  Data Communication and Networks DeVry Institute of Technology Diploma,  ElectronicsTechnology Jaffna Central College Centennial College Post-Diploma,  Data Communication and Networks Centennial College Post-Diploma,  Data Communication and Networks Centennial College Post-Diploma,  Data Communication and Networks DeVry Institute of Technology Diploma,  ElectronicsTechnology DeVry Institute of Technology Diploma,  ElectronicsTechnology DeVry Institute of Technology Diploma,  ElectronicsTechnology Jaffna Central College Jaffna Central College Jaffna Central College ", "Summary Accomplished, results-driven entrepreneurial sales professional with over 15 years record in achieving profitable growth in competitive market segments. Solid analytical skills and business acumen; keen strategist adept in formulating long-range business plans, serving in sales and client-facing capacities, cultivating strategic alliances, and shaping organizations that respond nimbly to market opportunities. Proven experience in high-profile sales and client-facing capacities; adept at interfacing with executive management, and accomplishing goals of leading companies to succeed in the highly competitive markets. Specialties:Sales Strengths include: \n- New Business Development \n- Market Research & Analysis \n- Team Building & Leadership \n- Strategic Alliances \n- RFP Management  \n- Risk Mitigation \n- Cost Takeout  \n- Key Account Management \n- Profitable Growth \n- Business Transformation \n \nIndustry Experience with all levels of Governement and Healthcare in Canada. \n \nEntrepreneurial leader known for ability to penetrate new markets, produce impressive sales results and grow market share and profitability. Summary Accomplished, results-driven entrepreneurial sales professional with over 15 years record in achieving profitable growth in competitive market segments. Solid analytical skills and business acumen; keen strategist adept in formulating long-range business plans, serving in sales and client-facing capacities, cultivating strategic alliances, and shaping organizations that respond nimbly to market opportunities. Proven experience in high-profile sales and client-facing capacities; adept at interfacing with executive management, and accomplishing goals of leading companies to succeed in the highly competitive markets. Specialties:Sales Strengths include: \n- New Business Development \n- Market Research & Analysis \n- Team Building & Leadership \n- Strategic Alliances \n- RFP Management  \n- Risk Mitigation \n- Cost Takeout  \n- Key Account Management \n- Profitable Growth \n- Business Transformation \n \nIndustry Experience with all levels of Governement and Healthcare in Canada. \n \nEntrepreneurial leader known for ability to penetrate new markets, produce impressive sales results and grow market share and profitability. Accomplished, results-driven entrepreneurial sales professional with over 15 years record in achieving profitable growth in competitive market segments. Solid analytical skills and business acumen; keen strategist adept in formulating long-range business plans, serving in sales and client-facing capacities, cultivating strategic alliances, and shaping organizations that respond nimbly to market opportunities. Proven experience in high-profile sales and client-facing capacities; adept at interfacing with executive management, and accomplishing goals of leading companies to succeed in the highly competitive markets. Specialties:Sales Strengths include: \n- New Business Development \n- Market Research & Analysis \n- Team Building & Leadership \n- Strategic Alliances \n- RFP Management  \n- Risk Mitigation \n- Cost Takeout  \n- Key Account Management \n- Profitable Growth \n- Business Transformation \n \nIndustry Experience with all levels of Governement and Healthcare in Canada. \n \nEntrepreneurial leader known for ability to penetrate new markets, produce impressive sales results and grow market share and profitability. Accomplished, results-driven entrepreneurial sales professional with over 15 years record in achieving profitable growth in competitive market segments. Solid analytical skills and business acumen; keen strategist adept in formulating long-range business plans, serving in sales and client-facing capacities, cultivating strategic alliances, and shaping organizations that respond nimbly to market opportunities. Proven experience in high-profile sales and client-facing capacities; adept at interfacing with executive management, and accomplishing goals of leading companies to succeed in the highly competitive markets. Specialties:Sales Strengths include: \n- New Business Development \n- Market Research & Analysis \n- Team Building & Leadership \n- Strategic Alliances \n- RFP Management  \n- Risk Mitigation \n- Cost Takeout  \n- Key Account Management \n- Profitable Growth \n- Business Transformation \n \nIndustry Experience with all levels of Governement and Healthcare in Canada. \n \nEntrepreneurial leader known for ability to penetrate new markets, produce impressive sales results and grow market share and profitability. Experience IBM Mobility & Collaboration Solution Lead IBM Canada January 2014  – Present (1 year 8 months) IBM's mobility services spans from strategic planning to device management to end-user applications and network infrastructure.  \n \n-Networking Strategy and Optimization  \n- Manage smartphones, tablets, and ruggedized devices across your enterprise \n-Strategic planning to Accelerate deployment of your mobile initiatives \n- Develop, deploy, and manage end-user mobile applications \n- Mobility and Wireless  \n- Unified Communications as a Service  \n- Managed Services \n- Service Desk \n- Telecom Expense management \n- Wireless Handheld Computing \n- Server and Network Monitoring Senior Client Manager- Government and Health Industry IBM Canada April 2009  –  January 2014  (4 years 10 months) Markham ON Providing Canadian Hospitals with IBM's healthcare solutions, technology and consulting services to increase efficiencies, collaborate to improve outcomes; and integrate with new partners for a more sustainable, personalized and patient-centric system focused on value. Federal Client Manager IBM Canada January 2007  –  March 2009  (2 years 3 months) Governemnet of Canda Client Manager of behalf of IBM. Deployed on the Revenue And Public Safety and Security Cluster Departments.  \nHold Gov't of Canada Secret Security Clearance Regional Manager - Chicagoland IBM Canada 2004  –  2006  (2 years) IBM Regional Territory Manager, specialized in Finance and Banking, and Healthcare Industries. Senior Marketing Manager Nidi Associates 1998  –  2004  (6 years) Toronto, ON IBM Mobility & Collaboration Solution Lead IBM Canada January 2014  – Present (1 year 8 months) IBM's mobility services spans from strategic planning to device management to end-user applications and network infrastructure.  \n \n-Networking Strategy and Optimization  \n- Manage smartphones, tablets, and ruggedized devices across your enterprise \n-Strategic planning to Accelerate deployment of your mobile initiatives \n- Develop, deploy, and manage end-user mobile applications \n- Mobility and Wireless  \n- Unified Communications as a Service  \n- Managed Services \n- Service Desk \n- Telecom Expense management \n- Wireless Handheld Computing \n- Server and Network Monitoring IBM Mobility & Collaboration Solution Lead IBM Canada January 2014  – Present (1 year 8 months) IBM's mobility services spans from strategic planning to device management to end-user applications and network infrastructure.  \n \n-Networking Strategy and Optimization  \n- Manage smartphones, tablets, and ruggedized devices across your enterprise \n-Strategic planning to Accelerate deployment of your mobile initiatives \n- Develop, deploy, and manage end-user mobile applications \n- Mobility and Wireless  \n- Unified Communications as a Service  \n- Managed Services \n- Service Desk \n- Telecom Expense management \n- Wireless Handheld Computing \n- Server and Network Monitoring Senior Client Manager- Government and Health Industry IBM Canada April 2009  –  January 2014  (4 years 10 months) Markham ON Providing Canadian Hospitals with IBM's healthcare solutions, technology and consulting services to increase efficiencies, collaborate to improve outcomes; and integrate with new partners for a more sustainable, personalized and patient-centric system focused on value. Senior Client Manager- Government and Health Industry IBM Canada April 2009  –  January 2014  (4 years 10 months) Markham ON Providing Canadian Hospitals with IBM's healthcare solutions, technology and consulting services to increase efficiencies, collaborate to improve outcomes; and integrate with new partners for a more sustainable, personalized and patient-centric system focused on value. Federal Client Manager IBM Canada January 2007  –  March 2009  (2 years 3 months) Governemnet of Canda Client Manager of behalf of IBM. Deployed on the Revenue And Public Safety and Security Cluster Departments.  \nHold Gov't of Canada Secret Security Clearance Federal Client Manager IBM Canada January 2007  –  March 2009  (2 years 3 months) Governemnet of Canda Client Manager of behalf of IBM. Deployed on the Revenue And Public Safety and Security Cluster Departments.  \nHold Gov't of Canada Secret Security Clearance Regional Manager - Chicagoland IBM Canada 2004  –  2006  (2 years) IBM Regional Territory Manager, specialized in Finance and Banking, and Healthcare Industries. Regional Manager - Chicagoland IBM Canada 2004  –  2006  (2 years) IBM Regional Territory Manager, specialized in Finance and Banking, and Healthcare Industries. Senior Marketing Manager Nidi Associates 1998  –  2004  (6 years) Toronto, ON Senior Marketing Manager Nidi Associates 1998  –  2004  (6 years) Toronto, ON Skills Healthcare Informatics Healthcare Industry Healthcare Information... Healthcare IT Clinical Workflow Clinical Analytics Market Research &... New Account Management Marketing Strategic Technology... Team Building &... RFP Management Risk Mitigation Cost Takeout Profitable Growth Business Transformation Government Industry Risk Management RFP Informatics Government Team Leadership Solution Selling Cloud Computing Leadership Enterprise Software Analysis Executive Management Sales Enablement Healthcare Storage Channel Partners Business Development New Business Development Professional Services Direct Sales Software Industry CRM Managed Services Key Account Management Business Alliances Security SaaS Data Center Demand Generation Sales Operations Account Management Networking Selling Strategic Partnerships See 35+     See less Skills  Healthcare Informatics Healthcare Industry Healthcare Information... Healthcare IT Clinical Workflow Clinical Analytics Market Research &... New Account Management Marketing Strategic Technology... Team Building &... RFP Management Risk Mitigation Cost Takeout Profitable Growth Business Transformation Government Industry Risk Management RFP Informatics Government Team Leadership Solution Selling Cloud Computing Leadership Enterprise Software Analysis Executive Management Sales Enablement Healthcare Storage Channel Partners Business Development New Business Development Professional Services Direct Sales Software Industry CRM Managed Services Key Account Management Business Alliances Security SaaS Data Center Demand Generation Sales Operations Account Management Networking Selling Strategic Partnerships See 35+     See less Healthcare Informatics Healthcare Industry Healthcare Information... Healthcare IT Clinical Workflow Clinical Analytics Market Research &... New Account Management Marketing Strategic Technology... Team Building &... RFP Management Risk Mitigation Cost Takeout Profitable Growth Business Transformation Government Industry Risk Management RFP Informatics Government Team Leadership Solution Selling Cloud Computing Leadership Enterprise Software Analysis Executive Management Sales Enablement Healthcare Storage Channel Partners Business Development New Business Development Professional Services Direct Sales Software Industry CRM Managed Services Key Account Management Business Alliances Security SaaS Data Center Demand Generation Sales Operations Account Management Networking Selling Strategic Partnerships See 35+     See less Healthcare Informatics Healthcare Industry Healthcare Information... Healthcare IT Clinical Workflow Clinical Analytics Market Research &... New Account Management Marketing Strategic Technology... Team Building &... RFP Management Risk Mitigation Cost Takeout Profitable Growth Business Transformation Government Industry Risk Management RFP Informatics Government Team Leadership Solution Selling Cloud Computing Leadership Enterprise Software Analysis Executive Management Sales Enablement Healthcare Storage Channel Partners Business Development New Business Development Professional Services Direct Sales Software Industry CRM Managed Services Key Account Management Business Alliances Security SaaS Data Center Demand Generation Sales Operations Account Management Networking Selling Strategic Partnerships See 35+     See less ", "Experience Packaging Specialist cum Account Solution Lead IBM Malaysia November 2013  – Present (1 year 10 months) - Become Packaging SME Team member that handles software package deployment testing and problem analysis. \n \n- Become Technical Solution Lead for specific client account that handles infrastructure support matters and serve as higher level escalation point for any technical or infrastructure Incident Case. ITO Service Delivery Consultant 2 Hewlett-Packard Multimedia Malaysia October 2011  –  October 2013  (2 years 1 month) Cyberjaya Malaysia - Become members of GOC Wintel Business As Usual (BAU) Team that handles daily support and operation task for specific client account. This inclusive of Incident Case, Problem and Change Request for specific activities. \n \n- Become GOC Wintel BAU Project Coordinator that working together with Project Manager to implement specific BAU Projects. Packaging Specialist cum Account Solution Lead IBM Malaysia November 2013  – Present (1 year 10 months) - Become Packaging SME Team member that handles software package deployment testing and problem analysis. \n \n- Become Technical Solution Lead for specific client account that handles infrastructure support matters and serve as higher level escalation point for any technical or infrastructure Incident Case. Packaging Specialist cum Account Solution Lead IBM Malaysia November 2013  – Present (1 year 10 months) - Become Packaging SME Team member that handles software package deployment testing and problem analysis. \n \n- Become Technical Solution Lead for specific client account that handles infrastructure support matters and serve as higher level escalation point for any technical or infrastructure Incident Case. ITO Service Delivery Consultant 2 Hewlett-Packard Multimedia Malaysia October 2011  –  October 2013  (2 years 1 month) Cyberjaya Malaysia - Become members of GOC Wintel Business As Usual (BAU) Team that handles daily support and operation task for specific client account. This inclusive of Incident Case, Problem and Change Request for specific activities. \n \n- Become GOC Wintel BAU Project Coordinator that working together with Project Manager to implement specific BAU Projects. ITO Service Delivery Consultant 2 Hewlett-Packard Multimedia Malaysia October 2011  –  October 2013  (2 years 1 month) Cyberjaya Malaysia - Become members of GOC Wintel Business As Usual (BAU) Team that handles daily support and operation task for specific client account. This inclusive of Incident Case, Problem and Change Request for specific activities. \n \n- Become GOC Wintel BAU Project Coordinator that working together with Project Manager to implement specific BAU Projects. Skills Microsoft Office Microsoft Excel Microsoft Word Customer Service PowerPoint English Windows Research Outlook Teaching Photoshop Skills  Microsoft Office Microsoft Excel Microsoft Word Customer Service PowerPoint English Windows Research Outlook Teaching Photoshop Microsoft Office Microsoft Excel Microsoft Word Customer Service PowerPoint English Windows Research Outlook Teaching Photoshop Microsoft Office Microsoft Excel Microsoft Word Customer Service PowerPoint English Windows Research Outlook Teaching Photoshop Education University of East London Bachelor's degree,  Software Engineering 2005  – 2006 University of East London Bachelor's degree,  Software Engineering 2005  – 2006 University of East London Bachelor's degree,  Software Engineering 2005  – 2006 University of East London Bachelor's degree,  Software Engineering 2005  – 2006 ", "Summary Richard has 10+ years of global experience as a hands on business development executive with hands on consulting skills in mobility domain in Mobile Application Management (MAM), Mobile Device Management (MDM), Mobile Enterprise Application Platform (MEAP), Internet of Things(IOT). Maintain focus on achieving results while utilizing best-of-breed techniques and technologies to meet diverse needs of client. \n \nHe currently work with cross and regional sales and account team to lead and manage the mobility solutions sales focus on top account in Greater China Region. \n \nHe has experience in multiple domain in Banking in Financial Service, Consumer Goods, Telecom and Retail industrial. He also have project delivery experience in leads diverse teams in multiple domains, across geographies to deliver integrated client solutions that achieve measurable business results for the clients. He manages the financial profitability of the engagement - costs, collections, etc. Global experience in US and UK at various hiSoft & Cognizant business, like Industrial, financial service and media, and project to meet and communicate with client in scoping, delivering and managing the project deliverable and account management. Summary Richard has 10+ years of global experience as a hands on business development executive with hands on consulting skills in mobility domain in Mobile Application Management (MAM), Mobile Device Management (MDM), Mobile Enterprise Application Platform (MEAP), Internet of Things(IOT). Maintain focus on achieving results while utilizing best-of-breed techniques and technologies to meet diverse needs of client. \n \nHe currently work with cross and regional sales and account team to lead and manage the mobility solutions sales focus on top account in Greater China Region. \n \nHe has experience in multiple domain in Banking in Financial Service, Consumer Goods, Telecom and Retail industrial. He also have project delivery experience in leads diverse teams in multiple domains, across geographies to deliver integrated client solutions that achieve measurable business results for the clients. He manages the financial profitability of the engagement - costs, collections, etc. Global experience in US and UK at various hiSoft & Cognizant business, like Industrial, financial service and media, and project to meet and communicate with client in scoping, delivering and managing the project deliverable and account management. Richard has 10+ years of global experience as a hands on business development executive with hands on consulting skills in mobility domain in Mobile Application Management (MAM), Mobile Device Management (MDM), Mobile Enterprise Application Platform (MEAP), Internet of Things(IOT). Maintain focus on achieving results while utilizing best-of-breed techniques and technologies to meet diverse needs of client. \n \nHe currently work with cross and regional sales and account team to lead and manage the mobility solutions sales focus on top account in Greater China Region. \n \nHe has experience in multiple domain in Banking in Financial Service, Consumer Goods, Telecom and Retail industrial. He also have project delivery experience in leads diverse teams in multiple domains, across geographies to deliver integrated client solutions that achieve measurable business results for the clients. He manages the financial profitability of the engagement - costs, collections, etc. Global experience in US and UK at various hiSoft & Cognizant business, like Industrial, financial service and media, and project to meet and communicate with client in scoping, delivering and managing the project deliverable and account management. Richard has 10+ years of global experience as a hands on business development executive with hands on consulting skills in mobility domain in Mobile Application Management (MAM), Mobile Device Management (MDM), Mobile Enterprise Application Platform (MEAP), Internet of Things(IOT). Maintain focus on achieving results while utilizing best-of-breed techniques and technologies to meet diverse needs of client. \n \nHe currently work with cross and regional sales and account team to lead and manage the mobility solutions sales focus on top account in Greater China Region. \n \nHe has experience in multiple domain in Banking in Financial Service, Consumer Goods, Telecom and Retail industrial. He also have project delivery experience in leads diverse teams in multiple domains, across geographies to deliver integrated client solutions that achieve measurable business results for the clients. He manages the financial profitability of the engagement - costs, collections, etc. Global experience in US and UK at various hiSoft & Cognizant business, like Industrial, financial service and media, and project to meet and communicate with client in scoping, delivering and managing the project deliverable and account management. Experience Mobile Solution Lead - IBM Mobile First Platform | Software Group | IBM Greater China Region IBM China June 2014  – Present (1 year 3 months) Shanghai City, China Richard is currently responsible for Mobile Solutions Sales of IBM Mobile First Platform for IBM China tops accounts in Banking & Financial Industrial, Utilities, Telecom, Semiconductors & Airlines in Greater China region.  \n \nThe IBM Mobile First platform helps business leaders to extend their businesses to mobile devices. It provides an open, comprehensive and advanced platform on which you can build, test, run, and manage mobile applications. With IBM Mobile First Platform, you can more efficiently develop, test, run, and manage native, hybrid and web applications with reduced development costs and faster time-to- market. You can also help improve mobile application governance and enable a security-rich environment for mobile interaction at every level, the user, device, data and application. IBM Mobile First Platform \nuses standards-based technologies that virtually eliminate the use of code translation, proprietary interpreters and unpopular scripting languages. Head of Mobility Service China Cognizant Technology Solutions April 2012  –  May 2014  (2 years 2 months) Shanghai, China Serve as Head of Mobility Service China, focusing  \n- Enterprise Mobility Solution Project Consulting & Delivery \n- CxO's consultancy from at a strategic level to help adopt mobility in their enterprise and business. \n- Assist C level decision maker to adopt Mobility as IT enabler for business. \n- Future proofing in mobility investment for customer. Head of Consumer Goods, Retail,Travel & Hospitality China Cognizant Technology Solutions March 2008  –  May 2014  (6 years 3 months) Shanghai China Serve as Senior Manager and play multiple role in Cognizant China operation with role as Delivery Partner of major accounts such as world largest prestige beauty product company, play as account manager in worlds largest power tools manufacturing company and play as the Practice Head of FMCG, Travel & Hospitality. Program Manager Cognizant Technology Solution Singapore October 2009  –  February 2010  (5 months) Singapore Program Manager for implementation of a world's largest pharmacheutical client projects in APAC & ASEAN region. Co-ordinate with client finance department and project tracking, requirement management in 10 countries with development team in Canada. Project Manager hiSoft International US January 2007  –  January 2008  (1 year 1 month) Norfolk, Virginia Area & Leeds ， UK Working with HiSoft International US for General Electric client in Norfolk and GE Money in Leeds UK. Project Manager hiSoft Technology International Limited June 2004  –  December 2006  (2 years 7 months) Dalian, China Work as a PM in hiSoft Technology's GE Global Development Center in Dalian with various GE account. Mobile Solution Lead - IBM Mobile First Platform | Software Group | IBM Greater China Region IBM China June 2014  – Present (1 year 3 months) Shanghai City, China Richard is currently responsible for Mobile Solutions Sales of IBM Mobile First Platform for IBM China tops accounts in Banking & Financial Industrial, Utilities, Telecom, Semiconductors & Airlines in Greater China region.  \n \nThe IBM Mobile First platform helps business leaders to extend their businesses to mobile devices. It provides an open, comprehensive and advanced platform on which you can build, test, run, and manage mobile applications. With IBM Mobile First Platform, you can more efficiently develop, test, run, and manage native, hybrid and web applications with reduced development costs and faster time-to- market. You can also help improve mobile application governance and enable a security-rich environment for mobile interaction at every level, the user, device, data and application. IBM Mobile First Platform \nuses standards-based technologies that virtually eliminate the use of code translation, proprietary interpreters and unpopular scripting languages. Mobile Solution Lead - IBM Mobile First Platform | Software Group | IBM Greater China Region IBM China June 2014  – Present (1 year 3 months) Shanghai City, China Richard is currently responsible for Mobile Solutions Sales of IBM Mobile First Platform for IBM China tops accounts in Banking & Financial Industrial, Utilities, Telecom, Semiconductors & Airlines in Greater China region.  \n \nThe IBM Mobile First platform helps business leaders to extend their businesses to mobile devices. It provides an open, comprehensive and advanced platform on which you can build, test, run, and manage mobile applications. With IBM Mobile First Platform, you can more efficiently develop, test, run, and manage native, hybrid and web applications with reduced development costs and faster time-to- market. You can also help improve mobile application governance and enable a security-rich environment for mobile interaction at every level, the user, device, data and application. IBM Mobile First Platform \nuses standards-based technologies that virtually eliminate the use of code translation, proprietary interpreters and unpopular scripting languages. Head of Mobility Service China Cognizant Technology Solutions April 2012  –  May 2014  (2 years 2 months) Shanghai, China Serve as Head of Mobility Service China, focusing  \n- Enterprise Mobility Solution Project Consulting & Delivery \n- CxO's consultancy from at a strategic level to help adopt mobility in their enterprise and business. \n- Assist C level decision maker to adopt Mobility as IT enabler for business. \n- Future proofing in mobility investment for customer. Head of Mobility Service China Cognizant Technology Solutions April 2012  –  May 2014  (2 years 2 months) Shanghai, China Serve as Head of Mobility Service China, focusing  \n- Enterprise Mobility Solution Project Consulting & Delivery \n- CxO's consultancy from at a strategic level to help adopt mobility in their enterprise and business. \n- Assist C level decision maker to adopt Mobility as IT enabler for business. \n- Future proofing in mobility investment for customer. Head of Consumer Goods, Retail,Travel & Hospitality China Cognizant Technology Solutions March 2008  –  May 2014  (6 years 3 months) Shanghai China Serve as Senior Manager and play multiple role in Cognizant China operation with role as Delivery Partner of major accounts such as world largest prestige beauty product company, play as account manager in worlds largest power tools manufacturing company and play as the Practice Head of FMCG, Travel & Hospitality. Head of Consumer Goods, Retail,Travel & Hospitality China Cognizant Technology Solutions March 2008  –  May 2014  (6 years 3 months) Shanghai China Serve as Senior Manager and play multiple role in Cognizant China operation with role as Delivery Partner of major accounts such as world largest prestige beauty product company, play as account manager in worlds largest power tools manufacturing company and play as the Practice Head of FMCG, Travel & Hospitality. Program Manager Cognizant Technology Solution Singapore October 2009  –  February 2010  (5 months) Singapore Program Manager for implementation of a world's largest pharmacheutical client projects in APAC & ASEAN region. Co-ordinate with client finance department and project tracking, requirement management in 10 countries with development team in Canada. Program Manager Cognizant Technology Solution Singapore October 2009  –  February 2010  (5 months) Singapore Program Manager for implementation of a world's largest pharmacheutical client projects in APAC & ASEAN region. Co-ordinate with client finance department and project tracking, requirement management in 10 countries with development team in Canada. Project Manager hiSoft International US January 2007  –  January 2008  (1 year 1 month) Norfolk, Virginia Area & Leeds ， UK Working with HiSoft International US for General Electric client in Norfolk and GE Money in Leeds UK. Project Manager hiSoft International US January 2007  –  January 2008  (1 year 1 month) Norfolk, Virginia Area & Leeds ， UK Working with HiSoft International US for General Electric client in Norfolk and GE Money in Leeds UK. Project Manager hiSoft Technology International Limited June 2004  –  December 2006  (2 years 7 months) Dalian, China Work as a PM in hiSoft Technology's GE Global Development Center in Dalian with various GE account. Project Manager hiSoft Technology International Limited June 2004  –  December 2006  (2 years 7 months) Dalian, China Work as a PM in hiSoft Technology's GE Global Development Center in Dalian with various GE account. Languages Chinese Cantonese Taiwanese Malay English Chinese Cantonese Taiwanese Malay English Chinese Cantonese Taiwanese Malay English Skills Program Management Project Portfolio... Service Delivery Enterprise Mobility Mobile Consulting Mobility Solutions Mobile Commerce Mobile Applications Mobile Technology Mobile Mobile Internet Mobile Content Global Delivery Key Account Management New Business Development Collaborative Problem... Problem Solving Client Relationship... Innovative Thinking CRM Outsourcing Account Management Software Project... Mobile Devices See 9+     See less Skills  Program Management Project Portfolio... Service Delivery Enterprise Mobility Mobile Consulting Mobility Solutions Mobile Commerce Mobile Applications Mobile Technology Mobile Mobile Internet Mobile Content Global Delivery Key Account Management New Business Development Collaborative Problem... Problem Solving Client Relationship... Innovative Thinking CRM Outsourcing Account Management Software Project... Mobile Devices See 9+     See less Program Management Project Portfolio... Service Delivery Enterprise Mobility Mobile Consulting Mobility Solutions Mobile Commerce Mobile Applications Mobile Technology Mobile Mobile Internet Mobile Content Global Delivery Key Account Management New Business Development Collaborative Problem... Problem Solving Client Relationship... Innovative Thinking CRM Outsourcing Account Management Software Project... Mobile Devices See 9+     See less Program Management Project Portfolio... Service Delivery Enterprise Mobility Mobile Consulting Mobility Solutions Mobile Commerce Mobile Applications Mobile Technology Mobile Mobile Internet Mobile Content Global Delivery Key Account Management New Business Development Collaborative Problem... Problem Solving Client Relationship... Innovative Thinking CRM Outsourcing Account Management Software Project... Mobile Devices See 9+     See less Education University of Northumbria at Newcastle, Newcastle, United Kingdom Bachelor of Science, Computer Studies,  Computer and Information Sciences and Support Services 2003  – 2003 KDU College Penang, Penang, Malaysia Diploma in Computer Studies,  Computer and Information Sciences and Support Services 2000  – 2002 University of Northumbria at Newcastle, Newcastle, United Kingdom Bachelor of Science, Computer Studies,  Computer and Information Sciences and Support Services 2003  – 2003 University of Northumbria at Newcastle, Newcastle, United Kingdom Bachelor of Science, Computer Studies,  Computer and Information Sciences and Support Services 2003  – 2003 University of Northumbria at Newcastle, Newcastle, United Kingdom Bachelor of Science, Computer Studies,  Computer and Information Sciences and Support Services 2003  – 2003 KDU College Penang, Penang, Malaysia Diploma in Computer Studies,  Computer and Information Sciences and Support Services 2000  – 2002 KDU College Penang, Penang, Malaysia Diploma in Computer Studies,  Computer and Information Sciences and Support Services 2000  – 2002 KDU College Penang, Penang, Malaysia Diploma in Computer Studies,  Computer and Information Sciences and Support Services 2000  – 2002 Honors & Awards Project Of the Year Cognizant Technology Solutions June 2011 Estee Lauder Global Coresite project awards as Project of the Year by Cognizant Technology Solutions Best Practice of the Year Cognizant Technology Solutions October 2010 Estee Lauder APAC Mobile rollout grab awards of Best Practices of the Year. Cognizant Innovation Award Cognizant Technology Solutions October 2011 Estee Lauder account was award Most Innovative Account with the innovation solutions provide to client. Project Of the Year Cognizant Technology Solutions June 2011 Estee Lauder Global Coresite project awards as Project of the Year by Cognizant Technology Solutions Project Of the Year Cognizant Technology Solutions June 2011 Estee Lauder Global Coresite project awards as Project of the Year by Cognizant Technology Solutions Project Of the Year Cognizant Technology Solutions June 2011 Estee Lauder Global Coresite project awards as Project of the Year by Cognizant Technology Solutions Best Practice of the Year Cognizant Technology Solutions October 2010 Estee Lauder APAC Mobile rollout grab awards of Best Practices of the Year. Best Practice of the Year Cognizant Technology Solutions October 2010 Estee Lauder APAC Mobile rollout grab awards of Best Practices of the Year. Best Practice of the Year Cognizant Technology Solutions October 2010 Estee Lauder APAC Mobile rollout grab awards of Best Practices of the Year. Cognizant Innovation Award Cognizant Technology Solutions October 2011 Estee Lauder account was award Most Innovative Account with the innovation solutions provide to client. Cognizant Innovation Award Cognizant Technology Solutions October 2011 Estee Lauder account was award Most Innovative Account with the innovation solutions provide to client. Cognizant Innovation Award Cognizant Technology Solutions October 2011 Estee Lauder account was award Most Innovative Account with the innovation solutions provide to client. ", "Experience Account Solution Lead IBM June 2015  – Present (3 months) Spécialiste client-serveur TD Assurances October 2012  –  June 2015  (2 years 9 months) Montreal, Canada Area Account Solution Lead IBM March 2010  –  October 2012  (2 years 8 months) Montreal, Canada Area IBM Canada\t2001 - 2012 \nAccount Solution Lead  \nAnalyser ,assurer l’élaboration, le développement, la mise en place , le déploiement et le maintien d’images automatisées et préconfigurées sous les plateformes Windows 2000, Windows XP et Windows 7, selon les besoins des clients et nouveaux postes de travail. \n \n•Elaborer ,développer et déployer les différentes plateformes. \n•Certifier et assurer la mise en place de nouveaux postes de travail et périphériques (hardware).  \n•Créer Configurer les applications selon les standards du client \n•Créer des paquets d’installation (MSI) \n•Effectuer les scripts d’installation \n•Tester le déploiement des applications \n•Créer et mettre en place des outils d’installation pour les postes de travail. \n•Installer, configurer et maintenir les serveurs du centre de déploiement d’images disponibles pour les nouveaux postes de travail. \n•Collaborer à l’installation de serveurs VMWare ESX. \n•Mettre en place ,gérer un environnement de tests et de production de sessions virtuelles sur VmWare ESX. \n•Assurer la mise en place et le maintien des serveurs WSUS (Windows Update). \n•Gérer , valider et déployer les correctifs des produits Microsoft sur les serveurs WSUS. (Windows Update) lorsque disponibles. \n•Installer et mettre à jour l’antivirus sur les postes de travail. \n•Produire la documentation pertinente couvrant l’installation manuelle destinée groupe d’installation.  \n•Collaborer auprès du client dans le but d’améliorer les processus. \n•Contribuer au support 3e niveau (applications bureautiques et spécialisées) et au soutien du groupe d’installation. \n•Élaborer, créer des images et supporter le « Kiosk Check-in » libre-service. \n•Déployer et maintenir documentation contrôlée sur des serveurs réseau. \nTechnologies : Windows 7, XP, 2000, DOS, Windows server 2008, 2003, 2000, Microsoft AIK, MDT 2010, Drive Image, Ghost, Html, Hta, JavaScript, Vbscript, Winbatch, VMWare, Microsoft Virtual PC, InstallShield, Wise, MS-Office 2003 ,MS-Office 2007. Image builder Specialist IBM September 2001  –  October 2012  (11 years 2 months) Montreal Create images to be deployed on workstations . Various Operating systems. Hardware certification. Image build IBM 2001  –  2012  (11 years) Create automated Windows 7 and Windows XP images installation . Certify and integrate new hardware into the images . Integrate , validate packages from other teams . Create documentation Technical Support Secialist IBM March 1997  –  September 2001  (4 years 7 months) Montreal, Canada Area Customer support . Level 2 support Technicien support ISM Canada January 1997  –  January 2001  (4 years 1 month) Intégrer différents périphériques.  \nAssurer le soutien technique pour des problèmes spécifiques auprès des autres techniciens  \n(support de niveau 3). \nAssembler, configurer et installer des postes de travail sur le réseau.  \nReconfigurer des postes de travail hors fonction. \nRéparer des postes de travail, imprimantes et autres périphériques (Terminaux ICOT, WYSE, etc). \nInstaller, configurer et faire le câblage d’un réseau interne. Technicien support ISM Canada January 1997  –  January 2001  (4 years 1 month) Intégrer différents périphériques.  \nAssurer le soutien technique pour des problèmes spécifiques auprès des autres techniciens  \n(support de niveau 3). \nAssembler, configurer et installer des postes de travail sur le réseau.  \nReconfigurer des postes de travail hors fonction. \nRéparer des postes de travail, imprimantes et autres périphériques (Terminaux ICOT, WYSE, etc). \nInstaller, configurer et faire le câblage d’un réseau interne. Account Solution Lead IBM June 2015  – Present (3 months) Account Solution Lead IBM June 2015  – Present (3 months) Spécialiste client-serveur TD Assurances October 2012  –  June 2015  (2 years 9 months) Montreal, Canada Area Spécialiste client-serveur TD Assurances October 2012  –  June 2015  (2 years 9 months) Montreal, Canada Area Account Solution Lead IBM March 2010  –  October 2012  (2 years 8 months) Montreal, Canada Area IBM Canada\t2001 - 2012 \nAccount Solution Lead  \nAnalyser ,assurer l’élaboration, le développement, la mise en place , le déploiement et le maintien d’images automatisées et préconfigurées sous les plateformes Windows 2000, Windows XP et Windows 7, selon les besoins des clients et nouveaux postes de travail. \n \n•Elaborer ,développer et déployer les différentes plateformes. \n•Certifier et assurer la mise en place de nouveaux postes de travail et périphériques (hardware).  \n•Créer Configurer les applications selon les standards du client \n•Créer des paquets d’installation (MSI) \n•Effectuer les scripts d’installation \n•Tester le déploiement des applications \n•Créer et mettre en place des outils d’installation pour les postes de travail. \n•Installer, configurer et maintenir les serveurs du centre de déploiement d’images disponibles pour les nouveaux postes de travail. \n•Collaborer à l’installation de serveurs VMWare ESX. \n•Mettre en place ,gérer un environnement de tests et de production de sessions virtuelles sur VmWare ESX. \n•Assurer la mise en place et le maintien des serveurs WSUS (Windows Update). \n•Gérer , valider et déployer les correctifs des produits Microsoft sur les serveurs WSUS. (Windows Update) lorsque disponibles. \n•Installer et mettre à jour l’antivirus sur les postes de travail. \n•Produire la documentation pertinente couvrant l’installation manuelle destinée groupe d’installation.  \n•Collaborer auprès du client dans le but d’améliorer les processus. \n•Contribuer au support 3e niveau (applications bureautiques et spécialisées) et au soutien du groupe d’installation. \n•Élaborer, créer des images et supporter le « Kiosk Check-in » libre-service. \n•Déployer et maintenir documentation contrôlée sur des serveurs réseau. \nTechnologies : Windows 7, XP, 2000, DOS, Windows server 2008, 2003, 2000, Microsoft AIK, MDT 2010, Drive Image, Ghost, Html, Hta, JavaScript, Vbscript, Winbatch, VMWare, Microsoft Virtual PC, InstallShield, Wise, MS-Office 2003 ,MS-Office 2007. Account Solution Lead IBM March 2010  –  October 2012  (2 years 8 months) Montreal, Canada Area IBM Canada\t2001 - 2012 \nAccount Solution Lead  \nAnalyser ,assurer l’élaboration, le développement, la mise en place , le déploiement et le maintien d’images automatisées et préconfigurées sous les plateformes Windows 2000, Windows XP et Windows 7, selon les besoins des clients et nouveaux postes de travail. \n \n•Elaborer ,développer et déployer les différentes plateformes. \n•Certifier et assurer la mise en place de nouveaux postes de travail et périphériques (hardware).  \n•Créer Configurer les applications selon les standards du client \n•Créer des paquets d’installation (MSI) \n•Effectuer les scripts d’installation \n•Tester le déploiement des applications \n•Créer et mettre en place des outils d’installation pour les postes de travail. \n•Installer, configurer et maintenir les serveurs du centre de déploiement d’images disponibles pour les nouveaux postes de travail. \n•Collaborer à l’installation de serveurs VMWare ESX. \n•Mettre en place ,gérer un environnement de tests et de production de sessions virtuelles sur VmWare ESX. \n•Assurer la mise en place et le maintien des serveurs WSUS (Windows Update). \n•Gérer , valider et déployer les correctifs des produits Microsoft sur les serveurs WSUS. (Windows Update) lorsque disponibles. \n•Installer et mettre à jour l’antivirus sur les postes de travail. \n•Produire la documentation pertinente couvrant l’installation manuelle destinée groupe d’installation.  \n•Collaborer auprès du client dans le but d’améliorer les processus. \n•Contribuer au support 3e niveau (applications bureautiques et spécialisées) et au soutien du groupe d’installation. \n•Élaborer, créer des images et supporter le « Kiosk Check-in » libre-service. \n•Déployer et maintenir documentation contrôlée sur des serveurs réseau. \nTechnologies : Windows 7, XP, 2000, DOS, Windows server 2008, 2003, 2000, Microsoft AIK, MDT 2010, Drive Image, Ghost, Html, Hta, JavaScript, Vbscript, Winbatch, VMWare, Microsoft Virtual PC, InstallShield, Wise, MS-Office 2003 ,MS-Office 2007. Image builder Specialist IBM September 2001  –  October 2012  (11 years 2 months) Montreal Create images to be deployed on workstations . Various Operating systems. Hardware certification. Image builder Specialist IBM September 2001  –  October 2012  (11 years 2 months) Montreal Create images to be deployed on workstations . Various Operating systems. Hardware certification. Image build IBM 2001  –  2012  (11 years) Create automated Windows 7 and Windows XP images installation . Certify and integrate new hardware into the images . Integrate , validate packages from other teams . Create documentation Image build IBM 2001  –  2012  (11 years) Create automated Windows 7 and Windows XP images installation . Certify and integrate new hardware into the images . Integrate , validate packages from other teams . Create documentation Technical Support Secialist IBM March 1997  –  September 2001  (4 years 7 months) Montreal, Canada Area Customer support . Level 2 support Technical Support Secialist IBM March 1997  –  September 2001  (4 years 7 months) Montreal, Canada Area Customer support . Level 2 support Technicien support ISM Canada January 1997  –  January 2001  (4 years 1 month) Intégrer différents périphériques.  \nAssurer le soutien technique pour des problèmes spécifiques auprès des autres techniciens  \n(support de niveau 3). \nAssembler, configurer et installer des postes de travail sur le réseau.  \nReconfigurer des postes de travail hors fonction. \nRéparer des postes de travail, imprimantes et autres périphériques (Terminaux ICOT, WYSE, etc). \nInstaller, configurer et faire le câblage d’un réseau interne. Technicien support ISM Canada January 1997  –  January 2001  (4 years 1 month) Intégrer différents périphériques.  \nAssurer le soutien technique pour des problèmes spécifiques auprès des autres techniciens  \n(support de niveau 3). \nAssembler, configurer et installer des postes de travail sur le réseau.  \nReconfigurer des postes de travail hors fonction. \nRéparer des postes de travail, imprimantes et autres périphériques (Terminaux ICOT, WYSE, etc). \nInstaller, configurer et faire le câblage d’un réseau interne. Technicien support ISM Canada January 1997  –  January 2001  (4 years 1 month) Intégrer différents périphériques.  \nAssurer le soutien technique pour des problèmes spécifiques auprès des autres techniciens  \n(support de niveau 3). \nAssembler, configurer et installer des postes de travail sur le réseau.  \nReconfigurer des postes de travail hors fonction. \nRéparer des postes de travail, imprimantes et autres périphériques (Terminaux ICOT, WYSE, etc). \nInstaller, configurer et faire le câblage d’un réseau interne. Technicien support ISM Canada January 1997  –  January 2001  (4 years 1 month) Intégrer différents périphériques.  \nAssurer le soutien technique pour des problèmes spécifiques auprès des autres techniciens  \n(support de niveau 3). \nAssembler, configurer et installer des postes de travail sur le réseau.  \nReconfigurer des postes de travail hors fonction. \nRéparer des postes de travail, imprimantes et autres périphériques (Terminaux ICOT, WYSE, etc). \nInstaller, configurer et faire le câblage d’un réseau interne. Languages Espagnol Limited working proficiency English Full professional proficiency French Native or bilingual proficiency Espagnol Limited working proficiency English Full professional proficiency French Native or bilingual proficiency Espagnol Limited working proficiency English Full professional proficiency French Native or bilingual proficiency Limited working proficiency Full professional proficiency Native or bilingual proficiency Skills Image Building VBScript HTML WinBatch InstallShield VMware ESX VMware Workstation Windows 7 windows xp Interactive Kiosks Windows Server Windows 7 Migration Software Packaging XP Skills  Image Building VBScript HTML WinBatch InstallShield VMware ESX VMware Workstation Windows 7 windows xp Interactive Kiosks Windows Server Windows 7 Migration Software Packaging XP Image Building VBScript HTML WinBatch InstallShield VMware ESX VMware Workstation Windows 7 windows xp Interactive Kiosks Windows Server Windows 7 Migration Software Packaging XP Image Building VBScript HTML WinBatch InstallShield VMware ESX VMware Workstation Windows 7 windows xp Interactive Kiosks Windows Server Windows 7 Migration Software Packaging XP Education Institut Teccart AEC,  Technologie Systemes Ordinés , A 1995  – 1997 Institut teccart Attestation d'etudes Collegiale,  Technologie Systeme ordines 1995  – 1996 Institut Teccart AEC,  Technologie Systemes Ordinés , A 1995  – 1997 Institut Teccart AEC,  Technologie Systemes Ordinés , A 1995  – 1997 Institut Teccart AEC,  Technologie Systemes Ordinés , A 1995  – 1997 Institut teccart Attestation d'etudes Collegiale,  Technologie Systeme ordines 1995  – 1996 Institut teccart Attestation d'etudes Collegiale,  Technologie Systeme ordines 1995  – 1996 Institut teccart Attestation d'etudes Collegiale,  Technologie Systeme ordines 1995  – 1996 Honors & Awards Additional Honors & Awards IBM Excellence Award ,2012 Additional Honors & Awards IBM Excellence Award ,2012 Additional Honors & Awards IBM Excellence Award ,2012 Additional Honors & Awards IBM Excellence Award ,2012 ", "Summary A solution focused leader with over 20 years experience of sales, development and delivery of complex productivity solutions to meet business problems across the finance and government sectors. \nClient centric approach to driving successful product development and delivery with acute business acumen with a broad technical knowledge, plus excellent soft skills to provide leadership and partner engagement in meeting client business needs. \nAn innovator and influencer experienced with leading, building and mentoring multidisciplinary engineering, delivery and sales teams across geographies and a passionate belief of delivering valued user focused solutions in all customer engagements. Summary A solution focused leader with over 20 years experience of sales, development and delivery of complex productivity solutions to meet business problems across the finance and government sectors. \nClient centric approach to driving successful product development and delivery with acute business acumen with a broad technical knowledge, plus excellent soft skills to provide leadership and partner engagement in meeting client business needs. \nAn innovator and influencer experienced with leading, building and mentoring multidisciplinary engineering, delivery and sales teams across geographies and a passionate belief of delivering valued user focused solutions in all customer engagements. A solution focused leader with over 20 years experience of sales, development and delivery of complex productivity solutions to meet business problems across the finance and government sectors. \nClient centric approach to driving successful product development and delivery with acute business acumen with a broad technical knowledge, plus excellent soft skills to provide leadership and partner engagement in meeting client business needs. \nAn innovator and influencer experienced with leading, building and mentoring multidisciplinary engineering, delivery and sales teams across geographies and a passionate belief of delivering valued user focused solutions in all customer engagements. A solution focused leader with over 20 years experience of sales, development and delivery of complex productivity solutions to meet business problems across the finance and government sectors. \nClient centric approach to driving successful product development and delivery with acute business acumen with a broad technical knowledge, plus excellent soft skills to provide leadership and partner engagement in meeting client business needs. \nAn innovator and influencer experienced with leading, building and mentoring multidisciplinary engineering, delivery and sales teams across geographies and a passionate belief of delivering valued user focused solutions in all customer engagements. Experience Solution Lead IBM February 2010  – Present (5 years 7 months) Sydney Area, Australia Designing and developing innovation products and services to deliver market disrupting outcomes Solution Lead IBM February 2010  – Present (5 years 7 months) Sydney Area, Australia Designing and developing innovation products and services to deliver market disrupting outcomes Solution Lead IBM February 2010  – Present (5 years 7 months) Sydney Area, Australia Designing and developing innovation products and services to deliver market disrupting outcomes Skills Skills     ", "Summary •Application/Middleware Integrator/Tester, System analyst and Windows OS (2008,7,XP) technical , Particularly interested in all client/server architectures and System automation software deployment for Windows OS using tools provided by Microsoft , IBM or self-developed . \n \nSpecialties: VBscript,COM+,XML databases,VB.NET, C#.NET, J2SE, powershell , python ,openSSL ,windows XP & 7 deployment tools , windows registry , certificate management , IIS/FTPS/Apache tomcat administrator , WSUS/patch dispatcher... Summary •Application/Middleware Integrator/Tester, System analyst and Windows OS (2008,7,XP) technical , Particularly interested in all client/server architectures and System automation software deployment for Windows OS using tools provided by Microsoft , IBM or self-developed . \n \nSpecialties: VBscript,COM+,XML databases,VB.NET, C#.NET, J2SE, powershell , python ,openSSL ,windows XP & 7 deployment tools , windows registry , certificate management , IIS/FTPS/Apache tomcat administrator , WSUS/patch dispatcher... •Application/Middleware Integrator/Tester, System analyst and Windows OS (2008,7,XP) technical , Particularly interested in all client/server architectures and System automation software deployment for Windows OS using tools provided by Microsoft , IBM or self-developed . \n \nSpecialties: VBscript,COM+,XML databases,VB.NET, C#.NET, J2SE, powershell , python ,openSSL ,windows XP & 7 deployment tools , windows registry , certificate management , IIS/FTPS/Apache tomcat administrator , WSUS/patch dispatcher... •Application/Middleware Integrator/Tester, System analyst and Windows OS (2008,7,XP) technical , Particularly interested in all client/server architectures and System automation software deployment for Windows OS using tools provided by Microsoft , IBM or self-developed . \n \nSpecialties: VBscript,COM+,XML databases,VB.NET, C#.NET, J2SE, powershell , python ,openSSL ,windows XP & 7 deployment tools , windows registry , certificate management , IIS/FTPS/Apache tomcat administrator , WSUS/patch dispatcher... Experience Account Solution Lead IBM Canada Ltd. May 2012  – Present (3 years 4 months) Montreal, Canada Area Within this role, plus my previous role as a Software packager/integrator & windows XP+7 OS Imager , I do/manage the following activities : \n1) Work with customers to proactively develop new services & procedures to enhance their experience using our best practices.  \n2) Demonstrate account knowledge & show adherence to the account scope & associated security policies/procedures that the client is adhering to.  \n3) Delivering flexibility in the understanding of our clients needs & fulfilling the requirements based on those needs in order to improve quality of IT customer environment.  \n4) Full focus/understanding of the client IT environment including all Workstations,Apps,Network and server physical/logical components to provide the up most secure/performance IT customer service. Account Solution Lead IBM Canada Ltd. May 2012  – Present (3 years 4 months) Montreal, Canada Area Within this role, plus my previous role as a Software packager/integrator & windows XP+7 OS Imager , I do/manage the following activities : \n1) Work with customers to proactively develop new services & procedures to enhance their experience using our best practices.  \n2) Demonstrate account knowledge & show adherence to the account scope & associated security policies/procedures that the client is adhering to.  \n3) Delivering flexibility in the understanding of our clients needs & fulfilling the requirements based on those needs in order to improve quality of IT customer environment.  \n4) Full focus/understanding of the client IT environment including all Workstations,Apps,Network and server physical/logical components to provide the up most secure/performance IT customer service. Account Solution Lead IBM Canada Ltd. May 2012  – Present (3 years 4 months) Montreal, Canada Area Within this role, plus my previous role as a Software packager/integrator & windows XP+7 OS Imager , I do/manage the following activities : \n1) Work with customers to proactively develop new services & procedures to enhance their experience using our best practices.  \n2) Demonstrate account knowledge & show adherence to the account scope & associated security policies/procedures that the client is adhering to.  \n3) Delivering flexibility in the understanding of our clients needs & fulfilling the requirements based on those needs in order to improve quality of IT customer environment.  \n4) Full focus/understanding of the client IT environment including all Workstations,Apps,Network and server physical/logical components to provide the up most secure/performance IT customer service. Languages Arabic English French Armenian Arabic English French Armenian Arabic English French Armenian Skills C# VB.NET VBScript MPI JavaSE OpenMP Java Distributed Systems Software Development XML C++ Eclipse Software Engineering COM+ SQL Programming JavaScript Operating Systems Windows Security Python Integration Agile Methodologies Tomcat Architectures Management Networking See 12+     See less Skills  C# VB.NET VBScript MPI JavaSE OpenMP Java Distributed Systems Software Development XML C++ Eclipse Software Engineering COM+ SQL Programming JavaScript Operating Systems Windows Security Python Integration Agile Methodologies Tomcat Architectures Management Networking See 12+     See less C# VB.NET VBScript MPI JavaSE OpenMP Java Distributed Systems Software Development XML C++ Eclipse Software Engineering COM+ SQL Programming JavaScript Operating Systems Windows Security Python Integration Agile Methodologies Tomcat Architectures Management Networking See 12+     See less C# VB.NET VBScript MPI JavaSE OpenMP Java Distributed Systems Software Development XML C++ Eclipse Software Engineering COM+ SQL Programming JavaScript Operating Systems Windows Security Python Integration Agile Methodologies Tomcat Architectures Management Networking See 12+     See less Education Université de Montréal - Ecole polytechnique de Montréal Bac,  Computer Enginnering 2007  – 2010 I'm more specialised in Parallell Programming , Distributed systems , and networking. Université de Montréal Bac.,  Computer Science 2004  – 2007 Université de Montréal - Ecole polytechnique de Montréal Bac,  Computer Enginnering 2007  – 2010 I'm more specialised in Parallell Programming , Distributed systems , and networking. Université de Montréal - Ecole polytechnique de Montréal Bac,  Computer Enginnering 2007  – 2010 I'm more specialised in Parallell Programming , Distributed systems , and networking. Université de Montréal - Ecole polytechnique de Montréal Bac,  Computer Enginnering 2007  – 2010 I'm more specialised in Parallell Programming , Distributed systems , and networking. Université de Montréal Bac.,  Computer Science 2004  – 2007 Université de Montréal Bac.,  Computer Science 2004  – 2007 Université de Montréal Bac.,  Computer Science 2004  – 2007 ", "Skills SAP SAP SRM SAP R/3 SAP ERP SAP Implementation SAP Enterprise Mobility SAP MM Business Process SAP BW Integration SAP Procurement Solution Architecture Materials Management Ariba ERP SD Supply Chain Management Business Analysis Master Data Management E-procurement Procure-to-Pay SRM eSourcing Procurement Project Management Sourcing Strategy IDOC ECC SAP Netweaver ABAP SDLC Business Process Design Consulting Business Transformation Data Migration See 21+     See less Skills  SAP SAP SRM SAP R/3 SAP ERP SAP Implementation SAP Enterprise Mobility SAP MM Business Process SAP BW Integration SAP Procurement Solution Architecture Materials Management Ariba ERP SD Supply Chain Management Business Analysis Master Data Management E-procurement Procure-to-Pay SRM eSourcing Procurement Project Management Sourcing Strategy IDOC ECC SAP Netweaver ABAP SDLC Business Process Design Consulting Business Transformation Data Migration See 21+     See less SAP SAP SRM SAP R/3 SAP ERP SAP Implementation SAP Enterprise Mobility SAP MM Business Process SAP BW Integration SAP Procurement Solution Architecture Materials Management Ariba ERP SD Supply Chain Management Business Analysis Master Data Management E-procurement Procure-to-Pay SRM eSourcing Procurement Project Management Sourcing Strategy IDOC ECC SAP Netweaver ABAP SDLC Business Process Design Consulting Business Transformation Data Migration See 21+     See less SAP SAP SRM SAP R/3 SAP ERP SAP Implementation SAP Enterprise Mobility SAP MM Business Process SAP BW Integration SAP Procurement Solution Architecture Materials Management Ariba ERP SD Supply Chain Management Business Analysis Master Data Management E-procurement Procure-to-Pay SRM eSourcing Procurement Project Management Sourcing Strategy IDOC ECC SAP Netweaver ABAP SDLC Business Process Design Consulting Business Transformation Data Migration See 21+     See less ", "Languages Kannada Kannada Kannada Skills Supply Chain Management Program Management Cross-functional Team... Business Transformation IT Transformation Solution Architecture Software Project... ERP Business Intelligence Business Process Requirements Analysis IT Strategy SAP Enterprise Software Integration Skills  Supply Chain Management Program Management Cross-functional Team... Business Transformation IT Transformation Solution Architecture Software Project... ERP Business Intelligence Business Process Requirements Analysis IT Strategy SAP Enterprise Software Integration Supply Chain Management Program Management Cross-functional Team... Business Transformation IT Transformation Solution Architecture Software Project... ERP Business Intelligence Business Process Requirements Analysis IT Strategy SAP Enterprise Software Integration Supply Chain Management Program Management Cross-functional Team... Business Transformation IT Transformation Solution Architecture Software Project... ERP Business Intelligence Business Process Requirements Analysis IT Strategy SAP Enterprise Software Integration Honors & Awards ", "Skills Customer Relations Digital Marketing DTS Business Transformation Call Center Service Delivery Customer Satisfaction Government IT Strategy Account Management Process Engineering Program Management Business Management Change Management Business Intelligence Channel Optimization Business Analysis Strategy Development Telecommunications Strategy Analysis Organizational Design Management Business Process Business Development Solution Architecture PMO Call Centers Leadership Management Consulting PMP Project Management Analytics Consulting Professional Services Outsourcing Business Process... Strategic Planning Governance Project Portfolio... Integration Executive Management Performance Improvement Business Process Design Business Process... Customer Service Vendor Management Enterprise Architecture CRM See 35+     See less Skills  Customer Relations Digital Marketing DTS Business Transformation Call Center Service Delivery Customer Satisfaction Government IT Strategy Account Management Process Engineering Program Management Business Management Change Management Business Intelligence Channel Optimization Business Analysis Strategy Development Telecommunications Strategy Analysis Organizational Design Management Business Process Business Development Solution Architecture PMO Call Centers Leadership Management Consulting PMP Project Management Analytics Consulting Professional Services Outsourcing Business Process... Strategic Planning Governance Project Portfolio... Integration Executive Management Performance Improvement Business Process Design Business Process... Customer Service Vendor Management Enterprise Architecture CRM See 35+     See less Customer Relations Digital Marketing DTS Business Transformation Call Center Service Delivery Customer Satisfaction Government IT Strategy Account Management Process Engineering Program Management Business Management Change Management Business Intelligence Channel Optimization Business Analysis Strategy Development Telecommunications Strategy Analysis Organizational Design Management Business Process Business Development Solution Architecture PMO Call Centers Leadership Management Consulting PMP Project Management Analytics Consulting Professional Services Outsourcing Business Process... Strategic Planning Governance Project Portfolio... Integration Executive Management Performance Improvement Business Process Design Business Process... Customer Service Vendor Management Enterprise Architecture CRM See 35+     See less Customer Relations Digital Marketing DTS Business Transformation Call Center Service Delivery Customer Satisfaction Government IT Strategy Account Management Process Engineering Program Management Business Management Change Management Business Intelligence Channel Optimization Business Analysis Strategy Development Telecommunications Strategy Analysis Organizational Design Management Business Process Business Development Solution Architecture PMO Call Centers Leadership Management Consulting PMP Project Management Analytics Consulting Professional Services Outsourcing Business Process... Strategic Planning Governance Project Portfolio... Integration Executive Management Performance Improvement Business Process Design Business Process... Customer Service Vendor Management Enterprise Architecture CRM See 35+     See less "]}