{"position": "Staff Process Engineer", "company": "Intel Corporation", "profiles": ["Skills Semiconductors JMP CVD Metrology Statistics Semiconductor Industry Start-ups Process Integration Design of Experiments Process Transfer Manufacturing Silicon Diffusion Cross-functional Team... Thin Films Failure Analysis CMOS SPC Yield Plasma Etch Engineering PECVD Characterization Process Engineering Photolithography Semiconductor Process PVD Six Sigma IC Electronics MEMS Microelectronics Etching Process Improvement Sputtering Mixed Signal Lithography Product Engineering Device Characterization Semiconductor... Atomic Layer Deposition Materials Science Analog Engineering Management Physics FMEA Nanotechnology Simulations Process Simulation R&D See 35+     See less Skills  Semiconductors JMP CVD Metrology Statistics Semiconductor Industry Start-ups Process Integration Design of Experiments Process Transfer Manufacturing Silicon Diffusion Cross-functional Team... Thin Films Failure Analysis CMOS SPC Yield Plasma Etch Engineering PECVD Characterization Process Engineering Photolithography Semiconductor Process PVD Six Sigma IC Electronics MEMS Microelectronics Etching Process Improvement Sputtering Mixed Signal Lithography Product Engineering Device Characterization Semiconductor... Atomic Layer Deposition Materials Science Analog Engineering Management Physics FMEA Nanotechnology Simulations Process Simulation R&D See 35+     See less Semiconductors JMP CVD Metrology Statistics Semiconductor Industry Start-ups Process Integration Design of Experiments Process Transfer Manufacturing Silicon Diffusion Cross-functional Team... Thin Films Failure Analysis CMOS SPC Yield Plasma Etch Engineering PECVD Characterization Process Engineering Photolithography Semiconductor Process PVD Six Sigma IC Electronics MEMS Microelectronics Etching Process Improvement Sputtering Mixed Signal Lithography Product Engineering Device Characterization Semiconductor... Atomic Layer Deposition Materials Science Analog Engineering Management Physics FMEA Nanotechnology Simulations Process Simulation R&D See 35+     See less Semiconductors JMP CVD Metrology Statistics Semiconductor Industry Start-ups Process Integration Design of Experiments Process Transfer Manufacturing Silicon Diffusion Cross-functional Team... Thin Films Failure Analysis CMOS SPC Yield Plasma Etch Engineering PECVD Characterization Process Engineering Photolithography Semiconductor Process PVD Six Sigma IC Electronics MEMS Microelectronics Etching Process Improvement Sputtering Mixed Signal Lithography Product Engineering Device Characterization Semiconductor... Atomic Layer Deposition Materials Science Analog Engineering Management Physics FMEA Nanotechnology Simulations Process Simulation R&D See 35+     See less ", "Summary Talented semiconductor process engineer with experience ranging from process development to scale-up and high volume manufacturing (HVM). Successful at working individually or with internal and external customers and teams. Summary Talented semiconductor process engineer with experience ranging from process development to scale-up and high volume manufacturing (HVM). Successful at working individually or with internal and external customers and teams. Talented semiconductor process engineer with experience ranging from process development to scale-up and high volume manufacturing (HVM). Successful at working individually or with internal and external customers and teams. Talented semiconductor process engineer with experience ranging from process development to scale-up and high volume manufacturing (HVM). Successful at working individually or with internal and external customers and teams. Experience Process Development Engineer - Etch Analog Devices May 2015  – Present (4 months) Development, evaluation, and enhancement of process formulations and methods to meet material specifications. Staff Process Engineer Intel Corporation April 2014  –  May 2015  (1 year 2 months) Hudson, MA • Support all dry etch factory sustaining and technology development needs. \n• Process integration support for MEMs fuel cell foundry product. Designated Campus Colleague (DCC) Associate The University of Arizona May 2014  –  August 2014  (4 months) Dry Etch course instructor (CSSPII) Senior Process Engineer (Dry Etch) Intel April 2007  –  April 2014  (7 years 1 month) Hudson, MA 2010 - 2014: Dry Etch Development  \n• Process development to support new business initiatives. \n \n2009 - Present: Intel College of Engineering Instructor \n• Developed 12-hour internal CSP302 Dry Etch course with annual offerings; offered through University of Arizona summer 2014. \n \n2006 - 2010: Dry Etch Sustaining \n• Process and equipment owner of FE and BE etch process layers on MERIE and ECR dry etch systems. Process Engineer (Thin Films) Intel Corporation June 2000  –  2006  (6 years) Hudson, MA / Santa Clara, CA 2004 - 2005: PECVD Thin Film Development \n• Antireflective Layer (ARL) Process Development to enable 65nm flash memory process. \n \n2000 - 2004: Thin Film Sustaining \n• Process and equipment owner for W CVD and dielectric PECVD layers.  \n• Process and equipment qualification of new CVD and etch tools for plant start-up and ramp Co-op Engineer GE Plastics June 1998  –  July 1999  (1 year 2 months) Cycoloy(R) Technology Group, Selkirk, NY \n•\tScaled-up and qualified extrusion process for flame-retardant (FR) Cycoloy(R) product line at new compounding facility in Bay St. Louis (BSL), Mississippi.  \n•\tDeveloped predictive performance models for FR Cycoloy(R) utilizing DOE experimentation techniques to create BSL capability estimates. \n•\tDeveloped and implemented automated web-based statistical analysis reports for Selkirk site using VBA macros. Process Development Engineer - Etch Analog Devices May 2015  – Present (4 months) Development, evaluation, and enhancement of process formulations and methods to meet material specifications. Process Development Engineer - Etch Analog Devices May 2015  – Present (4 months) Development, evaluation, and enhancement of process formulations and methods to meet material specifications. Staff Process Engineer Intel Corporation April 2014  –  May 2015  (1 year 2 months) Hudson, MA • Support all dry etch factory sustaining and technology development needs. \n• Process integration support for MEMs fuel cell foundry product. Staff Process Engineer Intel Corporation April 2014  –  May 2015  (1 year 2 months) Hudson, MA • Support all dry etch factory sustaining and technology development needs. \n• Process integration support for MEMs fuel cell foundry product. Designated Campus Colleague (DCC) Associate The University of Arizona May 2014  –  August 2014  (4 months) Dry Etch course instructor (CSSPII) Designated Campus Colleague (DCC) Associate The University of Arizona May 2014  –  August 2014  (4 months) Dry Etch course instructor (CSSPII) Senior Process Engineer (Dry Etch) Intel April 2007  –  April 2014  (7 years 1 month) Hudson, MA 2010 - 2014: Dry Etch Development  \n• Process development to support new business initiatives. \n \n2009 - Present: Intel College of Engineering Instructor \n• Developed 12-hour internal CSP302 Dry Etch course with annual offerings; offered through University of Arizona summer 2014. \n \n2006 - 2010: Dry Etch Sustaining \n• Process and equipment owner of FE and BE etch process layers on MERIE and ECR dry etch systems. Senior Process Engineer (Dry Etch) Intel April 2007  –  April 2014  (7 years 1 month) Hudson, MA 2010 - 2014: Dry Etch Development  \n• Process development to support new business initiatives. \n \n2009 - Present: Intel College of Engineering Instructor \n• Developed 12-hour internal CSP302 Dry Etch course with annual offerings; offered through University of Arizona summer 2014. \n \n2006 - 2010: Dry Etch Sustaining \n• Process and equipment owner of FE and BE etch process layers on MERIE and ECR dry etch systems. Process Engineer (Thin Films) Intel Corporation June 2000  –  2006  (6 years) Hudson, MA / Santa Clara, CA 2004 - 2005: PECVD Thin Film Development \n• Antireflective Layer (ARL) Process Development to enable 65nm flash memory process. \n \n2000 - 2004: Thin Film Sustaining \n• Process and equipment owner for W CVD and dielectric PECVD layers.  \n• Process and equipment qualification of new CVD and etch tools for plant start-up and ramp Process Engineer (Thin Films) Intel Corporation June 2000  –  2006  (6 years) Hudson, MA / Santa Clara, CA 2004 - 2005: PECVD Thin Film Development \n• Antireflective Layer (ARL) Process Development to enable 65nm flash memory process. \n \n2000 - 2004: Thin Film Sustaining \n• Process and equipment owner for W CVD and dielectric PECVD layers.  \n• Process and equipment qualification of new CVD and etch tools for plant start-up and ramp Co-op Engineer GE Plastics June 1998  –  July 1999  (1 year 2 months) Cycoloy(R) Technology Group, Selkirk, NY \n•\tScaled-up and qualified extrusion process for flame-retardant (FR) Cycoloy(R) product line at new compounding facility in Bay St. Louis (BSL), Mississippi.  \n•\tDeveloped predictive performance models for FR Cycoloy(R) utilizing DOE experimentation techniques to create BSL capability estimates. \n•\tDeveloped and implemented automated web-based statistical analysis reports for Selkirk site using VBA macros. Co-op Engineer GE Plastics June 1998  –  July 1999  (1 year 2 months) Cycoloy(R) Technology Group, Selkirk, NY \n•\tScaled-up and qualified extrusion process for flame-retardant (FR) Cycoloy(R) product line at new compounding facility in Bay St. Louis (BSL), Mississippi.  \n•\tDeveloped predictive performance models for FR Cycoloy(R) utilizing DOE experimentation techniques to create BSL capability estimates. \n•\tDeveloped and implemented automated web-based statistical analysis reports for Selkirk site using VBA macros. Skills Process Engineering Process Control Production Process... Process Improvement Semiconductor... Dry Etch Six Sigma Lean Manufacturing Design of Experiments Problem Solving TRIZ Teaching Computers Manufacturing SPC Thin Films Failure Analysis Semiconductors JMP Silicon Engineering Semiconductor Industry Process Simulation See 8+     See less Skills  Process Engineering Process Control Production Process... Process Improvement Semiconductor... Dry Etch Six Sigma Lean Manufacturing Design of Experiments Problem Solving TRIZ Teaching Computers Manufacturing SPC Thin Films Failure Analysis Semiconductors JMP Silicon Engineering Semiconductor Industry Process Simulation See 8+     See less Process Engineering Process Control Production Process... Process Improvement Semiconductor... Dry Etch Six Sigma Lean Manufacturing Design of Experiments Problem Solving TRIZ Teaching Computers Manufacturing SPC Thin Films Failure Analysis Semiconductors JMP Silicon Engineering Semiconductor Industry Process Simulation See 8+     See less Process Engineering Process Control Production Process... Process Improvement Semiconductor... Dry Etch Six Sigma Lean Manufacturing Design of Experiments Problem Solving TRIZ Teaching Computers Manufacturing SPC Thin Films Failure Analysis Semiconductors JMP Silicon Engineering Semiconductor Industry Process Simulation See 8+     See less Education Rensselaer Polytechnic Institute BS,  Chemical Engineering , (Cum laude); Electronic Arts minor 1995  – 2000 Activities and Societies:  Rensselaer Medalist ,  Tau Beta Pi Engineering Honor Society ,  DJ at WRPI Rensselaer Polytechnic Institute BS,  Chemical Engineering , (Cum laude); Electronic Arts minor 1995  – 2000 Activities and Societies:  Rensselaer Medalist ,  Tau Beta Pi Engineering Honor Society ,  DJ at WRPI Rensselaer Polytechnic Institute BS,  Chemical Engineering , (Cum laude); Electronic Arts minor 1995  – 2000 Activities and Societies:  Rensselaer Medalist ,  Tau Beta Pi Engineering Honor Society ,  DJ at WRPI Rensselaer Polytechnic Institute BS,  Chemical Engineering , (Cum laude); Electronic Arts minor 1995  – 2000 Activities and Societies:  Rensselaer Medalist ,  Tau Beta Pi Engineering Honor Society ,  DJ at WRPI ", "Summary  Leading Interconnect Development on Intel’s 14nm Technology Line of Core Microprocessor & SOC (System on Chip) Atom Products \n Managing Senior Technologists & Engineers, Field Service Engineers, Engineering Technicians & Module Technicians \n \nSpecialities: \n• Result-Oriented Mission-Critical Team Leadership & Personnel Management \n• Technical Innovation, Tactical & Strategic Planning, Flawless Execution \n• Process Architecture Definition \n• Factory-to-Factory Technology Transfer, Ramp into High-Volume Manufacturing & Factory Operations \n• Crisis Management Summary  Leading Interconnect Development on Intel’s 14nm Technology Line of Core Microprocessor & SOC (System on Chip) Atom Products \n Managing Senior Technologists & Engineers, Field Service Engineers, Engineering Technicians & Module Technicians \n \nSpecialities: \n• Result-Oriented Mission-Critical Team Leadership & Personnel Management \n• Technical Innovation, Tactical & Strategic Planning, Flawless Execution \n• Process Architecture Definition \n• Factory-to-Factory Technology Transfer, Ramp into High-Volume Manufacturing & Factory Operations \n• Crisis Management  Leading Interconnect Development on Intel’s 14nm Technology Line of Core Microprocessor & SOC (System on Chip) Atom Products \n Managing Senior Technologists & Engineers, Field Service Engineers, Engineering Technicians & Module Technicians \n \nSpecialities: \n• Result-Oriented Mission-Critical Team Leadership & Personnel Management \n• Technical Innovation, Tactical & Strategic Planning, Flawless Execution \n• Process Architecture Definition \n• Factory-to-Factory Technology Transfer, Ramp into High-Volume Manufacturing & Factory Operations \n• Crisis Management  Leading Interconnect Development on Intel’s 14nm Technology Line of Core Microprocessor & SOC (System on Chip) Atom Products \n Managing Senior Technologists & Engineers, Field Service Engineers, Engineering Technicians & Module Technicians \n \nSpecialities: \n• Result-Oriented Mission-Critical Team Leadership & Personnel Management \n• Technical Innovation, Tactical & Strategic Planning, Flawless Execution \n• Process Architecture Definition \n• Factory-to-Factory Technology Transfer, Ramp into High-Volume Manufacturing & Factory Operations \n• Crisis Management Skills Semiconductors Engineering IC Skills  Semiconductors Engineering IC Semiconductors Engineering IC Semiconductors Engineering IC Honors & Awards ", "Skills CMOS Design of Experiments Physics Microfabrication IC Manufacturing JMP Silicon Nanotechnology Thin Films Scanning Electron... Nanofabrication Lithography Process Integration Semiconductors Skills  CMOS Design of Experiments Physics Microfabrication IC Manufacturing JMP Silicon Nanotechnology Thin Films Scanning Electron... Nanofabrication Lithography Process Integration Semiconductors CMOS Design of Experiments Physics Microfabrication IC Manufacturing JMP Silicon Nanotechnology Thin Films Scanning Electron... Nanofabrication Lithography Process Integration Semiconductors CMOS Design of Experiments Physics Microfabrication IC Manufacturing JMP Silicon Nanotechnology Thin Films Scanning Electron... Nanofabrication Lithography Process Integration Semiconductors Honors & Awards ", "Experience iPhone Reliability Engineering Apple August 2013  – Present (2 years 1 month) san francisco bay area Kee is responsible for system level reliability of iPhones. His major responsibilities include identifying and validating product/component risks through FMEA and working with design teams to mitigate them, defining test methodology and test coverage to assure product reliability, and performing reliability prediction of failure mechanisms for future as well as existing iPhones. Senior Staff Reliability Engineer Intel Corporation December 2010  –  August 2013  (2 years 9 months) Kee was a senior staff reliability engineer working in Intel's Q&R modeling group, where his focus was to develop in-house Monte Carlo simulator to assess various reliability failure modes and to optimize the balance between product performance/power/reliability on Intel products. Kee's latest contribution was with Haswell CPUs where he helped set performance guardbands by predicting the amount of performance degradation. Haswell CPUs are now in Macbook Pros and Airs. Senior Staff Process Engineer Intel Corporation June 2006  –  December 2010  (4 years 7 months) Kee joined Intel in 2006 as a Senior Process Engineer. He worked on technology development and transfers on 32 nm and 22 nm process technologies. Kee was promoted to a Senior Staff engineer position in April, 2010. iPhone Reliability Engineering Apple August 2013  – Present (2 years 1 month) san francisco bay area Kee is responsible for system level reliability of iPhones. His major responsibilities include identifying and validating product/component risks through FMEA and working with design teams to mitigate them, defining test methodology and test coverage to assure product reliability, and performing reliability prediction of failure mechanisms for future as well as existing iPhones. iPhone Reliability Engineering Apple August 2013  – Present (2 years 1 month) san francisco bay area Kee is responsible for system level reliability of iPhones. His major responsibilities include identifying and validating product/component risks through FMEA and working with design teams to mitigate them, defining test methodology and test coverage to assure product reliability, and performing reliability prediction of failure mechanisms for future as well as existing iPhones. Senior Staff Reliability Engineer Intel Corporation December 2010  –  August 2013  (2 years 9 months) Kee was a senior staff reliability engineer working in Intel's Q&R modeling group, where his focus was to develop in-house Monte Carlo simulator to assess various reliability failure modes and to optimize the balance between product performance/power/reliability on Intel products. Kee's latest contribution was with Haswell CPUs where he helped set performance guardbands by predicting the amount of performance degradation. Haswell CPUs are now in Macbook Pros and Airs. Senior Staff Reliability Engineer Intel Corporation December 2010  –  August 2013  (2 years 9 months) Kee was a senior staff reliability engineer working in Intel's Q&R modeling group, where his focus was to develop in-house Monte Carlo simulator to assess various reliability failure modes and to optimize the balance between product performance/power/reliability on Intel products. Kee's latest contribution was with Haswell CPUs where he helped set performance guardbands by predicting the amount of performance degradation. Haswell CPUs are now in Macbook Pros and Airs. Senior Staff Process Engineer Intel Corporation June 2006  –  December 2010  (4 years 7 months) Kee joined Intel in 2006 as a Senior Process Engineer. He worked on technology development and transfers on 32 nm and 22 nm process technologies. Kee was promoted to a Senior Staff engineer position in April, 2010. Senior Staff Process Engineer Intel Corporation June 2006  –  December 2010  (4 years 7 months) Kee joined Intel in 2006 as a Senior Process Engineer. He worked on technology development and transfers on 32 nm and 22 nm process technologies. Kee was promoted to a Senior Staff engineer position in April, 2010. Languages English Native or bilingual proficiency Korean Native or bilingual proficiency English Native or bilingual proficiency Korean Native or bilingual proficiency English Native or bilingual proficiency Korean Native or bilingual proficiency Native or bilingual proficiency Native or bilingual proficiency Skills Semiconductors Intel SoC Microprocessors Reliability IC Design of Experiments Failure Analysis ASIC JMP SPC Thin Films Characterization CMOS Simulations Engineering Management R&D Nanotechnology Labview MEMS VLSI Matlab Process Integration Sensors See 9+     See less Skills  Semiconductors Intel SoC Microprocessors Reliability IC Design of Experiments Failure Analysis ASIC JMP SPC Thin Films Characterization CMOS Simulations Engineering Management R&D Nanotechnology Labview MEMS VLSI Matlab Process Integration Sensors See 9+     See less Semiconductors Intel SoC Microprocessors Reliability IC Design of Experiments Failure Analysis ASIC JMP SPC Thin Films Characterization CMOS Simulations Engineering Management R&D Nanotechnology Labview MEMS VLSI Matlab Process Integration Sensors See 9+     See less Semiconductors Intel SoC Microprocessors Reliability IC Design of Experiments Failure Analysis ASIC JMP SPC Thin Films Characterization CMOS Simulations Engineering Management R&D Nanotechnology Labview MEMS VLSI Matlab Process Integration Sensors See 9+     See less Education University of Illinois at Urbana-Champaign MS,  Finance 2001  – 2006 While pursuing his PhD, Kee followed his interest in Finance by taking a course or two per semester at the University. Initially he was interested in personal asset management and that led him to study equity valuation and financial engineering for derivatives. University of Illinois at Urbana-Champaign Ph.D,  Electrical and Computer Engineering 2001  – 2006 Kee has 5 years of hands on experience in developing novel MEMS sensors, actuators, and integration of these components into fully integrated systems. Kee was exposed to the whole design and fabrication phases: concept development, mask design, process development, process integration, and testings. Kee has authored 3 patents and published 11 journal and 33 conference papers during his tenure. Georgia Institute of Technology MS,  Mechanical Engineering (Bio) 1998  – 2000 Kee's focus was to develop computer simulations to optimize a surgical procedure of a heart disease by quantifying and comparing the friction losses of possible scenarios. Hanyang University BS,  Mechanical Engineering 1998 University of Illinois at Urbana-Champaign MS,  Finance 2001  – 2006 While pursuing his PhD, Kee followed his interest in Finance by taking a course or two per semester at the University. Initially he was interested in personal asset management and that led him to study equity valuation and financial engineering for derivatives. University of Illinois at Urbana-Champaign MS,  Finance 2001  – 2006 While pursuing his PhD, Kee followed his interest in Finance by taking a course or two per semester at the University. Initially he was interested in personal asset management and that led him to study equity valuation and financial engineering for derivatives. University of Illinois at Urbana-Champaign MS,  Finance 2001  – 2006 While pursuing his PhD, Kee followed his interest in Finance by taking a course or two per semester at the University. Initially he was interested in personal asset management and that led him to study equity valuation and financial engineering for derivatives. University of Illinois at Urbana-Champaign Ph.D,  Electrical and Computer Engineering 2001  – 2006 Kee has 5 years of hands on experience in developing novel MEMS sensors, actuators, and integration of these components into fully integrated systems. Kee was exposed to the whole design and fabrication phases: concept development, mask design, process development, process integration, and testings. Kee has authored 3 patents and published 11 journal and 33 conference papers during his tenure. University of Illinois at Urbana-Champaign Ph.D,  Electrical and Computer Engineering 2001  – 2006 Kee has 5 years of hands on experience in developing novel MEMS sensors, actuators, and integration of these components into fully integrated systems. Kee was exposed to the whole design and fabrication phases: concept development, mask design, process development, process integration, and testings. Kee has authored 3 patents and published 11 journal and 33 conference papers during his tenure. University of Illinois at Urbana-Champaign Ph.D,  Electrical and Computer Engineering 2001  – 2006 Kee has 5 years of hands on experience in developing novel MEMS sensors, actuators, and integration of these components into fully integrated systems. Kee was exposed to the whole design and fabrication phases: concept development, mask design, process development, process integration, and testings. Kee has authored 3 patents and published 11 journal and 33 conference papers during his tenure. Georgia Institute of Technology MS,  Mechanical Engineering (Bio) 1998  – 2000 Kee's focus was to develop computer simulations to optimize a surgical procedure of a heart disease by quantifying and comparing the friction losses of possible scenarios. Georgia Institute of Technology MS,  Mechanical Engineering (Bio) 1998  – 2000 Kee's focus was to develop computer simulations to optimize a surgical procedure of a heart disease by quantifying and comparing the friction losses of possible scenarios. Georgia Institute of Technology MS,  Mechanical Engineering (Bio) 1998  – 2000 Kee's focus was to develop computer simulations to optimize a surgical procedure of a heart disease by quantifying and comparing the friction losses of possible scenarios. Hanyang University BS,  Mechanical Engineering 1998 Hanyang University BS,  Mechanical Engineering 1998 Hanyang University BS,  Mechanical Engineering 1998 ", "Skills Lithography Imaging Systems Semiconductors Photolithography Electrical Engineering Semiconductor... EDA Imaging Science Experimentation Simulations Semiconductor Industry CMOS ASIC TCL Debugging IC See 1+     See less Skills  Lithography Imaging Systems Semiconductors Photolithography Electrical Engineering Semiconductor... EDA Imaging Science Experimentation Simulations Semiconductor Industry CMOS ASIC TCL Debugging IC See 1+     See less Lithography Imaging Systems Semiconductors Photolithography Electrical Engineering Semiconductor... EDA Imaging Science Experimentation Simulations Semiconductor Industry CMOS ASIC TCL Debugging IC See 1+     See less Lithography Imaging Systems Semiconductors Photolithography Electrical Engineering Semiconductor... EDA Imaging Science Experimentation Simulations Semiconductor Industry CMOS ASIC TCL Debugging IC See 1+     See less ", "Summary QUALITY AND RELIABILITY, TECHNOLOGY EXPERT \nAn accomplished Technology Development and Quality & Reliability (Q&R) engineer with experience in semiconductor, optoelectronic, and storage industries. Highly knowledgeable in all Q&R areas as well as material engineering, packaging, and tribology. An innovative, self-starter with an excellent sense of teamwork. \nExperience in: Reliability physics, Product qualification, Statistics (DOE, process control, analysis), Technology Development, Reliability test, Device reliability, Tribology, Rheology Summary QUALITY AND RELIABILITY, TECHNOLOGY EXPERT \nAn accomplished Technology Development and Quality & Reliability (Q&R) engineer with experience in semiconductor, optoelectronic, and storage industries. Highly knowledgeable in all Q&R areas as well as material engineering, packaging, and tribology. An innovative, self-starter with an excellent sense of teamwork. \nExperience in: Reliability physics, Product qualification, Statistics (DOE, process control, analysis), Technology Development, Reliability test, Device reliability, Tribology, Rheology QUALITY AND RELIABILITY, TECHNOLOGY EXPERT \nAn accomplished Technology Development and Quality & Reliability (Q&R) engineer with experience in semiconductor, optoelectronic, and storage industries. Highly knowledgeable in all Q&R areas as well as material engineering, packaging, and tribology. An innovative, self-starter with an excellent sense of teamwork. \nExperience in: Reliability physics, Product qualification, Statistics (DOE, process control, analysis), Technology Development, Reliability test, Device reliability, Tribology, Rheology QUALITY AND RELIABILITY, TECHNOLOGY EXPERT \nAn accomplished Technology Development and Quality & Reliability (Q&R) engineer with experience in semiconductor, optoelectronic, and storage industries. Highly knowledgeable in all Q&R areas as well as material engineering, packaging, and tribology. An innovative, self-starter with an excellent sense of teamwork. \nExperience in: Reliability physics, Product qualification, Statistics (DOE, process control, analysis), Technology Development, Reliability test, Device reliability, Tribology, Rheology Languages   Skills Skills     ", "Summary Engineering solutions by exhibiting robust decision-making based on known information and justifiable judgement. Summary Engineering solutions by exhibiting robust decision-making based on known information and justifiable judgement. Engineering solutions by exhibiting robust decision-making based on known information and justifiable judgement. Engineering solutions by exhibiting robust decision-making based on known information and justifiable judgement. Experience Engineering - TD Manager Intel Corporation July 2013  – Present (2 years 2 months) Staff Process Engineer - EUV systems Intel Corporation August 2011  –  June 2013  (1 year 11 months) Staff Process Engineer Intel Corporation April 2010  –  August 2011  (1 year 5 months) Senior Process Engineer Intel Corporation January 2006  –  April 2010  (4 years 4 months) Engineering - TD Manager Intel Corporation July 2013  – Present (2 years 2 months) Engineering - TD Manager Intel Corporation July 2013  – Present (2 years 2 months) Staff Process Engineer - EUV systems Intel Corporation August 2011  –  June 2013  (1 year 11 months) Staff Process Engineer - EUV systems Intel Corporation August 2011  –  June 2013  (1 year 11 months) Staff Process Engineer Intel Corporation April 2010  –  August 2011  (1 year 5 months) Staff Process Engineer Intel Corporation April 2010  –  August 2011  (1 year 5 months) Senior Process Engineer Intel Corporation January 2006  –  April 2010  (4 years 4 months) Senior Process Engineer Intel Corporation January 2006  –  April 2010  (4 years 4 months) Skills Semiconductors Chemical Engineering Engineering Lithography Design of Experiments JMP Thin Films Process Simulation Simulations Characterization Materials Science SPC Skills  Semiconductors Chemical Engineering Engineering Lithography Design of Experiments JMP Thin Films Process Simulation Simulations Characterization Materials Science SPC Semiconductors Chemical Engineering Engineering Lithography Design of Experiments JMP Thin Films Process Simulation Simulations Characterization Materials Science SPC Semiconductors Chemical Engineering Engineering Lithography Design of Experiments JMP Thin Films Process Simulation Simulations Characterization Materials Science SPC Education University of Colorado Boulder PhD,  Chemical Engineering 2001  – 2005 University of Colorado Boulder MS,  Chemical Engineering 2001  – 2003 University of Mumbai BChem Eng - UDCT (now UICT),  Chemical Engineering 1997  – 2001 University of Colorado Boulder PhD,  Chemical Engineering 2001  – 2005 University of Colorado Boulder PhD,  Chemical Engineering 2001  – 2005 University of Colorado Boulder PhD,  Chemical Engineering 2001  – 2005 University of Colorado Boulder MS,  Chemical Engineering 2001  – 2003 University of Colorado Boulder MS,  Chemical Engineering 2001  – 2003 University of Colorado Boulder MS,  Chemical Engineering 2001  – 2003 University of Mumbai BChem Eng - UDCT (now UICT),  Chemical Engineering 1997  – 2001 University of Mumbai BChem Eng - UDCT (now UICT),  Chemical Engineering 1997  – 2001 University of Mumbai BChem Eng - UDCT (now UICT),  Chemical Engineering 1997  – 2001 ", "Summary Executive Summary \nA seasoned technical and organizational leader with 17+ years in the semiconductor industry with responsibilities and experiences spanning the factory life cycle from technology development & capacity planning to yield & ramp to shutdown. Experience in performing technical diligence & portfolio valuation and build/execute a go-to-market plan for an IC/software product. Experience at both large and small companies with many technical achievements and responsibilities ranging from individual contributor to director with multiple direct report managers. \n \nObjective \nServe as a hands-on technologist or manufacturing leader responsible for key organizations or technology innovations, guiding executive level business decisions, and contributing to internal and external technology strategies that deliver superior results to the entity. Summary Executive Summary \nA seasoned technical and organizational leader with 17+ years in the semiconductor industry with responsibilities and experiences spanning the factory life cycle from technology development & capacity planning to yield & ramp to shutdown. Experience in performing technical diligence & portfolio valuation and build/execute a go-to-market plan for an IC/software product. Experience at both large and small companies with many technical achievements and responsibilities ranging from individual contributor to director with multiple direct report managers. \n \nObjective \nServe as a hands-on technologist or manufacturing leader responsible for key organizations or technology innovations, guiding executive level business decisions, and contributing to internal and external technology strategies that deliver superior results to the entity. Executive Summary \nA seasoned technical and organizational leader with 17+ years in the semiconductor industry with responsibilities and experiences spanning the factory life cycle from technology development & capacity planning to yield & ramp to shutdown. Experience in performing technical diligence & portfolio valuation and build/execute a go-to-market plan for an IC/software product. Experience at both large and small companies with many technical achievements and responsibilities ranging from individual contributor to director with multiple direct report managers. \n \nObjective \nServe as a hands-on technologist or manufacturing leader responsible for key organizations or technology innovations, guiding executive level business decisions, and contributing to internal and external technology strategies that deliver superior results to the entity. Executive Summary \nA seasoned technical and organizational leader with 17+ years in the semiconductor industry with responsibilities and experiences spanning the factory life cycle from technology development & capacity planning to yield & ramp to shutdown. Experience in performing technical diligence & portfolio valuation and build/execute a go-to-market plan for an IC/software product. Experience at both large and small companies with many technical achievements and responsibilities ranging from individual contributor to director with multiple direct report managers. \n \nObjective \nServe as a hands-on technologist or manufacturing leader responsible for key organizations or technology innovations, guiding executive level business decisions, and contributing to internal and external technology strategies that deliver superior results to the entity. Experience IMO Factory Infrastructure Manager Intel Corporation August 2015  – Present (1 month) Santa Clara, CA Director WD, a Western Digital company October 2013  – Present (1 year 11 months) Fremont, CA Responsible for wafer process development and execution for WD's HAMR (Heat Assisted Magnetic Recording) program. HAMR requires development of new head architectures, process cells, integrated flow, materials and circuit elements including optical and magnetic components. Vice President, Engineering and Operations Insite Partners, LLC August 2012  –  October 2013  (1 year 3 months) Cupertino, CA Consulting including technical solutions, product roadmap/development, infrastructure and operational execution for technology companies with manufacturing assets. \n \nOur particular areas of focus: Telecom, Millimeter-Wave, RF, Mixed-Signal, Solar, and Wind markets. Director Infinera 2008  –  August 2012  (4 years) Sunnyvale, CA Responsible for wafer fab, die fab, assembly, and test engineering in a small volume, captive InP-based photonic integrated circuit factory. Managed up to 2 first line managers and 15 engineers and engineering technicians. Member of a six person team leading a 120 person division under a VP.  \n•\tDeveloped business plan, KPIs and grew size of existing fab engineering team 4x.  \n•\tLed task forces for yield and hardware issues.  \n•\tResponsible for tools including development, recipes, training, and 24x7 maintenance. Collaborated to generate new job functions and transition operational roles to new partners.  \n•\tDefined and implemented new metrology resulting in yield and development achievements in defect, CD, registration, and integration. \n•\tBuilt fab capacity model based on marketing & yield inputs and generated strategic expansion plan including wafer size conversion options.  \n•\tGenerated a capability/constraint evaluation process. Drove requirements through install/qualification for additional capacity and capability. \n•\tRemote assignment for 6 months to lead termination of operations at a subsidiary fab. Exceeded final manufacturing and development goals ahead of schedule.  \n•\tCompleted subsidiary shutdown asset disposition and building decommission. \n•\tExpertise in many fab disciplines including: photo, wet etch, plasma etch, CVD, PVD, metrology Department Manager Intel Corporation 2004  –  2008  (4 years) Responsible for tool availability, cost improvements, and large-scale production output for etch and thin film metrology factory modules at one of Intel’s 300mm development factories. Managed up to 5 first line managers and in-turn 45 engineers and co-managed 40+ technicians. Member of a ten person team leading a 1000 person division under a VP. \n•\tDeveloped roadmap, KPIs, task division, budget and business model for team. \n•\tCoached, led, and individually contributed to defect, yield, and tool capacity task forces.  \n•\tManaged install and qualification activities for capital equipment transition to 65nm node. \n•\tCo-led etch technology, capacity and cost roadmap projects amongst three remote manufacturing factories on 90nm and 65nm technology nodes. Engineering Group Leader Intel Corporation 2000  –  2004  (4 years) Hillsboro, Oregon Responsible for front end dry etch including 13 process modules over 6 platforms at Intel’s 90nm/ 300mm wafer development factory. Managed 15 engineers, 3 engineering techs and co-managed 64 technicians. Member of a three person team leading a 50 person department under an Area Manager. \n•\tDeveloped roadmap, task division, budget and business model for team.  \n•\tDelivered several major process overhauls and late technology insertions including new platform hardware development and shrink enabling technologies. \n•\tCompleted tool installations and full manufacturing build-out.  \n•\tDelivered yield, defect and tool availability improvements. Engineering Group Leader and Staff Process Engineer Intel Corporation 1996  –  2000  (4 years) Hillsboro, OR First level management role leading a large dry etch late-stage development/ramp team including: \n• Delivered state-of-the-art poly gate width and defect control as a co-lead of a cross-functional team. \n• Led cross-site domestic and international technical teams. \nFirst level management role leading a small wet etch manufacturing team. \nMany individual contributions in wet cleans as a tool and process owner including: \n• Generated innovations in modeling queuing behavior in cluster tools to deliver both yield and efficiency gains. \n• Significant yield improvement via more efficient residue removal and arresting product related cross-contamination. IMO Factory Infrastructure Manager Intel Corporation August 2015  – Present (1 month) Santa Clara, CA IMO Factory Infrastructure Manager Intel Corporation August 2015  – Present (1 month) Santa Clara, CA Director WD, a Western Digital company October 2013  – Present (1 year 11 months) Fremont, CA Responsible for wafer process development and execution for WD's HAMR (Heat Assisted Magnetic Recording) program. HAMR requires development of new head architectures, process cells, integrated flow, materials and circuit elements including optical and magnetic components. Director WD, a Western Digital company October 2013  – Present (1 year 11 months) Fremont, CA Responsible for wafer process development and execution for WD's HAMR (Heat Assisted Magnetic Recording) program. HAMR requires development of new head architectures, process cells, integrated flow, materials and circuit elements including optical and magnetic components. Vice President, Engineering and Operations Insite Partners, LLC August 2012  –  October 2013  (1 year 3 months) Cupertino, CA Consulting including technical solutions, product roadmap/development, infrastructure and operational execution for technology companies with manufacturing assets. \n \nOur particular areas of focus: Telecom, Millimeter-Wave, RF, Mixed-Signal, Solar, and Wind markets. Vice President, Engineering and Operations Insite Partners, LLC August 2012  –  October 2013  (1 year 3 months) Cupertino, CA Consulting including technical solutions, product roadmap/development, infrastructure and operational execution for technology companies with manufacturing assets. \n \nOur particular areas of focus: Telecom, Millimeter-Wave, RF, Mixed-Signal, Solar, and Wind markets. Director Infinera 2008  –  August 2012  (4 years) Sunnyvale, CA Responsible for wafer fab, die fab, assembly, and test engineering in a small volume, captive InP-based photonic integrated circuit factory. Managed up to 2 first line managers and 15 engineers and engineering technicians. Member of a six person team leading a 120 person division under a VP.  \n•\tDeveloped business plan, KPIs and grew size of existing fab engineering team 4x.  \n•\tLed task forces for yield and hardware issues.  \n•\tResponsible for tools including development, recipes, training, and 24x7 maintenance. Collaborated to generate new job functions and transition operational roles to new partners.  \n•\tDefined and implemented new metrology resulting in yield and development achievements in defect, CD, registration, and integration. \n•\tBuilt fab capacity model based on marketing & yield inputs and generated strategic expansion plan including wafer size conversion options.  \n•\tGenerated a capability/constraint evaluation process. Drove requirements through install/qualification for additional capacity and capability. \n•\tRemote assignment for 6 months to lead termination of operations at a subsidiary fab. Exceeded final manufacturing and development goals ahead of schedule.  \n•\tCompleted subsidiary shutdown asset disposition and building decommission. \n•\tExpertise in many fab disciplines including: photo, wet etch, plasma etch, CVD, PVD, metrology Director Infinera 2008  –  August 2012  (4 years) Sunnyvale, CA Responsible for wafer fab, die fab, assembly, and test engineering in a small volume, captive InP-based photonic integrated circuit factory. Managed up to 2 first line managers and 15 engineers and engineering technicians. Member of a six person team leading a 120 person division under a VP.  \n•\tDeveloped business plan, KPIs and grew size of existing fab engineering team 4x.  \n•\tLed task forces for yield and hardware issues.  \n•\tResponsible for tools including development, recipes, training, and 24x7 maintenance. Collaborated to generate new job functions and transition operational roles to new partners.  \n•\tDefined and implemented new metrology resulting in yield and development achievements in defect, CD, registration, and integration. \n•\tBuilt fab capacity model based on marketing & yield inputs and generated strategic expansion plan including wafer size conversion options.  \n•\tGenerated a capability/constraint evaluation process. Drove requirements through install/qualification for additional capacity and capability. \n•\tRemote assignment for 6 months to lead termination of operations at a subsidiary fab. Exceeded final manufacturing and development goals ahead of schedule.  \n•\tCompleted subsidiary shutdown asset disposition and building decommission. \n•\tExpertise in many fab disciplines including: photo, wet etch, plasma etch, CVD, PVD, metrology Department Manager Intel Corporation 2004  –  2008  (4 years) Responsible for tool availability, cost improvements, and large-scale production output for etch and thin film metrology factory modules at one of Intel’s 300mm development factories. Managed up to 5 first line managers and in-turn 45 engineers and co-managed 40+ technicians. Member of a ten person team leading a 1000 person division under a VP. \n•\tDeveloped roadmap, KPIs, task division, budget and business model for team. \n•\tCoached, led, and individually contributed to defect, yield, and tool capacity task forces.  \n•\tManaged install and qualification activities for capital equipment transition to 65nm node. \n•\tCo-led etch technology, capacity and cost roadmap projects amongst three remote manufacturing factories on 90nm and 65nm technology nodes. Department Manager Intel Corporation 2004  –  2008  (4 years) Responsible for tool availability, cost improvements, and large-scale production output for etch and thin film metrology factory modules at one of Intel’s 300mm development factories. Managed up to 5 first line managers and in-turn 45 engineers and co-managed 40+ technicians. Member of a ten person team leading a 1000 person division under a VP. \n•\tDeveloped roadmap, KPIs, task division, budget and business model for team. \n•\tCoached, led, and individually contributed to defect, yield, and tool capacity task forces.  \n•\tManaged install and qualification activities for capital equipment transition to 65nm node. \n•\tCo-led etch technology, capacity and cost roadmap projects amongst three remote manufacturing factories on 90nm and 65nm technology nodes. Engineering Group Leader Intel Corporation 2000  –  2004  (4 years) Hillsboro, Oregon Responsible for front end dry etch including 13 process modules over 6 platforms at Intel’s 90nm/ 300mm wafer development factory. Managed 15 engineers, 3 engineering techs and co-managed 64 technicians. Member of a three person team leading a 50 person department under an Area Manager. \n•\tDeveloped roadmap, task division, budget and business model for team.  \n•\tDelivered several major process overhauls and late technology insertions including new platform hardware development and shrink enabling technologies. \n•\tCompleted tool installations and full manufacturing build-out.  \n•\tDelivered yield, defect and tool availability improvements. Engineering Group Leader Intel Corporation 2000  –  2004  (4 years) Hillsboro, Oregon Responsible for front end dry etch including 13 process modules over 6 platforms at Intel’s 90nm/ 300mm wafer development factory. Managed 15 engineers, 3 engineering techs and co-managed 64 technicians. Member of a three person team leading a 50 person department under an Area Manager. \n•\tDeveloped roadmap, task division, budget and business model for team.  \n•\tDelivered several major process overhauls and late technology insertions including new platform hardware development and shrink enabling technologies. \n•\tCompleted tool installations and full manufacturing build-out.  \n•\tDelivered yield, defect and tool availability improvements. Engineering Group Leader and Staff Process Engineer Intel Corporation 1996  –  2000  (4 years) Hillsboro, OR First level management role leading a large dry etch late-stage development/ramp team including: \n• Delivered state-of-the-art poly gate width and defect control as a co-lead of a cross-functional team. \n• Led cross-site domestic and international technical teams. \nFirst level management role leading a small wet etch manufacturing team. \nMany individual contributions in wet cleans as a tool and process owner including: \n• Generated innovations in modeling queuing behavior in cluster tools to deliver both yield and efficiency gains. \n• Significant yield improvement via more efficient residue removal and arresting product related cross-contamination. Engineering Group Leader and Staff Process Engineer Intel Corporation 1996  –  2000  (4 years) Hillsboro, OR First level management role leading a large dry etch late-stage development/ramp team including: \n• Delivered state-of-the-art poly gate width and defect control as a co-lead of a cross-functional team. \n• Led cross-site domestic and international technical teams. \nFirst level management role leading a small wet etch manufacturing team. \nMany individual contributions in wet cleans as a tool and process owner including: \n• Generated innovations in modeling queuing behavior in cluster tools to deliver both yield and efficiency gains. \n• Significant yield improvement via more efficient residue removal and arresting product related cross-contamination. Skills Semiconductors Dry Etch SPC Wet Chemical Etching IC Metrology Semiconductor Industry Design of Experiments Test Engineering Thin Films Equipment Maintenance Wafer Fab Manufacturing... Tool Selection Capacity Planning Photolithography Analysis CVD PVD Solvent cleaning Plasma etch Plasma Etch Engineering Management RF M&A analysis Executive Coaching New Business Development M&A Negotiations Manufacturing Building Relationships Integration Engineering Yield Cross-functional Team... See 19+     See less Skills  Semiconductors Dry Etch SPC Wet Chemical Etching IC Metrology Semiconductor Industry Design of Experiments Test Engineering Thin Films Equipment Maintenance Wafer Fab Manufacturing... Tool Selection Capacity Planning Photolithography Analysis CVD PVD Solvent cleaning Plasma etch Plasma Etch Engineering Management RF M&A analysis Executive Coaching New Business Development M&A Negotiations Manufacturing Building Relationships Integration Engineering Yield Cross-functional Team... See 19+     See less Semiconductors Dry Etch SPC Wet Chemical Etching IC Metrology Semiconductor Industry Design of Experiments Test Engineering Thin Films Equipment Maintenance Wafer Fab Manufacturing... Tool Selection Capacity Planning Photolithography Analysis CVD PVD Solvent cleaning Plasma etch Plasma Etch Engineering Management RF M&A analysis Executive Coaching New Business Development M&A Negotiations Manufacturing Building Relationships Integration Engineering Yield Cross-functional Team... See 19+     See less Semiconductors Dry Etch SPC Wet Chemical Etching IC Metrology Semiconductor Industry Design of Experiments Test Engineering Thin Films Equipment Maintenance Wafer Fab Manufacturing... Tool Selection Capacity Planning Photolithography Analysis CVD PVD Solvent cleaning Plasma etch Plasma Etch Engineering Management RF M&A analysis Executive Coaching New Business Development M&A Negotiations Manufacturing Building Relationships Integration Engineering Yield Cross-functional Team... See 19+     See less Education University of Illinois at Urbana-Champaign PhD,  Electrical Engineering 1993  – 1995 Ph.D. dissertation: Manufacturable millimeter-wave gallium arsenide MESFET integrated circuit technology University of Illinois at Urbana-Champaign MS,  Electrical and Computer Engineering 1991  – 1993 M.S. thesis: Array process technology for quantum well infrared photodetectors University of Illinois at Urbana-Champaign BS,  Electrical and Computer Engineering 1987  – 1991 University of Illinois at Urbana-Champaign PhD,  Electrical Engineering 1993  – 1995 Ph.D. dissertation: Manufacturable millimeter-wave gallium arsenide MESFET integrated circuit technology University of Illinois at Urbana-Champaign PhD,  Electrical Engineering 1993  – 1995 Ph.D. dissertation: Manufacturable millimeter-wave gallium arsenide MESFET integrated circuit technology University of Illinois at Urbana-Champaign PhD,  Electrical Engineering 1993  – 1995 Ph.D. dissertation: Manufacturable millimeter-wave gallium arsenide MESFET integrated circuit technology University of Illinois at Urbana-Champaign MS,  Electrical and Computer Engineering 1991  – 1993 M.S. thesis: Array process technology for quantum well infrared photodetectors University of Illinois at Urbana-Champaign MS,  Electrical and Computer Engineering 1991  – 1993 M.S. thesis: Array process technology for quantum well infrared photodetectors University of Illinois at Urbana-Champaign MS,  Electrical and Computer Engineering 1991  – 1993 M.S. thesis: Array process technology for quantum well infrared photodetectors University of Illinois at Urbana-Champaign BS,  Electrical and Computer Engineering 1987  – 1991 University of Illinois at Urbana-Champaign BS,  Electrical and Computer Engineering 1987  – 1991 University of Illinois at Urbana-Champaign BS,  Electrical and Computer Engineering 1987  – 1991 ", "Experience System Integration Consultant Microvision 1995  –  2014  (19 years) Portland, Oregon Machine vision inspection. Sr. Staff Process Engineer Intel Corporation July 1974  –  February 1995  (20 years 8 months) Technology Development. Process design and advanced manufacturing equipment. CVD, CMP, High Vacuum systems, Testing, Process control. System Integration Consultant Microvision 1995  –  2014  (19 years) Portland, Oregon Machine vision inspection. System Integration Consultant Microvision 1995  –  2014  (19 years) Portland, Oregon Machine vision inspection. Sr. Staff Process Engineer Intel Corporation July 1974  –  February 1995  (20 years 8 months) Technology Development. Process design and advanced manufacturing equipment. CVD, CMP, High Vacuum systems, Testing, Process control. Sr. Staff Process Engineer Intel Corporation July 1974  –  February 1995  (20 years 8 months) Technology Development. Process design and advanced manufacturing equipment. CVD, CMP, High Vacuum systems, Testing, Process control. Skills Microsoft Office Skills  Microsoft Office Microsoft Office Microsoft Office Education Purdue University MSE,  Electrical and Electronics Engineering 1972  – 1974 Semiconductor fabrication and Material Science Strevens Institute of Technology BSE,  Electrical and Electronics Engineering 1968  – 1972 Purdue University MSE,  Electrical and Electronics Engineering 1972  – 1974 Semiconductor fabrication and Material Science Purdue University MSE,  Electrical and Electronics Engineering 1972  – 1974 Semiconductor fabrication and Material Science Purdue University MSE,  Electrical and Electronics Engineering 1972  – 1974 Semiconductor fabrication and Material Science Strevens Institute of Technology BSE,  Electrical and Electronics Engineering 1968  – 1972 Strevens Institute of Technology BSE,  Electrical and Electronics Engineering 1968  – 1972 Strevens Institute of Technology BSE,  Electrical and Electronics Engineering 1968  – 1972 ", "Experience Staff Process Engineer Intel Corporation April 2013  – Present (2 years 5 months) Hillsboro, OR Senior Process Engineer Intel Corporation June 2010  –  April 2013  (2 years 11 months) Hillsboro, Oregon 193 Immersion scanner owner. Responsibilities include development to improve overlay, CD uniformity, and throughput.  \n \nAlso a layer owner of critical backend metal layers. Graduate Research Assistant Cornell University August 2003  –  April 2010  (6 years 9 months) Graduate Student in the Department of Materials Science and Engineering. Doctoral research concentrated in the areas of polymer thin film patterning and characterization. Developed expertise in GISAXS, NEXAFS, and electron beam lithography. \n \nPublications: \nAn author/co-author on 19 publications with over 550 citations.  \nCurrently at an h-index of 14. Staff Process Engineer Intel Corporation April 2013  – Present (2 years 5 months) Hillsboro, OR Staff Process Engineer Intel Corporation April 2013  – Present (2 years 5 months) Hillsboro, OR Senior Process Engineer Intel Corporation June 2010  –  April 2013  (2 years 11 months) Hillsboro, Oregon 193 Immersion scanner owner. Responsibilities include development to improve overlay, CD uniformity, and throughput.  \n \nAlso a layer owner of critical backend metal layers. Senior Process Engineer Intel Corporation June 2010  –  April 2013  (2 years 11 months) Hillsboro, Oregon 193 Immersion scanner owner. Responsibilities include development to improve overlay, CD uniformity, and throughput.  \n \nAlso a layer owner of critical backend metal layers. Graduate Research Assistant Cornell University August 2003  –  April 2010  (6 years 9 months) Graduate Student in the Department of Materials Science and Engineering. Doctoral research concentrated in the areas of polymer thin film patterning and characterization. Developed expertise in GISAXS, NEXAFS, and electron beam lithography. \n \nPublications: \nAn author/co-author on 19 publications with over 550 citations.  \nCurrently at an h-index of 14. Graduate Research Assistant Cornell University August 2003  –  April 2010  (6 years 9 months) Graduate Student in the Department of Materials Science and Engineering. Doctoral research concentrated in the areas of polymer thin film patterning and characterization. Developed expertise in GISAXS, NEXAFS, and electron beam lithography. \n \nPublications: \nAn author/co-author on 19 publications with over 550 citations.  \nCurrently at an h-index of 14. Skills Nanotechnology AFM GISAXS NEXAFS Polymers Materials Science Characterization Photolithography Electron Beam... Thin Films Skills  Nanotechnology AFM GISAXS NEXAFS Polymers Materials Science Characterization Photolithography Electron Beam... Thin Films Nanotechnology AFM GISAXS NEXAFS Polymers Materials Science Characterization Photolithography Electron Beam... Thin Films Nanotechnology AFM GISAXS NEXAFS Polymers Materials Science Characterization Photolithography Electron Beam... Thin Films Education Cornell University Ph.D,  Materials Science and Engineering 2006  – 2010 Cornell University MS,  Materials Science and Engineering 2003  – 2006 University of California, Berkeley BA,  Physics 1998  – 2003 Cornell University Ph.D,  Materials Science and Engineering 2006  – 2010 Cornell University Ph.D,  Materials Science and Engineering 2006  – 2010 Cornell University Ph.D,  Materials Science and Engineering 2006  – 2010 Cornell University MS,  Materials Science and Engineering 2003  – 2006 Cornell University MS,  Materials Science and Engineering 2003  – 2006 Cornell University MS,  Materials Science and Engineering 2003  – 2006 University of California, Berkeley BA,  Physics 1998  – 2003 University of California, Berkeley BA,  Physics 1998  – 2003 University of California, Berkeley BA,  Physics 1998  – 2003 ", "", "Summary Specialties:  \nDielectrics - PECVD of ILD and HM \nMaterial Characterization - XRD, AFM, Hall effect, PL, ellipsometry, reflectance, FTIR, UV-Vis spectroscopy, SIMS \nCharacterization - C-V, DLTS, I-V, Optical Polarization, L-I, Modulation bandwidth and laser transient measurements. \nEpitaxial Growth - GaAs and InP based III-V materials, Heteroepitaxy of ferromagnetic materials \nDesign and Simulation - DOE, Sentaurus, Matlab \nAnalysis - JMP, SQL Pathfinder, SPC# \n Summary Specialties:  \nDielectrics - PECVD of ILD and HM \nMaterial Characterization - XRD, AFM, Hall effect, PL, ellipsometry, reflectance, FTIR, UV-Vis spectroscopy, SIMS \nCharacterization - C-V, DLTS, I-V, Optical Polarization, L-I, Modulation bandwidth and laser transient measurements. \nEpitaxial Growth - GaAs and InP based III-V materials, Heteroepitaxy of ferromagnetic materials \nDesign and Simulation - DOE, Sentaurus, Matlab \nAnalysis - JMP, SQL Pathfinder, SPC# \n Specialties:  \nDielectrics - PECVD of ILD and HM \nMaterial Characterization - XRD, AFM, Hall effect, PL, ellipsometry, reflectance, FTIR, UV-Vis spectroscopy, SIMS \nCharacterization - C-V, DLTS, I-V, Optical Polarization, L-I, Modulation bandwidth and laser transient measurements. \nEpitaxial Growth - GaAs and InP based III-V materials, Heteroepitaxy of ferromagnetic materials \nDesign and Simulation - DOE, Sentaurus, Matlab \nAnalysis - JMP, SQL Pathfinder, SPC# \n Specialties:  \nDielectrics - PECVD of ILD and HM \nMaterial Characterization - XRD, AFM, Hall effect, PL, ellipsometry, reflectance, FTIR, UV-Vis spectroscopy, SIMS \nCharacterization - C-V, DLTS, I-V, Optical Polarization, L-I, Modulation bandwidth and laser transient measurements. \nEpitaxial Growth - GaAs and InP based III-V materials, Heteroepitaxy of ferromagnetic materials \nDesign and Simulation - DOE, Sentaurus, Matlab \nAnalysis - JMP, SQL Pathfinder, SPC# \n Experience Senior Process Engineer Intel Corporation December 2010  – Present (4 years 9 months) Research Assistant University of Michigan August 2006  –  October 2010  (4 years 3 months) Thesis: High Temperature Spintronic Devices Sr. Design Engineer Sarnoff Corporation March 2006  –  June 2006  (4 months) ASIC and FPGA Design Group Hardware Engineer Telsima August 2004  –  March 2006  (1 year 8 months) FPGA and ASIC Design and Implementation Group Scientist C Indian Space Research Organisation February 2003  –  August 2004  (1 year 7 months) Data Handling Section of Digital Systems Group Senior Process Engineer Intel Corporation December 2010  – Present (4 years 9 months) Senior Process Engineer Intel Corporation December 2010  – Present (4 years 9 months) Research Assistant University of Michigan August 2006  –  October 2010  (4 years 3 months) Thesis: High Temperature Spintronic Devices Research Assistant University of Michigan August 2006  –  October 2010  (4 years 3 months) Thesis: High Temperature Spintronic Devices Sr. Design Engineer Sarnoff Corporation March 2006  –  June 2006  (4 months) ASIC and FPGA Design Group Sr. Design Engineer Sarnoff Corporation March 2006  –  June 2006  (4 months) ASIC and FPGA Design Group Hardware Engineer Telsima August 2004  –  March 2006  (1 year 8 months) FPGA and ASIC Design and Implementation Group Hardware Engineer Telsima August 2004  –  March 2006  (1 year 8 months) FPGA and ASIC Design and Implementation Group Scientist C Indian Space Research Organisation February 2003  –  August 2004  (1 year 7 months) Data Handling Section of Digital Systems Group Scientist C Indian Space Research Organisation February 2003  –  August 2004  (1 year 7 months) Data Handling Section of Digital Systems Group Skills Characterization Matlab Semiconductor... XRD Device Characterization Thin Films Semiconductors Fabrication CVD Design of Experiments PECVD VHDL Verilog Metal Fabrication Optics Photonics See 1+     See less Skills  Characterization Matlab Semiconductor... XRD Device Characterization Thin Films Semiconductors Fabrication CVD Design of Experiments PECVD VHDL Verilog Metal Fabrication Optics Photonics See 1+     See less Characterization Matlab Semiconductor... XRD Device Characterization Thin Films Semiconductors Fabrication CVD Design of Experiments PECVD VHDL Verilog Metal Fabrication Optics Photonics See 1+     See less Characterization Matlab Semiconductor... XRD Device Characterization Thin Films Semiconductors Fabrication CVD Design of Experiments PECVD VHDL Verilog Metal Fabrication Optics Photonics See 1+     See less Education University of Michigan PhD,  Solid State Electronics 2006  – 2010 Indian Institute of Science M.Tech,  Electronics Design 2001  – 2003 University of Calcutta B.Tech,  Radiophysics ane Electronics 1998  – 2001 University of Calcutta B.Sc.,  Physics 1995  – 1998 University of Michigan PhD,  Solid State Electronics 2006  – 2010 University of Michigan PhD,  Solid State Electronics 2006  – 2010 University of Michigan PhD,  Solid State Electronics 2006  – 2010 Indian Institute of Science M.Tech,  Electronics Design 2001  – 2003 Indian Institute of Science M.Tech,  Electronics Design 2001  – 2003 Indian Institute of Science M.Tech,  Electronics Design 2001  – 2003 University of Calcutta B.Tech,  Radiophysics ane Electronics 1998  – 2001 University of Calcutta B.Tech,  Radiophysics ane Electronics 1998  – 2001 University of Calcutta B.Tech,  Radiophysics ane Electronics 1998  – 2001 University of Calcutta B.Sc.,  Physics 1995  – 1998 University of Calcutta B.Sc.,  Physics 1995  – 1998 University of Calcutta B.Sc.,  Physics 1995  – 1998 Honors & Awards LTD Divisional Award Intel Corporation April 2013 LTD Divisional Award Intel Corporation January 2015 LTD Divisional Award Intel Corporation April 2013 LTD Divisional Award Intel Corporation April 2013 LTD Divisional Award Intel Corporation April 2013 LTD Divisional Award Intel Corporation January 2015 LTD Divisional Award Intel Corporation January 2015 LTD Divisional Award Intel Corporation January 2015 ", "Summary Apply my passion for challenge in a role that demands leadership and management skills, strategic thinking, business acumen and excellent communication. Summary Apply my passion for challenge in a role that demands leadership and management skills, strategic thinking, business acumen and excellent communication. Apply my passion for challenge in a role that demands leadership and management skills, strategic thinking, business acumen and excellent communication. Apply my passion for challenge in a role that demands leadership and management skills, strategic thinking, business acumen and excellent communication. Experience Account Manager Intel January 2014  – Present (1 year 8 months) Portland, Oregon Area Supplier Manager Intel January 2012  –  January 2014  (2 years 1 month) Albany, New York Area Assignee by Intel to G450C - Global 450mm Consortium.  \nResponsible for supplier contract negotiation and program coordination. Program Manager Intel Corporation January 2008  –  January 2012  (4 years 1 month) Dalian, China (2010-2012) & Phoenix, AZ (2008-2010) Staff position for Intel F68, greenfield fabrication facility startup in China. Ensure the capital equipment suppliers meet factory expectations for quality, performance to schedule, and cost. Mentor F68 supply chain organizations on supplier management. Account Manager Intel Corporation January 2006  –  January 2008  (2 years 1 month) Albuquerque, NM Drive supplier technology selections and commercial contract negotiations. Staff Process Engineer Intel Corporation February 2002  –  December 2005  (3 years 11 months) Albuquerque, NM Lithography expert: broad ownership across lithography including people management and mentoring, manufacturing operations management & process control, technical project leadership, process transfer, tool qualification, and performance optimization. Consultant Renault September 1999  –  June 2000  (10 months) Paris, France Initiate a cooperative multi-year multi-million dollar research project among the major European automobile manufacturers and software systems suppliers in automobile embedded software standardization. Process Engineer Nortel Networks June 1995  –  August 1995  (3 months) Ottawa, Canada Defect reduction across the back-end CMOS device fabrication process.  \nOxide and metal deposition, metal dry etch, patterned defect inspection. Assistant Process Engineer Micralyne (formerly Alberta Microelectronic Centre) June 1992  –  August 1994  (2 years 3 months) Edmonton, Canada Summer position during college. \nHands-on semiconductor processing for R&D. \nLithography, RIE etch, wet etch, metal deposition, CD SEM. Account Manager Intel January 2014  – Present (1 year 8 months) Portland, Oregon Area Account Manager Intel January 2014  – Present (1 year 8 months) Portland, Oregon Area Supplier Manager Intel January 2012  –  January 2014  (2 years 1 month) Albany, New York Area Assignee by Intel to G450C - Global 450mm Consortium.  \nResponsible for supplier contract negotiation and program coordination. Supplier Manager Intel January 2012  –  January 2014  (2 years 1 month) Albany, New York Area Assignee by Intel to G450C - Global 450mm Consortium.  \nResponsible for supplier contract negotiation and program coordination. Program Manager Intel Corporation January 2008  –  January 2012  (4 years 1 month) Dalian, China (2010-2012) & Phoenix, AZ (2008-2010) Staff position for Intel F68, greenfield fabrication facility startup in China. Ensure the capital equipment suppliers meet factory expectations for quality, performance to schedule, and cost. Mentor F68 supply chain organizations on supplier management. Program Manager Intel Corporation January 2008  –  January 2012  (4 years 1 month) Dalian, China (2010-2012) & Phoenix, AZ (2008-2010) Staff position for Intel F68, greenfield fabrication facility startup in China. Ensure the capital equipment suppliers meet factory expectations for quality, performance to schedule, and cost. Mentor F68 supply chain organizations on supplier management. Account Manager Intel Corporation January 2006  –  January 2008  (2 years 1 month) Albuquerque, NM Drive supplier technology selections and commercial contract negotiations. Account Manager Intel Corporation January 2006  –  January 2008  (2 years 1 month) Albuquerque, NM Drive supplier technology selections and commercial contract negotiations. Staff Process Engineer Intel Corporation February 2002  –  December 2005  (3 years 11 months) Albuquerque, NM Lithography expert: broad ownership across lithography including people management and mentoring, manufacturing operations management & process control, technical project leadership, process transfer, tool qualification, and performance optimization. Staff Process Engineer Intel Corporation February 2002  –  December 2005  (3 years 11 months) Albuquerque, NM Lithography expert: broad ownership across lithography including people management and mentoring, manufacturing operations management & process control, technical project leadership, process transfer, tool qualification, and performance optimization. Consultant Renault September 1999  –  June 2000  (10 months) Paris, France Initiate a cooperative multi-year multi-million dollar research project among the major European automobile manufacturers and software systems suppliers in automobile embedded software standardization. Consultant Renault September 1999  –  June 2000  (10 months) Paris, France Initiate a cooperative multi-year multi-million dollar research project among the major European automobile manufacturers and software systems suppliers in automobile embedded software standardization. Process Engineer Nortel Networks June 1995  –  August 1995  (3 months) Ottawa, Canada Defect reduction across the back-end CMOS device fabrication process.  \nOxide and metal deposition, metal dry etch, patterned defect inspection. Process Engineer Nortel Networks June 1995  –  August 1995  (3 months) Ottawa, Canada Defect reduction across the back-end CMOS device fabrication process.  \nOxide and metal deposition, metal dry etch, patterned defect inspection. Assistant Process Engineer Micralyne (formerly Alberta Microelectronic Centre) June 1992  –  August 1994  (2 years 3 months) Edmonton, Canada Summer position during college. \nHands-on semiconductor processing for R&D. \nLithography, RIE etch, wet etch, metal deposition, CD SEM. Assistant Process Engineer Micralyne (formerly Alberta Microelectronic Centre) June 1992  –  August 1994  (2 years 3 months) Edmonton, Canada Summer position during college. \nHands-on semiconductor processing for R&D. \nLithography, RIE etch, wet etch, metal deposition, CD SEM. Languages English Native or bilingual proficiency French Limited working proficiency Chinese Limited working proficiency English Native or bilingual proficiency French Limited working proficiency Chinese Limited working proficiency English Native or bilingual proficiency French Limited working proficiency Chinese Limited working proficiency Native or bilingual proficiency Limited working proficiency Limited working proficiency Skills Product Development Lithography Process Engineering Semiconductor Industry Cross-functional Team... Semiconductors Physics Manufacturing R&D IC Characterization Optics Supplier Quality... Program Management Design of Experiments Metrology Engineering Management CMOS Testing Electronics Six Sigma Failure Analysis Intel SPC See 9+     See less Skills  Product Development Lithography Process Engineering Semiconductor Industry Cross-functional Team... Semiconductors Physics Manufacturing R&D IC Characterization Optics Supplier Quality... Program Management Design of Experiments Metrology Engineering Management CMOS Testing Electronics Six Sigma Failure Analysis Intel SPC See 9+     See less Product Development Lithography Process Engineering Semiconductor Industry Cross-functional Team... Semiconductors Physics Manufacturing R&D IC Characterization Optics Supplier Quality... Program Management Design of Experiments Metrology Engineering Management CMOS Testing Electronics Six Sigma Failure Analysis Intel SPC See 9+     See less Product Development Lithography Process Engineering Semiconductor Industry Cross-functional Team... Semiconductors Physics Manufacturing R&D IC Characterization Optics Supplier Quality... Program Management Design of Experiments Metrology Engineering Management CMOS Testing Electronics Six Sigma Failure Analysis Intel SPC See 9+     See less Education Cambridge University Ph.D,  Physics 1995  – 2001 Thesis: Quantitative Electro-optic Sampling of Short-Gate Transistors. \nGaAs device (HEMT) processing (including e-beam lithography), HEMT wafer and mask design, transistor testing and characterization, ultrafast optical measurements. \nOptical and e-beam lithography, metal deposition, wet and dry etch, metal anneal, SEM analysis. Collège des Ingénieurs (CDI), Paris, France MBA,  International Management 1999  – 2000 Intensive MBA courses alternating with project work as an external consultant. Employer companies pay students’ tuition and salary. Amherst College B.A,  Physics and Philosophy 1991  – 1995 Honors thesis in physics; results published in Hilborn and Yuca, Physics Review Letters, 76, 2844 ('96), Hilborn and Yuca, British Journ. for the Philosophy of Science, 53, 355 ('02). Described in Physics Today, Nov. 96, and Physics World, July 96. Cambridge University Ph.D,  Physics 1995  – 2001 Thesis: Quantitative Electro-optic Sampling of Short-Gate Transistors. \nGaAs device (HEMT) processing (including e-beam lithography), HEMT wafer and mask design, transistor testing and characterization, ultrafast optical measurements. \nOptical and e-beam lithography, metal deposition, wet and dry etch, metal anneal, SEM analysis. Cambridge University Ph.D,  Physics 1995  – 2001 Thesis: Quantitative Electro-optic Sampling of Short-Gate Transistors. \nGaAs device (HEMT) processing (including e-beam lithography), HEMT wafer and mask design, transistor testing and characterization, ultrafast optical measurements. \nOptical and e-beam lithography, metal deposition, wet and dry etch, metal anneal, SEM analysis. Cambridge University Ph.D,  Physics 1995  – 2001 Thesis: Quantitative Electro-optic Sampling of Short-Gate Transistors. \nGaAs device (HEMT) processing (including e-beam lithography), HEMT wafer and mask design, transistor testing and characterization, ultrafast optical measurements. \nOptical and e-beam lithography, metal deposition, wet and dry etch, metal anneal, SEM analysis. Collège des Ingénieurs (CDI), Paris, France MBA,  International Management 1999  – 2000 Intensive MBA courses alternating with project work as an external consultant. Employer companies pay students’ tuition and salary. Collège des Ingénieurs (CDI), Paris, France MBA,  International Management 1999  – 2000 Intensive MBA courses alternating with project work as an external consultant. Employer companies pay students’ tuition and salary. Collège des Ingénieurs (CDI), Paris, France MBA,  International Management 1999  – 2000 Intensive MBA courses alternating with project work as an external consultant. Employer companies pay students’ tuition and salary. Amherst College B.A,  Physics and Philosophy 1991  – 1995 Honors thesis in physics; results published in Hilborn and Yuca, Physics Review Letters, 76, 2844 ('96), Hilborn and Yuca, British Journ. for the Philosophy of Science, 53, 355 ('02). Described in Physics Today, Nov. 96, and Physics World, July 96. Amherst College B.A,  Physics and Philosophy 1991  – 1995 Honors thesis in physics; results published in Hilborn and Yuca, Physics Review Letters, 76, 2844 ('96), Hilborn and Yuca, British Journ. for the Philosophy of Science, 53, 355 ('02). Described in Physics Today, Nov. 96, and Physics World, July 96. Amherst College B.A,  Physics and Philosophy 1991  – 1995 Honors thesis in physics; results published in Hilborn and Yuca, Physics Review Letters, 76, 2844 ('96), Hilborn and Yuca, British Journ. for the Philosophy of Science, 53, 355 ('02). Described in Physics Today, Nov. 96, and Physics World, July 96. ", "Experience Director of LED Packaging Engineering Luminus Devices October 2013  – Present (1 year 11 months) Manager of LED Packaging Engineering Luminus Devices Inc. March 2008  – Present (7 years 6 months) Principal LED packaging engineer Luminus devices March 2008  –  September 2009  (1 year 7 months) Principal Microelectronics Packaging Engineer Vicor Corp. July 2006  –  March 2008  (1 year 9 months) Adjunct Professor University of Massachusetts, Lowell September 2004  –  January 2006  (1 year 5 months) Staff Process Engineer Intel Corporation July 1998  –  March 1999  (9 months) Principal Microelectronics Packaging Engineer Digital Equipment Corporation June 1986  –  May 1998  (12 years) Director of LED Packaging Engineering Luminus Devices October 2013  – Present (1 year 11 months) Director of LED Packaging Engineering Luminus Devices October 2013  – Present (1 year 11 months) Manager of LED Packaging Engineering Luminus Devices Inc. March 2008  – Present (7 years 6 months) Manager of LED Packaging Engineering Luminus Devices Inc. March 2008  – Present (7 years 6 months) Principal LED packaging engineer Luminus devices March 2008  –  September 2009  (1 year 7 months) Principal LED packaging engineer Luminus devices March 2008  –  September 2009  (1 year 7 months) Principal Microelectronics Packaging Engineer Vicor Corp. July 2006  –  March 2008  (1 year 9 months) Principal Microelectronics Packaging Engineer Vicor Corp. July 2006  –  March 2008  (1 year 9 months) Adjunct Professor University of Massachusetts, Lowell September 2004  –  January 2006  (1 year 5 months) Adjunct Professor University of Massachusetts, Lowell September 2004  –  January 2006  (1 year 5 months) Staff Process Engineer Intel Corporation July 1998  –  March 1999  (9 months) Staff Process Engineer Intel Corporation July 1998  –  March 1999  (9 months) Principal Microelectronics Packaging Engineer Digital Equipment Corporation June 1986  –  May 1998  (12 years) Principal Microelectronics Packaging Engineer Digital Equipment Corporation June 1986  –  May 1998  (12 years) Skills Packaging Engineering Semiconductors Microelectronics Packaging Optics Thin Films Design of Experiments Materials Science Characterization Failure Analysis Nanotechnology R&D Skills  Packaging Engineering Semiconductors Microelectronics Packaging Optics Thin Films Design of Experiments Materials Science Characterization Failure Analysis Nanotechnology R&D Packaging Engineering Semiconductors Microelectronics Packaging Optics Thin Films Design of Experiments Materials Science Characterization Failure Analysis Nanotechnology R&D Packaging Engineering Semiconductors Microelectronics Packaging Optics Thin Films Design of Experiments Materials Science Characterization Failure Analysis Nanotechnology R&D Education Massachusetts Institute of Technology Ph.D.,  Materials science and engineering Massachusetts Institute of Technology Ph.D.,  Materials science and engineering Massachusetts Institute of Technology Ph.D.,  Materials science and engineering Massachusetts Institute of Technology Ph.D.,  Materials science and engineering ", "Summary Specialties:Strong knowledge of semiconductors device physics, wafer fabrication processes, quality and reliability methods and analytical characterization techniques. \nExperience in new technology introduction, enhancement and transfer. \nAdvanced dry etch knowledge of processes and equipments. Summary Specialties:Strong knowledge of semiconductors device physics, wafer fabrication processes, quality and reliability methods and analytical characterization techniques. \nExperience in new technology introduction, enhancement and transfer. \nAdvanced dry etch knowledge of processes and equipments. Specialties:Strong knowledge of semiconductors device physics, wafer fabrication processes, quality and reliability methods and analytical characterization techniques. \nExperience in new technology introduction, enhancement and transfer. \nAdvanced dry etch knowledge of processes and equipments. Specialties:Strong knowledge of semiconductors device physics, wafer fabrication processes, quality and reliability methods and analytical characterization techniques. \nExperience in new technology introduction, enhancement and transfer. \nAdvanced dry etch knowledge of processes and equipments. Experience Staff Process Engineer Intel Corporation August 2011  – Present (4 years 1 month) Portland, Oregon Area Process R&D Integration Engineer Micron Technology September 2008  –  August 2011  (3 years) I was responsible for developing new components and new process modules for the next generation of Micron/Aptina CMOS image sensors.  \nI defined roadmaps to meet requirements, goals and milestones for new technology and processes, planned and conducted experiments to fully characterize processes throughout the development cycle. I transferred process to high volume manufacturing providing support in startup and qualification of the new production lines. \nI worked in close contact with the Fab organization and the Imaging R&D modeling, simulation, pixel design groups to support or lead projects for improvements on quality, reliability, cost, yield, process stability and/or capability, productivity and safety. \nMajor achievements were development, characterization and qualification in the Fab of:  \n- innovative light-guides module that was a key factor for Micron/Aptina new image sensors success, \n- innovative transistors spacer integration scheme to reduce dark current, \n- new copper Beol integration for cost reduction,  \n- innovative process modules to improve performance of backside illuminated image sensor. Dry Etch Process Engineer Micron Technology December 2003  –  September 2008  (4 years 10 months) L'Aquila Area, Italy Tool owner in dry etch area, responsible for process development, process sustaining, and for improvement in safety, yield, cost and output.  \nI worked on different 200mm toolset: Applied Materials (DPSI and DPSII), LAM (9600PTX), TEL (SCCM and DRM) and Hitachi (M511).  \nI established and sustained statistical process control and reaction mechanism to failures, setup manufacturing and engineering procedures, used design of experiments methods for yield and process improvements. \nI had daily interaction with:  \n- R&D group to develop new processes, new recipes and release new tools \n- defect metrology group to maintain best in class yield by defects reduction \n- process integration group to maintain or improve device electric performances \n- manufacturing group to guarantee the required availability and the proper planning of scheduled maintenances \n- other process area groups for processes interaction improvement or issues troubleshooting. \nI lead several task force groups for processes or equipments issues, applying structured problem solving for troubleshooting. Decision were driven by data analysis (JMP was the most used software). \nMajor achievements: AMAT DPSI technology release, AMAT DPSII equipment control improvement, release of Vapor Strip for corrosion reduction and equipment setup/configuration, develop new aluminum etch recipe for 110nm metal routings. \nAuthor of CMOS process book for dry etch area for the switch from DRAM fabrication to Imager fabrication. System Engineer & Proposal Developer Italtel - Tecnosistemi Group September 2001  –  November 2003  (2 years 3 months) Rome Area, Italy GSM network nodes configuration, standard definition for Exchange Requirements, Data Transcript automation (by Excel Macro).  \nStart-up GSM TIM Network in Brazil, Ericsson core network configuration. Two months of staying in Sao Paulo (Brazil). \nRealization of a tool for Network Inventory in MS Access. \nAd-hoc analyses and simulations to support management strategies \nSpecifications for Network Inventory, Spare Parts Management, Trouble Ticketing and Faults Management systems. Solid State Device/Process development IESS - Solid State Electronic Institute September 1999  –  November 2000  (1 year 3 months) Development, fabrication and characterization of MEMS device (CMUT) to transmit / receive ultrasounds. Mathematical model, process flow definition, design and realization of photo-lithography reticles, fabrication process set up and execution, packaging and final test (5 scientific publications). Staff Process Engineer Intel Corporation August 2011  – Present (4 years 1 month) Portland, Oregon Area Staff Process Engineer Intel Corporation August 2011  – Present (4 years 1 month) Portland, Oregon Area Process R&D Integration Engineer Micron Technology September 2008  –  August 2011  (3 years) I was responsible for developing new components and new process modules for the next generation of Micron/Aptina CMOS image sensors.  \nI defined roadmaps to meet requirements, goals and milestones for new technology and processes, planned and conducted experiments to fully characterize processes throughout the development cycle. I transferred process to high volume manufacturing providing support in startup and qualification of the new production lines. \nI worked in close contact with the Fab organization and the Imaging R&D modeling, simulation, pixel design groups to support or lead projects for improvements on quality, reliability, cost, yield, process stability and/or capability, productivity and safety. \nMajor achievements were development, characterization and qualification in the Fab of:  \n- innovative light-guides module that was a key factor for Micron/Aptina new image sensors success, \n- innovative transistors spacer integration scheme to reduce dark current, \n- new copper Beol integration for cost reduction,  \n- innovative process modules to improve performance of backside illuminated image sensor. Process R&D Integration Engineer Micron Technology September 2008  –  August 2011  (3 years) I was responsible for developing new components and new process modules for the next generation of Micron/Aptina CMOS image sensors.  \nI defined roadmaps to meet requirements, goals and milestones for new technology and processes, planned and conducted experiments to fully characterize processes throughout the development cycle. I transferred process to high volume manufacturing providing support in startup and qualification of the new production lines. \nI worked in close contact with the Fab organization and the Imaging R&D modeling, simulation, pixel design groups to support or lead projects for improvements on quality, reliability, cost, yield, process stability and/or capability, productivity and safety. \nMajor achievements were development, characterization and qualification in the Fab of:  \n- innovative light-guides module that was a key factor for Micron/Aptina new image sensors success, \n- innovative transistors spacer integration scheme to reduce dark current, \n- new copper Beol integration for cost reduction,  \n- innovative process modules to improve performance of backside illuminated image sensor. Dry Etch Process Engineer Micron Technology December 2003  –  September 2008  (4 years 10 months) L'Aquila Area, Italy Tool owner in dry etch area, responsible for process development, process sustaining, and for improvement in safety, yield, cost and output.  \nI worked on different 200mm toolset: Applied Materials (DPSI and DPSII), LAM (9600PTX), TEL (SCCM and DRM) and Hitachi (M511).  \nI established and sustained statistical process control and reaction mechanism to failures, setup manufacturing and engineering procedures, used design of experiments methods for yield and process improvements. \nI had daily interaction with:  \n- R&D group to develop new processes, new recipes and release new tools \n- defect metrology group to maintain best in class yield by defects reduction \n- process integration group to maintain or improve device electric performances \n- manufacturing group to guarantee the required availability and the proper planning of scheduled maintenances \n- other process area groups for processes interaction improvement or issues troubleshooting. \nI lead several task force groups for processes or equipments issues, applying structured problem solving for troubleshooting. Decision were driven by data analysis (JMP was the most used software). \nMajor achievements: AMAT DPSI technology release, AMAT DPSII equipment control improvement, release of Vapor Strip for corrosion reduction and equipment setup/configuration, develop new aluminum etch recipe for 110nm metal routings. \nAuthor of CMOS process book for dry etch area for the switch from DRAM fabrication to Imager fabrication. Dry Etch Process Engineer Micron Technology December 2003  –  September 2008  (4 years 10 months) L'Aquila Area, Italy Tool owner in dry etch area, responsible for process development, process sustaining, and for improvement in safety, yield, cost and output.  \nI worked on different 200mm toolset: Applied Materials (DPSI and DPSII), LAM (9600PTX), TEL (SCCM and DRM) and Hitachi (M511).  \nI established and sustained statistical process control and reaction mechanism to failures, setup manufacturing and engineering procedures, used design of experiments methods for yield and process improvements. \nI had daily interaction with:  \n- R&D group to develop new processes, new recipes and release new tools \n- defect metrology group to maintain best in class yield by defects reduction \n- process integration group to maintain or improve device electric performances \n- manufacturing group to guarantee the required availability and the proper planning of scheduled maintenances \n- other process area groups for processes interaction improvement or issues troubleshooting. \nI lead several task force groups for processes or equipments issues, applying structured problem solving for troubleshooting. Decision were driven by data analysis (JMP was the most used software). \nMajor achievements: AMAT DPSI technology release, AMAT DPSII equipment control improvement, release of Vapor Strip for corrosion reduction and equipment setup/configuration, develop new aluminum etch recipe for 110nm metal routings. \nAuthor of CMOS process book for dry etch area for the switch from DRAM fabrication to Imager fabrication. System Engineer & Proposal Developer Italtel - Tecnosistemi Group September 2001  –  November 2003  (2 years 3 months) Rome Area, Italy GSM network nodes configuration, standard definition for Exchange Requirements, Data Transcript automation (by Excel Macro).  \nStart-up GSM TIM Network in Brazil, Ericsson core network configuration. Two months of staying in Sao Paulo (Brazil). \nRealization of a tool for Network Inventory in MS Access. \nAd-hoc analyses and simulations to support management strategies \nSpecifications for Network Inventory, Spare Parts Management, Trouble Ticketing and Faults Management systems. System Engineer & Proposal Developer Italtel - Tecnosistemi Group September 2001  –  November 2003  (2 years 3 months) Rome Area, Italy GSM network nodes configuration, standard definition for Exchange Requirements, Data Transcript automation (by Excel Macro).  \nStart-up GSM TIM Network in Brazil, Ericsson core network configuration. Two months of staying in Sao Paulo (Brazil). \nRealization of a tool for Network Inventory in MS Access. \nAd-hoc analyses and simulations to support management strategies \nSpecifications for Network Inventory, Spare Parts Management, Trouble Ticketing and Faults Management systems. Solid State Device/Process development IESS - Solid State Electronic Institute September 1999  –  November 2000  (1 year 3 months) Development, fabrication and characterization of MEMS device (CMUT) to transmit / receive ultrasounds. Mathematical model, process flow definition, design and realization of photo-lithography reticles, fabrication process set up and execution, packaging and final test (5 scientific publications). Solid State Device/Process development IESS - Solid State Electronic Institute September 1999  –  November 2000  (1 year 3 months) Development, fabrication and characterization of MEMS device (CMUT) to transmit / receive ultrasounds. Mathematical model, process flow definition, design and realization of photo-lithography reticles, fabrication process set up and execution, packaging and final test (5 scientific publications). Languages English Italian English Italian English Italian Skills CMOS Semiconductors JMP Semiconductor Industry Design of Experiments Characterization CVD MEMS Sensors Simulations SPC Process Integration Etching Silicon Thin Films IC Microelectronics Semiconductor Process Yield Plasma Etch PVD R&D Metrology Physics Process Simulation DRAM Product Engineering Device Characterization Failure Analysis PECVD Semiconductor... Flash Memory Semiconductor Device Sputtering Optoelectronics Lithography See 21+     See less Skills  CMOS Semiconductors JMP Semiconductor Industry Design of Experiments Characterization CVD MEMS Sensors Simulations SPC Process Integration Etching Silicon Thin Films IC Microelectronics Semiconductor Process Yield Plasma Etch PVD R&D Metrology Physics Process Simulation DRAM Product Engineering Device Characterization Failure Analysis PECVD Semiconductor... Flash Memory Semiconductor Device Sputtering Optoelectronics Lithography See 21+     See less CMOS Semiconductors JMP Semiconductor Industry Design of Experiments Characterization CVD MEMS Sensors Simulations SPC Process Integration Etching Silicon Thin Films IC Microelectronics Semiconductor Process Yield Plasma Etch PVD R&D Metrology Physics Process Simulation DRAM Product Engineering Device Characterization Failure Analysis PECVD Semiconductor... Flash Memory Semiconductor Device Sputtering Optoelectronics Lithography See 21+     See less CMOS Semiconductors JMP Semiconductor Industry Design of Experiments Characterization CVD MEMS Sensors Simulations SPC Process Integration Etching Silicon Thin Films IC Microelectronics Semiconductor Process Yield Plasma Etch PVD R&D Metrology Physics Process Simulation DRAM Product Engineering Device Characterization Failure Analysis PECVD Semiconductor... Flash Memory Semiconductor Device Sputtering Optoelectronics Lithography See 21+     See less Education Università degli Studi di Roma Tre Master's degree,  Electrical and Electronics Engineering 1995  – 2000 Thesis: \"Design, Fabrication and Test of Micro-Electro-Mechanical Ultrasounds Transducers\".  \nThesis work description: 1) Mathematical model of an electrostatic transducer and theoretical performances analysis. 2) Fabrication of ultrasounds electrostatic transducers (in clean room class 1000) 3) Test of transducers by ultrasonic pulse emissions and electric impedance measurements. Università degli Studi di Roma Tre Master's degree,  Electrical and Electronics Engineering 1995  – 2000 Thesis: \"Design, Fabrication and Test of Micro-Electro-Mechanical Ultrasounds Transducers\".  \nThesis work description: 1) Mathematical model of an electrostatic transducer and theoretical performances analysis. 2) Fabrication of ultrasounds electrostatic transducers (in clean room class 1000) 3) Test of transducers by ultrasonic pulse emissions and electric impedance measurements. Università degli Studi di Roma Tre Master's degree,  Electrical and Electronics Engineering 1995  – 2000 Thesis: \"Design, Fabrication and Test of Micro-Electro-Mechanical Ultrasounds Transducers\".  \nThesis work description: 1) Mathematical model of an electrostatic transducer and theoretical performances analysis. 2) Fabrication of ultrasounds electrostatic transducers (in clean room class 1000) 3) Test of transducers by ultrasonic pulse emissions and electric impedance measurements. Università degli Studi di Roma Tre Master's degree,  Electrical and Electronics Engineering 1995  – 2000 Thesis: \"Design, Fabrication and Test of Micro-Electro-Mechanical Ultrasounds Transducers\".  \nThesis work description: 1) Mathematical model of an electrostatic transducer and theoretical performances analysis. 2) Fabrication of ultrasounds electrostatic transducers (in clean room class 1000) 3) Test of transducers by ultrasonic pulse emissions and electric impedance measurements. ", "Summary Specialties: Semiconductor technology, photolithography exposure tools, alignment, overlay, lithography processes, SPC, structured process development and change control, statistical data analysis and modeling, marketing, strategic investments Summary Specialties: Semiconductor technology, photolithography exposure tools, alignment, overlay, lithography processes, SPC, structured process development and change control, statistical data analysis and modeling, marketing, strategic investments Specialties: Semiconductor technology, photolithography exposure tools, alignment, overlay, lithography processes, SPC, structured process development and change control, statistical data analysis and modeling, marketing, strategic investments Specialties: Semiconductor technology, photolithography exposure tools, alignment, overlay, lithography processes, SPC, structured process development and change control, statistical data analysis and modeling, marketing, strategic investments Experience Senior Scientist ASML July 2015  – Present (2 months) Hillsboro, Oregon Senior Scientist ASML July 2015  – Present (2 months) Hillsboro, Oregon Senior Scientist ASML July 2015  – Present (2 months) Hillsboro, Oregon Skills Semiconductor Industry Metrology Lithography SPC Process Simulation Semiconductors Design of Experiments Simulations Process Improvement R&D Engineering Strategy Start-ups Business Development Management Skills  Semiconductor Industry Metrology Lithography SPC Process Simulation Semiconductors Design of Experiments Simulations Process Improvement R&D Engineering Strategy Start-ups Business Development Management Semiconductor Industry Metrology Lithography SPC Process Simulation Semiconductors Design of Experiments Simulations Process Improvement R&D Engineering Strategy Start-ups Business Development Management Semiconductor Industry Metrology Lithography SPC Process Simulation Semiconductors Design of Experiments Simulations Process Improvement R&D Engineering Strategy Start-ups Business Development Management ", "Summary A hands on engineering leader with more than 15 years of high tech manufacturing experience in semiconductor, aerospace / composites and optics industries.  \n \nProficient in manufacturing / operations roles such as processing engineering, quality engineering & project management. Led/managed teams in process research and development, facility start-up and continuous improvement in high volume production.  \n \nPassionate about making sound data based decisions that advance company & employee capabilities to meet and exceed customer needs and expectations. \n \nSpecialties: Process engineering, Quality (ISO), Team development, SPC, Lean (Kaizen, 5S), FMEA, Design of Experiments (DOE), Root Cause Analysis, Supplier Controls, Materials Science Summary A hands on engineering leader with more than 15 years of high tech manufacturing experience in semiconductor, aerospace / composites and optics industries.  \n \nProficient in manufacturing / operations roles such as processing engineering, quality engineering & project management. Led/managed teams in process research and development, facility start-up and continuous improvement in high volume production.  \n \nPassionate about making sound data based decisions that advance company & employee capabilities to meet and exceed customer needs and expectations. \n \nSpecialties: Process engineering, Quality (ISO), Team development, SPC, Lean (Kaizen, 5S), FMEA, Design of Experiments (DOE), Root Cause Analysis, Supplier Controls, Materials Science A hands on engineering leader with more than 15 years of high tech manufacturing experience in semiconductor, aerospace / composites and optics industries.  \n \nProficient in manufacturing / operations roles such as processing engineering, quality engineering & project management. Led/managed teams in process research and development, facility start-up and continuous improvement in high volume production.  \n \nPassionate about making sound data based decisions that advance company & employee capabilities to meet and exceed customer needs and expectations. \n \nSpecialties: Process engineering, Quality (ISO), Team development, SPC, Lean (Kaizen, 5S), FMEA, Design of Experiments (DOE), Root Cause Analysis, Supplier Controls, Materials Science A hands on engineering leader with more than 15 years of high tech manufacturing experience in semiconductor, aerospace / composites and optics industries.  \n \nProficient in manufacturing / operations roles such as processing engineering, quality engineering & project management. Led/managed teams in process research and development, facility start-up and continuous improvement in high volume production.  \n \nPassionate about making sound data based decisions that advance company & employee capabilities to meet and exceed customer needs and expectations. \n \nSpecialties: Process engineering, Quality (ISO), Team development, SPC, Lean (Kaizen, 5S), FMEA, Design of Experiments (DOE), Root Cause Analysis, Supplier Controls, Materials Science Experience Engineering Manager / OpEx Leader BAND-IT IDEX July 2014  – Present (1 year 2 months) Process Engineering Manager Research Electro-Optics April 2012  –  June 2014  (2 years 3 months) boulder Staff Process Engineer Research Electro-Optics September 2010  –  April 2012  (1 year 8 months) Boulder Coached the Ring Laser Gyroscope (RLG) product line with 3 process engineers and 23 technicians on Lean concepts, standardization and high volume manufacturing (HVM) process controls that led to 56 weeks of Zero missed shipments and ~ $1 million in additional sales. New Product Development Engineer W.L. Gore & Associates May 2008  –  September 2010  (2 years 5 months) Commercialized new Ultra Pure Water (UPW) and High Purity Bulk Chemical ePTFE filtration products that enabled launch of new business unit.  \n \nLed project to change internal manufacturing culture with respect to cleanroom operations. Executed by educating leadership team on key benefits of meeting customer cleanliness expectations and built consensus through one on one communication. \n \nQualified new state of the art cleanroom manufacturing facility (IQ, OQ, PQ, POQ) to meet class 1000 requirements. Facility and infrastructure met customer cleanliness expectations and enabled revenue to grow from $0 to $1.2 million. Delivered training to the entire factory for cleanroom operations and protocol (~ 100 employees). \n \nMentored engineers and business associates on the value of spending time upfront to properly design projects, experiments and data collection methods. Proper design will make execution more efficient and minimize unnecessary costs and risks. \n \nOptimized and commissioned new thermal welding equipment required to launch new high purity filtration device business and production line. Staff Process Engineer Intel Corporation March 2004  –  May 2008  (4 years 3 months) Cu Polish / CMP Process Engineer Intel Corporation January 2003  –  March 2004  (1 year 3 months) Thin Films Metrology Process Engineer Intel Corporation March 2000  –  January 2003  (2 years 11 months) Recipe development and sustaining ownership a of metrology equipment from the front end gate loop through final bumping for flip chip / BGA and wirebond.  \n \nDeveloped monitoring strategies / SPC charts to ensure equipment demonstrated short term and long term stability / repeatability + tool matching across multiple factories. Wrote specs / standard operating procedures and trained technicians and engineering for maintenance and monitoring. Composites Fabrication Engineer Intec 1998  –  1999  (1 year) New product fabrication development & prototyping using various composite processing techniques including: Resin Transfer Molding (RTM), hand layup / autoclave, roto-molding, vacuum assist, ultrasonic welding & 3/5 axis machining. Mechanical & thermal material property characterization of polymer composites. Engineering Manager / OpEx Leader BAND-IT IDEX July 2014  – Present (1 year 2 months) Engineering Manager / OpEx Leader BAND-IT IDEX July 2014  – Present (1 year 2 months) Process Engineering Manager Research Electro-Optics April 2012  –  June 2014  (2 years 3 months) boulder Process Engineering Manager Research Electro-Optics April 2012  –  June 2014  (2 years 3 months) boulder Staff Process Engineer Research Electro-Optics September 2010  –  April 2012  (1 year 8 months) Boulder Coached the Ring Laser Gyroscope (RLG) product line with 3 process engineers and 23 technicians on Lean concepts, standardization and high volume manufacturing (HVM) process controls that led to 56 weeks of Zero missed shipments and ~ $1 million in additional sales. Staff Process Engineer Research Electro-Optics September 2010  –  April 2012  (1 year 8 months) Boulder Coached the Ring Laser Gyroscope (RLG) product line with 3 process engineers and 23 technicians on Lean concepts, standardization and high volume manufacturing (HVM) process controls that led to 56 weeks of Zero missed shipments and ~ $1 million in additional sales. New Product Development Engineer W.L. Gore & Associates May 2008  –  September 2010  (2 years 5 months) Commercialized new Ultra Pure Water (UPW) and High Purity Bulk Chemical ePTFE filtration products that enabled launch of new business unit.  \n \nLed project to change internal manufacturing culture with respect to cleanroom operations. Executed by educating leadership team on key benefits of meeting customer cleanliness expectations and built consensus through one on one communication. \n \nQualified new state of the art cleanroom manufacturing facility (IQ, OQ, PQ, POQ) to meet class 1000 requirements. Facility and infrastructure met customer cleanliness expectations and enabled revenue to grow from $0 to $1.2 million. Delivered training to the entire factory for cleanroom operations and protocol (~ 100 employees). \n \nMentored engineers and business associates on the value of spending time upfront to properly design projects, experiments and data collection methods. Proper design will make execution more efficient and minimize unnecessary costs and risks. \n \nOptimized and commissioned new thermal welding equipment required to launch new high purity filtration device business and production line. New Product Development Engineer W.L. Gore & Associates May 2008  –  September 2010  (2 years 5 months) Commercialized new Ultra Pure Water (UPW) and High Purity Bulk Chemical ePTFE filtration products that enabled launch of new business unit.  \n \nLed project to change internal manufacturing culture with respect to cleanroom operations. Executed by educating leadership team on key benefits of meeting customer cleanliness expectations and built consensus through one on one communication. \n \nQualified new state of the art cleanroom manufacturing facility (IQ, OQ, PQ, POQ) to meet class 1000 requirements. Facility and infrastructure met customer cleanliness expectations and enabled revenue to grow from $0 to $1.2 million. Delivered training to the entire factory for cleanroom operations and protocol (~ 100 employees). \n \nMentored engineers and business associates on the value of spending time upfront to properly design projects, experiments and data collection methods. Proper design will make execution more efficient and minimize unnecessary costs and risks. \n \nOptimized and commissioned new thermal welding equipment required to launch new high purity filtration device business and production line. Staff Process Engineer Intel Corporation March 2004  –  May 2008  (4 years 3 months) Staff Process Engineer Intel Corporation March 2004  –  May 2008  (4 years 3 months) Cu Polish / CMP Process Engineer Intel Corporation January 2003  –  March 2004  (1 year 3 months) Cu Polish / CMP Process Engineer Intel Corporation January 2003  –  March 2004  (1 year 3 months) Thin Films Metrology Process Engineer Intel Corporation March 2000  –  January 2003  (2 years 11 months) Recipe development and sustaining ownership a of metrology equipment from the front end gate loop through final bumping for flip chip / BGA and wirebond.  \n \nDeveloped monitoring strategies / SPC charts to ensure equipment demonstrated short term and long term stability / repeatability + tool matching across multiple factories. Wrote specs / standard operating procedures and trained technicians and engineering for maintenance and monitoring. Thin Films Metrology Process Engineer Intel Corporation March 2000  –  January 2003  (2 years 11 months) Recipe development and sustaining ownership a of metrology equipment from the front end gate loop through final bumping for flip chip / BGA and wirebond.  \n \nDeveloped monitoring strategies / SPC charts to ensure equipment demonstrated short term and long term stability / repeatability + tool matching across multiple factories. Wrote specs / standard operating procedures and trained technicians and engineering for maintenance and monitoring. Composites Fabrication Engineer Intec 1998  –  1999  (1 year) New product fabrication development & prototyping using various composite processing techniques including: Resin Transfer Molding (RTM), hand layup / autoclave, roto-molding, vacuum assist, ultrasonic welding & 3/5 axis machining. Mechanical & thermal material property characterization of polymer composites. Composites Fabrication Engineer Intec 1998  –  1999  (1 year) New product fabrication development & prototyping using various composite processing techniques including: Resin Transfer Molding (RTM), hand layup / autoclave, roto-molding, vacuum assist, ultrasonic welding & 3/5 axis machining. Mechanical & thermal material property characterization of polymer composites. Languages   Skills SPC JMP Semiconductors Lean Manufacturing Six Sigma Product Development Manufacturing Design of Experiments Continuous Improvement Metrology Engineering Project Management Materials Science Coatings Solidworks Process Improvement R&D Cross-functional Team... FMEA Process Simulation Chemical Engineering Semiconductor Industry Failure Analysis Characterization Optics Process Engineering Root Cause Analysis Thin Films Engineering Management CVD Electronics ISO Quality System Manufacturing... 5S Kaizen Materials Process Control Validation Manufacturing Operations Yield Manufacturing... See 27+     See less Skills  SPC JMP Semiconductors Lean Manufacturing Six Sigma Product Development Manufacturing Design of Experiments Continuous Improvement Metrology Engineering Project Management Materials Science Coatings Solidworks Process Improvement R&D Cross-functional Team... FMEA Process Simulation Chemical Engineering Semiconductor Industry Failure Analysis Characterization Optics Process Engineering Root Cause Analysis Thin Films Engineering Management CVD Electronics ISO Quality System Manufacturing... 5S Kaizen Materials Process Control Validation Manufacturing Operations Yield Manufacturing... See 27+     See less SPC JMP Semiconductors Lean Manufacturing Six Sigma Product Development Manufacturing Design of Experiments Continuous Improvement Metrology Engineering Project Management Materials Science Coatings Solidworks Process Improvement R&D Cross-functional Team... FMEA Process Simulation Chemical Engineering Semiconductor Industry Failure Analysis Characterization Optics Process Engineering Root Cause Analysis Thin Films Engineering Management CVD Electronics ISO Quality System Manufacturing... 5S Kaizen Materials Process Control Validation Manufacturing Operations Yield Manufacturing... See 27+     See less SPC JMP Semiconductors Lean Manufacturing Six Sigma Product Development Manufacturing Design of Experiments Continuous Improvement Metrology Engineering Project Management Materials Science Coatings Solidworks Process Improvement R&D Cross-functional Team... FMEA Process Simulation Chemical Engineering Semiconductor Industry Failure Analysis Characterization Optics Process Engineering Root Cause Analysis Thin Films Engineering Management CVD Electronics ISO Quality System Manufacturing... 5S Kaizen Materials Process Control Validation Manufacturing Operations Yield Manufacturing... See 27+     See less Education University of Washington MS,  Materials Science & Engineering Penn State University BS,  Civil Engineering University of Washington MS,  Materials Science & Engineering University of Washington MS,  Materials Science & Engineering University of Washington MS,  Materials Science & Engineering Penn State University BS,  Civil Engineering Penn State University BS,  Civil Engineering Penn State University BS,  Civil Engineering Honors & Awards ", "Summary Staff lithography process engineer with a proven track record of managing complex technical projects to achieve company goals by quickly aligning on key deliverables and identifying and characterizing potential hurdles. Identifies models and tests solutions through design of experiments and drives company decisions using data based decision making. Standardizes analysis techniques and communicates learnings to key internal and external stakeholders.  \n \nSpecialties: Optical lithography • Generalized problem characterization and quantification • Model based problem solving • Data visualization • Statistical and mathematical modeling • Analysis standardization and automation • Six-sigma control methodologies • Design of experiments • Technical project management • Presentations and stakeholder communications • Team building and mentoring • Operations efficiency optimization \n Summary Staff lithography process engineer with a proven track record of managing complex technical projects to achieve company goals by quickly aligning on key deliverables and identifying and characterizing potential hurdles. Identifies models and tests solutions through design of experiments and drives company decisions using data based decision making. Standardizes analysis techniques and communicates learnings to key internal and external stakeholders.  \n \nSpecialties: Optical lithography • Generalized problem characterization and quantification • Model based problem solving • Data visualization • Statistical and mathematical modeling • Analysis standardization and automation • Six-sigma control methodologies • Design of experiments • Technical project management • Presentations and stakeholder communications • Team building and mentoring • Operations efficiency optimization \n Staff lithography process engineer with a proven track record of managing complex technical projects to achieve company goals by quickly aligning on key deliverables and identifying and characterizing potential hurdles. Identifies models and tests solutions through design of experiments and drives company decisions using data based decision making. Standardizes analysis techniques and communicates learnings to key internal and external stakeholders.  \n \nSpecialties: Optical lithography • Generalized problem characterization and quantification • Model based problem solving • Data visualization • Statistical and mathematical modeling • Analysis standardization and automation • Six-sigma control methodologies • Design of experiments • Technical project management • Presentations and stakeholder communications • Team building and mentoring • Operations efficiency optimization \n Staff lithography process engineer with a proven track record of managing complex technical projects to achieve company goals by quickly aligning on key deliverables and identifying and characterizing potential hurdles. Identifies models and tests solutions through design of experiments and drives company decisions using data based decision making. Standardizes analysis techniques and communicates learnings to key internal and external stakeholders.  \n \nSpecialties: Optical lithography • Generalized problem characterization and quantification • Model based problem solving • Data visualization • Statistical and mathematical modeling • Analysis standardization and automation • Six-sigma control methodologies • Design of experiments • Technical project management • Presentations and stakeholder communications • Team building and mentoring • Operations efficiency optimization \n Experience Staff Process Engineer Intel Corporation July 2012  – Present (3 years 2 months) Chandler, AZ • High volume data analyst specializing in versatile problem characterization and visualization. Thorough understanding of statistical analysis and mathematical modeling techniques. \n• Develop custom code to automate data extraction, analysis, and presentation so that all stakeholders have rapid access to key information. \n• Work closely with integration and yield engineers to troubleshoot process yield signals related to lithographic patterning marginalities. Develop and implement robust solutions and share learnings with both local and worldwide stakeholders. \n• Manage technical projects for roadmap improvement items relating to overlay matching, CD uniformity, machine throughput, and system utilization.  \n• Create and deliver presentations to management clearly and succinctly summarizing project goals and progress. Drive corporate decisions using data driven analysis. \n• Develop and deliver training materials to mentor fellow engineers and upskill technicians, enhancing 24x7 decision making capabilities. \n Senior Module Integration and Yield Engineer Intel Corportation July 2010  –  July 2012  (2 years 1 month) Hillsboro, OR • Integrated critical 193 nm immersion scanners into Intel's 22nm process technology node. \n• Oversaw machine matching and monitored product overlay and CD performance using six-sigma methodologies.  \n• Drove projects to improve overlay, CD uniformity, and reduce lithography defects. \n• Developed best known methods for machine matching to enable platform transition from development to high volume manufacturing. Oversaw training of team of technicians in response flow charts to common equipment problems. \n• Worked with material suppliers through recursive DOEs to improve material properties leading to improved lithography process window.  \n Research Assistant University of Minnesota June 2005  –  August 2010  (5 years 3 months) University of Minnesota, Minneapolis, MN • Fabricated optoelectronic semiconductor devices including spin LEDs and spin injection/transport devices with a rapid turnaround time. \n• Increased yield from < 20% to ~ 100% by improving our fabrication techniques, while increasing both the density and complexity of the devices on each chip. \n• Performed low temperature measurements requiring a sensitivity of one part in 100,000. \n• Developed LabView code to highly automate measurement process. \n• Analyzed large amounts of data and use this data to suggest improved structures to our collaborators, including modifications to device materials and Schottky barriers. \n• Oversaw safety training for and use of a high magnetic field, low temperature cryostat. \n Teaching Assistant University of Minnesota September 2005  –  May 2006  (9 months) Communicated complex physics concepts to non-physics majors. Undergraduate Mathematics Tutor Saint John's University September 2003  –  May 2005  (1 year 9 months) Undergraduate Research Assistant Saint John's University May 2003  –  May 2005  (2 years 1 month) Determined radiation dose received from radon in household residences. \nDesigned a cost-effective detector that more accurately predicts radiation dose. Staff Process Engineer Intel Corporation July 2012  – Present (3 years 2 months) Chandler, AZ • High volume data analyst specializing in versatile problem characterization and visualization. Thorough understanding of statistical analysis and mathematical modeling techniques. \n• Develop custom code to automate data extraction, analysis, and presentation so that all stakeholders have rapid access to key information. \n• Work closely with integration and yield engineers to troubleshoot process yield signals related to lithographic patterning marginalities. Develop and implement robust solutions and share learnings with both local and worldwide stakeholders. \n• Manage technical projects for roadmap improvement items relating to overlay matching, CD uniformity, machine throughput, and system utilization.  \n• Create and deliver presentations to management clearly and succinctly summarizing project goals and progress. Drive corporate decisions using data driven analysis. \n• Develop and deliver training materials to mentor fellow engineers and upskill technicians, enhancing 24x7 decision making capabilities. \n Staff Process Engineer Intel Corporation July 2012  – Present (3 years 2 months) Chandler, AZ • High volume data analyst specializing in versatile problem characterization and visualization. Thorough understanding of statistical analysis and mathematical modeling techniques. \n• Develop custom code to automate data extraction, analysis, and presentation so that all stakeholders have rapid access to key information. \n• Work closely with integration and yield engineers to troubleshoot process yield signals related to lithographic patterning marginalities. Develop and implement robust solutions and share learnings with both local and worldwide stakeholders. \n• Manage technical projects for roadmap improvement items relating to overlay matching, CD uniformity, machine throughput, and system utilization.  \n• Create and deliver presentations to management clearly and succinctly summarizing project goals and progress. Drive corporate decisions using data driven analysis. \n• Develop and deliver training materials to mentor fellow engineers and upskill technicians, enhancing 24x7 decision making capabilities. \n Senior Module Integration and Yield Engineer Intel Corportation July 2010  –  July 2012  (2 years 1 month) Hillsboro, OR • Integrated critical 193 nm immersion scanners into Intel's 22nm process technology node. \n• Oversaw machine matching and monitored product overlay and CD performance using six-sigma methodologies.  \n• Drove projects to improve overlay, CD uniformity, and reduce lithography defects. \n• Developed best known methods for machine matching to enable platform transition from development to high volume manufacturing. Oversaw training of team of technicians in response flow charts to common equipment problems. \n• Worked with material suppliers through recursive DOEs to improve material properties leading to improved lithography process window.  \n Senior Module Integration and Yield Engineer Intel Corportation July 2010  –  July 2012  (2 years 1 month) Hillsboro, OR • Integrated critical 193 nm immersion scanners into Intel's 22nm process technology node. \n• Oversaw machine matching and monitored product overlay and CD performance using six-sigma methodologies.  \n• Drove projects to improve overlay, CD uniformity, and reduce lithography defects. \n• Developed best known methods for machine matching to enable platform transition from development to high volume manufacturing. Oversaw training of team of technicians in response flow charts to common equipment problems. \n• Worked with material suppliers through recursive DOEs to improve material properties leading to improved lithography process window.  \n Research Assistant University of Minnesota June 2005  –  August 2010  (5 years 3 months) University of Minnesota, Minneapolis, MN • Fabricated optoelectronic semiconductor devices including spin LEDs and spin injection/transport devices with a rapid turnaround time. \n• Increased yield from < 20% to ~ 100% by improving our fabrication techniques, while increasing both the density and complexity of the devices on each chip. \n• Performed low temperature measurements requiring a sensitivity of one part in 100,000. \n• Developed LabView code to highly automate measurement process. \n• Analyzed large amounts of data and use this data to suggest improved structures to our collaborators, including modifications to device materials and Schottky barriers. \n• Oversaw safety training for and use of a high magnetic field, low temperature cryostat. \n Research Assistant University of Minnesota June 2005  –  August 2010  (5 years 3 months) University of Minnesota, Minneapolis, MN • Fabricated optoelectronic semiconductor devices including spin LEDs and spin injection/transport devices with a rapid turnaround time. \n• Increased yield from < 20% to ~ 100% by improving our fabrication techniques, while increasing both the density and complexity of the devices on each chip. \n• Performed low temperature measurements requiring a sensitivity of one part in 100,000. \n• Developed LabView code to highly automate measurement process. \n• Analyzed large amounts of data and use this data to suggest improved structures to our collaborators, including modifications to device materials and Schottky barriers. \n• Oversaw safety training for and use of a high magnetic field, low temperature cryostat. \n Teaching Assistant University of Minnesota September 2005  –  May 2006  (9 months) Communicated complex physics concepts to non-physics majors. Teaching Assistant University of Minnesota September 2005  –  May 2006  (9 months) Communicated complex physics concepts to non-physics majors. Undergraduate Mathematics Tutor Saint John's University September 2003  –  May 2005  (1 year 9 months) Undergraduate Mathematics Tutor Saint John's University September 2003  –  May 2005  (1 year 9 months) Undergraduate Research Assistant Saint John's University May 2003  –  May 2005  (2 years 1 month) Determined radiation dose received from radon in household residences. \nDesigned a cost-effective detector that more accurately predicts radiation dose. Undergraduate Research Assistant Saint John's University May 2003  –  May 2005  (2 years 1 month) Determined radiation dose received from radon in household residences. \nDesigned a cost-effective detector that more accurately predicts radiation dose. Skills Physics Photolithography Data Analysis Data Visualization Characterization Statistics Mathematical Modeling JMP Programming Process Improvement Design of Experiments Project Management Stakeholder Management Semiconductor... Overlay Scanning Electron... Semiconductors Matlab AFM LaTeX Thin Films Magnetics Labview Materials Science Six Sigma Failure Analysis Spintronics See 12+     See less Skills  Physics Photolithography Data Analysis Data Visualization Characterization Statistics Mathematical Modeling JMP Programming Process Improvement Design of Experiments Project Management Stakeholder Management Semiconductor... Overlay Scanning Electron... Semiconductors Matlab AFM LaTeX Thin Films Magnetics Labview Materials Science Six Sigma Failure Analysis Spintronics See 12+     See less Physics Photolithography Data Analysis Data Visualization Characterization Statistics Mathematical Modeling JMP Programming Process Improvement Design of Experiments Project Management Stakeholder Management Semiconductor... Overlay Scanning Electron... Semiconductors Matlab AFM LaTeX Thin Films Magnetics Labview Materials Science Six Sigma Failure Analysis Spintronics See 12+     See less Physics Photolithography Data Analysis Data Visualization Characterization Statistics Mathematical Modeling JMP Programming Process Improvement Design of Experiments Project Management Stakeholder Management Semiconductor... Overlay Scanning Electron... Semiconductors Matlab AFM LaTeX Thin Films Magnetics Labview Materials Science Six Sigma Failure Analysis Spintronics See 12+     See less Education University of Minnesota-Twin Cities Ph.D.,  Physics 2005  – 2010 Received IGERT Fellowship award of $30,000 plus tuition, Received Graduate School Fellowship award of $17,500 plus tuition, GPA of 3.946/4.000. Activities and Societies:  Research assistant starting in summer 2005 ,  teaching assistant from fall 2005 - spring 2006 Saint John's University B.A.,  Physics 2002  – 2005 Graduated Egregia Cum Laude with a GPA of 4.000/4.000. Activities and Societies:  Research assistant from 2003-2005 ,  Mathematics tutor from 2003-2005 University of Minnesota-Twin Cities Ph.D.,  Physics 2005  – 2010 Received IGERT Fellowship award of $30,000 plus tuition, Received Graduate School Fellowship award of $17,500 plus tuition, GPA of 3.946/4.000. Activities and Societies:  Research assistant starting in summer 2005 ,  teaching assistant from fall 2005 - spring 2006 University of Minnesota-Twin Cities Ph.D.,  Physics 2005  – 2010 Received IGERT Fellowship award of $30,000 plus tuition, Received Graduate School Fellowship award of $17,500 plus tuition, GPA of 3.946/4.000. Activities and Societies:  Research assistant starting in summer 2005 ,  teaching assistant from fall 2005 - spring 2006 University of Minnesota-Twin Cities Ph.D.,  Physics 2005  – 2010 Received IGERT Fellowship award of $30,000 plus tuition, Received Graduate School Fellowship award of $17,500 plus tuition, GPA of 3.946/4.000. Activities and Societies:  Research assistant starting in summer 2005 ,  teaching assistant from fall 2005 - spring 2006 Saint John's University B.A.,  Physics 2002  – 2005 Graduated Egregia Cum Laude with a GPA of 4.000/4.000. Activities and Societies:  Research assistant from 2003-2005 ,  Mathematics tutor from 2003-2005 Saint John's University B.A.,  Physics 2002  – 2005 Graduated Egregia Cum Laude with a GPA of 4.000/4.000. Activities and Societies:  Research assistant from 2003-2005 ,  Mathematics tutor from 2003-2005 Saint John's University B.A.,  Physics 2002  – 2005 Graduated Egregia Cum Laude with a GPA of 4.000/4.000. Activities and Societies:  Research assistant from 2003-2005 ,  Mathematics tutor from 2003-2005 ", "Summary . Summary . . . Experience Staff Process Engineer Intel Corporation November 2010  – Present (4 years 10 months) Staff Failure Analysis Engineer Intel Corporation October 2007  –  November 2010  (3 years 2 months) Staff and Senior Process Engineer Intel Corporation December 2003  –  October 2007  (3 years 11 months) Staff Process Engineer Intel Corporation November 2010  – Present (4 years 10 months) Staff Process Engineer Intel Corporation November 2010  – Present (4 years 10 months) Staff Failure Analysis Engineer Intel Corporation October 2007  –  November 2010  (3 years 2 months) Staff Failure Analysis Engineer Intel Corporation October 2007  –  November 2010  (3 years 2 months) Staff and Senior Process Engineer Intel Corporation December 2003  –  October 2007  (3 years 11 months) Staff and Senior Process Engineer Intel Corporation December 2003  –  October 2007  (3 years 11 months) Skills Metrology Semiconductors Thin Films CVD Semiconductor Industry Process Integration Skills  Metrology Semiconductors Thin Films CVD Semiconductor Industry Process Integration Metrology Semiconductors Thin Films CVD Semiconductor Industry Process Integration Metrology Semiconductors Thin Films CVD Semiconductor Industry Process Integration Education Peking University B.S.,  Physics University of Maryland College Park Ph.D,  Physics Peking University B.S.,  Physics Peking University B.S.,  Physics Peking University B.S.,  Physics University of Maryland College Park Ph.D,  Physics University of Maryland College Park Ph.D,  Physics University of Maryland College Park Ph.D,  Physics ", "Experience Senior Staff Process Engineer Intel Corporation April 2006  – Present (9 years 5 months) Chandler, Arizona - Qualification/Installations/Sustaining /Ramp of Diffusion furnaces, including ALD/CVD process for 22 and 14 nm technology. \n- Develop process to detect earlier failures to prevent Yield issues. \n- Lead/Help Engineers in developing DOEs on preventing fault systems. \n-Responsible of making modules capable for high volume manufacturing  \n Research Assistant University of Michigan September 2000  –  May 2006  (5 years 9 months) \tDissertation: “Alloys Containing Sb as Metamorphic Buffer Layers for Devices Applications”. \n\tInvestigated the in situ stress evolution in GaAsSb, InGaAs, GaSb metamorphic buffer layers grown by molecular beam epitaxy (MBE) on GaAs and InAs substrates. \n\tDevelop/modified model to estimate dislocation density using the in situ stress measurements.  \n\tMBE growth expertise of most III-V semiconductors. \n\tLab manager: Duties include schedule and coordination of the laboratory experiments, maintenance of the instrumentation, and provide graduate student guidance and training. Research Assistant University of Puerto Rico August 1996  –  May 2000  (3 years 10 months) \tSet-up an e-beam lithography system with a SEM. \n\tWorked with device fabrication using e-beam lithography. \n\tAssembled a thermal evaporator for metal deposition. \n\tCreated interdigital capacitors on the surface of BaMgF2, PZT, and Diamond thin films. Senior Staff Process Engineer Intel Corporation April 2006  – Present (9 years 5 months) Chandler, Arizona - Qualification/Installations/Sustaining /Ramp of Diffusion furnaces, including ALD/CVD process for 22 and 14 nm technology. \n- Develop process to detect earlier failures to prevent Yield issues. \n- Lead/Help Engineers in developing DOEs on preventing fault systems. \n-Responsible of making modules capable for high volume manufacturing  \n Senior Staff Process Engineer Intel Corporation April 2006  – Present (9 years 5 months) Chandler, Arizona - Qualification/Installations/Sustaining /Ramp of Diffusion furnaces, including ALD/CVD process for 22 and 14 nm technology. \n- Develop process to detect earlier failures to prevent Yield issues. \n- Lead/Help Engineers in developing DOEs on preventing fault systems. \n-Responsible of making modules capable for high volume manufacturing  \n Research Assistant University of Michigan September 2000  –  May 2006  (5 years 9 months) \tDissertation: “Alloys Containing Sb as Metamorphic Buffer Layers for Devices Applications”. \n\tInvestigated the in situ stress evolution in GaAsSb, InGaAs, GaSb metamorphic buffer layers grown by molecular beam epitaxy (MBE) on GaAs and InAs substrates. \n\tDevelop/modified model to estimate dislocation density using the in situ stress measurements.  \n\tMBE growth expertise of most III-V semiconductors. \n\tLab manager: Duties include schedule and coordination of the laboratory experiments, maintenance of the instrumentation, and provide graduate student guidance and training. Research Assistant University of Michigan September 2000  –  May 2006  (5 years 9 months) \tDissertation: “Alloys Containing Sb as Metamorphic Buffer Layers for Devices Applications”. \n\tInvestigated the in situ stress evolution in GaAsSb, InGaAs, GaSb metamorphic buffer layers grown by molecular beam epitaxy (MBE) on GaAs and InAs substrates. \n\tDevelop/modified model to estimate dislocation density using the in situ stress measurements.  \n\tMBE growth expertise of most III-V semiconductors. \n\tLab manager: Duties include schedule and coordination of the laboratory experiments, maintenance of the instrumentation, and provide graduate student guidance and training. Research Assistant University of Puerto Rico August 1996  –  May 2000  (3 years 10 months) \tSet-up an e-beam lithography system with a SEM. \n\tWorked with device fabrication using e-beam lithography. \n\tAssembled a thermal evaporator for metal deposition. \n\tCreated interdigital capacitors on the surface of BaMgF2, PZT, and Diamond thin films. Research Assistant University of Puerto Rico August 1996  –  May 2000  (3 years 10 months) \tSet-up an e-beam lithography system with a SEM. \n\tWorked with device fabrication using e-beam lithography. \n\tAssembled a thermal evaporator for metal deposition. \n\tCreated interdigital capacitors on the surface of BaMgF2, PZT, and Diamond thin films. Languages Spanish Native or bilingual proficiency English Professional working proficiency Spanish Native or bilingual proficiency English Professional working proficiency Spanish Native or bilingual proficiency English Professional working proficiency Native or bilingual proficiency Professional working proficiency Skills AFM Thin Films Scanning Electron... Powder X-ray Diffraction CVD Physics TEM Semiconductors JMP Mathematica Electron Beam... Device Characterization Diffusion 22nm 10nm 14nm Electronics Characterization Laboratory Nanotechnology Materials Science See 6+     See less Skills  AFM Thin Films Scanning Electron... Powder X-ray Diffraction CVD Physics TEM Semiconductors JMP Mathematica Electron Beam... Device Characterization Diffusion 22nm 10nm 14nm Electronics Characterization Laboratory Nanotechnology Materials Science See 6+     See less AFM Thin Films Scanning Electron... Powder X-ray Diffraction CVD Physics TEM Semiconductors JMP Mathematica Electron Beam... Device Characterization Diffusion 22nm 10nm 14nm Electronics Characterization Laboratory Nanotechnology Materials Science See 6+     See less AFM Thin Films Scanning Electron... Powder X-ray Diffraction CVD Physics TEM Semiconductors JMP Mathematica Electron Beam... Device Characterization Diffusion 22nm 10nm 14nm Electronics Characterization Laboratory Nanotechnology Materials Science See 6+     See less Education University of Michigan Doctor of Philosophy (PhD),  Applied Physics 2000  – 2006 Universidad de Puerto Rico Finished graduate level Physics Courses.,  Physics 1998  – 2000 Finished graduate level Physics Courses and comprehensive tests. Universidad de Puerto Rico Bachelor of Science (BS),  Physics , sumacunlaude 1994  – 1998 University of Michigan Doctor of Philosophy (PhD),  Applied Physics 2000  – 2006 University of Michigan Doctor of Philosophy (PhD),  Applied Physics 2000  – 2006 University of Michigan Doctor of Philosophy (PhD),  Applied Physics 2000  – 2006 Universidad de Puerto Rico Finished graduate level Physics Courses.,  Physics 1998  – 2000 Finished graduate level Physics Courses and comprehensive tests. Universidad de Puerto Rico Finished graduate level Physics Courses.,  Physics 1998  – 2000 Finished graduate level Physics Courses and comprehensive tests. Universidad de Puerto Rico Finished graduate level Physics Courses.,  Physics 1998  – 2000 Finished graduate level Physics Courses and comprehensive tests. Universidad de Puerto Rico Bachelor of Science (BS),  Physics , sumacunlaude 1994  – 1998 Universidad de Puerto Rico Bachelor of Science (BS),  Physics , sumacunlaude 1994  – 1998 Universidad de Puerto Rico Bachelor of Science (BS),  Physics , sumacunlaude 1994  – 1998 Honors & Awards Intel recognition/ awards Intel 2013 Intel recognition for sustaining cost reduction/installation/qual and ramp for 32/22 nm technologies. B.S. in Physics summa cum laude. 1998 B.S. in Physics summa cum laude. Rackham Merit Fellowship 2000 Rackham Merit Fellowship Intel recognition/ awards Intel 2013 Intel recognition for sustaining cost reduction/installation/qual and ramp for 32/22 nm technologies. Intel recognition/ awards Intel 2013 Intel recognition for sustaining cost reduction/installation/qual and ramp for 32/22 nm technologies. Intel recognition/ awards Intel 2013 Intel recognition for sustaining cost reduction/installation/qual and ramp for 32/22 nm technologies. B.S. in Physics summa cum laude. 1998 B.S. in Physics summa cum laude. B.S. in Physics summa cum laude. 1998 B.S. in Physics summa cum laude. B.S. in Physics summa cum laude. 1998 B.S. in Physics summa cum laude. Rackham Merit Fellowship 2000 Rackham Merit Fellowship Rackham Merit Fellowship 2000 Rackham Merit Fellowship Rackham Merit Fellowship 2000 Rackham Merit Fellowship ", "Experience Sr. Staff Development Engineer SunPower Corporation July 2012  – Present (3 years 2 months) San Francisco Bay Area Development Engineer First Solar October 2009  –  July 2012  (2 years 10 months) Research & Development Engineer Numonyx B.V. April 2008  –  April 2009  (1 year 1 month) Staff Process Engineer Intel Corporation 2000  –  2008  (8 years) Graduate Research Assistant North Carolina State University 1995  –  2000  (5 years) Sr. Staff Development Engineer SunPower Corporation July 2012  – Present (3 years 2 months) San Francisco Bay Area Sr. Staff Development Engineer SunPower Corporation July 2012  – Present (3 years 2 months) San Francisco Bay Area Development Engineer First Solar October 2009  –  July 2012  (2 years 10 months) Development Engineer First Solar October 2009  –  July 2012  (2 years 10 months) Research & Development Engineer Numonyx B.V. April 2008  –  April 2009  (1 year 1 month) Research & Development Engineer Numonyx B.V. April 2008  –  April 2009  (1 year 1 month) Staff Process Engineer Intel Corporation 2000  –  2008  (8 years) Staff Process Engineer Intel Corporation 2000  –  2008  (8 years) Graduate Research Assistant North Carolina State University 1995  –  2000  (5 years) Graduate Research Assistant North Carolina State University 1995  –  2000  (5 years) Skills JMP Process Integration Semiconductors Thin Films Silicon Failure Analysis PVD CVD Design of Experiments Characterization Metrology Semiconductor Industry Yield PECVD Sputtering Materials Science Manufacturing SPC See 3+     See less Skills  JMP Process Integration Semiconductors Thin Films Silicon Failure Analysis PVD CVD Design of Experiments Characterization Metrology Semiconductor Industry Yield PECVD Sputtering Materials Science Manufacturing SPC See 3+     See less JMP Process Integration Semiconductors Thin Films Silicon Failure Analysis PVD CVD Design of Experiments Characterization Metrology Semiconductor Industry Yield PECVD Sputtering Materials Science Manufacturing SPC See 3+     See less JMP Process Integration Semiconductors Thin Films Silicon Failure Analysis PVD CVD Design of Experiments Characterization Metrology Semiconductor Industry Yield PECVD Sputtering Materials Science Manufacturing SPC See 3+     See less Education North Carolina State University PhD,  Materials Science and Engineering 1995  – 2000 Queens College Bachelor's,  Physics 1990  – 1994 North Carolina State University PhD,  Materials Science and Engineering 1995  – 2000 North Carolina State University PhD,  Materials Science and Engineering 1995  – 2000 North Carolina State University PhD,  Materials Science and Engineering 1995  – 2000 Queens College Bachelor's,  Physics 1990  – 1994 Queens College Bachelor's,  Physics 1990  – 1994 Queens College Bachelor's,  Physics 1990  – 1994 ", "Experience Staff Process Engineer Intel Corporation March 2009  – Present (6 years 6 months) Portland, Oregon Area •\tResearch/development on FEOL patterning processes  \n•\tExpert on DOE (Design of Experiment), SPC, and statistical data analysis \n•\tExpert on FinFET, high-k metal gate, and double patterning processes \n•\tExpert on plasma etching processes on semiconductor and dielectric materials \n•\tExpert on data acquisition and handling using SQL, JMP, and JSL \n•\tExperience on equipment development to meet quality, yield, and low cost  \n•\tExperience on technology pathfinding with complex problem solving and technology transfer to high volume manufacturing VF Graduate student researcher UC Berkeley January 2006  –  February 2009  (3 years 2 months) Berkeley, CA •\tResearch on femtosecond laser processing on dielectric materials and opto-fluidic bio-chip fabrication for cell counting \n•\tExpert on laser processing, optical system design, and thermal/microfluidic/optical characterization \n•\tExpert on thermal analysis using deep fundamental knowledge of heat transfer \n•\tExperience on analog circuit design and hardware control using GPIB and Labview \n•\tExperience on bio-cell culturing and micro fluidic experiment \n•\tExperience on various analytical tools (SEM, AFM, confocal microscope, Time of Flight, IR scanner, and spectroscope)  \n•\tExperience on analytical software (Solid Works, IDEAS, AutoCAD, BeamPro, FDTD code, and Matlab) Student research assistant Lawrance Berkeley National Lab January 2003  –  December 2005  (3 years) Bekeley, CA •\tResearch on fault detection and diagnosis systems for HVAC in large commercial buildings \n•\tSoftware development for fault detection/diagnosis system using Visual C++, fuzzy logics, and thermal models \n•\tExperience on thermal analysis using SPARK Staff Process Engineer Intel Corporation March 2009  – Present (6 years 6 months) Portland, Oregon Area •\tResearch/development on FEOL patterning processes  \n•\tExpert on DOE (Design of Experiment), SPC, and statistical data analysis \n•\tExpert on FinFET, high-k metal gate, and double patterning processes \n•\tExpert on plasma etching processes on semiconductor and dielectric materials \n•\tExpert on data acquisition and handling using SQL, JMP, and JSL \n•\tExperience on equipment development to meet quality, yield, and low cost  \n•\tExperience on technology pathfinding with complex problem solving and technology transfer to high volume manufacturing VF Staff Process Engineer Intel Corporation March 2009  – Present (6 years 6 months) Portland, Oregon Area •\tResearch/development on FEOL patterning processes  \n•\tExpert on DOE (Design of Experiment), SPC, and statistical data analysis \n•\tExpert on FinFET, high-k metal gate, and double patterning processes \n•\tExpert on plasma etching processes on semiconductor and dielectric materials \n•\tExpert on data acquisition and handling using SQL, JMP, and JSL \n•\tExperience on equipment development to meet quality, yield, and low cost  \n•\tExperience on technology pathfinding with complex problem solving and technology transfer to high volume manufacturing VF Graduate student researcher UC Berkeley January 2006  –  February 2009  (3 years 2 months) Berkeley, CA •\tResearch on femtosecond laser processing on dielectric materials and opto-fluidic bio-chip fabrication for cell counting \n•\tExpert on laser processing, optical system design, and thermal/microfluidic/optical characterization \n•\tExpert on thermal analysis using deep fundamental knowledge of heat transfer \n•\tExperience on analog circuit design and hardware control using GPIB and Labview \n•\tExperience on bio-cell culturing and micro fluidic experiment \n•\tExperience on various analytical tools (SEM, AFM, confocal microscope, Time of Flight, IR scanner, and spectroscope)  \n•\tExperience on analytical software (Solid Works, IDEAS, AutoCAD, BeamPro, FDTD code, and Matlab) Graduate student researcher UC Berkeley January 2006  –  February 2009  (3 years 2 months) Berkeley, CA •\tResearch on femtosecond laser processing on dielectric materials and opto-fluidic bio-chip fabrication for cell counting \n•\tExpert on laser processing, optical system design, and thermal/microfluidic/optical characterization \n•\tExpert on thermal analysis using deep fundamental knowledge of heat transfer \n•\tExperience on analog circuit design and hardware control using GPIB and Labview \n•\tExperience on bio-cell culturing and micro fluidic experiment \n•\tExperience on various analytical tools (SEM, AFM, confocal microscope, Time of Flight, IR scanner, and spectroscope)  \n•\tExperience on analytical software (Solid Works, IDEAS, AutoCAD, BeamPro, FDTD code, and Matlab) Student research assistant Lawrance Berkeley National Lab January 2003  –  December 2005  (3 years) Bekeley, CA •\tResearch on fault detection and diagnosis systems for HVAC in large commercial buildings \n•\tSoftware development for fault detection/diagnosis system using Visual C++, fuzzy logics, and thermal models \n•\tExperience on thermal analysis using SPARK Student research assistant Lawrance Berkeley National Lab January 2003  –  December 2005  (3 years) Bekeley, CA •\tResearch on fault detection and diagnosis systems for HVAC in large commercial buildings \n•\tSoftware development for fault detection/diagnosis system using Visual C++, fuzzy logics, and thermal models \n•\tExperience on thermal analysis using SPARK Skills Semiconductors Thin Films Laser Heat Transfer Plasma Etching Microfluidics Vacuum Semiconductor... Visual C++ Labview Materials Science Design of Experiments Failure Analysis Experimentation Spectroscopy JMP SolidWorks AFM Characterization LabVIEW Matlab See 6+     See less Skills  Semiconductors Thin Films Laser Heat Transfer Plasma Etching Microfluidics Vacuum Semiconductor... Visual C++ Labview Materials Science Design of Experiments Failure Analysis Experimentation Spectroscopy JMP SolidWorks AFM Characterization LabVIEW Matlab See 6+     See less Semiconductors Thin Films Laser Heat Transfer Plasma Etching Microfluidics Vacuum Semiconductor... Visual C++ Labview Materials Science Design of Experiments Failure Analysis Experimentation Spectroscopy JMP SolidWorks AFM Characterization LabVIEW Matlab See 6+     See less Semiconductors Thin Films Laser Heat Transfer Plasma Etching Microfluidics Vacuum Semiconductor... Visual C++ Labview Materials Science Design of Experiments Failure Analysis Experimentation Spectroscopy JMP SolidWorks AFM Characterization LabVIEW Matlab See 6+     See less Education UC Berkeley MS and Ph.D,  Mechanical Engineering 2002  – 2008 Major : Heat transfer, Minor : Control and Statistics 서울대학교 / Seoul National University B.S.,  Mechanical and Aerospace Engineerin 1995  – 2002 UC Berkeley MS and Ph.D,  Mechanical Engineering 2002  – 2008 Major : Heat transfer, Minor : Control and Statistics UC Berkeley MS and Ph.D,  Mechanical Engineering 2002  – 2008 Major : Heat transfer, Minor : Control and Statistics UC Berkeley MS and Ph.D,  Mechanical Engineering 2002  – 2008 Major : Heat transfer, Minor : Control and Statistics 서울대학교 / Seoul National University B.S.,  Mechanical and Aerospace Engineerin 1995  – 2002 서울대학교 / Seoul National University B.S.,  Mechanical and Aerospace Engineerin 1995  – 2002 서울대학교 / Seoul National University B.S.,  Mechanical and Aerospace Engineerin 1995  – 2002 ", "Experience Staff Process Engineer Intel Corporation April 2014  – Present (1 year 5 months) Hillsboro, OR Staff Process Engineer Intel Corporation April 2014  – Present (1 year 5 months) Hillsboro, OR Staff Process Engineer Intel Corporation April 2014  – Present (1 year 5 months) Hillsboro, OR Skills Statistical Process... Scanning Electron... Small-angle x-ray... Rheology Thermal Gravimetric... Differential Scanning... Transmission Electron... Infrared Spectroscopy Dynamic Light Scattering UV/Vis Spectroscopy General chemistry and... Materials Science Characterization Thin Films Spectroscopy Nanotechnology See 1+     See less Skills  Statistical Process... Scanning Electron... Small-angle x-ray... Rheology Thermal Gravimetric... Differential Scanning... Transmission Electron... Infrared Spectroscopy Dynamic Light Scattering UV/Vis Spectroscopy General chemistry and... Materials Science Characterization Thin Films Spectroscopy Nanotechnology See 1+     See less Statistical Process... Scanning Electron... Small-angle x-ray... Rheology Thermal Gravimetric... Differential Scanning... Transmission Electron... Infrared Spectroscopy Dynamic Light Scattering UV/Vis Spectroscopy General chemistry and... Materials Science Characterization Thin Films Spectroscopy Nanotechnology See 1+     See less Statistical Process... Scanning Electron... Small-angle x-ray... Rheology Thermal Gravimetric... Differential Scanning... Transmission Electron... Infrared Spectroscopy Dynamic Light Scattering UV/Vis Spectroscopy General chemistry and... Materials Science Characterization Thin Films Spectroscopy Nanotechnology See 1+     See less Education Cornell University Ph.D. 2003  – 2010 University of California, Riverside BS 1998  – 2003 Cornell University Ph.D. 2003  – 2010 Cornell University Ph.D. 2003  – 2010 Cornell University Ph.D. 2003  – 2010 University of California, Riverside BS 1998  – 2003 University of California, Riverside BS 1998  – 2003 University of California, Riverside BS 1998  – 2003 "]}