{"position": "Staff Systems Engineer", "company": "Intel Corporation", "profiles": ["Skills Electronics Linux Digital Signal... Hardware Architecture H.264 MPEG2 Perl Software Engineering C C++ MPEG Software Design Signal Processing Computer Architecture Software Development Android Development See 1+     See less Skills  Electronics Linux Digital Signal... Hardware Architecture H.264 MPEG2 Perl Software Engineering C C++ MPEG Software Design Signal Processing Computer Architecture Software Development Android Development See 1+     See less Electronics Linux Digital Signal... Hardware Architecture H.264 MPEG2 Perl Software Engineering C C++ MPEG Software Design Signal Processing Computer Architecture Software Development Android Development See 1+     See less Electronics Linux Digital Signal... Hardware Architecture H.264 MPEG2 Perl Software Engineering C C++ MPEG Software Design Signal Processing Computer Architecture Software Development Android Development See 1+     See less ", "Experience Senior Staff System Engineer Qualcomm March 2010  – Present (5 years 6 months) Senior Staff Systems Engineer Marvell Semiconductor Inc. June 2007  –  July 2010  (3 years 2 months) Senior Staff Systems Engineer Intel Corporation 2004  –  2007  (3 years) Wireless Systems Architect of intel's WiMAX chip design project. Engineering Manager ITRI SoC Technology Center February 2003  –  April 2004  (1 year 3 months) Member of Technical Staff Morphics Technology and Televersal Systems December 2000  –  December 2002  (2 years 1 month) Senior Staff System Engineer Qualcomm March 2010  – Present (5 years 6 months) Senior Staff System Engineer Qualcomm March 2010  – Present (5 years 6 months) Senior Staff Systems Engineer Marvell Semiconductor Inc. June 2007  –  July 2010  (3 years 2 months) Senior Staff Systems Engineer Marvell Semiconductor Inc. June 2007  –  July 2010  (3 years 2 months) Senior Staff Systems Engineer Intel Corporation 2004  –  2007  (3 years) Wireless Systems Architect of intel's WiMAX chip design project. Senior Staff Systems Engineer Intel Corporation 2004  –  2007  (3 years) Wireless Systems Architect of intel's WiMAX chip design project. Engineering Manager ITRI SoC Technology Center February 2003  –  April 2004  (1 year 3 months) Engineering Manager ITRI SoC Technology Center February 2003  –  April 2004  (1 year 3 months) Member of Technical Staff Morphics Technology and Televersal Systems December 2000  –  December 2002  (2 years 1 month) Member of Technical Staff Morphics Technology and Televersal Systems December 2000  –  December 2002  (2 years 1 month) Skills ASIC IC PHY SoC Digital Signal... Skills  ASIC IC PHY SoC Digital Signal... ASIC IC PHY SoC Digital Signal... ASIC IC PHY SoC Digital Signal... Education University of Southern California Ph.D.,  EE 1991  – 1997 National Chiao Tung University Master's Degree,  Communication Engineering University of Southern California Ph.D.,  EE 1991  – 1997 University of Southern California Ph.D.,  EE 1991  – 1997 University of Southern California Ph.D.,  EE 1991  – 1997 National Chiao Tung University Master's Degree,  Communication Engineering National Chiao Tung University Master's Degree,  Communication Engineering National Chiao Tung University Master's Degree,  Communication Engineering ", "Summary Broad experience and proven track record of leading research and development projects and delivering key products in large technology companies. Deep domain expertise in processor architecture and validation, DRAM technologies, memory controllers, system architecture, power management, reliability, thermals, signal integrity, ASIC and board design. Experience representing large organizations in standard bodies and driving broad industry standards. Proven track record of leading complex projects for premier industry research lab and generating IP (33 issued patents). Recognized industry expert on memory and computer architecture with multiple publications and speaking roles in industry and research conferences. Summary Broad experience and proven track record of leading research and development projects and delivering key products in large technology companies. Deep domain expertise in processor architecture and validation, DRAM technologies, memory controllers, system architecture, power management, reliability, thermals, signal integrity, ASIC and board design. Experience representing large organizations in standard bodies and driving broad industry standards. Proven track record of leading complex projects for premier industry research lab and generating IP (33 issued patents). Recognized industry expert on memory and computer architecture with multiple publications and speaking roles in industry and research conferences. Broad experience and proven track record of leading research and development projects and delivering key products in large technology companies. Deep domain expertise in processor architecture and validation, DRAM technologies, memory controllers, system architecture, power management, reliability, thermals, signal integrity, ASIC and board design. Experience representing large organizations in standard bodies and driving broad industry standards. Proven track record of leading complex projects for premier industry research lab and generating IP (33 issued patents). Recognized industry expert on memory and computer architecture with multiple publications and speaking roles in industry and research conferences. Broad experience and proven track record of leading research and development projects and delivering key products in large technology companies. Deep domain expertise in processor architecture and validation, DRAM technologies, memory controllers, system architecture, power management, reliability, thermals, signal integrity, ASIC and board design. Experience representing large organizations in standard bodies and driving broad industry standards. Proven track record of leading complex projects for premier industry research lab and generating IP (33 issued patents). Recognized industry expert on memory and computer architecture with multiple publications and speaking roles in industry and research conferences. Experience System Validation Engineer Intel Corporation August 2014  –  July 2015  (1 year) Dupont, WA Led team validating the performance, and energy efficient power / performance (performance per watt) of the next generation Intel Xeon Phi processor. To reduce validation cost, drove new process of measuring power using existing PMBus telemetry for power supplies and voltage regulators. Introduced new High Performance Computing (HPC) benchmarks to the System Validation Engineering group. Principal Engineer Intel Corporation April 2005  –  August 2014  (9 years 5 months) Hillsboro, OR Intel Architecture Group (IAG), IDGa Architecture, Memory Architecture Staff Systems Engineer Intel Corporation April 1996  –  April 2005  (9 years 1 month) System Validation Engineer Intel Corporation August 2014  –  July 2015  (1 year) Dupont, WA Led team validating the performance, and energy efficient power / performance (performance per watt) of the next generation Intel Xeon Phi processor. To reduce validation cost, drove new process of measuring power using existing PMBus telemetry for power supplies and voltage regulators. Introduced new High Performance Computing (HPC) benchmarks to the System Validation Engineering group. System Validation Engineer Intel Corporation August 2014  –  July 2015  (1 year) Dupont, WA Led team validating the performance, and energy efficient power / performance (performance per watt) of the next generation Intel Xeon Phi processor. To reduce validation cost, drove new process of measuring power using existing PMBus telemetry for power supplies and voltage regulators. Introduced new High Performance Computing (HPC) benchmarks to the System Validation Engineering group. Principal Engineer Intel Corporation April 2005  –  August 2014  (9 years 5 months) Hillsboro, OR Intel Architecture Group (IAG), IDGa Architecture, Memory Architecture Principal Engineer Intel Corporation April 2005  –  August 2014  (9 years 5 months) Hillsboro, OR Intel Architecture Group (IAG), IDGa Architecture, Memory Architecture Staff Systems Engineer Intel Corporation April 1996  –  April 2005  (9 years 1 month) Staff Systems Engineer Intel Corporation April 1996  –  April 2005  (9 years 1 month) Skills Processors Computer Architecture Hardware Architecture High Performance... SoC Power Management Semiconductors ASIC Logic Design VLSI Architecture Microprocessors Memory Architecture IC Debugging Embedded Systems Verilog Architectures Firmware Intel Microarchitecture CMOS FPGA SystemVerilog Analog Simulations Semiconductor Industry Device Drivers EDA Flash Memory X86 RTL design Mixed Signal Digital Signal... See 19+     See less Skills  Processors Computer Architecture Hardware Architecture High Performance... SoC Power Management Semiconductors ASIC Logic Design VLSI Architecture Microprocessors Memory Architecture IC Debugging Embedded Systems Verilog Architectures Firmware Intel Microarchitecture CMOS FPGA SystemVerilog Analog Simulations Semiconductor Industry Device Drivers EDA Flash Memory X86 RTL design Mixed Signal Digital Signal... See 19+     See less Processors Computer Architecture Hardware Architecture High Performance... SoC Power Management Semiconductors ASIC Logic Design VLSI Architecture Microprocessors Memory Architecture IC Debugging Embedded Systems Verilog Architectures Firmware Intel Microarchitecture CMOS FPGA SystemVerilog Analog Simulations Semiconductor Industry Device Drivers EDA Flash Memory X86 RTL design Mixed Signal Digital Signal... See 19+     See less Processors Computer Architecture Hardware Architecture High Performance... SoC Power Management Semiconductors ASIC Logic Design VLSI Architecture Microprocessors Memory Architecture IC Debugging Embedded Systems Verilog Architectures Firmware Intel Microarchitecture CMOS FPGA SystemVerilog Analog Simulations Semiconductor Industry Device Drivers EDA Flash Memory X86 RTL design Mixed Signal Digital Signal... See 19+     See less Education Carnegie Mellon University MS,  Electrical Engineering Michigan State University BS,  Physics Activities and Societies:  Programmer at MSU Cyclotron Laboratory Carnegie Mellon University MS,  Electrical Engineering Carnegie Mellon University MS,  Electrical Engineering Carnegie Mellon University MS,  Electrical Engineering Michigan State University BS,  Physics Activities and Societies:  Programmer at MSU Cyclotron Laboratory Michigan State University BS,  Physics Activities and Societies:  Programmer at MSU Cyclotron Laboratory Michigan State University BS,  Physics Activities and Societies:  Programmer at MSU Cyclotron Laboratory ", "Summary Semi-Retired for Now \n \nI plan to some time off and focus on general photography, astrophotography and astronomy. Within the astronomy area I want to learn more about galaxy evolution and classification. During this time I also plan to get more involved with the local IEEE Chapter in Phoenix and keep track on market changes in the Internet of Things and Wearable Computer market and do research in these areas. Summary Semi-Retired for Now \n \nI plan to some time off and focus on general photography, astrophotography and astronomy. Within the astronomy area I want to learn more about galaxy evolution and classification. During this time I also plan to get more involved with the local IEEE Chapter in Phoenix and keep track on market changes in the Internet of Things and Wearable Computer market and do research in these areas. Semi-Retired for Now \n \nI plan to some time off and focus on general photography, astrophotography and astronomy. Within the astronomy area I want to learn more about galaxy evolution and classification. During this time I also plan to get more involved with the local IEEE Chapter in Phoenix and keep track on market changes in the Internet of Things and Wearable Computer market and do research in these areas. Semi-Retired for Now \n \nI plan to some time off and focus on general photography, astrophotography and astronomy. Within the astronomy area I want to learn more about galaxy evolution and classification. During this time I also plan to get more involved with the local IEEE Chapter in Phoenix and keep track on market changes in the Internet of Things and Wearable Computer market and do research in these areas. Experience Retired - Staff Client Enterprise Architect / Systems Engineer Intel Corp September 2002  –  April 2014  (11 years 8 months) Chandler, AZ Enterprise Architecture – Sr. Staff IT Client Enterprise Architect \n \nResponsibilities: Client Enterprise Architect developing usage models, conceptual and reference architectures, roadmaps and user experience assessment.  \n \nSummary Accomplishments:  \n▪ Development of POC's centered on emerging virtualization technologies to best determine how to position these moving forward. Includes strategy development, roadmap planning, publication of Conceptual / Reference Architectures and developing Service Interaction Models. \n▪ Positioning of SaaS, Client / Server Hosted and App Virtualization, strategies and OS Streaming roadmaps. Development of Human Factor Engineering requirements and user survey’s. \n▪ Development of strategies, roadmaps, usages and reference architectural designs for Bring-Your-Own ‘Primary’ and ‘Companion’ devices within Intel. SWOT analysis and Business Value Proposition analysis. \n▪ Development of Usage Models and POC's to validate future IA technologies within Intel’s Business Groups. Focus includes client platform virtualization, multi-core and security. Includes the creation of marketing collateral to accompany the release of the technology or product. \n▪ Program / team management of various workgroups covering ‘client virtualization strategies’, Proof of Concepts, engineering analysis efforts and IT Blue Book roadmap development.  \n▪ Involvement in various IT Strategic Long Range Plans and IT Client Product Line Business Plans. \n▪ Program management of multiple teams driving the development of Compelling Proof Points to showcase Intel technology between IT and product Business Groups. \n \nAwards: 3ea IT Division Recognition Awards. \n \nOS Experience Includes: Windows OS’s, Android and various Linux’s. Other Experience Includes: Citrix, MokaFive, Parallels, Syncplicity, Web Site development. SaaS provider experience includes: Syncplicaty, DropBox, Google …etc. \n \nExperience In: SWOT analysis, Program Life Cycle Methodologies and HFE concepts. IT Technology R&D – Staff Systems Engineer Intel Corporation October 1996  –  September 2002  (6 years) Chandler, AZ Responsibilities: Research and development of new client office platforms, operating systems and strategies. \n \nSummary Accomplishments: \n▪ Published office PC operating system, disk and memory strategies and deployment recommendations. \n▪ Co-managed two large Joint Development Programs teams between Intel IT and Microsoft to functionally test, debug, certify and deploy future client / server OS’s within Intel’s environment before general availability.  \n▪ Researched technical and strategic impact and projected futures of IA Linux and made bi-yearly strategy recommendations to Strategy and Technology MRC and the IT R&D Council as to its use within Intel.  \n▪ Tracked Linux’s technical development and use within the industry through corporate Linux Working Group bodies, and defined a Linux technology ‘wish list’ and presented it to the corporate Linux “Core OS” team. \n \nAwards: 2ea IT Division Recognition Awards. \n \nOS Experience Included: Microsoft Windows 2000 / XP Professional and Linux. Factory Automation - Sr. Systems Engineer Intel Corporation October 1985  –  October 1996  (11 years 1 month) Chandler, AZ Responsibilities: Responsibilities included specifying, designing and functionally qualifying high performance computer platforms and high availability Database Servers used within Intel's manufacturing environments.  \n \nSummary Accomplishments:  \n▪ Defined UNIX SVR4 computer platform OS strategies and roadmaps in addition to specifying, designing and functionally qualifying high performance single and SMP database computer platforms and successful transfer of automation platforms to Intel's fab’s. \n▪ Technical management of UNIX SVR4 OS’s and UNIX client / server computer platform ISV/OEM’s. \n▪ Drove the migration from MS DOS / PC based ‘Station Controllers’ and MicroVAX / VMS based servers within Intel’s fab’s to UNIX based PC’s and high-end fault tolerant x86 UNIX SVR4 servers. \n▪ Development of functional test / stress plans, platform benchmarks and procedures for qualifying multiprocessor computer platforms and high performance 32 bit x86 UNIX operating systems. \n▪ Successful specification, design, and documentation of UNIX SVR4 real-time fab process ‘station controllers’ and the transfer of those platforms into Intel’s fab’s. \n▪ Identification and resolution of computer platform EMI / RFI susceptibility problems within Intel's fab’s and defined computer platform IEC 801.x and CISPR 22 requirements for deployed platforms. \n \nAwards: 4ea Factory Automation Division Recognition Awards. \n \nOS experience included: Microsoft Windows, UNIX SVR4, UNIX Shell Programming, UNIX Kernel and Performance Tuning, VMS and SECS-I/II GEM protocols. Other experience includes: Establishing end-user UNIX Training and OSV management. Platform Evaluation Engineer / Product Engineer Intel Corporation April 1982  –  October 1985  (3 years 7 months) Phoenix, AZ Responsibilities: Computer platform hardware specification, design, analysis, systems design, integration and functional qualification of x86 based computer platforms and Intel Single Board Computers.  \n \nSummary Accomplishments:  \n▪ Qualification of MultiBus I/II based computer boards and Personal Computer logic designs, worst case timing, signal loading, DC power, state machine analysis, component layout analysis, thermal mapping, functional testing, stress testing and product documentation prior to production prototype build.  \n▪ Identification and resolution of computer platform system design, functionality, HW / OS and application SW integration and user documentation issues before platforms were transfer to manufacturing. \n▪ Successful functional verification, performance, stress testing and documentation of Transaction Processing computer platforms before production release to manufacturing. \n▪ Successful environmental and regulatory certification of computer platforms and computer boards for shock, vibration, thermal, electrostatic discharge, DC power, FCC / VDE class A & B and UL / CSA compliance.  \n▪ Established Corporate ESD, DC power, signal loading / timing, thermal and FCC/VDE analysis test procedures.  \n▪ Single Board Computer BIOS development, testing and functional qualification. \n▪ Management of logic design evaluation teams to test / qualify computer platform logic and system designs in addition to the management of project schedules, staffing and funding requirements.  \n \nOS Experience Included: MS DOS, iNDX, iRMX and x86 Xenix. Programming Experience Included: Basic, ASMx86, PL/M, SIMULA, Pascal, C and CAD tools. Test equipment experience included: In-Circuit Emulators, logic analyzers, spectrum analyzers, oscilloscopes, thermal imagers, environmental test equipment …etc. Reliability, Availability and Serviceability Software Engineer Honeywell LISD September 1980  –  April 1982  (1 year 8 months) Phoenix, AZ Responsibilities: Simulation of new multi-user mainframe systems and sub-systems to determine system throughput performance, Reliability, Availability and Serviceability base lines.  \n \nSummary Accomplishments:  \n▪ Simulation of future mainframes to identify ways to maximize reliability, availability, serviceability and overall performance and the report out on findings and architectural recommendations. \n \nOS Experience Included: Multix and GCOS. Programming Experience Included; GPSS. Technician / Production Design Engineer Litton Industries (Currently Northrop Grumman Corp) March 1978  –  September 1980  (2 years 7 months) Tempe, AZ Responsibilities: Development of process control platforms used to control the manufacture of image intensifiers used in night vision devices. \n \nSummary Accomplishments:  \n▪ Successful development of industrial control platforms used to manufacture image intensifiers for night vision devices. \n▪ Design of high voltage power supplies, development of a manufacturing assembly and test line. \n \nOS Experience Included; MS DOS. Programming Experience Included; ASM80. Retired - Staff Client Enterprise Architect / Systems Engineer Intel Corp September 2002  –  April 2014  (11 years 8 months) Chandler, AZ Enterprise Architecture – Sr. Staff IT Client Enterprise Architect \n \nResponsibilities: Client Enterprise Architect developing usage models, conceptual and reference architectures, roadmaps and user experience assessment.  \n \nSummary Accomplishments:  \n▪ Development of POC's centered on emerging virtualization technologies to best determine how to position these moving forward. Includes strategy development, roadmap planning, publication of Conceptual / Reference Architectures and developing Service Interaction Models. \n▪ Positioning of SaaS, Client / Server Hosted and App Virtualization, strategies and OS Streaming roadmaps. Development of Human Factor Engineering requirements and user survey’s. \n▪ Development of strategies, roadmaps, usages and reference architectural designs for Bring-Your-Own ‘Primary’ and ‘Companion’ devices within Intel. SWOT analysis and Business Value Proposition analysis. \n▪ Development of Usage Models and POC's to validate future IA technologies within Intel’s Business Groups. Focus includes client platform virtualization, multi-core and security. Includes the creation of marketing collateral to accompany the release of the technology or product. \n▪ Program / team management of various workgroups covering ‘client virtualization strategies’, Proof of Concepts, engineering analysis efforts and IT Blue Book roadmap development.  \n▪ Involvement in various IT Strategic Long Range Plans and IT Client Product Line Business Plans. \n▪ Program management of multiple teams driving the development of Compelling Proof Points to showcase Intel technology between IT and product Business Groups. \n \nAwards: 3ea IT Division Recognition Awards. \n \nOS Experience Includes: Windows OS’s, Android and various Linux’s. Other Experience Includes: Citrix, MokaFive, Parallels, Syncplicity, Web Site development. SaaS provider experience includes: Syncplicaty, DropBox, Google …etc. \n \nExperience In: SWOT analysis, Program Life Cycle Methodologies and HFE concepts. Retired - Staff Client Enterprise Architect / Systems Engineer Intel Corp September 2002  –  April 2014  (11 years 8 months) Chandler, AZ Enterprise Architecture – Sr. Staff IT Client Enterprise Architect \n \nResponsibilities: Client Enterprise Architect developing usage models, conceptual and reference architectures, roadmaps and user experience assessment.  \n \nSummary Accomplishments:  \n▪ Development of POC's centered on emerging virtualization technologies to best determine how to position these moving forward. Includes strategy development, roadmap planning, publication of Conceptual / Reference Architectures and developing Service Interaction Models. \n▪ Positioning of SaaS, Client / Server Hosted and App Virtualization, strategies and OS Streaming roadmaps. Development of Human Factor Engineering requirements and user survey’s. \n▪ Development of strategies, roadmaps, usages and reference architectural designs for Bring-Your-Own ‘Primary’ and ‘Companion’ devices within Intel. SWOT analysis and Business Value Proposition analysis. \n▪ Development of Usage Models and POC's to validate future IA technologies within Intel’s Business Groups. Focus includes client platform virtualization, multi-core and security. Includes the creation of marketing collateral to accompany the release of the technology or product. \n▪ Program / team management of various workgroups covering ‘client virtualization strategies’, Proof of Concepts, engineering analysis efforts and IT Blue Book roadmap development.  \n▪ Involvement in various IT Strategic Long Range Plans and IT Client Product Line Business Plans. \n▪ Program management of multiple teams driving the development of Compelling Proof Points to showcase Intel technology between IT and product Business Groups. \n \nAwards: 3ea IT Division Recognition Awards. \n \nOS Experience Includes: Windows OS’s, Android and various Linux’s. Other Experience Includes: Citrix, MokaFive, Parallels, Syncplicity, Web Site development. SaaS provider experience includes: Syncplicaty, DropBox, Google …etc. \n \nExperience In: SWOT analysis, Program Life Cycle Methodologies and HFE concepts. IT Technology R&D – Staff Systems Engineer Intel Corporation October 1996  –  September 2002  (6 years) Chandler, AZ Responsibilities: Research and development of new client office platforms, operating systems and strategies. \n \nSummary Accomplishments: \n▪ Published office PC operating system, disk and memory strategies and deployment recommendations. \n▪ Co-managed two large Joint Development Programs teams between Intel IT and Microsoft to functionally test, debug, certify and deploy future client / server OS’s within Intel’s environment before general availability.  \n▪ Researched technical and strategic impact and projected futures of IA Linux and made bi-yearly strategy recommendations to Strategy and Technology MRC and the IT R&D Council as to its use within Intel.  \n▪ Tracked Linux’s technical development and use within the industry through corporate Linux Working Group bodies, and defined a Linux technology ‘wish list’ and presented it to the corporate Linux “Core OS” team. \n \nAwards: 2ea IT Division Recognition Awards. \n \nOS Experience Included: Microsoft Windows 2000 / XP Professional and Linux. IT Technology R&D – Staff Systems Engineer Intel Corporation October 1996  –  September 2002  (6 years) Chandler, AZ Responsibilities: Research and development of new client office platforms, operating systems and strategies. \n \nSummary Accomplishments: \n▪ Published office PC operating system, disk and memory strategies and deployment recommendations. \n▪ Co-managed two large Joint Development Programs teams between Intel IT and Microsoft to functionally test, debug, certify and deploy future client / server OS’s within Intel’s environment before general availability.  \n▪ Researched technical and strategic impact and projected futures of IA Linux and made bi-yearly strategy recommendations to Strategy and Technology MRC and the IT R&D Council as to its use within Intel.  \n▪ Tracked Linux’s technical development and use within the industry through corporate Linux Working Group bodies, and defined a Linux technology ‘wish list’ and presented it to the corporate Linux “Core OS” team. \n \nAwards: 2ea IT Division Recognition Awards. \n \nOS Experience Included: Microsoft Windows 2000 / XP Professional and Linux. Factory Automation - Sr. Systems Engineer Intel Corporation October 1985  –  October 1996  (11 years 1 month) Chandler, AZ Responsibilities: Responsibilities included specifying, designing and functionally qualifying high performance computer platforms and high availability Database Servers used within Intel's manufacturing environments.  \n \nSummary Accomplishments:  \n▪ Defined UNIX SVR4 computer platform OS strategies and roadmaps in addition to specifying, designing and functionally qualifying high performance single and SMP database computer platforms and successful transfer of automation platforms to Intel's fab’s. \n▪ Technical management of UNIX SVR4 OS’s and UNIX client / server computer platform ISV/OEM’s. \n▪ Drove the migration from MS DOS / PC based ‘Station Controllers’ and MicroVAX / VMS based servers within Intel’s fab’s to UNIX based PC’s and high-end fault tolerant x86 UNIX SVR4 servers. \n▪ Development of functional test / stress plans, platform benchmarks and procedures for qualifying multiprocessor computer platforms and high performance 32 bit x86 UNIX operating systems. \n▪ Successful specification, design, and documentation of UNIX SVR4 real-time fab process ‘station controllers’ and the transfer of those platforms into Intel’s fab’s. \n▪ Identification and resolution of computer platform EMI / RFI susceptibility problems within Intel's fab’s and defined computer platform IEC 801.x and CISPR 22 requirements for deployed platforms. \n \nAwards: 4ea Factory Automation Division Recognition Awards. \n \nOS experience included: Microsoft Windows, UNIX SVR4, UNIX Shell Programming, UNIX Kernel and Performance Tuning, VMS and SECS-I/II GEM protocols. Other experience includes: Establishing end-user UNIX Training and OSV management. Factory Automation - Sr. Systems Engineer Intel Corporation October 1985  –  October 1996  (11 years 1 month) Chandler, AZ Responsibilities: Responsibilities included specifying, designing and functionally qualifying high performance computer platforms and high availability Database Servers used within Intel's manufacturing environments.  \n \nSummary Accomplishments:  \n▪ Defined UNIX SVR4 computer platform OS strategies and roadmaps in addition to specifying, designing and functionally qualifying high performance single and SMP database computer platforms and successful transfer of automation platforms to Intel's fab’s. \n▪ Technical management of UNIX SVR4 OS’s and UNIX client / server computer platform ISV/OEM’s. \n▪ Drove the migration from MS DOS / PC based ‘Station Controllers’ and MicroVAX / VMS based servers within Intel’s fab’s to UNIX based PC’s and high-end fault tolerant x86 UNIX SVR4 servers. \n▪ Development of functional test / stress plans, platform benchmarks and procedures for qualifying multiprocessor computer platforms and high performance 32 bit x86 UNIX operating systems. \n▪ Successful specification, design, and documentation of UNIX SVR4 real-time fab process ‘station controllers’ and the transfer of those platforms into Intel’s fab’s. \n▪ Identification and resolution of computer platform EMI / RFI susceptibility problems within Intel's fab’s and defined computer platform IEC 801.x and CISPR 22 requirements for deployed platforms. \n \nAwards: 4ea Factory Automation Division Recognition Awards. \n \nOS experience included: Microsoft Windows, UNIX SVR4, UNIX Shell Programming, UNIX Kernel and Performance Tuning, VMS and SECS-I/II GEM protocols. Other experience includes: Establishing end-user UNIX Training and OSV management. Platform Evaluation Engineer / Product Engineer Intel Corporation April 1982  –  October 1985  (3 years 7 months) Phoenix, AZ Responsibilities: Computer platform hardware specification, design, analysis, systems design, integration and functional qualification of x86 based computer platforms and Intel Single Board Computers.  \n \nSummary Accomplishments:  \n▪ Qualification of MultiBus I/II based computer boards and Personal Computer logic designs, worst case timing, signal loading, DC power, state machine analysis, component layout analysis, thermal mapping, functional testing, stress testing and product documentation prior to production prototype build.  \n▪ Identification and resolution of computer platform system design, functionality, HW / OS and application SW integration and user documentation issues before platforms were transfer to manufacturing. \n▪ Successful functional verification, performance, stress testing and documentation of Transaction Processing computer platforms before production release to manufacturing. \n▪ Successful environmental and regulatory certification of computer platforms and computer boards for shock, vibration, thermal, electrostatic discharge, DC power, FCC / VDE class A & B and UL / CSA compliance.  \n▪ Established Corporate ESD, DC power, signal loading / timing, thermal and FCC/VDE analysis test procedures.  \n▪ Single Board Computer BIOS development, testing and functional qualification. \n▪ Management of logic design evaluation teams to test / qualify computer platform logic and system designs in addition to the management of project schedules, staffing and funding requirements.  \n \nOS Experience Included: MS DOS, iNDX, iRMX and x86 Xenix. Programming Experience Included: Basic, ASMx86, PL/M, SIMULA, Pascal, C and CAD tools. Test equipment experience included: In-Circuit Emulators, logic analyzers, spectrum analyzers, oscilloscopes, thermal imagers, environmental test equipment …etc. Platform Evaluation Engineer / Product Engineer Intel Corporation April 1982  –  October 1985  (3 years 7 months) Phoenix, AZ Responsibilities: Computer platform hardware specification, design, analysis, systems design, integration and functional qualification of x86 based computer platforms and Intel Single Board Computers.  \n \nSummary Accomplishments:  \n▪ Qualification of MultiBus I/II based computer boards and Personal Computer logic designs, worst case timing, signal loading, DC power, state machine analysis, component layout analysis, thermal mapping, functional testing, stress testing and product documentation prior to production prototype build.  \n▪ Identification and resolution of computer platform system design, functionality, HW / OS and application SW integration and user documentation issues before platforms were transfer to manufacturing. \n▪ Successful functional verification, performance, stress testing and documentation of Transaction Processing computer platforms before production release to manufacturing. \n▪ Successful environmental and regulatory certification of computer platforms and computer boards for shock, vibration, thermal, electrostatic discharge, DC power, FCC / VDE class A & B and UL / CSA compliance.  \n▪ Established Corporate ESD, DC power, signal loading / timing, thermal and FCC/VDE analysis test procedures.  \n▪ Single Board Computer BIOS development, testing and functional qualification. \n▪ Management of logic design evaluation teams to test / qualify computer platform logic and system designs in addition to the management of project schedules, staffing and funding requirements.  \n \nOS Experience Included: MS DOS, iNDX, iRMX and x86 Xenix. Programming Experience Included: Basic, ASMx86, PL/M, SIMULA, Pascal, C and CAD tools. Test equipment experience included: In-Circuit Emulators, logic analyzers, spectrum analyzers, oscilloscopes, thermal imagers, environmental test equipment …etc. Reliability, Availability and Serviceability Software Engineer Honeywell LISD September 1980  –  April 1982  (1 year 8 months) Phoenix, AZ Responsibilities: Simulation of new multi-user mainframe systems and sub-systems to determine system throughput performance, Reliability, Availability and Serviceability base lines.  \n \nSummary Accomplishments:  \n▪ Simulation of future mainframes to identify ways to maximize reliability, availability, serviceability and overall performance and the report out on findings and architectural recommendations. \n \nOS Experience Included: Multix and GCOS. Programming Experience Included; GPSS. Reliability, Availability and Serviceability Software Engineer Honeywell LISD September 1980  –  April 1982  (1 year 8 months) Phoenix, AZ Responsibilities: Simulation of new multi-user mainframe systems and sub-systems to determine system throughput performance, Reliability, Availability and Serviceability base lines.  \n \nSummary Accomplishments:  \n▪ Simulation of future mainframes to identify ways to maximize reliability, availability, serviceability and overall performance and the report out on findings and architectural recommendations. \n \nOS Experience Included: Multix and GCOS. Programming Experience Included; GPSS. Technician / Production Design Engineer Litton Industries (Currently Northrop Grumman Corp) March 1978  –  September 1980  (2 years 7 months) Tempe, AZ Responsibilities: Development of process control platforms used to control the manufacture of image intensifiers used in night vision devices. \n \nSummary Accomplishments:  \n▪ Successful development of industrial control platforms used to manufacture image intensifiers for night vision devices. \n▪ Design of high voltage power supplies, development of a manufacturing assembly and test line. \n \nOS Experience Included; MS DOS. Programming Experience Included; ASM80. Technician / Production Design Engineer Litton Industries (Currently Northrop Grumman Corp) March 1978  –  September 1980  (2 years 7 months) Tempe, AZ Responsibilities: Development of process control platforms used to control the manufacture of image intensifiers used in night vision devices. \n \nSummary Accomplishments:  \n▪ Successful development of industrial control platforms used to manufacture image intensifiers for night vision devices. \n▪ Design of high voltage power supplies, development of a manufacturing assembly and test line. \n \nOS Experience Included; MS DOS. Programming Experience Included; ASM80. Languages   Skills Integration Program Management Enterprise Software Systems Engineering Architecture Intel Management Debugging Simulations Semiconductors Embedded Systems Operating Systems Distributed Systems Product Management Cross-functional Team... Testing Cloud Computing Virtualization Unix Servers Linux Enterprise Architecture Software Engineering C Programming Computer Architecture Manufacturing High Availability System Architecture Product Development Analysis Firmware Architectures Software Development Perl Software Design Shell Scripting Storage TCP/IP Mobile Devices See 25+     See less Skills  Integration Program Management Enterprise Software Systems Engineering Architecture Intel Management Debugging Simulations Semiconductors Embedded Systems Operating Systems Distributed Systems Product Management Cross-functional Team... Testing Cloud Computing Virtualization Unix Servers Linux Enterprise Architecture Software Engineering C Programming Computer Architecture Manufacturing High Availability System Architecture Product Development Analysis Firmware Architectures Software Development Perl Software Design Shell Scripting Storage TCP/IP Mobile Devices See 25+     See less Integration Program Management Enterprise Software Systems Engineering Architecture Intel Management Debugging Simulations Semiconductors Embedded Systems Operating Systems Distributed Systems Product Management Cross-functional Team... Testing Cloud Computing Virtualization Unix Servers Linux Enterprise Architecture Software Engineering C Programming Computer Architecture Manufacturing High Availability System Architecture Product Development Analysis Firmware Architectures Software Development Perl Software Design Shell Scripting Storage TCP/IP Mobile Devices See 25+     See less Integration Program Management Enterprise Software Systems Engineering Architecture Intel Management Debugging Simulations Semiconductors Embedded Systems Operating Systems Distributed Systems Product Management Cross-functional Team... Testing Cloud Computing Virtualization Unix Servers Linux Enterprise Architecture Software Engineering C Programming Computer Architecture Manufacturing High Availability System Architecture Product Development Analysis Firmware Architectures Software Development Perl Software Design Shell Scripting Storage TCP/IP Mobile Devices See 25+     See less Education Northern Arizona University Bachelor of Science (BS),  Electrical Engineering Pima Community College Associate of Science (AS),  Electrical Engineering and Computer Science Northern Arizona University Bachelor of Science (BS),  Electrical Engineering Northern Arizona University Bachelor of Science (BS),  Electrical Engineering Northern Arizona University Bachelor of Science (BS),  Electrical Engineering Pima Community College Associate of Science (AS),  Electrical Engineering and Computer Science Pima Community College Associate of Science (AS),  Electrical Engineering and Computer Science Pima Community College Associate of Science (AS),  Electrical Engineering and Computer Science Honors & Awards ", "Skills System Architecture Embedded Systems Device Drivers Embedded Software WiFi Software Engineering Perl Ethernet Architecture Debugging Software Design TCP/IP IEEE 802.11 Integration Digital Signal... Multithreading Distributed Systems Wireless Firmware TCL RTOS SoC Embedded Linux See 8+     See less Skills  System Architecture Embedded Systems Device Drivers Embedded Software WiFi Software Engineering Perl Ethernet Architecture Debugging Software Design TCP/IP IEEE 802.11 Integration Digital Signal... Multithreading Distributed Systems Wireless Firmware TCL RTOS SoC Embedded Linux See 8+     See less System Architecture Embedded Systems Device Drivers Embedded Software WiFi Software Engineering Perl Ethernet Architecture Debugging Software Design TCP/IP IEEE 802.11 Integration Digital Signal... Multithreading Distributed Systems Wireless Firmware TCL RTOS SoC Embedded Linux See 8+     See less System Architecture Embedded Systems Device Drivers Embedded Software WiFi Software Engineering Perl Ethernet Architecture Debugging Software Design TCP/IP IEEE 802.11 Integration Digital Signal... Multithreading Distributed Systems Wireless Firmware TCL RTOS SoC Embedded Linux See 8+     See less ", "Summary Systems Engineer on communicaitons PHY achitecture and algorithm development for WiFi, WiMAX, Mobile TV; Expert on RF interference mitigation.  \n \nSpecialties: Wireless communications architecture, communication theory and signal processing. In-depth knowledge and experience with MIMO technologies, OFDM, OFDMA, channel coding, modulation. Familiar with various communication standards such as WLAN (802.11a/g/n), 3GPP (WCDMA/HSDPA), LTE, Mobile TV standards (DAB/T-DMB, DVB-T/H, and ATSC-MH), Bluetooth, WiMAX (802.16d/e). Expertise in computer simulation and modeling. Knowledge of media access control (MAC) protocols and RF systems. Familar with RF charactersitics analysis and calibration. Experienced in measuring and analyzing data, and lab debugging. Experienced in reducing platform RF noise. Experienced in wireless multimedia user experience KPI benchmarking. Summary Systems Engineer on communicaitons PHY achitecture and algorithm development for WiFi, WiMAX, Mobile TV; Expert on RF interference mitigation.  \n \nSpecialties: Wireless communications architecture, communication theory and signal processing. In-depth knowledge and experience with MIMO technologies, OFDM, OFDMA, channel coding, modulation. Familiar with various communication standards such as WLAN (802.11a/g/n), 3GPP (WCDMA/HSDPA), LTE, Mobile TV standards (DAB/T-DMB, DVB-T/H, and ATSC-MH), Bluetooth, WiMAX (802.16d/e). Expertise in computer simulation and modeling. Knowledge of media access control (MAC) protocols and RF systems. Familar with RF charactersitics analysis and calibration. Experienced in measuring and analyzing data, and lab debugging. Experienced in reducing platform RF noise. Experienced in wireless multimedia user experience KPI benchmarking. Systems Engineer on communicaitons PHY achitecture and algorithm development for WiFi, WiMAX, Mobile TV; Expert on RF interference mitigation.  \n \nSpecialties: Wireless communications architecture, communication theory and signal processing. In-depth knowledge and experience with MIMO technologies, OFDM, OFDMA, channel coding, modulation. Familiar with various communication standards such as WLAN (802.11a/g/n), 3GPP (WCDMA/HSDPA), LTE, Mobile TV standards (DAB/T-DMB, DVB-T/H, and ATSC-MH), Bluetooth, WiMAX (802.16d/e). Expertise in computer simulation and modeling. Knowledge of media access control (MAC) protocols and RF systems. Familar with RF charactersitics analysis and calibration. Experienced in measuring and analyzing data, and lab debugging. Experienced in reducing platform RF noise. Experienced in wireless multimedia user experience KPI benchmarking. Systems Engineer on communicaitons PHY achitecture and algorithm development for WiFi, WiMAX, Mobile TV; Expert on RF interference mitigation.  \n \nSpecialties: Wireless communications architecture, communication theory and signal processing. In-depth knowledge and experience with MIMO technologies, OFDM, OFDMA, channel coding, modulation. Familiar with various communication standards such as WLAN (802.11a/g/n), 3GPP (WCDMA/HSDPA), LTE, Mobile TV standards (DAB/T-DMB, DVB-T/H, and ATSC-MH), Bluetooth, WiMAX (802.16d/e). Expertise in computer simulation and modeling. Knowledge of media access control (MAC) protocols and RF systems. Familar with RF charactersitics analysis and calibration. Experienced in measuring and analyzing data, and lab debugging. Experienced in reducing platform RF noise. Experienced in wireless multimedia user experience KPI benchmarking. Experience Staff Systems Engineer Intel Corporation September 2004  – Present (11 years) Wireless (WiFi, Wireless Display, 3G, WiMAX, Mobile TV etc) for mobile laptop \nFocus on wireless communication architecture, PHY algorithm development, system performance evaluation/analysis/optimization/enhancement, new feature design/enabling, platform RF noise mitigation, enhancing multi-radio coexistence  \n \n1. WiFi(802.11 a/g/n): PHY algorithm development/simulation, firmware/driver implementation, verification/validation of implementation in the lab, modem diagnostics, system performance evaluation/analysis/optimization, WiFi/BT co-exstence, RF interference mitigation , laptop integration.  \n2. 3G: PHY layer simulation, RF interference mitigation, 3G/WiFi co-existence  \n3. WiMax(802.16 d/e): PHY layer simulation, RF interference mitigation, WiFi/WiMAX co-existence \n4. Mobile TV (DVB T/H, DAB/T-DMB and ATSC/ATSC-MH): PHY architecutre and algorithm development/simulation, performance evaluation/analysis, RF interference mitigation, laptop integration \n5. Wireless Display: system performance evaluation/analysis/optimization, new feature design/enabling, issue root-causing, benchmarking KPI for user experience enhancement Graduate Research Intern Intel Corporation April 2003  –  September 2003  (6 months) research work on high-throughput wireless LAN application (IEEE 802.11n) Staff Systems Engineer Intel Corporation September 2004  – Present (11 years) Wireless (WiFi, Wireless Display, 3G, WiMAX, Mobile TV etc) for mobile laptop \nFocus on wireless communication architecture, PHY algorithm development, system performance evaluation/analysis/optimization/enhancement, new feature design/enabling, platform RF noise mitigation, enhancing multi-radio coexistence  \n \n1. WiFi(802.11 a/g/n): PHY algorithm development/simulation, firmware/driver implementation, verification/validation of implementation in the lab, modem diagnostics, system performance evaluation/analysis/optimization, WiFi/BT co-exstence, RF interference mitigation , laptop integration.  \n2. 3G: PHY layer simulation, RF interference mitigation, 3G/WiFi co-existence  \n3. WiMax(802.16 d/e): PHY layer simulation, RF interference mitigation, WiFi/WiMAX co-existence \n4. Mobile TV (DVB T/H, DAB/T-DMB and ATSC/ATSC-MH): PHY architecutre and algorithm development/simulation, performance evaluation/analysis, RF interference mitigation, laptop integration \n5. Wireless Display: system performance evaluation/analysis/optimization, new feature design/enabling, issue root-causing, benchmarking KPI for user experience enhancement Staff Systems Engineer Intel Corporation September 2004  – Present (11 years) Wireless (WiFi, Wireless Display, 3G, WiMAX, Mobile TV etc) for mobile laptop \nFocus on wireless communication architecture, PHY algorithm development, system performance evaluation/analysis/optimization/enhancement, new feature design/enabling, platform RF noise mitigation, enhancing multi-radio coexistence  \n \n1. WiFi(802.11 a/g/n): PHY algorithm development/simulation, firmware/driver implementation, verification/validation of implementation in the lab, modem diagnostics, system performance evaluation/analysis/optimization, WiFi/BT co-exstence, RF interference mitigation , laptop integration.  \n2. 3G: PHY layer simulation, RF interference mitigation, 3G/WiFi co-existence  \n3. WiMax(802.16 d/e): PHY layer simulation, RF interference mitigation, WiFi/WiMAX co-existence \n4. Mobile TV (DVB T/H, DAB/T-DMB and ATSC/ATSC-MH): PHY architecutre and algorithm development/simulation, performance evaluation/analysis, RF interference mitigation, laptop integration \n5. Wireless Display: system performance evaluation/analysis/optimization, new feature design/enabling, issue root-causing, benchmarking KPI for user experience enhancement Graduate Research Intern Intel Corporation April 2003  –  September 2003  (6 months) research work on high-throughput wireless LAN application (IEEE 802.11n) Graduate Research Intern Intel Corporation April 2003  –  September 2003  (6 months) research work on high-throughput wireless LAN application (IEEE 802.11n) Languages Chinese Chinese Chinese Skills Digital Signal... OFDM MIMO WiMAX RF WiFi PHY Wireless 3GPP IEEE 802.11 Digital Signal... WLAN Baseband Mobile Devices Signal Processing SoC Device Drivers Firmware Debugging Bluetooth Algorithms See 6+     See less Skills  Digital Signal... OFDM MIMO WiMAX RF WiFi PHY Wireless 3GPP IEEE 802.11 Digital Signal... WLAN Baseband Mobile Devices Signal Processing SoC Device Drivers Firmware Debugging Bluetooth Algorithms See 6+     See less Digital Signal... OFDM MIMO WiMAX RF WiFi PHY Wireless 3GPP IEEE 802.11 Digital Signal... WLAN Baseband Mobile Devices Signal Processing SoC Device Drivers Firmware Debugging Bluetooth Algorithms See 6+     See less Digital Signal... OFDM MIMO WiMAX RF WiFi PHY Wireless 3GPP IEEE 802.11 Digital Signal... WLAN Baseband Mobile Devices Signal Processing SoC Device Drivers Firmware Debugging Bluetooth Algorithms See 6+     See less Education University of Washington PhD,  Electrical Engineering 2001  – 2004 MIMO OFDM code design University of Washington PhD,  Electrical Engineering 2001  – 2004 MIMO OFDM code design University of Washington PhD,  Electrical Engineering 2001  – 2004 MIMO OFDM code design University of Washington PhD,  Electrical Engineering 2001  – 2004 MIMO OFDM code design "]}