{"position": "Staff Technical Marketing Engineer", "company": "Intel Corporation", "profiles": ["Summary Jeff is a Technical Marketing Manager for Intel’s Internet of Things Group (IoTG), Retail Solutions Division (RSD). Jeff has been with Intel for 32 years, and his current responsibilities include product enabling and system solutions for the Intel® Core™ , Atom ™, and Quark™ Processors in embedded applications specific to the retail sector. His previous responsibilities included enabling support for the i960®, Intel386™, Intel486™, Pentium® Processor and Xeon® product families, and has a very borad knowledge of embedded applications. \n \nSpecialties: Embeded IA applications with focus on Intel® Core™ Processors \nEmbeded IA applications with focus on the Intel® Atom™ Processors \nSmall form factor designs including tablet form factors \nIndustrial Controll and Automation \nMachine Vision \nRobotics \nRetail applications including, Digital Signage, POS, KIOSK, ATM, and Intelligent Vending Summary Jeff is a Technical Marketing Manager for Intel’s Internet of Things Group (IoTG), Retail Solutions Division (RSD). Jeff has been with Intel for 32 years, and his current responsibilities include product enabling and system solutions for the Intel® Core™ , Atom ™, and Quark™ Processors in embedded applications specific to the retail sector. His previous responsibilities included enabling support for the i960®, Intel386™, Intel486™, Pentium® Processor and Xeon® product families, and has a very borad knowledge of embedded applications. \n \nSpecialties: Embeded IA applications with focus on Intel® Core™ Processors \nEmbeded IA applications with focus on the Intel® Atom™ Processors \nSmall form factor designs including tablet form factors \nIndustrial Controll and Automation \nMachine Vision \nRobotics \nRetail applications including, Digital Signage, POS, KIOSK, ATM, and Intelligent Vending Jeff is a Technical Marketing Manager for Intel’s Internet of Things Group (IoTG), Retail Solutions Division (RSD). Jeff has been with Intel for 32 years, and his current responsibilities include product enabling and system solutions for the Intel® Core™ , Atom ™, and Quark™ Processors in embedded applications specific to the retail sector. His previous responsibilities included enabling support for the i960®, Intel386™, Intel486™, Pentium® Processor and Xeon® product families, and has a very borad knowledge of embedded applications. \n \nSpecialties: Embeded IA applications with focus on Intel® Core™ Processors \nEmbeded IA applications with focus on the Intel® Atom™ Processors \nSmall form factor designs including tablet form factors \nIndustrial Controll and Automation \nMachine Vision \nRobotics \nRetail applications including, Digital Signage, POS, KIOSK, ATM, and Intelligent Vending Jeff is a Technical Marketing Manager for Intel’s Internet of Things Group (IoTG), Retail Solutions Division (RSD). Jeff has been with Intel for 32 years, and his current responsibilities include product enabling and system solutions for the Intel® Core™ , Atom ™, and Quark™ Processors in embedded applications specific to the retail sector. His previous responsibilities included enabling support for the i960®, Intel386™, Intel486™, Pentium® Processor and Xeon® product families, and has a very borad knowledge of embedded applications. \n \nSpecialties: Embeded IA applications with focus on Intel® Core™ Processors \nEmbeded IA applications with focus on the Intel® Atom™ Processors \nSmall form factor designs including tablet form factors \nIndustrial Controll and Automation \nMachine Vision \nRobotics \nRetail applications including, Digital Signage, POS, KIOSK, ATM, and Intelligent Vending Experience Technical Marketing Manager Intel Corporation April 2010  – Present (5 years 5 months) Technical Matketing Manager with Intels Low Power Products Division. Team is responsible for Atom Processor based embedded designs Staff Technical Marketing Engineer Intel Corporation April 2008  –  April 2010  (2 years 1 month) Technical Marketing Engineer supporting Atom based embedded designs, wit a focus on industrial control and automation Technical Marketing Manager Intel January 2005  –  January 2007  (2 years 1 month) Managed applications engineers for CPU support of Embedded IA. \nProducts ranged from Mobile CPU's to High performance Xeon Processors for embedded and telecomm market segments Technical Marketing Manager Intel Corporation April 2010  – Present (5 years 5 months) Technical Matketing Manager with Intels Low Power Products Division. Team is responsible for Atom Processor based embedded designs Technical Marketing Manager Intel Corporation April 2010  – Present (5 years 5 months) Technical Matketing Manager with Intels Low Power Products Division. Team is responsible for Atom Processor based embedded designs Staff Technical Marketing Engineer Intel Corporation April 2008  –  April 2010  (2 years 1 month) Technical Marketing Engineer supporting Atom based embedded designs, wit a focus on industrial control and automation Staff Technical Marketing Engineer Intel Corporation April 2008  –  April 2010  (2 years 1 month) Technical Marketing Engineer supporting Atom based embedded designs, wit a focus on industrial control and automation Technical Marketing Manager Intel January 2005  –  January 2007  (2 years 1 month) Managed applications engineers for CPU support of Embedded IA. \nProducts ranged from Mobile CPU's to High performance Xeon Processors for embedded and telecomm market segments Technical Marketing Manager Intel January 2005  –  January 2007  (2 years 1 month) Managed applications engineers for CPU support of Embedded IA. \nProducts ranged from Mobile CPU's to High performance Xeon Processors for embedded and telecomm market segments Skills Telecommunications Embedded Systems Embedded Software Intel Low-power Design Processors Cross-functional Team... Mobile Devices Automation Semiconductors Technical Marketing Product Marketing High Performance... Skills  Telecommunications Embedded Systems Embedded Software Intel Low-power Design Processors Cross-functional Team... Mobile Devices Automation Semiconductors Technical Marketing Product Marketing High Performance... Telecommunications Embedded Systems Embedded Software Intel Low-power Design Processors Cross-functional Team... Mobile Devices Automation Semiconductors Technical Marketing Product Marketing High Performance... Telecommunications Embedded Systems Embedded Software Intel Low-power Design Processors Cross-functional Team... Mobile Devices Automation Semiconductors Technical Marketing Product Marketing High Performance... ", "Languages Hindi Hindi Hindi Skills Technical Marketing Semiconductors SoC Go-to-market Strategy Processors Computer Architecture Intel Microprocessors Product Management Product Marketing Embedded Systems Product Planning Debugging Competitive Analysis Product Launch Mobile Devices See 1+     See less Skills  Technical Marketing Semiconductors SoC Go-to-market Strategy Processors Computer Architecture Intel Microprocessors Product Management Product Marketing Embedded Systems Product Planning Debugging Competitive Analysis Product Launch Mobile Devices See 1+     See less Technical Marketing Semiconductors SoC Go-to-market Strategy Processors Computer Architecture Intel Microprocessors Product Management Product Marketing Embedded Systems Product Planning Debugging Competitive Analysis Product Launch Mobile Devices See 1+     See less Technical Marketing Semiconductors SoC Go-to-market Strategy Processors Computer Architecture Intel Microprocessors Product Management Product Marketing Embedded Systems Product Planning Debugging Competitive Analysis Product Launch Mobile Devices See 1+     See less ", "Skills Ice Cream Restaurants Skills  Ice Cream Restaurants Ice Cream Restaurants Ice Cream Restaurants ", "Skills Enterprise Software Intel High Performance... Debugging Processors Computer Architecture Microprocessors Hardware Architecture Semiconductors System Architecture Hardware Simulations C X86 Parallel Computing Storage SoC Firmware Linux Shell Scripting Software Engineering Distributed Systems Algorithms Parallel Programming Semiconductor Industry Multithreading Bash Unix Data Center Linux Kernel See 15+     See less Skills  Enterprise Software Intel High Performance... Debugging Processors Computer Architecture Microprocessors Hardware Architecture Semiconductors System Architecture Hardware Simulations C X86 Parallel Computing Storage SoC Firmware Linux Shell Scripting Software Engineering Distributed Systems Algorithms Parallel Programming Semiconductor Industry Multithreading Bash Unix Data Center Linux Kernel See 15+     See less Enterprise Software Intel High Performance... Debugging Processors Computer Architecture Microprocessors Hardware Architecture Semiconductors System Architecture Hardware Simulations C X86 Parallel Computing Storage SoC Firmware Linux Shell Scripting Software Engineering Distributed Systems Algorithms Parallel Programming Semiconductor Industry Multithreading Bash Unix Data Center Linux Kernel See 15+     See less Enterprise Software Intel High Performance... Debugging Processors Computer Architecture Microprocessors Hardware Architecture Semiconductors System Architecture Hardware Simulations C X86 Parallel Computing Storage SoC Firmware Linux Shell Scripting Software Engineering Distributed Systems Algorithms Parallel Programming Semiconductor Industry Multithreading Bash Unix Data Center Linux Kernel See 15+     See less ", "Skills Technical Marketing Intel Processors Semiconductors SoC Embedded Systems Go-to-market Strategy Embedded Software ASIC Microprocessors Computer Architecture Analog IC Semiconductor Industry Hardware Architecture Verilog See 1+     See less Skills  Technical Marketing Intel Processors Semiconductors SoC Embedded Systems Go-to-market Strategy Embedded Software ASIC Microprocessors Computer Architecture Analog IC Semiconductor Industry Hardware Architecture Verilog See 1+     See less Technical Marketing Intel Processors Semiconductors SoC Embedded Systems Go-to-market Strategy Embedded Software ASIC Microprocessors Computer Architecture Analog IC Semiconductor Industry Hardware Architecture Verilog See 1+     See less Technical Marketing Intel Processors Semiconductors SoC Embedded Systems Go-to-market Strategy Embedded Software ASIC Microprocessors Computer Architecture Analog IC Semiconductor Industry Hardware Architecture Verilog See 1+     See less "]}