{"position": "Staff Physical Design Engineer", "company": "Intel Corporation", "profiles": ["Summary Much of my latest experience has been in the physical design part of IC design. This includes floorplanning, clock tree synthesis, and timing closer. I also has some experience with PrimeTime and Perl. I want to continue to develope this skills. Specialties:SOC First Encounter, PrimeTime, Magma, Perl, Verilog Summary Much of my latest experience has been in the physical design part of IC design. This includes floorplanning, clock tree synthesis, and timing closer. I also has some experience with PrimeTime and Perl. I want to continue to develope this skills. Specialties:SOC First Encounter, PrimeTime, Magma, Perl, Verilog Much of my latest experience has been in the physical design part of IC design. This includes floorplanning, clock tree synthesis, and timing closer. I also has some experience with PrimeTime and Perl. I want to continue to develope this skills. Specialties:SOC First Encounter, PrimeTime, Magma, Perl, Verilog Much of my latest experience has been in the physical design part of IC design. This includes floorplanning, clock tree synthesis, and timing closer. I also has some experience with PrimeTime and Perl. I want to continue to develope this skills. Specialties:SOC First Encounter, PrimeTime, Magma, Perl, Verilog Experience Physical Design Engineer - contractor Qualcomm June 2014  – Present (1 year 3 months) Raleigh-Durham, North Carolina Area Working or blocks for cores using 14nm technology. Physical Design Engineer - contractor AMD March 2014  –  June 2014  (4 months) Boxbourgh MA Worked with the DDR group again using 20nm technology. Physical Design Engineer - Contractor AMD May 2012  –  December 2013  (1 year 8 months) Boxbourgh, MA I am working in the DDR group building macro blocks. This is done using AMD's backend flow which uses many of the current industry standard backend tools. These macros are built in 28nm technology. Senior Design Engineer SMSC May 2006  –  January 2012  (5 years 9 months) Hauppauge NY Physical Design Engineer working on arc based super I/O chips for HP, Dell, and Asian companies. 8 projects were completed over a four year time span using SOC First Encounter. These projects were in 180nm and 130nm, 6 layer processes of TSMC, Grace, and Global. They ranged from 200K gates to 500K gates and the clock speeds ranged from 20MHz to 64MHz. Each of these parts had 2 power domains, numerous bus interfaces (LPC, I2C, PS2, etc.) and various IP including, a reset block, ADC, regulator, ring oscillator, and environmental monitoring unit, as well as smaller analog blocks. A flash memory was often included with ROMs and RAMs. Responsibilities included floorplanning, padring construction, power grid creation, clock tree synthesis, timing closer, routing, and physical verification (DRC, LVS, and ANT) using Calibre. Other activities included assisting with package bond out and ball out of these parts as well as manufacturing analysis. Some ECOs were performed. Power analysis was done on some standard cell libraries and various pad libraries were reviewed. \n \nDesign Engineer acting as liaison between design and layout teams. 4 projects were completed which had similar characteristics of previously finished designs. Responsibilities included guiding ICC users through floorplan, padring construction, power grid creation, clock tree synthesis, timing closer. Documentation was provided to layout team that explained special routing needs and the clock tree structure. Other activities included running PrimeTime and providing new constraints, as well as doing some verification using ncsim and Verdi schematic and wave form viewer. Began working with 65nm. Physical Design Engineer Agere Systems February 2005  –  April 2006  (1 year 3 months) Physical Design Engineer working on a number of hard disk drive SoCs. They included a read channel macro, an ARM core macro, a USB macro, and memories. The technology was 0.13 um with 6 or more layers of metal. Each design contained a number of power domains including 1.2V and 3.3V and each was in the 100K gate range. Responsibilities included floorplanning, power grid creation, clock tree synthesis, timing closer, routing, and physical verification (DRC and LVS). The Astro place and route tool was used along with the Calibre verification tools. Senior MTS Vitesse Semiconductor Corp February 2004  –  February 2005  (1 year 1 month) Senior MTS working on a number of backplane projects using TSMC's 0.13 micron process. Gate counts ranged from 1 million to 10 million gates. They included flip-chip and wire bond technologies. Each project used Vitesse's internal Magma/Calibre flow to do floorplanning, power grid creation, clock tree synthesis, timing closure, routing, physical verification, and ECOs for timing fixes. This included writing tcl scripts to run Magma. Responsibilities as senior place and route design engineer on-site, involved serving as mentor to a beginner in back-end design. Staff Physical Design Engineer Intel Corporation December 2000  –  February 2004  (3 years 3 months) Staff Physical Design Engineer working on a number of 10M/100M/1G Ethernet PHY projects using TSMC's 0.13 micron process. There was one PHY core macro block as well as a quad PHY chip and an octal PHY chip. Each project involved modifying Intel's internal Synopsys Apollo/Astro flow to do the physical design. The flow involved floorplanning, power grid creation, clock tree synthesis, timing closure, routing, physical verification (Hercules), and doing ECOs for design and timing fixes. This also involved working with the RTL team to make the Verilog code layout friendly. Another project involved working on a test chip for a self-testing custom DSP core. This was done in Intel's 0.09 micron flip-chip process. The flow was modified to correctly do the floorplan, power grid, clock trees, and timing closer. Another project involved running simulations for functional validation of the PHY core. Senior Component Design Engineer Intel Corporation February 1998  –  November 2000  (2 years 10 months) The Avanti's Planet floorplanning tool was used to do initial floorplan of a 66MHz 64-bit PCI bridge design. The clock tree flow for that design was developed. Developed Hercules LVS and DRC flows for the DB66 chip while working with the CAD group. Later ran those flows and helped others use them. The Avanti's Apollo and Milkyway tools were used on a number of library test cases for the DB66 project. Trial runs of the DB66 were run to determine the best placement for the chip's 7 memories. Timing fix ECOs were done before initial DB66 tapeout. \n \nStaff Hardware Design Engineer on the product migration team. Did initial design and simulation of a USB I/O pad and created the schematic, behavioral, and timing views. Also PathMill was used to do static timing checks on a PCI bridge chip. Design Engineer Mentor Graphics Corp June 1990  –  January 1998  (7 years 8 months) Design Engineer on a number of external customer's projects. Responsibilities included the floorplan and assembly of the top level of a mixed signal communications chip as well as its TMS320c50 soft core block for a small telecom company. Also the clock tree design and power distribution grid were developed. Acted as the project leader for the physical assembly of a Korean custom's graphics chip. Helped in the schedule development, ran weekly meetings, determined and supervised staff responsibilities, assisted customer's engineers and internal staff with datapath tool. Learned floorplanning and assembly tools, and used them on one block of the design. Was lead designer on re-design of Servo block of a disk control chip. Re-wrote the customer's behavioral model and verified the code by using the customer's environment. Developed datapath schematic and control block from customer's library. A technical contributor on single port ROM design, responsible for converting the design to the customer's technology. To meet the specification some design changes were made. \n \nCustomer Support Engineer responsible for support of GDT tools. Answered customer's questions, reported and tracked bugs, developed workarounds, and wrote applications notes. Design Engineer General Electric Co April 1989  –  May 1990  (1 year 2 months) Design Engineer responsible for the design and simulation of gate arrays. Was a member of the design team responsible for Data Memory Address Generator which was to be used in the BSY-2 Sonar System. This software programmable chip generated addresses for data handling during the beamforming process. Wrote Verilog models, captured schematics, and ran simulations. Project Engineer Standard Microsystems Corp August 1988  –  October 1988  (3 months) responsible for circuit design and simulation. Used SMC's standard cell library to design and simulate a receiver transmitter pair that would be used in a UART. VLSI Design Engineer Grumman Corp December 1985  –  July 1988  (2 years 8 months) responsible for a number of projects. Member of a team that redesigned a MIL-STD-1553 interface chip. The design was converted to CMOS gate array and new features were added. Responsible for spice simulation and layout of rad-hard gate array library. \n \nBoard Level Design Engineer responsible for the User Interface Board of the High Speed Data Bus Project. 6800 family ICs and 7400 TTL chips were used on the board that controlled the data transfer between the user's computer and the data bus port. 6800 assembly language code was written to control the handshaking between the user and the port. Design Engineer General Instrument Corp January 1982  –  December 1985  (4 years) Design Engineer responsible for taking EEPROM ICs from design specification through to production. This involved circuit design and SPICE simulation, supervision of chip layout, the design and construction of a bench testing board, micro probing and debugging of the design, and the development of a test plan from which a test engineer could write a test program. Projects included an odometer chip with EEPROM for battery backup, and 1K and 2K serial EEPROM memory chips Physical Design Engineer - contractor Qualcomm June 2014  – Present (1 year 3 months) Raleigh-Durham, North Carolina Area Working or blocks for cores using 14nm technology. Physical Design Engineer - contractor Qualcomm June 2014  – Present (1 year 3 months) Raleigh-Durham, North Carolina Area Working or blocks for cores using 14nm technology. Physical Design Engineer - contractor AMD March 2014  –  June 2014  (4 months) Boxbourgh MA Worked with the DDR group again using 20nm technology. Physical Design Engineer - contractor AMD March 2014  –  June 2014  (4 months) Boxbourgh MA Worked with the DDR group again using 20nm technology. Physical Design Engineer - Contractor AMD May 2012  –  December 2013  (1 year 8 months) Boxbourgh, MA I am working in the DDR group building macro blocks. This is done using AMD's backend flow which uses many of the current industry standard backend tools. These macros are built in 28nm technology. Physical Design Engineer - Contractor AMD May 2012  –  December 2013  (1 year 8 months) Boxbourgh, MA I am working in the DDR group building macro blocks. This is done using AMD's backend flow which uses many of the current industry standard backend tools. These macros are built in 28nm technology. Senior Design Engineer SMSC May 2006  –  January 2012  (5 years 9 months) Hauppauge NY Physical Design Engineer working on arc based super I/O chips for HP, Dell, and Asian companies. 8 projects were completed over a four year time span using SOC First Encounter. These projects were in 180nm and 130nm, 6 layer processes of TSMC, Grace, and Global. They ranged from 200K gates to 500K gates and the clock speeds ranged from 20MHz to 64MHz. Each of these parts had 2 power domains, numerous bus interfaces (LPC, I2C, PS2, etc.) and various IP including, a reset block, ADC, regulator, ring oscillator, and environmental monitoring unit, as well as smaller analog blocks. A flash memory was often included with ROMs and RAMs. Responsibilities included floorplanning, padring construction, power grid creation, clock tree synthesis, timing closer, routing, and physical verification (DRC, LVS, and ANT) using Calibre. Other activities included assisting with package bond out and ball out of these parts as well as manufacturing analysis. Some ECOs were performed. Power analysis was done on some standard cell libraries and various pad libraries were reviewed. \n \nDesign Engineer acting as liaison between design and layout teams. 4 projects were completed which had similar characteristics of previously finished designs. Responsibilities included guiding ICC users through floorplan, padring construction, power grid creation, clock tree synthesis, timing closer. Documentation was provided to layout team that explained special routing needs and the clock tree structure. Other activities included running PrimeTime and providing new constraints, as well as doing some verification using ncsim and Verdi schematic and wave form viewer. Began working with 65nm. Senior Design Engineer SMSC May 2006  –  January 2012  (5 years 9 months) Hauppauge NY Physical Design Engineer working on arc based super I/O chips for HP, Dell, and Asian companies. 8 projects were completed over a four year time span using SOC First Encounter. These projects were in 180nm and 130nm, 6 layer processes of TSMC, Grace, and Global. They ranged from 200K gates to 500K gates and the clock speeds ranged from 20MHz to 64MHz. Each of these parts had 2 power domains, numerous bus interfaces (LPC, I2C, PS2, etc.) and various IP including, a reset block, ADC, regulator, ring oscillator, and environmental monitoring unit, as well as smaller analog blocks. A flash memory was often included with ROMs and RAMs. Responsibilities included floorplanning, padring construction, power grid creation, clock tree synthesis, timing closer, routing, and physical verification (DRC, LVS, and ANT) using Calibre. Other activities included assisting with package bond out and ball out of these parts as well as manufacturing analysis. Some ECOs were performed. Power analysis was done on some standard cell libraries and various pad libraries were reviewed. \n \nDesign Engineer acting as liaison between design and layout teams. 4 projects were completed which had similar characteristics of previously finished designs. Responsibilities included guiding ICC users through floorplan, padring construction, power grid creation, clock tree synthesis, timing closer. Documentation was provided to layout team that explained special routing needs and the clock tree structure. Other activities included running PrimeTime and providing new constraints, as well as doing some verification using ncsim and Verdi schematic and wave form viewer. Began working with 65nm. Physical Design Engineer Agere Systems February 2005  –  April 2006  (1 year 3 months) Physical Design Engineer working on a number of hard disk drive SoCs. They included a read channel macro, an ARM core macro, a USB macro, and memories. The technology was 0.13 um with 6 or more layers of metal. Each design contained a number of power domains including 1.2V and 3.3V and each was in the 100K gate range. Responsibilities included floorplanning, power grid creation, clock tree synthesis, timing closer, routing, and physical verification (DRC and LVS). The Astro place and route tool was used along with the Calibre verification tools. Physical Design Engineer Agere Systems February 2005  –  April 2006  (1 year 3 months) Physical Design Engineer working on a number of hard disk drive SoCs. They included a read channel macro, an ARM core macro, a USB macro, and memories. The technology was 0.13 um with 6 or more layers of metal. Each design contained a number of power domains including 1.2V and 3.3V and each was in the 100K gate range. Responsibilities included floorplanning, power grid creation, clock tree synthesis, timing closer, routing, and physical verification (DRC and LVS). The Astro place and route tool was used along with the Calibre verification tools. Senior MTS Vitesse Semiconductor Corp February 2004  –  February 2005  (1 year 1 month) Senior MTS working on a number of backplane projects using TSMC's 0.13 micron process. Gate counts ranged from 1 million to 10 million gates. They included flip-chip and wire bond technologies. Each project used Vitesse's internal Magma/Calibre flow to do floorplanning, power grid creation, clock tree synthesis, timing closure, routing, physical verification, and ECOs for timing fixes. This included writing tcl scripts to run Magma. Responsibilities as senior place and route design engineer on-site, involved serving as mentor to a beginner in back-end design. Senior MTS Vitesse Semiconductor Corp February 2004  –  February 2005  (1 year 1 month) Senior MTS working on a number of backplane projects using TSMC's 0.13 micron process. Gate counts ranged from 1 million to 10 million gates. They included flip-chip and wire bond technologies. Each project used Vitesse's internal Magma/Calibre flow to do floorplanning, power grid creation, clock tree synthesis, timing closure, routing, physical verification, and ECOs for timing fixes. This included writing tcl scripts to run Magma. Responsibilities as senior place and route design engineer on-site, involved serving as mentor to a beginner in back-end design. Staff Physical Design Engineer Intel Corporation December 2000  –  February 2004  (3 years 3 months) Staff Physical Design Engineer working on a number of 10M/100M/1G Ethernet PHY projects using TSMC's 0.13 micron process. There was one PHY core macro block as well as a quad PHY chip and an octal PHY chip. Each project involved modifying Intel's internal Synopsys Apollo/Astro flow to do the physical design. The flow involved floorplanning, power grid creation, clock tree synthesis, timing closure, routing, physical verification (Hercules), and doing ECOs for design and timing fixes. This also involved working with the RTL team to make the Verilog code layout friendly. Another project involved working on a test chip for a self-testing custom DSP core. This was done in Intel's 0.09 micron flip-chip process. The flow was modified to correctly do the floorplan, power grid, clock trees, and timing closer. Another project involved running simulations for functional validation of the PHY core. Staff Physical Design Engineer Intel Corporation December 2000  –  February 2004  (3 years 3 months) Staff Physical Design Engineer working on a number of 10M/100M/1G Ethernet PHY projects using TSMC's 0.13 micron process. There was one PHY core macro block as well as a quad PHY chip and an octal PHY chip. Each project involved modifying Intel's internal Synopsys Apollo/Astro flow to do the physical design. The flow involved floorplanning, power grid creation, clock tree synthesis, timing closure, routing, physical verification (Hercules), and doing ECOs for design and timing fixes. This also involved working with the RTL team to make the Verilog code layout friendly. Another project involved working on a test chip for a self-testing custom DSP core. This was done in Intel's 0.09 micron flip-chip process. The flow was modified to correctly do the floorplan, power grid, clock trees, and timing closer. Another project involved running simulations for functional validation of the PHY core. Senior Component Design Engineer Intel Corporation February 1998  –  November 2000  (2 years 10 months) The Avanti's Planet floorplanning tool was used to do initial floorplan of a 66MHz 64-bit PCI bridge design. The clock tree flow for that design was developed. Developed Hercules LVS and DRC flows for the DB66 chip while working with the CAD group. Later ran those flows and helped others use them. The Avanti's Apollo and Milkyway tools were used on a number of library test cases for the DB66 project. Trial runs of the DB66 were run to determine the best placement for the chip's 7 memories. Timing fix ECOs were done before initial DB66 tapeout. \n \nStaff Hardware Design Engineer on the product migration team. Did initial design and simulation of a USB I/O pad and created the schematic, behavioral, and timing views. Also PathMill was used to do static timing checks on a PCI bridge chip. Senior Component Design Engineer Intel Corporation February 1998  –  November 2000  (2 years 10 months) The Avanti's Planet floorplanning tool was used to do initial floorplan of a 66MHz 64-bit PCI bridge design. The clock tree flow for that design was developed. Developed Hercules LVS and DRC flows for the DB66 chip while working with the CAD group. Later ran those flows and helped others use them. The Avanti's Apollo and Milkyway tools were used on a number of library test cases for the DB66 project. Trial runs of the DB66 were run to determine the best placement for the chip's 7 memories. Timing fix ECOs were done before initial DB66 tapeout. \n \nStaff Hardware Design Engineer on the product migration team. Did initial design and simulation of a USB I/O pad and created the schematic, behavioral, and timing views. Also PathMill was used to do static timing checks on a PCI bridge chip. Design Engineer Mentor Graphics Corp June 1990  –  January 1998  (7 years 8 months) Design Engineer on a number of external customer's projects. Responsibilities included the floorplan and assembly of the top level of a mixed signal communications chip as well as its TMS320c50 soft core block for a small telecom company. Also the clock tree design and power distribution grid were developed. Acted as the project leader for the physical assembly of a Korean custom's graphics chip. Helped in the schedule development, ran weekly meetings, determined and supervised staff responsibilities, assisted customer's engineers and internal staff with datapath tool. Learned floorplanning and assembly tools, and used them on one block of the design. Was lead designer on re-design of Servo block of a disk control chip. Re-wrote the customer's behavioral model and verified the code by using the customer's environment. Developed datapath schematic and control block from customer's library. A technical contributor on single port ROM design, responsible for converting the design to the customer's technology. To meet the specification some design changes were made. \n \nCustomer Support Engineer responsible for support of GDT tools. Answered customer's questions, reported and tracked bugs, developed workarounds, and wrote applications notes. Design Engineer Mentor Graphics Corp June 1990  –  January 1998  (7 years 8 months) Design Engineer on a number of external customer's projects. Responsibilities included the floorplan and assembly of the top level of a mixed signal communications chip as well as its TMS320c50 soft core block for a small telecom company. Also the clock tree design and power distribution grid were developed. Acted as the project leader for the physical assembly of a Korean custom's graphics chip. Helped in the schedule development, ran weekly meetings, determined and supervised staff responsibilities, assisted customer's engineers and internal staff with datapath tool. Learned floorplanning and assembly tools, and used them on one block of the design. Was lead designer on re-design of Servo block of a disk control chip. Re-wrote the customer's behavioral model and verified the code by using the customer's environment. Developed datapath schematic and control block from customer's library. A technical contributor on single port ROM design, responsible for converting the design to the customer's technology. To meet the specification some design changes were made. \n \nCustomer Support Engineer responsible for support of GDT tools. Answered customer's questions, reported and tracked bugs, developed workarounds, and wrote applications notes. Design Engineer General Electric Co April 1989  –  May 1990  (1 year 2 months) Design Engineer responsible for the design and simulation of gate arrays. Was a member of the design team responsible for Data Memory Address Generator which was to be used in the BSY-2 Sonar System. This software programmable chip generated addresses for data handling during the beamforming process. Wrote Verilog models, captured schematics, and ran simulations. Design Engineer General Electric Co April 1989  –  May 1990  (1 year 2 months) Design Engineer responsible for the design and simulation of gate arrays. Was a member of the design team responsible for Data Memory Address Generator which was to be used in the BSY-2 Sonar System. This software programmable chip generated addresses for data handling during the beamforming process. Wrote Verilog models, captured schematics, and ran simulations. Project Engineer Standard Microsystems Corp August 1988  –  October 1988  (3 months) responsible for circuit design and simulation. Used SMC's standard cell library to design and simulate a receiver transmitter pair that would be used in a UART. Project Engineer Standard Microsystems Corp August 1988  –  October 1988  (3 months) responsible for circuit design and simulation. Used SMC's standard cell library to design and simulate a receiver transmitter pair that would be used in a UART. VLSI Design Engineer Grumman Corp December 1985  –  July 1988  (2 years 8 months) responsible for a number of projects. Member of a team that redesigned a MIL-STD-1553 interface chip. The design was converted to CMOS gate array and new features were added. Responsible for spice simulation and layout of rad-hard gate array library. \n \nBoard Level Design Engineer responsible for the User Interface Board of the High Speed Data Bus Project. 6800 family ICs and 7400 TTL chips were used on the board that controlled the data transfer between the user's computer and the data bus port. 6800 assembly language code was written to control the handshaking between the user and the port. VLSI Design Engineer Grumman Corp December 1985  –  July 1988  (2 years 8 months) responsible for a number of projects. Member of a team that redesigned a MIL-STD-1553 interface chip. The design was converted to CMOS gate array and new features were added. Responsible for spice simulation and layout of rad-hard gate array library. \n \nBoard Level Design Engineer responsible for the User Interface Board of the High Speed Data Bus Project. 6800 family ICs and 7400 TTL chips were used on the board that controlled the data transfer between the user's computer and the data bus port. 6800 assembly language code was written to control the handshaking between the user and the port. Design Engineer General Instrument Corp January 1982  –  December 1985  (4 years) Design Engineer responsible for taking EEPROM ICs from design specification through to production. This involved circuit design and SPICE simulation, supervision of chip layout, the design and construction of a bench testing board, micro probing and debugging of the design, and the development of a test plan from which a test engineer could write a test program. Projects included an odometer chip with EEPROM for battery backup, and 1K and 2K serial EEPROM memory chips Design Engineer General Instrument Corp January 1982  –  December 1985  (4 years) Design Engineer responsible for taking EEPROM ICs from design specification through to production. This involved circuit design and SPICE simulation, supervision of chip layout, the design and construction of a bench testing board, micro probing and debugging of the design, and the development of a test plan from which a test engineer could write a test program. Projects included an odometer chip with EEPROM for battery backup, and 1K and 2K serial EEPROM memory chips Skills Verilog Primetime Perl Magma Physical Design Physical Verification Integrated Circuit... LVS SoC Floorplanning Timing Clock Tree Synthesis TCL VLSI Timing Closure ASIC See 1+     See less Skills  Verilog Primetime Perl Magma Physical Design Physical Verification Integrated Circuit... LVS SoC Floorplanning Timing Clock Tree Synthesis TCL VLSI Timing Closure ASIC See 1+     See less Verilog Primetime Perl Magma Physical Design Physical Verification Integrated Circuit... LVS SoC Floorplanning Timing Clock Tree Synthesis TCL VLSI Timing Closure ASIC See 1+     See less Verilog Primetime Perl Magma Physical Design Physical Verification Integrated Circuit... LVS SoC Floorplanning Timing Clock Tree Synthesis TCL VLSI Timing Closure ASIC See 1+     See less Education SUNY at Stony Brook B.E,  Electrical Engineering 1976  – 1980 Stony Brook University Bachelor of Engineering (BE),  Electrical and Electronics Engineering 1976  – 1980 SUNY at Stony Brook B.E,  Electrical Engineering 1976  – 1980 SUNY at Stony Brook B.E,  Electrical Engineering 1976  – 1980 SUNY at Stony Brook B.E,  Electrical Engineering 1976  – 1980 Stony Brook University Bachelor of Engineering (BE),  Electrical and Electronics Engineering 1976  – 1980 Stony Brook University Bachelor of Engineering (BE),  Electrical and Electronics Engineering 1976  – 1980 Stony Brook University Bachelor of Engineering (BE),  Electrical and Electronics Engineering 1976  – 1980 ", "Summary Summary \nASIC physical design expert in synthesis, place and route, clock tree synthesis and static timing analysis. Strong leadership experience leading geographically diverse teams for High Speed IO physical design activities on 14nm, 22nm and 32nm CMOS process. Twelve years of physical design experience with successful tape out of more than 13+ leading edge successful high volume products.  \n \nSpecialties \nSynthesis, Place and Route, Clock Tree Synthesis, UPF flows, deep submicron routing, Static Timing Analysis \n \nTools & languages Used \nDesign Compiler, IC Compiler, Primetime, Conformal, Tcl and Perl Summary Summary \nASIC physical design expert in synthesis, place and route, clock tree synthesis and static timing analysis. Strong leadership experience leading geographically diverse teams for High Speed IO physical design activities on 14nm, 22nm and 32nm CMOS process. Twelve years of physical design experience with successful tape out of more than 13+ leading edge successful high volume products.  \n \nSpecialties \nSynthesis, Place and Route, Clock Tree Synthesis, UPF flows, deep submicron routing, Static Timing Analysis \n \nTools & languages Used \nDesign Compiler, IC Compiler, Primetime, Conformal, Tcl and Perl Summary \nASIC physical design expert in synthesis, place and route, clock tree synthesis and static timing analysis. Strong leadership experience leading geographically diverse teams for High Speed IO physical design activities on 14nm, 22nm and 32nm CMOS process. Twelve years of physical design experience with successful tape out of more than 13+ leading edge successful high volume products.  \n \nSpecialties \nSynthesis, Place and Route, Clock Tree Synthesis, UPF flows, deep submicron routing, Static Timing Analysis \n \nTools & languages Used \nDesign Compiler, IC Compiler, Primetime, Conformal, Tcl and Perl Summary \nASIC physical design expert in synthesis, place and route, clock tree synthesis and static timing analysis. Strong leadership experience leading geographically diverse teams for High Speed IO physical design activities on 14nm, 22nm and 32nm CMOS process. Twelve years of physical design experience with successful tape out of more than 13+ leading edge successful high volume products.  \n \nSpecialties \nSynthesis, Place and Route, Clock Tree Synthesis, UPF flows, deep submicron routing, Static Timing Analysis \n \nTools & languages Used \nDesign Compiler, IC Compiler, Primetime, Conformal, Tcl and Perl Experience Staff ASIC Physical/Timing Design Engineer Hard IP Group, Intel Corporation October 2008  – Present (6 years 11 months) Folsom CA Driving physical design methodology and execution for High Speed Serial IO PHY (configurable as USB3/SATA3/PCI-E/GbE) for RTL to GDSII flow for various SoC projects within HIP team. Leading a team of geographically diverse engineers to support physical design activities for multiple SoC products.  \n•\tDrive RTL2GDSII methodology and execution on various leading edge processes (14nm, 22nm, 32nm and 45nm) for SoC projects. This involved tech readiness, backend methodology development and design execution for High speed IO PHYs involving synthesis, floorplanning, formal verification, P&R, clock tree synthesis, STA.  \n•\tLow power design with UPF based design methodology and flows. \n•\tDrive timing closure across all design blocks and generate full chip timing models for delivery to various integration teams within Intel. \n•\tInteract with customers for area optimization and floorplanning. Work closely with RTL team for development of constraints, UPF and power optimization. \n•\tDevelop milestone checklists for all aspects of design flows. \n•\tMentoring colleagues to build a strong and efficient team. Sr. Graphics Hardware Design Engineer Visual and Parallel Computing Group, Intel Corporation October 2006  –  September 2008  (2 years) Folsom CA Development of best available methods for synthesis using DC-topo, crosstalk aware routing flows in ICC for various (> 1M gates) blocks for all Sandybridge (32nm big core CPU) graphics skus. Conversion of datapath MCL (Module Compiler) codes into the compatible DC-Ultra code for area and performance optimization. Sr. Physical Design Engineer Chipset Group, Intel Corporation October 2000  –  September 2006  (6 years) Folsom, California •\tBackend design of Chipset high speed IO blocks involving logic synthesis, placement, clock tree synthesis, routing and power optimization. Developed various flows to achieve placement, CTgen, timing closure and better utilization on HSIO and chipset logic. Worked with layout engineers for partitioning and routing of top level critical signals. \n•\tDrove physical design activities for more than million gate dram controller block on 90nm process. Required very close co-ordination with RTL team for writing constraints and converging timing. Also worked with layout team for floorplanning, optimal pin placement and placement of embedded blocks. Staff ASIC Physical/Timing Design Engineer Hard IP Group, Intel Corporation October 2008  – Present (6 years 11 months) Folsom CA Driving physical design methodology and execution for High Speed Serial IO PHY (configurable as USB3/SATA3/PCI-E/GbE) for RTL to GDSII flow for various SoC projects within HIP team. Leading a team of geographically diverse engineers to support physical design activities for multiple SoC products.  \n•\tDrive RTL2GDSII methodology and execution on various leading edge processes (14nm, 22nm, 32nm and 45nm) for SoC projects. This involved tech readiness, backend methodology development and design execution for High speed IO PHYs involving synthesis, floorplanning, formal verification, P&R, clock tree synthesis, STA.  \n•\tLow power design with UPF based design methodology and flows. \n•\tDrive timing closure across all design blocks and generate full chip timing models for delivery to various integration teams within Intel. \n•\tInteract with customers for area optimization and floorplanning. Work closely with RTL team for development of constraints, UPF and power optimization. \n•\tDevelop milestone checklists for all aspects of design flows. \n•\tMentoring colleagues to build a strong and efficient team. Staff ASIC Physical/Timing Design Engineer Hard IP Group, Intel Corporation October 2008  – Present (6 years 11 months) Folsom CA Driving physical design methodology and execution for High Speed Serial IO PHY (configurable as USB3/SATA3/PCI-E/GbE) for RTL to GDSII flow for various SoC projects within HIP team. Leading a team of geographically diverse engineers to support physical design activities for multiple SoC products.  \n•\tDrive RTL2GDSII methodology and execution on various leading edge processes (14nm, 22nm, 32nm and 45nm) for SoC projects. This involved tech readiness, backend methodology development and design execution for High speed IO PHYs involving synthesis, floorplanning, formal verification, P&R, clock tree synthesis, STA.  \n•\tLow power design with UPF based design methodology and flows. \n•\tDrive timing closure across all design blocks and generate full chip timing models for delivery to various integration teams within Intel. \n•\tInteract with customers for area optimization and floorplanning. Work closely with RTL team for development of constraints, UPF and power optimization. \n•\tDevelop milestone checklists for all aspects of design flows. \n•\tMentoring colleagues to build a strong and efficient team. Sr. Graphics Hardware Design Engineer Visual and Parallel Computing Group, Intel Corporation October 2006  –  September 2008  (2 years) Folsom CA Development of best available methods for synthesis using DC-topo, crosstalk aware routing flows in ICC for various (> 1M gates) blocks for all Sandybridge (32nm big core CPU) graphics skus. Conversion of datapath MCL (Module Compiler) codes into the compatible DC-Ultra code for area and performance optimization. Sr. Graphics Hardware Design Engineer Visual and Parallel Computing Group, Intel Corporation October 2006  –  September 2008  (2 years) Folsom CA Development of best available methods for synthesis using DC-topo, crosstalk aware routing flows in ICC for various (> 1M gates) blocks for all Sandybridge (32nm big core CPU) graphics skus. Conversion of datapath MCL (Module Compiler) codes into the compatible DC-Ultra code for area and performance optimization. Sr. Physical Design Engineer Chipset Group, Intel Corporation October 2000  –  September 2006  (6 years) Folsom, California •\tBackend design of Chipset high speed IO blocks involving logic synthesis, placement, clock tree synthesis, routing and power optimization. Developed various flows to achieve placement, CTgen, timing closure and better utilization on HSIO and chipset logic. Worked with layout engineers for partitioning and routing of top level critical signals. \n•\tDrove physical design activities for more than million gate dram controller block on 90nm process. Required very close co-ordination with RTL team for writing constraints and converging timing. Also worked with layout team for floorplanning, optimal pin placement and placement of embedded blocks. Sr. Physical Design Engineer Chipset Group, Intel Corporation October 2000  –  September 2006  (6 years) Folsom, California •\tBackend design of Chipset high speed IO blocks involving logic synthesis, placement, clock tree synthesis, routing and power optimization. Developed various flows to achieve placement, CTgen, timing closure and better utilization on HSIO and chipset logic. Worked with layout engineers for partitioning and routing of top level critical signals. \n•\tDrove physical design activities for more than million gate dram controller block on 90nm process. Required very close co-ordination with RTL team for writing constraints and converging timing. Also worked with layout team for floorplanning, optimal pin placement and placement of embedded blocks. Skills IC Compiler Design Compiler Primetime VLSI Static Timing Analysis Perl Clock Tree Synthesis CTS SoC Verilog Compilers ASIC CMOS Computer Architecture Timing Closure Debugging Logic Synthesis Low-power Design TCL Physical Design See 5+     See less Skills  IC Compiler Design Compiler Primetime VLSI Static Timing Analysis Perl Clock Tree Synthesis CTS SoC Verilog Compilers ASIC CMOS Computer Architecture Timing Closure Debugging Logic Synthesis Low-power Design TCL Physical Design See 5+     See less IC Compiler Design Compiler Primetime VLSI Static Timing Analysis Perl Clock Tree Synthesis CTS SoC Verilog Compilers ASIC CMOS Computer Architecture Timing Closure Debugging Logic Synthesis Low-power Design TCL Physical Design See 5+     See less IC Compiler Design Compiler Primetime VLSI Static Timing Analysis Perl Clock Tree Synthesis CTS SoC Verilog Compilers ASIC CMOS Computer Architecture Timing Closure Debugging Logic Synthesis Low-power Design TCL Physical Design See 5+     See less Education California State University-Sacramento MS,  EEE 1999  – 2000 Maulana Azad National Institute of Technology 1994  – 1998 California State University-Sacramento MS,  EEE 1999  – 2000 California State University-Sacramento MS,  EEE 1999  – 2000 California State University-Sacramento MS,  EEE 1999  – 2000 Maulana Azad National Institute of Technology 1994  – 1998 Maulana Azad National Institute of Technology 1994  – 1998 Maulana Azad National Institute of Technology 1994  – 1998 ", "Experience Senior Staff Physical Design Engineer Intel Corporation 2003  – Present (12 years) Technical Layout Leader for Mobile Wireless Group RF Analog Layout Team for Oregon site. Senior Staff Mask Design Engineer Qualcomm Inc August 2001  –  December 2003  (2 years 5 months) Technical Leader for RF Analog Layout Group Senior Staff Physical Design Engineer Silicon Wave 1998  –  1999  (1 year) Senior Analog Mask Designer Danaher October 1994  –  June 1998  (3 years 9 months) CAD Applications Engineer Intel Corporation 1991  –  1994  (3 years) Senior Staff Physical Design Engineer Intel Corporation 2003  – Present (12 years) Technical Layout Leader for Mobile Wireless Group RF Analog Layout Team for Oregon site. Senior Staff Physical Design Engineer Intel Corporation 2003  – Present (12 years) Technical Layout Leader for Mobile Wireless Group RF Analog Layout Team for Oregon site. Senior Staff Mask Design Engineer Qualcomm Inc August 2001  –  December 2003  (2 years 5 months) Technical Leader for RF Analog Layout Group Senior Staff Mask Design Engineer Qualcomm Inc August 2001  –  December 2003  (2 years 5 months) Technical Leader for RF Analog Layout Group Senior Staff Physical Design Engineer Silicon Wave 1998  –  1999  (1 year) Senior Staff Physical Design Engineer Silicon Wave 1998  –  1999  (1 year) Senior Analog Mask Designer Danaher October 1994  –  June 1998  (3 years 9 months) Senior Analog Mask Designer Danaher October 1994  –  June 1998  (3 years 9 months) CAD Applications Engineer Intel Corporation 1991  –  1994  (3 years) CAD Applications Engineer Intel Corporation 1991  –  1994  (3 years) Education Pennsylvania State University 1978  – 1982 Pennsylvania State University 1978  – 1982 Pennsylvania State University 1978  – 1982 Pennsylvania State University 1978  – 1982 ", "Skills SoC Skills  SoC SoC SoC ", "Experience Staff Physical Design Engineer Intel Corporation November 2014  – Present (10 months) Staff Engineer LSI Corporation March 2013  –  November 2014  (1 year 9 months) Bangalore Project Manager Wipro Technologies January 2010  –  March 2013  (3 years 3 months) Cochin Area, India Leading a physical design team working on SoC implementation, DDR3 Phy hardening and 28 nm Testchip. ASIC Physical Design Engineer Brocade April 2010  –  December 2010  (9 months) Bangalore Physical Design of Network Routers for Brocade. \nUsed IBM tools like ChipBench and Einstimer \n \nPhysical Design of ASICs. Floorplanning , Placement, Routing , Timing Closure . Physical Verification Senior Physical Design Engineer LSI Corporation December 2003  –  March 2010  (6 years 4 months) Bangalore Extensive hands on experience on all aspects of Soc Physical design. Floorplanning Placement Routing STA Physical Verification . Number of tape outs on latest Technologies for Networking Asics. Design Engineer TATA Elxsi Ltd January 2001  –  December 2003  (3 years) Senior Design Engineer. \nPhysical Design Staff Physical Design Engineer Intel Corporation November 2014  – Present (10 months) Staff Physical Design Engineer Intel Corporation November 2014  – Present (10 months) Staff Engineer LSI Corporation March 2013  –  November 2014  (1 year 9 months) Bangalore Staff Engineer LSI Corporation March 2013  –  November 2014  (1 year 9 months) Bangalore Project Manager Wipro Technologies January 2010  –  March 2013  (3 years 3 months) Cochin Area, India Leading a physical design team working on SoC implementation, DDR3 Phy hardening and 28 nm Testchip. Project Manager Wipro Technologies January 2010  –  March 2013  (3 years 3 months) Cochin Area, India Leading a physical design team working on SoC implementation, DDR3 Phy hardening and 28 nm Testchip. ASIC Physical Design Engineer Brocade April 2010  –  December 2010  (9 months) Bangalore Physical Design of Network Routers for Brocade. \nUsed IBM tools like ChipBench and Einstimer \n \nPhysical Design of ASICs. Floorplanning , Placement, Routing , Timing Closure . Physical Verification ASIC Physical Design Engineer Brocade April 2010  –  December 2010  (9 months) Bangalore Physical Design of Network Routers for Brocade. \nUsed IBM tools like ChipBench and Einstimer \n \nPhysical Design of ASICs. Floorplanning , Placement, Routing , Timing Closure . Physical Verification Senior Physical Design Engineer LSI Corporation December 2003  –  March 2010  (6 years 4 months) Bangalore Extensive hands on experience on all aspects of Soc Physical design. Floorplanning Placement Routing STA Physical Verification . Number of tape outs on latest Technologies for Networking Asics. Senior Physical Design Engineer LSI Corporation December 2003  –  March 2010  (6 years 4 months) Bangalore Extensive hands on experience on all aspects of Soc Physical design. Floorplanning Placement Routing STA Physical Verification . Number of tape outs on latest Technologies for Networking Asics. Design Engineer TATA Elxsi Ltd January 2001  –  December 2003  (3 years) Senior Design Engineer. \nPhysical Design Design Engineer TATA Elxsi Ltd January 2001  –  December 2003  (3 years) Senior Design Engineer. \nPhysical Design Skills Solid hands on... Can handle tapeout of... Timing Closure expert. ASIC Timing Closure Physical Design Floorplanning Physical Verification Routing Static Timing Analysis SoC DDR3 TCL Verilog VLSI Functional Verification SystemVerilog See 2+     See less Skills  Solid hands on... Can handle tapeout of... Timing Closure expert. ASIC Timing Closure Physical Design Floorplanning Physical Verification Routing Static Timing Analysis SoC DDR3 TCL Verilog VLSI Functional Verification SystemVerilog See 2+     See less Solid hands on... Can handle tapeout of... Timing Closure expert. ASIC Timing Closure Physical Design Floorplanning Physical Verification Routing Static Timing Analysis SoC DDR3 TCL Verilog VLSI Functional Verification SystemVerilog See 2+     See less Solid hands on... Can handle tapeout of... Timing Closure expert. ASIC Timing Closure Physical Design Floorplanning Physical Verification Routing Static Timing Analysis SoC DDR3 TCL Verilog VLSI Functional Verification SystemVerilog See 2+     See less Education National Institute of Technology Calicut B tech,  Electronics and Telecommunication 1996  – 2000 U C College Aluva Pre Degree,  Mathematics 1994  – 1996 National Institute of Technology Calicut B tech,  Electronics and Telecommunication 1996  – 2000 National Institute of Technology Calicut B tech,  Electronics and Telecommunication 1996  – 2000 National Institute of Technology Calicut B tech,  Electronics and Telecommunication 1996  – 2000 U C College Aluva Pre Degree,  Mathematics 1994  – 1996 U C College Aluva Pre Degree,  Mathematics 1994  – 1996 U C College Aluva Pre Degree,  Mathematics 1994  – 1996 "]}