{"position": "Statistician", "company": "Stanford University", "profiles": ["Experience senior scientist - statistician Stanford University School of Medicine November 2005  – Present (9 years 10 months) Provide Statistical Consultations for spectrum.stanford.edu (the only way to get on my schedule, SUNetID required) Senior Statistician UCSF Cancer Center 1994  –  2005  (11 years) senior scientist - statistician Stanford University School of Medicine November 2005  – Present (9 years 10 months) Provide Statistical Consultations for spectrum.stanford.edu (the only way to get on my schedule, SUNetID required) senior scientist - statistician Stanford University School of Medicine November 2005  – Present (9 years 10 months) Provide Statistical Consultations for spectrum.stanford.edu (the only way to get on my schedule, SUNetID required) Senior Statistician UCSF Cancer Center 1994  –  2005  (11 years) Senior Statistician UCSF Cancer Center 1994  –  2005  (11 years) Languages French French French Skills Statistics Sample size and... clinical trials design Planning statistical... R SAS Programming Research Data Analysis Biostatistics SAS Statistical Modeling Science Data Mining Epidemiology Bioinformatics Clinical Trials Machine Learning See 2+     See less Skills  Statistics Sample size and... clinical trials design Planning statistical... R SAS Programming Research Data Analysis Biostatistics SAS Statistical Modeling Science Data Mining Epidemiology Bioinformatics Clinical Trials Machine Learning See 2+     See less Statistics Sample size and... clinical trials design Planning statistical... R SAS Programming Research Data Analysis Biostatistics SAS Statistical Modeling Science Data Mining Epidemiology Bioinformatics Clinical Trials Machine Learning See 2+     See less Statistics Sample size and... clinical trials design Planning statistical... R SAS Programming Research Data Analysis Biostatistics SAS Statistical Modeling Science Data Mining Epidemiology Bioinformatics Clinical Trials Machine Learning See 2+     See less Education McGill University Master's Degree,  Mathematics and Statistics Stanford University Doctor of Philosophy (Ph.D.),  Statistics McGill University Master's Degree,  Mathematics and Statistics McGill University Master's Degree,  Mathematics and Statistics McGill University Master's Degree,  Mathematics and Statistics Stanford University Doctor of Philosophy (Ph.D.),  Statistics Stanford University Doctor of Philosophy (Ph.D.),  Statistics Stanford University Doctor of Philosophy (Ph.D.),  Statistics ", "Experience Lead data scientist Jurispect June 2015  –  July 2015  (2 months) Researches and decides on optimal machine-learning strategies for analyzing and classifying legal documents; manages data team workflow. Data scientist Jurispect February 2015  –  June 2015  (5 months) Uses machine learning and NLP to analyze legal documents. Nadeau Lab Statistician Stanford University School of Medicine June 2013  –  August 2014  (1 year 3 months) Headed mathematical analysis and programming portion of medical trials. Trained other lab members in statistical techniques, presented mathematical results at conferences, wrote scientific papers. Data analysis intern Wildfire Interactive, Inc. February 2011  –  September 2011  (8 months) Developed statistical methods and wrote programs to analyze the viral behavior of online marketing campaigns. Presented findings to the analytics, sales, and marketing teams and made recommendations for increasing campaign effectiveness based on findings. Bioinformatics intern Stanford University January 2009  –  June 2009  (6 months) Tested the laboratory’s new RNA modeling software. Developed optimal program parameters for different potential uses of the software. Lead data scientist Jurispect June 2015  –  July 2015  (2 months) Researches and decides on optimal machine-learning strategies for analyzing and classifying legal documents; manages data team workflow. Lead data scientist Jurispect June 2015  –  July 2015  (2 months) Researches and decides on optimal machine-learning strategies for analyzing and classifying legal documents; manages data team workflow. Data scientist Jurispect February 2015  –  June 2015  (5 months) Uses machine learning and NLP to analyze legal documents. Data scientist Jurispect February 2015  –  June 2015  (5 months) Uses machine learning and NLP to analyze legal documents. Nadeau Lab Statistician Stanford University School of Medicine June 2013  –  August 2014  (1 year 3 months) Headed mathematical analysis and programming portion of medical trials. Trained other lab members in statistical techniques, presented mathematical results at conferences, wrote scientific papers. Nadeau Lab Statistician Stanford University School of Medicine June 2013  –  August 2014  (1 year 3 months) Headed mathematical analysis and programming portion of medical trials. Trained other lab members in statistical techniques, presented mathematical results at conferences, wrote scientific papers. Data analysis intern Wildfire Interactive, Inc. February 2011  –  September 2011  (8 months) Developed statistical methods and wrote programs to analyze the viral behavior of online marketing campaigns. Presented findings to the analytics, sales, and marketing teams and made recommendations for increasing campaign effectiveness based on findings. Data analysis intern Wildfire Interactive, Inc. February 2011  –  September 2011  (8 months) Developed statistical methods and wrote programs to analyze the viral behavior of online marketing campaigns. Presented findings to the analytics, sales, and marketing teams and made recommendations for increasing campaign effectiveness based on findings. Bioinformatics intern Stanford University January 2009  –  June 2009  (6 months) Tested the laboratory’s new RNA modeling software. Developed optimal program parameters for different potential uses of the software. Bioinformatics intern Stanford University January 2009  –  June 2009  (6 months) Tested the laboratory’s new RNA modeling software. Developed optimal program parameters for different potential uses of the software. Skills Social Media R Data Analysis Programming Machine Learning Research Statistics Skills  Social Media R Data Analysis Programming Machine Learning Research Statistics Social Media R Data Analysis Programming Machine Learning Research Statistics Social Media R Data Analysis Programming Machine Learning Research Statistics Education Stanford University Master of Science (M.S.),  Statistics 2012  – 2014 Stanford University Bachelor of Science (B.S.),  Mathematics 2007  – 2012 Activities and Societies:  Phi Beta Kappa Stanford University Master of Science (M.S.),  Statistics 2012  – 2014 Stanford University Master of Science (M.S.),  Statistics 2012  – 2014 Stanford University Master of Science (M.S.),  Statistics 2012  – 2014 Stanford University Bachelor of Science (B.S.),  Mathematics 2007  – 2012 Activities and Societies:  Phi Beta Kappa Stanford University Bachelor of Science (B.S.),  Mathematics 2007  – 2012 Activities and Societies:  Phi Beta Kappa Stanford University Bachelor of Science (B.S.),  Mathematics 2007  – 2012 Activities and Societies:  Phi Beta Kappa ", "Summary I design and develop data interfaces, and I've specialized in data visualization for over 9 years. \n \nFeel free to reach out to me if you're looking for help designing around data. \n \nI love to create tools that help people understand complex data. My favorite projects are those that help users see something in a novel way, and even better, when what they see helps them improve their lives. \n \nI'm a generalist, with experience in design, programming, and research. I seek out challenges that reach across different fields and require a healthy struggle to find a good solution. I strive to constantly learn new things and in turn teach others. \n \nI believe that understanding the user's needs is THE way to start designing any product. Summary I design and develop data interfaces, and I've specialized in data visualization for over 9 years. \n \nFeel free to reach out to me if you're looking for help designing around data. \n \nI love to create tools that help people understand complex data. My favorite projects are those that help users see something in a novel way, and even better, when what they see helps them improve their lives. \n \nI'm a generalist, with experience in design, programming, and research. I seek out challenges that reach across different fields and require a healthy struggle to find a good solution. I strive to constantly learn new things and in turn teach others. \n \nI believe that understanding the user's needs is THE way to start designing any product. I design and develop data interfaces, and I've specialized in data visualization for over 9 years. \n \nFeel free to reach out to me if you're looking for help designing around data. \n \nI love to create tools that help people understand complex data. My favorite projects are those that help users see something in a novel way, and even better, when what they see helps them improve their lives. \n \nI'm a generalist, with experience in design, programming, and research. I seek out challenges that reach across different fields and require a healthy struggle to find a good solution. I strive to constantly learn new things and in turn teach others. \n \nI believe that understanding the user's needs is THE way to start designing any product. I design and develop data interfaces, and I've specialized in data visualization for over 9 years. \n \nFeel free to reach out to me if you're looking for help designing around data. \n \nI love to create tools that help people understand complex data. My favorite projects are those that help users see something in a novel way, and even better, when what they see helps them improve their lives. \n \nI'm a generalist, with experience in design, programming, and research. I seek out challenges that reach across different fields and require a healthy struggle to find a good solution. I strive to constantly learn new things and in turn teach others. \n \nI believe that understanding the user's needs is THE way to start designing any product. Experience Data/UX Lead Vida Health, Inc. April 2015  – Present (5 months) San Francisco Bay Area Volunteer Exploratorium June 2015  – Present (3 months) San Francisco I help develop math exhibits for the museum. Data Visualization and Design Consultant Pudding Labs December 2012  – Present (2 years 9 months) San Francisco Bay Area Consulting with some of my favorite startups on their data representation challenges. Design, interaction, front-end development, data exploration/analytics, and story-telling. Advisor MOCAP Analytics September 2013  – Present (2 years) San Francisco Bay Area I advise MOCAP on data display and UX for their basketball analytics tools. We make tools for fans to understand the game better, and for players and managers to help them identify how best to improve and avoid injury. Exhibit Developer: Interactive Data Visualizations Exploratorium November 2014  –  May 2015  (7 months) San Francisco, California Creating interactive data visualizations of scientific datasets, designed to enable visitors to discover patterns within data and engage in meaningful self-directed explorations. Examples: San Francisco Bay ecology, climate patterns, migration patterns of sea predators, global plankton blooms over time, current and archived data from state-of-the-art scientific sensors (located on the museum’s rooftop and surrounding bay), other external scientific datasets and interrelated urban demographics. Senior Data Scientist Practice Fusion October 2013  –  October 2014  (1 year 1 month) San Francisco Bay Area Designed and built data-driven products to enable better patient care. These tools included: \n• patient-facing visualizations of personal health data \n• population management tools for doctors \n• interactive dashboards for pharmaceutical analysts and managers \n• internal company tools to visualize growth metrics Data Visualization Designer LinkedIn July 2010  –  August 2012  (2 years 2 months) Mountain View, CA At LinkedIn, I was involved in every project that involved data visualization. Some of my projects included: \n• Creating a visual brand for LinkedIn data, including building our data style guide (development platforms and design templates for the company) \n• Designing and implementing new data visualization modules for LinkedIn's 2012 Homepage and Profile redesign \n• Designing infographics for use on our blog and PR events \n• Data vis consulting with many different groups, from analytics to sales \n• Designing and prototyping interactive visualizations and infographics Collaborator, Tinkering School summer camp Tinkering Unlimited August 2010  –  July 2012  (2 years) Elkus Ranch, Half Moon Bay, CA \"Collaborator\" at Gever Tulley's Tinkering School, a sleepover summer camp where kids ages 8 to 17 learn to think big, embrace failure, and use power tools to build amazing contraptions. Last summer we built \"railboats\", wind-powered vehicles that run on train tracks. \n \nTake a look at our blog to learn more: \nhttp://tinkeringschool.wordpress.com/category/2012-session-2-seniors/ Senior Researcher, Data Visualization and Design Nokia Research Center December 2008  –  July 2010  (1 year 8 months) Visualization specialist for Data Insight team. I designed and implemented interactive, web-based visualization tools for analyzing large (multi-billion event) data sets. Research Assistant MIT Media Lab 2006  –  2008  (2 years) Masters student in Tod Machover's Hyperinstruments group. Projects involving music, electronics, and programming. For my Masters thesis, I made a music browser that organizes a music library into a map by analyzing its audio content: http://thesis.flyingpudding.com/ Senior Applications Software Developer Highwire Press 2003  –  2006  (3 years) Palo Alto, CA I put together and maintained several scientific journal sites. I did this by using Perl, XML, HighWire's homegrown templating language, and a dash of optimism. Statistician Stanford University November 2001  –  March 2003  (1 year 5 months) Principal data analyst for Cavalli-Sforza genetics lab. Wrote computer simulations of mutations spreading through migrating populations, made maps, co-authored papers. Simulation Software Engineer AuSIM, Inc. June 2001  –  October 2001  (5 months) Developed interactive, real-time 3D audio simulation with accompanying OpenGL graphics. Contract work for NASA, including: tracker-computer communication, unwarp filter, visualization tools (C, C++, MATLAB) \n \nResponsible for dealing with mathematical challenges of 3D sound simulation. Also represented company at SIGGRAPH graphics conference in Los Angeles. Data/UX Lead Vida Health, Inc. April 2015  – Present (5 months) San Francisco Bay Area Data/UX Lead Vida Health, Inc. April 2015  – Present (5 months) San Francisco Bay Area Volunteer Exploratorium June 2015  – Present (3 months) San Francisco I help develop math exhibits for the museum. Volunteer Exploratorium June 2015  – Present (3 months) San Francisco I help develop math exhibits for the museum. Data Visualization and Design Consultant Pudding Labs December 2012  – Present (2 years 9 months) San Francisco Bay Area Consulting with some of my favorite startups on their data representation challenges. Design, interaction, front-end development, data exploration/analytics, and story-telling. Data Visualization and Design Consultant Pudding Labs December 2012  – Present (2 years 9 months) San Francisco Bay Area Consulting with some of my favorite startups on their data representation challenges. Design, interaction, front-end development, data exploration/analytics, and story-telling. Advisor MOCAP Analytics September 2013  – Present (2 years) San Francisco Bay Area I advise MOCAP on data display and UX for their basketball analytics tools. We make tools for fans to understand the game better, and for players and managers to help them identify how best to improve and avoid injury. Advisor MOCAP Analytics September 2013  – Present (2 years) San Francisco Bay Area I advise MOCAP on data display and UX for their basketball analytics tools. We make tools for fans to understand the game better, and for players and managers to help them identify how best to improve and avoid injury. Exhibit Developer: Interactive Data Visualizations Exploratorium November 2014  –  May 2015  (7 months) San Francisco, California Creating interactive data visualizations of scientific datasets, designed to enable visitors to discover patterns within data and engage in meaningful self-directed explorations. Examples: San Francisco Bay ecology, climate patterns, migration patterns of sea predators, global plankton blooms over time, current and archived data from state-of-the-art scientific sensors (located on the museum’s rooftop and surrounding bay), other external scientific datasets and interrelated urban demographics. Exhibit Developer: Interactive Data Visualizations Exploratorium November 2014  –  May 2015  (7 months) San Francisco, California Creating interactive data visualizations of scientific datasets, designed to enable visitors to discover patterns within data and engage in meaningful self-directed explorations. Examples: San Francisco Bay ecology, climate patterns, migration patterns of sea predators, global plankton blooms over time, current and archived data from state-of-the-art scientific sensors (located on the museum’s rooftop and surrounding bay), other external scientific datasets and interrelated urban demographics. Senior Data Scientist Practice Fusion October 2013  –  October 2014  (1 year 1 month) San Francisco Bay Area Designed and built data-driven products to enable better patient care. These tools included: \n• patient-facing visualizations of personal health data \n• population management tools for doctors \n• interactive dashboards for pharmaceutical analysts and managers \n• internal company tools to visualize growth metrics Senior Data Scientist Practice Fusion October 2013  –  October 2014  (1 year 1 month) San Francisco Bay Area Designed and built data-driven products to enable better patient care. These tools included: \n• patient-facing visualizations of personal health data \n• population management tools for doctors \n• interactive dashboards for pharmaceutical analysts and managers \n• internal company tools to visualize growth metrics Data Visualization Designer LinkedIn July 2010  –  August 2012  (2 years 2 months) Mountain View, CA At LinkedIn, I was involved in every project that involved data visualization. Some of my projects included: \n• Creating a visual brand for LinkedIn data, including building our data style guide (development platforms and design templates for the company) \n• Designing and implementing new data visualization modules for LinkedIn's 2012 Homepage and Profile redesign \n• Designing infographics for use on our blog and PR events \n• Data vis consulting with many different groups, from analytics to sales \n• Designing and prototyping interactive visualizations and infographics Data Visualization Designer LinkedIn July 2010  –  August 2012  (2 years 2 months) Mountain View, CA At LinkedIn, I was involved in every project that involved data visualization. Some of my projects included: \n• Creating a visual brand for LinkedIn data, including building our data style guide (development platforms and design templates for the company) \n• Designing and implementing new data visualization modules for LinkedIn's 2012 Homepage and Profile redesign \n• Designing infographics for use on our blog and PR events \n• Data vis consulting with many different groups, from analytics to sales \n• Designing and prototyping interactive visualizations and infographics Collaborator, Tinkering School summer camp Tinkering Unlimited August 2010  –  July 2012  (2 years) Elkus Ranch, Half Moon Bay, CA \"Collaborator\" at Gever Tulley's Tinkering School, a sleepover summer camp where kids ages 8 to 17 learn to think big, embrace failure, and use power tools to build amazing contraptions. Last summer we built \"railboats\", wind-powered vehicles that run on train tracks. \n \nTake a look at our blog to learn more: \nhttp://tinkeringschool.wordpress.com/category/2012-session-2-seniors/ Collaborator, Tinkering School summer camp Tinkering Unlimited August 2010  –  July 2012  (2 years) Elkus Ranch, Half Moon Bay, CA \"Collaborator\" at Gever Tulley's Tinkering School, a sleepover summer camp where kids ages 8 to 17 learn to think big, embrace failure, and use power tools to build amazing contraptions. Last summer we built \"railboats\", wind-powered vehicles that run on train tracks. \n \nTake a look at our blog to learn more: \nhttp://tinkeringschool.wordpress.com/category/2012-session-2-seniors/ Senior Researcher, Data Visualization and Design Nokia Research Center December 2008  –  July 2010  (1 year 8 months) Visualization specialist for Data Insight team. I designed and implemented interactive, web-based visualization tools for analyzing large (multi-billion event) data sets. Senior Researcher, Data Visualization and Design Nokia Research Center December 2008  –  July 2010  (1 year 8 months) Visualization specialist for Data Insight team. I designed and implemented interactive, web-based visualization tools for analyzing large (multi-billion event) data sets. Research Assistant MIT Media Lab 2006  –  2008  (2 years) Masters student in Tod Machover's Hyperinstruments group. Projects involving music, electronics, and programming. For my Masters thesis, I made a music browser that organizes a music library into a map by analyzing its audio content: http://thesis.flyingpudding.com/ Research Assistant MIT Media Lab 2006  –  2008  (2 years) Masters student in Tod Machover's Hyperinstruments group. Projects involving music, electronics, and programming. For my Masters thesis, I made a music browser that organizes a music library into a map by analyzing its audio content: http://thesis.flyingpudding.com/ Senior Applications Software Developer Highwire Press 2003  –  2006  (3 years) Palo Alto, CA I put together and maintained several scientific journal sites. I did this by using Perl, XML, HighWire's homegrown templating language, and a dash of optimism. Senior Applications Software Developer Highwire Press 2003  –  2006  (3 years) Palo Alto, CA I put together and maintained several scientific journal sites. I did this by using Perl, XML, HighWire's homegrown templating language, and a dash of optimism. Statistician Stanford University November 2001  –  March 2003  (1 year 5 months) Principal data analyst for Cavalli-Sforza genetics lab. Wrote computer simulations of mutations spreading through migrating populations, made maps, co-authored papers. Statistician Stanford University November 2001  –  March 2003  (1 year 5 months) Principal data analyst for Cavalli-Sforza genetics lab. Wrote computer simulations of mutations spreading through migrating populations, made maps, co-authored papers. Simulation Software Engineer AuSIM, Inc. June 2001  –  October 2001  (5 months) Developed interactive, real-time 3D audio simulation with accompanying OpenGL graphics. Contract work for NASA, including: tracker-computer communication, unwarp filter, visualization tools (C, C++, MATLAB) \n \nResponsible for dealing with mathematical challenges of 3D sound simulation. Also represented company at SIGGRAPH graphics conference in Los Angeles. Simulation Software Engineer AuSIM, Inc. June 2001  –  October 2001  (5 months) Developed interactive, real-time 3D audio simulation with accompanying OpenGL graphics. Contract work for NASA, including: tracker-computer communication, unwarp filter, visualization tools (C, C++, MATLAB) \n \nResponsible for dealing with mathematical challenges of 3D sound simulation. Also represented company at SIGGRAPH graphics conference in Los Angeles. Languages   Skills Data Visualization Information... User Experience Information Graphics Java 3D visualization Processing Python Analytics SQL JavaScript Infographics Adobe Creative Suite Adobe Fireworks Big Data Machine Learning Illustrator ActionScript Perl Music Information... Rock Climbing Visualization Web Applications User Interface User Interface Design Data Mining Juggling Flex Human Computer... Web Analytics User-centered Design Ballistics Adobe Flex Builder Hadoop Tableau See 20+     See less Skills  Data Visualization Information... User Experience Information Graphics Java 3D visualization Processing Python Analytics SQL JavaScript Infographics Adobe Creative Suite Adobe Fireworks Big Data Machine Learning Illustrator ActionScript Perl Music Information... Rock Climbing Visualization Web Applications User Interface User Interface Design Data Mining Juggling Flex Human Computer... Web Analytics User-centered Design Ballistics Adobe Flex Builder Hadoop Tableau See 20+     See less Data Visualization Information... User Experience Information Graphics Java 3D visualization Processing Python Analytics SQL JavaScript Infographics Adobe Creative Suite Adobe Fireworks Big Data Machine Learning Illustrator ActionScript Perl Music Information... Rock Climbing Visualization Web Applications User Interface User Interface Design Data Mining Juggling Flex Human Computer... Web Analytics User-centered Design Ballistics Adobe Flex Builder Hadoop Tableau See 20+     See less Data Visualization Information... User Experience Information Graphics Java 3D visualization Processing Python Analytics SQL JavaScript Infographics Adobe Creative Suite Adobe Fireworks Big Data Machine Learning Illustrator ActionScript Perl Music Information... Rock Climbing Visualization Web Applications User Interface User Interface Design Data Mining Juggling Flex Human Computer... Web Analytics User-centered Design Ballistics Adobe Flex Builder Hadoop Tableau See 20+     See less Education Massachusetts Institute of Technology M.S.,  Media Lab 2006  – 2008 Masters student in Tod Machover's Hyperinstruments group at the Media Lab. Projects involved music, electronics, and programming. For my Masters thesis, I made a music browser that organizes a music library into a map by analyzing its audio content: http://thesis.flyingpudding.com/ Foothill College Geographic Information Science and Cartography 2002  – 2005 I took classes at Foothill in GIS and remote sensing in order to explore that career option and to get a better understanding of geographic data gathering and analysis. I also took years of Mandarin Chinese classes to keep that part of my brain healthy. Very interesting and fun. Stanford University B.S.,  Mathematical and Computational Science 1997  – 2001 MCS is like applied math: It's a combination of math, statistics, and computer science. Massachusetts Institute of Technology M.S.,  Media Lab 2006  – 2008 Masters student in Tod Machover's Hyperinstruments group at the Media Lab. Projects involved music, electronics, and programming. For my Masters thesis, I made a music browser that organizes a music library into a map by analyzing its audio content: http://thesis.flyingpudding.com/ Massachusetts Institute of Technology M.S.,  Media Lab 2006  – 2008 Masters student in Tod Machover's Hyperinstruments group at the Media Lab. Projects involved music, electronics, and programming. For my Masters thesis, I made a music browser that organizes a music library into a map by analyzing its audio content: http://thesis.flyingpudding.com/ Massachusetts Institute of Technology M.S.,  Media Lab 2006  – 2008 Masters student in Tod Machover's Hyperinstruments group at the Media Lab. Projects involved music, electronics, and programming. For my Masters thesis, I made a music browser that organizes a music library into a map by analyzing its audio content: http://thesis.flyingpudding.com/ Foothill College Geographic Information Science and Cartography 2002  – 2005 I took classes at Foothill in GIS and remote sensing in order to explore that career option and to get a better understanding of geographic data gathering and analysis. I also took years of Mandarin Chinese classes to keep that part of my brain healthy. Very interesting and fun. Foothill College Geographic Information Science and Cartography 2002  – 2005 I took classes at Foothill in GIS and remote sensing in order to explore that career option and to get a better understanding of geographic data gathering and analysis. I also took years of Mandarin Chinese classes to keep that part of my brain healthy. Very interesting and fun. Foothill College Geographic Information Science and Cartography 2002  – 2005 I took classes at Foothill in GIS and remote sensing in order to explore that career option and to get a better understanding of geographic data gathering and analysis. I also took years of Mandarin Chinese classes to keep that part of my brain healthy. Very interesting and fun. Stanford University B.S.,  Mathematical and Computational Science 1997  – 2001 MCS is like applied math: It's a combination of math, statistics, and computer science. Stanford University B.S.,  Mathematical and Computational Science 1997  – 2001 MCS is like applied math: It's a combination of math, statistics, and computer science. Stanford University B.S.,  Mathematical and Computational Science 1997  – 2001 MCS is like applied math: It's a combination of math, statistics, and computer science. Honors & Awards Additional Honors & Awards Strata Vizathlon data viz contest winner of Storylines category, 2011 (http://www.stratavizathlon.com/winners.html) Additional Honors & Awards Strata Vizathlon data viz contest winner of Storylines category, 2011 (http://www.stratavizathlon.com/winners.html) Additional Honors & Awards Strata Vizathlon data viz contest winner of Storylines category, 2011 (http://www.stratavizathlon.com/winners.html) Additional Honors & Awards Strata Vizathlon data viz contest winner of Storylines category, 2011 (http://www.stratavizathlon.com/winners.html) ", "Experience senior scientist - statistician Stanford University School of Medicine senior scientist - statistician Stanford University School of Medicine senior scientist - statistician Stanford University School of Medicine ", "Experience Senior Statistician Stanford University School of Medicine June 2015  – Present (3 months) Stanford, CA Reporting & Analytics Specialist LinkedIn April 2015  –  June 2015  (3 months) Sunnyvale, CA Statistician / Data Manager Stanford University School of Medicine March 2012  –  April 2015  (3 years 2 months) Stanford, CA Research Associate Ipsos February 2011  –  August 2011  (7 months) Parsippany, NJ Analytics Intern Boomerang Pharmaceutical Communications February 2010  –  November 2010  (10 months) New Jersey Math/Stats Tutor Western Michigan University August 2007  –  June 2009  (1 year 11 months) Kalamazoo, Michigan Area Senior Statistician Stanford University School of Medicine June 2015  – Present (3 months) Stanford, CA Senior Statistician Stanford University School of Medicine June 2015  – Present (3 months) Stanford, CA Reporting & Analytics Specialist LinkedIn April 2015  –  June 2015  (3 months) Sunnyvale, CA Reporting & Analytics Specialist LinkedIn April 2015  –  June 2015  (3 months) Sunnyvale, CA Statistician / Data Manager Stanford University School of Medicine March 2012  –  April 2015  (3 years 2 months) Stanford, CA Statistician / Data Manager Stanford University School of Medicine March 2012  –  April 2015  (3 years 2 months) Stanford, CA Research Associate Ipsos February 2011  –  August 2011  (7 months) Parsippany, NJ Research Associate Ipsos February 2011  –  August 2011  (7 months) Parsippany, NJ Analytics Intern Boomerang Pharmaceutical Communications February 2010  –  November 2010  (10 months) New Jersey Analytics Intern Boomerang Pharmaceutical Communications February 2010  –  November 2010  (10 months) New Jersey Math/Stats Tutor Western Michigan University August 2007  –  June 2009  (1 year 11 months) Kalamazoo, Michigan Area Math/Stats Tutor Western Michigan University August 2007  –  June 2009  (1 year 11 months) Kalamazoo, Michigan Area Languages   Skills Data Analysis R Statistics SAS Statistical Modeling Quantitative Research Stata Data Mining Time Series Analysis Analytics Databases Market Research Biostatistics Quantitative Analytics Access Python SQL Linear Regression Econometrics Survey Design Machine Learning Predictive Modeling Multivariate Statistics Web Analytics Excel A/B testing PowerPoint HTML Business Analysis Matlab GIS Public Health Microsoft Excel SAS programming Oracle E-Business Suite Oracle Database LaTeX Tableau Hive See 24+     See less Skills  Data Analysis R Statistics SAS Statistical Modeling Quantitative Research Stata Data Mining Time Series Analysis Analytics Databases Market Research Biostatistics Quantitative Analytics Access Python SQL Linear Regression Econometrics Survey Design Machine Learning Predictive Modeling Multivariate Statistics Web Analytics Excel A/B testing PowerPoint HTML Business Analysis Matlab GIS Public Health Microsoft Excel SAS programming Oracle E-Business Suite Oracle Database LaTeX Tableau Hive See 24+     See less Data Analysis R Statistics SAS Statistical Modeling Quantitative Research Stata Data Mining Time Series Analysis Analytics Databases Market Research Biostatistics Quantitative Analytics Access Python SQL Linear Regression Econometrics Survey Design Machine Learning Predictive Modeling Multivariate Statistics Web Analytics Excel A/B testing PowerPoint HTML Business Analysis Matlab GIS Public Health Microsoft Excel SAS programming Oracle E-Business Suite Oracle Database LaTeX Tableau Hive See 24+     See less Data Analysis R Statistics SAS Statistical Modeling Quantitative Research Stata Data Mining Time Series Analysis Analytics Databases Market Research Biostatistics Quantitative Analytics Access Python SQL Linear Regression Econometrics Survey Design Machine Learning Predictive Modeling Multivariate Statistics Web Analytics Excel A/B testing PowerPoint HTML Business Analysis Matlab GIS Public Health Microsoft Excel SAS programming Oracle E-Business Suite Oracle Database LaTeX Tableau Hive See 24+     See less Education Rutgers, The State University of New Jersey-New Brunswick Master's Degree,  Statistics 2009  – 2011 Western Michigan University Bachelor's Degree,  Statistics ,  History 2005  – 2009 Rutgers, The State University of New Jersey-New Brunswick Master's Degree,  Statistics 2009  – 2011 Rutgers, The State University of New Jersey-New Brunswick Master's Degree,  Statistics 2009  – 2011 Rutgers, The State University of New Jersey-New Brunswick Master's Degree,  Statistics 2009  – 2011 Western Michigan University Bachelor's Degree,  Statistics ,  History 2005  – 2009 Western Michigan University Bachelor's Degree,  Statistics ,  History 2005  – 2009 Western Michigan University Bachelor's Degree,  Statistics ,  History 2005  – 2009 Honors & Awards Department of Medicine Employee of the Month Department of Medicine of the Stanford University School of Medicine July 2013 ..must have outstanding performance and demonstrate consistent dedication, initiative, motivation, positive attitude, and customer service to those they support and with whom they interact. \nhttp://gmd.stanford.edu/news_events/pooja_loftus.html Department of Medicine Employee of the Month Department of Medicine of the Stanford University School of Medicine July 2013 ..must have outstanding performance and demonstrate consistent dedication, initiative, motivation, positive attitude, and customer service to those they support and with whom they interact. \nhttp://gmd.stanford.edu/news_events/pooja_loftus.html Department of Medicine Employee of the Month Department of Medicine of the Stanford University School of Medicine July 2013 ..must have outstanding performance and demonstrate consistent dedication, initiative, motivation, positive attitude, and customer service to those they support and with whom they interact. \nhttp://gmd.stanford.edu/news_events/pooja_loftus.html Department of Medicine Employee of the Month Department of Medicine of the Stanford University School of Medicine July 2013 ..must have outstanding performance and demonstrate consistent dedication, initiative, motivation, positive attitude, and customer service to those they support and with whom they interact. \nhttp://gmd.stanford.edu/news_events/pooja_loftus.html ", "Experience Owner FRI Solutions, Inc. Data Analyst Stanford University May 2010  – Present (5 years 4 months) Data analyst in the Neonatology, Department of Pediatrics. Systems Analyst/Statistician Stanford University October 1976  –  October 2001  (25 years 1 month) Departments of Neurology, Rheumatology and Health, Research and Policy Owner FRI Solutions, Inc. Owner FRI Solutions, Inc. Data Analyst Stanford University May 2010  – Present (5 years 4 months) Data analyst in the Neonatology, Department of Pediatrics. Data Analyst Stanford University May 2010  – Present (5 years 4 months) Data analyst in the Neonatology, Department of Pediatrics. Systems Analyst/Statistician Stanford University October 1976  –  October 2001  (25 years 1 month) Departments of Neurology, Rheumatology and Health, Research and Policy Systems Analyst/Statistician Stanford University October 1976  –  October 2001  (25 years 1 month) Departments of Neurology, Rheumatology and Health, Research and Policy Education Stanford University MS,  Statistics 1994  – 1995 Activities and Societies:  American Statistical Society Stanford University MS,  Statistics 1994  – 1995 Activities and Societies:  American Statistical Society Stanford University MS,  Statistics 1994  – 1995 Activities and Societies:  American Statistical Society Stanford University MS,  Statistics 1994  – 1995 Activities and Societies:  American Statistical Society ", "Summary Summary Qualifications: \n \n• 5 years' experience with R-programming \n• 5 years' experience in statistical modeling including linear and non-linear modeling \n• 4 years' experience in graphical data analysis and time series analysis \n• 4 years' experience in data visualization and data mining \n• 2 years' experience with SQL \n• 1 years' experience with accounting and auditing \n• Ability to plan and resource long-range projects while assuming responsibility for daily details with a high degree of accuracy \n \n \nSpecialties: \n \n• R-programming \n• SQL \n• Graphical Statistics (graphical data analysis / data visualization) \n• Machine Learning & Data Mining (regressions / SVM / clustering / classification / random forest) \n• Time series Analysis (filtering / modeling / forecasting) \n• Auditing Summary Summary Qualifications: \n \n• 5 years' experience with R-programming \n• 5 years' experience in statistical modeling including linear and non-linear modeling \n• 4 years' experience in graphical data analysis and time series analysis \n• 4 years' experience in data visualization and data mining \n• 2 years' experience with SQL \n• 1 years' experience with accounting and auditing \n• Ability to plan and resource long-range projects while assuming responsibility for daily details with a high degree of accuracy \n \n \nSpecialties: \n \n• R-programming \n• SQL \n• Graphical Statistics (graphical data analysis / data visualization) \n• Machine Learning & Data Mining (regressions / SVM / clustering / classification / random forest) \n• Time series Analysis (filtering / modeling / forecasting) \n• Auditing Summary Qualifications: \n \n• 5 years' experience with R-programming \n• 5 years' experience in statistical modeling including linear and non-linear modeling \n• 4 years' experience in graphical data analysis and time series analysis \n• 4 years' experience in data visualization and data mining \n• 2 years' experience with SQL \n• 1 years' experience with accounting and auditing \n• Ability to plan and resource long-range projects while assuming responsibility for daily details with a high degree of accuracy \n \n \nSpecialties: \n \n• R-programming \n• SQL \n• Graphical Statistics (graphical data analysis / data visualization) \n• Machine Learning & Data Mining (regressions / SVM / clustering / classification / random forest) \n• Time series Analysis (filtering / modeling / forecasting) \n• Auditing Summary Qualifications: \n \n• 5 years' experience with R-programming \n• 5 years' experience in statistical modeling including linear and non-linear modeling \n• 4 years' experience in graphical data analysis and time series analysis \n• 4 years' experience in data visualization and data mining \n• 2 years' experience with SQL \n• 1 years' experience with accounting and auditing \n• Ability to plan and resource long-range projects while assuming responsibility for daily details with a high degree of accuracy \n \n \nSpecialties: \n \n• R-programming \n• SQL \n• Graphical Statistics (graphical data analysis / data visualization) \n• Machine Learning & Data Mining (regressions / SVM / clustering / classification / random forest) \n• Time series Analysis (filtering / modeling / forecasting) \n• Auditing Experience Data Analyst Machine Zone, Inc. February 2015  – Present (7 months) Palo Alto, CA Data analysis for marketing and gaming performance. Developer HBI Solutions, Inc. September 2013  –  February 2015  (1 year 6 months) Palo Alto, CA • Researching on data analysis of large-scale healthcare information data. Data mining and modeling methods are frequently used. \n• Project: \n1. Encounter based Inpatient readmission. \n2. Encounter based ED readmission risk model. \n3. Patient based Inpatient admission. \n4. Patient based ED admission risk model. \n5. Patient based disease risk model. \n6. Patient based future cost model. \n7. Patient based mortality risk model. \n• Build SQL databases for modeling and presenting. \n• Developing methods of feature selection and feature number reduction. \n• Building predicting models for discrete and continuous outcomes. \nImproving the model performance and generate production code for users. \nRandom forest model and logistic regression model are mostly used. \n• Writing papers and reports for research and publication. Statistician Stanford University School of Medicine July 2013  –  February 2015  (1 year 8 months) Stanford, CA Medical data analysis, Data mining and Machine learning. Researching Assistant Iowa State University August 2011  –  June 2013  (1 year 11 months) Ames, Iowa, United States • Main: \nResearching on statistical graphical inference. \n• Experiment Design: \nDesigned the experiment for graphical inference using eye-tracker, processed the experiment and collected the data. \n• High-dimensional Data Analysis and Data Mining: \nDeveloped R code for data cleaning and variable selecting on eye-tracking data. Using PCA and SVM for clustering and classification. \n• Graphical Data Analysis: \nVisually and statistically investigated the time and visit effect for lineup reading. Tested the results using HMM model. Developed the R code for such kind of data analysis. \n• Writing: \nWriting the paper for eye-tracking data analysis on graphical inference. Teaching Assistant Iowa State University January 2011  –  May 2011  (5 months) Ames, Iowa, United States • Teaching Assistant for undergraduate intro stat course. Helping instructing undergraduate class, taught statistical concepts, statistical methods and programming (JMP), grading homework problems and exams. Audit Intern Deloitte June 2010  –  August 2010  (3 months) Shanghai, China • Summer audit intern in Deloitte for the finance team on the project with Agricultural Bank of China. Read all the financial reports in order to evaluate the financial status for the bank's customer companies. Did business analysis and marketing analysis based on the financial reports. Audit Intern PwC June 2007  –  August 2007  (3 months) Shanghai, China • Summer audit intern in PWC on the project with CMCC. Read all the financial reports in order to evaluate the financial status for the company. Did business analysis and marketing analysis based on the financial reports. Survey Intern Ipsos June 2006  –  August 2006  (3 months) Shanghai, China • Design and process the survey  \n• Collect data, transfer into database and analyze the data. \n• Experience of marketing surveying. Data Analyst Machine Zone, Inc. February 2015  – Present (7 months) Palo Alto, CA Data analysis for marketing and gaming performance. Data Analyst Machine Zone, Inc. February 2015  – Present (7 months) Palo Alto, CA Data analysis for marketing and gaming performance. Developer HBI Solutions, Inc. September 2013  –  February 2015  (1 year 6 months) Palo Alto, CA • Researching on data analysis of large-scale healthcare information data. Data mining and modeling methods are frequently used. \n• Project: \n1. Encounter based Inpatient readmission. \n2. Encounter based ED readmission risk model. \n3. Patient based Inpatient admission. \n4. Patient based ED admission risk model. \n5. Patient based disease risk model. \n6. Patient based future cost model. \n7. Patient based mortality risk model. \n• Build SQL databases for modeling and presenting. \n• Developing methods of feature selection and feature number reduction. \n• Building predicting models for discrete and continuous outcomes. \nImproving the model performance and generate production code for users. \nRandom forest model and logistic regression model are mostly used. \n• Writing papers and reports for research and publication. Developer HBI Solutions, Inc. September 2013  –  February 2015  (1 year 6 months) Palo Alto, CA • Researching on data analysis of large-scale healthcare information data. Data mining and modeling methods are frequently used. \n• Project: \n1. Encounter based Inpatient readmission. \n2. Encounter based ED readmission risk model. \n3. Patient based Inpatient admission. \n4. Patient based ED admission risk model. \n5. Patient based disease risk model. \n6. Patient based future cost model. \n7. Patient based mortality risk model. \n• Build SQL databases for modeling and presenting. \n• Developing methods of feature selection and feature number reduction. \n• Building predicting models for discrete and continuous outcomes. \nImproving the model performance and generate production code for users. \nRandom forest model and logistic regression model are mostly used. \n• Writing papers and reports for research and publication. Statistician Stanford University School of Medicine July 2013  –  February 2015  (1 year 8 months) Stanford, CA Medical data analysis, Data mining and Machine learning. Statistician Stanford University School of Medicine July 2013  –  February 2015  (1 year 8 months) Stanford, CA Medical data analysis, Data mining and Machine learning. Researching Assistant Iowa State University August 2011  –  June 2013  (1 year 11 months) Ames, Iowa, United States • Main: \nResearching on statistical graphical inference. \n• Experiment Design: \nDesigned the experiment for graphical inference using eye-tracker, processed the experiment and collected the data. \n• High-dimensional Data Analysis and Data Mining: \nDeveloped R code for data cleaning and variable selecting on eye-tracking data. Using PCA and SVM for clustering and classification. \n• Graphical Data Analysis: \nVisually and statistically investigated the time and visit effect for lineup reading. Tested the results using HMM model. Developed the R code for such kind of data analysis. \n• Writing: \nWriting the paper for eye-tracking data analysis on graphical inference. Researching Assistant Iowa State University August 2011  –  June 2013  (1 year 11 months) Ames, Iowa, United States • Main: \nResearching on statistical graphical inference. \n• Experiment Design: \nDesigned the experiment for graphical inference using eye-tracker, processed the experiment and collected the data. \n• High-dimensional Data Analysis and Data Mining: \nDeveloped R code for data cleaning and variable selecting on eye-tracking data. Using PCA and SVM for clustering and classification. \n• Graphical Data Analysis: \nVisually and statistically investigated the time and visit effect for lineup reading. Tested the results using HMM model. Developed the R code for such kind of data analysis. \n• Writing: \nWriting the paper for eye-tracking data analysis on graphical inference. Teaching Assistant Iowa State University January 2011  –  May 2011  (5 months) Ames, Iowa, United States • Teaching Assistant for undergraduate intro stat course. Helping instructing undergraduate class, taught statistical concepts, statistical methods and programming (JMP), grading homework problems and exams. Teaching Assistant Iowa State University January 2011  –  May 2011  (5 months) Ames, Iowa, United States • Teaching Assistant for undergraduate intro stat course. Helping instructing undergraduate class, taught statistical concepts, statistical methods and programming (JMP), grading homework problems and exams. Audit Intern Deloitte June 2010  –  August 2010  (3 months) Shanghai, China • Summer audit intern in Deloitte for the finance team on the project with Agricultural Bank of China. Read all the financial reports in order to evaluate the financial status for the bank's customer companies. Did business analysis and marketing analysis based on the financial reports. Audit Intern Deloitte June 2010  –  August 2010  (3 months) Shanghai, China • Summer audit intern in Deloitte for the finance team on the project with Agricultural Bank of China. Read all the financial reports in order to evaluate the financial status for the bank's customer companies. Did business analysis and marketing analysis based on the financial reports. Audit Intern PwC June 2007  –  August 2007  (3 months) Shanghai, China • Summer audit intern in PWC on the project with CMCC. Read all the financial reports in order to evaluate the financial status for the company. Did business analysis and marketing analysis based on the financial reports. Audit Intern PwC June 2007  –  August 2007  (3 months) Shanghai, China • Summer audit intern in PWC on the project with CMCC. Read all the financial reports in order to evaluate the financial status for the company. Did business analysis and marketing analysis based on the financial reports. Survey Intern Ipsos June 2006  –  August 2006  (3 months) Shanghai, China • Design and process the survey  \n• Collect data, transfer into database and analyze the data. \n• Experience of marketing surveying. Survey Intern Ipsos June 2006  –  August 2006  (3 months) Shanghai, China • Design and process the survey  \n• Collect data, transfer into database and analyze the data. \n• Experience of marketing surveying. Languages Chinese Native or bilingual proficiency English Full professional proficiency Japanese Limited working proficiency Chinese Native or bilingual proficiency English Full professional proficiency Japanese Limited working proficiency Chinese Native or bilingual proficiency English Full professional proficiency Japanese Limited working proficiency Native or bilingual proficiency Full professional proficiency Limited working proficiency Skills Accounting Auditing Financial Analysis Financial Modeling Economics Consulting Data Analysis Data Mining Data Modeling Graphical Models Time Series Analysis Forecasting Quality Control R SAS Microsoft Office Mechanical Engineering Industrial Engineering Linear Algebra Photography Travel Communication JMP See 8+     See less Skills  Accounting Auditing Financial Analysis Financial Modeling Economics Consulting Data Analysis Data Mining Data Modeling Graphical Models Time Series Analysis Forecasting Quality Control R SAS Microsoft Office Mechanical Engineering Industrial Engineering Linear Algebra Photography Travel Communication JMP See 8+     See less Accounting Auditing Financial Analysis Financial Modeling Economics Consulting Data Analysis Data Mining Data Modeling Graphical Models Time Series Analysis Forecasting Quality Control R SAS Microsoft Office Mechanical Engineering Industrial Engineering Linear Algebra Photography Travel Communication JMP See 8+     See less Accounting Auditing Financial Analysis Financial Modeling Economics Consulting Data Analysis Data Mining Data Modeling Graphical Models Time Series Analysis Forecasting Quality Control R SAS Microsoft Office Mechanical Engineering Industrial Engineering Linear Algebra Photography Travel Communication JMP See 8+     See less Education Iowa State University M.S.,  Statistics 2011  – 2012 Vice president of Chinese Student and Scholar Association. \nTA of intro stat course for engineering undergraduates. \nRA of graphical statistics research Activities and Societies:  CSSA Iowa State University Bachelor of Science (B.S.),  Statistics 2008  – 2010 Vice-President of the Chinese Students and Scholars Association  Activities and Societies:  Vice president of Chinese Student and Scholar Association. Shanghai University of Finance and Economics Associate,  Accounting 2004  – 2007 Activities and Societies:  Badminton Club ,  Survey Group Iowa State University M.S.,  Statistics 2011  – 2012 Vice president of Chinese Student and Scholar Association. \nTA of intro stat course for engineering undergraduates. \nRA of graphical statistics research Activities and Societies:  CSSA Iowa State University M.S.,  Statistics 2011  – 2012 Vice president of Chinese Student and Scholar Association. \nTA of intro stat course for engineering undergraduates. \nRA of graphical statistics research Activities and Societies:  CSSA Iowa State University M.S.,  Statistics 2011  – 2012 Vice president of Chinese Student and Scholar Association. \nTA of intro stat course for engineering undergraduates. \nRA of graphical statistics research Activities and Societies:  CSSA Iowa State University Bachelor of Science (B.S.),  Statistics 2008  – 2010 Vice-President of the Chinese Students and Scholars Association  Activities and Societies:  Vice president of Chinese Student and Scholar Association. Iowa State University Bachelor of Science (B.S.),  Statistics 2008  – 2010 Vice-President of the Chinese Students and Scholars Association  Activities and Societies:  Vice president of Chinese Student and Scholar Association. Iowa State University Bachelor of Science (B.S.),  Statistics 2008  – 2010 Vice-President of the Chinese Students and Scholars Association  Activities and Societies:  Vice president of Chinese Student and Scholar Association. Shanghai University of Finance and Economics Associate,  Accounting 2004  – 2007 Activities and Societies:  Badminton Club ,  Survey Group Shanghai University of Finance and Economics Associate,  Accounting 2004  – 2007 Activities and Societies:  Badminton Club ,  Survey Group Shanghai University of Finance and Economics Associate,  Accounting 2004  – 2007 Activities and Societies:  Badminton Club ,  Survey Group Honors & Awards ", "Experience Associate Biostatistician Intern Quintiles May 2012  – Present (3 years 4 months) Assistant Statistician Stanford University Medical Center June 2011  –  September 2011  (4 months) Discussion Leader/ Instructor GEMS Gateway to Exploring Mathematical Sciences January 2010  –  May 2010  (5 months) Statistician Intern Statplus May 2009  –  August 2009  (4 months) Associate Biostatistician Intern Quintiles May 2012  – Present (3 years 4 months) Associate Biostatistician Intern Quintiles May 2012  – Present (3 years 4 months) Assistant Statistician Stanford University Medical Center June 2011  –  September 2011  (4 months) Assistant Statistician Stanford University Medical Center June 2011  –  September 2011  (4 months) Discussion Leader/ Instructor GEMS Gateway to Exploring Mathematical Sciences January 2010  –  May 2010  (5 months) Discussion Leader/ Instructor GEMS Gateway to Exploring Mathematical Sciences January 2010  –  May 2010  (5 months) Statistician Intern Statplus May 2009  –  August 2009  (4 months) Statistician Intern Statplus May 2009  –  August 2009  (4 months) Languages Chinese Chinese Chinese Skills Biostatistics SAS SAS programming Statistical Modeling Clinical Trials Statistics Data Management Data Analysis R Skills  Biostatistics SAS SAS programming Statistical Modeling Clinical Trials Statistics Data Management Data Analysis R Biostatistics SAS SAS programming Statistical Modeling Clinical Trials Statistics Data Management Data Analysis R Biostatistics SAS SAS programming Statistical Modeling Clinical Trials Statistics Data Management Data Analysis R Education Duke University Master of Science (M.S.),  Biostatistics 2011  – 2013 Scripps College Bachelor of Arts (B.A.),  Mathematics 2007  – 2011 Duke University Master of Science (M.S.),  Biostatistics 2011  – 2013 Duke University Master of Science (M.S.),  Biostatistics 2011  – 2013 Duke University Master of Science (M.S.),  Biostatistics 2011  – 2013 Scripps College Bachelor of Arts (B.A.),  Mathematics 2007  – 2011 Scripps College Bachelor of Arts (B.A.),  Mathematics 2007  – 2011 Scripps College Bachelor of Arts (B.A.),  Mathematics 2007  – 2011 ", "Experience User Experience Researcher Google June 2015  – Present (3 months) User Experience Researcher Google June 2015  – Present (3 months) User Experience Researcher Google June 2015  – Present (3 months) Skills Data Mining Predictive Modeling SAS R Data Analysis Time Series Analysis Quantitative Analytics Machine Learning Predictive Analytics Statistics Logistic Regression Statistical Modeling Data Visualization Multivariate Statistics Cluster Analysis Analysis Microsoft Excel A/B testing Survival Analysis MySQL Big Data Analytics Product Analysis Consumer Behaviour Business Statistics Experimental Design Product Development Business Intelligence Business Strategy Data Modeling Social Media Psychology Growth Strategies Cognitive Psychology Survey Design Multivariate Analysis Factor Analysis Exploratory Data... MapReduce Psychometrics Applied Behavior... Behavioral Science See 27+     See less Skills  Data Mining Predictive Modeling SAS R Data Analysis Time Series Analysis Quantitative Analytics Machine Learning Predictive Analytics Statistics Logistic Regression Statistical Modeling Data Visualization Multivariate Statistics Cluster Analysis Analysis Microsoft Excel A/B testing Survival Analysis MySQL Big Data Analytics Product Analysis Consumer Behaviour Business Statistics Experimental Design Product Development Business Intelligence Business Strategy Data Modeling Social Media Psychology Growth Strategies Cognitive Psychology Survey Design Multivariate Analysis Factor Analysis Exploratory Data... MapReduce Psychometrics Applied Behavior... Behavioral Science See 27+     See less Data Mining Predictive Modeling SAS R Data Analysis Time Series Analysis Quantitative Analytics Machine Learning Predictive Analytics Statistics Logistic Regression Statistical Modeling Data Visualization Multivariate Statistics Cluster Analysis Analysis Microsoft Excel A/B testing Survival Analysis MySQL Big Data Analytics Product Analysis Consumer Behaviour Business Statistics Experimental Design Product Development Business Intelligence Business Strategy Data Modeling Social Media Psychology Growth Strategies Cognitive Psychology Survey Design Multivariate Analysis Factor Analysis Exploratory Data... MapReduce Psychometrics Applied Behavior... Behavioral Science See 27+     See less Data Mining Predictive Modeling SAS R Data Analysis Time Series Analysis Quantitative Analytics Machine Learning Predictive Analytics Statistics Logistic Regression Statistical Modeling Data Visualization Multivariate Statistics Cluster Analysis Analysis Microsoft Excel A/B testing Survival Analysis MySQL Big Data Analytics Product Analysis Consumer Behaviour Business Statistics Experimental Design Product Development Business Intelligence Business Strategy Data Modeling Social Media Psychology Growth Strategies Cognitive Psychology Survey Design Multivariate Analysis Factor Analysis Exploratory Data... MapReduce Psychometrics Applied Behavior... Behavioral Science See 27+     See less Education University of Pennsylvania PhD 2004  – 2009 University of Pennsylvania M.S. 2002  – 2004 Loyola University Maryland B.A. 1998  – 2002 University of Pennsylvania PhD 2004  – 2009 University of Pennsylvania PhD 2004  – 2009 University of Pennsylvania PhD 2004  – 2009 University of Pennsylvania M.S. 2002  – 2004 University of Pennsylvania M.S. 2002  – 2004 University of Pennsylvania M.S. 2002  – 2004 Loyola University Maryland B.A. 1998  – 2002 Loyola University Maryland B.A. 1998  – 2002 Loyola University Maryland B.A. 1998  – 2002 ", "Summary Note to recruiters: Please do not ask for referrals. \n \nExperienced data analyst and R and SAS programmer. Seeking engaging projects and opportunities to learn. Especially interested in decision/risk analysis, stem cell biology, and applications of Bayesian statistics. \n \n•\tExtensive R and SAS programming experience.  \n•\tSound knowledge of theoretical and applied statistics, data visualization, and interpretation of results.  \n•\tAble to translate scientific questions into statistical models and provide answers by applying appropriate methods, checking analysis assumptions, and assessing quality of results.  \n•\tInitiative and ability to self-educate and stay up-to-date with statistics theory and practice. \n•\tProven ability to work with limited supervision and as part of an interdependent team.  \n•\tStrong written and oral communication skills. \n•\tExperience in consulting roles.  \n•\tHighly organized and attentive to details. Summary Note to recruiters: Please do not ask for referrals. \n \nExperienced data analyst and R and SAS programmer. Seeking engaging projects and opportunities to learn. Especially interested in decision/risk analysis, stem cell biology, and applications of Bayesian statistics. \n \n•\tExtensive R and SAS programming experience.  \n•\tSound knowledge of theoretical and applied statistics, data visualization, and interpretation of results.  \n•\tAble to translate scientific questions into statistical models and provide answers by applying appropriate methods, checking analysis assumptions, and assessing quality of results.  \n•\tInitiative and ability to self-educate and stay up-to-date with statistics theory and practice. \n•\tProven ability to work with limited supervision and as part of an interdependent team.  \n•\tStrong written and oral communication skills. \n•\tExperience in consulting roles.  \n•\tHighly organized and attentive to details. Note to recruiters: Please do not ask for referrals. \n \nExperienced data analyst and R and SAS programmer. Seeking engaging projects and opportunities to learn. Especially interested in decision/risk analysis, stem cell biology, and applications of Bayesian statistics. \n \n•\tExtensive R and SAS programming experience.  \n•\tSound knowledge of theoretical and applied statistics, data visualization, and interpretation of results.  \n•\tAble to translate scientific questions into statistical models and provide answers by applying appropriate methods, checking analysis assumptions, and assessing quality of results.  \n•\tInitiative and ability to self-educate and stay up-to-date with statistics theory and practice. \n•\tProven ability to work with limited supervision and as part of an interdependent team.  \n•\tStrong written and oral communication skills. \n•\tExperience in consulting roles.  \n•\tHighly organized and attentive to details. Note to recruiters: Please do not ask for referrals. \n \nExperienced data analyst and R and SAS programmer. Seeking engaging projects and opportunities to learn. Especially interested in decision/risk analysis, stem cell biology, and applications of Bayesian statistics. \n \n•\tExtensive R and SAS programming experience.  \n•\tSound knowledge of theoretical and applied statistics, data visualization, and interpretation of results.  \n•\tAble to translate scientific questions into statistical models and provide answers by applying appropriate methods, checking analysis assumptions, and assessing quality of results.  \n•\tInitiative and ability to self-educate and stay up-to-date with statistics theory and practice. \n•\tProven ability to work with limited supervision and as part of an interdependent team.  \n•\tStrong written and oral communication skills. \n•\tExperience in consulting roles.  \n•\tHighly organized and attentive to details. Experience Statistician Stanford University School of Medicine October 2012  – Present (2 years 11 months) Surgery Department I serve as the data analysis resource for the faculty and resident surgeons in the department. Project areas include effectiveness of surgical diagnostic imaging devices, teaching methods for training medical residents, associations between hospital and surgeon procedure volumes with clinical outcomes, and associations between nurse-to-patient ratios and adverse events. Several projects have been presented at conferences, and more abstracts and manuscripts are in progress. Many projects use large national- and state-level Healthcare Cost and Utilization Project (HCUP) data sets.  \n \nI perform analyses in both R and SAS, using SQL to merge and manipulate data. I write reusable functions and macros for data manipulation, model building, and results table formatting. I create clearly written and illustrated reports of analyses and results for non-technical collaborators, and produce statistical analysis and results sections, tables, and figures for abstracts, posters, journal articles. I provide power vs. sample size curves for study planning, and I contribute statistical content to grant proposals. Biostatistician/Bioinformatician Aviir, Inc. September 2010  –  December 2011  (1 year 4 months) My contributions included planning and implementing data analyses for biochemical assay calibration/quality control and large-cohort clinical model validation. I was very productive in building extendable, reusable R codebases for our projects. I cleaned, modularized, and substantially extended previously written code. For a newly added source of lab data, I built from scratch a data cleaning and processing pipeline that included format standardization, data entry error checks, outlier detection, measurement calibration, and process diagnostic graphs. In doing so, I accomodated frequently changing input formats, and implemented custom quality control and calibration procedures that I helped plan, evaluate, and revise.  \n \nI communicated regularly, clearly, and efficiently with my colleagues to coordinate our efforts and answer their questions about our statistical results, and I regularly prepared and gave presentations to the entire R&D team during weekly update meetings. I also contributed to statistical methods sections for operating procedures and technical reports. I continue to consult for Aviir often. Statistician Stanford University School of Medicine October 2012  – Present (2 years 11 months) Surgery Department I serve as the data analysis resource for the faculty and resident surgeons in the department. Project areas include effectiveness of surgical diagnostic imaging devices, teaching methods for training medical residents, associations between hospital and surgeon procedure volumes with clinical outcomes, and associations between nurse-to-patient ratios and adverse events. Several projects have been presented at conferences, and more abstracts and manuscripts are in progress. Many projects use large national- and state-level Healthcare Cost and Utilization Project (HCUP) data sets.  \n \nI perform analyses in both R and SAS, using SQL to merge and manipulate data. I write reusable functions and macros for data manipulation, model building, and results table formatting. I create clearly written and illustrated reports of analyses and results for non-technical collaborators, and produce statistical analysis and results sections, tables, and figures for abstracts, posters, journal articles. I provide power vs. sample size curves for study planning, and I contribute statistical content to grant proposals. Statistician Stanford University School of Medicine October 2012  – Present (2 years 11 months) Surgery Department I serve as the data analysis resource for the faculty and resident surgeons in the department. Project areas include effectiveness of surgical diagnostic imaging devices, teaching methods for training medical residents, associations between hospital and surgeon procedure volumes with clinical outcomes, and associations between nurse-to-patient ratios and adverse events. Several projects have been presented at conferences, and more abstracts and manuscripts are in progress. Many projects use large national- and state-level Healthcare Cost and Utilization Project (HCUP) data sets.  \n \nI perform analyses in both R and SAS, using SQL to merge and manipulate data. I write reusable functions and macros for data manipulation, model building, and results table formatting. I create clearly written and illustrated reports of analyses and results for non-technical collaborators, and produce statistical analysis and results sections, tables, and figures for abstracts, posters, journal articles. I provide power vs. sample size curves for study planning, and I contribute statistical content to grant proposals. Biostatistician/Bioinformatician Aviir, Inc. September 2010  –  December 2011  (1 year 4 months) My contributions included planning and implementing data analyses for biochemical assay calibration/quality control and large-cohort clinical model validation. I was very productive in building extendable, reusable R codebases for our projects. I cleaned, modularized, and substantially extended previously written code. For a newly added source of lab data, I built from scratch a data cleaning and processing pipeline that included format standardization, data entry error checks, outlier detection, measurement calibration, and process diagnostic graphs. In doing so, I accomodated frequently changing input formats, and implemented custom quality control and calibration procedures that I helped plan, evaluate, and revise.  \n \nI communicated regularly, clearly, and efficiently with my colleagues to coordinate our efforts and answer their questions about our statistical results, and I regularly prepared and gave presentations to the entire R&D team during weekly update meetings. I also contributed to statistical methods sections for operating procedures and technical reports. I continue to consult for Aviir often. Biostatistician/Bioinformatician Aviir, Inc. September 2010  –  December 2011  (1 year 4 months) My contributions included planning and implementing data analyses for biochemical assay calibration/quality control and large-cohort clinical model validation. I was very productive in building extendable, reusable R codebases for our projects. I cleaned, modularized, and substantially extended previously written code. For a newly added source of lab data, I built from scratch a data cleaning and processing pipeline that included format standardization, data entry error checks, outlier detection, measurement calibration, and process diagnostic graphs. In doing so, I accomodated frequently changing input formats, and implemented custom quality control and calibration procedures that I helped plan, evaluate, and revise.  \n \nI communicated regularly, clearly, and efficiently with my colleagues to coordinate our efforts and answer their questions about our statistical results, and I regularly prepared and gave presentations to the entire R&D team during weekly update meetings. I also contributed to statistical methods sections for operating procedures and technical reports. I continue to consult for Aviir often. Skills R Statistics Biostatistics Statistical Modeling Data Analysis SAS SAS programming Survival Analysis Statistical Consulting Clinical Study Design Bayesian statistics Statistical Programming Logistic Regression Mathematical Logic Decision Analysis Nonparametric statistics Bayesian methods Missing-data problems Python Matlab C C++ Java Perl Regular Expressions SQL Unix Git SVN Versioning LaTeX MS Office Suite Biotechnology TreeAge Statistical Computing Multivariate Analysis Markov Decision... REDCap See 23+     See less Skills  R Statistics Biostatistics Statistical Modeling Data Analysis SAS SAS programming Survival Analysis Statistical Consulting Clinical Study Design Bayesian statistics Statistical Programming Logistic Regression Mathematical Logic Decision Analysis Nonparametric statistics Bayesian methods Missing-data problems Python Matlab C C++ Java Perl Regular Expressions SQL Unix Git SVN Versioning LaTeX MS Office Suite Biotechnology TreeAge Statistical Computing Multivariate Analysis Markov Decision... REDCap See 23+     See less R Statistics Biostatistics Statistical Modeling Data Analysis SAS SAS programming Survival Analysis Statistical Consulting Clinical Study Design Bayesian statistics Statistical Programming Logistic Regression Mathematical Logic Decision Analysis Nonparametric statistics Bayesian methods Missing-data problems Python Matlab C C++ Java Perl Regular Expressions SQL Unix Git SVN Versioning LaTeX MS Office Suite Biotechnology TreeAge Statistical Computing Multivariate Analysis Markov Decision... REDCap See 23+     See less R Statistics Biostatistics Statistical Modeling Data Analysis SAS SAS programming Survival Analysis Statistical Consulting Clinical Study Design Bayesian statistics Statistical Programming Logistic Regression Mathematical Logic Decision Analysis Nonparametric statistics Bayesian methods Missing-data problems Python Matlab C C++ Java Perl Regular Expressions SQL Unix Git SVN Versioning LaTeX MS Office Suite Biotechnology TreeAge Statistical Computing Multivariate Analysis Markov Decision... REDCap See 23+     See less Education Stanford University M.S.,  Statistics , 3.9 GPA 2009  – 2010 Areas of study: computational biology, biostatistics, multivariate analysis, permutation tests, bootstrap, model selection, regression and ANOVA, survival analysis, classification, time series, scan statistics, data mining, data computing paradigms, EM, HMMs, Monte Carlo, Bayesian inference, probability, stochastic processes, mathematical statistics, statistical consulting. Activities and Societies:  Statistics Department Consulting Service Stanford University B.S.,  Symbolic Systems: Neuroscience concentration , 3.8 GPA, Phi Beta Kappa 2005  – 2009 Areas of study: general biology, organic chemistry, linear algebra/matrix theory, vector calculus, differential equations, real analysis, discrete math, meta-logic, artificial intelligence, neural nets, cognitive psychology. Activities and Societies:  Phi Beta Kappa ,  Wing Chun ,  Phi Kappa Psi ,  LSJUMB ,  Stanford Jazz Orchestra. Maria Carrillo High School 2001  – 2005 Activities and Societies:  Speech and Debate ,  Jazz Orchestra. Stanford University M.S.,  Statistics , 3.9 GPA 2009  – 2010 Areas of study: computational biology, biostatistics, multivariate analysis, permutation tests, bootstrap, model selection, regression and ANOVA, survival analysis, classification, time series, scan statistics, data mining, data computing paradigms, EM, HMMs, Monte Carlo, Bayesian inference, probability, stochastic processes, mathematical statistics, statistical consulting. Activities and Societies:  Statistics Department Consulting Service Stanford University M.S.,  Statistics , 3.9 GPA 2009  – 2010 Areas of study: computational biology, biostatistics, multivariate analysis, permutation tests, bootstrap, model selection, regression and ANOVA, survival analysis, classification, time series, scan statistics, data mining, data computing paradigms, EM, HMMs, Monte Carlo, Bayesian inference, probability, stochastic processes, mathematical statistics, statistical consulting. Activities and Societies:  Statistics Department Consulting Service Stanford University M.S.,  Statistics , 3.9 GPA 2009  – 2010 Areas of study: computational biology, biostatistics, multivariate analysis, permutation tests, bootstrap, model selection, regression and ANOVA, survival analysis, classification, time series, scan statistics, data mining, data computing paradigms, EM, HMMs, Monte Carlo, Bayesian inference, probability, stochastic processes, mathematical statistics, statistical consulting. Activities and Societies:  Statistics Department Consulting Service Stanford University B.S.,  Symbolic Systems: Neuroscience concentration , 3.8 GPA, Phi Beta Kappa 2005  – 2009 Areas of study: general biology, organic chemistry, linear algebra/matrix theory, vector calculus, differential equations, real analysis, discrete math, meta-logic, artificial intelligence, neural nets, cognitive psychology. Activities and Societies:  Phi Beta Kappa ,  Wing Chun ,  Phi Kappa Psi ,  LSJUMB ,  Stanford Jazz Orchestra. Stanford University B.S.,  Symbolic Systems: Neuroscience concentration , 3.8 GPA, Phi Beta Kappa 2005  – 2009 Areas of study: general biology, organic chemistry, linear algebra/matrix theory, vector calculus, differential equations, real analysis, discrete math, meta-logic, artificial intelligence, neural nets, cognitive psychology. Activities and Societies:  Phi Beta Kappa ,  Wing Chun ,  Phi Kappa Psi ,  LSJUMB ,  Stanford Jazz Orchestra. Stanford University B.S.,  Symbolic Systems: Neuroscience concentration , 3.8 GPA, Phi Beta Kappa 2005  – 2009 Areas of study: general biology, organic chemistry, linear algebra/matrix theory, vector calculus, differential equations, real analysis, discrete math, meta-logic, artificial intelligence, neural nets, cognitive psychology. Activities and Societies:  Phi Beta Kappa ,  Wing Chun ,  Phi Kappa Psi ,  LSJUMB ,  Stanford Jazz Orchestra. Maria Carrillo High School 2001  – 2005 Activities and Societies:  Speech and Debate ,  Jazz Orchestra. Maria Carrillo High School 2001  – 2005 Activities and Societies:  Speech and Debate ,  Jazz Orchestra. Maria Carrillo High School 2001  – 2005 Activities and Societies:  Speech and Debate ,  Jazz Orchestra. Honors & Awards Member Phi Beta Kappa June 2011 California State Co-Champion, Public Forum Debate National Forensics League May 2005 Member Phi Beta Kappa June 2011 Member Phi Beta Kappa June 2011 Member Phi Beta Kappa June 2011 California State Co-Champion, Public Forum Debate National Forensics League May 2005 California State Co-Champion, Public Forum Debate National Forensics League May 2005 California State Co-Champion, Public Forum Debate National Forensics League May 2005 ", "Summary I combine an engineer's affinity for order and efficiency with an info nerd's desire to squeeze juicy meaning from the obscuring pulp of tree-ripened data. I am comfortable with questionable metaphors. I care about people and want to make the a world better place. I have a broad interest in pulling data together, extracting meaning from it and communicating that meaning to audiences with diverse levels of expertise. I prefer creating answers with utility rather than answers of convenience and strive to make my work relevant to the real world. Summary I combine an engineer's affinity for order and efficiency with an info nerd's desire to squeeze juicy meaning from the obscuring pulp of tree-ripened data. I am comfortable with questionable metaphors. I care about people and want to make the a world better place. I have a broad interest in pulling data together, extracting meaning from it and communicating that meaning to audiences with diverse levels of expertise. I prefer creating answers with utility rather than answers of convenience and strive to make my work relevant to the real world. I combine an engineer's affinity for order and efficiency with an info nerd's desire to squeeze juicy meaning from the obscuring pulp of tree-ripened data. I am comfortable with questionable metaphors. I care about people and want to make the a world better place. I have a broad interest in pulling data together, extracting meaning from it and communicating that meaning to audiences with diverse levels of expertise. I prefer creating answers with utility rather than answers of convenience and strive to make my work relevant to the real world. I combine an engineer's affinity for order and efficiency with an info nerd's desire to squeeze juicy meaning from the obscuring pulp of tree-ripened data. I am comfortable with questionable metaphors. I care about people and want to make the a world better place. I have a broad interest in pulling data together, extracting meaning from it and communicating that meaning to audiences with diverse levels of expertise. I prefer creating answers with utility rather than answers of convenience and strive to make my work relevant to the real world. Experience Biostatistician Stanford University School of Medicine May 2012  – Present (3 years 4 months) Palo Alto, CA I help design simulation and clinical research projects in addition to managing and analyzing data. My code is primarily in R, SQL, SAS, Ruby or Python. I also develop tools to make my work easier and more efficient.  Tinkerer Large August 2010  – Present (5 years 1 month) Compiled and analyzed bicycle count data from the City of Minneapolis' Greenway in conjunction with NOAA climatological data with R and SAS using generalized linear models \n \nWrote a parametric epidemic simulation in R and developed time-lapse epidemic spread visualization scheme Quantitative Analyst Intern Galliard Capital Management May 2011  –  May 2012  (1 year 1 month) Greater Minneapolis-St. Paul Area I utilized a smorgasbord of tools, including Bloomberg, Yieldbook, SQL, Ruby, Excel and R to provide useful analytical solutions and answer occasionally complex questions about bonds and portfolios of bonds. Graduate Teaching/Research Assistant University of Minnesota School of Public Health August 2010  –  May 2012  (1 year 10 months) Twin Cities Campus Held regular office hours, graded homework, gave the occasional lecture \n \nAnalyzed BOLD data set to determine predictors of various post-surgical outcomes.  \n \nHelped debug Bayesian logistic regression program in Stata \n \nUsed MCMC methods for Bayesian logistic regression to evaluate Stata program Research Assistant Center for Energy and Environment May 2009  –  August 2010  (1 year 4 months) Center for Energy and Environment \n· Helped design and carry out experiment to determine particulate emission rates associated with common household combustion activities \n· Helped design and carry out experiment to determine accuracy and precision of monitoring equipment \n· Oversaw installation and maintenance of field monitoring equipment \n· Compiled and analyzed eclectic datasets relating local particulate levels, local VOC levels, regional particulate levels and meteorological data \n· Developed data validation scheme for multimillion point domestic hot water usage data set \n· Created meaningful, clear and concise visual representations of both raw data and analysis results \n· Conducted literature searches to further inform current research methodologies Mechanical Engineering Senior Design Student University of Minnesota Institute of Technology January 2009  –  May 2009  (5 months) Mortuary Science Program to develop refractory injection device for use in the reduction of cremation-sourced mercury emissions \n· Named as inventor on provisional patent for refractory injection device \n· Devised and carried out multiple experiments to quantify refractory material properties and suitability \n· Adapted existing heat transfer models to provide insight into dental conditions during the cremation process \n· Conducted literature search on atmospheric mercury and human exposure  \nDomestic Solar Energy System Design, January 2009 to May 2009 \n· Participated in semester long group project in conjunction with nonprofit Project for Pride in Living to develop a solar energy utilization plan for Hawthorne Eco-Village community development project \n· Analyzed TMY-2 data set to estimate hourly, daily, monthly and seasonally available solar energy \n· Used solar energy estimates to spec solar thermal water heater system Research Intern Center for Energy and Environment June 2008  –  May 2009  (1 year) Center for Energy and Environment \n· Conducted phone interviews of local hospitality establishment staff to determine eligibility for participation in study of secondhand smoke levels in restaurant patio seating \n· Maintained multiteam monitoring schedule for study of secondhand smoke levels in restaurant patio seating \n· Engaged in inconspicuous monitoring of patio section particulate concentrations at hospitality establishments \n· Maintained and calibrated monitoring equipment \n· Helped write instrument/data logger interface code in Dynamic C programming language \n· Conducted literature searches to further inform current research methodologies Peer Tutor Minneapolis Community and Technical College Learning Center January 2005  –  May 2006  (1 year 5 months) · Engaged in dialogue with students to determine current level of understanding \n· Appealed to multiple learning styles by combining spoken and written instruction \n· Encouraged student self sufficiency by teaching effective study and conceptualization methods Biostatistician Stanford University School of Medicine May 2012  – Present (3 years 4 months) Palo Alto, CA I help design simulation and clinical research projects in addition to managing and analyzing data. My code is primarily in R, SQL, SAS, Ruby or Python. I also develop tools to make my work easier and more efficient.  Biostatistician Stanford University School of Medicine May 2012  – Present (3 years 4 months) Palo Alto, CA I help design simulation and clinical research projects in addition to managing and analyzing data. My code is primarily in R, SQL, SAS, Ruby or Python. I also develop tools to make my work easier and more efficient.  Tinkerer Large August 2010  – Present (5 years 1 month) Compiled and analyzed bicycle count data from the City of Minneapolis' Greenway in conjunction with NOAA climatological data with R and SAS using generalized linear models \n \nWrote a parametric epidemic simulation in R and developed time-lapse epidemic spread visualization scheme Tinkerer Large August 2010  – Present (5 years 1 month) Compiled and analyzed bicycle count data from the City of Minneapolis' Greenway in conjunction with NOAA climatological data with R and SAS using generalized linear models \n \nWrote a parametric epidemic simulation in R and developed time-lapse epidemic spread visualization scheme Quantitative Analyst Intern Galliard Capital Management May 2011  –  May 2012  (1 year 1 month) Greater Minneapolis-St. Paul Area I utilized a smorgasbord of tools, including Bloomberg, Yieldbook, SQL, Ruby, Excel and R to provide useful analytical solutions and answer occasionally complex questions about bonds and portfolios of bonds. Quantitative Analyst Intern Galliard Capital Management May 2011  –  May 2012  (1 year 1 month) Greater Minneapolis-St. Paul Area I utilized a smorgasbord of tools, including Bloomberg, Yieldbook, SQL, Ruby, Excel and R to provide useful analytical solutions and answer occasionally complex questions about bonds and portfolios of bonds. Graduate Teaching/Research Assistant University of Minnesota School of Public Health August 2010  –  May 2012  (1 year 10 months) Twin Cities Campus Held regular office hours, graded homework, gave the occasional lecture \n \nAnalyzed BOLD data set to determine predictors of various post-surgical outcomes.  \n \nHelped debug Bayesian logistic regression program in Stata \n \nUsed MCMC methods for Bayesian logistic regression to evaluate Stata program Graduate Teaching/Research Assistant University of Minnesota School of Public Health August 2010  –  May 2012  (1 year 10 months) Twin Cities Campus Held regular office hours, graded homework, gave the occasional lecture \n \nAnalyzed BOLD data set to determine predictors of various post-surgical outcomes.  \n \nHelped debug Bayesian logistic regression program in Stata \n \nUsed MCMC methods for Bayesian logistic regression to evaluate Stata program Research Assistant Center for Energy and Environment May 2009  –  August 2010  (1 year 4 months) Center for Energy and Environment \n· Helped design and carry out experiment to determine particulate emission rates associated with common household combustion activities \n· Helped design and carry out experiment to determine accuracy and precision of monitoring equipment \n· Oversaw installation and maintenance of field monitoring equipment \n· Compiled and analyzed eclectic datasets relating local particulate levels, local VOC levels, regional particulate levels and meteorological data \n· Developed data validation scheme for multimillion point domestic hot water usage data set \n· Created meaningful, clear and concise visual representations of both raw data and analysis results \n· Conducted literature searches to further inform current research methodologies Research Assistant Center for Energy and Environment May 2009  –  August 2010  (1 year 4 months) Center for Energy and Environment \n· Helped design and carry out experiment to determine particulate emission rates associated with common household combustion activities \n· Helped design and carry out experiment to determine accuracy and precision of monitoring equipment \n· Oversaw installation and maintenance of field monitoring equipment \n· Compiled and analyzed eclectic datasets relating local particulate levels, local VOC levels, regional particulate levels and meteorological data \n· Developed data validation scheme for multimillion point domestic hot water usage data set \n· Created meaningful, clear and concise visual representations of both raw data and analysis results \n· Conducted literature searches to further inform current research methodologies Mechanical Engineering Senior Design Student University of Minnesota Institute of Technology January 2009  –  May 2009  (5 months) Mortuary Science Program to develop refractory injection device for use in the reduction of cremation-sourced mercury emissions \n· Named as inventor on provisional patent for refractory injection device \n· Devised and carried out multiple experiments to quantify refractory material properties and suitability \n· Adapted existing heat transfer models to provide insight into dental conditions during the cremation process \n· Conducted literature search on atmospheric mercury and human exposure  \nDomestic Solar Energy System Design, January 2009 to May 2009 \n· Participated in semester long group project in conjunction with nonprofit Project for Pride in Living to develop a solar energy utilization plan for Hawthorne Eco-Village community development project \n· Analyzed TMY-2 data set to estimate hourly, daily, monthly and seasonally available solar energy \n· Used solar energy estimates to spec solar thermal water heater system Mechanical Engineering Senior Design Student University of Minnesota Institute of Technology January 2009  –  May 2009  (5 months) Mortuary Science Program to develop refractory injection device for use in the reduction of cremation-sourced mercury emissions \n· Named as inventor on provisional patent for refractory injection device \n· Devised and carried out multiple experiments to quantify refractory material properties and suitability \n· Adapted existing heat transfer models to provide insight into dental conditions during the cremation process \n· Conducted literature search on atmospheric mercury and human exposure  \nDomestic Solar Energy System Design, January 2009 to May 2009 \n· Participated in semester long group project in conjunction with nonprofit Project for Pride in Living to develop a solar energy utilization plan for Hawthorne Eco-Village community development project \n· Analyzed TMY-2 data set to estimate hourly, daily, monthly and seasonally available solar energy \n· Used solar energy estimates to spec solar thermal water heater system Research Intern Center for Energy and Environment June 2008  –  May 2009  (1 year) Center for Energy and Environment \n· Conducted phone interviews of local hospitality establishment staff to determine eligibility for participation in study of secondhand smoke levels in restaurant patio seating \n· Maintained multiteam monitoring schedule for study of secondhand smoke levels in restaurant patio seating \n· Engaged in inconspicuous monitoring of patio section particulate concentrations at hospitality establishments \n· Maintained and calibrated monitoring equipment \n· Helped write instrument/data logger interface code in Dynamic C programming language \n· Conducted literature searches to further inform current research methodologies Research Intern Center for Energy and Environment June 2008  –  May 2009  (1 year) Center for Energy and Environment \n· Conducted phone interviews of local hospitality establishment staff to determine eligibility for participation in study of secondhand smoke levels in restaurant patio seating \n· Maintained multiteam monitoring schedule for study of secondhand smoke levels in restaurant patio seating \n· Engaged in inconspicuous monitoring of patio section particulate concentrations at hospitality establishments \n· Maintained and calibrated monitoring equipment \n· Helped write instrument/data logger interface code in Dynamic C programming language \n· Conducted literature searches to further inform current research methodologies Peer Tutor Minneapolis Community and Technical College Learning Center January 2005  –  May 2006  (1 year 5 months) · Engaged in dialogue with students to determine current level of understanding \n· Appealed to multiple learning styles by combining spoken and written instruction \n· Encouraged student self sufficiency by teaching effective study and conceptualization methods Peer Tutor Minneapolis Community and Technical College Learning Center January 2005  –  May 2006  (1 year 5 months) · Engaged in dialogue with students to determine current level of understanding \n· Appealed to multiple learning styles by combining spoken and written instruction \n· Encouraged student self sufficiency by teaching effective study and conceptualization methods Skills R Statistics Ruby Analysis Data Analysis Modeling Data Modeling Biostatistics SAS/SQL MySQL SAS programming Statistical Modeling Stata SAS Data Mining Logistic Regression Predictive Modeling Machine Learning Mathematical Modeling Experimental Design Mathematica Simulations LaTeX See 8+     See less Skills  R Statistics Ruby Analysis Data Analysis Modeling Data Modeling Biostatistics SAS/SQL MySQL SAS programming Statistical Modeling Stata SAS Data Mining Logistic Regression Predictive Modeling Machine Learning Mathematical Modeling Experimental Design Mathematica Simulations LaTeX See 8+     See less R Statistics Ruby Analysis Data Analysis Modeling Data Modeling Biostatistics SAS/SQL MySQL SAS programming Statistical Modeling Stata SAS Data Mining Logistic Regression Predictive Modeling Machine Learning Mathematical Modeling Experimental Design Mathematica Simulations LaTeX See 8+     See less R Statistics Ruby Analysis Data Analysis Modeling Data Modeling Biostatistics SAS/SQL MySQL SAS programming Statistical Modeling Stata SAS Data Mining Logistic Regression Predictive Modeling Machine Learning Mathematical Modeling Experimental Design Mathematica Simulations LaTeX See 8+     See less Education University of Minnesota-Twin Cities MS,  Biostatistics 2010  – 2012 University of Minnesota-Twin Cities BME,  Mechanical Engineering 2006  – 2009 Mathematics Minor Minneapolis Community and Technical College Associate of Science (A.S.),  Mathematics University of Minnesota-Twin Cities MS,  Biostatistics 2010  – 2012 University of Minnesota-Twin Cities MS,  Biostatistics 2010  – 2012 University of Minnesota-Twin Cities MS,  Biostatistics 2010  – 2012 University of Minnesota-Twin Cities BME,  Mechanical Engineering 2006  – 2009 Mathematics Minor University of Minnesota-Twin Cities BME,  Mechanical Engineering 2006  – 2009 Mathematics Minor University of Minnesota-Twin Cities BME,  Mechanical Engineering 2006  – 2009 Mathematics Minor Minneapolis Community and Technical College Associate of Science (A.S.),  Mathematics Minneapolis Community and Technical College Associate of Science (A.S.),  Mathematics Minneapolis Community and Technical College Associate of Science (A.S.),  Mathematics ", "Experience Freelance Essayist The New York Times 2008  – Present (7 years) My work has appeared in The New York Times, Stanford Undergraduate Research Journal, Six Degrees: Stanford Journal of Human Rights, Kaua'i Traveler Freelance Essayist The New York Times 2008  – Present (7 years) My work has appeared in The New York Times, Stanford Undergraduate Research Journal, Six Degrees: Stanford Journal of Human Rights, Kaua'i Traveler Freelance Essayist The New York Times 2008  – Present (7 years) My work has appeared in The New York Times, Stanford Undergraduate Research Journal, Six Degrees: Stanford Journal of Human Rights, Kaua'i Traveler Languages English Native or bilingual proficiency Chinese Mandarin Native or bilingual proficiency American Sign Language Limited working proficiency Spanish Limited working proficiency English Native or bilingual proficiency Chinese Mandarin Native or bilingual proficiency American Sign Language Limited working proficiency Spanish Limited working proficiency English Native or bilingual proficiency Chinese Mandarin Native or bilingual proficiency American Sign Language Limited working proficiency Spanish Limited working proficiency Native or bilingual proficiency Native or bilingual proficiency Limited working proficiency Limited working proficiency Skills Research Legal Research Legal Writing Editing Public Speaking Non-profits Social Media Public Policy Intellectual Property Community Outreach Litigation Event Planning Grant Writing Policy Analysis Licensing Blogging Fundraising Teaching Spanish Microsoft Office Courts Immigration Law Criminal Law See 8+     See less Skills  Research Legal Research Legal Writing Editing Public Speaking Non-profits Social Media Public Policy Intellectual Property Community Outreach Litigation Event Planning Grant Writing Policy Analysis Licensing Blogging Fundraising Teaching Spanish Microsoft Office Courts Immigration Law Criminal Law See 8+     See less Research Legal Research Legal Writing Editing Public Speaking Non-profits Social Media Public Policy Intellectual Property Community Outreach Litigation Event Planning Grant Writing Policy Analysis Licensing Blogging Fundraising Teaching Spanish Microsoft Office Courts Immigration Law Criminal Law See 8+     See less Research Legal Research Legal Writing Editing Public Speaking Non-profits Social Media Public Policy Intellectual Property Community Outreach Litigation Event Planning Grant Writing Policy Analysis Licensing Blogging Fundraising Teaching Spanish Microsoft Office Courts Immigration Law Criminal Law See 8+     See less Education Stanford University B.A,  Human Biology ,  Creative Writing 2006  – 2010 Activities and Societies:  Financial Manager ,  Stanford Housing Synergy Cooperative;\nPublicist ,  Stanford LGBT Community Resources Center;\nPanelist ,  Safe and Open Spaces at Stanford (SOSAS);\nPrograms Intern ,  Stanford Center for Relationship Abuse Awareness;\nCommunity Orientation Volunteer ,  Stanford LGBT Community Resources Center University of California, Davis - School of Law J.D., Esquire , Top 15% of graduating class 2010  – 2013 Activities and Societies:  UC Davis Law Review; UC Davis School of Law Moot Court Program;\nClinic Director ,  Sacramento LGBT Community Legal Clinic;\nEditor ,  Environs: Environmental Law and Policy Journal;\nRepresentative ,  Career Services Committee;\nTreasurer ,  King Hall Intellectual Property Law Association;\nMember ,  Asian/Pacific-American Law Students Association Stanford University B.A,  Human Biology ,  Creative Writing 2006  – 2010 Activities and Societies:  Financial Manager ,  Stanford Housing Synergy Cooperative;\nPublicist ,  Stanford LGBT Community Resources Center;\nPanelist ,  Safe and Open Spaces at Stanford (SOSAS);\nPrograms Intern ,  Stanford Center for Relationship Abuse Awareness;\nCommunity Orientation Volunteer ,  Stanford LGBT Community Resources Center Stanford University B.A,  Human Biology ,  Creative Writing 2006  – 2010 Activities and Societies:  Financial Manager ,  Stanford Housing Synergy Cooperative;\nPublicist ,  Stanford LGBT Community Resources Center;\nPanelist ,  Safe and Open Spaces at Stanford (SOSAS);\nPrograms Intern ,  Stanford Center for Relationship Abuse Awareness;\nCommunity Orientation Volunteer ,  Stanford LGBT Community Resources Center Stanford University B.A,  Human Biology ,  Creative Writing 2006  – 2010 Activities and Societies:  Financial Manager ,  Stanford Housing Synergy Cooperative;\nPublicist ,  Stanford LGBT Community Resources Center;\nPanelist ,  Safe and Open Spaces at Stanford (SOSAS);\nPrograms Intern ,  Stanford Center for Relationship Abuse Awareness;\nCommunity Orientation Volunteer ,  Stanford LGBT Community Resources Center University of California, Davis - School of Law J.D., Esquire , Top 15% of graduating class 2010  – 2013 Activities and Societies:  UC Davis Law Review; UC Davis School of Law Moot Court Program;\nClinic Director ,  Sacramento LGBT Community Legal Clinic;\nEditor ,  Environs: Environmental Law and Policy Journal;\nRepresentative ,  Career Services Committee;\nTreasurer ,  King Hall Intellectual Property Law Association;\nMember ,  Asian/Pacific-American Law Students Association University of California, Davis - School of Law J.D., Esquire , Top 15% of graduating class 2010  – 2013 Activities and Societies:  UC Davis Law Review; UC Davis School of Law Moot Court Program;\nClinic Director ,  Sacramento LGBT Community Legal Clinic;\nEditor ,  Environs: Environmental Law and Policy Journal;\nRepresentative ,  Career Services Committee;\nTreasurer ,  King Hall Intellectual Property Law Association;\nMember ,  Asian/Pacific-American Law Students Association University of California, Davis - School of Law J.D., Esquire , Top 15% of graduating class 2010  – 2013 Activities and Societies:  UC Davis Law Review; UC Davis School of Law Moot Court Program;\nClinic Director ,  Sacramento LGBT Community Legal Clinic;\nEditor ,  Environs: Environmental Law and Policy Journal;\nRepresentative ,  Career Services Committee;\nTreasurer ,  King Hall Intellectual Property Law Association;\nMember ,  Asian/Pacific-American Law Students Association Honors & Awards ", "Experience Associate Frank, Rimerman + Co. LLP October 2013  – Present (1 year 11 months) Passed the 4 parts of the CPA exam Women's Volleyball Statistician Stanford University September 2008  – Present (7 years) Track and call each play- requires focus and speed  \n \nProvide statistics to teams \n \nUse problem solving skills to resolve errors Women's JV Volleyball Coach Los Gatos High School August 2012  –  November 2012  (4 months) Marketing Intern Looxcie Inc October 2011  –  August 2012  (11 months) Worked on the search engine marketing campaigns for Looxcie using Google AdWords and Google Analytics \n \nCreated advertisements \n \nAnalyzed data points to evaluate the success of ads based of bounce rate, click through rate, time spent on the site, pages visited, cost per click etc. Assistant Coach Eclipse Volleyball Club November 2010  –  June 2011  (8 months) Instructed in all aspects of volleyball for competitive club play  \n \nAssisted each athlete skills: serving, passing, hitting, blocking and understanding different rotations and play/game strategies  \n \nImplemented positive coaching techniques Assistant Coach Palo Alto Elite Volleyball Club November 2009  –  May 2010  (7 months) Associate Frank, Rimerman + Co. LLP October 2013  – Present (1 year 11 months) Passed the 4 parts of the CPA exam Associate Frank, Rimerman + Co. LLP October 2013  – Present (1 year 11 months) Passed the 4 parts of the CPA exam Women's Volleyball Statistician Stanford University September 2008  – Present (7 years) Track and call each play- requires focus and speed  \n \nProvide statistics to teams \n \nUse problem solving skills to resolve errors Women's Volleyball Statistician Stanford University September 2008  – Present (7 years) Track and call each play- requires focus and speed  \n \nProvide statistics to teams \n \nUse problem solving skills to resolve errors Women's JV Volleyball Coach Los Gatos High School August 2012  –  November 2012  (4 months) Women's JV Volleyball Coach Los Gatos High School August 2012  –  November 2012  (4 months) Marketing Intern Looxcie Inc October 2011  –  August 2012  (11 months) Worked on the search engine marketing campaigns for Looxcie using Google AdWords and Google Analytics \n \nCreated advertisements \n \nAnalyzed data points to evaluate the success of ads based of bounce rate, click through rate, time spent on the site, pages visited, cost per click etc. Marketing Intern Looxcie Inc October 2011  –  August 2012  (11 months) Worked on the search engine marketing campaigns for Looxcie using Google AdWords and Google Analytics \n \nCreated advertisements \n \nAnalyzed data points to evaluate the success of ads based of bounce rate, click through rate, time spent on the site, pages visited, cost per click etc. Assistant Coach Eclipse Volleyball Club November 2010  –  June 2011  (8 months) Instructed in all aspects of volleyball for competitive club play  \n \nAssisted each athlete skills: serving, passing, hitting, blocking and understanding different rotations and play/game strategies  \n \nImplemented positive coaching techniques Assistant Coach Eclipse Volleyball Club November 2010  –  June 2011  (8 months) Instructed in all aspects of volleyball for competitive club play  \n \nAssisted each athlete skills: serving, passing, hitting, blocking and understanding different rotations and play/game strategies  \n \nImplemented positive coaching techniques Assistant Coach Palo Alto Elite Volleyball Club November 2009  –  May 2010  (7 months) Assistant Coach Palo Alto Elite Volleyball Club November 2009  –  May 2010  (7 months) Skills Google Analytics Google Adwords Data Analysis Problem Solving MS Office tools Skills  Google Analytics Google Adwords Data Analysis Problem Solving MS Office tools Google Analytics Google Adwords Data Analysis Problem Solving MS Office tools Google Analytics Google Adwords Data Analysis Problem Solving MS Office tools Education Santa Clara University - Leavey School of Business Accounting,  Accounting 2011  – 2013 Cum Laude 2005 - 2009 St. Francis High School High School 2005  – 2009 Activities and Societies:  National Honor Society\nForeign Language Honor Society\nCalifornia Scholarship Federation\nMaxima Cum Laude Santa Clara University - Leavey School of Business Accounting,  Accounting 2011  – 2013 Cum Laude Santa Clara University - Leavey School of Business Accounting,  Accounting 2011  – 2013 Cum Laude Santa Clara University - Leavey School of Business Accounting,  Accounting 2011  – 2013 Cum Laude 2005 - 2009 St. Francis High School High School 2005  – 2009 Activities and Societies:  National Honor Society\nForeign Language Honor Society\nCalifornia Scholarship Federation\nMaxima Cum Laude 2005 - 2009 St. Francis High School High School 2005  – 2009 Activities and Societies:  National Honor Society\nForeign Language Honor Society\nCalifornia Scholarship Federation\nMaxima Cum Laude 2005 - 2009 St. Francis High School High School 2005  – 2009 Activities and Societies:  National Honor Society\nForeign Language Honor Society\nCalifornia Scholarship Federation\nMaxima Cum Laude ", "Summary Years of solid statistical training in data analysis and statistical modeling. \n \nExtensive programming experiences in big data mining and reporting. Summary Years of solid statistical training in data analysis and statistical modeling. \n \nExtensive programming experiences in big data mining and reporting. Years of solid statistical training in data analysis and statistical modeling. \n \nExtensive programming experiences in big data mining and reporting. Years of solid statistical training in data analysis and statistical modeling. \n \nExtensive programming experiences in big data mining and reporting. Experience Statistician Stanford University August 2014  – Present (1 year 1 month) San Francisco Bay Area Statistical Analyst & SAS Programmer Brown University January 2012  –  December 2013  (2 years) Providence, Rhode Island Area Worked as a statistical analyst and SAS programmer for the National Oncology PET Registry(NOPR) Group and American College of Radiology Imaging Network(ACRIN) Group at Brown University.  \n \n1. Provided Technical Support: offering statistical/SAS supports by completing requests on demand, such as statistical tests/modeling/tables/graphs/maps with aggressive deadlines, data cleaning, the student RA's SAS training \n \n2. Spatial Analysis Project: Aimed to explore the spatial trend in predicting treatment plan change of cancer patients; Generated manuscript reports with US maps; Adopted non-spatial random effects model, bayesian spatial model and the logistic regression. \n \n3. Management Reports: Completed monthly management reports for administrative/investigative purposes. \n \n4. Data Management: Monthly verified and froze NOPR registry data with hundreds of thousands of records, validated data from multiple sources, generated data sets for various purposes, and other requested data tasks.  \n \n5. ACRIN 6668 MTV Textual Feature Analysis: Aimed to conduct survival analysis on imaging textual feature data and further predict lung cancer patients' survival. Graduate Research Assistant Brown University October 2010  –  October 2012  (2 years 1 month) Providence, Rhode Island Area Project: Adjudication Processes Project (Oct. 2010- Oct. 2012) \n \nDesigned a simulation in R to realize the comparison of three popular adjudication processes in image interpretation in terms of accuracy and cost, and further tested the robustness of these processes to outliers \n \nFound the most accurate and robust process and the most cost effective process \n \nSuccessfully improved the best two processes with better accuracy and lower cost simultaneously Master's Thesis - Binary classifications by mixture models Brown University August 2011  –  May 2012  (10 months) Providence, Rhode Island Area Explored multiple binary classification methods and discovered optimal solutions for simulated data with both continuous/categorical markers in R under the circumstances of normal/lognormal setting \n \nCompared results from mixture models, logistic regression and linear discriminant analysis(LDA), and successfully showed the benefits of using different types of markers in binary classifications in the mixture models for simulated lognormal data sets Statistician Stanford University August 2014  – Present (1 year 1 month) San Francisco Bay Area Statistician Stanford University August 2014  – Present (1 year 1 month) San Francisco Bay Area Statistical Analyst & SAS Programmer Brown University January 2012  –  December 2013  (2 years) Providence, Rhode Island Area Worked as a statistical analyst and SAS programmer for the National Oncology PET Registry(NOPR) Group and American College of Radiology Imaging Network(ACRIN) Group at Brown University.  \n \n1. Provided Technical Support: offering statistical/SAS supports by completing requests on demand, such as statistical tests/modeling/tables/graphs/maps with aggressive deadlines, data cleaning, the student RA's SAS training \n \n2. Spatial Analysis Project: Aimed to explore the spatial trend in predicting treatment plan change of cancer patients; Generated manuscript reports with US maps; Adopted non-spatial random effects model, bayesian spatial model and the logistic regression. \n \n3. Management Reports: Completed monthly management reports for administrative/investigative purposes. \n \n4. Data Management: Monthly verified and froze NOPR registry data with hundreds of thousands of records, validated data from multiple sources, generated data sets for various purposes, and other requested data tasks.  \n \n5. ACRIN 6668 MTV Textual Feature Analysis: Aimed to conduct survival analysis on imaging textual feature data and further predict lung cancer patients' survival. Statistical Analyst & SAS Programmer Brown University January 2012  –  December 2013  (2 years) Providence, Rhode Island Area Worked as a statistical analyst and SAS programmer for the National Oncology PET Registry(NOPR) Group and American College of Radiology Imaging Network(ACRIN) Group at Brown University.  \n \n1. Provided Technical Support: offering statistical/SAS supports by completing requests on demand, such as statistical tests/modeling/tables/graphs/maps with aggressive deadlines, data cleaning, the student RA's SAS training \n \n2. Spatial Analysis Project: Aimed to explore the spatial trend in predicting treatment plan change of cancer patients; Generated manuscript reports with US maps; Adopted non-spatial random effects model, bayesian spatial model and the logistic regression. \n \n3. Management Reports: Completed monthly management reports for administrative/investigative purposes. \n \n4. Data Management: Monthly verified and froze NOPR registry data with hundreds of thousands of records, validated data from multiple sources, generated data sets for various purposes, and other requested data tasks.  \n \n5. ACRIN 6668 MTV Textual Feature Analysis: Aimed to conduct survival analysis on imaging textual feature data and further predict lung cancer patients' survival. Graduate Research Assistant Brown University October 2010  –  October 2012  (2 years 1 month) Providence, Rhode Island Area Project: Adjudication Processes Project (Oct. 2010- Oct. 2012) \n \nDesigned a simulation in R to realize the comparison of three popular adjudication processes in image interpretation in terms of accuracy and cost, and further tested the robustness of these processes to outliers \n \nFound the most accurate and robust process and the most cost effective process \n \nSuccessfully improved the best two processes with better accuracy and lower cost simultaneously Graduate Research Assistant Brown University October 2010  –  October 2012  (2 years 1 month) Providence, Rhode Island Area Project: Adjudication Processes Project (Oct. 2010- Oct. 2012) \n \nDesigned a simulation in R to realize the comparison of three popular adjudication processes in image interpretation in terms of accuracy and cost, and further tested the robustness of these processes to outliers \n \nFound the most accurate and robust process and the most cost effective process \n \nSuccessfully improved the best two processes with better accuracy and lower cost simultaneously Master's Thesis - Binary classifications by mixture models Brown University August 2011  –  May 2012  (10 months) Providence, Rhode Island Area Explored multiple binary classification methods and discovered optimal solutions for simulated data with both continuous/categorical markers in R under the circumstances of normal/lognormal setting \n \nCompared results from mixture models, logistic regression and linear discriminant analysis(LDA), and successfully showed the benefits of using different types of markers in binary classifications in the mixture models for simulated lognormal data sets Master's Thesis - Binary classifications by mixture models Brown University August 2011  –  May 2012  (10 months) Providence, Rhode Island Area Explored multiple binary classification methods and discovered optimal solutions for simulated data with both continuous/categorical markers in R under the circumstances of normal/lognormal setting \n \nCompared results from mixture models, logistic regression and linear discriminant analysis(LDA), and successfully showed the benefits of using different types of markers in binary classifications in the mixture models for simulated lognormal data sets Languages Chinese Native or bilingual proficiency English Full professional proficiency Chinese Native or bilingual proficiency English Full professional proficiency Chinese Native or bilingual proficiency English Full professional proficiency Native or bilingual proficiency Full professional proficiency Skills SAS R Matlab Stata Data Analysis Data Management Statistical Modeling Biostatistics Python Statistical Consulting Census Microsoft Word PowerPoint Statistical Simulations CTEX Statistical Reporting Logistic Regression Survival Analysis Data Cleaning LaTeX Statistical Finance Microsoft Excel Cancer Research Spatial Analysis Clinical Trials Epidemiology Statistical Computing Outlook Kidney Research SPSS See 15+     See less Skills  SAS R Matlab Stata Data Analysis Data Management Statistical Modeling Biostatistics Python Statistical Consulting Census Microsoft Word PowerPoint Statistical Simulations CTEX Statistical Reporting Logistic Regression Survival Analysis Data Cleaning LaTeX Statistical Finance Microsoft Excel Cancer Research Spatial Analysis Clinical Trials Epidemiology Statistical Computing Outlook Kidney Research SPSS See 15+     See less SAS R Matlab Stata Data Analysis Data Management Statistical Modeling Biostatistics Python Statistical Consulting Census Microsoft Word PowerPoint Statistical Simulations CTEX Statistical Reporting Logistic Regression Survival Analysis Data Cleaning LaTeX Statistical Finance Microsoft Excel Cancer Research Spatial Analysis Clinical Trials Epidemiology Statistical Computing Outlook Kidney Research SPSS See 15+     See less SAS R Matlab Stata Data Analysis Data Management Statistical Modeling Biostatistics Python Statistical Consulting Census Microsoft Word PowerPoint Statistical Simulations CTEX Statistical Reporting Logistic Regression Survival Analysis Data Cleaning LaTeX Statistical Finance Microsoft Excel Cancer Research Spatial Analysis Clinical Trials Epidemiology Statistical Computing Outlook Kidney Research SPSS See 15+     See less Education Brown University Master of Science (M.S.),  Biostatistics 2010  – 2012 University of Science and Technology of China Bachelor of Science (B.S.),  Statistics 2006  – 2010 Brown University Master of Science (M.S.),  Biostatistics 2010  – 2012 Brown University Master of Science (M.S.),  Biostatistics 2010  – 2012 Brown University Master of Science (M.S.),  Biostatistics 2010  – 2012 University of Science and Technology of China Bachelor of Science (B.S.),  Statistics 2006  – 2010 University of Science and Technology of China Bachelor of Science (B.S.),  Statistics 2006  – 2010 University of Science and Technology of China Bachelor of Science (B.S.),  Statistics 2006  – 2010 Honors & Awards The Best Graduate/Post-doctoral Poster for 2012 Public Health Research Day Brown University April 2012 Public Health Tuition Scholarship Department of Biostatistics, Brown University 2011 Public Health Tuition Scholarship Department of Biostatistics, Brown University 2010 Outstanding Student Scholarship (Grade 3) University of Science and Technology of China 2009 Outstanding Student Scholarship (Grade 3) University of Science and Technology of China 2008 The Best Graduate/Post-doctoral Poster for 2012 Public Health Research Day Brown University April 2012 The Best Graduate/Post-doctoral Poster for 2012 Public Health Research Day Brown University April 2012 The Best Graduate/Post-doctoral Poster for 2012 Public Health Research Day Brown University April 2012 Public Health Tuition Scholarship Department of Biostatistics, Brown University 2011 Public Health Tuition Scholarship Department of Biostatistics, Brown University 2011 Public Health Tuition Scholarship Department of Biostatistics, Brown University 2011 Public Health Tuition Scholarship Department of Biostatistics, Brown University 2010 Public Health Tuition Scholarship Department of Biostatistics, Brown University 2010 Public Health Tuition Scholarship Department of Biostatistics, Brown University 2010 Outstanding Student Scholarship (Grade 3) University of Science and Technology of China 2009 Outstanding Student Scholarship (Grade 3) University of Science and Technology of China 2009 Outstanding Student Scholarship (Grade 3) University of Science and Technology of China 2009 Outstanding Student Scholarship (Grade 3) University of Science and Technology of China 2008 Outstanding Student Scholarship (Grade 3) University of Science and Technology of China 2008 Outstanding Student Scholarship (Grade 3) University of Science and Technology of China 2008 ", "Languages French French French Skills SQL Perl HTML Excel PHP JavaScript Statistics Database Administration Analysis Sports Word PowerPoint Access Windows Python Microsoft Office Visual Basic Databases Teaching Programming Mathematics Research Microsoft Excel Public Relations Stat-Crew for... See 10+     See less Skills  SQL Perl HTML Excel PHP JavaScript Statistics Database Administration Analysis Sports Word PowerPoint Access Windows Python Microsoft Office Visual Basic Databases Teaching Programming Mathematics Research Microsoft Excel Public Relations Stat-Crew for... See 10+     See less SQL Perl HTML Excel PHP JavaScript Statistics Database Administration Analysis Sports Word PowerPoint Access Windows Python Microsoft Office Visual Basic Databases Teaching Programming Mathematics Research Microsoft Excel Public Relations Stat-Crew for... See 10+     See less SQL Perl HTML Excel PHP JavaScript Statistics Database Administration Analysis Sports Word PowerPoint Access Windows Python Microsoft Office Visual Basic Databases Teaching Programming Mathematics Research Microsoft Excel Public Relations Stat-Crew for... See 10+     See less Honors & Awards "]}