{"position": "Strategic Marketing Manager", "company": "Intel Corporation", "profiles": ["Skills Semiconductors Product Marketing Marketing Management Customer Engagement Go-to-market Strategy Storage Business Development Technical Marketing Demand Generation Strategic Partnerships Product Launch Multi-channel Marketing Product Management Competitive Analysis Marketing Strategy Skills  Semiconductors Product Marketing Marketing Management Customer Engagement Go-to-market Strategy Storage Business Development Technical Marketing Demand Generation Strategic Partnerships Product Launch Multi-channel Marketing Product Management Competitive Analysis Marketing Strategy Semiconductors Product Marketing Marketing Management Customer Engagement Go-to-market Strategy Storage Business Development Technical Marketing Demand Generation Strategic Partnerships Product Launch Multi-channel Marketing Product Management Competitive Analysis Marketing Strategy Semiconductors Product Marketing Marketing Management Customer Engagement Go-to-market Strategy Storage Business Development Technical Marketing Demand Generation Strategic Partnerships Product Launch Multi-channel Marketing Product Management Competitive Analysis Marketing Strategy ", "Summary As a critical member of any marketing team, I am experienced in creating, managing and executing integrated marketing plans and programs that meet the strategic objectives of marketing and sales organizations. Summary As a critical member of any marketing team, I am experienced in creating, managing and executing integrated marketing plans and programs that meet the strategic objectives of marketing and sales organizations. As a critical member of any marketing team, I am experienced in creating, managing and executing integrated marketing plans and programs that meet the strategic objectives of marketing and sales organizations. As a critical member of any marketing team, I am experienced in creating, managing and executing integrated marketing plans and programs that meet the strategic objectives of marketing and sales organizations. Experience Corporate Initiatives Strategic Marketing Manager Intel Corporation January 2013  – Present (2 years 8 months) Folsom, CA Corporate Initiatives Strategic Marketing Manager Intel Corporation January 2013  – Present (2 years 8 months) Folsom, CA Corporate Initiatives Strategic Marketing Manager Intel Corporation January 2013  – Present (2 years 8 months) Folsom, CA Skills Integrated Marketing Analyst Relations Global Marketing Cross-functional Team... Marketing Strategy Messaging Direct Marketing Product Marketing Management Strategic Communications Software Development Marketing Management Strategy Marketing Program Management Product Development Marketing Communications See 2+     See less Skills  Integrated Marketing Analyst Relations Global Marketing Cross-functional Team... Marketing Strategy Messaging Direct Marketing Product Marketing Management Strategic Communications Software Development Marketing Management Strategy Marketing Program Management Product Development Marketing Communications See 2+     See less Integrated Marketing Analyst Relations Global Marketing Cross-functional Team... Marketing Strategy Messaging Direct Marketing Product Marketing Management Strategic Communications Software Development Marketing Management Strategy Marketing Program Management Product Development Marketing Communications See 2+     See less Integrated Marketing Analyst Relations Global Marketing Cross-functional Team... Marketing Strategy Messaging Direct Marketing Product Marketing Management Strategic Communications Software Development Marketing Management Strategy Marketing Program Management Product Development Marketing Communications See 2+     See less Education Brooks Institute of Photography BA,  Industrial Scientific Photography/Color Technology 1982  – 1985 Brooks Institute of Photography BA,  Industrial Scientific Photography/Color Technology 1982  – 1985 Brooks Institute of Photography BA,  Industrial Scientific Photography/Color Technology 1982  – 1985 Brooks Institute of Photography BA,  Industrial Scientific Photography/Color Technology 1982  – 1985 ", "Summary Accomplished marketing manager with 15+ years of international experience - passionate about defining innovative strategies to drive positive change and creating value through technology and sustainability. Well versed in engaging and communicating with internal and external stakeholders across organizations.  \n \nSpecialties: Marketing Strategy | Project Management | Partner Marketing | Marketing Innovation | Strategic Partnerships | Market requirements | Go-To-Market Strategy | Product Positioning | Sustainability Strategy | Cleantech | Green IT | Digital & Social Media Marketing | Agency Relationship Management | SaaS | Cloud Marketing | Industry Speaker | High Tech | Smart Grid | Start Up | Small Business | Solar Energy Summary Accomplished marketing manager with 15+ years of international experience - passionate about defining innovative strategies to drive positive change and creating value through technology and sustainability. Well versed in engaging and communicating with internal and external stakeholders across organizations.  \n \nSpecialties: Marketing Strategy | Project Management | Partner Marketing | Marketing Innovation | Strategic Partnerships | Market requirements | Go-To-Market Strategy | Product Positioning | Sustainability Strategy | Cleantech | Green IT | Digital & Social Media Marketing | Agency Relationship Management | SaaS | Cloud Marketing | Industry Speaker | High Tech | Smart Grid | Start Up | Small Business | Solar Energy Accomplished marketing manager with 15+ years of international experience - passionate about defining innovative strategies to drive positive change and creating value through technology and sustainability. Well versed in engaging and communicating with internal and external stakeholders across organizations.  \n \nSpecialties: Marketing Strategy | Project Management | Partner Marketing | Marketing Innovation | Strategic Partnerships | Market requirements | Go-To-Market Strategy | Product Positioning | Sustainability Strategy | Cleantech | Green IT | Digital & Social Media Marketing | Agency Relationship Management | SaaS | Cloud Marketing | Industry Speaker | High Tech | Smart Grid | Start Up | Small Business | Solar Energy Accomplished marketing manager with 15+ years of international experience - passionate about defining innovative strategies to drive positive change and creating value through technology and sustainability. Well versed in engaging and communicating with internal and external stakeholders across organizations.  \n \nSpecialties: Marketing Strategy | Project Management | Partner Marketing | Marketing Innovation | Strategic Partnerships | Market requirements | Go-To-Market Strategy | Product Positioning | Sustainability Strategy | Cleantech | Green IT | Digital & Social Media Marketing | Agency Relationship Management | SaaS | Cloud Marketing | Industry Speaker | High Tech | Smart Grid | Start Up | Small Business | Solar Energy Experience Senior Product Marketing Manager Enphase Energy February 2015  – Present (7 months) San Francisco Bay Area Product Marketing Director PE INTERNATIONAL AG May 2013  –  January 2015  (1 year 9 months) San Francisco Bay Area Senior Product Marketing Engineer Intel Corporation June 2008  –  April 2013  (4 years 11 months) California Marketing Coordinator (Volunteer with Planning Committee) Sacramento French Film Festival March 2003  –  March 2013  (10 years 1 month) Senior Consumer Products Marketing Engineer Intel Corporation January 2005  –  June 2008  (3 years 6 months) Strategic Marketing Manager Intel Corporation July 2001  –  January 2005  (3 years 7 months) Product Marketing Engineer Intel Corporation August 1999  –  July 2001  (2 years) Field Sales Application Engineer-Europe Intel Corporation January 1996  –  August 1999  (3 years 8 months) Senior Product Marketing Manager Enphase Energy February 2015  – Present (7 months) San Francisco Bay Area Senior Product Marketing Manager Enphase Energy February 2015  – Present (7 months) San Francisco Bay Area Product Marketing Director PE INTERNATIONAL AG May 2013  –  January 2015  (1 year 9 months) San Francisco Bay Area Product Marketing Director PE INTERNATIONAL AG May 2013  –  January 2015  (1 year 9 months) San Francisco Bay Area Senior Product Marketing Engineer Intel Corporation June 2008  –  April 2013  (4 years 11 months) California Senior Product Marketing Engineer Intel Corporation June 2008  –  April 2013  (4 years 11 months) California Marketing Coordinator (Volunteer with Planning Committee) Sacramento French Film Festival March 2003  –  March 2013  (10 years 1 month) Marketing Coordinator (Volunteer with Planning Committee) Sacramento French Film Festival March 2003  –  March 2013  (10 years 1 month) Senior Consumer Products Marketing Engineer Intel Corporation January 2005  –  June 2008  (3 years 6 months) Senior Consumer Products Marketing Engineer Intel Corporation January 2005  –  June 2008  (3 years 6 months) Strategic Marketing Manager Intel Corporation July 2001  –  January 2005  (3 years 7 months) Strategic Marketing Manager Intel Corporation July 2001  –  January 2005  (3 years 7 months) Product Marketing Engineer Intel Corporation August 1999  –  July 2001  (2 years) Product Marketing Engineer Intel Corporation August 1999  –  July 2001  (2 years) Field Sales Application Engineer-Europe Intel Corporation January 1996  –  August 1999  (3 years 8 months) Field Sales Application Engineer-Europe Intel Corporation January 1996  –  August 1999  (3 years 8 months) Languages English French German English French German English French German Skills Marketing Strategy Product Marketing Strategy Go-to-market Strategy Strategic Partnerships Business Alliances Sustainability Marketing Product Lifecycle... Product Launch Green Technology SaaS Digital Media Product Management Creative Strategy Consumer Electronics Technical Marketing Multi-channel Marketing Partnership Marketing Computer Security Competitive Marketing... Program Management Green Marketing Smart Grid Semiconductors Software Marketing Corporate Sustainability Competitive Analysis Non-profit Marketing Firmware Intel Start-ups Small Business Film Production Corporate Social... Cross-functional Team... Leadership Public Speaking Microsoft Office Strategic Planning Social Media Digital Marketing Social Media Marketing Business Development Enterprise Software Market Research Cloud Marketing See 32+     See less Skills  Marketing Strategy Product Marketing Strategy Go-to-market Strategy Strategic Partnerships Business Alliances Sustainability Marketing Product Lifecycle... Product Launch Green Technology SaaS Digital Media Product Management Creative Strategy Consumer Electronics Technical Marketing Multi-channel Marketing Partnership Marketing Computer Security Competitive Marketing... Program Management Green Marketing Smart Grid Semiconductors Software Marketing Corporate Sustainability Competitive Analysis Non-profit Marketing Firmware Intel Start-ups Small Business Film Production Corporate Social... Cross-functional Team... Leadership Public Speaking Microsoft Office Strategic Planning Social Media Digital Marketing Social Media Marketing Business Development Enterprise Software Market Research Cloud Marketing See 32+     See less Marketing Strategy Product Marketing Strategy Go-to-market Strategy Strategic Partnerships Business Alliances Sustainability Marketing Product Lifecycle... Product Launch Green Technology SaaS Digital Media Product Management Creative Strategy Consumer Electronics Technical Marketing Multi-channel Marketing Partnership Marketing Computer Security Competitive Marketing... Program Management Green Marketing Smart Grid Semiconductors Software Marketing Corporate Sustainability Competitive Analysis Non-profit Marketing Firmware Intel Start-ups Small Business Film Production Corporate Social... Cross-functional Team... Leadership Public Speaking Microsoft Office Strategic Planning Social Media Digital Marketing Social Media Marketing Business Development Enterprise Software Market Research Cloud Marketing See 32+     See less Marketing Strategy Product Marketing Strategy Go-to-market Strategy Strategic Partnerships Business Alliances Sustainability Marketing Product Lifecycle... Product Launch Green Technology SaaS Digital Media Product Management Creative Strategy Consumer Electronics Technical Marketing Multi-channel Marketing Partnership Marketing Computer Security Competitive Marketing... Program Management Green Marketing Smart Grid Semiconductors Software Marketing Corporate Sustainability Competitive Analysis Non-profit Marketing Firmware Intel Start-ups Small Business Film Production Corporate Social... Cross-functional Team... Leadership Public Speaking Microsoft Office Strategic Planning Social Media Digital Marketing Social Media Marketing Business Development Enterprise Software Market Research Cloud Marketing See 32+     See less Education IMD (International Institute for Management Development) - Business Programs Certificate 2012  – 2012 The University of Texas at Austin Certificate 2012  – 2012 University of Strathclyde BA (Honours) 1990  – 1994 KEDGE Business School 1992  – 1993 IMD (International Institute for Management Development) - Business Programs Certificate 2012  – 2012 IMD (International Institute for Management Development) - Business Programs Certificate 2012  – 2012 IMD (International Institute for Management Development) - Business Programs Certificate 2012  – 2012 The University of Texas at Austin Certificate 2012  – 2012 The University of Texas at Austin Certificate 2012  – 2012 The University of Texas at Austin Certificate 2012  – 2012 University of Strathclyde BA (Honours) 1990  – 1994 University of Strathclyde BA (Honours) 1990  – 1994 University of Strathclyde BA (Honours) 1990  – 1994 KEDGE Business School 1992  – 1993 KEDGE Business School 1992  – 1993 KEDGE Business School 1992  – 1993 Honors & Awards ", "Summary Technical sales and business development executive with 20+ years of experience creating value for customers, building sales organizations, and driving revenue growth in venture-backed through Fortune 500 Companies beginining with Intel. \n \n \nBased in Bay Area and Research Triangle Park, North Carolina \n \n- High growth revenue and profit in technology markets. \n- Sales and sales management of direct, rep sales organizations and distribution. \n- Business stratgey development and execution. \n- Organizational development: recruiting, training, mentoring , performance management. \n- Global account management. \n- Successful track record with start-up or turn-around situations. \n \nSpecialties: Direct sales to C-level executives on the following technologies and markets: \n \n- Semiconductors: microprocessors, multicore, SoC, memory, communication, ASIC ICs. \n \n- Embedded system design (SoC): processor cores, memory subsystems, software. \n \n- Software: embedded systems, networking, communication protocols. \n \n- Markets: Communication service providers, enterprise computing, wireless, medical. Summary Technical sales and business development executive with 20+ years of experience creating value for customers, building sales organizations, and driving revenue growth in venture-backed through Fortune 500 Companies beginining with Intel. \n \n \nBased in Bay Area and Research Triangle Park, North Carolina \n \n- High growth revenue and profit in technology markets. \n- Sales and sales management of direct, rep sales organizations and distribution. \n- Business stratgey development and execution. \n- Organizational development: recruiting, training, mentoring , performance management. \n- Global account management. \n- Successful track record with start-up or turn-around situations. \n \nSpecialties: Direct sales to C-level executives on the following technologies and markets: \n \n- Semiconductors: microprocessors, multicore, SoC, memory, communication, ASIC ICs. \n \n- Embedded system design (SoC): processor cores, memory subsystems, software. \n \n- Software: embedded systems, networking, communication protocols. \n \n- Markets: Communication service providers, enterprise computing, wireless, medical. Technical sales and business development executive with 20+ years of experience creating value for customers, building sales organizations, and driving revenue growth in venture-backed through Fortune 500 Companies beginining with Intel. \n \n \nBased in Bay Area and Research Triangle Park, North Carolina \n \n- High growth revenue and profit in technology markets. \n- Sales and sales management of direct, rep sales organizations and distribution. \n- Business stratgey development and execution. \n- Organizational development: recruiting, training, mentoring , performance management. \n- Global account management. \n- Successful track record with start-up or turn-around situations. \n \nSpecialties: Direct sales to C-level executives on the following technologies and markets: \n \n- Semiconductors: microprocessors, multicore, SoC, memory, communication, ASIC ICs. \n \n- Embedded system design (SoC): processor cores, memory subsystems, software. \n \n- Software: embedded systems, networking, communication protocols. \n \n- Markets: Communication service providers, enterprise computing, wireless, medical. Technical sales and business development executive with 20+ years of experience creating value for customers, building sales organizations, and driving revenue growth in venture-backed through Fortune 500 Companies beginining with Intel. \n \n \nBased in Bay Area and Research Triangle Park, North Carolina \n \n- High growth revenue and profit in technology markets. \n- Sales and sales management of direct, rep sales organizations and distribution. \n- Business stratgey development and execution. \n- Organizational development: recruiting, training, mentoring , performance management. \n- Global account management. \n- Successful track record with start-up or turn-around situations. \n \nSpecialties: Direct sales to C-level executives on the following technologies and markets: \n \n- Semiconductors: microprocessors, multicore, SoC, memory, communication, ASIC ICs. \n \n- Embedded system design (SoC): processor cores, memory subsystems, software. \n \n- Software: embedded systems, networking, communication protocols. \n \n- Markets: Communication service providers, enterprise computing, wireless, medical. Experience Senior Manager Philips Research and IP&S October 2011  – Present (3 years 11 months) Establishing business in North America for next generation media interaction technology used in connected or smart TV. Penetrating leading MSOs (cable operators, satellite operators, telecos) and their eco-system (STB chip developers, content providers, UI developers). Sales and Marketing Consulting Caustic Graphics Inc. January 2010  –  November 2011  (1 year 11 months) San Francisco Caustic Graphics is developing breakthrough massively accelerated raytracing system used by the entertainment, advertising, gaming and design industries. World Wide Director of Sales Diablo Technologies January 2008  –  January 2010  (2 years 1 month) Research Triangle Park, NC Diablo Technology provides semiconductor for high-speed serial interconnect between processors and memory subsystems. Target customers are major server OEMS. Director Business Development DSP Division LSI Corporation May 2005  –  January 2008  (2 years 9 months) Dallas Licensed configurabable DSP cores and software applications. Division sold to Verisilicon Director of Sales NEC Electronics September 1987  –  December 1998  (11 years 4 months) Research Triangle Park, NC Managed corporate sales for global accounts: IBM, HP, Intel, Automotive. Managed $300M/yr in revenue and 30 person sales organization. Technology focus: full custom semis, ASIC, microprocessors, memory, wireless, displays, optoelectronics. Strategic Marketing Manager Intel Corporation 1977  –  1987  (10 years) Technical sales and marketing for high end processors Senior Manager Philips Research and IP&S October 2011  – Present (3 years 11 months) Establishing business in North America for next generation media interaction technology used in connected or smart TV. Penetrating leading MSOs (cable operators, satellite operators, telecos) and their eco-system (STB chip developers, content providers, UI developers). Senior Manager Philips Research and IP&S October 2011  – Present (3 years 11 months) Establishing business in North America for next generation media interaction technology used in connected or smart TV. Penetrating leading MSOs (cable operators, satellite operators, telecos) and their eco-system (STB chip developers, content providers, UI developers). Sales and Marketing Consulting Caustic Graphics Inc. January 2010  –  November 2011  (1 year 11 months) San Francisco Caustic Graphics is developing breakthrough massively accelerated raytracing system used by the entertainment, advertising, gaming and design industries. Sales and Marketing Consulting Caustic Graphics Inc. January 2010  –  November 2011  (1 year 11 months) San Francisco Caustic Graphics is developing breakthrough massively accelerated raytracing system used by the entertainment, advertising, gaming and design industries. World Wide Director of Sales Diablo Technologies January 2008  –  January 2010  (2 years 1 month) Research Triangle Park, NC Diablo Technology provides semiconductor for high-speed serial interconnect between processors and memory subsystems. Target customers are major server OEMS. World Wide Director of Sales Diablo Technologies January 2008  –  January 2010  (2 years 1 month) Research Triangle Park, NC Diablo Technology provides semiconductor for high-speed serial interconnect between processors and memory subsystems. Target customers are major server OEMS. Director Business Development DSP Division LSI Corporation May 2005  –  January 2008  (2 years 9 months) Dallas Licensed configurabable DSP cores and software applications. Division sold to Verisilicon Director Business Development DSP Division LSI Corporation May 2005  –  January 2008  (2 years 9 months) Dallas Licensed configurabable DSP cores and software applications. Division sold to Verisilicon Director of Sales NEC Electronics September 1987  –  December 1998  (11 years 4 months) Research Triangle Park, NC Managed corporate sales for global accounts: IBM, HP, Intel, Automotive. Managed $300M/yr in revenue and 30 person sales organization. Technology focus: full custom semis, ASIC, microprocessors, memory, wireless, displays, optoelectronics. Director of Sales NEC Electronics September 1987  –  December 1998  (11 years 4 months) Research Triangle Park, NC Managed corporate sales for global accounts: IBM, HP, Intel, Automotive. Managed $300M/yr in revenue and 30 person sales organization. Technology focus: full custom semis, ASIC, microprocessors, memory, wireless, displays, optoelectronics. Strategic Marketing Manager Intel Corporation 1977  –  1987  (10 years) Technical sales and marketing for high end processors Strategic Marketing Manager Intel Corporation 1977  –  1987  (10 years) Technical sales and marketing for high end processors Skills Wireless Storage Enterprise Software Semiconductors Embedded Systems Skills  Wireless Storage Enterprise Software Semiconductors Embedded Systems Wireless Storage Enterprise Software Semiconductors Embedded Systems Wireless Storage Enterprise Software Semiconductors Embedded Systems Education University of Illinois at Urbana-Champaign MS Electrical Engineering University of Illinois at Urbana-Champaign BS Computer Engineering MS Thesis was floating point hardware acceleration University of Illinois at Urbana-Champaign MS Electrical Engineering University of Illinois at Urbana-Champaign MS Electrical Engineering University of Illinois at Urbana-Champaign MS Electrical Engineering University of Illinois at Urbana-Champaign BS Computer Engineering MS Thesis was floating point hardware acceleration University of Illinois at Urbana-Champaign BS Computer Engineering MS Thesis was floating point hardware acceleration University of Illinois at Urbana-Champaign BS Computer Engineering MS Thesis was floating point hardware acceleration Honors & Awards Additional Honors & Awards College Teaching Credential for State of California in Computer and Related Technologies. \nMinimicro Conference: Technical paper on microprocessor based system architecture trade-offs Additional Honors & Awards College Teaching Credential for State of California in Computer and Related Technologies. \nMinimicro Conference: Technical paper on microprocessor based system architecture trade-offs Additional Honors & Awards College Teaching Credential for State of California in Computer and Related Technologies. \nMinimicro Conference: Technical paper on microprocessor based system architecture trade-offs Additional Honors & Awards College Teaching Credential for State of California in Computer and Related Technologies. \nMinimicro Conference: Technical paper on microprocessor based system architecture trade-offs ", "Summary As a globetrotting purveyor of international business, I've had the pleasure (and jet lag) of traveling to 45 countries globally. My passion is in creating successful businesses to grow sales on the global stage. \n \nCurrently I am balancing my time between two businesses that form a \"bridge\" between the U.S. and China--I'm the founder and CEO of NetBridge Global, a management consulting firm that helps US companies build successful businesses in China. I'm also the co-founder and Managing Partner of TrustUS LLC, an early-stage company that matches qualified Chinese investors with the highest quality investment projects in the U.S.  \n \nWith start-ups like NComputing or established companies like Intel, I drove and grew sales through channel sales, field marketing and strategic partner alliances.  \n \nI have an MBA from Haas Berkeley and a B.A. in economics from Pomona College and currently call California my home (at least for the moment). \n \nConnections are the life-blood of business development, so if I can't help you, I'm sure I know somebody who can. You can reach me at mark@beckford.net or on most social networking sites here at http://about.me/mbeckford. \n \nSpecialties: Global business/market/channel programs, corporate strategy, marketing, product positioning, entrepreneurship, employee development, corporate communications, business plans, enterprise and consumers, social media. Summary As a globetrotting purveyor of international business, I've had the pleasure (and jet lag) of traveling to 45 countries globally. My passion is in creating successful businesses to grow sales on the global stage. \n \nCurrently I am balancing my time between two businesses that form a \"bridge\" between the U.S. and China--I'm the founder and CEO of NetBridge Global, a management consulting firm that helps US companies build successful businesses in China. I'm also the co-founder and Managing Partner of TrustUS LLC, an early-stage company that matches qualified Chinese investors with the highest quality investment projects in the U.S.  \n \nWith start-ups like NComputing or established companies like Intel, I drove and grew sales through channel sales, field marketing and strategic partner alliances.  \n \nI have an MBA from Haas Berkeley and a B.A. in economics from Pomona College and currently call California my home (at least for the moment). \n \nConnections are the life-blood of business development, so if I can't help you, I'm sure I know somebody who can. You can reach me at mark@beckford.net or on most social networking sites here at http://about.me/mbeckford. \n \nSpecialties: Global business/market/channel programs, corporate strategy, marketing, product positioning, entrepreneurship, employee development, corporate communications, business plans, enterprise and consumers, social media. As a globetrotting purveyor of international business, I've had the pleasure (and jet lag) of traveling to 45 countries globally. My passion is in creating successful businesses to grow sales on the global stage. \n \nCurrently I am balancing my time between two businesses that form a \"bridge\" between the U.S. and China--I'm the founder and CEO of NetBridge Global, a management consulting firm that helps US companies build successful businesses in China. I'm also the co-founder and Managing Partner of TrustUS LLC, an early-stage company that matches qualified Chinese investors with the highest quality investment projects in the U.S.  \n \nWith start-ups like NComputing or established companies like Intel, I drove and grew sales through channel sales, field marketing and strategic partner alliances.  \n \nI have an MBA from Haas Berkeley and a B.A. in economics from Pomona College and currently call California my home (at least for the moment). \n \nConnections are the life-blood of business development, so if I can't help you, I'm sure I know somebody who can. You can reach me at mark@beckford.net or on most social networking sites here at http://about.me/mbeckford. \n \nSpecialties: Global business/market/channel programs, corporate strategy, marketing, product positioning, entrepreneurship, employee development, corporate communications, business plans, enterprise and consumers, social media. As a globetrotting purveyor of international business, I've had the pleasure (and jet lag) of traveling to 45 countries globally. My passion is in creating successful businesses to grow sales on the global stage. \n \nCurrently I am balancing my time between two businesses that form a \"bridge\" between the U.S. and China--I'm the founder and CEO of NetBridge Global, a management consulting firm that helps US companies build successful businesses in China. I'm also the co-founder and Managing Partner of TrustUS LLC, an early-stage company that matches qualified Chinese investors with the highest quality investment projects in the U.S.  \n \nWith start-ups like NComputing or established companies like Intel, I drove and grew sales through channel sales, field marketing and strategic partner alliances.  \n \nI have an MBA from Haas Berkeley and a B.A. in economics from Pomona College and currently call California my home (at least for the moment). \n \nConnections are the life-blood of business development, so if I can't help you, I'm sure I know somebody who can. You can reach me at mark@beckford.net or on most social networking sites here at http://about.me/mbeckford. \n \nSpecialties: Global business/market/channel programs, corporate strategy, marketing, product positioning, entrepreneurship, employee development, corporate communications, business plans, enterprise and consumers, social media. Experience CEO NetBridge Global, Inc. July 2011  – Present (4 years 2 months) San Francisco, CA NetBridge Global is an international business development firm co-located in San Francisco, Beijing, and Shanghai helping US technology companies grow their business in China. Select client projects include: \n* China partner introductions for an online social network for entrepreneurs.  \n* Comprehensive market analysis and market entry plan for a leading cloud file-sharing company.  \n* Restructuring of the City of San Francisco‘s China trade and investment program. Co-Founder TrustUS LLC June 2013  –  December 2014  (1 year 7 months) Beijing, China TrustUS LLC matches qualified high net-worth Chinese investors with high-quality investment opportunities and professional services in the real estate, venture capital, education and healthcare sectors. \n* Conceived business model and plan resulting in signing three Chinese investors. \n* Secured U.S. and China partners and developed new channel with wealth management firms. \n* Hosted investor visits to U.S. Vice President -- China Sales and Marketing NComputing November 2009  –  June 2011  (1 year 8 months) Beijing/Shanghai, China Responsible for establishing and growing NComputing's sales in China delivering ~$1M in revenue in the first year of sales. \n* Signed the #1 IT distributor (Digital China) and #1 server distributor (Power Leader). \n* Developed a strategic alliance with China's central Ministry of Education (MOE). \n* Developed partnerships with 10 provincial MOE's and their local channel partners. \n* Secured a silicon design-win for an all-in-one LCD monitor at Great Wall, the #2 monitor vendor. Vice President -- Global Business Development NComputing November 2008  –  October 2009  (1 year) Redwood City, CA Led a global sales and marketing team to develop large computer deals and strategic alliances in 50+ countries. \n* Resurrected and won $1M+ education deployment in Macedonia.  \n* Negotiated exclusive reseller agreement with Haier (a large Chinese multi-national company). \n* Doubled large education deal pipeline from 20 to >40 deals, tripling value to >$50M. \n* Scaled sales efforts through strategic partnerships (Dell, LG, Cisco) and flagship development agencies (UN, World Bank, USAID). Managing Director -- China Business Development Intel Corporation December 2006  –  2008  (2 years) Beijing, China Recruited by Intel China VP/GM to restore Intel’s market share position in Internet Cafés, one of China’s largest defined computer segments (share had plummeted from 70% to 30% in previous three years).  \n* Rapidly developed turnaround strategy and lead team of 10 functional managers and 150 staff. \n* Delivered $80M in incremental revenue doubling market share to 60% within one year \n* Steered startup and launch of government / industry consortium to influence China's computer energy policies (the China Electronics Energy Savings Council). General Manager -- Emerging Markets Platform Group Intel Corporation February 2005  –  November 2006  (1 year 10 months) Shanghai, China Started a new global business venture in China to build and sell computer products designed specifically for the unique challenges in developing nations.  \n* Delivered >500,000 PC sales in 2006, with expected annual doubling / tripling of growth. \n* Grew revenue to >$75M for 2006 with business plan to reach $500M by 2010. \n* Established HQ and design center in China and three design centers in India, Africa, Brazil. \n* Directly managed 150+ employees in marketing, engineering, and product design, and managed >100 matrixed sales teams across 15 countries. Chief of Staff to Vice President of Sales and Marketing Intel Corporation March 2003  –  January 2005  (1 year 11 months) Santa Clara, CA Advisor and key executive to Senior VP (one of top 15 at Intel) in managing operations for a $35B business / 5000 person sales & marketing group. \n* Drove strategy, planning, and operations for VP-level sales staff.  \n* Managed strategic projects, including five-year business plan to reach $50B in revenue  \n* Drafted, prepared, and approved VP's internal / public communications including keynote speeches, internal senior executive presentations, written articles, and press interviews. Director, Global Channel Marketing Intel Corporation, Reseller Products Group October 2000  –  March 2003  (2 years 6 months) Folsom, CA Managed $4B annual revenue sales / marketing effort and worldwide staff of ~100 corporate and regional marketing personnel.  \n* Achieved double digit sales growth while overall industry stagnated. \n* Tripled the number of system builders affiliated with Intel from 40,000 to 120,000. \n* Expanded Intel \"presence\" in emerging market cities 4X (growing from 150 to 600). \n* Spiked Intel’s market share from to high 70s in developing countries.  \n* Drove strategic effort that tripled channel marketing budget in a period of major corporate cuts. Marketing Manager -- Global Server Channels Intel Corporation November 1997  –  September 2000  (2 years 11 months) Portland, Oregon Area Led worldwide marketing campaigns and programs to grow server channel business. \n* Drove a 10X growth in Intel’s server channel business worldwide from 1997 to 2000.  \n* Promoted in 1999 to manage the server marketing team. Strategic Marketing Manager Intel Corporation June 1996  –  October 1997  (1 year 5 months) Drove market analysis and modeling for Intel's enterprise server business group. Conceived and drove an online research and analysis capability to support multiple strategic initiatives for senior management. Assignments in Quality Assurance, Product Management, and Information Systems David Corporation June 1992  –  May 1994  (2 years) Risk management software development company Senior Analyst Freeman & Mills June 1989  –  May 1992  (3 years) Los Angeles, CA Provided consulting services to corporate management and law firms. CEO NetBridge Global, Inc. July 2011  – Present (4 years 2 months) San Francisco, CA NetBridge Global is an international business development firm co-located in San Francisco, Beijing, and Shanghai helping US technology companies grow their business in China. Select client projects include: \n* China partner introductions for an online social network for entrepreneurs.  \n* Comprehensive market analysis and market entry plan for a leading cloud file-sharing company.  \n* Restructuring of the City of San Francisco‘s China trade and investment program. CEO NetBridge Global, Inc. July 2011  – Present (4 years 2 months) San Francisco, CA NetBridge Global is an international business development firm co-located in San Francisco, Beijing, and Shanghai helping US technology companies grow their business in China. Select client projects include: \n* China partner introductions for an online social network for entrepreneurs.  \n* Comprehensive market analysis and market entry plan for a leading cloud file-sharing company.  \n* Restructuring of the City of San Francisco‘s China trade and investment program. Co-Founder TrustUS LLC June 2013  –  December 2014  (1 year 7 months) Beijing, China TrustUS LLC matches qualified high net-worth Chinese investors with high-quality investment opportunities and professional services in the real estate, venture capital, education and healthcare sectors. \n* Conceived business model and plan resulting in signing three Chinese investors. \n* Secured U.S. and China partners and developed new channel with wealth management firms. \n* Hosted investor visits to U.S. Co-Founder TrustUS LLC June 2013  –  December 2014  (1 year 7 months) Beijing, China TrustUS LLC matches qualified high net-worth Chinese investors with high-quality investment opportunities and professional services in the real estate, venture capital, education and healthcare sectors. \n* Conceived business model and plan resulting in signing three Chinese investors. \n* Secured U.S. and China partners and developed new channel with wealth management firms. \n* Hosted investor visits to U.S. Vice President -- China Sales and Marketing NComputing November 2009  –  June 2011  (1 year 8 months) Beijing/Shanghai, China Responsible for establishing and growing NComputing's sales in China delivering ~$1M in revenue in the first year of sales. \n* Signed the #1 IT distributor (Digital China) and #1 server distributor (Power Leader). \n* Developed a strategic alliance with China's central Ministry of Education (MOE). \n* Developed partnerships with 10 provincial MOE's and their local channel partners. \n* Secured a silicon design-win for an all-in-one LCD monitor at Great Wall, the #2 monitor vendor. Vice President -- China Sales and Marketing NComputing November 2009  –  June 2011  (1 year 8 months) Beijing/Shanghai, China Responsible for establishing and growing NComputing's sales in China delivering ~$1M in revenue in the first year of sales. \n* Signed the #1 IT distributor (Digital China) and #1 server distributor (Power Leader). \n* Developed a strategic alliance with China's central Ministry of Education (MOE). \n* Developed partnerships with 10 provincial MOE's and their local channel partners. \n* Secured a silicon design-win for an all-in-one LCD monitor at Great Wall, the #2 monitor vendor. Vice President -- Global Business Development NComputing November 2008  –  October 2009  (1 year) Redwood City, CA Led a global sales and marketing team to develop large computer deals and strategic alliances in 50+ countries. \n* Resurrected and won $1M+ education deployment in Macedonia.  \n* Negotiated exclusive reseller agreement with Haier (a large Chinese multi-national company). \n* Doubled large education deal pipeline from 20 to >40 deals, tripling value to >$50M. \n* Scaled sales efforts through strategic partnerships (Dell, LG, Cisco) and flagship development agencies (UN, World Bank, USAID). Vice President -- Global Business Development NComputing November 2008  –  October 2009  (1 year) Redwood City, CA Led a global sales and marketing team to develop large computer deals and strategic alliances in 50+ countries. \n* Resurrected and won $1M+ education deployment in Macedonia.  \n* Negotiated exclusive reseller agreement with Haier (a large Chinese multi-national company). \n* Doubled large education deal pipeline from 20 to >40 deals, tripling value to >$50M. \n* Scaled sales efforts through strategic partnerships (Dell, LG, Cisco) and flagship development agencies (UN, World Bank, USAID). Managing Director -- China Business Development Intel Corporation December 2006  –  2008  (2 years) Beijing, China Recruited by Intel China VP/GM to restore Intel’s market share position in Internet Cafés, one of China’s largest defined computer segments (share had plummeted from 70% to 30% in previous three years).  \n* Rapidly developed turnaround strategy and lead team of 10 functional managers and 150 staff. \n* Delivered $80M in incremental revenue doubling market share to 60% within one year \n* Steered startup and launch of government / industry consortium to influence China's computer energy policies (the China Electronics Energy Savings Council). Managing Director -- China Business Development Intel Corporation December 2006  –  2008  (2 years) Beijing, China Recruited by Intel China VP/GM to restore Intel’s market share position in Internet Cafés, one of China’s largest defined computer segments (share had plummeted from 70% to 30% in previous three years).  \n* Rapidly developed turnaround strategy and lead team of 10 functional managers and 150 staff. \n* Delivered $80M in incremental revenue doubling market share to 60% within one year \n* Steered startup and launch of government / industry consortium to influence China's computer energy policies (the China Electronics Energy Savings Council). General Manager -- Emerging Markets Platform Group Intel Corporation February 2005  –  November 2006  (1 year 10 months) Shanghai, China Started a new global business venture in China to build and sell computer products designed specifically for the unique challenges in developing nations.  \n* Delivered >500,000 PC sales in 2006, with expected annual doubling / tripling of growth. \n* Grew revenue to >$75M for 2006 with business plan to reach $500M by 2010. \n* Established HQ and design center in China and three design centers in India, Africa, Brazil. \n* Directly managed 150+ employees in marketing, engineering, and product design, and managed >100 matrixed sales teams across 15 countries. General Manager -- Emerging Markets Platform Group Intel Corporation February 2005  –  November 2006  (1 year 10 months) Shanghai, China Started a new global business venture in China to build and sell computer products designed specifically for the unique challenges in developing nations.  \n* Delivered >500,000 PC sales in 2006, with expected annual doubling / tripling of growth. \n* Grew revenue to >$75M for 2006 with business plan to reach $500M by 2010. \n* Established HQ and design center in China and three design centers in India, Africa, Brazil. \n* Directly managed 150+ employees in marketing, engineering, and product design, and managed >100 matrixed sales teams across 15 countries. Chief of Staff to Vice President of Sales and Marketing Intel Corporation March 2003  –  January 2005  (1 year 11 months) Santa Clara, CA Advisor and key executive to Senior VP (one of top 15 at Intel) in managing operations for a $35B business / 5000 person sales & marketing group. \n* Drove strategy, planning, and operations for VP-level sales staff.  \n* Managed strategic projects, including five-year business plan to reach $50B in revenue  \n* Drafted, prepared, and approved VP's internal / public communications including keynote speeches, internal senior executive presentations, written articles, and press interviews. Chief of Staff to Vice President of Sales and Marketing Intel Corporation March 2003  –  January 2005  (1 year 11 months) Santa Clara, CA Advisor and key executive to Senior VP (one of top 15 at Intel) in managing operations for a $35B business / 5000 person sales & marketing group. \n* Drove strategy, planning, and operations for VP-level sales staff.  \n* Managed strategic projects, including five-year business plan to reach $50B in revenue  \n* Drafted, prepared, and approved VP's internal / public communications including keynote speeches, internal senior executive presentations, written articles, and press interviews. Director, Global Channel Marketing Intel Corporation, Reseller Products Group October 2000  –  March 2003  (2 years 6 months) Folsom, CA Managed $4B annual revenue sales / marketing effort and worldwide staff of ~100 corporate and regional marketing personnel.  \n* Achieved double digit sales growth while overall industry stagnated. \n* Tripled the number of system builders affiliated with Intel from 40,000 to 120,000. \n* Expanded Intel \"presence\" in emerging market cities 4X (growing from 150 to 600). \n* Spiked Intel’s market share from to high 70s in developing countries.  \n* Drove strategic effort that tripled channel marketing budget in a period of major corporate cuts. Director, Global Channel Marketing Intel Corporation, Reseller Products Group October 2000  –  March 2003  (2 years 6 months) Folsom, CA Managed $4B annual revenue sales / marketing effort and worldwide staff of ~100 corporate and regional marketing personnel.  \n* Achieved double digit sales growth while overall industry stagnated. \n* Tripled the number of system builders affiliated with Intel from 40,000 to 120,000. \n* Expanded Intel \"presence\" in emerging market cities 4X (growing from 150 to 600). \n* Spiked Intel’s market share from to high 70s in developing countries.  \n* Drove strategic effort that tripled channel marketing budget in a period of major corporate cuts. Marketing Manager -- Global Server Channels Intel Corporation November 1997  –  September 2000  (2 years 11 months) Portland, Oregon Area Led worldwide marketing campaigns and programs to grow server channel business. \n* Drove a 10X growth in Intel’s server channel business worldwide from 1997 to 2000.  \n* Promoted in 1999 to manage the server marketing team. Marketing Manager -- Global Server Channels Intel Corporation November 1997  –  September 2000  (2 years 11 months) Portland, Oregon Area Led worldwide marketing campaigns and programs to grow server channel business. \n* Drove a 10X growth in Intel’s server channel business worldwide from 1997 to 2000.  \n* Promoted in 1999 to manage the server marketing team. Strategic Marketing Manager Intel Corporation June 1996  –  October 1997  (1 year 5 months) Drove market analysis and modeling for Intel's enterprise server business group. Conceived and drove an online research and analysis capability to support multiple strategic initiatives for senior management. Strategic Marketing Manager Intel Corporation June 1996  –  October 1997  (1 year 5 months) Drove market analysis and modeling for Intel's enterprise server business group. Conceived and drove an online research and analysis capability to support multiple strategic initiatives for senior management. Assignments in Quality Assurance, Product Management, and Information Systems David Corporation June 1992  –  May 1994  (2 years) Risk management software development company Assignments in Quality Assurance, Product Management, and Information Systems David Corporation June 1992  –  May 1994  (2 years) Risk management software development company Senior Analyst Freeman & Mills June 1989  –  May 1992  (3 years) Los Angeles, CA Provided consulting services to corporate management and law firms. Senior Analyst Freeman & Mills June 1989  –  May 1992  (3 years) Los Angeles, CA Provided consulting services to corporate management and law firms. Languages   Skills Strategic Partnerships Start-ups Business Strategy Business Development Entrepreneurship Product Management Go-to-market Strategy Strategic Planning New Business Development Marketing Strategy Channel Partners China Business... Business Planning Team Building Marketing Business Alliances International Business Channel Management Consulting Executive Management Global Business... Corporate Development Segmentation Management Consulting Semiconductors Team Leadership Salesforce.com Product Marketing Leadership Program Management Multi-channel Marketing Cross-functional Team... International Sales Competitive Analysis Venture Capital Partner Management Mobile Devices SaaS E-commerce Cloud Computing People Management Market Analysis Strategy Sales Management Thought Leadership See 31+     See less Skills  Strategic Partnerships Start-ups Business Strategy Business Development Entrepreneurship Product Management Go-to-market Strategy Strategic Planning New Business Development Marketing Strategy Channel Partners China Business... Business Planning Team Building Marketing Business Alliances International Business Channel Management Consulting Executive Management Global Business... Corporate Development Segmentation Management Consulting Semiconductors Team Leadership Salesforce.com Product Marketing Leadership Program Management Multi-channel Marketing Cross-functional Team... International Sales Competitive Analysis Venture Capital Partner Management Mobile Devices SaaS E-commerce Cloud Computing People Management Market Analysis Strategy Sales Management Thought Leadership See 31+     See less Strategic Partnerships Start-ups Business Strategy Business Development Entrepreneurship Product Management Go-to-market Strategy Strategic Planning New Business Development Marketing Strategy Channel Partners China Business... Business Planning Team Building Marketing Business Alliances International Business Channel Management Consulting Executive Management Global Business... Corporate Development Segmentation Management Consulting Semiconductors Team Leadership Salesforce.com Product Marketing Leadership Program Management Multi-channel Marketing Cross-functional Team... International Sales Competitive Analysis Venture Capital Partner Management Mobile Devices SaaS E-commerce Cloud Computing People Management Market Analysis Strategy Sales Management Thought Leadership See 31+     See less Strategic Partnerships Start-ups Business Strategy Business Development Entrepreneurship Product Management Go-to-market Strategy Strategic Planning New Business Development Marketing Strategy Channel Partners China Business... Business Planning Team Building Marketing Business Alliances International Business Channel Management Consulting Executive Management Global Business... Corporate Development Segmentation Management Consulting Semiconductors Team Leadership Salesforce.com Product Marketing Leadership Program Management Multi-channel Marketing Cross-functional Team... International Sales Competitive Analysis Venture Capital Partner Management Mobile Devices SaaS E-commerce Cloud Computing People Management Market Analysis Strategy Sales Management Thought Leadership See 31+     See less Education University of California, Berkeley, Haas School of Business MBA,  Marketing ,  International Business 1994  – 1996 Activities and Societies:  Entrepreneurship Pomona College BA,  Economics 1985  – 1989 Activities and Societies:  Sigma Tau Fraternity (President) University of California, Berkeley, Haas School of Business MBA,  Marketing ,  International Business 1994  – 1996 Activities and Societies:  Entrepreneurship University of California, Berkeley, Haas School of Business MBA,  Marketing ,  International Business 1994  – 1996 Activities and Societies:  Entrepreneurship University of California, Berkeley, Haas School of Business MBA,  Marketing ,  International Business 1994  – 1996 Activities and Societies:  Entrepreneurship Pomona College BA,  Economics 1985  – 1989 Activities and Societies:  Sigma Tau Fraternity (President) Pomona College BA,  Economics 1985  – 1989 Activities and Societies:  Sigma Tau Fraternity (President) Pomona College BA,  Economics 1985  – 1989 Activities and Societies:  Sigma Tau Fraternity (President) Honors & Awards Honorary Head Master Henan Province's Ministry of Education October 2010 Awarded during the launch of NComputing's \"cloud\" computer lab in a rural elementary school in Henan Province.  \n \n\"In order to strengthen strengthen Yuanyang Nan Jie school's international education and cooperation, we cordially invite Mark Beckford, Vice President of NComputing, Inc. to become our school's honorary school master.\" Intel Achievement Award - 2002 Intel Corporation February 2002 Awarded for \"Achieving significant sales and market segment share gains through emerging market expansion initiatives.\" \n \nThe Intel Achievement Award (IAA) is Intel's most prestigious award given to select teams that delivered outstanding results in a specific year. 100's of nominations are submitted each year with only a handful winning. The awarded included a trip for two to San Diego's Del Coronado Hotel for a weekend to attend the award's banquet. Intel Achievement Award - 1999 Intel Corporation February 1999 Awarded for \"Outstanding execution in establishing Intel as the preferred server building block supplier to the channel.\" \n \nThe Intel Achievement Award (IAA) is Intel's most prestigious award given to select teams that delivered outstanding results in a specific year. 100's of nominations are submitted each year with only a handful winning. The awarded included a trip for two to San Diego's Del Coronado Hotel for a weekend to attend the award's banquet. Eagle Scout Boy Scouts of America August 1984 Honorary Head Master Henan Province's Ministry of Education October 2010 Awarded during the launch of NComputing's \"cloud\" computer lab in a rural elementary school in Henan Province.  \n \n\"In order to strengthen strengthen Yuanyang Nan Jie school's international education and cooperation, we cordially invite Mark Beckford, Vice President of NComputing, Inc. to become our school's honorary school master.\" Honorary Head Master Henan Province's Ministry of Education October 2010 Awarded during the launch of NComputing's \"cloud\" computer lab in a rural elementary school in Henan Province.  \n \n\"In order to strengthen strengthen Yuanyang Nan Jie school's international education and cooperation, we cordially invite Mark Beckford, Vice President of NComputing, Inc. to become our school's honorary school master.\" Honorary Head Master Henan Province's Ministry of Education October 2010 Awarded during the launch of NComputing's \"cloud\" computer lab in a rural elementary school in Henan Province.  \n \n\"In order to strengthen strengthen Yuanyang Nan Jie school's international education and cooperation, we cordially invite Mark Beckford, Vice President of NComputing, Inc. to become our school's honorary school master.\" Intel Achievement Award - 2002 Intel Corporation February 2002 Awarded for \"Achieving significant sales and market segment share gains through emerging market expansion initiatives.\" \n \nThe Intel Achievement Award (IAA) is Intel's most prestigious award given to select teams that delivered outstanding results in a specific year. 100's of nominations are submitted each year with only a handful winning. The awarded included a trip for two to San Diego's Del Coronado Hotel for a weekend to attend the award's banquet. Intel Achievement Award - 2002 Intel Corporation February 2002 Awarded for \"Achieving significant sales and market segment share gains through emerging market expansion initiatives.\" \n \nThe Intel Achievement Award (IAA) is Intel's most prestigious award given to select teams that delivered outstanding results in a specific year. 100's of nominations are submitted each year with only a handful winning. The awarded included a trip for two to San Diego's Del Coronado Hotel for a weekend to attend the award's banquet. Intel Achievement Award - 2002 Intel Corporation February 2002 Awarded for \"Achieving significant sales and market segment share gains through emerging market expansion initiatives.\" \n \nThe Intel Achievement Award (IAA) is Intel's most prestigious award given to select teams that delivered outstanding results in a specific year. 100's of nominations are submitted each year with only a handful winning. The awarded included a trip for two to San Diego's Del Coronado Hotel for a weekend to attend the award's banquet. Intel Achievement Award - 1999 Intel Corporation February 1999 Awarded for \"Outstanding execution in establishing Intel as the preferred server building block supplier to the channel.\" \n \nThe Intel Achievement Award (IAA) is Intel's most prestigious award given to select teams that delivered outstanding results in a specific year. 100's of nominations are submitted each year with only a handful winning. The awarded included a trip for two to San Diego's Del Coronado Hotel for a weekend to attend the award's banquet. Intel Achievement Award - 1999 Intel Corporation February 1999 Awarded for \"Outstanding execution in establishing Intel as the preferred server building block supplier to the channel.\" \n \nThe Intel Achievement Award (IAA) is Intel's most prestigious award given to select teams that delivered outstanding results in a specific year. 100's of nominations are submitted each year with only a handful winning. The awarded included a trip for two to San Diego's Del Coronado Hotel for a weekend to attend the award's banquet. Intel Achievement Award - 1999 Intel Corporation February 1999 Awarded for \"Outstanding execution in establishing Intel as the preferred server building block supplier to the channel.\" \n \nThe Intel Achievement Award (IAA) is Intel's most prestigious award given to select teams that delivered outstanding results in a specific year. 100's of nominations are submitted each year with only a handful winning. The awarded included a trip for two to San Diego's Del Coronado Hotel for a weekend to attend the award's banquet. Eagle Scout Boy Scouts of America August 1984 Eagle Scout Boy Scouts of America August 1984 Eagle Scout Boy Scouts of America August 1984 ", "Skills Product Lifecycle... Segmentation Acquisition Integration Strategic Planning Product Management Go-to-market Strategy Product Marketing Strategic Partnerships Channel Competitive Analysis Start-ups Strategy Telecommunications Program Management Channel Partners SaaS Cross-functional Team... Partner Management Product Development Leadership Professional Services Executive Management Sales Selling Management Salesforce.com Business Alliances Lead Generation Cloud Computing Integrated Marketing Product Launch Enterprise Software Mergers & Acquisitions Multi-channel Marketing Demand Generation Business Development Positioning Mobile Devices P&L Management Marketing Strategy Market Analysis Solution Selling Storage Sales Enablement Business Strategy Marketing Networking Pre-sales Marketing Automation CRM See 35+     See less Skills  Product Lifecycle... Segmentation Acquisition Integration Strategic Planning Product Management Go-to-market Strategy Product Marketing Strategic Partnerships Channel Competitive Analysis Start-ups Strategy Telecommunications Program Management Channel Partners SaaS Cross-functional Team... Partner Management Product Development Leadership Professional Services Executive Management Sales Selling Management Salesforce.com Business Alliances Lead Generation Cloud Computing Integrated Marketing Product Launch Enterprise Software Mergers & Acquisitions Multi-channel Marketing Demand Generation Business Development Positioning Mobile Devices P&L Management Marketing Strategy Market Analysis Solution Selling Storage Sales Enablement Business Strategy Marketing Networking Pre-sales Marketing Automation CRM See 35+     See less Product Lifecycle... Segmentation Acquisition Integration Strategic Planning Product Management Go-to-market Strategy Product Marketing Strategic Partnerships Channel Competitive Analysis Start-ups Strategy Telecommunications Program Management Channel Partners SaaS Cross-functional Team... Partner Management Product Development Leadership Professional Services Executive Management Sales Selling Management Salesforce.com Business Alliances Lead Generation Cloud Computing Integrated Marketing Product Launch Enterprise Software Mergers & Acquisitions Multi-channel Marketing Demand Generation Business Development Positioning Mobile Devices P&L Management Marketing Strategy Market Analysis Solution Selling Storage Sales Enablement Business Strategy Marketing Networking Pre-sales Marketing Automation CRM See 35+     See less Product Lifecycle... Segmentation Acquisition Integration Strategic Planning Product Management Go-to-market Strategy Product Marketing Strategic Partnerships Channel Competitive Analysis Start-ups Strategy Telecommunications Program Management Channel Partners SaaS Cross-functional Team... Partner Management Product Development Leadership Professional Services Executive Management Sales Selling Management Salesforce.com Business Alliances Lead Generation Cloud Computing Integrated Marketing Product Launch Enterprise Software Mergers & Acquisitions Multi-channel Marketing Demand Generation Business Development Positioning Mobile Devices P&L Management Marketing Strategy Market Analysis Solution Selling Storage Sales Enablement Business Strategy Marketing Networking Pre-sales Marketing Automation CRM See 35+     See less ", "Skills Intel Debugging Embedded Systems Semiconductors Computer Architecture Software Project... Processors Technical Marketing Product Marketing Device Drivers ARM Business Development SoC ASIC Go-to-market Strategy System Architecture Product Management Competitive Analysis C Hardware Architecture Wireless Embedded Software IC Telecommunications Software Engineering Semiconductor Industry International Sales Firmware Business Strategy Bios Leadership See 16+     See less Skills  Intel Debugging Embedded Systems Semiconductors Computer Architecture Software Project... Processors Technical Marketing Product Marketing Device Drivers ARM Business Development SoC ASIC Go-to-market Strategy System Architecture Product Management Competitive Analysis C Hardware Architecture Wireless Embedded Software IC Telecommunications Software Engineering Semiconductor Industry International Sales Firmware Business Strategy Bios Leadership See 16+     See less Intel Debugging Embedded Systems Semiconductors Computer Architecture Software Project... Processors Technical Marketing Product Marketing Device Drivers ARM Business Development SoC ASIC Go-to-market Strategy System Architecture Product Management Competitive Analysis C Hardware Architecture Wireless Embedded Software IC Telecommunications Software Engineering Semiconductor Industry International Sales Firmware Business Strategy Bios Leadership See 16+     See less Intel Debugging Embedded Systems Semiconductors Computer Architecture Software Project... Processors Technical Marketing Product Marketing Device Drivers ARM Business Development SoC ASIC Go-to-market Strategy System Architecture Product Management Competitive Analysis C Hardware Architecture Wireless Embedded Software IC Telecommunications Software Engineering Semiconductor Industry International Sales Firmware Business Strategy Bios Leadership See 16+     See less ", "Summary An experienced technology executive, senior professional and entrepreneur, co-founder in a number of technology innovative start ups.  \n \nSpecialties: Telecom, Data Communications, Networking, Business Strategy, Business Development, Product Marketing, Product Development, Software Engineering, Sales & Marketing, Fundraising, Venture Capital, Business Angel, Entrepreneurship, Mobile Communications, Wireless Communications, Optical Communications, Optical Networking, Networking components, Semiconductor (VLSI, ASIC,Digital, Mixed Digital/Analog). Summary An experienced technology executive, senior professional and entrepreneur, co-founder in a number of technology innovative start ups.  \n \nSpecialties: Telecom, Data Communications, Networking, Business Strategy, Business Development, Product Marketing, Product Development, Software Engineering, Sales & Marketing, Fundraising, Venture Capital, Business Angel, Entrepreneurship, Mobile Communications, Wireless Communications, Optical Communications, Optical Networking, Networking components, Semiconductor (VLSI, ASIC,Digital, Mixed Digital/Analog). An experienced technology executive, senior professional and entrepreneur, co-founder in a number of technology innovative start ups.  \n \nSpecialties: Telecom, Data Communications, Networking, Business Strategy, Business Development, Product Marketing, Product Development, Software Engineering, Sales & Marketing, Fundraising, Venture Capital, Business Angel, Entrepreneurship, Mobile Communications, Wireless Communications, Optical Communications, Optical Networking, Networking components, Semiconductor (VLSI, ASIC,Digital, Mixed Digital/Analog). An experienced technology executive, senior professional and entrepreneur, co-founder in a number of technology innovative start ups.  \n \nSpecialties: Telecom, Data Communications, Networking, Business Strategy, Business Development, Product Marketing, Product Development, Software Engineering, Sales & Marketing, Fundraising, Venture Capital, Business Angel, Entrepreneurship, Mobile Communications, Wireless Communications, Optical Communications, Optical Networking, Networking components, Semiconductor (VLSI, ASIC,Digital, Mixed Digital/Analog). Experience Co-founder, Chairman Eyelead Software August 2007  – Present (8 years 1 month) Co-founder & Board Member Analogies S.A. January 2007  – Present (8 years 8 months) Co-founder & Partner Georet Ltd March 2006  – Present (9 years 6 months) Director, Product Development Citrix July 2013  –  March 2015  (1 year 9 months) Greece Vice Chairman of the Board Hellenic Semiconductor Industry Association (HSIA) February 2009  –  June 2013  (4 years 5 months) Greece Strategic Marketing Manager Intel Corporation, Communications Infrastructure Group, Optical-Networking Components Division March 2000  –  September 2006  (6 years 7 months) Business Development Manager Giga Hellas SA September 1999  –  April 2000  (8 months) Business Development Manager Synergy Systems S.A. January 1992  –  August 1999  (7 years 8 months) Co-founder, Chairman Eyelead Software August 2007  – Present (8 years 1 month) Co-founder, Chairman Eyelead Software August 2007  – Present (8 years 1 month) Co-founder & Board Member Analogies S.A. January 2007  – Present (8 years 8 months) Co-founder & Board Member Analogies S.A. January 2007  – Present (8 years 8 months) Co-founder & Partner Georet Ltd March 2006  – Present (9 years 6 months) Co-founder & Partner Georet Ltd March 2006  – Present (9 years 6 months) Director, Product Development Citrix July 2013  –  March 2015  (1 year 9 months) Greece Director, Product Development Citrix July 2013  –  March 2015  (1 year 9 months) Greece Vice Chairman of the Board Hellenic Semiconductor Industry Association (HSIA) February 2009  –  June 2013  (4 years 5 months) Greece Vice Chairman of the Board Hellenic Semiconductor Industry Association (HSIA) February 2009  –  June 2013  (4 years 5 months) Greece Strategic Marketing Manager Intel Corporation, Communications Infrastructure Group, Optical-Networking Components Division March 2000  –  September 2006  (6 years 7 months) Strategic Marketing Manager Intel Corporation, Communications Infrastructure Group, Optical-Networking Components Division March 2000  –  September 2006  (6 years 7 months) Business Development Manager Giga Hellas SA September 1999  –  April 2000  (8 months) Business Development Manager Giga Hellas SA September 1999  –  April 2000  (8 months) Business Development Manager Synergy Systems S.A. January 1992  –  August 1999  (7 years 8 months) Business Development Manager Synergy Systems S.A. January 1992  –  August 1999  (7 years 8 months) Languages English Full professional proficiency Greek Native or bilingual proficiency French Elementary proficiency English Full professional proficiency Greek Native or bilingual proficiency French Elementary proficiency English Full professional proficiency Greek Native or bilingual proficiency French Elementary proficiency Full professional proficiency Native or bilingual proficiency Elementary proficiency Skills Telecommunications Product Marketing Entrepreneurship Team Leadership Strategic Planning Operations Management Business Management Business Strategy New Business Development Product Management Semiconductors ASIC Cross-functional Team... Change Management Product Development Project Management Sales Management Management Business Development Marketing Strategy Manufacturing Team Management Strategic Partnerships Start-ups Marketing Team Building Embedded Systems Analog Venture Capital Strategy Electronics Business Planning Project Planning Organizational... Negotiation Mobile Devices International Sales IC Wireless EDA Go-to-market Strategy Digital Signal... Program Management Software Development Networking Integration Competitive Analysis Software Engineering See 33+     See less Skills  Telecommunications Product Marketing Entrepreneurship Team Leadership Strategic Planning Operations Management Business Management Business Strategy New Business Development Product Management Semiconductors ASIC Cross-functional Team... Change Management Product Development Project Management Sales Management Management Business Development Marketing Strategy Manufacturing Team Management Strategic Partnerships Start-ups Marketing Team Building Embedded Systems Analog Venture Capital Strategy Electronics Business Planning Project Planning Organizational... Negotiation Mobile Devices International Sales IC Wireless EDA Go-to-market Strategy Digital Signal... Program Management Software Development Networking Integration Competitive Analysis Software Engineering See 33+     See less Telecommunications Product Marketing Entrepreneurship Team Leadership Strategic Planning Operations Management Business Management Business Strategy New Business Development Product Management Semiconductors ASIC Cross-functional Team... Change Management Product Development Project Management Sales Management Management Business Development Marketing Strategy Manufacturing Team Management Strategic Partnerships Start-ups Marketing Team Building Embedded Systems Analog Venture Capital Strategy Electronics Business Planning Project Planning Organizational... Negotiation Mobile Devices International Sales IC Wireless EDA Go-to-market Strategy Digital Signal... Program Management Software Development Networking Integration Competitive Analysis Software Engineering See 33+     See less Telecommunications Product Marketing Entrepreneurship Team Leadership Strategic Planning Operations Management Business Management Business Strategy New Business Development Product Management Semiconductors ASIC Cross-functional Team... Change Management Product Development Project Management Sales Management Management Business Development Marketing Strategy Manufacturing Team Management Strategic Partnerships Start-ups Marketing Team Building Embedded Systems Analog Venture Capital Strategy Electronics Business Planning Project Planning Organizational... Negotiation Mobile Devices International Sales IC Wireless EDA Go-to-market Strategy Digital Signal... Program Management Software Development Networking Integration Competitive Analysis Software Engineering See 33+     See less Education Panepistimion Patron Diploma in Electrical and Computer Engineering (MSc) 1985  – 1990 Panepistimion Patron Diploma in Electrical and Computer Engineering (MSc) 1985  – 1990 Panepistimion Patron Diploma in Electrical and Computer Engineering (MSc) 1985  – 1990 Panepistimion Patron Diploma in Electrical and Computer Engineering (MSc) 1985  – 1990 ", "Experience Marketing Project Manager Qualcomm Incorporated 2011  – Present (4 years) Greater San Diego Area Product Manager DJO 2010  –  2011  (1 year) Vista, CA Product Marketing Manager LTS Group 2006  –  2008  (2 years) Greater San Diego Area Product Marketing Manager Kyocera Wireless Corp 2002  –  2005  (3 years) Strategic Marketing Manager Intel Corporation 2000  –  2001  (1 year) Marketing Manager Qualcomm Inc. 1994  –  2000  (6 years) Marketing Project Manager Qualcomm Incorporated 2011  – Present (4 years) Greater San Diego Area Marketing Project Manager Qualcomm Incorporated 2011  – Present (4 years) Greater San Diego Area Product Manager DJO 2010  –  2011  (1 year) Vista, CA Product Manager DJO 2010  –  2011  (1 year) Vista, CA Product Marketing Manager LTS Group 2006  –  2008  (2 years) Greater San Diego Area Product Marketing Manager LTS Group 2006  –  2008  (2 years) Greater San Diego Area Product Marketing Manager Kyocera Wireless Corp 2002  –  2005  (3 years) Product Marketing Manager Kyocera Wireless Corp 2002  –  2005  (3 years) Strategic Marketing Manager Intel Corporation 2000  –  2001  (1 year) Strategic Marketing Manager Intel Corporation 2000  –  2001  (1 year) Marketing Manager Qualcomm Inc. 1994  –  2000  (6 years) Marketing Manager Qualcomm Inc. 1994  –  2000  (6 years) Skills Product Marketing Project Management Product Management Competitive Analysis Market Research Telecommunications Product Development Product Launch Market Analysis Segmentation Cross-functional Team... Go-to-market Strategy Direct Marketing Management Start-ups Program Management Marketing Strategy Marketing Digital Marketing Business Development Medical Devices Account Management E-commerce Analytics Sales Operations Competitive Intelligence Budgets Market Planning CRM Marketing Communications SEO Product Lifecycle... Sales New Business Development International Marketing Mobile Devices Customer Satisfaction Strategic Partnerships Mobile Technology Mobile Marketing Customer Retention Strategy P&L Management Mobile Communications Wireless Marketing Management Advertising Forecasting B2B Analysis See 35+     See less Skills  Product Marketing Project Management Product Management Competitive Analysis Market Research Telecommunications Product Development Product Launch Market Analysis Segmentation Cross-functional Team... Go-to-market Strategy Direct Marketing Management Start-ups Program Management Marketing Strategy Marketing Digital Marketing Business Development Medical Devices Account Management E-commerce Analytics Sales Operations Competitive Intelligence Budgets Market Planning CRM Marketing Communications SEO Product Lifecycle... Sales New Business Development International Marketing Mobile Devices Customer Satisfaction Strategic Partnerships Mobile Technology Mobile Marketing Customer Retention Strategy P&L Management Mobile Communications Wireless Marketing Management Advertising Forecasting B2B Analysis See 35+     See less Product Marketing Project Management Product Management Competitive Analysis Market Research Telecommunications Product Development Product Launch Market Analysis Segmentation Cross-functional Team... Go-to-market Strategy Direct Marketing Management Start-ups Program Management Marketing Strategy Marketing Digital Marketing Business Development Medical Devices Account Management E-commerce Analytics Sales Operations Competitive Intelligence Budgets Market Planning CRM Marketing Communications SEO Product Lifecycle... Sales New Business Development International Marketing Mobile Devices Customer Satisfaction Strategic Partnerships Mobile Technology Mobile Marketing Customer Retention Strategy P&L Management Mobile Communications Wireless Marketing Management Advertising Forecasting B2B Analysis See 35+     See less Product Marketing Project Management Product Management Competitive Analysis Market Research Telecommunications Product Development Product Launch Market Analysis Segmentation Cross-functional Team... Go-to-market Strategy Direct Marketing Management Start-ups Program Management Marketing Strategy Marketing Digital Marketing Business Development Medical Devices Account Management E-commerce Analytics Sales Operations Competitive Intelligence Budgets Market Planning CRM Marketing Communications SEO Product Lifecycle... Sales New Business Development International Marketing Mobile Devices Customer Satisfaction Strategic Partnerships Mobile Technology Mobile Marketing Customer Retention Strategy P&L Management Mobile Communications Wireless Marketing Management Advertising Forecasting B2B Analysis See 35+     See less Education California State University-San Marcos Bachelor of Science 1995  – 1998 University of San Francisco Certification 2010  – 2011 California State University-San Marcos Bachelor of Science 1995  – 1998 California State University-San Marcos Bachelor of Science 1995  – 1998 California State University-San Marcos Bachelor of Science 1995  – 1998 University of San Francisco Certification 2010  – 2011 University of San Francisco Certification 2010  – 2011 University of San Francisco Certification 2010  – 2011 ", "Skills Product Marketing Cross-functional Team... Product Development Storage Hardware Product Management Channel Partners Strategy Start-ups Strategic Planning Business Strategy Data Center Cloud Computing Semiconductors Management Professional Services Go-to-market Strategy See 2+     See less Skills  Product Marketing Cross-functional Team... Product Development Storage Hardware Product Management Channel Partners Strategy Start-ups Strategic Planning Business Strategy Data Center Cloud Computing Semiconductors Management Professional Services Go-to-market Strategy See 2+     See less Product Marketing Cross-functional Team... Product Development Storage Hardware Product Management Channel Partners Strategy Start-ups Strategic Planning Business Strategy Data Center Cloud Computing Semiconductors Management Professional Services Go-to-market Strategy See 2+     See less Product Marketing Cross-functional Team... Product Development Storage Hardware Product Management Channel Partners Strategy Start-ups Strategic Planning Business Strategy Data Center Cloud Computing Semiconductors Management Professional Services Go-to-market Strategy See 2+     See less ", "Experience Vice President ShineOn August 2012  – Present (3 years 1 month) Vice President ShineOn August 2012  – Present (3 years 1 month) Vice President ShineOn August 2012  – Present (3 years 1 month) ", "Languages English Hindi English Hindi English Hindi Skills Strategy Business Development Competitive Analysis Product Management Cross-functional Team... Wireless Leadership Business Strategy Go-to-market Strategy Product Development Business Planning Product Marketing Mobile Devices New Business Development Marketing Strategy Telecommunications Semiconductors Program Management See 3+     See less Skills  Strategy Business Development Competitive Analysis Product Management Cross-functional Team... Wireless Leadership Business Strategy Go-to-market Strategy Product Development Business Planning Product Marketing Mobile Devices New Business Development Marketing Strategy Telecommunications Semiconductors Program Management See 3+     See less Strategy Business Development Competitive Analysis Product Management Cross-functional Team... Wireless Leadership Business Strategy Go-to-market Strategy Product Development Business Planning Product Marketing Mobile Devices New Business Development Marketing Strategy Telecommunications Semiconductors Program Management See 3+     See less Strategy Business Development Competitive Analysis Product Management Cross-functional Team... Wireless Leadership Business Strategy Go-to-market Strategy Product Development Business Planning Product Marketing Mobile Devices New Business Development Marketing Strategy Telecommunications Semiconductors Program Management See 3+     See less ", "Summary Customer oriented project manager. Practiced in coordination of geographically dispersed teams and experienced generating results in private, non-profit, education, and government sectors. Specializes in inspired strategy development and hands-on business management, from inception through roll-out. Communication skills focused on message consistency to drive brand recognition through media, print, and event participation. \n \nSpecialties:  \nProgram Creation \nContent Development \nSocial Media \nVendor Negotiations \nCommunity Building \nWebsite Management \nTechnical Editing Summary Customer oriented project manager. Practiced in coordination of geographically dispersed teams and experienced generating results in private, non-profit, education, and government sectors. Specializes in inspired strategy development and hands-on business management, from inception through roll-out. Communication skills focused on message consistency to drive brand recognition through media, print, and event participation. \n \nSpecialties:  \nProgram Creation \nContent Development \nSocial Media \nVendor Negotiations \nCommunity Building \nWebsite Management \nTechnical Editing Customer oriented project manager. Practiced in coordination of geographically dispersed teams and experienced generating results in private, non-profit, education, and government sectors. Specializes in inspired strategy development and hands-on business management, from inception through roll-out. Communication skills focused on message consistency to drive brand recognition through media, print, and event participation. \n \nSpecialties:  \nProgram Creation \nContent Development \nSocial Media \nVendor Negotiations \nCommunity Building \nWebsite Management \nTechnical Editing Customer oriented project manager. Practiced in coordination of geographically dispersed teams and experienced generating results in private, non-profit, education, and government sectors. Specializes in inspired strategy development and hands-on business management, from inception through roll-out. Communication skills focused on message consistency to drive brand recognition through media, print, and event participation. \n \nSpecialties:  \nProgram Creation \nContent Development \nSocial Media \nVendor Negotiations \nCommunity Building \nWebsite Management \nTechnical Editing Experience Strategic Marketing Manager Intel Corporation September 2011  –  August 2012  (1 year) Santa Clara, CA Researched industry intelligence to develop recruiting models for Independent Software Vendors. Positioned technical, enabling, and go-to-market program assets for new audience segments. Developed success story offering for program members including needs analysis and scale capabilities. Community Marketing Manager Intel May 2006  –  November 2011  (5 years 7 months) Produced software developer and academic focused programs to drive customer participation, user-generated content, and robust site evolution. Inspired viral expansion of Intel Software Network with a blend of traditional and social media marketing campaigns leveraging third party market niches. Expanded internal cross-group synergies, exploiting existing investments to develop new channels for leadership marketing. Designed and implemented world-wide contest strategy, including roll-out of platform requirements with engineering teams. Founded an academic grant program to distribute $10k quarterly for curriculum creation. Organized a non-profit alliance of industry and academics to speed integration of parallelism in undergraduate curricula. Editor, Promotions, Marketing, Product Development Intel Software and Solutions Group September 2000  –  May 2006  (5 years 9 months) Five distinct positions within the Software and Solutions Group -- \nBusiness Development: Product and service offerings to build the Intel Developer Services website.  \nMarketing Manger: Direct marketing, messaging and collateral creation both on and offline. \nStrategic Marcom: Corporate Communications including event planning, branding, and vendor management. \nManaging Website Editor: Technical Editing, site development, people management. \nCommunity Marketing: Web 2.0 marketing, community development, world-wide contest strategy and development. Marketing Manager PoliceOne/Praetorian Group February 2000  –  August 2000  (7 months) Developed on and off-line promotional tools to distribute over $100,000 of prizes. Implemented “refer a friend” incentive program and gathered over 4,000 sales leads for 25 corporate sponsors. Established and managed relationships with vendors, contractors and associations. Negotiated co-branding and secured funding for promotional products from major distributors. Designed and produced company collateral. Managed all in-house activities for a 5-month recruitment tour. Owner Re-Lovables October 1996  –  January 2000  (3 years 4 months) Conceived and established manufacturing company of socially-conscious children’s products; maintaining living business plan, conducting market and product research, design and cost price analysis for four product lines. Produced a branding strategy that successfully established the Re-Lovables trademark through marketing collateral, press materials and clear product differentiation; launching PR and Marketing campaigns which gained national media coverage. Negotiated contracts with suppliers, vendors, and customers; hiring and training employees, interns and contractors. Sold thousands of units through wholesale, retail, web, and mail order venues. Assistant Conference Planner International Association of Business Communicators 1995  –  1996  (1 year) Coordinated speakers and sponsors; producing contracts, direct mailings, expense tracking and follow-up for annual international event. Reviewed and edited event content; facilitating communications by providing on and off-site customer service in English and Spanish. Strategic Marketing Manager Intel Corporation September 2011  –  August 2012  (1 year) Santa Clara, CA Researched industry intelligence to develop recruiting models for Independent Software Vendors. Positioned technical, enabling, and go-to-market program assets for new audience segments. Developed success story offering for program members including needs analysis and scale capabilities. Strategic Marketing Manager Intel Corporation September 2011  –  August 2012  (1 year) Santa Clara, CA Researched industry intelligence to develop recruiting models for Independent Software Vendors. Positioned technical, enabling, and go-to-market program assets for new audience segments. Developed success story offering for program members including needs analysis and scale capabilities. Community Marketing Manager Intel May 2006  –  November 2011  (5 years 7 months) Produced software developer and academic focused programs to drive customer participation, user-generated content, and robust site evolution. Inspired viral expansion of Intel Software Network with a blend of traditional and social media marketing campaigns leveraging third party market niches. Expanded internal cross-group synergies, exploiting existing investments to develop new channels for leadership marketing. Designed and implemented world-wide contest strategy, including roll-out of platform requirements with engineering teams. Founded an academic grant program to distribute $10k quarterly for curriculum creation. Organized a non-profit alliance of industry and academics to speed integration of parallelism in undergraduate curricula. Community Marketing Manager Intel May 2006  –  November 2011  (5 years 7 months) Produced software developer and academic focused programs to drive customer participation, user-generated content, and robust site evolution. Inspired viral expansion of Intel Software Network with a blend of traditional and social media marketing campaigns leveraging third party market niches. Expanded internal cross-group synergies, exploiting existing investments to develop new channels for leadership marketing. Designed and implemented world-wide contest strategy, including roll-out of platform requirements with engineering teams. Founded an academic grant program to distribute $10k quarterly for curriculum creation. Organized a non-profit alliance of industry and academics to speed integration of parallelism in undergraduate curricula. Editor, Promotions, Marketing, Product Development Intel Software and Solutions Group September 2000  –  May 2006  (5 years 9 months) Five distinct positions within the Software and Solutions Group -- \nBusiness Development: Product and service offerings to build the Intel Developer Services website.  \nMarketing Manger: Direct marketing, messaging and collateral creation both on and offline. \nStrategic Marcom: Corporate Communications including event planning, branding, and vendor management. \nManaging Website Editor: Technical Editing, site development, people management. \nCommunity Marketing: Web 2.0 marketing, community development, world-wide contest strategy and development. Editor, Promotions, Marketing, Product Development Intel Software and Solutions Group September 2000  –  May 2006  (5 years 9 months) Five distinct positions within the Software and Solutions Group -- \nBusiness Development: Product and service offerings to build the Intel Developer Services website.  \nMarketing Manger: Direct marketing, messaging and collateral creation both on and offline. \nStrategic Marcom: Corporate Communications including event planning, branding, and vendor management. \nManaging Website Editor: Technical Editing, site development, people management. \nCommunity Marketing: Web 2.0 marketing, community development, world-wide contest strategy and development. Marketing Manager PoliceOne/Praetorian Group February 2000  –  August 2000  (7 months) Developed on and off-line promotional tools to distribute over $100,000 of prizes. Implemented “refer a friend” incentive program and gathered over 4,000 sales leads for 25 corporate sponsors. Established and managed relationships with vendors, contractors and associations. Negotiated co-branding and secured funding for promotional products from major distributors. Designed and produced company collateral. Managed all in-house activities for a 5-month recruitment tour. Marketing Manager PoliceOne/Praetorian Group February 2000  –  August 2000  (7 months) Developed on and off-line promotional tools to distribute over $100,000 of prizes. Implemented “refer a friend” incentive program and gathered over 4,000 sales leads for 25 corporate sponsors. Established and managed relationships with vendors, contractors and associations. Negotiated co-branding and secured funding for promotional products from major distributors. Designed and produced company collateral. Managed all in-house activities for a 5-month recruitment tour. Owner Re-Lovables October 1996  –  January 2000  (3 years 4 months) Conceived and established manufacturing company of socially-conscious children’s products; maintaining living business plan, conducting market and product research, design and cost price analysis for four product lines. Produced a branding strategy that successfully established the Re-Lovables trademark through marketing collateral, press materials and clear product differentiation; launching PR and Marketing campaigns which gained national media coverage. Negotiated contracts with suppliers, vendors, and customers; hiring and training employees, interns and contractors. Sold thousands of units through wholesale, retail, web, and mail order venues. Owner Re-Lovables October 1996  –  January 2000  (3 years 4 months) Conceived and established manufacturing company of socially-conscious children’s products; maintaining living business plan, conducting market and product research, design and cost price analysis for four product lines. Produced a branding strategy that successfully established the Re-Lovables trademark through marketing collateral, press materials and clear product differentiation; launching PR and Marketing campaigns which gained national media coverage. Negotiated contracts with suppliers, vendors, and customers; hiring and training employees, interns and contractors. Sold thousands of units through wholesale, retail, web, and mail order venues. Assistant Conference Planner International Association of Business Communicators 1995  –  1996  (1 year) Coordinated speakers and sponsors; producing contracts, direct mailings, expense tracking and follow-up for annual international event. Reviewed and edited event content; facilitating communications by providing on and off-site customer service in English and Spanish. Assistant Conference Planner International Association of Business Communicators 1995  –  1996  (1 year) Coordinated speakers and sponsors; producing contracts, direct mailings, expense tracking and follow-up for annual international event. Reviewed and edited event content; facilitating communications by providing on and off-site customer service in English and Spanish. Languages Spanish Spanish Spanish Skills Social Media Content Development Program Creation Technical Editing Community Building Messaging Product Marketing Intel Technical Writing Mobile Applications Product Management Program Management Mobile Devices Competitive Analysis Technical Marketing Online Advertising Strategic Partnerships Business Development Digital Marketing Entrepreneurship Cross-functional Team... Social Media Marketing Marketing Strategy Marketing Market Research See 10+     See less Skills  Social Media Content Development Program Creation Technical Editing Community Building Messaging Product Marketing Intel Technical Writing Mobile Applications Product Management Program Management Mobile Devices Competitive Analysis Technical Marketing Online Advertising Strategic Partnerships Business Development Digital Marketing Entrepreneurship Cross-functional Team... Social Media Marketing Marketing Strategy Marketing Market Research See 10+     See less Social Media Content Development Program Creation Technical Editing Community Building Messaging Product Marketing Intel Technical Writing Mobile Applications Product Management Program Management Mobile Devices Competitive Analysis Technical Marketing Online Advertising Strategic Partnerships Business Development Digital Marketing Entrepreneurship Cross-functional Team... Social Media Marketing Marketing Strategy Marketing Market Research See 10+     See less Social Media Content Development Program Creation Technical Editing Community Building Messaging Product Marketing Intel Technical Writing Mobile Applications Product Management Program Management Mobile Devices Competitive Analysis Technical Marketing Online Advertising Strategic Partnerships Business Development Digital Marketing Entrepreneurship Cross-functional Team... Social Media Marketing Marketing Strategy Marketing Market Research See 10+     See less Education University of California, Berkeley University of California, Berkeley Scripps College BA,  Psychology 1990  – 1994 San Francisco City College Certificate,  Small Business Administration 1997  – 1997 Self Designed Entrepreneurial MBA University of California, Berkeley University of California, Berkeley University of California, Berkeley University of California, Berkeley University of California, Berkeley University of California, Berkeley Scripps College BA,  Psychology 1990  – 1994 Scripps College BA,  Psychology 1990  – 1994 Scripps College BA,  Psychology 1990  – 1994 San Francisco City College Certificate,  Small Business Administration 1997  – 1997 Self Designed Entrepreneurial MBA San Francisco City College Certificate,  Small Business Administration 1997  – 1997 Self Designed Entrepreneurial MBA San Francisco City College Certificate,  Small Business Administration 1997  – 1997 Self Designed Entrepreneurial MBA Honors & Awards Phi Beta Kappa Theta of California March 1994 Sigma Xi Sigma Xi, the Scientific Research Society April 1994 Research Grant Office of the President, Scripps College May 1994 Phi Beta Kappa Theta of California March 1994 Phi Beta Kappa Theta of California March 1994 Phi Beta Kappa Theta of California March 1994 Sigma Xi Sigma Xi, the Scientific Research Society April 1994 Sigma Xi Sigma Xi, the Scientific Research Society April 1994 Sigma Xi Sigma Xi, the Scientific Research Society April 1994 Research Grant Office of the President, Scripps College May 1994 Research Grant Office of the President, Scripps College May 1994 Research Grant Office of the President, Scripps College May 1994 ", "Summary Accomplished senior executive with expertise in driving aggressive revenue and profitability growth in global high technology companies. 20 years of proven track record in developing and executing business strategies to create differentiation and launch innovative solutions that anticipate customer’s needs. \n \nExtensive experience in SaaS/Cloud, Software, Telecommunications, Energy (Oil & Gas), Financial and Real-Estate Services, Mobility, Web-Based Technology and Semiconductors. \n \nRecognized as a creative, global results-driven leader with the ability to manage change and break down complex business problems into tangible solutions. Proven success utilizing strong business acumen to take on new challenges and establish credibility in new markets. \n \nSkilled at stewardship of products from concept to launch. Leading a team of sales/hunters and business development leaders to identify and close millions in new business opportunities by building trusted advisor customer relationships. \n \nSpecialties: \n► General Management \n► Innovation and Product Management  \n► Sales and Marketing Management  \n► Business Transformation \n► Business and Market Development \n► Profit and Loss (P&L) Management \n► Mergers, Acquisitions & Strategic Partnerships \n► Vision and Strategy Development  \n► Leadership and Talent Development \n► Operations and Customer Service \n► Prospecting and Consultative Selling  \n \nCertified in Product Management and Marketing form multiple organizations and Agile (Scrum) Product Development Methodology. Summary Accomplished senior executive with expertise in driving aggressive revenue and profitability growth in global high technology companies. 20 years of proven track record in developing and executing business strategies to create differentiation and launch innovative solutions that anticipate customer’s needs. \n \nExtensive experience in SaaS/Cloud, Software, Telecommunications, Energy (Oil & Gas), Financial and Real-Estate Services, Mobility, Web-Based Technology and Semiconductors. \n \nRecognized as a creative, global results-driven leader with the ability to manage change and break down complex business problems into tangible solutions. Proven success utilizing strong business acumen to take on new challenges and establish credibility in new markets. \n \nSkilled at stewardship of products from concept to launch. Leading a team of sales/hunters and business development leaders to identify and close millions in new business opportunities by building trusted advisor customer relationships. \n \nSpecialties: \n► General Management \n► Innovation and Product Management  \n► Sales and Marketing Management  \n► Business Transformation \n► Business and Market Development \n► Profit and Loss (P&L) Management \n► Mergers, Acquisitions & Strategic Partnerships \n► Vision and Strategy Development  \n► Leadership and Talent Development \n► Operations and Customer Service \n► Prospecting and Consultative Selling  \n \nCertified in Product Management and Marketing form multiple organizations and Agile (Scrum) Product Development Methodology. Accomplished senior executive with expertise in driving aggressive revenue and profitability growth in global high technology companies. 20 years of proven track record in developing and executing business strategies to create differentiation and launch innovative solutions that anticipate customer’s needs. \n \nExtensive experience in SaaS/Cloud, Software, Telecommunications, Energy (Oil & Gas), Financial and Real-Estate Services, Mobility, Web-Based Technology and Semiconductors. \n \nRecognized as a creative, global results-driven leader with the ability to manage change and break down complex business problems into tangible solutions. Proven success utilizing strong business acumen to take on new challenges and establish credibility in new markets. \n \nSkilled at stewardship of products from concept to launch. Leading a team of sales/hunters and business development leaders to identify and close millions in new business opportunities by building trusted advisor customer relationships. \n \nSpecialties: \n► General Management \n► Innovation and Product Management  \n► Sales and Marketing Management  \n► Business Transformation \n► Business and Market Development \n► Profit and Loss (P&L) Management \n► Mergers, Acquisitions & Strategic Partnerships \n► Vision and Strategy Development  \n► Leadership and Talent Development \n► Operations and Customer Service \n► Prospecting and Consultative Selling  \n \nCertified in Product Management and Marketing form multiple organizations and Agile (Scrum) Product Development Methodology. Accomplished senior executive with expertise in driving aggressive revenue and profitability growth in global high technology companies. 20 years of proven track record in developing and executing business strategies to create differentiation and launch innovative solutions that anticipate customer’s needs. \n \nExtensive experience in SaaS/Cloud, Software, Telecommunications, Energy (Oil & Gas), Financial and Real-Estate Services, Mobility, Web-Based Technology and Semiconductors. \n \nRecognized as a creative, global results-driven leader with the ability to manage change and break down complex business problems into tangible solutions. Proven success utilizing strong business acumen to take on new challenges and establish credibility in new markets. \n \nSkilled at stewardship of products from concept to launch. Leading a team of sales/hunters and business development leaders to identify and close millions in new business opportunities by building trusted advisor customer relationships. \n \nSpecialties: \n► General Management \n► Innovation and Product Management  \n► Sales and Marketing Management  \n► Business Transformation \n► Business and Market Development \n► Profit and Loss (P&L) Management \n► Mergers, Acquisitions & Strategic Partnerships \n► Vision and Strategy Development  \n► Leadership and Talent Development \n► Operations and Customer Service \n► Prospecting and Consultative Selling  \n \nCertified in Product Management and Marketing form multiple organizations and Agile (Scrum) Product Development Methodology. Experience Executive Vice President Sales, Business Development & Marketing Texas Energy Network 2014  – Present (1 year) Houston, Texas Area IOT & IOE Business Development Strategy and Execution \nSecurity as a Service Offering \nSCADA \nDigital Oilfield Communications Vice President Product Management, Marketing & Strategy Wolters Kluwer 2011  –  2014  (3 years) Houston, TX Led a team of strategic planning, product management, marketing and business development to optimize core offering and expand into adjacencies in Financial Services industry. Global Business Development Executive Harris CapRock Communications 2010  –  2011  (1 year) Houston, Texas Area Worldwide business owner (strategy development and execution) for the onshore oil and gas segment. IOT & IOE end-to-end offering P&L owner, Security as a Service Offering Global Director of Product Management & Marketing Harris CapRock Communications 2007  –  2010  (3 years) Built up and lead a team that conceived, launched, and managed P&L of new value-added products and services in the satellite communications industry to differentiate product offering, increase customer retention, market share and margin Sr. Strategic Marketing Manager Intel Corporation January 2005  –  April 2007  (2 years 4 months) Recruited and led industry leaders in telecommunications market to form a new trade association (Communications Platforms Trade Association, www.cp-ta.org), to achieve mainstream adoption of open-standard building blocks. Founder and Vice President of CP-TA, served as the Intel representative on the board of directors. Sr. Strategic Alliance Manager Intel Corporation January 2004  –  January 2005  (1 year 1 month) Recruited and managed a team of software engineers and technical marketing to work with ecosystem partners to develop complementary software solutions for the telecom, enterprise and embedded industry. Emerging Country Manager (Business Development) Intel Corporation 2003  –  2004  (1 year) Led a 25 person cross functional team to develop a 5 year emerging country plan to grow the revenue from $90 to $700M for China and India. The plan was adopted and used as a benchmark for penetrating other emerging countries. Product Line Manager Intel Corporation 2000  –  2003  (3 years) Conceived and lunched new hardware and software products for the enterprise, communication and embedded market. Quality & Product Manager Alden Products 1995  –  2000  (5 years) Defined features of new products. Designed executed programs/systems that resulted in achieving world-class supplier awards by key customers Sales and Marketing Manager Sarla Software and Systems 1994  –  1995  (1 year) Business analysis, defining system requirements, product features, pricing, competitive research and owning customer engagements and achieving sales targets Executive Vice President Sales, Business Development & Marketing Texas Energy Network 2014  – Present (1 year) Houston, Texas Area IOT & IOE Business Development Strategy and Execution \nSecurity as a Service Offering \nSCADA \nDigital Oilfield Communications Executive Vice President Sales, Business Development & Marketing Texas Energy Network 2014  – Present (1 year) Houston, Texas Area IOT & IOE Business Development Strategy and Execution \nSecurity as a Service Offering \nSCADA \nDigital Oilfield Communications Vice President Product Management, Marketing & Strategy Wolters Kluwer 2011  –  2014  (3 years) Houston, TX Led a team of strategic planning, product management, marketing and business development to optimize core offering and expand into adjacencies in Financial Services industry. Vice President Product Management, Marketing & Strategy Wolters Kluwer 2011  –  2014  (3 years) Houston, TX Led a team of strategic planning, product management, marketing and business development to optimize core offering and expand into adjacencies in Financial Services industry. Global Business Development Executive Harris CapRock Communications 2010  –  2011  (1 year) Houston, Texas Area Worldwide business owner (strategy development and execution) for the onshore oil and gas segment. IOT & IOE end-to-end offering P&L owner, Security as a Service Offering Global Business Development Executive Harris CapRock Communications 2010  –  2011  (1 year) Houston, Texas Area Worldwide business owner (strategy development and execution) for the onshore oil and gas segment. IOT & IOE end-to-end offering P&L owner, Security as a Service Offering Global Director of Product Management & Marketing Harris CapRock Communications 2007  –  2010  (3 years) Built up and lead a team that conceived, launched, and managed P&L of new value-added products and services in the satellite communications industry to differentiate product offering, increase customer retention, market share and margin Global Director of Product Management & Marketing Harris CapRock Communications 2007  –  2010  (3 years) Built up and lead a team that conceived, launched, and managed P&L of new value-added products and services in the satellite communications industry to differentiate product offering, increase customer retention, market share and margin Sr. Strategic Marketing Manager Intel Corporation January 2005  –  April 2007  (2 years 4 months) Recruited and led industry leaders in telecommunications market to form a new trade association (Communications Platforms Trade Association, www.cp-ta.org), to achieve mainstream adoption of open-standard building blocks. Founder and Vice President of CP-TA, served as the Intel representative on the board of directors. Sr. Strategic Marketing Manager Intel Corporation January 2005  –  April 2007  (2 years 4 months) Recruited and led industry leaders in telecommunications market to form a new trade association (Communications Platforms Trade Association, www.cp-ta.org), to achieve mainstream adoption of open-standard building blocks. Founder and Vice President of CP-TA, served as the Intel representative on the board of directors. Sr. Strategic Alliance Manager Intel Corporation January 2004  –  January 2005  (1 year 1 month) Recruited and managed a team of software engineers and technical marketing to work with ecosystem partners to develop complementary software solutions for the telecom, enterprise and embedded industry. Sr. Strategic Alliance Manager Intel Corporation January 2004  –  January 2005  (1 year 1 month) Recruited and managed a team of software engineers and technical marketing to work with ecosystem partners to develop complementary software solutions for the telecom, enterprise and embedded industry. Emerging Country Manager (Business Development) Intel Corporation 2003  –  2004  (1 year) Led a 25 person cross functional team to develop a 5 year emerging country plan to grow the revenue from $90 to $700M for China and India. The plan was adopted and used as a benchmark for penetrating other emerging countries. Emerging Country Manager (Business Development) Intel Corporation 2003  –  2004  (1 year) Led a 25 person cross functional team to develop a 5 year emerging country plan to grow the revenue from $90 to $700M for China and India. The plan was adopted and used as a benchmark for penetrating other emerging countries. Product Line Manager Intel Corporation 2000  –  2003  (3 years) Conceived and lunched new hardware and software products for the enterprise, communication and embedded market. Product Line Manager Intel Corporation 2000  –  2003  (3 years) Conceived and lunched new hardware and software products for the enterprise, communication and embedded market. Quality & Product Manager Alden Products 1995  –  2000  (5 years) Defined features of new products. Designed executed programs/systems that resulted in achieving world-class supplier awards by key customers Quality & Product Manager Alden Products 1995  –  2000  (5 years) Defined features of new products. Designed executed programs/systems that resulted in achieving world-class supplier awards by key customers Sales and Marketing Manager Sarla Software and Systems 1994  –  1995  (1 year) Business analysis, defining system requirements, product features, pricing, competitive research and owning customer engagements and achieving sales targets Sales and Marketing Manager Sarla Software and Systems 1994  –  1995  (1 year) Business analysis, defining system requirements, product features, pricing, competitive research and owning customer engagements and achieving sales targets Languages   Skills Six Sigma Product Development Team Leadership Cross-functional Team... Business Development Manufacturing Competitive Analysis Product Management Go-to-market Strategy Scrum Strategic Planning Business Analysis Product Launch Cloud Computing Project Management IT Strategy Leadership SaaS Telecommunications Product Marketing CRM Operations Management Strategy Business Intelligence Pricing Enterprise Software Program Management Process Improvement Agile Methodologies Integration SDLC Sales Strategic Alliances Marketing Strategy Software Project... Business Process Vendor Management Business Strategy Forecasting Strategic Partnerships Marketing Management Semiconductors Business Planning New Business Development Contract Negotiation Management Marketing Negotiation Change Management Business Process... See 35+     See less Skills  Six Sigma Product Development Team Leadership Cross-functional Team... Business Development Manufacturing Competitive Analysis Product Management Go-to-market Strategy Scrum Strategic Planning Business Analysis Product Launch Cloud Computing Project Management IT Strategy Leadership SaaS Telecommunications Product Marketing CRM Operations Management Strategy Business Intelligence Pricing Enterprise Software Program Management Process Improvement Agile Methodologies Integration SDLC Sales Strategic Alliances Marketing Strategy Software Project... Business Process Vendor Management Business Strategy Forecasting Strategic Partnerships Marketing Management Semiconductors Business Planning New Business Development Contract Negotiation Management Marketing Negotiation Change Management Business Process... See 35+     See less Six Sigma Product Development Team Leadership Cross-functional Team... Business Development Manufacturing Competitive Analysis Product Management Go-to-market Strategy Scrum Strategic Planning Business Analysis Product Launch Cloud Computing Project Management IT Strategy Leadership SaaS Telecommunications Product Marketing CRM Operations Management Strategy Business Intelligence Pricing Enterprise Software Program Management Process Improvement Agile Methodologies Integration SDLC Sales Strategic Alliances Marketing Strategy Software Project... Business Process Vendor Management Business Strategy Forecasting Strategic Partnerships Marketing Management Semiconductors Business Planning New Business Development Contract Negotiation Management Marketing Negotiation Change Management Business Process... See 35+     See less Six Sigma Product Development Team Leadership Cross-functional Team... Business Development Manufacturing Competitive Analysis Product Management Go-to-market Strategy Scrum Strategic Planning Business Analysis Product Launch Cloud Computing Project Management IT Strategy Leadership SaaS Telecommunications Product Marketing CRM Operations Management Strategy Business Intelligence Pricing Enterprise Software Program Management Process Improvement Agile Methodologies Integration SDLC Sales Strategic Alliances Marketing Strategy Software Project... Business Process Vendor Management Business Strategy Forecasting Strategic Partnerships Marketing Management Semiconductors Business Planning New Business Development Contract Negotiation Management Marketing Negotiation Change Management Business Process... See 35+     See less Education Babson College - Franklin W. Olin Graduate School of Business MBA,  Marketing & Entrepreneurship (Magna Cum Laude) 1998  – 2002 Co-Founder, EaseLease Inc. -- A Babson Hatchery startup company \nhttp://www2.e-famtrips.com/default/c_press2.htm University of Massachusetts, Amherst BS,  Engineering 1990  – 1994 Babson College - Franklin W. Olin Graduate School of Business MBA,  Marketing & Entrepreneurship (Magna Cum Laude) 1998  – 2002 Co-Founder, EaseLease Inc. -- A Babson Hatchery startup company \nhttp://www2.e-famtrips.com/default/c_press2.htm Babson College - Franklin W. Olin Graduate School of Business MBA,  Marketing & Entrepreneurship (Magna Cum Laude) 1998  – 2002 Co-Founder, EaseLease Inc. -- A Babson Hatchery startup company \nhttp://www2.e-famtrips.com/default/c_press2.htm Babson College - Franklin W. Olin Graduate School of Business MBA,  Marketing & Entrepreneurship (Magna Cum Laude) 1998  – 2002 Co-Founder, EaseLease Inc. -- A Babson Hatchery startup company \nhttp://www2.e-famtrips.com/default/c_press2.htm University of Massachusetts, Amherst BS,  Engineering 1990  – 1994 University of Massachusetts, Amherst BS,  Engineering 1990  – 1994 University of Massachusetts, Amherst BS,  Engineering 1990  – 1994 Honors & Awards Intel Recognition Award Intel Corporation Recruited and influenced industry leaders in telecommunications market to form a new trade association (Communications Platforms Trade Association, www.cp-ta.org), to achieve mainstream adoption of open-standard building blocks and accelerate adoption of Intel content. Intel Recognition Award Intel Corporation Recruited and influenced industry leaders in telecommunications market to form a new trade association (Communications Platforms Trade Association, www.cp-ta.org), to achieve mainstream adoption of open-standard building blocks and accelerate adoption of Intel content. Intel Recognition Award Intel Corporation Recruited and influenced industry leaders in telecommunications market to form a new trade association (Communications Platforms Trade Association, www.cp-ta.org), to achieve mainstream adoption of open-standard building blocks and accelerate adoption of Intel content. Intel Recognition Award Intel Corporation Recruited and influenced industry leaders in telecommunications market to form a new trade association (Communications Platforms Trade Association, www.cp-ta.org), to achieve mainstream adoption of open-standard building blocks and accelerate adoption of Intel content. ", "Summary I enjoy improving the lives of the people I work and associate with by utilizing my personal and professional experience. Guiding as well as mentoring and hopefully jointly achieving new levels of personal achievement, growth and professionalism are particularly fulfilling to me.  \n \nI strive to constantly learn and grow as an individual, a husband, a father and grandfather, and a contributor to the greater community in which I reside. Summary I enjoy improving the lives of the people I work and associate with by utilizing my personal and professional experience. Guiding as well as mentoring and hopefully jointly achieving new levels of personal achievement, growth and professionalism are particularly fulfilling to me.  \n \nI strive to constantly learn and grow as an individual, a husband, a father and grandfather, and a contributor to the greater community in which I reside. I enjoy improving the lives of the people I work and associate with by utilizing my personal and professional experience. Guiding as well as mentoring and hopefully jointly achieving new levels of personal achievement, growth and professionalism are particularly fulfilling to me.  \n \nI strive to constantly learn and grow as an individual, a husband, a father and grandfather, and a contributor to the greater community in which I reside. I enjoy improving the lives of the people I work and associate with by utilizing my personal and professional experience. Guiding as well as mentoring and hopefully jointly achieving new levels of personal achievement, growth and professionalism are particularly fulfilling to me.  \n \nI strive to constantly learn and grow as an individual, a husband, a father and grandfather, and a contributor to the greater community in which I reside. Experience Band Manager Nooaitch Indian Band July 2015  – Present (2 months) Nooaitch Reserve #10, 2954 Shackelly Road, Merritt, BC V1K 1N9 On July 27, 2015 I accepted the position of Band Manager - Nooaitch Indian Band (First Nations people in Canada), reporting to Chief & Council. All Band administration, operations and financial activities report to me. \n \nThe Band's reserve is located less than 5 miles from my home, which means we share not only common local interests such as Nicola River & Spius Creek water levels and all other common items related to a close physical proximity, but I also have a very short drive to work. \n \nI'm looking forward to years of mutual benefits. \n \n Founder Route2Profit -Analytics Inc. September 2014  – Present (1 year) B.C. Canada Visit my web site to understand how to guide your company more effectively --- www.route2profit.com  \n \nI founded Route2Profit-Analytics Inc. to be a Business Forecast Advisor. Analytics provides an inexpensive way for businesses with revenues less than $20M to analyze their aged cash flow, strategic alternatives and ROI. I create a custom P&L forecast so anyone will understand and can defend the business's forecasted cash flow needs, R&D, and marketing strategy.  \n \nI do more than an accountant who just “runs the forecast numbers” as given. I help the company actually discuss assumptions and test the impact of alternatives. My 20+ years experience in marketing and executive management helps people understand if they are being realistic about target markets, R&D, revenue growth and sales expenses. Especially, do they understand the costs and benefits associated with the various options to “go to market”. \n \nSmall businesses do not do enough (if any) formal business planning or analysis of their revenue generators in order to understand cash flow needs and how to grow the business more effectively. Good ideas don't turn themselves into successful ventures without going through an extensive analysis. No business is too small or can’t afford my services. I can tailor the project to fit your company’s needs, big or small. \n \nI do not want to create your full business plan, I just want to help you create your financial forecast and analyze your business options and their credibility. You should never trust an Excel template that forces you to fit your business into a prebuilt format. President Popkum Motorcycle Ranch September 2009  –  April 2010  (8 months) Chilliwack, BC My wife and I formed two corporations to develop and run an off-road motorcycle and ATV training, camping, and riding facility. We negotiated a 25 yr. commercial lease with a local Indian Band for an 80 acre site.  \n \nArranged a training sponsorship deal with Yamaha Canada, purchased a proven training regimen from CMTS Toronto, and developed the facilities infrastructure. Two months prior to opening day the Indian Band, on whose reserve the facility was located, hijacked the business and locked us out. The business is no longer active. President Fraser Valley Dirt Riders Association September 2003  –  May 2009  (5 years 9 months) Langley, BC I was the president of this not-for-profit off-road motorcycle association for 5 ½ years. We grew the club from 48 to over 200 members to become the largest off-road motorcycle association in BC.  \n \nI was able to use my marketing and management skills to motivate volunteers to achieve breakthroughs in the association’s membership and impact in our local communities. SVP, General Manager Systems IC Division Toshiba America 1996  –  1998  (2 years) I had all Financial, Marketing, Human Resources, Engineering, and Facilities responsibility for this $350 Million (USA $) division. I was responsible for all day-to-day business operations as well as the Long Term Strategic Plan for this 200 person division. The division developed/implemented CAD software and utilized customer design centers for Custom Application Specific Integrated Circuits. VP Marketing Cypress Semiconductor 1995  –  1996  (1 year) I reported to the Executive V.P. of Sales & Marketing. I had responsibility for a staff of over 100 professionals in Marketing, Applications Engineering, and MARCOM activities for this $500M Corporation. I spearheaded a custom microprocessor development for a Microsoft mouse application. VP Corporate Marketing Integrated Device Technology 1987  –  1995  (8 years) I reported to the President/CEO of this $600 million corporation. All advertising, Press Releases and MARCOM activities reported to me. My department recommended new business ventures, corporate alliances, and I was personally the interface to the financial analyst community on Wall Street. I represented the Corporation when the Chairman chose not to attend a conference or investor meeting. I negotiated and managed the MIPS partnership with Siemens and Toshiba Japan. Co-founder Seeq Technology January 1981  –  June 1985  (4 years 6 months) I was a co-founder of this Non-Volatile memory manufacturer. We were a $70M venture capital funded start-up that went public in 1983 and was later acquired by LSI Logic Corp in 1992. I was an integral member of the management team that developed and determined all of the corporate culture values, capital spending priorities, and employee reviews & compensation methodologies as well as the company’s employee benefits plan. I applied for and received two patents (see below) that significantly improved customer usability of our memories. \n \nVice-President of New Business Development. (Dec. 1984 to May 1985) \n \nVice-President of Manufacturing Operations (Aug. 1983 to Dec. 1984) - corporate revenues increased year over year from $4 million in FY1983 to $44 million in FY1984. I managed all manufacturing operations, materials, assembly and test operations, product engineering and facilities. \n \nVice-President of Marketing and Sales (Jan. 1981 to Aug. 1983) - I was responsible for all activities of the marketing and sales teams, developed and implemented the fundamental business and product strategy, pricing strategy, applications engineering, advertising and public relations departments. I negotiated the development contract with 3COM to develop the original single chip Ethernet controller. Non-Volitile Memory Strategic Marketing Manager Intel Corporation May 1977  –  January 1981  (3 years 9 months) Santa Clara Ca Responsibilities included all product definition, life-cycle pricing, new product introduction strategies, product literature, application engineering, competitor evaluation, sales training, advertising, and public relations. Bipolar Memory Marketing Manager National Semiconductor April 1976  –  May 1977  (1 year 2 months) Sunnyvale, Ca All Marketing reposibilities for family of Bipolar Proms District sales Manager MMI April 1972  –  March 1976  (4 years) I managed memory designs and sales to major mini-computer manufacturers in Orange Country. I assisted applications engineering to define the worlds first bipolar 4 bit bit-slice processor. Outside Salesman for OEM accounts Fairchild Semiconductor March 1970  –  April 1972  (2 years 2 months) Orange County, California Area I managed designs and sales for major mini-computer accounts in Orange County for MSI level IC devices and discrete products. Band Manager Nooaitch Indian Band July 2015  – Present (2 months) Nooaitch Reserve #10, 2954 Shackelly Road, Merritt, BC V1K 1N9 On July 27, 2015 I accepted the position of Band Manager - Nooaitch Indian Band (First Nations people in Canada), reporting to Chief & Council. All Band administration, operations and financial activities report to me. \n \nThe Band's reserve is located less than 5 miles from my home, which means we share not only common local interests such as Nicola River & Spius Creek water levels and all other common items related to a close physical proximity, but I also have a very short drive to work. \n \nI'm looking forward to years of mutual benefits. \n \n Band Manager Nooaitch Indian Band July 2015  – Present (2 months) Nooaitch Reserve #10, 2954 Shackelly Road, Merritt, BC V1K 1N9 On July 27, 2015 I accepted the position of Band Manager - Nooaitch Indian Band (First Nations people in Canada), reporting to Chief & Council. All Band administration, operations and financial activities report to me. \n \nThe Band's reserve is located less than 5 miles from my home, which means we share not only common local interests such as Nicola River & Spius Creek water levels and all other common items related to a close physical proximity, but I also have a very short drive to work. \n \nI'm looking forward to years of mutual benefits. \n \n Founder Route2Profit -Analytics Inc. September 2014  – Present (1 year) B.C. Canada Visit my web site to understand how to guide your company more effectively --- www.route2profit.com  \n \nI founded Route2Profit-Analytics Inc. to be a Business Forecast Advisor. Analytics provides an inexpensive way for businesses with revenues less than $20M to analyze their aged cash flow, strategic alternatives and ROI. I create a custom P&L forecast so anyone will understand and can defend the business's forecasted cash flow needs, R&D, and marketing strategy.  \n \nI do more than an accountant who just “runs the forecast numbers” as given. I help the company actually discuss assumptions and test the impact of alternatives. My 20+ years experience in marketing and executive management helps people understand if they are being realistic about target markets, R&D, revenue growth and sales expenses. Especially, do they understand the costs and benefits associated with the various options to “go to market”. \n \nSmall businesses do not do enough (if any) formal business planning or analysis of their revenue generators in order to understand cash flow needs and how to grow the business more effectively. Good ideas don't turn themselves into successful ventures without going through an extensive analysis. No business is too small or can’t afford my services. I can tailor the project to fit your company’s needs, big or small. \n \nI do not want to create your full business plan, I just want to help you create your financial forecast and analyze your business options and their credibility. You should never trust an Excel template that forces you to fit your business into a prebuilt format. Founder Route2Profit -Analytics Inc. September 2014  – Present (1 year) B.C. Canada Visit my web site to understand how to guide your company more effectively --- www.route2profit.com  \n \nI founded Route2Profit-Analytics Inc. to be a Business Forecast Advisor. Analytics provides an inexpensive way for businesses with revenues less than $20M to analyze their aged cash flow, strategic alternatives and ROI. I create a custom P&L forecast so anyone will understand and can defend the business's forecasted cash flow needs, R&D, and marketing strategy.  \n \nI do more than an accountant who just “runs the forecast numbers” as given. I help the company actually discuss assumptions and test the impact of alternatives. My 20+ years experience in marketing and executive management helps people understand if they are being realistic about target markets, R&D, revenue growth and sales expenses. Especially, do they understand the costs and benefits associated with the various options to “go to market”. \n \nSmall businesses do not do enough (if any) formal business planning or analysis of their revenue generators in order to understand cash flow needs and how to grow the business more effectively. Good ideas don't turn themselves into successful ventures without going through an extensive analysis. No business is too small or can’t afford my services. I can tailor the project to fit your company’s needs, big or small. \n \nI do not want to create your full business plan, I just want to help you create your financial forecast and analyze your business options and their credibility. You should never trust an Excel template that forces you to fit your business into a prebuilt format. President Popkum Motorcycle Ranch September 2009  –  April 2010  (8 months) Chilliwack, BC My wife and I formed two corporations to develop and run an off-road motorcycle and ATV training, camping, and riding facility. We negotiated a 25 yr. commercial lease with a local Indian Band for an 80 acre site.  \n \nArranged a training sponsorship deal with Yamaha Canada, purchased a proven training regimen from CMTS Toronto, and developed the facilities infrastructure. Two months prior to opening day the Indian Band, on whose reserve the facility was located, hijacked the business and locked us out. The business is no longer active. President Popkum Motorcycle Ranch September 2009  –  April 2010  (8 months) Chilliwack, BC My wife and I formed two corporations to develop and run an off-road motorcycle and ATV training, camping, and riding facility. We negotiated a 25 yr. commercial lease with a local Indian Band for an 80 acre site.  \n \nArranged a training sponsorship deal with Yamaha Canada, purchased a proven training regimen from CMTS Toronto, and developed the facilities infrastructure. Two months prior to opening day the Indian Band, on whose reserve the facility was located, hijacked the business and locked us out. The business is no longer active. President Fraser Valley Dirt Riders Association September 2003  –  May 2009  (5 years 9 months) Langley, BC I was the president of this not-for-profit off-road motorcycle association for 5 ½ years. We grew the club from 48 to over 200 members to become the largest off-road motorcycle association in BC.  \n \nI was able to use my marketing and management skills to motivate volunteers to achieve breakthroughs in the association’s membership and impact in our local communities. President Fraser Valley Dirt Riders Association September 2003  –  May 2009  (5 years 9 months) Langley, BC I was the president of this not-for-profit off-road motorcycle association for 5 ½ years. We grew the club from 48 to over 200 members to become the largest off-road motorcycle association in BC.  \n \nI was able to use my marketing and management skills to motivate volunteers to achieve breakthroughs in the association’s membership and impact in our local communities. SVP, General Manager Systems IC Division Toshiba America 1996  –  1998  (2 years) I had all Financial, Marketing, Human Resources, Engineering, and Facilities responsibility for this $350 Million (USA $) division. I was responsible for all day-to-day business operations as well as the Long Term Strategic Plan for this 200 person division. The division developed/implemented CAD software and utilized customer design centers for Custom Application Specific Integrated Circuits. SVP, General Manager Systems IC Division Toshiba America 1996  –  1998  (2 years) I had all Financial, Marketing, Human Resources, Engineering, and Facilities responsibility for this $350 Million (USA $) division. I was responsible for all day-to-day business operations as well as the Long Term Strategic Plan for this 200 person division. The division developed/implemented CAD software and utilized customer design centers for Custom Application Specific Integrated Circuits. VP Marketing Cypress Semiconductor 1995  –  1996  (1 year) I reported to the Executive V.P. of Sales & Marketing. I had responsibility for a staff of over 100 professionals in Marketing, Applications Engineering, and MARCOM activities for this $500M Corporation. I spearheaded a custom microprocessor development for a Microsoft mouse application. VP Marketing Cypress Semiconductor 1995  –  1996  (1 year) I reported to the Executive V.P. of Sales & Marketing. I had responsibility for a staff of over 100 professionals in Marketing, Applications Engineering, and MARCOM activities for this $500M Corporation. I spearheaded a custom microprocessor development for a Microsoft mouse application. VP Corporate Marketing Integrated Device Technology 1987  –  1995  (8 years) I reported to the President/CEO of this $600 million corporation. All advertising, Press Releases and MARCOM activities reported to me. My department recommended new business ventures, corporate alliances, and I was personally the interface to the financial analyst community on Wall Street. I represented the Corporation when the Chairman chose not to attend a conference or investor meeting. I negotiated and managed the MIPS partnership with Siemens and Toshiba Japan. VP Corporate Marketing Integrated Device Technology 1987  –  1995  (8 years) I reported to the President/CEO of this $600 million corporation. All advertising, Press Releases and MARCOM activities reported to me. My department recommended new business ventures, corporate alliances, and I was personally the interface to the financial analyst community on Wall Street. I represented the Corporation when the Chairman chose not to attend a conference or investor meeting. I negotiated and managed the MIPS partnership with Siemens and Toshiba Japan. Co-founder Seeq Technology January 1981  –  June 1985  (4 years 6 months) I was a co-founder of this Non-Volatile memory manufacturer. We were a $70M venture capital funded start-up that went public in 1983 and was later acquired by LSI Logic Corp in 1992. I was an integral member of the management team that developed and determined all of the corporate culture values, capital spending priorities, and employee reviews & compensation methodologies as well as the company’s employee benefits plan. I applied for and received two patents (see below) that significantly improved customer usability of our memories. \n \nVice-President of New Business Development. (Dec. 1984 to May 1985) \n \nVice-President of Manufacturing Operations (Aug. 1983 to Dec. 1984) - corporate revenues increased year over year from $4 million in FY1983 to $44 million in FY1984. I managed all manufacturing operations, materials, assembly and test operations, product engineering and facilities. \n \nVice-President of Marketing and Sales (Jan. 1981 to Aug. 1983) - I was responsible for all activities of the marketing and sales teams, developed and implemented the fundamental business and product strategy, pricing strategy, applications engineering, advertising and public relations departments. I negotiated the development contract with 3COM to develop the original single chip Ethernet controller. Co-founder Seeq Technology January 1981  –  June 1985  (4 years 6 months) I was a co-founder of this Non-Volatile memory manufacturer. We were a $70M venture capital funded start-up that went public in 1983 and was later acquired by LSI Logic Corp in 1992. I was an integral member of the management team that developed and determined all of the corporate culture values, capital spending priorities, and employee reviews & compensation methodologies as well as the company’s employee benefits plan. I applied for and received two patents (see below) that significantly improved customer usability of our memories. \n \nVice-President of New Business Development. (Dec. 1984 to May 1985) \n \nVice-President of Manufacturing Operations (Aug. 1983 to Dec. 1984) - corporate revenues increased year over year from $4 million in FY1983 to $44 million in FY1984. I managed all manufacturing operations, materials, assembly and test operations, product engineering and facilities. \n \nVice-President of Marketing and Sales (Jan. 1981 to Aug. 1983) - I was responsible for all activities of the marketing and sales teams, developed and implemented the fundamental business and product strategy, pricing strategy, applications engineering, advertising and public relations departments. I negotiated the development contract with 3COM to develop the original single chip Ethernet controller. Non-Volitile Memory Strategic Marketing Manager Intel Corporation May 1977  –  January 1981  (3 years 9 months) Santa Clara Ca Responsibilities included all product definition, life-cycle pricing, new product introduction strategies, product literature, application engineering, competitor evaluation, sales training, advertising, and public relations. Non-Volitile Memory Strategic Marketing Manager Intel Corporation May 1977  –  January 1981  (3 years 9 months) Santa Clara Ca Responsibilities included all product definition, life-cycle pricing, new product introduction strategies, product literature, application engineering, competitor evaluation, sales training, advertising, and public relations. Bipolar Memory Marketing Manager National Semiconductor April 1976  –  May 1977  (1 year 2 months) Sunnyvale, Ca All Marketing reposibilities for family of Bipolar Proms Bipolar Memory Marketing Manager National Semiconductor April 1976  –  May 1977  (1 year 2 months) Sunnyvale, Ca All Marketing reposibilities for family of Bipolar Proms District sales Manager MMI April 1972  –  March 1976  (4 years) I managed memory designs and sales to major mini-computer manufacturers in Orange Country. I assisted applications engineering to define the worlds first bipolar 4 bit bit-slice processor. District sales Manager MMI April 1972  –  March 1976  (4 years) I managed memory designs and sales to major mini-computer manufacturers in Orange Country. I assisted applications engineering to define the worlds first bipolar 4 bit bit-slice processor. Outside Salesman for OEM accounts Fairchild Semiconductor March 1970  –  April 1972  (2 years 2 months) Orange County, California Area I managed designs and sales for major mini-computer accounts in Orange County for MSI level IC devices and discrete products. Outside Salesman for OEM accounts Fairchild Semiconductor March 1970  –  April 1972  (2 years 2 months) Orange County, California Area I managed designs and sales for major mini-computer accounts in Orange County for MSI level IC devices and discrete products. Skills Business Strategy Start-ups Electronics Strategic Planning Business Planning Team Building Strategic Partnerships Product Marketing Product Management Marketing Communications Program Management Marketing Strategy Management Consulting Product Development Sales&Marketing Sales Management Strategy Cross-functional Team... Forecasting Semiconductors Marketing Entrepreneurship IC Business Development Manufacturing Competitive Analysis Advertising International Sales Mergers & Acquisitions Contract Negotiation International Business Executive Management Semiconductor Industry P&L Management Venture Capital New Business Development Finance Go-to-market Strategy Sales Management Corporate Development Product Launch Market Analysis Operations Management SaaS CRM B2B Negotiation Sales Operations Market Research See 35+     See less Skills  Business Strategy Start-ups Electronics Strategic Planning Business Planning Team Building Strategic Partnerships Product Marketing Product Management Marketing Communications Program Management Marketing Strategy Management Consulting Product Development Sales&Marketing Sales Management Strategy Cross-functional Team... Forecasting Semiconductors Marketing Entrepreneurship IC Business Development Manufacturing Competitive Analysis Advertising International Sales Mergers & Acquisitions Contract Negotiation International Business Executive Management Semiconductor Industry P&L Management Venture Capital New Business Development Finance Go-to-market Strategy Sales Management Corporate Development Product Launch Market Analysis Operations Management SaaS CRM B2B Negotiation Sales Operations Market Research See 35+     See less Business Strategy Start-ups Electronics Strategic Planning Business Planning Team Building Strategic Partnerships Product Marketing Product Management Marketing Communications Program Management Marketing Strategy Management Consulting Product Development Sales&Marketing Sales Management Strategy Cross-functional Team... Forecasting Semiconductors Marketing Entrepreneurship IC Business Development Manufacturing Competitive Analysis Advertising International Sales Mergers & Acquisitions Contract Negotiation International Business Executive Management Semiconductor Industry P&L Management Venture Capital New Business Development Finance Go-to-market Strategy Sales Management Corporate Development Product Launch Market Analysis Operations Management SaaS CRM B2B Negotiation Sales Operations Market Research See 35+     See less Business Strategy Start-ups Electronics Strategic Planning Business Planning Team Building Strategic Partnerships Product Marketing Product Management Marketing Communications Program Management Marketing Strategy Management Consulting Product Development Sales&Marketing Sales Management Strategy Cross-functional Team... Forecasting Semiconductors Marketing Entrepreneurship IC Business Development Manufacturing Competitive Analysis Advertising International Sales Mergers & Acquisitions Contract Negotiation International Business Executive Management Semiconductor Industry P&L Management Venture Capital New Business Development Finance Go-to-market Strategy Sales Management Corporate Development Product Launch Market Analysis Operations Management SaaS CRM B2B Negotiation Sales Operations Market Research See 35+     See less Education Occidental College BA,  Economics January 1965  – June 1967 Occidental College BA Economics,  Theory of the firm 1965  – 1967 Occidental College BA,  Economics January 1965  – June 1967 Occidental College BA,  Economics January 1965  – June 1967 Occidental College BA,  Economics January 1965  – June 1967 Occidental College BA Economics,  Theory of the firm 1965  – 1967 Occidental College BA Economics,  Theory of the firm 1965  – 1967 Occidental College BA Economics,  Theory of the firm 1965  – 1967 Honors & Awards Additional Honors & Awards Two patents awarded \nCo-founder of Semiconductor company, SEEQ Technology Additional Honors & Awards Two patents awarded \nCo-founder of Semiconductor company, SEEQ Technology Additional Honors & Awards Two patents awarded \nCo-founder of Semiconductor company, SEEQ Technology Additional Honors & Awards Two patents awarded \nCo-founder of Semiconductor company, SEEQ Technology ", "Summary A skilled consensus builder and a results-driven contributor with relevant experience across Business Planning, Pricing and product portfolio management, Product Marketing, Partner Marketing, Business Development, and Finance. Notable business impact demonstrated in entering new markets, launching and pricing new products, and growing revenues through strategic partnerships and co-marketing programs. Strong business and financial acumen, excellent analytical and technical aptitude, results driven, and experienced in strategy formulation, c-level negotiations, and large-scale program planning and execution. \n \nSpecialties: xaaS, cloud management, network and security virtualization platform, enterprise high availability server segment product pricing, product planning, product management, product marketing, partner marketing, deal negotiation, strategy formulation, program management, business planning, competitive analysis, advanced financial modeling and analysis. Summary A skilled consensus builder and a results-driven contributor with relevant experience across Business Planning, Pricing and product portfolio management, Product Marketing, Partner Marketing, Business Development, and Finance. Notable business impact demonstrated in entering new markets, launching and pricing new products, and growing revenues through strategic partnerships and co-marketing programs. Strong business and financial acumen, excellent analytical and technical aptitude, results driven, and experienced in strategy formulation, c-level negotiations, and large-scale program planning and execution. \n \nSpecialties: xaaS, cloud management, network and security virtualization platform, enterprise high availability server segment product pricing, product planning, product management, product marketing, partner marketing, deal negotiation, strategy formulation, program management, business planning, competitive analysis, advanced financial modeling and analysis. A skilled consensus builder and a results-driven contributor with relevant experience across Business Planning, Pricing and product portfolio management, Product Marketing, Partner Marketing, Business Development, and Finance. Notable business impact demonstrated in entering new markets, launching and pricing new products, and growing revenues through strategic partnerships and co-marketing programs. Strong business and financial acumen, excellent analytical and technical aptitude, results driven, and experienced in strategy formulation, c-level negotiations, and large-scale program planning and execution. \n \nSpecialties: xaaS, cloud management, network and security virtualization platform, enterprise high availability server segment product pricing, product planning, product management, product marketing, partner marketing, deal negotiation, strategy formulation, program management, business planning, competitive analysis, advanced financial modeling and analysis. A skilled consensus builder and a results-driven contributor with relevant experience across Business Planning, Pricing and product portfolio management, Product Marketing, Partner Marketing, Business Development, and Finance. Notable business impact demonstrated in entering new markets, launching and pricing new products, and growing revenues through strategic partnerships and co-marketing programs. Strong business and financial acumen, excellent analytical and technical aptitude, results driven, and experienced in strategy formulation, c-level negotiations, and large-scale program planning and execution. \n \nSpecialties: xaaS, cloud management, network and security virtualization platform, enterprise high availability server segment product pricing, product planning, product management, product marketing, partner marketing, deal negotiation, strategy formulation, program management, business planning, competitive analysis, advanced financial modeling and analysis. Experience Pricing, Licensing & Launch Management VMware April 2014  – Present (1 year 5 months) Palo Alto, CA Strategy & Business Planning Hewlett-Packard Company January 2007  –  April 2014  (7 years 4 months) Palo Alto, CA Senior Partner Marketing Manager Intel Corporation 2004  –  December 2006  (2 years) Vertical Industries Software Marketing Manager Intel Corporation 2001  –  2004  (3 years) Strategic Marketing Manager Intel Corporation 1999  –  2001  (2 years) Manager, Manufacturing Operations Intel Corporation 1997  –  1999  (2 years) Manager, Financial Planning & Analysis Intel Corporation 1996  –  1997  (1 year) Senior Product Line Analyst Intel Corporation 1994  –  1996  (2 years) Senior Financial Analyst Maxtor Corporation 1992  –  1994  (2 years) Pricing, Licensing & Launch Management VMware April 2014  – Present (1 year 5 months) Palo Alto, CA Pricing, Licensing & Launch Management VMware April 2014  – Present (1 year 5 months) Palo Alto, CA Strategy & Business Planning Hewlett-Packard Company January 2007  –  April 2014  (7 years 4 months) Palo Alto, CA Strategy & Business Planning Hewlett-Packard Company January 2007  –  April 2014  (7 years 4 months) Palo Alto, CA Senior Partner Marketing Manager Intel Corporation 2004  –  December 2006  (2 years) Senior Partner Marketing Manager Intel Corporation 2004  –  December 2006  (2 years) Vertical Industries Software Marketing Manager Intel Corporation 2001  –  2004  (3 years) Vertical Industries Software Marketing Manager Intel Corporation 2001  –  2004  (3 years) Strategic Marketing Manager Intel Corporation 1999  –  2001  (2 years) Strategic Marketing Manager Intel Corporation 1999  –  2001  (2 years) Manager, Manufacturing Operations Intel Corporation 1997  –  1999  (2 years) Manager, Manufacturing Operations Intel Corporation 1997  –  1999  (2 years) Manager, Financial Planning & Analysis Intel Corporation 1996  –  1997  (1 year) Manager, Financial Planning & Analysis Intel Corporation 1996  –  1997  (1 year) Senior Product Line Analyst Intel Corporation 1994  –  1996  (2 years) Senior Product Line Analyst Intel Corporation 1994  –  1996  (2 years) Senior Financial Analyst Maxtor Corporation 1992  –  1994  (2 years) Senior Financial Analyst Maxtor Corporation 1992  –  1994  (2 years) Skills Enterprise Software Business Planning Competitive Analysis Business Alliances Product Marketing Strategy Analysis Strategic Partnerships Cross-functional Team... Product Management E-commerce Pricing Business Strategy Marketing Strategy Program Management Management See 1+     See less Skills  Enterprise Software Business Planning Competitive Analysis Business Alliances Product Marketing Strategy Analysis Strategic Partnerships Cross-functional Team... Product Management E-commerce Pricing Business Strategy Marketing Strategy Program Management Management See 1+     See less Enterprise Software Business Planning Competitive Analysis Business Alliances Product Marketing Strategy Analysis Strategic Partnerships Cross-functional Team... Product Management E-commerce Pricing Business Strategy Marketing Strategy Program Management Management See 1+     See less Enterprise Software Business Planning Competitive Analysis Business Alliances Product Marketing Strategy Analysis Strategic Partnerships Cross-functional Team... Product Management E-commerce Pricing Business Strategy Marketing Strategy Program Management Management See 1+     See less Education Carnegie Mellon University BS,  Biomedical Engineering ,  Chemical Engineering University of California Professional Certificate in Network Engineering University of Michigan - Stephen M. Ross School of Business MBA,  General Management , International Business Carnegie Mellon University BS,  Biomedical Engineering ,  Chemical Engineering Carnegie Mellon University BS,  Biomedical Engineering ,  Chemical Engineering Carnegie Mellon University BS,  Biomedical Engineering ,  Chemical Engineering University of California Professional Certificate in Network Engineering University of California Professional Certificate in Network Engineering University of California Professional Certificate in Network Engineering University of Michigan - Stephen M. Ross School of Business MBA,  General Management , International Business University of Michigan - Stephen M. Ross School of Business MBA,  General Management , International Business University of Michigan - Stephen M. Ross School of Business MBA,  General Management , International Business ", "Summary Experienced thought leader with 17+ yrs of success in driving business innovations in B2C & B2B and delivering financial growth across multiple industries (semiconductors and high performance server technologies, digital content and media, data storage, consumer products, mobile technology, data analytics, financial services).  \n \nI have extensive experience in consultative selling and business development in conjunction with internal corporate development leadership across the product development life cycle and SDLC, including strategy, roadmap planning, development of new markets, creation of global marketing campaigns and product launches and owned P&Ls in excess of $500M.  \n \nI lead strategy and disruptive business innovations with the Customer Development Process, Lean Startup methodology, and Lean Six Sigma principles. I focus on creative strategies and solutions that best satisfies the user experience through an iterative customer driven process. \n \nExperience:  \n \n* Led partnerships, strategies and product development organizations in domestic and international markets delivering services in online digital media, Cloud Computing, Big Data Analytics, and SaaS solutions. \n* Negotiated global sourcing contracts and worked with manufacturers in mainland China and Hong Kong. \n \nGlobal Experience: Americas, EMEA, APAC, Japan. \n \nSpecialties:  \n \n* Data Analytics, Data Cleansing, Data Governance, Mass Data Management, Big Data \n* Extensive experience in corporate development and strategy, competitive intelligence, market research & analysis, new product development, and iterative design for usability. \n \n* Global Business Development and Marketing leadership with go-to-market strategies, Gamification, development and execution of high-impact integrated marketing campaigns, programs and processes: branding, advertising, digital & social media marketing, events, demand and lead generation, sales training and channel partnerships. Summary Experienced thought leader with 17+ yrs of success in driving business innovations in B2C & B2B and delivering financial growth across multiple industries (semiconductors and high performance server technologies, digital content and media, data storage, consumer products, mobile technology, data analytics, financial services).  \n \nI have extensive experience in consultative selling and business development in conjunction with internal corporate development leadership across the product development life cycle and SDLC, including strategy, roadmap planning, development of new markets, creation of global marketing campaigns and product launches and owned P&Ls in excess of $500M.  \n \nI lead strategy and disruptive business innovations with the Customer Development Process, Lean Startup methodology, and Lean Six Sigma principles. I focus on creative strategies and solutions that best satisfies the user experience through an iterative customer driven process. \n \nExperience:  \n \n* Led partnerships, strategies and product development organizations in domestic and international markets delivering services in online digital media, Cloud Computing, Big Data Analytics, and SaaS solutions. \n* Negotiated global sourcing contracts and worked with manufacturers in mainland China and Hong Kong. \n \nGlobal Experience: Americas, EMEA, APAC, Japan. \n \nSpecialties:  \n \n* Data Analytics, Data Cleansing, Data Governance, Mass Data Management, Big Data \n* Extensive experience in corporate development and strategy, competitive intelligence, market research & analysis, new product development, and iterative design for usability. \n \n* Global Business Development and Marketing leadership with go-to-market strategies, Gamification, development and execution of high-impact integrated marketing campaigns, programs and processes: branding, advertising, digital & social media marketing, events, demand and lead generation, sales training and channel partnerships. Experienced thought leader with 17+ yrs of success in driving business innovations in B2C & B2B and delivering financial growth across multiple industries (semiconductors and high performance server technologies, digital content and media, data storage, consumer products, mobile technology, data analytics, financial services).  \n \nI have extensive experience in consultative selling and business development in conjunction with internal corporate development leadership across the product development life cycle and SDLC, including strategy, roadmap planning, development of new markets, creation of global marketing campaigns and product launches and owned P&Ls in excess of $500M.  \n \nI lead strategy and disruptive business innovations with the Customer Development Process, Lean Startup methodology, and Lean Six Sigma principles. I focus on creative strategies and solutions that best satisfies the user experience through an iterative customer driven process. \n \nExperience:  \n \n* Led partnerships, strategies and product development organizations in domestic and international markets delivering services in online digital media, Cloud Computing, Big Data Analytics, and SaaS solutions. \n* Negotiated global sourcing contracts and worked with manufacturers in mainland China and Hong Kong. \n \nGlobal Experience: Americas, EMEA, APAC, Japan. \n \nSpecialties:  \n \n* Data Analytics, Data Cleansing, Data Governance, Mass Data Management, Big Data \n* Extensive experience in corporate development and strategy, competitive intelligence, market research & analysis, new product development, and iterative design for usability. \n \n* Global Business Development and Marketing leadership with go-to-market strategies, Gamification, development and execution of high-impact integrated marketing campaigns, programs and processes: branding, advertising, digital & social media marketing, events, demand and lead generation, sales training and channel partnerships. Experienced thought leader with 17+ yrs of success in driving business innovations in B2C & B2B and delivering financial growth across multiple industries (semiconductors and high performance server technologies, digital content and media, data storage, consumer products, mobile technology, data analytics, financial services).  \n \nI have extensive experience in consultative selling and business development in conjunction with internal corporate development leadership across the product development life cycle and SDLC, including strategy, roadmap planning, development of new markets, creation of global marketing campaigns and product launches and owned P&Ls in excess of $500M.  \n \nI lead strategy and disruptive business innovations with the Customer Development Process, Lean Startup methodology, and Lean Six Sigma principles. I focus on creative strategies and solutions that best satisfies the user experience through an iterative customer driven process. \n \nExperience:  \n \n* Led partnerships, strategies and product development organizations in domestic and international markets delivering services in online digital media, Cloud Computing, Big Data Analytics, and SaaS solutions. \n* Negotiated global sourcing contracts and worked with manufacturers in mainland China and Hong Kong. \n \nGlobal Experience: Americas, EMEA, APAC, Japan. \n \nSpecialties:  \n \n* Data Analytics, Data Cleansing, Data Governance, Mass Data Management, Big Data \n* Extensive experience in corporate development and strategy, competitive intelligence, market research & analysis, new product development, and iterative design for usability. \n \n* Global Business Development and Marketing leadership with go-to-market strategies, Gamification, development and execution of high-impact integrated marketing campaigns, programs and processes: branding, advertising, digital & social media marketing, events, demand and lead generation, sales training and channel partnerships. Experience Vice President Strategy & Market Development First American Financial Corporation - Database Solutions Group (DBS) April 2013  – Present (2 years 5 months) Orange County, California Area Director, Strategic Relations and Partnerships Experian January 2010  –  March 2013  (3 years 3 months) Director of Reseller Sales Targus, Inc. 2008  –  2009  (1 year) Director of Business Development - Global Alliances Targus Inc. 2007  –  2009  (2 years) Strategic Business Marketing Manager Western Digital Corporation 2005  –  2007  (2 years) Market Director - Enterprise Networks Schneider Electric (MGE UPS SYSTEMS, INC.) 2003  –  2005  (2 years) Worldwide Strategic Marketing Manager Intel Corporation 1997  –  2002  (5 years) Vice President Strategy & Market Development First American Financial Corporation - Database Solutions Group (DBS) April 2013  – Present (2 years 5 months) Orange County, California Area Vice President Strategy & Market Development First American Financial Corporation - Database Solutions Group (DBS) April 2013  – Present (2 years 5 months) Orange County, California Area Director, Strategic Relations and Partnerships Experian January 2010  –  March 2013  (3 years 3 months) Director, Strategic Relations and Partnerships Experian January 2010  –  March 2013  (3 years 3 months) Director of Reseller Sales Targus, Inc. 2008  –  2009  (1 year) Director of Reseller Sales Targus, Inc. 2008  –  2009  (1 year) Director of Business Development - Global Alliances Targus Inc. 2007  –  2009  (2 years) Director of Business Development - Global Alliances Targus Inc. 2007  –  2009  (2 years) Strategic Business Marketing Manager Western Digital Corporation 2005  –  2007  (2 years) Strategic Business Marketing Manager Western Digital Corporation 2005  –  2007  (2 years) Market Director - Enterprise Networks Schneider Electric (MGE UPS SYSTEMS, INC.) 2003  –  2005  (2 years) Market Director - Enterprise Networks Schneider Electric (MGE UPS SYSTEMS, INC.) 2003  –  2005  (2 years) Worldwide Strategic Marketing Manager Intel Corporation 1997  –  2002  (5 years) Worldwide Strategic Marketing Manager Intel Corporation 1997  –  2002  (5 years) Languages French Full professional proficiency Vietnamese Native or bilingual proficiency Chinese Elementary proficiency English Native or bilingual proficiency French Full professional proficiency Vietnamese Native or bilingual proficiency Chinese Elementary proficiency English Native or bilingual proficiency French Full professional proficiency Vietnamese Native or bilingual proficiency Chinese Elementary proficiency English Native or bilingual proficiency Full professional proficiency Native or bilingual proficiency Elementary proficiency Native or bilingual proficiency Skills Strategic Partnerships Strategy Go-to-market Strategy CRM Enterprise Software Business Development Lead Generation Product Development Start-ups B2B SaaS Product Management Management Competitive Analysis Business Strategy Product Marketing Channel Analytics Business Planning Product Launch Leadership Program Management Marketing Global Business... Change Management Sales Marketing Strategy Strategic Planning Cross-functional Team... Integrated Marketing Cloud Computing Business Pricing Strategy Sourcing Digital Marketing Advertising Vendor Management Business Alliances E-commerce Data Center Sales Management International Business... OEM and ODM Channels and... Strategic and Product... Operations and change... R Programming, Python,... Six Sigma, Kaizen Gamification Market Research See 35+     See less Skills  Strategic Partnerships Strategy Go-to-market Strategy CRM Enterprise Software Business Development Lead Generation Product Development Start-ups B2B SaaS Product Management Management Competitive Analysis Business Strategy Product Marketing Channel Analytics Business Planning Product Launch Leadership Program Management Marketing Global Business... Change Management Sales Marketing Strategy Strategic Planning Cross-functional Team... Integrated Marketing Cloud Computing Business Pricing Strategy Sourcing Digital Marketing Advertising Vendor Management Business Alliances E-commerce Data Center Sales Management International Business... OEM and ODM Channels and... Strategic and Product... Operations and change... R Programming, Python,... Six Sigma, Kaizen Gamification Market Research See 35+     See less Strategic Partnerships Strategy Go-to-market Strategy CRM Enterprise Software Business Development Lead Generation Product Development Start-ups B2B SaaS Product Management Management Competitive Analysis Business Strategy Product Marketing Channel Analytics Business Planning Product Launch Leadership Program Management Marketing Global Business... Change Management Sales Marketing Strategy Strategic Planning Cross-functional Team... Integrated Marketing Cloud Computing Business Pricing Strategy Sourcing Digital Marketing Advertising Vendor Management Business Alliances E-commerce Data Center Sales Management International Business... OEM and ODM Channels and... Strategic and Product... Operations and change... R Programming, Python,... Six Sigma, Kaizen Gamification Market Research See 35+     See less Strategic Partnerships Strategy Go-to-market Strategy CRM Enterprise Software Business Development Lead Generation Product Development Start-ups B2B SaaS Product Management Management Competitive Analysis Business Strategy Product Marketing Channel Analytics Business Planning Product Launch Leadership Program Management Marketing Global Business... Change Management Sales Marketing Strategy Strategic Planning Cross-functional Team... Integrated Marketing Cloud Computing Business Pricing Strategy Sourcing Digital Marketing Advertising Vendor Management Business Alliances E-commerce Data Center Sales Management International Business... OEM and ODM Channels and... Strategic and Product... Operations and change... R Programming, Python,... Six Sigma, Kaizen Gamification Market Research See 35+     See less Education California State Polytechnic University-Pomona BS,  Electrical and Computer Engineering University of California, Irvine - The Paul Merage School of Business MBA,  Marketing ,  International Business & Strategy California State Polytechnic University-Pomona BS,  Electrical and Computer Engineering California State Polytechnic University-Pomona BS,  Electrical and Computer Engineering California State Polytechnic University-Pomona BS,  Electrical and Computer Engineering University of California, Irvine - The Paul Merage School of Business MBA,  Marketing ,  International Business & Strategy University of California, Irvine - The Paul Merage School of Business MBA,  Marketing ,  International Business & Strategy University of California, Irvine - The Paul Merage School of Business MBA,  Marketing ,  International Business & Strategy Honors & Awards ", "Languages English Native or bilingual proficiency Mandarin Native or bilingual proficiency English Native or bilingual proficiency Mandarin Native or bilingual proficiency English Native or bilingual proficiency Mandarin Native or bilingual proficiency Native or bilingual proficiency Native or bilingual proficiency Skills Semiconductors SoC ASIC Embedded Systems IC Mixed Signal Analog Wireless Wireless Networking Product Marketing RF Consumer Electronics Ethernet WiFi Go-to-market Strategy Product Management See 1+     See less Skills  Semiconductors SoC ASIC Embedded Systems IC Mixed Signal Analog Wireless Wireless Networking Product Marketing RF Consumer Electronics Ethernet WiFi Go-to-market Strategy Product Management See 1+     See less Semiconductors SoC ASIC Embedded Systems IC Mixed Signal Analog Wireless Wireless Networking Product Marketing RF Consumer Electronics Ethernet WiFi Go-to-market Strategy Product Management See 1+     See less Semiconductors SoC ASIC Embedded Systems IC Mixed Signal Analog Wireless Wireless Networking Product Marketing RF Consumer Electronics Ethernet WiFi Go-to-market Strategy Product Management See 1+     See less ", "Skills Program Management Team Leadership IT Management Service Management ITIL Disaster Recovery Product Management Management IT Service Management Process Improvement Integration Cross-functional Team... Business Analysis Requirements Analysis Vendor Management Change Management SDLC Project Management IT Operations IT Strategy Software Project... Agile Project Management Project Portfolio... Business Process... PMO Software Documentation Testing SharePoint Cloud Computing Data Center Business Process PMP Security Software Development Business Intelligence Enterprise Software Enterprise Architecture Outsourcing Strategy System Architecture Process Engineering Solution Architecture SaaS Requirements Gathering Information Technology System Deployment ERP Systems Analysis Visio Agile Methodologies See 35+     See less Skills  Program Management Team Leadership IT Management Service Management ITIL Disaster Recovery Product Management Management IT Service Management Process Improvement Integration Cross-functional Team... Business Analysis Requirements Analysis Vendor Management Change Management SDLC Project Management IT Operations IT Strategy Software Project... Agile Project Management Project Portfolio... Business Process... PMO Software Documentation Testing SharePoint Cloud Computing Data Center Business Process PMP Security Software Development Business Intelligence Enterprise Software Enterprise Architecture Outsourcing Strategy System Architecture Process Engineering Solution Architecture SaaS Requirements Gathering Information Technology System Deployment ERP Systems Analysis Visio Agile Methodologies See 35+     See less Program Management Team Leadership IT Management Service Management ITIL Disaster Recovery Product Management Management IT Service Management Process Improvement Integration Cross-functional Team... Business Analysis Requirements Analysis Vendor Management Change Management SDLC Project Management IT Operations IT Strategy Software Project... Agile Project Management Project Portfolio... Business Process... PMO Software Documentation Testing SharePoint Cloud Computing Data Center Business Process PMP Security Software Development Business Intelligence Enterprise Software Enterprise Architecture Outsourcing Strategy System Architecture Process Engineering Solution Architecture SaaS Requirements Gathering Information Technology System Deployment ERP Systems Analysis Visio Agile Methodologies See 35+     See less Program Management Team Leadership IT Management Service Management ITIL Disaster Recovery Product Management Management IT Service Management Process Improvement Integration Cross-functional Team... Business Analysis Requirements Analysis Vendor Management Change Management SDLC Project Management IT Operations IT Strategy Software Project... Agile Project Management Project Portfolio... Business Process... PMO Software Documentation Testing SharePoint Cloud Computing Data Center Business Process PMP Security Software Development Business Intelligence Enterprise Software Enterprise Architecture Outsourcing Strategy System Architecture Process Engineering Solution Architecture SaaS Requirements Gathering Information Technology System Deployment ERP Systems Analysis Visio Agile Methodologies See 35+     See less Honors & Awards Intel Achievement Award Intel Corporation 2000 The Intel Achievement Award is Intel's highest achievement recognition. This award was issued for expedient eradication and safeguard against multiple computer virus attacks, including the Melissa virus, by developing and delivering first-ever strategies and solutions to protect Intel’s assets.  Division Recognition Award Intel Information Technology Division 2013 Systematized the service landings process to increase quality and accelerate the transformation of IT organization to a service-based delivery model. Division Recognition Award Intel Information Technology Division 2013 Eliminated $4M software license risk of IT needing to engage the prior vendor due to some catastrophic production platform issue by successfully migrating IT to the new Service Now platform. Folsom Excellence Award Intel Folsom Site VPs 2004 For outstanding contributions as the co-lead of Folsom's first Expo which increased business acumen, educated employees on career development, and built pride across Intel's Folsom Campus. Division Recognition Award Intel Information Technology Division 2003 In recognition for outstanding contribution to Intel's bottom line by allowing Intel and IT to save over $2.8 million in site costs Division Recognition Award Intel Information Technology Division 2001 In recognition for the phenomenal results to the Nimba Virus Non-IT service Project in demonstrating Intel values. 9,000+ services were identified and registered and over 4,000 non-IT servers patched and cleaned. Division Recognition Award Intel Sales and Marketing Division 2001 Delivered Intel’s eBusiness message to the Java community at JavaOne. From definition through execution, ensured successful delivery of a solutions based gold booth with collateral pieces, demos, and signage with our ISV partners. Division Recognition Award Intel Information Technology Division 1999 In recognition for significant contribution, dedication, and committment to the worldwide deployment of Information Technology's next generation of core products to it's customers, including Microsoft NTW 4.0, Windows 98, IE4, Office 97, Outlook 98, and McAfee 3.2. Division Recognition Award Intel Information Technology Division 1999 Continuity Management - For phenominal results and cross-site IT teamwork in role modeling Results Orientation, Customer Orientation, Disciple, and Quality values during the Melissa Virus event. Intel Americas Recognition Award Intel Sales and Marketing Division 1999 In recognition of engaging with IBM Corporation early enough in the process to shape the program for mutual benefit and achieving IBM Corporation's committment to be a co-traveler in this effort. Division Recognition Award Intel Information Technology Division For contribution to the APAC messaging improvement team, and for role modeling Customer Orientation by addressing key customer issues, and driving and communicating solutions. Division Recognition Award Intel Information Technology Division 1993 For embracing all of Intel's values successfully deploying cc:Mail for Windows 2.0 on a worldwide scope on the original scheduled release date. Division Recognition Award Intel Materials Division 1992 For embracing the Intel values of Risk Taking and Results Orientation in the implementation of the first PowerBuilder/SQL service business application at Intel which was used to effectively manage Corporate Capital Acquisitions  Division Recognition Award Intel Materials Division 1990 Implemented Electronic Data Interchange for Intel’s Materials division enabling the electronic acceptance and processing of purchase orders. Division Recognition Award Intel Finance Division 1988 In appreciation for your dedication and committment to the success of the Accounts Payable Upgrade Project Division Recognition Award Intel Finance Division 1987 In recogntion of the successful implementation of the Hong Kong Accounts Payable system. Additional Honors & Awards Numerous Service Recognition Awards, Certificates of Appreciation, and Spontaneous Recognitions Intel Achievement Award Intel Corporation 2000 The Intel Achievement Award is Intel's highest achievement recognition. This award was issued for expedient eradication and safeguard against multiple computer virus attacks, including the Melissa virus, by developing and delivering first-ever strategies and solutions to protect Intel’s assets.  Intel Achievement Award Intel Corporation 2000 The Intel Achievement Award is Intel's highest achievement recognition. This award was issued for expedient eradication and safeguard against multiple computer virus attacks, including the Melissa virus, by developing and delivering first-ever strategies and solutions to protect Intel’s assets.  Intel Achievement Award Intel Corporation 2000 The Intel Achievement Award is Intel's highest achievement recognition. This award was issued for expedient eradication and safeguard against multiple computer virus attacks, including the Melissa virus, by developing and delivering first-ever strategies and solutions to protect Intel’s assets.  Division Recognition Award Intel Information Technology Division 2013 Systematized the service landings process to increase quality and accelerate the transformation of IT organization to a service-based delivery model. Division Recognition Award Intel Information Technology Division 2013 Systematized the service landings process to increase quality and accelerate the transformation of IT organization to a service-based delivery model. Division Recognition Award Intel Information Technology Division 2013 Systematized the service landings process to increase quality and accelerate the transformation of IT organization to a service-based delivery model. Division Recognition Award Intel Information Technology Division 2013 Eliminated $4M software license risk of IT needing to engage the prior vendor due to some catastrophic production platform issue by successfully migrating IT to the new Service Now platform. Division Recognition Award Intel Information Technology Division 2013 Eliminated $4M software license risk of IT needing to engage the prior vendor due to some catastrophic production platform issue by successfully migrating IT to the new Service Now platform. Division Recognition Award Intel Information Technology Division 2013 Eliminated $4M software license risk of IT needing to engage the prior vendor due to some catastrophic production platform issue by successfully migrating IT to the new Service Now platform. Folsom Excellence Award Intel Folsom Site VPs 2004 For outstanding contributions as the co-lead of Folsom's first Expo which increased business acumen, educated employees on career development, and built pride across Intel's Folsom Campus. Folsom Excellence Award Intel Folsom Site VPs 2004 For outstanding contributions as the co-lead of Folsom's first Expo which increased business acumen, educated employees on career development, and built pride across Intel's Folsom Campus. Folsom Excellence Award Intel Folsom Site VPs 2004 For outstanding contributions as the co-lead of Folsom's first Expo which increased business acumen, educated employees on career development, and built pride across Intel's Folsom Campus. Division Recognition Award Intel Information Technology Division 2003 In recognition for outstanding contribution to Intel's bottom line by allowing Intel and IT to save over $2.8 million in site costs Division Recognition Award Intel Information Technology Division 2003 In recognition for outstanding contribution to Intel's bottom line by allowing Intel and IT to save over $2.8 million in site costs Division Recognition Award Intel Information Technology Division 2003 In recognition for outstanding contribution to Intel's bottom line by allowing Intel and IT to save over $2.8 million in site costs Division Recognition Award Intel Information Technology Division 2001 In recognition for the phenomenal results to the Nimba Virus Non-IT service Project in demonstrating Intel values. 9,000+ services were identified and registered and over 4,000 non-IT servers patched and cleaned. Division Recognition Award Intel Information Technology Division 2001 In recognition for the phenomenal results to the Nimba Virus Non-IT service Project in demonstrating Intel values. 9,000+ services were identified and registered and over 4,000 non-IT servers patched and cleaned. Division Recognition Award Intel Information Technology Division 2001 In recognition for the phenomenal results to the Nimba Virus Non-IT service Project in demonstrating Intel values. 9,000+ services were identified and registered and over 4,000 non-IT servers patched and cleaned. Division Recognition Award Intel Sales and Marketing Division 2001 Delivered Intel’s eBusiness message to the Java community at JavaOne. From definition through execution, ensured successful delivery of a solutions based gold booth with collateral pieces, demos, and signage with our ISV partners. Division Recognition Award Intel Sales and Marketing Division 2001 Delivered Intel’s eBusiness message to the Java community at JavaOne. From definition through execution, ensured successful delivery of a solutions based gold booth with collateral pieces, demos, and signage with our ISV partners. Division Recognition Award Intel Sales and Marketing Division 2001 Delivered Intel’s eBusiness message to the Java community at JavaOne. From definition through execution, ensured successful delivery of a solutions based gold booth with collateral pieces, demos, and signage with our ISV partners. Division Recognition Award Intel Information Technology Division 1999 In recognition for significant contribution, dedication, and committment to the worldwide deployment of Information Technology's next generation of core products to it's customers, including Microsoft NTW 4.0, Windows 98, IE4, Office 97, Outlook 98, and McAfee 3.2. Division Recognition Award Intel Information Technology Division 1999 In recognition for significant contribution, dedication, and committment to the worldwide deployment of Information Technology's next generation of core products to it's customers, including Microsoft NTW 4.0, Windows 98, IE4, Office 97, Outlook 98, and McAfee 3.2. Division Recognition Award Intel Information Technology Division 1999 In recognition for significant contribution, dedication, and committment to the worldwide deployment of Information Technology's next generation of core products to it's customers, including Microsoft NTW 4.0, Windows 98, IE4, Office 97, Outlook 98, and McAfee 3.2. Division Recognition Award Intel Information Technology Division 1999 Continuity Management - For phenominal results and cross-site IT teamwork in role modeling Results Orientation, Customer Orientation, Disciple, and Quality values during the Melissa Virus event. Division Recognition Award Intel Information Technology Division 1999 Continuity Management - For phenominal results and cross-site IT teamwork in role modeling Results Orientation, Customer Orientation, Disciple, and Quality values during the Melissa Virus event. Division Recognition Award Intel Information Technology Division 1999 Continuity Management - For phenominal results and cross-site IT teamwork in role modeling Results Orientation, Customer Orientation, Disciple, and Quality values during the Melissa Virus event. Intel Americas Recognition Award Intel Sales and Marketing Division 1999 In recognition of engaging with IBM Corporation early enough in the process to shape the program for mutual benefit and achieving IBM Corporation's committment to be a co-traveler in this effort. Intel Americas Recognition Award Intel Sales and Marketing Division 1999 In recognition of engaging with IBM Corporation early enough in the process to shape the program for mutual benefit and achieving IBM Corporation's committment to be a co-traveler in this effort. Intel Americas Recognition Award Intel Sales and Marketing Division 1999 In recognition of engaging with IBM Corporation early enough in the process to shape the program for mutual benefit and achieving IBM Corporation's committment to be a co-traveler in this effort. Division Recognition Award Intel Information Technology Division For contribution to the APAC messaging improvement team, and for role modeling Customer Orientation by addressing key customer issues, and driving and communicating solutions. Division Recognition Award Intel Information Technology Division For contribution to the APAC messaging improvement team, and for role modeling Customer Orientation by addressing key customer issues, and driving and communicating solutions. Division Recognition Award Intel Information Technology Division For contribution to the APAC messaging improvement team, and for role modeling Customer Orientation by addressing key customer issues, and driving and communicating solutions. Division Recognition Award Intel Information Technology Division 1993 For embracing all of Intel's values successfully deploying cc:Mail for Windows 2.0 on a worldwide scope on the original scheduled release date. Division Recognition Award Intel Information Technology Division 1993 For embracing all of Intel's values successfully deploying cc:Mail for Windows 2.0 on a worldwide scope on the original scheduled release date. Division Recognition Award Intel Information Technology Division 1993 For embracing all of Intel's values successfully deploying cc:Mail for Windows 2.0 on a worldwide scope on the original scheduled release date. Division Recognition Award Intel Materials Division 1992 For embracing the Intel values of Risk Taking and Results Orientation in the implementation of the first PowerBuilder/SQL service business application at Intel which was used to effectively manage Corporate Capital Acquisitions  Division Recognition Award Intel Materials Division 1992 For embracing the Intel values of Risk Taking and Results Orientation in the implementation of the first PowerBuilder/SQL service business application at Intel which was used to effectively manage Corporate Capital Acquisitions  Division Recognition Award Intel Materials Division 1992 For embracing the Intel values of Risk Taking and Results Orientation in the implementation of the first PowerBuilder/SQL service business application at Intel which was used to effectively manage Corporate Capital Acquisitions  Division Recognition Award Intel Materials Division 1990 Implemented Electronic Data Interchange for Intel’s Materials division enabling the electronic acceptance and processing of purchase orders. Division Recognition Award Intel Materials Division 1990 Implemented Electronic Data Interchange for Intel’s Materials division enabling the electronic acceptance and processing of purchase orders. Division Recognition Award Intel Materials Division 1990 Implemented Electronic Data Interchange for Intel’s Materials division enabling the electronic acceptance and processing of purchase orders. Division Recognition Award Intel Finance Division 1988 In appreciation for your dedication and committment to the success of the Accounts Payable Upgrade Project Division Recognition Award Intel Finance Division 1988 In appreciation for your dedication and committment to the success of the Accounts Payable Upgrade Project Division Recognition Award Intel Finance Division 1988 In appreciation for your dedication and committment to the success of the Accounts Payable Upgrade Project Division Recognition Award Intel Finance Division 1987 In recogntion of the successful implementation of the Hong Kong Accounts Payable system. Division Recognition Award Intel Finance Division 1987 In recogntion of the successful implementation of the Hong Kong Accounts Payable system. Division Recognition Award Intel Finance Division 1987 In recogntion of the successful implementation of the Hong Kong Accounts Payable system. Additional Honors & Awards Numerous Service Recognition Awards, Certificates of Appreciation, and Spontaneous Recognitions Additional Honors & Awards Numerous Service Recognition Awards, Certificates of Appreciation, and Spontaneous Recognitions Additional Honors & Awards Numerous Service Recognition Awards, Certificates of Appreciation, and Spontaneous Recognitions "]}