{"position": "Student Services", "company": "Stanford University", "profiles": ["Skills Human Resources Product Management Time Management Employee Relations Skills  Human Resources Product Management Time Management Employee Relations Human Resources Product Management Time Management Employee Relations Human Resources Product Management Time Management Employee Relations ", "Experience Student Services Stanford University July 1989  –  January 2006  (16 years 7 months) Retired Stanford University July 1989  –  January 2006  (16 years 7 months) Student Services Stanford University July 1989  –  January 2006  (16 years 7 months) Student Services Stanford University July 1989  –  January 2006  (16 years 7 months) Retired Stanford University July 1989  –  January 2006  (16 years 7 months) Retired Stanford University July 1989  –  January 2006  (16 years 7 months) ", "Experience Student Services Stanford University Student Services Specialist Stanford University October 2006  – Present (8 years 11 months) Student Services Stanford University Student Services Stanford University Student Services Specialist Stanford University October 2006  – Present (8 years 11 months) Student Services Specialist Stanford University October 2006  – Present (8 years 11 months) Education Hawaii Pacific University BS,  Psychology 2000  – 2004 Santa Clara University MA,  Higher Education 2008 Hawaii Pacific University BS,  Psychology 2000  – 2004 Hawaii Pacific University BS,  Psychology 2000  – 2004 Hawaii Pacific University BS,  Psychology 2000  – 2004 Santa Clara University MA,  Higher Education 2008 Santa Clara University MA,  Higher Education 2008 Santa Clara University MA,  Higher Education 2008 ", "Experience Associate Professor of Student Services Stanford University Associate Professor of Student Services Stanford University Associate Professor of Student Services Stanford University ", "Experience Student Services Stanford University Student Services Stanford University Student Services Stanford University ", "Experience Student Services Stanford University Student Services Stanford University Student Services Stanford University ", "Experience Admissions & Student Services Stanford University GSB PHD Program October 2005  – Present (9 years 11 months) Admissions and Student Svces Stanford Univ - Electrical Engineering November 2000  –  September 2003  (2 years 11 months) Electrical Engineering Admissions and Student Services MBA Application Coordinator Stanford Univ Graduate School Bus November 1993  –  October 2000  (7 years) Admissions for MBA Program Admissions & Student Services Stanford University GSB PHD Program October 2005  – Present (9 years 11 months) Admissions & Student Services Stanford University GSB PHD Program October 2005  – Present (9 years 11 months) Admissions and Student Svces Stanford Univ - Electrical Engineering November 2000  –  September 2003  (2 years 11 months) Electrical Engineering Admissions and Student Services Admissions and Student Svces Stanford Univ - Electrical Engineering November 2000  –  September 2003  (2 years 11 months) Electrical Engineering Admissions and Student Services MBA Application Coordinator Stanford Univ Graduate School Bus November 1993  –  October 2000  (7 years) Admissions for MBA Program MBA Application Coordinator Stanford Univ Graduate School Bus November 1993  –  October 2000  (7 years) Admissions for MBA Program Education Foothill College AS,  Social Science 1981  – 1983 Foothill College AS,  Social Science 1981  – 1983 Foothill College AS,  Social Science 1981  – 1983 Foothill College AS,  Social Science 1981  – 1983 ", "Summary Versatile, highly organized office professional known for a “can-do, get-it-done” attitude while multi-tasking and balancing priorities in fast-paced environments.  \n \nExcellent at managing budgets and resources, space planning, calendars, events, AP/AR, expense reports, and special projects. \n \nA champion of office culture and creating environments that make people want to come to work. \n \nEffectively communicate and collaborate with a diverse range of people and job functions including executives, investors, customers, vendors, and colleagues locally and globally. \n \nTechnology savvy: MS Office, Google Apps, Adobe Creative Suite, HTML/CSS, WordPress, Dropbox Summary Versatile, highly organized office professional known for a “can-do, get-it-done” attitude while multi-tasking and balancing priorities in fast-paced environments.  \n \nExcellent at managing budgets and resources, space planning, calendars, events, AP/AR, expense reports, and special projects. \n \nA champion of office culture and creating environments that make people want to come to work. \n \nEffectively communicate and collaborate with a diverse range of people and job functions including executives, investors, customers, vendors, and colleagues locally and globally. \n \nTechnology savvy: MS Office, Google Apps, Adobe Creative Suite, HTML/CSS, WordPress, Dropbox Versatile, highly organized office professional known for a “can-do, get-it-done” attitude while multi-tasking and balancing priorities in fast-paced environments.  \n \nExcellent at managing budgets and resources, space planning, calendars, events, AP/AR, expense reports, and special projects. \n \nA champion of office culture and creating environments that make people want to come to work. \n \nEffectively communicate and collaborate with a diverse range of people and job functions including executives, investors, customers, vendors, and colleagues locally and globally. \n \nTechnology savvy: MS Office, Google Apps, Adobe Creative Suite, HTML/CSS, WordPress, Dropbox Versatile, highly organized office professional known for a “can-do, get-it-done” attitude while multi-tasking and balancing priorities in fast-paced environments.  \n \nExcellent at managing budgets and resources, space planning, calendars, events, AP/AR, expense reports, and special projects. \n \nA champion of office culture and creating environments that make people want to come to work. \n \nEffectively communicate and collaborate with a diverse range of people and job functions including executives, investors, customers, vendors, and colleagues locally and globally. \n \nTechnology savvy: MS Office, Google Apps, Adobe Creative Suite, HTML/CSS, WordPress, Dropbox Experience Chair Administrator Stanford University 2015  – Present (less than a year) Board Director Palo Alto Farmers' Market 2009  – Present (6 years) Administrative Associate & Student Services Stanford University 2014  –  2015  (1 year) Office Manager / Executive Assistant Impermium 2012  –  2014  (2 years) Business Owner, Chef Season to Season 2001  –  2011  (10 years) Marketing Manager Ventro Corporation 1999  –  2000  (1 year) Marketing Manager Portal Software, Inc. 1997  –  1999  (2 years) Marketing and Business Development Adobe Systems 1990  –  1997  (7 years) Chair Administrator Stanford University 2015  – Present (less than a year) Chair Administrator Stanford University 2015  – Present (less than a year) Board Director Palo Alto Farmers' Market 2009  – Present (6 years) Board Director Palo Alto Farmers' Market 2009  – Present (6 years) Administrative Associate & Student Services Stanford University 2014  –  2015  (1 year) Administrative Associate & Student Services Stanford University 2014  –  2015  (1 year) Office Manager / Executive Assistant Impermium 2012  –  2014  (2 years) Office Manager / Executive Assistant Impermium 2012  –  2014  (2 years) Business Owner, Chef Season to Season 2001  –  2011  (10 years) Business Owner, Chef Season to Season 2001  –  2011  (10 years) Marketing Manager Ventro Corporation 1999  –  2000  (1 year) Marketing Manager Ventro Corporation 1999  –  2000  (1 year) Marketing Manager Portal Software, Inc. 1997  –  1999  (2 years) Marketing Manager Portal Software, Inc. 1997  –  1999  (2 years) Marketing and Business Development Adobe Systems 1990  –  1997  (7 years) Marketing and Business Development Adobe Systems 1990  –  1997  (7 years) Skills Start-ups Office Management Office Administration Google Apps Social Media Marketing Marketing Communications Newsletters Adobe Creative Suite Web Design Editing Web Content Graphic Design Writing Executive Level... MS Office Suite Skills  Start-ups Office Management Office Administration Google Apps Social Media Marketing Marketing Communications Newsletters Adobe Creative Suite Web Design Editing Web Content Graphic Design Writing Executive Level... MS Office Suite Start-ups Office Management Office Administration Google Apps Social Media Marketing Marketing Communications Newsletters Adobe Creative Suite Web Design Editing Web Content Graphic Design Writing Executive Level... MS Office Suite Start-ups Office Management Office Administration Google Apps Social Media Marketing Marketing Communications Newsletters Adobe Creative Suite Web Design Editing Web Content Graphic Design Writing Executive Level... MS Office Suite ", "Experience Financial Analyst Stanford University School of Medicine 2014  – Present (1 year) Grants Coordinator Stanford University School of Medicine 2013  –  2014  (1 year) Staff Assistant/Visitor Relations Stony Brook University 2010  –  2013  (3 years) Human Resources/Student Services Stanford University 2007  –  2010  (3 years) Financial Aid Analyst California State University, East Bay 2006  –  2007  (1 year) Unix and Linux Server Support California Department of Corrections and Rehabilitation 2005  –  2006  (1 year) Financial Analyst Stanford University School of Medicine 2014  – Present (1 year) Financial Analyst Stanford University School of Medicine 2014  – Present (1 year) Grants Coordinator Stanford University School of Medicine 2013  –  2014  (1 year) Grants Coordinator Stanford University School of Medicine 2013  –  2014  (1 year) Staff Assistant/Visitor Relations Stony Brook University 2010  –  2013  (3 years) Staff Assistant/Visitor Relations Stony Brook University 2010  –  2013  (3 years) Human Resources/Student Services Stanford University 2007  –  2010  (3 years) Human Resources/Student Services Stanford University 2007  –  2010  (3 years) Financial Aid Analyst California State University, East Bay 2006  –  2007  (1 year) Financial Aid Analyst California State University, East Bay 2006  –  2007  (1 year) Unix and Linux Server Support California Department of Corrections and Rehabilitation 2005  –  2006  (1 year) Unix and Linux Server Support California Department of Corrections and Rehabilitation 2005  –  2006  (1 year) Skills Student Affairs Student Counseling Higher Education Microsoft Office Social Media Customer Service PowerPoint LaTeX Program Development Event Planning Nonprofits Tutoring Data Analysis Leadership Event Management Resume Writing Microsoft Word Leadership Development Outlook Grants See 5+     See less Skills  Student Affairs Student Counseling Higher Education Microsoft Office Social Media Customer Service PowerPoint LaTeX Program Development Event Planning Nonprofits Tutoring Data Analysis Leadership Event Management Resume Writing Microsoft Word Leadership Development Outlook Grants See 5+     See less Student Affairs Student Counseling Higher Education Microsoft Office Social Media Customer Service PowerPoint LaTeX Program Development Event Planning Nonprofits Tutoring Data Analysis Leadership Event Management Resume Writing Microsoft Word Leadership Development Outlook Grants See 5+     See less Student Affairs Student Counseling Higher Education Microsoft Office Social Media Customer Service PowerPoint LaTeX Program Development Event Planning Nonprofits Tutoring Data Analysis Leadership Event Management Resume Writing Microsoft Word Leadership Development Outlook Grants See 5+     See less Education Stony Brook University MA,  Higher Education Administration 2011  – 2013 Scripps College BA,  Math Stony Brook University MA,  Higher Education Administration 2011  – 2013 Stony Brook University MA,  Higher Education Administration 2011  – 2013 Stony Brook University MA,  Higher Education Administration 2011  – 2013 Scripps College BA,  Math Scripps College BA,  Math Scripps College BA,  Math ", "Experience Student Services Manager Stanford University February 2012  – Present (3 years 7 months) Department of Psychology Student Services Stanford University May 2008  –  February 2012  (3 years 10 months) ICA, Stanford Research Administration UC Berkeley March 2004  –  May 2006  (2 years 3 months) Student Services Manager Stanford University February 2012  – Present (3 years 7 months) Department of Psychology Student Services Manager Stanford University February 2012  – Present (3 years 7 months) Department of Psychology Student Services Stanford University May 2008  –  February 2012  (3 years 10 months) ICA, Stanford Student Services Stanford University May 2008  –  February 2012  (3 years 10 months) ICA, Stanford Research Administration UC Berkeley March 2004  –  May 2006  (2 years 3 months) Research Administration UC Berkeley March 2004  –  May 2006  (2 years 3 months) Skills Student Affairs Student Engagement Higher Education... Skills  Student Affairs Student Engagement Higher Education... Student Affairs Student Engagement Higher Education... Student Affairs Student Engagement Higher Education... ", "Experience Student Services Stanford University January 2000  – Present (15 years 8 months) current position 2012-present Student Services Stanford University January 2000  – Present (15 years 8 months) current position 2012-present Student Services Stanford University January 2000  – Present (15 years 8 months) current position 2012-present ", "Experience Director of External Relations/Student Services Stanford University September 2011  – Present (4 years) Director of External Relations/Student Services Stanford University September 2011  – Present (4 years) Director of External Relations/Student Services Stanford University September 2011  – Present (4 years) Education University of Southern California Masters of Communication Management 2014  – 2016 Stanford University Sociology 2001  – 2005 University of Southern California Masters of Communication Management 2014  – 2016 University of Southern California Masters of Communication Management 2014  – 2016 University of Southern California Masters of Communication Management 2014  – 2016 Stanford University Sociology 2001  – 2005 Stanford University Sociology 2001  – 2005 Stanford University Sociology 2001  – 2005 ", "Experience Computer Information Systems Analyst Stanford University April 2012  – Present (3 years 5 months) Stanford, CA IT Services Computer Resource Consulting (CRC) provides for-fee computer support to Stanford schools, departments and institutions. CRC offers clients the time- and cost-saving advantages of having their own Stanford knowledgeable departmental IT support without having to manage IT staff themselves. \n \nI provide cross-team support for all CRC contracted clients. IT Manager Stanford University June 2005  –  April 2012  (6 years 11 months) Computer Information Systems Analyst Stanford University 1991  –  2005  (14 years) Student Services Stanford University August 1989  –  March 1991  (1 year 8 months) Computer Information Systems Analyst Stanford University April 2012  – Present (3 years 5 months) Stanford, CA IT Services Computer Resource Consulting (CRC) provides for-fee computer support to Stanford schools, departments and institutions. CRC offers clients the time- and cost-saving advantages of having their own Stanford knowledgeable departmental IT support without having to manage IT staff themselves. \n \nI provide cross-team support for all CRC contracted clients. Computer Information Systems Analyst Stanford University April 2012  – Present (3 years 5 months) Stanford, CA IT Services Computer Resource Consulting (CRC) provides for-fee computer support to Stanford schools, departments and institutions. CRC offers clients the time- and cost-saving advantages of having their own Stanford knowledgeable departmental IT support without having to manage IT staff themselves. \n \nI provide cross-team support for all CRC contracted clients. IT Manager Stanford University June 2005  –  April 2012  (6 years 11 months) IT Manager Stanford University June 2005  –  April 2012  (6 years 11 months) Computer Information Systems Analyst Stanford University 1991  –  2005  (14 years) Computer Information Systems Analyst Stanford University 1991  –  2005  (14 years) Student Services Stanford University August 1989  –  March 1991  (1 year 8 months) Student Services Stanford University August 1989  –  March 1991  (1 year 8 months) Languages   Skills Kick-ass customer... Customer Service Technical Support Management Team Leadership Microsoft Word Microsoft Office Mac OS X OS X Higher Education Research Public Speaking Windows Databases IT Service Management Desktop Computers Information Technology Troubleshooting Editing Social Media Configuration Management Technical Writing See 7+     See less Skills  Kick-ass customer... Customer Service Technical Support Management Team Leadership Microsoft Word Microsoft Office Mac OS X OS X Higher Education Research Public Speaking Windows Databases IT Service Management Desktop Computers Information Technology Troubleshooting Editing Social Media Configuration Management Technical Writing See 7+     See less Kick-ass customer... Customer Service Technical Support Management Team Leadership Microsoft Word Microsoft Office Mac OS X OS X Higher Education Research Public Speaking Windows Databases IT Service Management Desktop Computers Information Technology Troubleshooting Editing Social Media Configuration Management Technical Writing See 7+     See less Kick-ass customer... Customer Service Technical Support Management Team Leadership Microsoft Word Microsoft Office Mac OS X OS X Higher Education Research Public Speaking Windows Databases IT Service Management Desktop Computers Information Technology Troubleshooting Editing Social Media Configuration Management Technical Writing See 7+     See less Education Stanford University Continuing Education ,  Stanford Technical Leadership Program 2010  – 2011 The Stanford Technical Leadership Program is designed to support individual growth as well as the development of an IT community at Stanford that can work more effectively across organizations to deliver the information technology our University needs to achieve its mission. \n \nThis program provides an additional opportunity for leaders of technical strategy and operations, to work together to identify and resolve issues as well as to define and propose opportunities to improve Stanford. University of North Carolina at Wilmington BA,  English 1986  – 1989 Studied English Literature. Activities and Societies:  Crew Team Stanford University Continuing Education ,  Stanford Technical Leadership Program 2010  – 2011 The Stanford Technical Leadership Program is designed to support individual growth as well as the development of an IT community at Stanford that can work more effectively across organizations to deliver the information technology our University needs to achieve its mission. \n \nThis program provides an additional opportunity for leaders of technical strategy and operations, to work together to identify and resolve issues as well as to define and propose opportunities to improve Stanford. Stanford University Continuing Education ,  Stanford Technical Leadership Program 2010  – 2011 The Stanford Technical Leadership Program is designed to support individual growth as well as the development of an IT community at Stanford that can work more effectively across organizations to deliver the information technology our University needs to achieve its mission. \n \nThis program provides an additional opportunity for leaders of technical strategy and operations, to work together to identify and resolve issues as well as to define and propose opportunities to improve Stanford. Stanford University Continuing Education ,  Stanford Technical Leadership Program 2010  – 2011 The Stanford Technical Leadership Program is designed to support individual growth as well as the development of an IT community at Stanford that can work more effectively across organizations to deliver the information technology our University needs to achieve its mission. \n \nThis program provides an additional opportunity for leaders of technical strategy and operations, to work together to identify and resolve issues as well as to define and propose opportunities to improve Stanford. University of North Carolina at Wilmington BA,  English 1986  – 1989 Studied English Literature. Activities and Societies:  Crew Team University of North Carolina at Wilmington BA,  English 1986  – 1989 Studied English Literature. Activities and Societies:  Crew Team University of North Carolina at Wilmington BA,  English 1986  – 1989 Studied English Literature. Activities and Societies:  Crew Team Honors & Awards ", "Experience Financial Specialist for Student Services Stanford University November 2013  – Present (1 year 10 months) Stanford, CA Contract Work Self Employed October 2002  –  November 2013  (11 years 2 months) Interior design and remodel services. Part time junior tennis instructor and coach Peninsula Community Center September 2012  –  October 2013  (1 year 2 months) Redwood City, Ca Financial Manager Stanford University School of Medicine August 1997  –  August 2002  (5 years 1 month) Administrative/Financial Assistant Stanford University School of Medicine July 1995  –  August 1997  (2 years 2 months) Financial Specialist for Student Services Stanford University November 2013  – Present (1 year 10 months) Stanford, CA Financial Specialist for Student Services Stanford University November 2013  – Present (1 year 10 months) Stanford, CA Contract Work Self Employed October 2002  –  November 2013  (11 years 2 months) Interior design and remodel services. Contract Work Self Employed October 2002  –  November 2013  (11 years 2 months) Interior design and remodel services. Part time junior tennis instructor and coach Peninsula Community Center September 2012  –  October 2013  (1 year 2 months) Redwood City, Ca Part time junior tennis instructor and coach Peninsula Community Center September 2012  –  October 2013  (1 year 2 months) Redwood City, Ca Financial Manager Stanford University School of Medicine August 1997  –  August 2002  (5 years 1 month) Financial Manager Stanford University School of Medicine August 1997  –  August 2002  (5 years 1 month) Administrative/Financial Assistant Stanford University School of Medicine July 1995  –  August 1997  (2 years 2 months) Administrative/Financial Assistant Stanford University School of Medicine July 1995  –  August 1997  (2 years 2 months) Skills Grant Administration Grant Preparation Interior Design Textile Design Construction Drawings Tiling Birthday Cakes Skills  Grant Administration Grant Preparation Interior Design Textile Design Construction Drawings Tiling Birthday Cakes Grant Administration Grant Preparation Interior Design Textile Design Construction Drawings Tiling Birthday Cakes Grant Administration Grant Preparation Interior Design Textile Design Construction Drawings Tiling Birthday Cakes Education San Diego State University-California State University 1990  – 1992 San Jose State University Bachelor of Arts (B.A.),  Administration of Justice 1992  – 1993 Canada College Residential and Commercial Interior Design 2012  – 2014 Courses for accreditation with the American Society of Interior Designers (ASID) San Diego State University-California State University 1990  – 1992 San Diego State University-California State University 1990  – 1992 San Diego State University-California State University 1990  – 1992 San Jose State University Bachelor of Arts (B.A.),  Administration of Justice 1992  – 1993 San Jose State University Bachelor of Arts (B.A.),  Administration of Justice 1992  – 1993 San Jose State University Bachelor of Arts (B.A.),  Administration of Justice 1992  – 1993 Canada College Residential and Commercial Interior Design 2012  – 2014 Courses for accreditation with the American Society of Interior Designers (ASID) Canada College Residential and Commercial Interior Design 2012  – 2014 Courses for accreditation with the American Society of Interior Designers (ASID) Canada College Residential and Commercial Interior Design 2012  – 2014 Courses for accreditation with the American Society of Interior Designers (ASID) ", "Skills Training Student Affairs Account Management Customer Service Project Management Management OS X Product Management Skills  Training Student Affairs Account Management Customer Service Project Management Management OS X Product Management Training Student Affairs Account Management Customer Service Project Management Management OS X Product Management Training Student Affairs Account Management Customer Service Project Management Management OS X Product Management ", "Summary Project/program manager skilled in driving communications between IT/QA/Business and cross functional groups as well as experience working with Change Management, Support and Release Management Organizations. Experience working with geographically dispersed groups. Successful Change Control lead for a large organization as well as running Release Readiness and Post Go Live Support projects. Extensive global training program management experience delivering world wide technical trainings. Program manage global training teams; Deliver training with the best-suited technology; Drive organizational efficiency by establishing effective processes and procedures; Strong research, presentation, communication and organizational skills; Course development that includes creation of End-User reference guides and documentation. Strong skills include running board meetings,developing project schedules, tracking multiple tasks, communicating status, managing complicated logistics and delivering under demanding deadlines. Member: PMI, ASTD. Specialties:Project Management Professional (PMP #1239441), ScrumMaster (CSM) Certification, Certificate in E-Learning Instructional Design, project/program management of geographically dispersed teams, global training program management. Detail oriented and able to see the big picture, effective communicator with all levels of management, ability to deliver under demanding deadlines. Wiki, Powerpoint, Excel, Work, MS Project, PPM, Dreamweaver Summary Project/program manager skilled in driving communications between IT/QA/Business and cross functional groups as well as experience working with Change Management, Support and Release Management Organizations. Experience working with geographically dispersed groups. Successful Change Control lead for a large organization as well as running Release Readiness and Post Go Live Support projects. Extensive global training program management experience delivering world wide technical trainings. Program manage global training teams; Deliver training with the best-suited technology; Drive organizational efficiency by establishing effective processes and procedures; Strong research, presentation, communication and organizational skills; Course development that includes creation of End-User reference guides and documentation. Strong skills include running board meetings,developing project schedules, tracking multiple tasks, communicating status, managing complicated logistics and delivering under demanding deadlines. Member: PMI, ASTD. Specialties:Project Management Professional (PMP #1239441), ScrumMaster (CSM) Certification, Certificate in E-Learning Instructional Design, project/program management of geographically dispersed teams, global training program management. Detail oriented and able to see the big picture, effective communicator with all levels of management, ability to deliver under demanding deadlines. Wiki, Powerpoint, Excel, Work, MS Project, PPM, Dreamweaver Project/program manager skilled in driving communications between IT/QA/Business and cross functional groups as well as experience working with Change Management, Support and Release Management Organizations. Experience working with geographically dispersed groups. Successful Change Control lead for a large organization as well as running Release Readiness and Post Go Live Support projects. Extensive global training program management experience delivering world wide technical trainings. Program manage global training teams; Deliver training with the best-suited technology; Drive organizational efficiency by establishing effective processes and procedures; Strong research, presentation, communication and organizational skills; Course development that includes creation of End-User reference guides and documentation. Strong skills include running board meetings,developing project schedules, tracking multiple tasks, communicating status, managing complicated logistics and delivering under demanding deadlines. Member: PMI, ASTD. Specialties:Project Management Professional (PMP #1239441), ScrumMaster (CSM) Certification, Certificate in E-Learning Instructional Design, project/program management of geographically dispersed teams, global training program management. Detail oriented and able to see the big picture, effective communicator with all levels of management, ability to deliver under demanding deadlines. Wiki, Powerpoint, Excel, Work, MS Project, PPM, Dreamweaver Project/program manager skilled in driving communications between IT/QA/Business and cross functional groups as well as experience working with Change Management, Support and Release Management Organizations. Experience working with geographically dispersed groups. Successful Change Control lead for a large organization as well as running Release Readiness and Post Go Live Support projects. Extensive global training program management experience delivering world wide technical trainings. Program manage global training teams; Deliver training with the best-suited technology; Drive organizational efficiency by establishing effective processes and procedures; Strong research, presentation, communication and organizational skills; Course development that includes creation of End-User reference guides and documentation. Strong skills include running board meetings,developing project schedules, tracking multiple tasks, communicating status, managing complicated logistics and delivering under demanding deadlines. Member: PMI, ASTD. Specialties:Project Management Professional (PMP #1239441), ScrumMaster (CSM) Certification, Certificate in E-Learning Instructional Design, project/program management of geographically dispersed teams, global training program management. Detail oriented and able to see the big picture, effective communicator with all levels of management, ability to deliver under demanding deadlines. Wiki, Powerpoint, Excel, Work, MS Project, PPM, Dreamweaver Experience Project Manager Cisco 2014  – Present (1 year) San Jose, CA Project Manager for Outcomes based Implementation Programs Project Manager McAfee 2011  –  2014  (3 years) Santa Clara, CA Project Manager, Strategic Technology Partners IT Group \n \nProject manage the global rollout of an order management system that processes 75% of McAfee revenue leading geographically dispersed teams from various functional areas and working cross functionally with over 6 cross functional teams. \n \nOverall management of milestones and deliverables including development and maintenance of the Project Plan. \n•\tLead daily Development/QA status calls to drive the project schedule and obtain closure on action items.  \n•\tDetermine and manage the release process and schedule for System Testing, UAT, Go Live Cutover, post go live production fixes and point releases. \n•\tWork with QA team to project manage Failover/Failback testing. Work with Order Operations and IT Analyst for UAT. \n•\tCreate and manage change requests. Present requests to the Change Assessment Board. \n•\tDevelop and deliver Change Management; Communications; Go Live Cutover and Post Go Live Support plans. \n•\tProject manage delivery of SOX controls, Disaster Recovery and Small Order Automation Projects. \n \nManage, control, monitor issues, risks and mitigation. \n \nPresentation and Communications \no\tFacilitate bi-weekly status meetings with Steering Committee; daily sunrise calls; and daily working sessions or weekly checkpoints with business, QA, Development, Production Support, Enterprise Architecture Support teams as necessary. \no Deliver weekly communications of project status via Powerpoint slide presentations, Sharepoint and Navigator (Project Management software) reports to Steering Committee, PMO Governance and other stakeholders. Project Manager Cisco Systems May 2010  –  May 2011  (1 year 1 month) Promoted March 2011 as the Lead of PMO Shared Services Team – within 10 months of starting in this group. \n \nLead the Cisco Services Commerce Change Control Board (CCB) that manages changes requests (CR) of all service and subscription business applications ($2.6 billion business) \n \nImplement the agreed upon CCB process designed to ensure that all impacted teams understand the scope of the change, minimize scope creep and manage code contention across the organization. This project and process is 100% virtual. \n \nDrive effective bi-weekly board meetings with over 80 members world-wide with change request presentations, questions and discussions, assessment and follow-ups. \n \nLearned new role in two months to execute the change request assessment process from 65% to 95% completion within the 5-day SLA agreement. \n \nReport CR status at weekly Cisco Services Release meetings. \n \nCollaborate with Release Management Organizations regarding release scopes and change requests \n \nDevelop and deliver metrics at tollgates in the release process. \n \nTechnologies used: WebEx; PowerPoint; PROPEL: Project Management document repository; Wiki; EDM: Enterprise Data Management document repository \n \nCreate slide decks and conduct trainings for stakeholders (virtually in groups or individually). \n \nDesign Wiki pages to display relevant release related information and CCB training slide decks and documents. \n \nOrganize the EDM structure for the team. \n \nReadiness Review Lead for quarterly releases. \n \nDrive the review process with Program Leads to minimize risks in 1st and 2nd test cycles. \n \nPresent overall status to Executive Leadership for Go/No Go decision. \n \nPMO Shift Lead for Post Go-Live support release of mission critical world-wide applications. \n \nDrive support processes for effective function of the War Room. \n \nProvide effective escalation management of issues. Program Manager, Student Services Stanford University January 2006  –  February 2007  (1 year 2 months) Managed the department's graduate colloquium, directed graduate assistants, maintained the colloquium website. \n \nOrganized and managed the department's commencement ceremony. \n \nWrote and designed a marketing poster and brochure that increased the graduate applicant pool by 50%. \n \nBecame fully productive in two weeks, learned a new database system, two processes, and two software applications. Portal Program Manager for Developer Portal Group, Forte for Java (FFJ) Sun Microsystems 2001  –  2002  (1 year) Key player in integrating a third party company (Forte) into Sun. \n1. Took the initiative to set up and run integration meetings between engineers from Sun and Forte \n2. Enabled transfer of Third Party Forte software into Sun ensuring that all of Sun's legal guidelines were met \n \nDeveloped and launched AMP (Added Modules Program) to enable Partners to submit modules to the FFJ; created an AMP program plan for partners and internal contributors; created and lead the AMP team; worked across eight functional groups Program Manger of Technology Based Training, Global Training Resources (GTR) Sun Microsystems 2000  –  2001  (1 year) Provided e-training for service engineers worldwide to support products effectively by product release dates. \n \nResearched available and emerging e-technologies as alternatives to classroom teaching. Led new program. \n \nSelected Placeware and negotiated vendor contract. \n \nLed a virtual team of three people to create and test e-training infrastructure based on Placeware. \n \nConvinced manager to use unproven technology at Sun under severe budget constraints. \n \nSynchronized delivery of the class with global training team. \n \nDelivered ten live world-wide trainings over four months. Reduced travel expenses by more than 50% per class with 90% customer satisfaction. \n \nDesigned, maintained and developed content for a central website with information on e-technologies. Site was referenced in SunU classes and in a company news article. Technical Training Program Manager for Systems Engineers, SunU Sun Microsystems 1999  –  2000  (1 year) Redesigned the SE training website to improve navigation and customer satisfaction \n \nEstablished process to re-design the site, implemented changes using HTML, improved website navigation and doubled customer satisfaction. \n \nDoubled training revenue in nine months  \n \nWorked with field managers and SEs to determine technical tracks for Technical and Professional Curriculum Maps. \n \nCreated new courses, marketed and promoted program to the field. Tracked revenue for regular reports; Used an in-house LMS for effective course management. \n \nManaged the program and delivered training, increased SE course offerings by 25%. Program Manager of Worldwide Technical Training, Enterprise Services Sun Microsystems 1998  –  1999  (1 year) Developed departmental processes to reduce the Support Readiness Training (SRT) development time.  \n \nWrote and implemented processes such as Materials Acquisition and Review processes for Train the Trainer programs, reduced SRT development time by 50%. \n \nDeveloped an Initial Training Strategy Data chart to track new products, increased communication with groups in ES. Project Coordinator, Enterprise Services Sun Microsystems 1997  –  1998  (1 year) Redesigned the Project Life Cycle (PLC) intranet site to improve usability and create a standard look and feel \n \nMinimized number of clicks to access and navigate website and created site map increasing user satisfaction by 100%. \n \nLearned and used PERL, JavaScript and HTML in two months to design and develop a web-based “Acronym Search Tool” to facilitate decoding acronyms. \n \nDesigned and maintained a Program Management PLC Action Item tracking mechanism for field and program managers between the US and Japan Technical Services Group Technical Writer/Software Trainer Data House April 1989  –  September 1989  (6 months) Prepared customized end-user guides for software applications and used these materials to teach three-day courses to business administrators. Course Developer, Trainer and Customer Support IRIS Health Information Systems Corporation 1986  –  1988  (2 years) Co-led user functional analysis task for a data base management system to track records (medical/billing) and worked with marketing managers, computer engineers and hospital administrators to develop initial specifications. \n \nPerformed QA on resultant data base management system implementation. \n \nPrepared end-user reference guides to lead four-day technical seminars for senior hospital managers and administrators. \n \nProvided technical support to customers and prepared product enhancement documentation. Microcomputer Support Center Specialist Yale University 1985  –  1986  (1 year) Prepared customized user guides for WordPerfect and MacDraw features. \n \nTaught software applications, provided technical support/sales recommendations to Yale students and faculty. Project Manager Cisco 2014  – Present (1 year) San Jose, CA Project Manager for Outcomes based Implementation Programs Project Manager Cisco 2014  – Present (1 year) San Jose, CA Project Manager for Outcomes based Implementation Programs Project Manager McAfee 2011  –  2014  (3 years) Santa Clara, CA Project Manager, Strategic Technology Partners IT Group \n \nProject manage the global rollout of an order management system that processes 75% of McAfee revenue leading geographically dispersed teams from various functional areas and working cross functionally with over 6 cross functional teams. \n \nOverall management of milestones and deliverables including development and maintenance of the Project Plan. \n•\tLead daily Development/QA status calls to drive the project schedule and obtain closure on action items.  \n•\tDetermine and manage the release process and schedule for System Testing, UAT, Go Live Cutover, post go live production fixes and point releases. \n•\tWork with QA team to project manage Failover/Failback testing. Work with Order Operations and IT Analyst for UAT. \n•\tCreate and manage change requests. Present requests to the Change Assessment Board. \n•\tDevelop and deliver Change Management; Communications; Go Live Cutover and Post Go Live Support plans. \n•\tProject manage delivery of SOX controls, Disaster Recovery and Small Order Automation Projects. \n \nManage, control, monitor issues, risks and mitigation. \n \nPresentation and Communications \no\tFacilitate bi-weekly status meetings with Steering Committee; daily sunrise calls; and daily working sessions or weekly checkpoints with business, QA, Development, Production Support, Enterprise Architecture Support teams as necessary. \no Deliver weekly communications of project status via Powerpoint slide presentations, Sharepoint and Navigator (Project Management software) reports to Steering Committee, PMO Governance and other stakeholders. Project Manager McAfee 2011  –  2014  (3 years) Santa Clara, CA Project Manager, Strategic Technology Partners IT Group \n \nProject manage the global rollout of an order management system that processes 75% of McAfee revenue leading geographically dispersed teams from various functional areas and working cross functionally with over 6 cross functional teams. \n \nOverall management of milestones and deliverables including development and maintenance of the Project Plan. \n•\tLead daily Development/QA status calls to drive the project schedule and obtain closure on action items.  \n•\tDetermine and manage the release process and schedule for System Testing, UAT, Go Live Cutover, post go live production fixes and point releases. \n•\tWork with QA team to project manage Failover/Failback testing. Work with Order Operations and IT Analyst for UAT. \n•\tCreate and manage change requests. Present requests to the Change Assessment Board. \n•\tDevelop and deliver Change Management; Communications; Go Live Cutover and Post Go Live Support plans. \n•\tProject manage delivery of SOX controls, Disaster Recovery and Small Order Automation Projects. \n \nManage, control, monitor issues, risks and mitigation. \n \nPresentation and Communications \no\tFacilitate bi-weekly status meetings with Steering Committee; daily sunrise calls; and daily working sessions or weekly checkpoints with business, QA, Development, Production Support, Enterprise Architecture Support teams as necessary. \no Deliver weekly communications of project status via Powerpoint slide presentations, Sharepoint and Navigator (Project Management software) reports to Steering Committee, PMO Governance and other stakeholders. Project Manager Cisco Systems May 2010  –  May 2011  (1 year 1 month) Promoted March 2011 as the Lead of PMO Shared Services Team – within 10 months of starting in this group. \n \nLead the Cisco Services Commerce Change Control Board (CCB) that manages changes requests (CR) of all service and subscription business applications ($2.6 billion business) \n \nImplement the agreed upon CCB process designed to ensure that all impacted teams understand the scope of the change, minimize scope creep and manage code contention across the organization. This project and process is 100% virtual. \n \nDrive effective bi-weekly board meetings with over 80 members world-wide with change request presentations, questions and discussions, assessment and follow-ups. \n \nLearned new role in two months to execute the change request assessment process from 65% to 95% completion within the 5-day SLA agreement. \n \nReport CR status at weekly Cisco Services Release meetings. \n \nCollaborate with Release Management Organizations regarding release scopes and change requests \n \nDevelop and deliver metrics at tollgates in the release process. \n \nTechnologies used: WebEx; PowerPoint; PROPEL: Project Management document repository; Wiki; EDM: Enterprise Data Management document repository \n \nCreate slide decks and conduct trainings for stakeholders (virtually in groups or individually). \n \nDesign Wiki pages to display relevant release related information and CCB training slide decks and documents. \n \nOrganize the EDM structure for the team. \n \nReadiness Review Lead for quarterly releases. \n \nDrive the review process with Program Leads to minimize risks in 1st and 2nd test cycles. \n \nPresent overall status to Executive Leadership for Go/No Go decision. \n \nPMO Shift Lead for Post Go-Live support release of mission critical world-wide applications. \n \nDrive support processes for effective function of the War Room. \n \nProvide effective escalation management of issues. Project Manager Cisco Systems May 2010  –  May 2011  (1 year 1 month) Promoted March 2011 as the Lead of PMO Shared Services Team – within 10 months of starting in this group. \n \nLead the Cisco Services Commerce Change Control Board (CCB) that manages changes requests (CR) of all service and subscription business applications ($2.6 billion business) \n \nImplement the agreed upon CCB process designed to ensure that all impacted teams understand the scope of the change, minimize scope creep and manage code contention across the organization. This project and process is 100% virtual. \n \nDrive effective bi-weekly board meetings with over 80 members world-wide with change request presentations, questions and discussions, assessment and follow-ups. \n \nLearned new role in two months to execute the change request assessment process from 65% to 95% completion within the 5-day SLA agreement. \n \nReport CR status at weekly Cisco Services Release meetings. \n \nCollaborate with Release Management Organizations regarding release scopes and change requests \n \nDevelop and deliver metrics at tollgates in the release process. \n \nTechnologies used: WebEx; PowerPoint; PROPEL: Project Management document repository; Wiki; EDM: Enterprise Data Management document repository \n \nCreate slide decks and conduct trainings for stakeholders (virtually in groups or individually). \n \nDesign Wiki pages to display relevant release related information and CCB training slide decks and documents. \n \nOrganize the EDM structure for the team. \n \nReadiness Review Lead for quarterly releases. \n \nDrive the review process with Program Leads to minimize risks in 1st and 2nd test cycles. \n \nPresent overall status to Executive Leadership for Go/No Go decision. \n \nPMO Shift Lead for Post Go-Live support release of mission critical world-wide applications. \n \nDrive support processes for effective function of the War Room. \n \nProvide effective escalation management of issues. Program Manager, Student Services Stanford University January 2006  –  February 2007  (1 year 2 months) Managed the department's graduate colloquium, directed graduate assistants, maintained the colloquium website. \n \nOrganized and managed the department's commencement ceremony. \n \nWrote and designed a marketing poster and brochure that increased the graduate applicant pool by 50%. \n \nBecame fully productive in two weeks, learned a new database system, two processes, and two software applications. Program Manager, Student Services Stanford University January 2006  –  February 2007  (1 year 2 months) Managed the department's graduate colloquium, directed graduate assistants, maintained the colloquium website. \n \nOrganized and managed the department's commencement ceremony. \n \nWrote and designed a marketing poster and brochure that increased the graduate applicant pool by 50%. \n \nBecame fully productive in two weeks, learned a new database system, two processes, and two software applications. Portal Program Manager for Developer Portal Group, Forte for Java (FFJ) Sun Microsystems 2001  –  2002  (1 year) Key player in integrating a third party company (Forte) into Sun. \n1. Took the initiative to set up and run integration meetings between engineers from Sun and Forte \n2. Enabled transfer of Third Party Forte software into Sun ensuring that all of Sun's legal guidelines were met \n \nDeveloped and launched AMP (Added Modules Program) to enable Partners to submit modules to the FFJ; created an AMP program plan for partners and internal contributors; created and lead the AMP team; worked across eight functional groups Portal Program Manager for Developer Portal Group, Forte for Java (FFJ) Sun Microsystems 2001  –  2002  (1 year) Key player in integrating a third party company (Forte) into Sun. \n1. Took the initiative to set up and run integration meetings between engineers from Sun and Forte \n2. Enabled transfer of Third Party Forte software into Sun ensuring that all of Sun's legal guidelines were met \n \nDeveloped and launched AMP (Added Modules Program) to enable Partners to submit modules to the FFJ; created an AMP program plan for partners and internal contributors; created and lead the AMP team; worked across eight functional groups Program Manger of Technology Based Training, Global Training Resources (GTR) Sun Microsystems 2000  –  2001  (1 year) Provided e-training for service engineers worldwide to support products effectively by product release dates. \n \nResearched available and emerging e-technologies as alternatives to classroom teaching. Led new program. \n \nSelected Placeware and negotiated vendor contract. \n \nLed a virtual team of three people to create and test e-training infrastructure based on Placeware. \n \nConvinced manager to use unproven technology at Sun under severe budget constraints. \n \nSynchronized delivery of the class with global training team. \n \nDelivered ten live world-wide trainings over four months. Reduced travel expenses by more than 50% per class with 90% customer satisfaction. \n \nDesigned, maintained and developed content for a central website with information on e-technologies. Site was referenced in SunU classes and in a company news article. Program Manger of Technology Based Training, Global Training Resources (GTR) Sun Microsystems 2000  –  2001  (1 year) Provided e-training for service engineers worldwide to support products effectively by product release dates. \n \nResearched available and emerging e-technologies as alternatives to classroom teaching. Led new program. \n \nSelected Placeware and negotiated vendor contract. \n \nLed a virtual team of three people to create and test e-training infrastructure based on Placeware. \n \nConvinced manager to use unproven technology at Sun under severe budget constraints. \n \nSynchronized delivery of the class with global training team. \n \nDelivered ten live world-wide trainings over four months. Reduced travel expenses by more than 50% per class with 90% customer satisfaction. \n \nDesigned, maintained and developed content for a central website with information on e-technologies. Site was referenced in SunU classes and in a company news article. Technical Training Program Manager for Systems Engineers, SunU Sun Microsystems 1999  –  2000  (1 year) Redesigned the SE training website to improve navigation and customer satisfaction \n \nEstablished process to re-design the site, implemented changes using HTML, improved website navigation and doubled customer satisfaction. \n \nDoubled training revenue in nine months  \n \nWorked with field managers and SEs to determine technical tracks for Technical and Professional Curriculum Maps. \n \nCreated new courses, marketed and promoted program to the field. Tracked revenue for regular reports; Used an in-house LMS for effective course management. \n \nManaged the program and delivered training, increased SE course offerings by 25%. Technical Training Program Manager for Systems Engineers, SunU Sun Microsystems 1999  –  2000  (1 year) Redesigned the SE training website to improve navigation and customer satisfaction \n \nEstablished process to re-design the site, implemented changes using HTML, improved website navigation and doubled customer satisfaction. \n \nDoubled training revenue in nine months  \n \nWorked with field managers and SEs to determine technical tracks for Technical and Professional Curriculum Maps. \n \nCreated new courses, marketed and promoted program to the field. Tracked revenue for regular reports; Used an in-house LMS for effective course management. \n \nManaged the program and delivered training, increased SE course offerings by 25%. Program Manager of Worldwide Technical Training, Enterprise Services Sun Microsystems 1998  –  1999  (1 year) Developed departmental processes to reduce the Support Readiness Training (SRT) development time.  \n \nWrote and implemented processes such as Materials Acquisition and Review processes for Train the Trainer programs, reduced SRT development time by 50%. \n \nDeveloped an Initial Training Strategy Data chart to track new products, increased communication with groups in ES. Program Manager of Worldwide Technical Training, Enterprise Services Sun Microsystems 1998  –  1999  (1 year) Developed departmental processes to reduce the Support Readiness Training (SRT) development time.  \n \nWrote and implemented processes such as Materials Acquisition and Review processes for Train the Trainer programs, reduced SRT development time by 50%. \n \nDeveloped an Initial Training Strategy Data chart to track new products, increased communication with groups in ES. Project Coordinator, Enterprise Services Sun Microsystems 1997  –  1998  (1 year) Redesigned the Project Life Cycle (PLC) intranet site to improve usability and create a standard look and feel \n \nMinimized number of clicks to access and navigate website and created site map increasing user satisfaction by 100%. \n \nLearned and used PERL, JavaScript and HTML in two months to design and develop a web-based “Acronym Search Tool” to facilitate decoding acronyms. \n \nDesigned and maintained a Program Management PLC Action Item tracking mechanism for field and program managers between the US and Japan Technical Services Group Project Coordinator, Enterprise Services Sun Microsystems 1997  –  1998  (1 year) Redesigned the Project Life Cycle (PLC) intranet site to improve usability and create a standard look and feel \n \nMinimized number of clicks to access and navigate website and created site map increasing user satisfaction by 100%. \n \nLearned and used PERL, JavaScript and HTML in two months to design and develop a web-based “Acronym Search Tool” to facilitate decoding acronyms. \n \nDesigned and maintained a Program Management PLC Action Item tracking mechanism for field and program managers between the US and Japan Technical Services Group Technical Writer/Software Trainer Data House April 1989  –  September 1989  (6 months) Prepared customized end-user guides for software applications and used these materials to teach three-day courses to business administrators. Technical Writer/Software Trainer Data House April 1989  –  September 1989  (6 months) Prepared customized end-user guides for software applications and used these materials to teach three-day courses to business administrators. Course Developer, Trainer and Customer Support IRIS Health Information Systems Corporation 1986  –  1988  (2 years) Co-led user functional analysis task for a data base management system to track records (medical/billing) and worked with marketing managers, computer engineers and hospital administrators to develop initial specifications. \n \nPerformed QA on resultant data base management system implementation. \n \nPrepared end-user reference guides to lead four-day technical seminars for senior hospital managers and administrators. \n \nProvided technical support to customers and prepared product enhancement documentation. Course Developer, Trainer and Customer Support IRIS Health Information Systems Corporation 1986  –  1988  (2 years) Co-led user functional analysis task for a data base management system to track records (medical/billing) and worked with marketing managers, computer engineers and hospital administrators to develop initial specifications. \n \nPerformed QA on resultant data base management system implementation. \n \nPrepared end-user reference guides to lead four-day technical seminars for senior hospital managers and administrators. \n \nProvided technical support to customers and prepared product enhancement documentation. Microcomputer Support Center Specialist Yale University 1985  –  1986  (1 year) Prepared customized user guides for WordPerfect and MacDraw features. \n \nTaught software applications, provided technical support/sales recommendations to Yale students and faculty. Microcomputer Support Center Specialist Yale University 1985  –  1986  (1 year) Prepared customized user guides for WordPerfect and MacDraw features. \n \nTaught software applications, provided technical support/sales recommendations to Yale students and faculty. Skills MS Project Program Management Project Portfolio... Cross-functional Team... Integration SharePoint PMP Project Management Software Documentation Quality Assurance PMO Scrum Change Management Testing Management Enterprise Architecture Disaster Recovery Leadership SDLC Vendor Management Software Project... Microsoft Project Business Intelligence Training IT Strategy Business Process Cloud Computing Agile Project Management Requirements Analysis See 14+     See less Skills  MS Project Program Management Project Portfolio... Cross-functional Team... Integration SharePoint PMP Project Management Software Documentation Quality Assurance PMO Scrum Change Management Testing Management Enterprise Architecture Disaster Recovery Leadership SDLC Vendor Management Software Project... Microsoft Project Business Intelligence Training IT Strategy Business Process Cloud Computing Agile Project Management Requirements Analysis See 14+     See less MS Project Program Management Project Portfolio... Cross-functional Team... Integration SharePoint PMP Project Management Software Documentation Quality Assurance PMO Scrum Change Management Testing Management Enterprise Architecture Disaster Recovery Leadership SDLC Vendor Management Software Project... Microsoft Project Business Intelligence Training IT Strategy Business Process Cloud Computing Agile Project Management Requirements Analysis See 14+     See less MS Project Program Management Project Portfolio... Cross-functional Team... Integration SharePoint PMP Project Management Software Documentation Quality Assurance PMO Scrum Change Management Testing Management Enterprise Architecture Disaster Recovery Leadership SDLC Vendor Management Software Project... Microsoft Project Business Intelligence Training IT Strategy Business Process Cloud Computing Agile Project Management Requirements Analysis See 14+     See less Education Hawaii Preparatory Academy (HPA) Activities and Societies:  Cum Laude Stanford University Graduate Studies,  Japanese Art History University of Hawaii at Manoa M.A.,  Asian Studies and M.A. Japanese Art History Knowledge of Japanese culture and language - received two M.A. degrees from the University of Hawaii focusing both graduate programs in the study of Japanese culture and language. \n \nStudied in Japan for 2 years \n- Stanford Inter-University Center for Japanese Language Studies \n- Sophia/Jochi University Center for Japanese Language Studies \n \nReceived awards and recognition during graduate studies - \nJapan Foundation Fellowship  \nCrown Prince Akihito Award to study in Japan \nJames Shigeta Award for Japanese Studies Washington University in St. Louis B.A.,  Mathematics (Probability and Statistics) Graduated Dean's List Hawaii Preparatory Academy (HPA) Activities and Societies:  Cum Laude Hawaii Preparatory Academy (HPA) Activities and Societies:  Cum Laude Hawaii Preparatory Academy (HPA) Activities and Societies:  Cum Laude Stanford University Graduate Studies,  Japanese Art History Stanford University Graduate Studies,  Japanese Art History Stanford University Graduate Studies,  Japanese Art History University of Hawaii at Manoa M.A.,  Asian Studies and M.A. Japanese Art History Knowledge of Japanese culture and language - received two M.A. degrees from the University of Hawaii focusing both graduate programs in the study of Japanese culture and language. \n \nStudied in Japan for 2 years \n- Stanford Inter-University Center for Japanese Language Studies \n- Sophia/Jochi University Center for Japanese Language Studies \n \nReceived awards and recognition during graduate studies - \nJapan Foundation Fellowship  \nCrown Prince Akihito Award to study in Japan \nJames Shigeta Award for Japanese Studies University of Hawaii at Manoa M.A.,  Asian Studies and M.A. Japanese Art History Knowledge of Japanese culture and language - received two M.A. degrees from the University of Hawaii focusing both graduate programs in the study of Japanese culture and language. \n \nStudied in Japan for 2 years \n- Stanford Inter-University Center for Japanese Language Studies \n- Sophia/Jochi University Center for Japanese Language Studies \n \nReceived awards and recognition during graduate studies - \nJapan Foundation Fellowship  \nCrown Prince Akihito Award to study in Japan \nJames Shigeta Award for Japanese Studies University of Hawaii at Manoa M.A.,  Asian Studies and M.A. Japanese Art History Knowledge of Japanese culture and language - received two M.A. degrees from the University of Hawaii focusing both graduate programs in the study of Japanese culture and language. \n \nStudied in Japan for 2 years \n- Stanford Inter-University Center for Japanese Language Studies \n- Sophia/Jochi University Center for Japanese Language Studies \n \nReceived awards and recognition during graduate studies - \nJapan Foundation Fellowship  \nCrown Prince Akihito Award to study in Japan \nJames Shigeta Award for Japanese Studies Washington University in St. Louis B.A.,  Mathematics (Probability and Statistics) Graduated Dean's List Washington University in St. Louis B.A.,  Mathematics (Probability and Statistics) Graduated Dean's List Washington University in St. Louis B.A.,  Mathematics (Probability and Statistics) Graduated Dean's List Honors & Awards Additional Honors & Awards National Endowment for the Humanities Research Fellowship; MENSA Educational Scholarship; Crown Prince Akihito Scholarship for Foreign Language Studies; Japan Foundation Fellowship for Foreign Language Studies Additional Honors & Awards National Endowment for the Humanities Research Fellowship; MENSA Educational Scholarship; Crown Prince Akihito Scholarship for Foreign Language Studies; Japan Foundation Fellowship for Foreign Language Studies Additional Honors & Awards National Endowment for the Humanities Research Fellowship; MENSA Educational Scholarship; Crown Prince Akihito Scholarship for Foreign Language Studies; Japan Foundation Fellowship for Foreign Language Studies Additional Honors & Awards National Endowment for the Humanities Research Fellowship; MENSA Educational Scholarship; Crown Prince Akihito Scholarship for Foreign Language Studies; Japan Foundation Fellowship for Foreign Language Studies ", "Experience Personal Shopper and Sales Associate W by Worth March 2009  – Present (6 years 6 months) Burlingame, CA Personal Shopper Student Services/Event Coordinator Stanford University October 1993  –  March 2009  (15 years 6 months) Student Services Stanford University October 1993  –  March 2009  (15 years 6 months) Personal Shopper and Sales Associate W by Worth March 2009  – Present (6 years 6 months) Burlingame, CA Personal Shopper Personal Shopper and Sales Associate W by Worth March 2009  – Present (6 years 6 months) Burlingame, CA Personal Shopper Student Services/Event Coordinator Stanford University October 1993  –  March 2009  (15 years 6 months) Student Services/Event Coordinator Stanford University October 1993  –  March 2009  (15 years 6 months) Student Services Stanford University October 1993  –  March 2009  (15 years 6 months) Student Services Stanford University October 1993  –  March 2009  (15 years 6 months) Skills Event Planning Fashion Event Management Merchandising Sales Social Media Retail Marketing Communications Management Social Media Marketing Marketing Public Speaking Strategic Planning Social Networking Advertising Leadership Marketing Strategy Online Advertising Customer Service Public Relations Fundraising Entrepreneurship See 7+     See less Skills  Event Planning Fashion Event Management Merchandising Sales Social Media Retail Marketing Communications Management Social Media Marketing Marketing Public Speaking Strategic Planning Social Networking Advertising Leadership Marketing Strategy Online Advertising Customer Service Public Relations Fundraising Entrepreneurship See 7+     See less Event Planning Fashion Event Management Merchandising Sales Social Media Retail Marketing Communications Management Social Media Marketing Marketing Public Speaking Strategic Planning Social Networking Advertising Leadership Marketing Strategy Online Advertising Customer Service Public Relations Fundraising Entrepreneurship See 7+     See less Event Planning Fashion Event Management Merchandising Sales Social Media Retail Marketing Communications Management Social Media Marketing Marketing Public Speaking Strategic Planning Social Networking Advertising Leadership Marketing Strategy Online Advertising Customer Service Public Relations Fundraising Entrepreneurship See 7+     See less Education Notre Dame de Namur University BA,  English/General Elementary Credential 1955  – 1959 I also have a Pupil Personnel Credential and ABT for a Master's Degree in Education from Cal State University, Dominquez Hills Mercy High School, Burlingame, CA HS Diploma 1951  – 1955 Mercy High School, Burlingame, CA HS Diploma,  College Prep 1951  – 1955 Notre Dame de Namur University BA,  English/General Elementary Credential 1955  – 1959 I also have a Pupil Personnel Credential and ABT for a Master's Degree in Education from Cal State University, Dominquez Hills Notre Dame de Namur University BA,  English/General Elementary Credential 1955  – 1959 I also have a Pupil Personnel Credential and ABT for a Master's Degree in Education from Cal State University, Dominquez Hills Notre Dame de Namur University BA,  English/General Elementary Credential 1955  – 1959 I also have a Pupil Personnel Credential and ABT for a Master's Degree in Education from Cal State University, Dominquez Hills Mercy High School, Burlingame, CA HS Diploma 1951  – 1955 Mercy High School, Burlingame, CA HS Diploma 1951  – 1955 Mercy High School, Burlingame, CA HS Diploma 1951  – 1955 Mercy High School, Burlingame, CA HS Diploma,  College Prep 1951  – 1955 Mercy High School, Burlingame, CA HS Diploma,  College Prep 1951  – 1955 Mercy High School, Burlingame, CA HS Diploma,  College Prep 1951  – 1955 ", "Experience Student Services Stanford University January 2008  – Present (7 years 8 months) Sweet Hall Student Services Specialist for Stanford Introductory Studies, directly supporting the Thinking Matters Program and Integrated Learning Environments. In addition, responsible for the set up and maintenance of courses and seminars within these undergraduate programs. Student Services Stanford University January 2008  – Present (7 years 8 months) Sweet Hall Student Services Specialist for Stanford Introductory Studies, directly supporting the Thinking Matters Program and Integrated Learning Environments. In addition, responsible for the set up and maintenance of courses and seminars within these undergraduate programs. Student Services Stanford University January 2008  – Present (7 years 8 months) Sweet Hall Student Services Specialist for Stanford Introductory Studies, directly supporting the Thinking Matters Program and Integrated Learning Environments. In addition, responsible for the set up and maintenance of courses and seminars within these undergraduate programs. Skills Higher Education Event Planning Skills  Higher Education Event Planning Higher Education Event Planning Higher Education Event Planning Education University of San Francisco Bachelor's Degree,  Sociology 1999  – 2003 Activities and Societies:  Member of the Women's Soccer team. University of San Francisco Bachelor's Degree,  Sociology 1999  – 2003 Activities and Societies:  Member of the Women's Soccer team. University of San Francisco Bachelor's Degree,  Sociology 1999  – 2003 Activities and Societies:  Member of the Women's Soccer team. University of San Francisco Bachelor's Degree,  Sociology 1999  – 2003 Activities and Societies:  Member of the Women's Soccer team. ", "Experience Student Services Stanford University Student Services Stanford University Student Services Stanford University ", "Experience Student Services Stanford University 2001  – Present (14 years) Program Manager Agilent Technologies April 2000  –  April 2001  (1 year 1 month) Program Manager Hewlett-Packard October 1981  –  April 2000  (18 years 7 months) Palo Alto Student Services Stanford University 2001  – Present (14 years) Student Services Stanford University 2001  – Present (14 years) Program Manager Agilent Technologies April 2000  –  April 2001  (1 year 1 month) Program Manager Agilent Technologies April 2000  –  April 2001  (1 year 1 month) Program Manager Hewlett-Packard October 1981  –  April 2000  (18 years 7 months) Palo Alto Program Manager Hewlett-Packard October 1981  –  April 2000  (18 years 7 months) Palo Alto Skills Event Planning Nonprofits Community Outreach Public Relations Fundraising Volunteer Management Higher Education Program Development Public Speaking Student Affairs Research Skills  Event Planning Nonprofits Community Outreach Public Relations Fundraising Volunteer Management Higher Education Program Development Public Speaking Student Affairs Research Event Planning Nonprofits Community Outreach Public Relations Fundraising Volunteer Management Higher Education Program Development Public Speaking Student Affairs Research Event Planning Nonprofits Community Outreach Public Relations Fundraising Volunteer Management Higher Education Program Development Public Speaking Student Affairs Research Education UCSB Bachelor of Arts (BA),  Double Major: Business Economics and Psychology UCSB Bachelor of Arts (BA),  Double Major: Business Economics and Psychology UCSB Bachelor of Arts (BA),  Double Major: Business Economics and Psychology UCSB Bachelor of Arts (BA),  Double Major: Business Economics and Psychology ", "Experience Administration-Student Services Stanford University Administration-Student Services Stanford University Administration-Student Services Stanford University ", "Experience Student Services Stanford University Student Services Stanford University Student Services Stanford University ", "Experience Director, Office of Diversity, Inclusion, & Outreach David Geffen School of Medicine at UCLA February 2015  – Present (7 months) Los Angeles, CA Owner J Taborn Consulting, Career Coaching and Consultation January 2010  – Present (5 years 8 months) Beverly Hills, CA Career Coaching and consultation through educational transitions. PhD, post docs, Underrepresented populations, 1st generation college students, professionals, seniors/adults, women, LGBT, Associate Director Counseling Services UCLA Career Center November 2007  –  February 2015  (7 years 4 months) Direct a staff of 15-20 professional career counselors and interns in the provision of career counseling, assessment and programming for undergraduate and graduate students \n \nInstructor/Course Designer, ED 150 Strategic Career Decision Making  \nOversight , Career Counseling Internship Progarm Lecturer UCLA Graduate School of Education and Information Sciences, Master of Education, Student Affairs May 2008  –  February 2014  (5 years 10 months) Los Angeles Post Doctoral Fellow Program in Human Sexuality University of Minnesota 2003  –  2005  (2 years) Associate Director for Career Development Northwestern University 2000  –  2003  (3 years) Career Counselor, Graduate Student Services Stanford University Career Development Center August 1997  –  August 2000  (3 years 1 month) Psychology Intern, Counseling and Psychological Services, UC Berkeley September 1996  –  September 1997  (1 year 1 month) -Provided individual short term psychotherapy and assessment services to undergraduate through PhD students (Under supervision) \n-Liasion to residence halls and African American Student Center \n-Provided referrals \n-Trained in and Provided supervision and training of Psychology Career Counseling and Social Work interns \n-Trained in administration and interpretation of psychological assessments Extern, (OCCD) Office of Counseling and Career Development U S General Accounting Association, August 1995  –  June 1996  (11 months) -Provided psycholgical services to employees of the GAO \n-Consulted with managers regarding employee mental health  \n-Co - led a Women in Career Transition Support Group \n-Trained in administration of career assessments \n-Assisted employees with job application and materials \n-Developed staff development lunch series workshops and created referral services Director, Office of Diversity, Inclusion, & Outreach David Geffen School of Medicine at UCLA February 2015  – Present (7 months) Los Angeles, CA Director, Office of Diversity, Inclusion, & Outreach David Geffen School of Medicine at UCLA February 2015  – Present (7 months) Los Angeles, CA Owner J Taborn Consulting, Career Coaching and Consultation January 2010  – Present (5 years 8 months) Beverly Hills, CA Career Coaching and consultation through educational transitions. PhD, post docs, Underrepresented populations, 1st generation college students, professionals, seniors/adults, women, LGBT, Owner J Taborn Consulting, Career Coaching and Consultation January 2010  – Present (5 years 8 months) Beverly Hills, CA Career Coaching and consultation through educational transitions. PhD, post docs, Underrepresented populations, 1st generation college students, professionals, seniors/adults, women, LGBT, Associate Director Counseling Services UCLA Career Center November 2007  –  February 2015  (7 years 4 months) Direct a staff of 15-20 professional career counselors and interns in the provision of career counseling, assessment and programming for undergraduate and graduate students \n \nInstructor/Course Designer, ED 150 Strategic Career Decision Making  \nOversight , Career Counseling Internship Progarm Associate Director Counseling Services UCLA Career Center November 2007  –  February 2015  (7 years 4 months) Direct a staff of 15-20 professional career counselors and interns in the provision of career counseling, assessment and programming for undergraduate and graduate students \n \nInstructor/Course Designer, ED 150 Strategic Career Decision Making  \nOversight , Career Counseling Internship Progarm Lecturer UCLA Graduate School of Education and Information Sciences, Master of Education, Student Affairs May 2008  –  February 2014  (5 years 10 months) Los Angeles Lecturer UCLA Graduate School of Education and Information Sciences, Master of Education, Student Affairs May 2008  –  February 2014  (5 years 10 months) Los Angeles Post Doctoral Fellow Program in Human Sexuality University of Minnesota 2003  –  2005  (2 years) Post Doctoral Fellow Program in Human Sexuality University of Minnesota 2003  –  2005  (2 years) Associate Director for Career Development Northwestern University 2000  –  2003  (3 years) Associate Director for Career Development Northwestern University 2000  –  2003  (3 years) Career Counselor, Graduate Student Services Stanford University Career Development Center August 1997  –  August 2000  (3 years 1 month) Career Counselor, Graduate Student Services Stanford University Career Development Center August 1997  –  August 2000  (3 years 1 month) Psychology Intern, Counseling and Psychological Services, UC Berkeley September 1996  –  September 1997  (1 year 1 month) -Provided individual short term psychotherapy and assessment services to undergraduate through PhD students (Under supervision) \n-Liasion to residence halls and African American Student Center \n-Provided referrals \n-Trained in and Provided supervision and training of Psychology Career Counseling and Social Work interns \n-Trained in administration and interpretation of psychological assessments Psychology Intern, Counseling and Psychological Services, UC Berkeley September 1996  –  September 1997  (1 year 1 month) -Provided individual short term psychotherapy and assessment services to undergraduate through PhD students (Under supervision) \n-Liasion to residence halls and African American Student Center \n-Provided referrals \n-Trained in and Provided supervision and training of Psychology Career Counseling and Social Work interns \n-Trained in administration and interpretation of psychological assessments Extern, (OCCD) Office of Counseling and Career Development U S General Accounting Association, August 1995  –  June 1996  (11 months) -Provided psycholgical services to employees of the GAO \n-Consulted with managers regarding employee mental health  \n-Co - led a Women in Career Transition Support Group \n-Trained in administration of career assessments \n-Assisted employees with job application and materials \n-Developed staff development lunch series workshops and created referral services Extern, (OCCD) Office of Counseling and Career Development U S General Accounting Association, August 1995  –  June 1996  (11 months) -Provided psycholgical services to employees of the GAO \n-Consulted with managers regarding employee mental health  \n-Co - led a Women in Career Transition Support Group \n-Trained in administration of career assessments \n-Assisted employees with job application and materials \n-Developed staff development lunch series workshops and created referral services Languages Spanish moderate Spanish moderate Spanish moderate Skills Higher Education Career Counseling Student Affairs Career Development Teaching Program Development Grant Writing Public Speaking Research Community Outreach Job Search Strategies Academic Advising Science Staff Development Resume Writing Psychology Student Development Program Evaluation Event Planning University Teaching See 5+     See less Skills  Higher Education Career Counseling Student Affairs Career Development Teaching Program Development Grant Writing Public Speaking Research Community Outreach Job Search Strategies Academic Advising Science Staff Development Resume Writing Psychology Student Development Program Evaluation Event Planning University Teaching See 5+     See less Higher Education Career Counseling Student Affairs Career Development Teaching Program Development Grant Writing Public Speaking Research Community Outreach Job Search Strategies Academic Advising Science Staff Development Resume Writing Psychology Student Development Program Evaluation Event Planning University Teaching See 5+     See less Higher Education Career Counseling Student Affairs Career Development Teaching Program Development Grant Writing Public Speaking Research Community Outreach Job Search Strategies Academic Advising Science Staff Development Resume Writing Psychology Student Development Program Evaluation Event Planning University Teaching See 5+     See less Education Post Doctoral Fellow, University of Minnesota Medical School Post Doc,  Program in Human Sexuality 2003  – 2005 Howard University PhD, 2000; BS 1990,  Counseling Psychology 1993  – 2000 Dissertation \nVariation in Selected Parent Variables in Parents' Perception of Biracial (African American/White) Children's Early Racial Identification \nSpecializations: College Student Mental Health, Multiracial Family Development, Career Development Activities and Societies:  Psi Chi Honor Society in Psychology\nCRESPAR ,  Journal of Negro Education University of Pennsylvania MSEd,  Psychological Services in Education 1990  – 1991 Breck School 1977  – 1985 UCLA Anderson School of Management Certificate of Completion,  African American Leadership Institute ,  Executive Leadership Post Doctoral Fellow, University of Minnesota Medical School Post Doc,  Program in Human Sexuality 2003  – 2005 Post Doctoral Fellow, University of Minnesota Medical School Post Doc,  Program in Human Sexuality 2003  – 2005 Post Doctoral Fellow, University of Minnesota Medical School Post Doc,  Program in Human Sexuality 2003  – 2005 Howard University PhD, 2000; BS 1990,  Counseling Psychology 1993  – 2000 Dissertation \nVariation in Selected Parent Variables in Parents' Perception of Biracial (African American/White) Children's Early Racial Identification \nSpecializations: College Student Mental Health, Multiracial Family Development, Career Development Activities and Societies:  Psi Chi Honor Society in Psychology\nCRESPAR ,  Journal of Negro Education Howard University PhD, 2000; BS 1990,  Counseling Psychology 1993  – 2000 Dissertation \nVariation in Selected Parent Variables in Parents' Perception of Biracial (African American/White) Children's Early Racial Identification \nSpecializations: College Student Mental Health, Multiracial Family Development, Career Development Activities and Societies:  Psi Chi Honor Society in Psychology\nCRESPAR ,  Journal of Negro Education Howard University PhD, 2000; BS 1990,  Counseling Psychology 1993  – 2000 Dissertation \nVariation in Selected Parent Variables in Parents' Perception of Biracial (African American/White) Children's Early Racial Identification \nSpecializations: College Student Mental Health, Multiracial Family Development, Career Development Activities and Societies:  Psi Chi Honor Society in Psychology\nCRESPAR ,  Journal of Negro Education University of Pennsylvania MSEd,  Psychological Services in Education 1990  – 1991 University of Pennsylvania MSEd,  Psychological Services in Education 1990  – 1991 University of Pennsylvania MSEd,  Psychological Services in Education 1990  – 1991 Breck School 1977  – 1985 Breck School 1977  – 1985 Breck School 1977  – 1985 UCLA Anderson School of Management Certificate of Completion,  African American Leadership Institute ,  Executive Leadership UCLA Anderson School of Management Certificate of Completion,  African American Leadership Institute ,  Executive Leadership UCLA Anderson School of Management Certificate of Completion,  African American Leadership Institute ,  Executive Leadership Honors & Awards Additional Honors & Awards James LuValle Award, UCLA Graduate Students Association \nFellow, U of Minnesota Program in Human Sexuality \nTuition Award, Howard University Graduate School \nTuition Award, Howard Univeristy School of Education  \nTuition Award, Multidiciplinary Center for Gerontology \nScholar, Minority Access to Research Careers (MARC) \nHoward University Alumni Association \nUniversity of Pennsylvania Alumni Association \nWho's Who American College Students Additional Honors & Awards James LuValle Award, UCLA Graduate Students Association \nFellow, U of Minnesota Program in Human Sexuality \nTuition Award, Howard University Graduate School \nTuition Award, Howard Univeristy School of Education  \nTuition Award, Multidiciplinary Center for Gerontology \nScholar, Minority Access to Research Careers (MARC) \nHoward University Alumni Association \nUniversity of Pennsylvania Alumni Association \nWho's Who American College Students Additional Honors & Awards James LuValle Award, UCLA Graduate Students Association \nFellow, U of Minnesota Program in Human Sexuality \nTuition Award, Howard University Graduate School \nTuition Award, Howard Univeristy School of Education  \nTuition Award, Multidiciplinary Center for Gerontology \nScholar, Minority Access to Research Careers (MARC) \nHoward University Alumni Association \nUniversity of Pennsylvania Alumni Association \nWho's Who American College Students Additional Honors & Awards James LuValle Award, UCLA Graduate Students Association \nFellow, U of Minnesota Program in Human Sexuality \nTuition Award, Howard University Graduate School \nTuition Award, Howard Univeristy School of Education  \nTuition Award, Multidiciplinary Center for Gerontology \nScholar, Minority Access to Research Careers (MARC) \nHoward University Alumni Association \nUniversity of Pennsylvania Alumni Association \nWho's Who American College Students "]}