{"position": "Supply Planner", "company": "Intel Corporation", "profiles": ["Experience Merchandise Planning Manager Gap Inc. August 2005  – Present (10 years 1 month) Product Supply Planner Intel Corporation 2000  –  2003  (3 years) Merchandise Planning Manager Gap Inc. August 2005  – Present (10 years 1 month) Merchandise Planning Manager Gap Inc. August 2005  – Present (10 years 1 month) Product Supply Planner Intel Corporation 2000  –  2003  (3 years) Product Supply Planner Intel Corporation 2000  –  2003  (3 years) Education Santa Clara University 1996  – 2000 Santa Clara University 1996  – 2000 Santa Clara University 1996  – 2000 Santa Clara University 1996  – 2000 ", "Experience Supply Planner Intel Corporation January 2013  – Present (2 years 8 months) Supply Chain Analyst (Rotation) Intel Corporation May 2011  –  January 2013  (1 year 9 months) Logistics Analyst Intel Corporation May 2010  –  May 2011  (1 year 1 month) Office Manager Sunburst Shutters & Window Fashions July 2006  –  May 2010  (3 years 11 months) Supply Planner Intel Corporation January 2013  – Present (2 years 8 months) Supply Planner Intel Corporation January 2013  – Present (2 years 8 months) Supply Chain Analyst (Rotation) Intel Corporation May 2011  –  January 2013  (1 year 9 months) Supply Chain Analyst (Rotation) Intel Corporation May 2011  –  January 2013  (1 year 9 months) Logistics Analyst Intel Corporation May 2010  –  May 2011  (1 year 1 month) Logistics Analyst Intel Corporation May 2010  –  May 2011  (1 year 1 month) Office Manager Sunburst Shutters & Window Fashions July 2006  –  May 2010  (3 years 11 months) Office Manager Sunburst Shutters & Window Fashions July 2006  –  May 2010  (3 years 11 months) Languages Japanese Japanese Japanese Skills Supply Chain Supply Chain Management CSCP Inventory Management Process Improvement Lean Transformation Product Development Logistics Transportation Project Management Cross-functional Team... Inventory Planning Data Analysis Manufacturing Management Business Operations Office Management Sales See 3+     See less Skills  Supply Chain Supply Chain Management CSCP Inventory Management Process Improvement Lean Transformation Product Development Logistics Transportation Project Management Cross-functional Team... Inventory Planning Data Analysis Manufacturing Management Business Operations Office Management Sales See 3+     See less Supply Chain Supply Chain Management CSCP Inventory Management Process Improvement Lean Transformation Product Development Logistics Transportation Project Management Cross-functional Team... Inventory Planning Data Analysis Manufacturing Management Business Operations Office Management Sales See 3+     See less Supply Chain Supply Chain Management CSCP Inventory Management Process Improvement Lean Transformation Product Development Logistics Transportation Project Management Cross-functional Team... Inventory Planning Data Analysis Manufacturing Management Business Operations Office Management Sales See 3+     See less Education Arizona State University Master of Business Administration (MBA) 2013  – 2015 Arizona State University BS Supply Chain Management,  Business 2009  – 2011 Mesa Community College AA,  Business 2006  – 2009 Arizona State University Master of Business Administration (MBA) 2013  – 2015 Arizona State University Master of Business Administration (MBA) 2013  – 2015 Arizona State University Master of Business Administration (MBA) 2013  – 2015 Arizona State University BS Supply Chain Management,  Business 2009  – 2011 Arizona State University BS Supply Chain Management,  Business 2009  – 2011 Arizona State University BS Supply Chain Management,  Business 2009  – 2011 Mesa Community College AA,  Business 2006  – 2009 Mesa Community College AA,  Business 2006  – 2009 Mesa Community College AA,  Business 2006  – 2009 ", "Summary Collaborative, energetic, self-starting leader with extensive Supply Chain Management experience. End to end Supply Chain exposure working at the following Semiconductor companies; Intel, National Semiconductor and Applied Materials. Accredited with an MBA in Supply Chain Management from Arizona State University, BS in Business Management from University of Phoenix and AS in Electronics from DeVry University. My background and diverse experience would be an asset across various industries and organizations. Summary Collaborative, energetic, self-starting leader with extensive Supply Chain Management experience. End to end Supply Chain exposure working at the following Semiconductor companies; Intel, National Semiconductor and Applied Materials. Accredited with an MBA in Supply Chain Management from Arizona State University, BS in Business Management from University of Phoenix and AS in Electronics from DeVry University. My background and diverse experience would be an asset across various industries and organizations. Collaborative, energetic, self-starting leader with extensive Supply Chain Management experience. End to end Supply Chain exposure working at the following Semiconductor companies; Intel, National Semiconductor and Applied Materials. Accredited with an MBA in Supply Chain Management from Arizona State University, BS in Business Management from University of Phoenix and AS in Electronics from DeVry University. My background and diverse experience would be an asset across various industries and organizations. Collaborative, energetic, self-starting leader with extensive Supply Chain Management experience. End to end Supply Chain exposure working at the following Semiconductor companies; Intel, National Semiconductor and Applied Materials. Accredited with an MBA in Supply Chain Management from Arizona State University, BS in Business Management from University of Phoenix and AS in Electronics from DeVry University. My background and diverse experience would be an asset across various industries and organizations. Experience Sr Commodity Manager SanDisk September 2014  – Present (1 year) Milpitas, CA Supply Chain ownership for SanDisk’s Consumer Solid State Drive's new product team. Responsible for sourcing, commodity and factory management to achieve cost, quality and delivery objectives. Commodity Business Manager Applied Materials March 2013  –  September 2014  (1 year 7 months) San Francisco Bay Area • Global supplier management of $225M revenue across US, Asia and Europe locations. \n• Developed Executive messaging for long term site sustainability based on extensive on-site evaluation. \n• Continuing management of operations, backlog order reduction, on-time delivery improvement, improved communication and organizational structure. \n• Accountable for operations, resource planning, product allocation, capacity management and commercial negotiations across all global sites. \n• Manage conflict resolution leading to joint success within organization and across supply base. \n• Contract management of Global Sales Agreements, Non-Disclosure Agreements, Inventory and Claim Strategies. Sr Materials Project Manager Applied Materials July 2007  –  February 2013  (5 years 8 months) San Francisco Bay Area • Managed multiple product lines Gate, Epi, Implant and CVD within Front End Products group. Second level escalation point for Gate products (mentoring and managing team member). Responsibilities included R&D development of 3 new chamber products; legacy cost reduction (influencing engineering) and proposed cost increase mitigation/recommendations. \n• Critical key negotiator for cost avoidance collaborating with suppliers across multiple programs leading to $329k cost avoidance in 2012 and increase mitigations based on strategic proposals, creative solutions and out of the box alternatives. \n• Coordinated key critical supplier visits in Japan with Program Manager and Director of Engineering. Team met with suppliers to discuss new product introduction, forecasting, raw material strategies and capacity allocation. Benefit of supplier visits lead to reduced lead times, key contacts, improved relationships, increased leverage and competitive cost reduction. \n• Drove key sourcing activities defining leverage by identifying capable alternate suppliers. Lead to competitive quoting and Engineering should costing which defined annual savings of $300k across three projects within one program.  \n• Lead commercial negotiation with supplier charging spot buy pricing for production released assemblies. Negotiations led to providing alternative pricing from sub-tier supplier was proven should cost. Current Supplier chose to retain sub-tier supplier honoring cost reduction, which lead to $350k in annual savings. \n• Formed global project team for recovery of 11% cost increase on a major module assembly. Drove global project team to put together a plan for cost mitigation. Lead task force consisting of regular meetings, visited supplier in Singapore and completed follow-up with internal executive management team for closure status/recommendations. Results lead to plans to meet 90% of requested raw material and machining cost increase, an annual cost avoidance of $450k. Sr Business Planner National Semiconductor November 2005  –  June 2007  (1 year 8 months) San Francisco Bay Area • Forecasted i2 demand planning revenue for two Analog Portable Power Management product families, equating to $66M in average quarterly revenue. Create and drive the supply direction to FAB and Assembly/Test production facilities for wafer start generation and product finished good categorization to meet customer demand forecast and near-term backlog. \n• Managed product life-cycles for 400 Portable Power products through new product introduction, high volume manufacturing and inventory end-of-life strategies. This includes development of weeks-of-inventory goals, planning system maintenance, product definition alignment and BOM/BOR management. \n• Established and maintained product lead-times across all products highlighting product availability to customers. Drive manual customer order scheduling for engineering sample requirements to support new product introduction. \n• Managed daily factory loading execution by determining i2 forecast type definitions based on product life-cycles. Complete accountability for all inventories across the supply chain, yields/bin projection, guaranteed safety stock quantities and Vendor Managed Inventory program support. Logistics Supervisor Intel Corporation January 2005  –  November 2005  (11 months) San Francisco Bay Area • Managed a 15-person logistics/warehousing team consisting of three operations across two facilities. Responsible for operational execution/excellence, employee development and world-wide business partner logistics support. \n• Managed an ESD transponder finished goods distribution center and shipping/receiving operations. Team responsible for inventory cycle counting, SAP order management and logistics inbound/outbound shipments. \n• Managed a factory shipping/receiving operations for FAB finished/non-finished goods, mask reticle and silicon distribution. Team responsible for carrier/transportation management for inbound/outbound logistics. Weekly average: 1,500 receivables and 475 shipments (140 international / 335 domestic). \n• Managed 38,000 sq ft warehouse facility used for all marketing trade show storage and distribution. Team responsible for inventory tracking, capacity management and carrier distribution for world-wide trade show material. \n• Partnered with transportation to identify low cost carriers for world-wide shipments. Team worked with tax, licensing and customs departments to ensure international shipments met governed regulations prior to shipping. Project Manager Intel Corporation January 2003  –  January 2005  (2 years 1 month) San Francisco Bay Area • Supported planning to define business process requirements, developed project goals and delivered training for software implementation. Team created Web Based GUI for monthly demand forecast and product alignment. \n• Managed engineering conversions for Desktop, Mobile and Server/Workstation CPU product lines. Responsible for business partner negotiation, new product sampling, product life-cycle management and customer issue resolution. \n• Drove monthly product discontinuance meetings to review marketing CPU product guidance and upcoming end-of-life milestones to gathering end customers final demand requirements. \n• Drove sales team meetings working with business partners in Asia Pacific, Japan, Europe and North/South America. Responsible for sharing product conversion, product sampling and product discontinuance information. Business Planner Intel Corporation October 2000  –  January 2003  (2 years 4 months) San Francisco Bay Area • Created Assembly/Test finished good build plans for Mobile CPU business equating to $225M in average quarterly revenue and Server/Workstation CPU business product lines equating to $220M in average quarterly revenue. \n• Project Manager for Pentium® III product conversion from CPU to the embedded organization estimated $600k in cost savings. Designed Gantt chart highlighting resource, planning, product and project requirements. Transitioned a staff of nine planners in CA to three planners in AZ. Evaluated planning processes and adjusted systems to meet supply and resource requirements. \n• Partnered with marketing on product speed to market by highlighting current yields and factory bottlenecks that could potentially gate timing for new product launches. Worked with manufacturing counterparts to understand capacity limitations and product priorities within the factory to support the launch of new product introductions (NPI).  \n• Drove planning and roadmap strategies by leading world-wide meetings with manufacturing across Assembly/Test locations to provide corporate strategic build guidance to support weekly supply schedules. Product Supply Planner Intel Corporation April 2000  –  October 2000  (7 months) San Francisco Bay Area • Managed SAP order management, partnered with marketing on the management of the corporate order allocation for the Desktop Celeron® CPU processors. Ensured sales teams aligned backlog within allocation based on demand. \n• Provided planning management with daily supply vs. backlog request analysis to ensure delinquent customer requirements were supported. Partnered with Business Planning to align customer orders and daily supply closures for order allocation.  \n• Worked directly with sales organizations across Asia Pacific, Japan, Europe and North/South America to manage inventory levels across various product conversions on multiple engineering product revisions. \n• Partnered with finance and marketing to help identify excess to demand inventory and pursued additional markets and channel opportunities for depletion. Manufacturing Technician Intel Corporation July 1997  –  April 2000  (2 years 10 months) Phoenix, Arizona Area • Worked in a fast paced team environment supporting manufacturing operations to meet factory shift work in process (WIP) turns while operating systems and tools using lean manufacturing strategies. \n• Worked as a Process Technician directly dispositioning material and reported risk assessments to product engineering. \n• Partnered with engineering on process improvement opportunities within the Pentium®, Pentium® II and Pentium® III ramp. \n• Drove cross-training opportunities within functional areas leading to improved team moral and successful process certifications. Sr Commodity Manager SanDisk September 2014  – Present (1 year) Milpitas, CA Supply Chain ownership for SanDisk’s Consumer Solid State Drive's new product team. Responsible for sourcing, commodity and factory management to achieve cost, quality and delivery objectives. Sr Commodity Manager SanDisk September 2014  – Present (1 year) Milpitas, CA Supply Chain ownership for SanDisk’s Consumer Solid State Drive's new product team. Responsible for sourcing, commodity and factory management to achieve cost, quality and delivery objectives. Commodity Business Manager Applied Materials March 2013  –  September 2014  (1 year 7 months) San Francisco Bay Area • Global supplier management of $225M revenue across US, Asia and Europe locations. \n• Developed Executive messaging for long term site sustainability based on extensive on-site evaluation. \n• Continuing management of operations, backlog order reduction, on-time delivery improvement, improved communication and organizational structure. \n• Accountable for operations, resource planning, product allocation, capacity management and commercial negotiations across all global sites. \n• Manage conflict resolution leading to joint success within organization and across supply base. \n• Contract management of Global Sales Agreements, Non-Disclosure Agreements, Inventory and Claim Strategies. Commodity Business Manager Applied Materials March 2013  –  September 2014  (1 year 7 months) San Francisco Bay Area • Global supplier management of $225M revenue across US, Asia and Europe locations. \n• Developed Executive messaging for long term site sustainability based on extensive on-site evaluation. \n• Continuing management of operations, backlog order reduction, on-time delivery improvement, improved communication and organizational structure. \n• Accountable for operations, resource planning, product allocation, capacity management and commercial negotiations across all global sites. \n• Manage conflict resolution leading to joint success within organization and across supply base. \n• Contract management of Global Sales Agreements, Non-Disclosure Agreements, Inventory and Claim Strategies. Sr Materials Project Manager Applied Materials July 2007  –  February 2013  (5 years 8 months) San Francisco Bay Area • Managed multiple product lines Gate, Epi, Implant and CVD within Front End Products group. Second level escalation point for Gate products (mentoring and managing team member). Responsibilities included R&D development of 3 new chamber products; legacy cost reduction (influencing engineering) and proposed cost increase mitigation/recommendations. \n• Critical key negotiator for cost avoidance collaborating with suppliers across multiple programs leading to $329k cost avoidance in 2012 and increase mitigations based on strategic proposals, creative solutions and out of the box alternatives. \n• Coordinated key critical supplier visits in Japan with Program Manager and Director of Engineering. Team met with suppliers to discuss new product introduction, forecasting, raw material strategies and capacity allocation. Benefit of supplier visits lead to reduced lead times, key contacts, improved relationships, increased leverage and competitive cost reduction. \n• Drove key sourcing activities defining leverage by identifying capable alternate suppliers. Lead to competitive quoting and Engineering should costing which defined annual savings of $300k across three projects within one program.  \n• Lead commercial negotiation with supplier charging spot buy pricing for production released assemblies. Negotiations led to providing alternative pricing from sub-tier supplier was proven should cost. Current Supplier chose to retain sub-tier supplier honoring cost reduction, which lead to $350k in annual savings. \n• Formed global project team for recovery of 11% cost increase on a major module assembly. Drove global project team to put together a plan for cost mitigation. Lead task force consisting of regular meetings, visited supplier in Singapore and completed follow-up with internal executive management team for closure status/recommendations. Results lead to plans to meet 90% of requested raw material and machining cost increase, an annual cost avoidance of $450k. Sr Materials Project Manager Applied Materials July 2007  –  February 2013  (5 years 8 months) San Francisco Bay Area • Managed multiple product lines Gate, Epi, Implant and CVD within Front End Products group. Second level escalation point for Gate products (mentoring and managing team member). Responsibilities included R&D development of 3 new chamber products; legacy cost reduction (influencing engineering) and proposed cost increase mitigation/recommendations. \n• Critical key negotiator for cost avoidance collaborating with suppliers across multiple programs leading to $329k cost avoidance in 2012 and increase mitigations based on strategic proposals, creative solutions and out of the box alternatives. \n• Coordinated key critical supplier visits in Japan with Program Manager and Director of Engineering. Team met with suppliers to discuss new product introduction, forecasting, raw material strategies and capacity allocation. Benefit of supplier visits lead to reduced lead times, key contacts, improved relationships, increased leverage and competitive cost reduction. \n• Drove key sourcing activities defining leverage by identifying capable alternate suppliers. Lead to competitive quoting and Engineering should costing which defined annual savings of $300k across three projects within one program.  \n• Lead commercial negotiation with supplier charging spot buy pricing for production released assemblies. Negotiations led to providing alternative pricing from sub-tier supplier was proven should cost. Current Supplier chose to retain sub-tier supplier honoring cost reduction, which lead to $350k in annual savings. \n• Formed global project team for recovery of 11% cost increase on a major module assembly. Drove global project team to put together a plan for cost mitigation. Lead task force consisting of regular meetings, visited supplier in Singapore and completed follow-up with internal executive management team for closure status/recommendations. Results lead to plans to meet 90% of requested raw material and machining cost increase, an annual cost avoidance of $450k. Sr Business Planner National Semiconductor November 2005  –  June 2007  (1 year 8 months) San Francisco Bay Area • Forecasted i2 demand planning revenue for two Analog Portable Power Management product families, equating to $66M in average quarterly revenue. Create and drive the supply direction to FAB and Assembly/Test production facilities for wafer start generation and product finished good categorization to meet customer demand forecast and near-term backlog. \n• Managed product life-cycles for 400 Portable Power products through new product introduction, high volume manufacturing and inventory end-of-life strategies. This includes development of weeks-of-inventory goals, planning system maintenance, product definition alignment and BOM/BOR management. \n• Established and maintained product lead-times across all products highlighting product availability to customers. Drive manual customer order scheduling for engineering sample requirements to support new product introduction. \n• Managed daily factory loading execution by determining i2 forecast type definitions based on product life-cycles. Complete accountability for all inventories across the supply chain, yields/bin projection, guaranteed safety stock quantities and Vendor Managed Inventory program support. Sr Business Planner National Semiconductor November 2005  –  June 2007  (1 year 8 months) San Francisco Bay Area • Forecasted i2 demand planning revenue for two Analog Portable Power Management product families, equating to $66M in average quarterly revenue. Create and drive the supply direction to FAB and Assembly/Test production facilities for wafer start generation and product finished good categorization to meet customer demand forecast and near-term backlog. \n• Managed product life-cycles for 400 Portable Power products through new product introduction, high volume manufacturing and inventory end-of-life strategies. This includes development of weeks-of-inventory goals, planning system maintenance, product definition alignment and BOM/BOR management. \n• Established and maintained product lead-times across all products highlighting product availability to customers. Drive manual customer order scheduling for engineering sample requirements to support new product introduction. \n• Managed daily factory loading execution by determining i2 forecast type definitions based on product life-cycles. Complete accountability for all inventories across the supply chain, yields/bin projection, guaranteed safety stock quantities and Vendor Managed Inventory program support. Logistics Supervisor Intel Corporation January 2005  –  November 2005  (11 months) San Francisco Bay Area • Managed a 15-person logistics/warehousing team consisting of three operations across two facilities. Responsible for operational execution/excellence, employee development and world-wide business partner logistics support. \n• Managed an ESD transponder finished goods distribution center and shipping/receiving operations. Team responsible for inventory cycle counting, SAP order management and logistics inbound/outbound shipments. \n• Managed a factory shipping/receiving operations for FAB finished/non-finished goods, mask reticle and silicon distribution. Team responsible for carrier/transportation management for inbound/outbound logistics. Weekly average: 1,500 receivables and 475 shipments (140 international / 335 domestic). \n• Managed 38,000 sq ft warehouse facility used for all marketing trade show storage and distribution. Team responsible for inventory tracking, capacity management and carrier distribution for world-wide trade show material. \n• Partnered with transportation to identify low cost carriers for world-wide shipments. Team worked with tax, licensing and customs departments to ensure international shipments met governed regulations prior to shipping. Logistics Supervisor Intel Corporation January 2005  –  November 2005  (11 months) San Francisco Bay Area • Managed a 15-person logistics/warehousing team consisting of three operations across two facilities. Responsible for operational execution/excellence, employee development and world-wide business partner logistics support. \n• Managed an ESD transponder finished goods distribution center and shipping/receiving operations. Team responsible for inventory cycle counting, SAP order management and logistics inbound/outbound shipments. \n• Managed a factory shipping/receiving operations for FAB finished/non-finished goods, mask reticle and silicon distribution. Team responsible for carrier/transportation management for inbound/outbound logistics. Weekly average: 1,500 receivables and 475 shipments (140 international / 335 domestic). \n• Managed 38,000 sq ft warehouse facility used for all marketing trade show storage and distribution. Team responsible for inventory tracking, capacity management and carrier distribution for world-wide trade show material. \n• Partnered with transportation to identify low cost carriers for world-wide shipments. Team worked with tax, licensing and customs departments to ensure international shipments met governed regulations prior to shipping. Project Manager Intel Corporation January 2003  –  January 2005  (2 years 1 month) San Francisco Bay Area • Supported planning to define business process requirements, developed project goals and delivered training for software implementation. Team created Web Based GUI for monthly demand forecast and product alignment. \n• Managed engineering conversions for Desktop, Mobile and Server/Workstation CPU product lines. Responsible for business partner negotiation, new product sampling, product life-cycle management and customer issue resolution. \n• Drove monthly product discontinuance meetings to review marketing CPU product guidance and upcoming end-of-life milestones to gathering end customers final demand requirements. \n• Drove sales team meetings working with business partners in Asia Pacific, Japan, Europe and North/South America. Responsible for sharing product conversion, product sampling and product discontinuance information. Project Manager Intel Corporation January 2003  –  January 2005  (2 years 1 month) San Francisco Bay Area • Supported planning to define business process requirements, developed project goals and delivered training for software implementation. Team created Web Based GUI for monthly demand forecast and product alignment. \n• Managed engineering conversions for Desktop, Mobile and Server/Workstation CPU product lines. Responsible for business partner negotiation, new product sampling, product life-cycle management and customer issue resolution. \n• Drove monthly product discontinuance meetings to review marketing CPU product guidance and upcoming end-of-life milestones to gathering end customers final demand requirements. \n• Drove sales team meetings working with business partners in Asia Pacific, Japan, Europe and North/South America. Responsible for sharing product conversion, product sampling and product discontinuance information. Business Planner Intel Corporation October 2000  –  January 2003  (2 years 4 months) San Francisco Bay Area • Created Assembly/Test finished good build plans for Mobile CPU business equating to $225M in average quarterly revenue and Server/Workstation CPU business product lines equating to $220M in average quarterly revenue. \n• Project Manager for Pentium® III product conversion from CPU to the embedded organization estimated $600k in cost savings. Designed Gantt chart highlighting resource, planning, product and project requirements. Transitioned a staff of nine planners in CA to three planners in AZ. Evaluated planning processes and adjusted systems to meet supply and resource requirements. \n• Partnered with marketing on product speed to market by highlighting current yields and factory bottlenecks that could potentially gate timing for new product launches. Worked with manufacturing counterparts to understand capacity limitations and product priorities within the factory to support the launch of new product introductions (NPI).  \n• Drove planning and roadmap strategies by leading world-wide meetings with manufacturing across Assembly/Test locations to provide corporate strategic build guidance to support weekly supply schedules. Business Planner Intel Corporation October 2000  –  January 2003  (2 years 4 months) San Francisco Bay Area • Created Assembly/Test finished good build plans for Mobile CPU business equating to $225M in average quarterly revenue and Server/Workstation CPU business product lines equating to $220M in average quarterly revenue. \n• Project Manager for Pentium® III product conversion from CPU to the embedded organization estimated $600k in cost savings. Designed Gantt chart highlighting resource, planning, product and project requirements. Transitioned a staff of nine planners in CA to three planners in AZ. Evaluated planning processes and adjusted systems to meet supply and resource requirements. \n• Partnered with marketing on product speed to market by highlighting current yields and factory bottlenecks that could potentially gate timing for new product launches. Worked with manufacturing counterparts to understand capacity limitations and product priorities within the factory to support the launch of new product introductions (NPI).  \n• Drove planning and roadmap strategies by leading world-wide meetings with manufacturing across Assembly/Test locations to provide corporate strategic build guidance to support weekly supply schedules. Product Supply Planner Intel Corporation April 2000  –  October 2000  (7 months) San Francisco Bay Area • Managed SAP order management, partnered with marketing on the management of the corporate order allocation for the Desktop Celeron® CPU processors. Ensured sales teams aligned backlog within allocation based on demand. \n• Provided planning management with daily supply vs. backlog request analysis to ensure delinquent customer requirements were supported. Partnered with Business Planning to align customer orders and daily supply closures for order allocation.  \n• Worked directly with sales organizations across Asia Pacific, Japan, Europe and North/South America to manage inventory levels across various product conversions on multiple engineering product revisions. \n• Partnered with finance and marketing to help identify excess to demand inventory and pursued additional markets and channel opportunities for depletion. Product Supply Planner Intel Corporation April 2000  –  October 2000  (7 months) San Francisco Bay Area • Managed SAP order management, partnered with marketing on the management of the corporate order allocation for the Desktop Celeron® CPU processors. Ensured sales teams aligned backlog within allocation based on demand. \n• Provided planning management with daily supply vs. backlog request analysis to ensure delinquent customer requirements were supported. Partnered with Business Planning to align customer orders and daily supply closures for order allocation.  \n• Worked directly with sales organizations across Asia Pacific, Japan, Europe and North/South America to manage inventory levels across various product conversions on multiple engineering product revisions. \n• Partnered with finance and marketing to help identify excess to demand inventory and pursued additional markets and channel opportunities for depletion. Manufacturing Technician Intel Corporation July 1997  –  April 2000  (2 years 10 months) Phoenix, Arizona Area • Worked in a fast paced team environment supporting manufacturing operations to meet factory shift work in process (WIP) turns while operating systems and tools using lean manufacturing strategies. \n• Worked as a Process Technician directly dispositioning material and reported risk assessments to product engineering. \n• Partnered with engineering on process improvement opportunities within the Pentium®, Pentium® II and Pentium® III ramp. \n• Drove cross-training opportunities within functional areas leading to improved team moral and successful process certifications. Manufacturing Technician Intel Corporation July 1997  –  April 2000  (2 years 10 months) Phoenix, Arizona Area • Worked in a fast paced team environment supporting manufacturing operations to meet factory shift work in process (WIP) turns while operating systems and tools using lean manufacturing strategies. \n• Worked as a Process Technician directly dispositioning material and reported risk assessments to product engineering. \n• Partnered with engineering on process improvement opportunities within the Pentium®, Pentium® II and Pentium® III ramp. \n• Drove cross-training opportunities within functional areas leading to improved team moral and successful process certifications. Skills Microsoft Office Microsoft Excel Microsoft Word Oracle Applications SAP MRP ERP Query Tool Data Analysis Supply Chain Management Demand Supply Planning SAP BI Project Management Project Planning Business Planning Logistics Management Lean Manufacturing SAP SRM FIFO Manufacturing Operations Supply Chain Manufacturing Process Improvement Program Management Forecasting Semiconductors Manufacture Cross-functional Team... Product Development See 14+     See less Skills  Microsoft Office Microsoft Excel Microsoft Word Oracle Applications SAP MRP ERP Query Tool Data Analysis Supply Chain Management Demand Supply Planning SAP BI Project Management Project Planning Business Planning Logistics Management Lean Manufacturing SAP SRM FIFO Manufacturing Operations Supply Chain Manufacturing Process Improvement Program Management Forecasting Semiconductors Manufacture Cross-functional Team... Product Development See 14+     See less Microsoft Office Microsoft Excel Microsoft Word Oracle Applications SAP MRP ERP Query Tool Data Analysis Supply Chain Management Demand Supply Planning SAP BI Project Management Project Planning Business Planning Logistics Management Lean Manufacturing SAP SRM FIFO Manufacturing Operations Supply Chain Manufacturing Process Improvement Program Management Forecasting Semiconductors Manufacture Cross-functional Team... Product Development See 14+     See less Microsoft Office Microsoft Excel Microsoft Word Oracle Applications SAP MRP ERP Query Tool Data Analysis Supply Chain Management Demand Supply Planning SAP BI Project Management Project Planning Business Planning Logistics Management Lean Manufacturing SAP SRM FIFO Manufacturing Operations Supply Chain Manufacturing Process Improvement Program Management Forecasting Semiconductors Manufacture Cross-functional Team... Product Development See 14+     See less Education Arizona State University, W. P. Carey School of Business Master of Business Administration (MBA),  Supply Chain Management , 3.8 2002  – 2004 University of Phoenix Bachelor of Applied Science (BASc),  Business Management , 3.5 1998  – 2000 DeVry University Associate of Science (AS),  Electronics , 3.6 1995  – 1997 Arizona State University, W. P. Carey School of Business Master of Business Administration (MBA),  Supply Chain Management , 3.8 2002  – 2004 Arizona State University, W. P. Carey School of Business Master of Business Administration (MBA),  Supply Chain Management , 3.8 2002  – 2004 Arizona State University, W. P. Carey School of Business Master of Business Administration (MBA),  Supply Chain Management , 3.8 2002  – 2004 University of Phoenix Bachelor of Applied Science (BASc),  Business Management , 3.5 1998  – 2000 University of Phoenix Bachelor of Applied Science (BASc),  Business Management , 3.5 1998  – 2000 University of Phoenix Bachelor of Applied Science (BASc),  Business Management , 3.5 1998  – 2000 DeVry University Associate of Science (AS),  Electronics , 3.6 1995  – 1997 DeVry University Associate of Science (AS),  Electronics , 3.6 1995  – 1997 DeVry University Associate of Science (AS),  Electronics , 3.6 1995  – 1997 ", "Experience Supply PLanner Intel Corporation 2004  –  2009  (5 years) Supply PLanner Intel Corporation 2004  –  2009  (5 years) Supply PLanner Intel Corporation 2004  –  2009  (5 years) ", "Experience Product Supply Planner Intel Corporation Product Supply Planner Intel Corporation Product Supply Planner Intel Corporation Education University of Phoenix 2003  – 2005 University of Phoenix 2003  – 2005 University of Phoenix 2003  – 2005 University of Phoenix 2003  – 2005 ", "Experience Demand Supply Planner Intel Corporation March 2014  – Present (1 year 6 months) Sacramento, California Area Business\\System Analyst Intel November 2009  –  February 2014  (4 years 4 months) Business System Analyst Nike Inc September 2008  –  July 2009  (11 months) Program & Project Coordinator Target 2006  –  2008  (2 years) Program Analyst Infosys 2004  –  2008  (4 years) Demand Supply Planner Intel Corporation March 2014  – Present (1 year 6 months) Sacramento, California Area Demand Supply Planner Intel Corporation March 2014  – Present (1 year 6 months) Sacramento, California Area Business\\System Analyst Intel November 2009  –  February 2014  (4 years 4 months) Business\\System Analyst Intel November 2009  –  February 2014  (4 years 4 months) Business System Analyst Nike Inc September 2008  –  July 2009  (11 months) Business System Analyst Nike Inc September 2008  –  July 2009  (11 months) Program & Project Coordinator Target 2006  –  2008  (2 years) Program & Project Coordinator Target 2006  –  2008  (2 years) Program Analyst Infosys 2004  –  2008  (4 years) Program Analyst Infosys 2004  –  2008  (4 years) Skills Time Management Business Analysis SDLC Requirements Analysis Software Project... Agile Methodologies SQL Software Development Visio Microsoft SQL Server Requirements Gathering Business Intelligence SharePoint Unix .NET Skills  Time Management Business Analysis SDLC Requirements Analysis Software Project... Agile Methodologies SQL Software Development Visio Microsoft SQL Server Requirements Gathering Business Intelligence SharePoint Unix .NET Time Management Business Analysis SDLC Requirements Analysis Software Project... Agile Methodologies SQL Software Development Visio Microsoft SQL Server Requirements Gathering Business Intelligence SharePoint Unix .NET Time Management Business Analysis SDLC Requirements Analysis Software Project... Agile Methodologies SQL Software Development Visio Microsoft SQL Server Requirements Gathering Business Intelligence SharePoint Unix .NET Education University of California, Davis Master of Business Administration (MBA),  Product Management & Marketing 2010  – 2013 University of Madras Bachelor of Technology (BTech),  Information Technology 1999  – 2003 Balalok 1995  – 1999 University of California, Davis Master of Business Administration (MBA),  Product Management & Marketing 2010  – 2013 University of California, Davis Master of Business Administration (MBA),  Product Management & Marketing 2010  – 2013 University of California, Davis Master of Business Administration (MBA),  Product Management & Marketing 2010  – 2013 University of Madras Bachelor of Technology (BTech),  Information Technology 1999  – 2003 University of Madras Bachelor of Technology (BTech),  Information Technology 1999  – 2003 University of Madras Bachelor of Technology (BTech),  Information Technology 1999  – 2003 Balalok 1995  – 1999 Balalok 1995  – 1999 Balalok 1995  – 1999 ", "Skills Cross-functional Team... Finance Financial Modeling Leadership Product Management Quality Assurance Strategy Supply Chain Skills  Cross-functional Team... Finance Financial Modeling Leadership Product Management Quality Assurance Strategy Supply Chain Cross-functional Team... Finance Financial Modeling Leadership Product Management Quality Assurance Strategy Supply Chain Cross-functional Team... Finance Financial Modeling Leadership Product Management Quality Assurance Strategy Supply Chain ", "Languages English Native or bilingual proficiency Tagalog Native or bilingual proficiency English Native or bilingual proficiency Tagalog Native or bilingual proficiency English Native or bilingual proficiency Tagalog Native or bilingual proficiency Native or bilingual proficiency Native or bilingual proficiency Skills Project Management Intel Cross-functional Team... Product Management Program Management Supply Chain Management Management Customer Service Leadership Strategic Planning Business Analysis CRM Problem Solving Strategy E-commerce Product Development Analysis SAP Microsoft Excel Lean Manufacturing Demand Supply Planning Demand Forecasting Supply Chain... Customer Experience Relationship Building Process Improvement Product Marketing See 12+     See less Skills  Project Management Intel Cross-functional Team... Product Management Program Management Supply Chain Management Management Customer Service Leadership Strategic Planning Business Analysis CRM Problem Solving Strategy E-commerce Product Development Analysis SAP Microsoft Excel Lean Manufacturing Demand Supply Planning Demand Forecasting Supply Chain... Customer Experience Relationship Building Process Improvement Product Marketing See 12+     See less Project Management Intel Cross-functional Team... Product Management Program Management Supply Chain Management Management Customer Service Leadership Strategic Planning Business Analysis CRM Problem Solving Strategy E-commerce Product Development Analysis SAP Microsoft Excel Lean Manufacturing Demand Supply Planning Demand Forecasting Supply Chain... Customer Experience Relationship Building Process Improvement Product Marketing See 12+     See less Project Management Intel Cross-functional Team... Product Management Program Management Supply Chain Management Management Customer Service Leadership Strategic Planning Business Analysis CRM Problem Solving Strategy E-commerce Product Development Analysis SAP Microsoft Excel Lean Manufacturing Demand Supply Planning Demand Forecasting Supply Chain... Customer Experience Relationship Building Process Improvement Product Marketing See 12+     See less ", "Experience FSM Demand Supply Planner Intel Corporation October 2013  – Present (1 year 11 months) Sacramento, California Area Demand Supply Planner - ATM Lead Intel Corporation May 2010  –  October 2013  (3 years 6 months) Sacramento, California Area Business Supply Planner Intel Corporation October 2008  –  May 2010  (1 year 8 months) Sacramento, California Area Customer Business Analyst Intel Corporation October 2005  –  October 2008  (3 years 1 month) Sacramento, California Area Product Marketing Engineer Analog Devices June 1991  –  December 1993  (2 years 7 months) San Francisco Bay Area Product Engineer Analog Devices May 1989  –  June 1991  (2 years 2 months) San Francisco Bay Area FSM Demand Supply Planner Intel Corporation October 2013  – Present (1 year 11 months) Sacramento, California Area FSM Demand Supply Planner Intel Corporation October 2013  – Present (1 year 11 months) Sacramento, California Area Demand Supply Planner - ATM Lead Intel Corporation May 2010  –  October 2013  (3 years 6 months) Sacramento, California Area Demand Supply Planner - ATM Lead Intel Corporation May 2010  –  October 2013  (3 years 6 months) Sacramento, California Area Business Supply Planner Intel Corporation October 2008  –  May 2010  (1 year 8 months) Sacramento, California Area Business Supply Planner Intel Corporation October 2008  –  May 2010  (1 year 8 months) Sacramento, California Area Customer Business Analyst Intel Corporation October 2005  –  October 2008  (3 years 1 month) Sacramento, California Area Customer Business Analyst Intel Corporation October 2005  –  October 2008  (3 years 1 month) Sacramento, California Area Product Marketing Engineer Analog Devices June 1991  –  December 1993  (2 years 7 months) San Francisco Bay Area Product Marketing Engineer Analog Devices June 1991  –  December 1993  (2 years 7 months) San Francisco Bay Area Product Engineer Analog Devices May 1989  –  June 1991  (2 years 2 months) San Francisco Bay Area Product Engineer Analog Devices May 1989  –  June 1991  (2 years 2 months) San Francisco Bay Area Education San Jose State University Bachelor of Science (BS),  Electrical and Electronics Engineering San Jose State University Bachelor of Science (BS),  Electrical and Electronics Engineering San Jose State University Bachelor of Science (BS),  Electrical and Electronics Engineering San Jose State University Bachelor of Science (BS),  Electrical and Electronics Engineering ", "Languages Arabic Arabic Arabic Skills Enterprise Software SDLC Negotiation Requirements Analysis Cross-functional Team... Business Process Project Management Software Documentation Communication Skills SAP Supply Chain SAP Financial Liasoning Written & Oral... Business Analysis Agile Methodologies Software Project... Management SAP Analysis Project Planning Testing Leadership See 7+     See less Skills  Enterprise Software SDLC Negotiation Requirements Analysis Cross-functional Team... Business Process Project Management Software Documentation Communication Skills SAP Supply Chain SAP Financial Liasoning Written & Oral... Business Analysis Agile Methodologies Software Project... Management SAP Analysis Project Planning Testing Leadership See 7+     See less Enterprise Software SDLC Negotiation Requirements Analysis Cross-functional Team... Business Process Project Management Software Documentation Communication Skills SAP Supply Chain SAP Financial Liasoning Written & Oral... Business Analysis Agile Methodologies Software Project... Management SAP Analysis Project Planning Testing Leadership See 7+     See less Enterprise Software SDLC Negotiation Requirements Analysis Cross-functional Team... Business Process Project Management Software Documentation Communication Skills SAP Supply Chain SAP Financial Liasoning Written & Oral... Business Analysis Agile Methodologies Software Project... Management SAP Analysis Project Planning Testing Leadership See 7+     See less ", "Experience Network Fulfillment Planner Kraft Foods Group November 2007  – Present (7 years 10 months) Northfield, IL Product Supply Planner Intel Corporation June 2005  –  November 2007  (2 years 6 months) Santa Clara, CA Network Fulfillment Planner Kraft Foods Group November 2007  – Present (7 years 10 months) Northfield, IL Network Fulfillment Planner Kraft Foods Group November 2007  – Present (7 years 10 months) Northfield, IL Product Supply Planner Intel Corporation June 2005  –  November 2007  (2 years 6 months) Santa Clara, CA Product Supply Planner Intel Corporation June 2005  –  November 2007  (2 years 6 months) Santa Clara, CA Skills Supply Chain Management Demand Planning Cross-functional Team... Supply Chain Logistics Supply Chain... SAP Supply Management Skills  Supply Chain Management Demand Planning Cross-functional Team... Supply Chain Logistics Supply Chain... SAP Supply Management Supply Chain Management Demand Planning Cross-functional Team... Supply Chain Logistics Supply Chain... SAP Supply Management Supply Chain Management Demand Planning Cross-functional Team... Supply Chain Logistics Supply Chain... SAP Supply Management Education Michigan State University BA,  Supply Chain Management 2001  – 2005 Michigan State University BA,  Supply Chain Management 2001  – 2005 Michigan State University BA,  Supply Chain Management 2001  – 2005 Michigan State University BA,  Supply Chain Management 2001  – 2005 ", "Skills Management Project Planning Cross-functional Team... Business Process Training Supply Chain Management Process Improvement Skills  Management Project Planning Cross-functional Team... Business Process Training Supply Chain Management Process Improvement Management Project Planning Cross-functional Team... Business Process Training Supply Chain Management Process Improvement Management Project Planning Cross-functional Team... Business Process Training Supply Chain Management Process Improvement ", "Skills Semiconductors Troubleshooting Program Management Process Improvement Intel Cross-functional Team... Product Management Skills  Semiconductors Troubleshooting Program Management Process Improvement Intel Cross-functional Team... Product Management Semiconductors Troubleshooting Program Management Process Improvement Intel Cross-functional Team... Product Management Semiconductors Troubleshooting Program Management Process Improvement Intel Cross-functional Team... Product Management ", "Experience Planning and Sourcing Manager - Fashion and Home (Philippines) Avon March 2007  – Present (8 years 6 months) Local Supply Planning (Fashion & Home) \nResponsible for overall supply planning process of fashion and home categories for the Philippines market. Drives supply strategies that optimizes Inventory investment and improves Service to the Avon representative.  \n \nInventory Management / S&OP: \nActively partners with Finance, Marketing and Sales to understand the drivers of inventory risks as well as identifying actions to meet overall Philippines Inventory targets. Responsible for setting up inventory category targets considering demand variability and supply constraints. Experienced in facilitating Inventory and Supply Reviews Meetings.  \n \nSourcing (Home, Kids, Incentives Prizes) \nResponsible for sourcing process of local categories(Home, Kids, Incentives) for the Philippines market. Drives strategies that delivers purchase cost targets and Avon's quality promise to the customer.  Demand Management and Warehouse Specialist GlaxoSmithKline April 2003  –  March 2007  (4 years) Warehouse Management / Domestic Shipping: \nImproved overall operations of GSK Samples and Promo Materials Warehouse. Established the process for selection, transition and management of 3PLs: Warehouse Management and Domestic Shipping. Implemented process changes to align with good warehousing practices and Environment, Health and Safety requirements. Responsible for design and implementation of an in-house developed Warehouse Management System. (2004 Employee of the Year Awardee) \n \nDemand Planning: \nResponsible for demand planning of selected categories using JDE-DRP from local and foreign sources. Interfaced with global forwarder and customs broker on import/export transactions. Supply Planner Intel Corporation October 2000  –  March 2003  (2 years 6 months) Responsible for Production Planning and Order Management of high-volume flash memory products using SAP R/3. Interfaced with regional factories/subcons and customers within APAC and Europe. Supported the transition to the Configure-to-Order model that improved inventory position without compromising the factory's responsiveness. Performed Superuser role for in-house planning system, including first-level support trouble shooting and user training. Purchasing Agent Selecta Wall's, Inc June 1999  –  October 2000  (1 year 5 months) Responsible for sourcing and buying of ice cream packaging materials, imported unique raw materials and printed promotional materials.  \n \nIntroduced new suppliers (local and foreign) for critical packaging materials that alleviated the constraints of the current vendor base and supported the successful launch of Unilever global ice cream brands. Developed and implemented a Supplier Selection and Accreditation Process. Planning and Sourcing Manager - Fashion and Home (Philippines) Avon March 2007  – Present (8 years 6 months) Local Supply Planning (Fashion & Home) \nResponsible for overall supply planning process of fashion and home categories for the Philippines market. Drives supply strategies that optimizes Inventory investment and improves Service to the Avon representative.  \n \nInventory Management / S&OP: \nActively partners with Finance, Marketing and Sales to understand the drivers of inventory risks as well as identifying actions to meet overall Philippines Inventory targets. Responsible for setting up inventory category targets considering demand variability and supply constraints. Experienced in facilitating Inventory and Supply Reviews Meetings.  \n \nSourcing (Home, Kids, Incentives Prizes) \nResponsible for sourcing process of local categories(Home, Kids, Incentives) for the Philippines market. Drives strategies that delivers purchase cost targets and Avon's quality promise to the customer.  Planning and Sourcing Manager - Fashion and Home (Philippines) Avon March 2007  – Present (8 years 6 months) Local Supply Planning (Fashion & Home) \nResponsible for overall supply planning process of fashion and home categories for the Philippines market. Drives supply strategies that optimizes Inventory investment and improves Service to the Avon representative.  \n \nInventory Management / S&OP: \nActively partners with Finance, Marketing and Sales to understand the drivers of inventory risks as well as identifying actions to meet overall Philippines Inventory targets. Responsible for setting up inventory category targets considering demand variability and supply constraints. Experienced in facilitating Inventory and Supply Reviews Meetings.  \n \nSourcing (Home, Kids, Incentives Prizes) \nResponsible for sourcing process of local categories(Home, Kids, Incentives) for the Philippines market. Drives strategies that delivers purchase cost targets and Avon's quality promise to the customer.  Demand Management and Warehouse Specialist GlaxoSmithKline April 2003  –  March 2007  (4 years) Warehouse Management / Domestic Shipping: \nImproved overall operations of GSK Samples and Promo Materials Warehouse. Established the process for selection, transition and management of 3PLs: Warehouse Management and Domestic Shipping. Implemented process changes to align with good warehousing practices and Environment, Health and Safety requirements. Responsible for design and implementation of an in-house developed Warehouse Management System. (2004 Employee of the Year Awardee) \n \nDemand Planning: \nResponsible for demand planning of selected categories using JDE-DRP from local and foreign sources. Interfaced with global forwarder and customs broker on import/export transactions. Demand Management and Warehouse Specialist GlaxoSmithKline April 2003  –  March 2007  (4 years) Warehouse Management / Domestic Shipping: \nImproved overall operations of GSK Samples and Promo Materials Warehouse. Established the process for selection, transition and management of 3PLs: Warehouse Management and Domestic Shipping. Implemented process changes to align with good warehousing practices and Environment, Health and Safety requirements. Responsible for design and implementation of an in-house developed Warehouse Management System. (2004 Employee of the Year Awardee) \n \nDemand Planning: \nResponsible for demand planning of selected categories using JDE-DRP from local and foreign sources. Interfaced with global forwarder and customs broker on import/export transactions. Supply Planner Intel Corporation October 2000  –  March 2003  (2 years 6 months) Responsible for Production Planning and Order Management of high-volume flash memory products using SAP R/3. Interfaced with regional factories/subcons and customers within APAC and Europe. Supported the transition to the Configure-to-Order model that improved inventory position without compromising the factory's responsiveness. Performed Superuser role for in-house planning system, including first-level support trouble shooting and user training. Supply Planner Intel Corporation October 2000  –  March 2003  (2 years 6 months) Responsible for Production Planning and Order Management of high-volume flash memory products using SAP R/3. Interfaced with regional factories/subcons and customers within APAC and Europe. Supported the transition to the Configure-to-Order model that improved inventory position without compromising the factory's responsiveness. Performed Superuser role for in-house planning system, including first-level support trouble shooting and user training. Purchasing Agent Selecta Wall's, Inc June 1999  –  October 2000  (1 year 5 months) Responsible for sourcing and buying of ice cream packaging materials, imported unique raw materials and printed promotional materials.  \n \nIntroduced new suppliers (local and foreign) for critical packaging materials that alleviated the constraints of the current vendor base and supported the successful launch of Unilever global ice cream brands. Developed and implemented a Supplier Selection and Accreditation Process. Purchasing Agent Selecta Wall's, Inc June 1999  –  October 2000  (1 year 5 months) Responsible for sourcing and buying of ice cream packaging materials, imported unique raw materials and printed promotional materials.  \n \nIntroduced new suppliers (local and foreign) for critical packaging materials that alleviated the constraints of the current vendor base and supported the successful launch of Unilever global ice cream brands. Developed and implemented a Supplier Selection and Accreditation Process. Skills Supply Chain Management Inventory Management Warehouse Management Inventory Control Warehousing Supply Chain SAP Logistics Operations Management Purchasing Demand Planning Production Planning Microsoft Office MRP Forecasting Materials Management Management Packaging Six Sigma Cross-functional Team... 3PL Sourcing Supply Management SAP R/3 Supply Chain Operations See 10+     See less Skills  Supply Chain Management Inventory Management Warehouse Management Inventory Control Warehousing Supply Chain SAP Logistics Operations Management Purchasing Demand Planning Production Planning Microsoft Office MRP Forecasting Materials Management Management Packaging Six Sigma Cross-functional Team... 3PL Sourcing Supply Management SAP R/3 Supply Chain Operations See 10+     See less Supply Chain Management Inventory Management Warehouse Management Inventory Control Warehousing Supply Chain SAP Logistics Operations Management Purchasing Demand Planning Production Planning Microsoft Office MRP Forecasting Materials Management Management Packaging Six Sigma Cross-functional Team... 3PL Sourcing Supply Management SAP R/3 Supply Chain Operations See 10+     See less Supply Chain Management Inventory Management Warehouse Management Inventory Control Warehousing Supply Chain SAP Logistics Operations Management Purchasing Demand Planning Production Planning Microsoft Office MRP Forecasting Materials Management Management Packaging Six Sigma Cross-functional Team... 3PL Sourcing Supply Management SAP R/3 Supply Chain Operations See 10+     See less Education University of the Philippines MBA 2002  – 2006 University of the Philippines BS,  Industrial Engineering 1994  – 1999 Activities and Societies:  Full Scholar (Department of Science and Technology)\nIE Club (engineering organization) and Pathfinders (Christian organization) Manila Science High School High School Diploma 1990  – 1994 Activities and Societies:  Silver Medalist ,  Star Awardee University of the Philippines MBA 2002  – 2006 University of the Philippines MBA 2002  – 2006 University of the Philippines MBA 2002  – 2006 University of the Philippines BS,  Industrial Engineering 1994  – 1999 Activities and Societies:  Full Scholar (Department of Science and Technology)\nIE Club (engineering organization) and Pathfinders (Christian organization) University of the Philippines BS,  Industrial Engineering 1994  – 1999 Activities and Societies:  Full Scholar (Department of Science and Technology)\nIE Club (engineering organization) and Pathfinders (Christian organization) University of the Philippines BS,  Industrial Engineering 1994  – 1999 Activities and Societies:  Full Scholar (Department of Science and Technology)\nIE Club (engineering organization) and Pathfinders (Christian organization) Manila Science High School High School Diploma 1990  – 1994 Activities and Societies:  Silver Medalist ,  Star Awardee Manila Science High School High School Diploma 1990  – 1994 Activities and Societies:  Silver Medalist ,  Star Awardee Manila Science High School High School Diploma 1990  – 1994 Activities and Societies:  Silver Medalist ,  Star Awardee ", "Skills Production Planning Semiconductors Program Management Cross-functional Team... Manufacturing Lean Manufacturing Supply Chain Management Analysis Supply Management Semiconductor Industry Supply Chain Skills  Production Planning Semiconductors Program Management Cross-functional Team... Manufacturing Lean Manufacturing Supply Chain Management Analysis Supply Management Semiconductor Industry Supply Chain Production Planning Semiconductors Program Management Cross-functional Team... Manufacturing Lean Manufacturing Supply Chain Management Analysis Supply Management Semiconductor Industry Supply Chain Production Planning Semiconductors Program Management Cross-functional Team... Manufacturing Lean Manufacturing Supply Chain Management Analysis Supply Management Semiconductor Industry Supply Chain ", "Experience Staff Member Hostpital Pharmacy UZ Brussel June 2014  – Present (1 year 3 months) Belgium Supply planner Intel Corporation February 2011  –  October 2014  (3 years 9 months) Munich Area, Germany Customer Logistics Manager / Global Logistics Planner Infineon May 2004  –  January 2011  (6 years 9 months) Research Assistent / Consultant Technische Universität München November 2002  –  January 2004  (1 year 3 months) Logistics Planner Schering , now Bayer healthcare September 2000  –  October 2002  (2 years 2 months) Thesis student Deloitte en Bridestone 1999  –  2000  (1 year) Staff Member Hostpital Pharmacy UZ Brussel June 2014  – Present (1 year 3 months) Belgium Staff Member Hostpital Pharmacy UZ Brussel June 2014  – Present (1 year 3 months) Belgium Supply planner Intel Corporation February 2011  –  October 2014  (3 years 9 months) Munich Area, Germany Supply planner Intel Corporation February 2011  –  October 2014  (3 years 9 months) Munich Area, Germany Customer Logistics Manager / Global Logistics Planner Infineon May 2004  –  January 2011  (6 years 9 months) Customer Logistics Manager / Global Logistics Planner Infineon May 2004  –  January 2011  (6 years 9 months) Research Assistent / Consultant Technische Universität München November 2002  –  January 2004  (1 year 3 months) Research Assistent / Consultant Technische Universität München November 2002  –  January 2004  (1 year 3 months) Logistics Planner Schering , now Bayer healthcare September 2000  –  October 2002  (2 years 2 months) Logistics Planner Schering , now Bayer healthcare September 2000  –  October 2002  (2 years 2 months) Thesis student Deloitte en Bridestone 1999  –  2000  (1 year) Thesis student Deloitte en Bridestone 1999  –  2000  (1 year) Skills Process Improvement Negotiation English Business Strategy Team Leadership Management Consulting Supply Chain Customer Service Budgets International Business German Strategy French Analysis Business Planning Business Process... Competitive Analysis Continuous Improvement Cross-functional Team... Logistics Manufacturing Operations Management Program Management Project Management Project Planning SAP Supply Chain Management Supply Management Product Development Business Development Forecasting See 16+     See less Skills  Process Improvement Negotiation English Business Strategy Team Leadership Management Consulting Supply Chain Customer Service Budgets International Business German Strategy French Analysis Business Planning Business Process... Competitive Analysis Continuous Improvement Cross-functional Team... Logistics Manufacturing Operations Management Program Management Project Management Project Planning SAP Supply Chain Management Supply Management Product Development Business Development Forecasting See 16+     See less Process Improvement Negotiation English Business Strategy Team Leadership Management Consulting Supply Chain Customer Service Budgets International Business German Strategy French Analysis Business Planning Business Process... Competitive Analysis Continuous Improvement Cross-functional Team... Logistics Manufacturing Operations Management Program Management Project Management Project Planning SAP Supply Chain Management Supply Management Product Development Business Development Forecasting See 16+     See less Process Improvement Negotiation English Business Strategy Team Leadership Management Consulting Supply Chain Customer Service Budgets International Business German Strategy French Analysis Business Planning Business Process... Competitive Analysis Continuous Improvement Cross-functional Team... Logistics Manufacturing Operations Management Program Management Project Management Project Planning SAP Supply Chain Management Supply Management Product Development Business Development Forecasting See 16+     See less Education Georgetown University Certificate,  International Business Management 2008  – 2008 Georgetown University - The McDonough School of Business Certificate,  Project Management 2008  – 2008 George Mason University Certificate,  Supply Chain Management Professional 2007  – 2007 Europese Hogeschool Brussel Handelsingenieur,  Handelsingenieur 1995  – 2000 Georgetown University Certificate,  International Business Management 2008  – 2008 Georgetown University Certificate,  International Business Management 2008  – 2008 Georgetown University Certificate,  International Business Management 2008  – 2008 Georgetown University - The McDonough School of Business Certificate,  Project Management 2008  – 2008 Georgetown University - The McDonough School of Business Certificate,  Project Management 2008  – 2008 Georgetown University - The McDonough School of Business Certificate,  Project Management 2008  – 2008 George Mason University Certificate,  Supply Chain Management Professional 2007  – 2007 George Mason University Certificate,  Supply Chain Management Professional 2007  – 2007 George Mason University Certificate,  Supply Chain Management Professional 2007  – 2007 Europese Hogeschool Brussel Handelsingenieur,  Handelsingenieur 1995  – 2000 Europese Hogeschool Brussel Handelsingenieur,  Handelsingenieur 1995  – 2000 Europese Hogeschool Brussel Handelsingenieur,  Handelsingenieur 1995  – 2000 ", "Summary Over 18 years of experience in Supply Chain Planning & Business Process Transformation, Integration, Standardization and Optimization, Data Analytics, Data Modeling, LEAN and BI Integration.  \n \nSpecialties: Strategic supply chain vision and implementation, CIP, Operations, Process development methodologies, data architecture, Internal and External Foundry and Mergers & Acquisitions Supply Chains. Customer MDM, Org and LEAN consultative initiatives. \n \n* 2 years of first-line performance management Summary Over 18 years of experience in Supply Chain Planning & Business Process Transformation, Integration, Standardization and Optimization, Data Analytics, Data Modeling, LEAN and BI Integration.  \n \nSpecialties: Strategic supply chain vision and implementation, CIP, Operations, Process development methodologies, data architecture, Internal and External Foundry and Mergers & Acquisitions Supply Chains. Customer MDM, Org and LEAN consultative initiatives. \n \n* 2 years of first-line performance management Over 18 years of experience in Supply Chain Planning & Business Process Transformation, Integration, Standardization and Optimization, Data Analytics, Data Modeling, LEAN and BI Integration.  \n \nSpecialties: Strategic supply chain vision and implementation, CIP, Operations, Process development methodologies, data architecture, Internal and External Foundry and Mergers & Acquisitions Supply Chains. Customer MDM, Org and LEAN consultative initiatives. \n \n* 2 years of first-line performance management Over 18 years of experience in Supply Chain Planning & Business Process Transformation, Integration, Standardization and Optimization, Data Analytics, Data Modeling, LEAN and BI Integration.  \n \nSpecialties: Strategic supply chain vision and implementation, CIP, Operations, Process development methodologies, data architecture, Internal and External Foundry and Mergers & Acquisitions Supply Chains. Customer MDM, Org and LEAN consultative initiatives. \n \n* 2 years of first-line performance management Experience Enterprise Business Architect Intel Corporation March 2009  – Present (6 years 6 months) Enterprise Business Architect Intel Corporation March 2009  – Present (6 years 6 months) Enterprise Business Architect Intel Corporation March 2009  – Present (6 years 6 months) Skills Process Engineering Program Management Master Data Management Analysis Business Analysis Requirements Analysis Analytics Enterprise Architecture Architectural Design Process Management Process Mapping Process Optimization Team Leadership Team Building Team Management Cross-functional Team... Virtual Teams Strategic Planning Strategy Development Strategic Thinking Strategic Analysis Strategic Partnerships Acquisition Integration Customer Acquisition Acquisition Analysis Business Process Data Analysis Business Transformation Agile Project Management Business Process... Strategy Business Process Mapping Project Planning Integration Business Valuation SAP Lean Manufacturing Manufacturing Supply Chain Management Process Improvement Product Management Business Intelligence Business Process... Supply Management Product Planning Product Road Mapping New Product Roll Out New Product Release Mergers & Acquisitions See 35+     See less Skills  Process Engineering Program Management Master Data Management Analysis Business Analysis Requirements Analysis Analytics Enterprise Architecture Architectural Design Process Management Process Mapping Process Optimization Team Leadership Team Building Team Management Cross-functional Team... Virtual Teams Strategic Planning Strategy Development Strategic Thinking Strategic Analysis Strategic Partnerships Acquisition Integration Customer Acquisition Acquisition Analysis Business Process Data Analysis Business Transformation Agile Project Management Business Process... Strategy Business Process Mapping Project Planning Integration Business Valuation SAP Lean Manufacturing Manufacturing Supply Chain Management Process Improvement Product Management Business Intelligence Business Process... Supply Management Product Planning Product Road Mapping New Product Roll Out New Product Release Mergers & Acquisitions See 35+     See less Process Engineering Program Management Master Data Management Analysis Business Analysis Requirements Analysis Analytics Enterprise Architecture Architectural Design Process Management Process Mapping Process Optimization Team Leadership Team Building Team Management Cross-functional Team... Virtual Teams Strategic Planning Strategy Development Strategic Thinking Strategic Analysis Strategic Partnerships Acquisition Integration Customer Acquisition Acquisition Analysis Business Process Data Analysis Business Transformation Agile Project Management Business Process... Strategy Business Process Mapping Project Planning Integration Business Valuation SAP Lean Manufacturing Manufacturing Supply Chain Management Process Improvement Product Management Business Intelligence Business Process... Supply Management Product Planning Product Road Mapping New Product Roll Out New Product Release Mergers & Acquisitions See 35+     See less Process Engineering Program Management Master Data Management Analysis Business Analysis Requirements Analysis Analytics Enterprise Architecture Architectural Design Process Management Process Mapping Process Optimization Team Leadership Team Building Team Management Cross-functional Team... Virtual Teams Strategic Planning Strategy Development Strategic Thinking Strategic Analysis Strategic Partnerships Acquisition Integration Customer Acquisition Acquisition Analysis Business Process Data Analysis Business Transformation Agile Project Management Business Process... Strategy Business Process Mapping Project Planning Integration Business Valuation SAP Lean Manufacturing Manufacturing Supply Chain Management Process Improvement Product Management Business Intelligence Business Process... Supply Management Product Planning Product Road Mapping New Product Roll Out New Product Release Mergers & Acquisitions See 35+     See less ", "Experience Supply Chain Analyst Intel Corporation March 2013  – Present (2 years 6 months) Business Supply Planner Intel Corporation May 2012  –  August 2012  (4 months) Folsom, CA -Manage Box Product globally to maximize box factory fulfillment of customer orders via proactive planning and inventory strategies, product life cycle management and execution to business strategies that support channel growth. \n \n-Owner of lean initiative to automate a data verification process to eliminate wasted time SAP Co-op Church & Dwight January 2011  –  July 2011  (7 months) Princeton, NJ Part of the Master Data Management team on a large scale project to upgrade Church & Dwight's ERP system to SAP ECC 6.0 in five countries \n \nProficient in the use of SAP ECC 6.0, SAP Master Data Management, HP Quality Center, Manugistics, Microsoft Office software and have working knowledge of relational databases \n \nCapable of managing, maintaining, and analyzing extremely large amounts of data \n \nWorked with co-packers and supply planners to help create distribution timelines and schedules for Church & Dwight products Supply Chain Analyst Intel Corporation March 2013  – Present (2 years 6 months) Supply Chain Analyst Intel Corporation March 2013  – Present (2 years 6 months) Business Supply Planner Intel Corporation May 2012  –  August 2012  (4 months) Folsom, CA -Manage Box Product globally to maximize box factory fulfillment of customer orders via proactive planning and inventory strategies, product life cycle management and execution to business strategies that support channel growth. \n \n-Owner of lean initiative to automate a data verification process to eliminate wasted time Business Supply Planner Intel Corporation May 2012  –  August 2012  (4 months) Folsom, CA -Manage Box Product globally to maximize box factory fulfillment of customer orders via proactive planning and inventory strategies, product life cycle management and execution to business strategies that support channel growth. \n \n-Owner of lean initiative to automate a data verification process to eliminate wasted time SAP Co-op Church & Dwight January 2011  –  July 2011  (7 months) Princeton, NJ Part of the Master Data Management team on a large scale project to upgrade Church & Dwight's ERP system to SAP ECC 6.0 in five countries \n \nProficient in the use of SAP ECC 6.0, SAP Master Data Management, HP Quality Center, Manugistics, Microsoft Office software and have working knowledge of relational databases \n \nCapable of managing, maintaining, and analyzing extremely large amounts of data \n \nWorked with co-packers and supply planners to help create distribution timelines and schedules for Church & Dwight products SAP Co-op Church & Dwight January 2011  –  July 2011  (7 months) Princeton, NJ Part of the Master Data Management team on a large scale project to upgrade Church & Dwight's ERP system to SAP ECC 6.0 in five countries \n \nProficient in the use of SAP ECC 6.0, SAP Master Data Management, HP Quality Center, Manugistics, Microsoft Office software and have working knowledge of relational databases \n \nCapable of managing, maintaining, and analyzing extremely large amounts of data \n \nWorked with co-packers and supply planners to help create distribution timelines and schedules for Church & Dwight products Skills Microsoft Office Microsoft Excel PowerPoint Business Planning Project Management Event Planning Social Media Event Management Public Speaking SAP Supply Chain Management Sales Skills  Microsoft Office Microsoft Excel PowerPoint Business Planning Project Management Event Planning Social Media Event Management Public Speaking SAP Supply Chain Management Sales Microsoft Office Microsoft Excel PowerPoint Business Planning Project Management Event Planning Social Media Event Management Public Speaking SAP Supply Chain Management Sales Microsoft Office Microsoft Excel PowerPoint Business Planning Project Management Event Planning Social Media Event Management Public Speaking SAP Supply Chain Management Sales Education Penn State University Bachelor of Science,  Supply Chain & Information Systems ,  minor in Information Systems Management and Intl Business 2008  – 2012 Copenhagen Business School Minor,  International Business 2010  – 2010 Penn State University Bachelor of Science,  Supply Chain & Information Systems ,  minor in Information Systems Management and Intl Business 2008  – 2012 Penn State University Bachelor of Science,  Supply Chain & Information Systems ,  minor in Information Systems Management and Intl Business 2008  – 2012 Penn State University Bachelor of Science,  Supply Chain & Information Systems ,  minor in Information Systems Management and Intl Business 2008  – 2012 Copenhagen Business School Minor,  International Business 2010  – 2010 Copenhagen Business School Minor,  International Business 2010  – 2010 Copenhagen Business School Minor,  International Business 2010  – 2010 ", "Summary Beni is an organizational leader and business transformation leader in digitizing the supply chain with mastery on transportation planning, inventory management, sales & operations planning, demand and supply planning leveraging multiple IT technologies. \n \nShe holds a Project Management Professional Certification (PMP) and is University educated as Industrial Management Engineer. Summary Beni is an organizational leader and business transformation leader in digitizing the supply chain with mastery on transportation planning, inventory management, sales & operations planning, demand and supply planning leveraging multiple IT technologies. \n \nShe holds a Project Management Professional Certification (PMP) and is University educated as Industrial Management Engineer. Beni is an organizational leader and business transformation leader in digitizing the supply chain with mastery on transportation planning, inventory management, sales & operations planning, demand and supply planning leveraging multiple IT technologies. \n \nShe holds a Project Management Professional Certification (PMP) and is University educated as Industrial Management Engineer. Beni is an organizational leader and business transformation leader in digitizing the supply chain with mastery on transportation planning, inventory management, sales & operations planning, demand and supply planning leveraging multiple IT technologies. \n \nShe holds a Project Management Professional Certification (PMP) and is University educated as Industrial Management Engineer. Experience Asia Transportation IT Services Regional Delivery Manager Procter & Gamble July 2010  – Present (5 years 2 months) Manila, Philippines Key Contribution: Transportation transformation in P&G Asia to deliver 4% transportation cost savings through three key strategies – vehicle fill improvement through better truck sizing leveraging Ortec solution, better route optimization leveraging JDA Transportation Management System and organization intervention via consolidation and centralization of transportation planning teams across Asia Asia Planning IT Services Regional Portfolio Leader Procter & Gamble July 2008  –  June 2010  (2 years) Manila, Philippines Key Contribution: Led the over-all Planning & Inventory systems portfolio for Asia working with multiple internal P&G clients. Introduced multiple capabilities in inventory visibility leveraging SAP BW technology, safety stock setting through Optiant software and maintained base capability on supply and demand planning leveraging SAP software for short term and long term planning. Asia Demand Planning IT Program Manager Procter & Gamble September 2006  –  June 2008  (1 year 10 months) Manila, Philippines Key Contribution: Standardization of Demand Planning systems from 3 different platforms to one single SAP Demand Planning platform leveraging SAP APO and BW reporting technologies done in an accelerated and frugal approach Distributor Order Acquisition System Project Manager Procter & Gamble June 2005  –  August 2006  (1 year 3 months) Manila, Philippines Key Contribution: Integrated Gillette categories into the existing distributor web order acquisition tool in Asia, working with P&G distributors to take on distribution of Gillette products across Asia. This project had a no miss completion date in line with the Gillette acquisition global contract. Category Supply Planning Subject Matter Expert Procter & Gamble September 2002  –  May 2005  (2 years 9 months) Manila, Philippines Key Contribution: Built capability of Asia Category Planners on SAP APO and BW technology to enable better rough cut capacity planning for Baby Care, Fem Care, Beauty Care and Health Care categories across Asia. Drove work process standardization across Asia and conducted and implemented SAP APO and BW trainings. Category Planning Manager/Site Supply Planner Intel Corporation February 1998  –  September 2002  (4 years 8 months) Manila, Philippines •\tResponsible for one category long term supply planning for Intel optimizing internal and subcontracted supply capacities with the 18 months demand forecasted. Drove issue resolution for short term and long term supply gaps. \n•\tResponsible for daily production planning in the plant for multiple products and led and executed supply issue resolutions in the plant Asia Transportation IT Services Regional Delivery Manager Procter & Gamble July 2010  – Present (5 years 2 months) Manila, Philippines Key Contribution: Transportation transformation in P&G Asia to deliver 4% transportation cost savings through three key strategies – vehicle fill improvement through better truck sizing leveraging Ortec solution, better route optimization leveraging JDA Transportation Management System and organization intervention via consolidation and centralization of transportation planning teams across Asia Asia Transportation IT Services Regional Delivery Manager Procter & Gamble July 2010  – Present (5 years 2 months) Manila, Philippines Key Contribution: Transportation transformation in P&G Asia to deliver 4% transportation cost savings through three key strategies – vehicle fill improvement through better truck sizing leveraging Ortec solution, better route optimization leveraging JDA Transportation Management System and organization intervention via consolidation and centralization of transportation planning teams across Asia Asia Planning IT Services Regional Portfolio Leader Procter & Gamble July 2008  –  June 2010  (2 years) Manila, Philippines Key Contribution: Led the over-all Planning & Inventory systems portfolio for Asia working with multiple internal P&G clients. Introduced multiple capabilities in inventory visibility leveraging SAP BW technology, safety stock setting through Optiant software and maintained base capability on supply and demand planning leveraging SAP software for short term and long term planning. Asia Planning IT Services Regional Portfolio Leader Procter & Gamble July 2008  –  June 2010  (2 years) Manila, Philippines Key Contribution: Led the over-all Planning & Inventory systems portfolio for Asia working with multiple internal P&G clients. Introduced multiple capabilities in inventory visibility leveraging SAP BW technology, safety stock setting through Optiant software and maintained base capability on supply and demand planning leveraging SAP software for short term and long term planning. Asia Demand Planning IT Program Manager Procter & Gamble September 2006  –  June 2008  (1 year 10 months) Manila, Philippines Key Contribution: Standardization of Demand Planning systems from 3 different platforms to one single SAP Demand Planning platform leveraging SAP APO and BW reporting technologies done in an accelerated and frugal approach Asia Demand Planning IT Program Manager Procter & Gamble September 2006  –  June 2008  (1 year 10 months) Manila, Philippines Key Contribution: Standardization of Demand Planning systems from 3 different platforms to one single SAP Demand Planning platform leveraging SAP APO and BW reporting technologies done in an accelerated and frugal approach Distributor Order Acquisition System Project Manager Procter & Gamble June 2005  –  August 2006  (1 year 3 months) Manila, Philippines Key Contribution: Integrated Gillette categories into the existing distributor web order acquisition tool in Asia, working with P&G distributors to take on distribution of Gillette products across Asia. This project had a no miss completion date in line with the Gillette acquisition global contract. Distributor Order Acquisition System Project Manager Procter & Gamble June 2005  –  August 2006  (1 year 3 months) Manila, Philippines Key Contribution: Integrated Gillette categories into the existing distributor web order acquisition tool in Asia, working with P&G distributors to take on distribution of Gillette products across Asia. This project had a no miss completion date in line with the Gillette acquisition global contract. Category Supply Planning Subject Matter Expert Procter & Gamble September 2002  –  May 2005  (2 years 9 months) Manila, Philippines Key Contribution: Built capability of Asia Category Planners on SAP APO and BW technology to enable better rough cut capacity planning for Baby Care, Fem Care, Beauty Care and Health Care categories across Asia. Drove work process standardization across Asia and conducted and implemented SAP APO and BW trainings. Category Supply Planning Subject Matter Expert Procter & Gamble September 2002  –  May 2005  (2 years 9 months) Manila, Philippines Key Contribution: Built capability of Asia Category Planners on SAP APO and BW technology to enable better rough cut capacity planning for Baby Care, Fem Care, Beauty Care and Health Care categories across Asia. Drove work process standardization across Asia and conducted and implemented SAP APO and BW trainings. Category Planning Manager/Site Supply Planner Intel Corporation February 1998  –  September 2002  (4 years 8 months) Manila, Philippines •\tResponsible for one category long term supply planning for Intel optimizing internal and subcontracted supply capacities with the 18 months demand forecasted. Drove issue resolution for short term and long term supply gaps. \n•\tResponsible for daily production planning in the plant for multiple products and led and executed supply issue resolutions in the plant Category Planning Manager/Site Supply Planner Intel Corporation February 1998  –  September 2002  (4 years 8 months) Manila, Philippines •\tResponsible for one category long term supply planning for Intel optimizing internal and subcontracted supply capacities with the 18 months demand forecasted. Drove issue resolution for short term and long term supply gaps. \n•\tResponsible for daily production planning in the plant for multiple products and led and executed supply issue resolutions in the plant Skills Program Management Organizational... Supply Chain Management Transportation... Demand Planning Supply Network Planning Inventory Management SAP R/3 SAP BW SAP APO JDA Transportation... Ortec Load Building Leadership Business Transformation SAP ERP Skills  Program Management Organizational... Supply Chain Management Transportation... Demand Planning Supply Network Planning Inventory Management SAP R/3 SAP BW SAP APO JDA Transportation... Ortec Load Building Leadership Business Transformation SAP ERP Program Management Organizational... Supply Chain Management Transportation... Demand Planning Supply Network Planning Inventory Management SAP R/3 SAP BW SAP APO JDA Transportation... Ortec Load Building Leadership Business Transformation SAP ERP Program Management Organizational... Supply Chain Management Transportation... Demand Planning Supply Network Planning Inventory Management SAP R/3 SAP BW SAP APO JDA Transportation... Ortec Load Building Leadership Business Transformation SAP ERP Education De La Salle University Bachelor of Science in Industrial Management Engineering minor in Mechanical Engineering 1992  – 1997 De La Salle University Bachelor of Science in Industrial Management Engineering minor in Mechanical Engineering 1992  – 1997 De La Salle University Bachelor of Science in Industrial Management Engineering minor in Mechanical Engineering 1992  – 1997 De La Salle University Bachelor of Science in Industrial Management Engineering minor in Mechanical Engineering 1992  – 1997 ", "Experience Operations Engineering Systems Analyst NVIDIA July 2010  – Present (5 years 2 months) Santa Clara, CA Understand mfg/planning req’s thru ES/QS/PS & Production Phase. \nWork with Product Engineers to translate SKU/PFG Definition into Serus I/O link. \nGenerate I/O Link as required – ensure integrity of attributes. \nDocument Production Flow as implemented in Serus. \nLifecycle management of I/O link – work with Planner & PE to manage I/O Link lifecycle. \nWork with Product Engineers to update Yield/Bin Fraction/FF/Test Times forecast in Serus. \nEnsure Engineering Master Data is accurate in Serus. \nDeviations for the products \nAnalyzing data system and processes to identify possible bottlenecks, inefficiencies and weaknesses. \nRecommending and implementing process changes to improve overall data system robustness. Inventory Control Analyst NVIDIA June 2007  –  February 2010  (2 years 9 months) Santa Clara, CA Enhance product workflow by analyzing and developing reports that affect production and inventory decisions. Responsible for analyzing data from SAP database. Build spreadsheets and graphs and present analysis to Upper Management and staff. Analysis includes Historical data (log genealogy), aging inventories, WIP, rescreen and scrap product. Support weekly reporting requirements for Inventory Control department and support the monitoring of Subcon Cycle Time Performance. Define new reports, taking on new projects, identifying process gaps and quantify the need for improvement. Work with other teams within the Operations group (Planning, Finance, Quality and Engineering). Created macros in excel to speed up reporting time. Increased manual reporting times from 2 days down to 4 hours for reports generated weekly for Upper Management. Also created macros for individuals to help reduce the amount of time to run individual weekly reports. Created new queries in QuickViewer (SAP – Linking tables) to speed up the amount of time to download connected information. Supply Planner Intel Corporation February 2006  –  June 2007  (1 year 5 months) Santa Clara, CA Work closely with the geographies to utilize product and update supply line changes. Ensures product availability and worldwide inventory levels are in place to support customer commitments. Updates/analyzes supply, backlog, and commits data to meet customer delivery performance, inventory, revenue, and other planning indicators. Define product conversion strategies. Assists in developing and executing crisis recovery strategies under pressure. Ensures supply aligns with geo and warranty commits support. Identify material requirement gaps in factory schedules and coordinate product expedites with ATM. Prioritize manufacturing availability commitments. Identify revenue risks by monitoring and highlighting geographic scheduling/shipment issues. Manage corporate commits process. Update and maintain planning systems of record. Production/Inventory Control Supervisor Maxim Integrated June 2005  –  May 2007  (2 years) Sunnyvale, CA Responsible for the supervision of Inventory Control Operators. Training all operators to existing, new, and revised procedures. Document policies and procedures via the Document Control ECN process. Train all operators to existing, new, and revised procedures. Maintain and monitor operator certification and cross-training of personnel. Review and rectify the entry of production data. Review WIP, in transit operations, and critical clickers to ensure moves are performed correctly. Review and act on Dispatch Incoming Reports and other documentation generated by operators to notify management of issues and problems. Take corrective action as required. Monitor and develop internal and external logistical processes for finished and unfinished material. Respond to and rectify quality related issues. Interface with customer service, product line management, and business management to meet customer demand and determine priority accordingly. Create and manage reports to measure performance goals and production metrics. Coordinate all aspects of the scrap process relating to wafers, die, and devices in Wafer and End of Line facilities. Understand process flows and assist in the creation of new routes/travelers as necessary. Identify, research, and disposition set up controls to prevent missing lots. Induction, storage, and potential scrap of E-MRB material. Command of process and production flow dynamics and resource management as they pertain to the manufacturing environment. Completed 6 month cross-training rotation on production floor. Operations Engineering Systems Analyst NVIDIA July 2010  – Present (5 years 2 months) Santa Clara, CA Understand mfg/planning req’s thru ES/QS/PS & Production Phase. \nWork with Product Engineers to translate SKU/PFG Definition into Serus I/O link. \nGenerate I/O Link as required – ensure integrity of attributes. \nDocument Production Flow as implemented in Serus. \nLifecycle management of I/O link – work with Planner & PE to manage I/O Link lifecycle. \nWork with Product Engineers to update Yield/Bin Fraction/FF/Test Times forecast in Serus. \nEnsure Engineering Master Data is accurate in Serus. \nDeviations for the products \nAnalyzing data system and processes to identify possible bottlenecks, inefficiencies and weaknesses. \nRecommending and implementing process changes to improve overall data system robustness. Operations Engineering Systems Analyst NVIDIA July 2010  – Present (5 years 2 months) Santa Clara, CA Understand mfg/planning req’s thru ES/QS/PS & Production Phase. \nWork with Product Engineers to translate SKU/PFG Definition into Serus I/O link. \nGenerate I/O Link as required – ensure integrity of attributes. \nDocument Production Flow as implemented in Serus. \nLifecycle management of I/O link – work with Planner & PE to manage I/O Link lifecycle. \nWork with Product Engineers to update Yield/Bin Fraction/FF/Test Times forecast in Serus. \nEnsure Engineering Master Data is accurate in Serus. \nDeviations for the products \nAnalyzing data system and processes to identify possible bottlenecks, inefficiencies and weaknesses. \nRecommending and implementing process changes to improve overall data system robustness. Inventory Control Analyst NVIDIA June 2007  –  February 2010  (2 years 9 months) Santa Clara, CA Enhance product workflow by analyzing and developing reports that affect production and inventory decisions. Responsible for analyzing data from SAP database. Build spreadsheets and graphs and present analysis to Upper Management and staff. Analysis includes Historical data (log genealogy), aging inventories, WIP, rescreen and scrap product. Support weekly reporting requirements for Inventory Control department and support the monitoring of Subcon Cycle Time Performance. Define new reports, taking on new projects, identifying process gaps and quantify the need for improvement. Work with other teams within the Operations group (Planning, Finance, Quality and Engineering). Created macros in excel to speed up reporting time. Increased manual reporting times from 2 days down to 4 hours for reports generated weekly for Upper Management. Also created macros for individuals to help reduce the amount of time to run individual weekly reports. Created new queries in QuickViewer (SAP – Linking tables) to speed up the amount of time to download connected information. Inventory Control Analyst NVIDIA June 2007  –  February 2010  (2 years 9 months) Santa Clara, CA Enhance product workflow by analyzing and developing reports that affect production and inventory decisions. Responsible for analyzing data from SAP database. Build spreadsheets and graphs and present analysis to Upper Management and staff. Analysis includes Historical data (log genealogy), aging inventories, WIP, rescreen and scrap product. Support weekly reporting requirements for Inventory Control department and support the monitoring of Subcon Cycle Time Performance. Define new reports, taking on new projects, identifying process gaps and quantify the need for improvement. Work with other teams within the Operations group (Planning, Finance, Quality and Engineering). Created macros in excel to speed up reporting time. Increased manual reporting times from 2 days down to 4 hours for reports generated weekly for Upper Management. Also created macros for individuals to help reduce the amount of time to run individual weekly reports. Created new queries in QuickViewer (SAP – Linking tables) to speed up the amount of time to download connected information. Supply Planner Intel Corporation February 2006  –  June 2007  (1 year 5 months) Santa Clara, CA Work closely with the geographies to utilize product and update supply line changes. Ensures product availability and worldwide inventory levels are in place to support customer commitments. Updates/analyzes supply, backlog, and commits data to meet customer delivery performance, inventory, revenue, and other planning indicators. Define product conversion strategies. Assists in developing and executing crisis recovery strategies under pressure. Ensures supply aligns with geo and warranty commits support. Identify material requirement gaps in factory schedules and coordinate product expedites with ATM. Prioritize manufacturing availability commitments. Identify revenue risks by monitoring and highlighting geographic scheduling/shipment issues. Manage corporate commits process. Update and maintain planning systems of record. Supply Planner Intel Corporation February 2006  –  June 2007  (1 year 5 months) Santa Clara, CA Work closely with the geographies to utilize product and update supply line changes. Ensures product availability and worldwide inventory levels are in place to support customer commitments. Updates/analyzes supply, backlog, and commits data to meet customer delivery performance, inventory, revenue, and other planning indicators. Define product conversion strategies. Assists in developing and executing crisis recovery strategies under pressure. Ensures supply aligns with geo and warranty commits support. Identify material requirement gaps in factory schedules and coordinate product expedites with ATM. Prioritize manufacturing availability commitments. Identify revenue risks by monitoring and highlighting geographic scheduling/shipment issues. Manage corporate commits process. Update and maintain planning systems of record. Production/Inventory Control Supervisor Maxim Integrated June 2005  –  May 2007  (2 years) Sunnyvale, CA Responsible for the supervision of Inventory Control Operators. Training all operators to existing, new, and revised procedures. Document policies and procedures via the Document Control ECN process. Train all operators to existing, new, and revised procedures. Maintain and monitor operator certification and cross-training of personnel. Review and rectify the entry of production data. Review WIP, in transit operations, and critical clickers to ensure moves are performed correctly. Review and act on Dispatch Incoming Reports and other documentation generated by operators to notify management of issues and problems. Take corrective action as required. Monitor and develop internal and external logistical processes for finished and unfinished material. Respond to and rectify quality related issues. Interface with customer service, product line management, and business management to meet customer demand and determine priority accordingly. Create and manage reports to measure performance goals and production metrics. Coordinate all aspects of the scrap process relating to wafers, die, and devices in Wafer and End of Line facilities. Understand process flows and assist in the creation of new routes/travelers as necessary. Identify, research, and disposition set up controls to prevent missing lots. Induction, storage, and potential scrap of E-MRB material. Command of process and production flow dynamics and resource management as they pertain to the manufacturing environment. Completed 6 month cross-training rotation on production floor. Production/Inventory Control Supervisor Maxim Integrated June 2005  –  May 2007  (2 years) Sunnyvale, CA Responsible for the supervision of Inventory Control Operators. Training all operators to existing, new, and revised procedures. Document policies and procedures via the Document Control ECN process. Train all operators to existing, new, and revised procedures. Maintain and monitor operator certification and cross-training of personnel. Review and rectify the entry of production data. Review WIP, in transit operations, and critical clickers to ensure moves are performed correctly. Review and act on Dispatch Incoming Reports and other documentation generated by operators to notify management of issues and problems. Take corrective action as required. Monitor and develop internal and external logistical processes for finished and unfinished material. Respond to and rectify quality related issues. Interface with customer service, product line management, and business management to meet customer demand and determine priority accordingly. Create and manage reports to measure performance goals and production metrics. Coordinate all aspects of the scrap process relating to wafers, die, and devices in Wafer and End of Line facilities. Understand process flows and assist in the creation of new routes/travelers as necessary. Identify, research, and disposition set up controls to prevent missing lots. Induction, storage, and potential scrap of E-MRB material. Command of process and production flow dynamics and resource management as they pertain to the manufacturing environment. Completed 6 month cross-training rotation on production floor. Education San Jose State University BA,  Mathematics 1998  – 2002 San Jose State University BA,  Mathematics 1998  – 2002 San Jose State University BA,  Mathematics 1998  – 2002 San Jose State University BA,  Mathematics 1998  – 2002 ", "Experience Product Customer and Data Management Business Architect Intel Corporation August 2012  – Present (3 years 1 month) Responsible for developing business process architecture for Intel's Product Data Management to meet business and supply chain goals and objectives, both in a reactive mode to address new business requirements as well as future capabilities by proactively doing environmental scans throughout the corporation and the industry. Supply Chain Business Architect/Business Analyst Intel Corporation August 2011  –  July 2012  (1 year) Santa Clara, California Supply Chain Data Integration Analyst/Project BA/Lean Champion Intel, Santa Clara, CA July 1998  –  October 2011  (13 years 4 months) My current role in the Product Data Planning (PDP) team as SCDIA is to partner with various Product Design Engineers, Supply Chain Program Managers, Factory/Division Planning, Data Architects and Enterprise Item Design analysts to identify future product supply chain data requirements and solutions, bridging strategic and tactical efforts. Success is measured by having Product Data architecture and procedures in place to quickly ramp during the product create process enabling test vehicle, engineering and production ramps. In addition, I am the Lean Champion for the Product and Customer Data Management (PCDM) organization working with the Engineering & Operations (E&O) champion and a Business Analyst (BA) on the Mid-Range Product Management (MRPM) project Supply Chain & Project Business Analyst Intel Corporation 2009  –  2010  (1 year) IACPU Division Product Data Planner Intel March 2002  –  June 2008  (6 years 4 months) • Managed CPU product data which enable supply chain systems in delivering finished products worth over billion dollars \n• Managed projects such as CM1 automation that contributed to Configuration Management’s throughput time reduction by 50% and IBR (Bill of Material & Routes) conversion for CPU that drives & enforces system/process alignment to Industry Standards and help enable shorter TPT on shop floor planning tasks from 18 to 5 days IACPU Division Product/Build Supply Planner Intel Corporation September 2000  –  March 2002  (1 year 7 months) Santa Clara, CA Worldwide product schedule and inventory management for CPU (Pentium III mobile & server) products that helped ensure $37 million revenue D2 Fab Diffusion Manufacturing Engineer Intel July 1999  –  September 2000  (1 year 3 months) • Capacity management of toolsets: Rapid Thermal Annealing (RTA) and Vertical Diffusion Furnaces (VDF); responsibility includes: \no Driving resolution to potential capacity shortfalls. Two examples are tool and split chamber conversions for VDFte and RTAsa that resulted to ~$347K cost avoidance of new tool allocations and improvement on data tool baseline that drove cost savings of ~$2 million \no Layout design, funding, allocation, installation & qualification schedules for New technology introduction/startup management (860 technology) D2 Fab Manufacturing Layout Engineer Intel April 1997  –  July 1999  (2 years 4 months) •Construction and Planning Group (CPG) Fab Layout Design management, responsibility includes application of efficient methodology to execute to installation requests; this resulted to cost savings of $283K and zero impact to installation and factory startup schedules Product Customer and Data Management Business Architect Intel Corporation August 2012  – Present (3 years 1 month) Responsible for developing business process architecture for Intel's Product Data Management to meet business and supply chain goals and objectives, both in a reactive mode to address new business requirements as well as future capabilities by proactively doing environmental scans throughout the corporation and the industry. Product Customer and Data Management Business Architect Intel Corporation August 2012  – Present (3 years 1 month) Responsible for developing business process architecture for Intel's Product Data Management to meet business and supply chain goals and objectives, both in a reactive mode to address new business requirements as well as future capabilities by proactively doing environmental scans throughout the corporation and the industry. Supply Chain Business Architect/Business Analyst Intel Corporation August 2011  –  July 2012  (1 year) Santa Clara, California Supply Chain Business Architect/Business Analyst Intel Corporation August 2011  –  July 2012  (1 year) Santa Clara, California Supply Chain Data Integration Analyst/Project BA/Lean Champion Intel, Santa Clara, CA July 1998  –  October 2011  (13 years 4 months) My current role in the Product Data Planning (PDP) team as SCDIA is to partner with various Product Design Engineers, Supply Chain Program Managers, Factory/Division Planning, Data Architects and Enterprise Item Design analysts to identify future product supply chain data requirements and solutions, bridging strategic and tactical efforts. Success is measured by having Product Data architecture and procedures in place to quickly ramp during the product create process enabling test vehicle, engineering and production ramps. In addition, I am the Lean Champion for the Product and Customer Data Management (PCDM) organization working with the Engineering & Operations (E&O) champion and a Business Analyst (BA) on the Mid-Range Product Management (MRPM) project Supply Chain Data Integration Analyst/Project BA/Lean Champion Intel, Santa Clara, CA July 1998  –  October 2011  (13 years 4 months) My current role in the Product Data Planning (PDP) team as SCDIA is to partner with various Product Design Engineers, Supply Chain Program Managers, Factory/Division Planning, Data Architects and Enterprise Item Design analysts to identify future product supply chain data requirements and solutions, bridging strategic and tactical efforts. Success is measured by having Product Data architecture and procedures in place to quickly ramp during the product create process enabling test vehicle, engineering and production ramps. In addition, I am the Lean Champion for the Product and Customer Data Management (PCDM) organization working with the Engineering & Operations (E&O) champion and a Business Analyst (BA) on the Mid-Range Product Management (MRPM) project Supply Chain & Project Business Analyst Intel Corporation 2009  –  2010  (1 year) Supply Chain & Project Business Analyst Intel Corporation 2009  –  2010  (1 year) IACPU Division Product Data Planner Intel March 2002  –  June 2008  (6 years 4 months) • Managed CPU product data which enable supply chain systems in delivering finished products worth over billion dollars \n• Managed projects such as CM1 automation that contributed to Configuration Management’s throughput time reduction by 50% and IBR (Bill of Material & Routes) conversion for CPU that drives & enforces system/process alignment to Industry Standards and help enable shorter TPT on shop floor planning tasks from 18 to 5 days IACPU Division Product Data Planner Intel March 2002  –  June 2008  (6 years 4 months) • Managed CPU product data which enable supply chain systems in delivering finished products worth over billion dollars \n• Managed projects such as CM1 automation that contributed to Configuration Management’s throughput time reduction by 50% and IBR (Bill of Material & Routes) conversion for CPU that drives & enforces system/process alignment to Industry Standards and help enable shorter TPT on shop floor planning tasks from 18 to 5 days IACPU Division Product/Build Supply Planner Intel Corporation September 2000  –  March 2002  (1 year 7 months) Santa Clara, CA Worldwide product schedule and inventory management for CPU (Pentium III mobile & server) products that helped ensure $37 million revenue IACPU Division Product/Build Supply Planner Intel Corporation September 2000  –  March 2002  (1 year 7 months) Santa Clara, CA Worldwide product schedule and inventory management for CPU (Pentium III mobile & server) products that helped ensure $37 million revenue D2 Fab Diffusion Manufacturing Engineer Intel July 1999  –  September 2000  (1 year 3 months) • Capacity management of toolsets: Rapid Thermal Annealing (RTA) and Vertical Diffusion Furnaces (VDF); responsibility includes: \no Driving resolution to potential capacity shortfalls. Two examples are tool and split chamber conversions for VDFte and RTAsa that resulted to ~$347K cost avoidance of new tool allocations and improvement on data tool baseline that drove cost savings of ~$2 million \no Layout design, funding, allocation, installation & qualification schedules for New technology introduction/startup management (860 technology) D2 Fab Diffusion Manufacturing Engineer Intel July 1999  –  September 2000  (1 year 3 months) • Capacity management of toolsets: Rapid Thermal Annealing (RTA) and Vertical Diffusion Furnaces (VDF); responsibility includes: \no Driving resolution to potential capacity shortfalls. Two examples are tool and split chamber conversions for VDFte and RTAsa that resulted to ~$347K cost avoidance of new tool allocations and improvement on data tool baseline that drove cost savings of ~$2 million \no Layout design, funding, allocation, installation & qualification schedules for New technology introduction/startup management (860 technology) D2 Fab Manufacturing Layout Engineer Intel April 1997  –  July 1999  (2 years 4 months) •Construction and Planning Group (CPG) Fab Layout Design management, responsibility includes application of efficient methodology to execute to installation requests; this resulted to cost savings of $283K and zero impact to installation and factory startup schedules D2 Fab Manufacturing Layout Engineer Intel April 1997  –  July 1999  (2 years 4 months) •Construction and Planning Group (CPG) Fab Layout Design management, responsibility includes application of efficient methodology to execute to installation requests; this resulted to cost savings of $283K and zero impact to installation and factory startup schedules Skills Process Improvement Project Planning Project Management Manufacturing Requirements Analysis Product Management Skills  Process Improvement Project Planning Project Management Manufacturing Requirements Analysis Product Management Process Improvement Project Planning Project Management Manufacturing Requirements Analysis Product Management Process Improvement Project Planning Project Management Manufacturing Requirements Analysis Product Management Education Mapua Institute of Technology 1985  – 1990 Mapua Institute of Technology 1985  – 1990 Mapua Institute of Technology 1985  – 1990 Mapua Institute of Technology 1985  – 1990 ", "Experience Assistant Merchandise Manager -Apparel Running adidas October 2014  – Present (11 months) Master Data Analyst adidas April 2013  –  October 2014  (1 year 7 months) Supply Planner Intel Corporation February 2012  –  January 2013  (1 year) Hillsboro, Oregon Research Assistant University of Puerto Rico August 2010  –  June 2011  (11 months) San Juan, Puerto Rico INIM Office Assistant University of Puerto Rico July 2009  –  July 2010  (1 year 1 month) San Juan, Puerto Rico Assistant Merchandise Manager -Apparel Running adidas October 2014  – Present (11 months) Assistant Merchandise Manager -Apparel Running adidas October 2014  – Present (11 months) Master Data Analyst adidas April 2013  –  October 2014  (1 year 7 months) Master Data Analyst adidas April 2013  –  October 2014  (1 year 7 months) Supply Planner Intel Corporation February 2012  –  January 2013  (1 year) Hillsboro, Oregon Supply Planner Intel Corporation February 2012  –  January 2013  (1 year) Hillsboro, Oregon Research Assistant University of Puerto Rico August 2010  –  June 2011  (11 months) San Juan, Puerto Rico Research Assistant University of Puerto Rico August 2010  –  June 2011  (11 months) San Juan, Puerto Rico INIM Office Assistant University of Puerto Rico July 2009  –  July 2010  (1 year 1 month) San Juan, Puerto Rico INIM Office Assistant University of Puerto Rico July 2009  –  July 2010  (1 year 1 month) San Juan, Puerto Rico Languages Spanish Native or bilingual proficiency English Native or bilingual proficiency French Professional working proficiency Spanish Native or bilingual proficiency English Native or bilingual proficiency French Professional working proficiency Spanish Native or bilingual proficiency English Native or bilingual proficiency French Professional working proficiency Native or bilingual proficiency Native or bilingual proficiency Professional working proficiency Skills Data Analysis Microsoft Office Access Forecasting Market Analysis SAP Customer Service Data Mining Research Analysis Microsoft Excel Supply Chain Management Finance Skills  Data Analysis Microsoft Office Access Forecasting Market Analysis SAP Customer Service Data Mining Research Analysis Microsoft Excel Supply Chain Management Finance Data Analysis Microsoft Office Access Forecasting Market Analysis SAP Customer Service Data Mining Research Analysis Microsoft Excel Supply Chain Management Finance Data Analysis Microsoft Office Access Forecasting Market Analysis SAP Customer Service Data Mining Research Analysis Microsoft Excel Supply Chain Management Finance Education University of Puerto Rico-Rio Piedras Master of Business Administration (MBA),  International Business 2009  – 2012 University of Washington Bachelor's degree,  Economics & French 2005  – 2009 University of Puerto Rico-Rio Piedras Master of Business Administration (MBA),  International Business 2009  – 2012 University of Puerto Rico-Rio Piedras Master of Business Administration (MBA),  International Business 2009  – 2012 University of Puerto Rico-Rio Piedras Master of Business Administration (MBA),  International Business 2009  – 2012 University of Washington Bachelor's degree,  Economics & French 2005  – 2009 University of Washington Bachelor's degree,  Economics & French 2005  – 2009 University of Washington Bachelor's degree,  Economics & French 2005  – 2009 ", "Summary - A Certified Six Sigma Black Belt by American Society for Quality with 10 years of experience in applying Lean and Six Sigma to process improvement projects \n- Extensive experience in managing multicultural teams of different dimensions \n- 10 years of career experience developed in the different areas of Process Improvement, Six Sigma Implementation, Process Integration, Financial Analysis, Operations Management, and Product Launches in multinationals companies \n \nSpecialties: Quality Improvement \nProject Management, \nFinancial Analysis, \nSupply Chain Management, \nManagement Consulting, \nSix Sigma Re-engineering & Implementation, \nLean Manufacturing, \nProcess Improvement, \nProduction Planning & Inventory Management, \nProduct Life-Cycle Planning, \nGlobalizing Innovation Summary - A Certified Six Sigma Black Belt by American Society for Quality with 10 years of experience in applying Lean and Six Sigma to process improvement projects \n- Extensive experience in managing multicultural teams of different dimensions \n- 10 years of career experience developed in the different areas of Process Improvement, Six Sigma Implementation, Process Integration, Financial Analysis, Operations Management, and Product Launches in multinationals companies \n \nSpecialties: Quality Improvement \nProject Management, \nFinancial Analysis, \nSupply Chain Management, \nManagement Consulting, \nSix Sigma Re-engineering & Implementation, \nLean Manufacturing, \nProcess Improvement, \nProduction Planning & Inventory Management, \nProduct Life-Cycle Planning, \nGlobalizing Innovation - A Certified Six Sigma Black Belt by American Society for Quality with 10 years of experience in applying Lean and Six Sigma to process improvement projects \n- Extensive experience in managing multicultural teams of different dimensions \n- 10 years of career experience developed in the different areas of Process Improvement, Six Sigma Implementation, Process Integration, Financial Analysis, Operations Management, and Product Launches in multinationals companies \n \nSpecialties: Quality Improvement \nProject Management, \nFinancial Analysis, \nSupply Chain Management, \nManagement Consulting, \nSix Sigma Re-engineering & Implementation, \nLean Manufacturing, \nProcess Improvement, \nProduction Planning & Inventory Management, \nProduct Life-Cycle Planning, \nGlobalizing Innovation - A Certified Six Sigma Black Belt by American Society for Quality with 10 years of experience in applying Lean and Six Sigma to process improvement projects \n- Extensive experience in managing multicultural teams of different dimensions \n- 10 years of career experience developed in the different areas of Process Improvement, Six Sigma Implementation, Process Integration, Financial Analysis, Operations Management, and Product Launches in multinationals companies \n \nSpecialties: Quality Improvement \nProject Management, \nFinancial Analysis, \nSupply Chain Management, \nManagement Consulting, \nSix Sigma Re-engineering & Implementation, \nLean Manufacturing, \nProcess Improvement, \nProduction Planning & Inventory Management, \nProduct Life-Cycle Planning, \nGlobalizing Innovation Experience Manager, Continuous Improvement San Francisco Health Plan June 2014  – Present (1 year 3 months) San Francisco Bay Area Process Improvement Manager San Francisco Health Plan October 2013  –  June 2014  (9 months) San Francisco Bay Area - Lead and facilitate process improvement initiatives using Lean Six Sigma Methodology \n- Conduct studies of operations, workflow processes and develop the most cost efficient or productive way for processes \n- Develop and implement management planning and control systems to enhance managerial effectiveness by providing objective, qualitative and quantitative performance indices \n- Participate in the construction of an SFHP methodology and approach towards all work efforts Senior Quality Improvement Manager Anka Behavioral Health, Inc. December 2012  –  October 2013  (11 months) Concord, CA - Designed a billing tracking tool to improve the revenue collection performance using DFSS (Design for Six Sigma) \n- Automate the incident reporting process to reduce human errors and rework while improving the data quality \n- Develop and implement Quality Improvement Projects to improve overall operational efficiency through different tools such as Six Sigma and Lean \n- Audit and analyze operational performance to meet contracts, DMH/CCL audit, and CARF Certification requirements  \n- Lead and direct staff to develop and implement corrective action plans that address quality and contract compliance issues found in audits \n- Analyze program operations and create procedures manuals to ensure they meet various compliance standards, as defined by federal and state licensing and monitoring bodies \n- Establish and measure quality improvement standards in accordance with specified federal and state guidelines and regulations to ensure quality, cost effective, and quantifiable services \n- Develop and analyze key performance metrics to identify opportunities for improvement and present operational strategy to executive management Sr. Financial Analyst Kaiser Permanente April 2010  –  December 2012  (2 years 9 months) South San Francisco, CA Develop project plans to roll out organizational initiatives in front office operations \nProduce, analyze, and communicate front office operation performance metrics to department managers  \nIdentify risks and recommend improvement solutions to reach regional targets \nDevelop training tools to support registration designees and front office managers on policies and procedures \nPerform internal audits such as observation audit, change fund audit, and cash safeguard audit based on SOX Compliance requirements Project Consultant Tarte Cosmetics December 2009  –  April 2010  (5 months) New York, NY Managed new products launches to meet Canada's compliance requirements \nDeveloped transition strategies to launch existing products to Europe according to EU Compliance \nManaged production schedule by coordinating with international suppliers \nRecommended solutions to improve the existing supply chain and logistics and to reduce inventory cost Project Manager Benefit Cosmetics August 2008  –  March 2009  (8 months) Oakland, CA Created, managed, and executed critical path of new product launches \nDeveloped project scope and production procedures to suppliers and negotiated price, leadtime, and freight method \nEnsure on-time delivery to all 3 distribution centers \nResolved issues by identifying potential problems in sufficient time for corrective action to be taken  \nAttended face-to-face meeting with suppliers in China and developed successful partnership Sr. Operations Planning Executive Neo Derm (HK) Ltd. October 2007  –  June 2008  (9 months) Hong Kong Implemented operations process reengineering projects to achieve operational efficiencies and effectiveness \nExecuted regional retail center projects for PRC and South East Asia markets to achieve high service quality, high sales performance, and operational effectiveness in regional markets \nImplemented and controlled the process standardization and improvement initiatives to continuously improve center performance using Six Sigma \nSupervised operation assistants and provided coaching and guidance to achieve smooth and timely execution of their assigned tasks Sr. Financial Analyst Kaiser Permanente October 2006  –  October 2007  (1 year 1 month) Santa Clara, CA Prepared, coordinated and compilated KPIT's Budget, Forecasts and Long Range Financial Plan \nPerformed variance analysis and created ad-hoc reports and presentations \nRecommended improvement solutions to assist upper Management in key decision-making \nParticipated in the development and maintenance of performance metrics, measurements, methods, and targets \nAutomated and streamlined internal account payable processes \nPartnered with Finance counterparts in clinical departments to improve financial analysis, reporting, budgeting, and forecasting processes. Product Supply Planner Intel Corporation June 2005  –  October 2006  (1 year 5 months) Manager, Continuous Improvement San Francisco Health Plan June 2014  – Present (1 year 3 months) San Francisco Bay Area Manager, Continuous Improvement San Francisco Health Plan June 2014  – Present (1 year 3 months) San Francisco Bay Area Process Improvement Manager San Francisco Health Plan October 2013  –  June 2014  (9 months) San Francisco Bay Area - Lead and facilitate process improvement initiatives using Lean Six Sigma Methodology \n- Conduct studies of operations, workflow processes and develop the most cost efficient or productive way for processes \n- Develop and implement management planning and control systems to enhance managerial effectiveness by providing objective, qualitative and quantitative performance indices \n- Participate in the construction of an SFHP methodology and approach towards all work efforts Process Improvement Manager San Francisco Health Plan October 2013  –  June 2014  (9 months) San Francisco Bay Area - Lead and facilitate process improvement initiatives using Lean Six Sigma Methodology \n- Conduct studies of operations, workflow processes and develop the most cost efficient or productive way for processes \n- Develop and implement management planning and control systems to enhance managerial effectiveness by providing objective, qualitative and quantitative performance indices \n- Participate in the construction of an SFHP methodology and approach towards all work efforts Senior Quality Improvement Manager Anka Behavioral Health, Inc. December 2012  –  October 2013  (11 months) Concord, CA - Designed a billing tracking tool to improve the revenue collection performance using DFSS (Design for Six Sigma) \n- Automate the incident reporting process to reduce human errors and rework while improving the data quality \n- Develop and implement Quality Improvement Projects to improve overall operational efficiency through different tools such as Six Sigma and Lean \n- Audit and analyze operational performance to meet contracts, DMH/CCL audit, and CARF Certification requirements  \n- Lead and direct staff to develop and implement corrective action plans that address quality and contract compliance issues found in audits \n- Analyze program operations and create procedures manuals to ensure they meet various compliance standards, as defined by federal and state licensing and monitoring bodies \n- Establish and measure quality improvement standards in accordance with specified federal and state guidelines and regulations to ensure quality, cost effective, and quantifiable services \n- Develop and analyze key performance metrics to identify opportunities for improvement and present operational strategy to executive management Senior Quality Improvement Manager Anka Behavioral Health, Inc. December 2012  –  October 2013  (11 months) Concord, CA - Designed a billing tracking tool to improve the revenue collection performance using DFSS (Design for Six Sigma) \n- Automate the incident reporting process to reduce human errors and rework while improving the data quality \n- Develop and implement Quality Improvement Projects to improve overall operational efficiency through different tools such as Six Sigma and Lean \n- Audit and analyze operational performance to meet contracts, DMH/CCL audit, and CARF Certification requirements  \n- Lead and direct staff to develop and implement corrective action plans that address quality and contract compliance issues found in audits \n- Analyze program operations and create procedures manuals to ensure they meet various compliance standards, as defined by federal and state licensing and monitoring bodies \n- Establish and measure quality improvement standards in accordance with specified federal and state guidelines and regulations to ensure quality, cost effective, and quantifiable services \n- Develop and analyze key performance metrics to identify opportunities for improvement and present operational strategy to executive management Sr. Financial Analyst Kaiser Permanente April 2010  –  December 2012  (2 years 9 months) South San Francisco, CA Develop project plans to roll out organizational initiatives in front office operations \nProduce, analyze, and communicate front office operation performance metrics to department managers  \nIdentify risks and recommend improvement solutions to reach regional targets \nDevelop training tools to support registration designees and front office managers on policies and procedures \nPerform internal audits such as observation audit, change fund audit, and cash safeguard audit based on SOX Compliance requirements Sr. Financial Analyst Kaiser Permanente April 2010  –  December 2012  (2 years 9 months) South San Francisco, CA Develop project plans to roll out organizational initiatives in front office operations \nProduce, analyze, and communicate front office operation performance metrics to department managers  \nIdentify risks and recommend improvement solutions to reach regional targets \nDevelop training tools to support registration designees and front office managers on policies and procedures \nPerform internal audits such as observation audit, change fund audit, and cash safeguard audit based on SOX Compliance requirements Project Consultant Tarte Cosmetics December 2009  –  April 2010  (5 months) New York, NY Managed new products launches to meet Canada's compliance requirements \nDeveloped transition strategies to launch existing products to Europe according to EU Compliance \nManaged production schedule by coordinating with international suppliers \nRecommended solutions to improve the existing supply chain and logistics and to reduce inventory cost Project Consultant Tarte Cosmetics December 2009  –  April 2010  (5 months) New York, NY Managed new products launches to meet Canada's compliance requirements \nDeveloped transition strategies to launch existing products to Europe according to EU Compliance \nManaged production schedule by coordinating with international suppliers \nRecommended solutions to improve the existing supply chain and logistics and to reduce inventory cost Project Manager Benefit Cosmetics August 2008  –  March 2009  (8 months) Oakland, CA Created, managed, and executed critical path of new product launches \nDeveloped project scope and production procedures to suppliers and negotiated price, leadtime, and freight method \nEnsure on-time delivery to all 3 distribution centers \nResolved issues by identifying potential problems in sufficient time for corrective action to be taken  \nAttended face-to-face meeting with suppliers in China and developed successful partnership Project Manager Benefit Cosmetics August 2008  –  March 2009  (8 months) Oakland, CA Created, managed, and executed critical path of new product launches \nDeveloped project scope and production procedures to suppliers and negotiated price, leadtime, and freight method \nEnsure on-time delivery to all 3 distribution centers \nResolved issues by identifying potential problems in sufficient time for corrective action to be taken  \nAttended face-to-face meeting with suppliers in China and developed successful partnership Sr. Operations Planning Executive Neo Derm (HK) Ltd. October 2007  –  June 2008  (9 months) Hong Kong Implemented operations process reengineering projects to achieve operational efficiencies and effectiveness \nExecuted regional retail center projects for PRC and South East Asia markets to achieve high service quality, high sales performance, and operational effectiveness in regional markets \nImplemented and controlled the process standardization and improvement initiatives to continuously improve center performance using Six Sigma \nSupervised operation assistants and provided coaching and guidance to achieve smooth and timely execution of their assigned tasks Sr. Operations Planning Executive Neo Derm (HK) Ltd. October 2007  –  June 2008  (9 months) Hong Kong Implemented operations process reengineering projects to achieve operational efficiencies and effectiveness \nExecuted regional retail center projects for PRC and South East Asia markets to achieve high service quality, high sales performance, and operational effectiveness in regional markets \nImplemented and controlled the process standardization and improvement initiatives to continuously improve center performance using Six Sigma \nSupervised operation assistants and provided coaching and guidance to achieve smooth and timely execution of their assigned tasks Sr. Financial Analyst Kaiser Permanente October 2006  –  October 2007  (1 year 1 month) Santa Clara, CA Prepared, coordinated and compilated KPIT's Budget, Forecasts and Long Range Financial Plan \nPerformed variance analysis and created ad-hoc reports and presentations \nRecommended improvement solutions to assist upper Management in key decision-making \nParticipated in the development and maintenance of performance metrics, measurements, methods, and targets \nAutomated and streamlined internal account payable processes \nPartnered with Finance counterparts in clinical departments to improve financial analysis, reporting, budgeting, and forecasting processes. Sr. Financial Analyst Kaiser Permanente October 2006  –  October 2007  (1 year 1 month) Santa Clara, CA Prepared, coordinated and compilated KPIT's Budget, Forecasts and Long Range Financial Plan \nPerformed variance analysis and created ad-hoc reports and presentations \nRecommended improvement solutions to assist upper Management in key decision-making \nParticipated in the development and maintenance of performance metrics, measurements, methods, and targets \nAutomated and streamlined internal account payable processes \nPartnered with Finance counterparts in clinical departments to improve financial analysis, reporting, budgeting, and forecasting processes. Product Supply Planner Intel Corporation June 2005  –  October 2006  (1 year 5 months) Product Supply Planner Intel Corporation June 2005  –  October 2006  (1 year 5 months) Languages English Chinese English Chinese English Chinese Skills Six Sigma Process Improvement Project Management Management Analysis Operations Management Lean Operations Training Data Analysis Management Consulting Supply Chain Management Forecasting Innovation Management Business Process... Leadership Cross-functional Team... Lean Manufacturing Continuous Improvement Quality Management Operational Excellence Program Management Strategic Planning Change Management See 8+     See less Skills  Six Sigma Process Improvement Project Management Management Analysis Operations Management Lean Operations Training Data Analysis Management Consulting Supply Chain Management Forecasting Innovation Management Business Process... Leadership Cross-functional Team... Lean Manufacturing Continuous Improvement Quality Management Operational Excellence Program Management Strategic Planning Change Management See 8+     See less Six Sigma Process Improvement Project Management Management Analysis Operations Management Lean Operations Training Data Analysis Management Consulting Supply Chain Management Forecasting Innovation Management Business Process... Leadership Cross-functional Team... Lean Manufacturing Continuous Improvement Quality Management Operational Excellence Program Management Strategic Planning Change Management See 8+     See less Six Sigma Process Improvement Project Management Management Analysis Operations Management Lean Operations Training Data Analysis Management Consulting Supply Chain Management Forecasting Innovation Management Business Process... Leadership Cross-functional Team... Lean Manufacturing Continuous Improvement Quality Management Operational Excellence Program Management Strategic Planning Change Management See 8+     See less Education Santa Clara University - Leavey School of Business M.B.A.,  Business Administration 2011  – 2013 Activities and Societies:  Beta Gamma Sigma Harvard University Cross-Border Innovation 2009  – 2009 Studied several of the technical tools and behavioral skills required to attain success in managing product/process innovation and learned how these tools can be applied in a global context. San Jose State University M.S.,  Industrial and Systems Engineering 2005  – 2007 University of California, Berkeley B.S.,  Industrial Engineering and Operations Research 2001  – 2005 Santa Clara University - Leavey School of Business M.B.A.,  Business Administration 2011  – 2013 Activities and Societies:  Beta Gamma Sigma Santa Clara University - Leavey School of Business M.B.A.,  Business Administration 2011  – 2013 Activities and Societies:  Beta Gamma Sigma Santa Clara University - Leavey School of Business M.B.A.,  Business Administration 2011  – 2013 Activities and Societies:  Beta Gamma Sigma Harvard University Cross-Border Innovation 2009  – 2009 Studied several of the technical tools and behavioral skills required to attain success in managing product/process innovation and learned how these tools can be applied in a global context. Harvard University Cross-Border Innovation 2009  – 2009 Studied several of the technical tools and behavioral skills required to attain success in managing product/process innovation and learned how these tools can be applied in a global context. Harvard University Cross-Border Innovation 2009  – 2009 Studied several of the technical tools and behavioral skills required to attain success in managing product/process innovation and learned how these tools can be applied in a global context. San Jose State University M.S.,  Industrial and Systems Engineering 2005  – 2007 San Jose State University M.S.,  Industrial and Systems Engineering 2005  – 2007 San Jose State University M.S.,  Industrial and Systems Engineering 2005  – 2007 University of California, Berkeley B.S.,  Industrial Engineering and Operations Research 2001  – 2005 University of California, Berkeley B.S.,  Industrial Engineering and Operations Research 2001  – 2005 University of California, Berkeley B.S.,  Industrial Engineering and Operations Research 2001  – 2005 "]}