{"position": "Systems Management Integrator Professional", "company": "IBM", "profiles": ["Summary Unix/Linux systems administrator and applications support engineer with many years in both government and commercial information systems environments. Specialties:Building, configuring, networking and integrating UNIX systems and applications. Summary Unix/Linux systems administrator and applications support engineer with many years in both government and commercial information systems environments. Specialties:Building, configuring, networking and integrating UNIX systems and applications. Unix/Linux systems administrator and applications support engineer with many years in both government and commercial information systems environments. Specialties:Building, configuring, networking and integrating UNIX systems and applications. Unix/Linux systems administrator and applications support engineer with many years in both government and commercial information systems environments. Specialties:Building, configuring, networking and integrating UNIX systems and applications. Experience Sr Unix Systems Administrator NuAxis Innovations August 2013  – Present (2 years 1 month) Lakewood, Co Technical Support Analyst CyberSource February 2012  –  August 2013  (1 year 7 months) Boulder * Deploy, maintain and troubleshoot customized hosted payment applications \n* Provide timely resolution of customer transaction processing issues \n* Team with application developers to troubleshoot code and database bugs and deploy fixes \n* Build VMWare vSphere virtual machines for development infrastructure and deployments  \n* Maintain Nagios monitoring servers and Splunk log aggregation system \n* Push configurations using Puppet for JBOSS/Tomcat/Apache based applications \n* Service customer work requests and trouble tickets using Jira problem tracking system Technical Implementation Engineer TEK Systems October 2010  –  April 2012  (1 year 7 months) Westminster, Co * Nationwide remote implementation and maintenance of Horizon Clinicals Medical Suite  \n* Build, maintain and network Oracle 10g release 2 RAC clusters \n* Ground up staging of RedHat servers for medical suite installations \n* Headed Tiger Team of Medical SMEs to resolve ARRA Meaningful Use compliance issues UNIX Administrator / Systems Engr Northrop Grumman Information Systems Eng Tech Services January 2008  –  January 2011  (3 years 1 month) * Maintained mission critical real-time analytical applications in a secure environment \n* Provided technical assistance for military operations staff, developers and analysts \n* Configuration management for UNIX/Linux/True64 and Windows servers \n* High level technical support for highly specialized military applications and systems Applications and Operating Systems Support Northrop Grumman Mission Systems October 2006  –  January 2008  (1 year 4 months) * Member of development and implementation team for MUOS Satellite Communications System \n* Designed bare metal backup and system recovery for sites worldwide \n* Performed full range of UNIX Systems Administration, security and performance tasks \n* Systems installation and delivery support at General Dynamics for acceptance testing UNIX Systems Administrator Northrop Grumman Mission Systems November 2004  –  December 2006  (2 years 2 months) Denver Federal Center * Primary Unix Administrator for BLM R&D projects, COTS testing and custom applications \n* Managed test lab network – NIS, DNS, Active Directory \n* Installed and maintained Oracle, MySQL and Sybase Databases for GIS applications \n* Maintained Network Attached Storage (NAS) and EMC SAN for Lab Environment \n* Administered Virtual Environments - AIX LPAR, VMWare and Virtualbox \n* Spearheaded BLM Microsoft AD Authentication for UNIX servers project \n* Security administration and hardening using CISecurity, NMAP, NESSUS and similar tools \n* Maintained a high level of satisfaction with the BLM management and users Aix Systems Administrator Alumni Consulting Group April 2004  –  November 2004  (8 months) Installed and maintained systems and networks for BLM test lab on contract to Northrop Systems Management Integrator Professional IBM Global Services on contract with CENDANT / Galileo International February 2002  –  April 2004  (2 years 3 months) * Maintained AIX RS6000, SP HACMP, Solaris, Red Hat, SGI IRIX enterprise servers \n* Maintained high availability systems for airline ticketing databases \n* Provide customer support for application and database installations, configurations, and upgrades \n* Performed OS/Hardware troubleshooting, problem resolution, customer and vendor interface. Sr Unix Systems Administrator NuAxis Innovations August 2013  – Present (2 years 1 month) Lakewood, Co Sr Unix Systems Administrator NuAxis Innovations August 2013  – Present (2 years 1 month) Lakewood, Co Technical Support Analyst CyberSource February 2012  –  August 2013  (1 year 7 months) Boulder * Deploy, maintain and troubleshoot customized hosted payment applications \n* Provide timely resolution of customer transaction processing issues \n* Team with application developers to troubleshoot code and database bugs and deploy fixes \n* Build VMWare vSphere virtual machines for development infrastructure and deployments  \n* Maintain Nagios monitoring servers and Splunk log aggregation system \n* Push configurations using Puppet for JBOSS/Tomcat/Apache based applications \n* Service customer work requests and trouble tickets using Jira problem tracking system Technical Support Analyst CyberSource February 2012  –  August 2013  (1 year 7 months) Boulder * Deploy, maintain and troubleshoot customized hosted payment applications \n* Provide timely resolution of customer transaction processing issues \n* Team with application developers to troubleshoot code and database bugs and deploy fixes \n* Build VMWare vSphere virtual machines for development infrastructure and deployments  \n* Maintain Nagios monitoring servers and Splunk log aggregation system \n* Push configurations using Puppet for JBOSS/Tomcat/Apache based applications \n* Service customer work requests and trouble tickets using Jira problem tracking system Technical Implementation Engineer TEK Systems October 2010  –  April 2012  (1 year 7 months) Westminster, Co * Nationwide remote implementation and maintenance of Horizon Clinicals Medical Suite  \n* Build, maintain and network Oracle 10g release 2 RAC clusters \n* Ground up staging of RedHat servers for medical suite installations \n* Headed Tiger Team of Medical SMEs to resolve ARRA Meaningful Use compliance issues Technical Implementation Engineer TEK Systems October 2010  –  April 2012  (1 year 7 months) Westminster, Co * Nationwide remote implementation and maintenance of Horizon Clinicals Medical Suite  \n* Build, maintain and network Oracle 10g release 2 RAC clusters \n* Ground up staging of RedHat servers for medical suite installations \n* Headed Tiger Team of Medical SMEs to resolve ARRA Meaningful Use compliance issues UNIX Administrator / Systems Engr Northrop Grumman Information Systems Eng Tech Services January 2008  –  January 2011  (3 years 1 month) * Maintained mission critical real-time analytical applications in a secure environment \n* Provided technical assistance for military operations staff, developers and analysts \n* Configuration management for UNIX/Linux/True64 and Windows servers \n* High level technical support for highly specialized military applications and systems UNIX Administrator / Systems Engr Northrop Grumman Information Systems Eng Tech Services January 2008  –  January 2011  (3 years 1 month) * Maintained mission critical real-time analytical applications in a secure environment \n* Provided technical assistance for military operations staff, developers and analysts \n* Configuration management for UNIX/Linux/True64 and Windows servers \n* High level technical support for highly specialized military applications and systems Applications and Operating Systems Support Northrop Grumman Mission Systems October 2006  –  January 2008  (1 year 4 months) * Member of development and implementation team for MUOS Satellite Communications System \n* Designed bare metal backup and system recovery for sites worldwide \n* Performed full range of UNIX Systems Administration, security and performance tasks \n* Systems installation and delivery support at General Dynamics for acceptance testing Applications and Operating Systems Support Northrop Grumman Mission Systems October 2006  –  January 2008  (1 year 4 months) * Member of development and implementation team for MUOS Satellite Communications System \n* Designed bare metal backup and system recovery for sites worldwide \n* Performed full range of UNIX Systems Administration, security and performance tasks \n* Systems installation and delivery support at General Dynamics for acceptance testing UNIX Systems Administrator Northrop Grumman Mission Systems November 2004  –  December 2006  (2 years 2 months) Denver Federal Center * Primary Unix Administrator for BLM R&D projects, COTS testing and custom applications \n* Managed test lab network – NIS, DNS, Active Directory \n* Installed and maintained Oracle, MySQL and Sybase Databases for GIS applications \n* Maintained Network Attached Storage (NAS) and EMC SAN for Lab Environment \n* Administered Virtual Environments - AIX LPAR, VMWare and Virtualbox \n* Spearheaded BLM Microsoft AD Authentication for UNIX servers project \n* Security administration and hardening using CISecurity, NMAP, NESSUS and similar tools \n* Maintained a high level of satisfaction with the BLM management and users UNIX Systems Administrator Northrop Grumman Mission Systems November 2004  –  December 2006  (2 years 2 months) Denver Federal Center * Primary Unix Administrator for BLM R&D projects, COTS testing and custom applications \n* Managed test lab network – NIS, DNS, Active Directory \n* Installed and maintained Oracle, MySQL and Sybase Databases for GIS applications \n* Maintained Network Attached Storage (NAS) and EMC SAN for Lab Environment \n* Administered Virtual Environments - AIX LPAR, VMWare and Virtualbox \n* Spearheaded BLM Microsoft AD Authentication for UNIX servers project \n* Security administration and hardening using CISecurity, NMAP, NESSUS and similar tools \n* Maintained a high level of satisfaction with the BLM management and users Aix Systems Administrator Alumni Consulting Group April 2004  –  November 2004  (8 months) Installed and maintained systems and networks for BLM test lab on contract to Northrop Aix Systems Administrator Alumni Consulting Group April 2004  –  November 2004  (8 months) Installed and maintained systems and networks for BLM test lab on contract to Northrop Systems Management Integrator Professional IBM Global Services on contract with CENDANT / Galileo International February 2002  –  April 2004  (2 years 3 months) * Maintained AIX RS6000, SP HACMP, Solaris, Red Hat, SGI IRIX enterprise servers \n* Maintained high availability systems for airline ticketing databases \n* Provide customer support for application and database installations, configurations, and upgrades \n* Performed OS/Hardware troubleshooting, problem resolution, customer and vendor interface. Systems Management Integrator Professional IBM Global Services on contract with CENDANT / Galileo International February 2002  –  April 2004  (2 years 3 months) * Maintained AIX RS6000, SP HACMP, Solaris, Red Hat, SGI IRIX enterprise servers \n* Maintained high availability systems for airline ticketing databases \n* Provide customer support for application and database installations, configurations, and upgrades \n* Performed OS/Hardware troubleshooting, problem resolution, customer and vendor interface. Skills AIX Unix System Administration Security Linux Integration Servers Solaris Perl Skills  AIX Unix System Administration Security Linux Integration Servers Solaris Perl AIX Unix System Administration Security Linux Integration Servers Solaris Perl AIX Unix System Administration Security Linux Integration Servers Solaris Perl Education Wichita State University 1968  – 1969 Wichita State University 1968  – 1969 Wichita State University 1968  – 1969 Wichita State University 1968  – 1969 ", "Experience Unix System Administrator Insight Global June 2015  – Present (3 months) Hebron, KY Linux Administrator Hospitality Technical Services February 2015  – Present (7 months) Crestview Hills, KY Unix administrator Contracting at IBM Artech Information Systems November 2013  –  February 2015  (1 year 4 months) Unix Administration managing AIX and Oracle Linux servers. Unix Administrator Contracting at Toyota TEAM Recruiting Services, Inc. April 2012  –  November 2013  (1 year 8 months) Georgetown, KY Manage virtual and physical Unix servers supporting over 200 servers. Manage HACMP clusters. Build new servers, patch and upgrade existing servers. Work is don on AIX, VIO, HMC, RedHat Linux, Solaris and HP-UX. Senior Systems Management Integrator Professional IBM December 2000  –  April 2012  (11 years 5 months) Hebron, KY Manage virtual and physical Unix servers for multiple IBM accounts. Mange Steeleye LifeKeeper clusters. Solution new business opportunities in the Unix environment bringing in millions of dollars in new work for IBM Global Services. Team Leader and Project Manager for a team of AIX, Linux and VMware Administrators supporting over 300 servers. Manage transition work for new account contracts. Perform DR tests for customers. Work is done on AIX, VIO, HMC, RedHat Linux, VMware, VSphere and Solaris servers. Business Systems Manager Square D April 1998  –  December 2000  (2 years 9 months) Crestview Hills, KY Manage Unix and NT System Administrators. Manage HACMP clusters. Configure, budget and implement systems for million-dollar projects with over 130 Unix boxes and over 50 NT boxes. Cut costs by $500,000 through server consolidations. Work was done on AIX and NT servers. Manager Unix Systems Arch Communications January 1996  –  April 1998  (2 years 4 months) Cincinnati, OH Manage Unix Administrators. Configure and implement systems for enterprise management applications. Write shell scripts to support Help Desk and Operation Departments. Support of developers and end users. Work was done on AIX, Solaris, Linux and HP-UX servers. Senior Network Analyst Syncor International October 1992  –  January 1996  (3 years 4 months) Cincinnati, OH Install and Implement Unix systems around the world. Administration duties including performance tuning and system configurations. Application programming for Pharmaceutical applications. Shell scripting. Support of developers and end users. Review new hardware and software and make recommendations on its purchase. Programming was done in Cobol and C on SCO Unix and DNOS environments. Systems Analysts Saturday Knight Ltd. July 1989  –  October 1992  (3 years 4 months) Cincinnati, OH Application programming for accounting and manufacturing programs. Implement new hardware and operating systems. Design and write EDI software. Write bar coding programs and set up of the bar coding equipment. System administration and performance tuning. Supervise programming staff. Support and train users. Programming done in Cobol, System Z and Basic on SCO Xenix, TI-Unix and DNOS environments. Programmer Small Business Data Processing June 1986  –  July 1989  (3 years 2 months) Cincinnati, OH Application programming for accounting, medical and manufacturing programs for our customers. Install and implement Unix systems for customers. Support and train users. Programming was done in Basic, Cobol, RPG II and Data Base-Plus on SCO Xenix, VAX/VMS, RSTS/E and EDX environments. Unix System Administrator Insight Global June 2015  – Present (3 months) Hebron, KY Unix System Administrator Insight Global June 2015  – Present (3 months) Hebron, KY Linux Administrator Hospitality Technical Services February 2015  – Present (7 months) Crestview Hills, KY Linux Administrator Hospitality Technical Services February 2015  – Present (7 months) Crestview Hills, KY Unix administrator Contracting at IBM Artech Information Systems November 2013  –  February 2015  (1 year 4 months) Unix Administration managing AIX and Oracle Linux servers. Unix administrator Contracting at IBM Artech Information Systems November 2013  –  February 2015  (1 year 4 months) Unix Administration managing AIX and Oracle Linux servers. Unix Administrator Contracting at Toyota TEAM Recruiting Services, Inc. April 2012  –  November 2013  (1 year 8 months) Georgetown, KY Manage virtual and physical Unix servers supporting over 200 servers. Manage HACMP clusters. Build new servers, patch and upgrade existing servers. Work is don on AIX, VIO, HMC, RedHat Linux, Solaris and HP-UX. Unix Administrator Contracting at Toyota TEAM Recruiting Services, Inc. April 2012  –  November 2013  (1 year 8 months) Georgetown, KY Manage virtual and physical Unix servers supporting over 200 servers. Manage HACMP clusters. Build new servers, patch and upgrade existing servers. Work is don on AIX, VIO, HMC, RedHat Linux, Solaris and HP-UX. Senior Systems Management Integrator Professional IBM December 2000  –  April 2012  (11 years 5 months) Hebron, KY Manage virtual and physical Unix servers for multiple IBM accounts. Mange Steeleye LifeKeeper clusters. Solution new business opportunities in the Unix environment bringing in millions of dollars in new work for IBM Global Services. Team Leader and Project Manager for a team of AIX, Linux and VMware Administrators supporting over 300 servers. Manage transition work for new account contracts. Perform DR tests for customers. Work is done on AIX, VIO, HMC, RedHat Linux, VMware, VSphere and Solaris servers. Senior Systems Management Integrator Professional IBM December 2000  –  April 2012  (11 years 5 months) Hebron, KY Manage virtual and physical Unix servers for multiple IBM accounts. Mange Steeleye LifeKeeper clusters. Solution new business opportunities in the Unix environment bringing in millions of dollars in new work for IBM Global Services. Team Leader and Project Manager for a team of AIX, Linux and VMware Administrators supporting over 300 servers. Manage transition work for new account contracts. Perform DR tests for customers. Work is done on AIX, VIO, HMC, RedHat Linux, VMware, VSphere and Solaris servers. Business Systems Manager Square D April 1998  –  December 2000  (2 years 9 months) Crestview Hills, KY Manage Unix and NT System Administrators. Manage HACMP clusters. Configure, budget and implement systems for million-dollar projects with over 130 Unix boxes and over 50 NT boxes. Cut costs by $500,000 through server consolidations. Work was done on AIX and NT servers. Business Systems Manager Square D April 1998  –  December 2000  (2 years 9 months) Crestview Hills, KY Manage Unix and NT System Administrators. Manage HACMP clusters. Configure, budget and implement systems for million-dollar projects with over 130 Unix boxes and over 50 NT boxes. Cut costs by $500,000 through server consolidations. Work was done on AIX and NT servers. Manager Unix Systems Arch Communications January 1996  –  April 1998  (2 years 4 months) Cincinnati, OH Manage Unix Administrators. Configure and implement systems for enterprise management applications. Write shell scripts to support Help Desk and Operation Departments. Support of developers and end users. Work was done on AIX, Solaris, Linux and HP-UX servers. Manager Unix Systems Arch Communications January 1996  –  April 1998  (2 years 4 months) Cincinnati, OH Manage Unix Administrators. Configure and implement systems for enterprise management applications. Write shell scripts to support Help Desk and Operation Departments. Support of developers and end users. Work was done on AIX, Solaris, Linux and HP-UX servers. Senior Network Analyst Syncor International October 1992  –  January 1996  (3 years 4 months) Cincinnati, OH Install and Implement Unix systems around the world. Administration duties including performance tuning and system configurations. Application programming for Pharmaceutical applications. Shell scripting. Support of developers and end users. Review new hardware and software and make recommendations on its purchase. Programming was done in Cobol and C on SCO Unix and DNOS environments. Senior Network Analyst Syncor International October 1992  –  January 1996  (3 years 4 months) Cincinnati, OH Install and Implement Unix systems around the world. Administration duties including performance tuning and system configurations. Application programming for Pharmaceutical applications. Shell scripting. Support of developers and end users. Review new hardware and software and make recommendations on its purchase. Programming was done in Cobol and C on SCO Unix and DNOS environments. Systems Analysts Saturday Knight Ltd. July 1989  –  October 1992  (3 years 4 months) Cincinnati, OH Application programming for accounting and manufacturing programs. Implement new hardware and operating systems. Design and write EDI software. Write bar coding programs and set up of the bar coding equipment. System administration and performance tuning. Supervise programming staff. Support and train users. Programming done in Cobol, System Z and Basic on SCO Xenix, TI-Unix and DNOS environments. Systems Analysts Saturday Knight Ltd. July 1989  –  October 1992  (3 years 4 months) Cincinnati, OH Application programming for accounting and manufacturing programs. Implement new hardware and operating systems. Design and write EDI software. Write bar coding programs and set up of the bar coding equipment. System administration and performance tuning. Supervise programming staff. Support and train users. Programming done in Cobol, System Z and Basic on SCO Xenix, TI-Unix and DNOS environments. Programmer Small Business Data Processing June 1986  –  July 1989  (3 years 2 months) Cincinnati, OH Application programming for accounting, medical and manufacturing programs for our customers. Install and implement Unix systems for customers. Support and train users. Programming was done in Basic, Cobol, RPG II and Data Base-Plus on SCO Xenix, VAX/VMS, RSTS/E and EDX environments. Programmer Small Business Data Processing June 1986  –  July 1989  (3 years 2 months) Cincinnati, OH Application programming for accounting, medical and manufacturing programs for our customers. Install and implement Unix systems for customers. Support and train users. Programming was done in Basic, Cobol, RPG II and Data Base-Plus on SCO Xenix, VAX/VMS, RSTS/E and EDX environments. Skills HACMP AIX SAN High Availability Red Hat Linux VMware HMC LPAR vSphere Solaris NIM LDAP Unix Shell Scripting Disaster Recovery HP-UX Enterprise Architecture Unix System Administration Virtualization IT Service Management Security Storage Servers ITIL VMware ESX Shell Scripting IBM AIX See 12+     See less Skills  HACMP AIX SAN High Availability Red Hat Linux VMware HMC LPAR vSphere Solaris NIM LDAP Unix Shell Scripting Disaster Recovery HP-UX Enterprise Architecture Unix System Administration Virtualization IT Service Management Security Storage Servers ITIL VMware ESX Shell Scripting IBM AIX See 12+     See less HACMP AIX SAN High Availability Red Hat Linux VMware HMC LPAR vSphere Solaris NIM LDAP Unix Shell Scripting Disaster Recovery HP-UX Enterprise Architecture Unix System Administration Virtualization IT Service Management Security Storage Servers ITIL VMware ESX Shell Scripting IBM AIX See 12+     See less HACMP AIX SAN High Availability Red Hat Linux VMware HMC LPAR vSphere Solaris NIM LDAP Unix Shell Scripting Disaster Recovery HP-UX Enterprise Architecture Unix System Administration Virtualization IT Service Management Security Storage Servers ITIL VMware ESX Shell Scripting IBM AIX See 12+     See less Education Northern Kentucky University Bachelor of Science (B.S.),  Computer Science 1981  – 1986 Northern Kentucky University Bachelor of Science (B.S.),  Mathematics 1981  – 1986 Northern Kentucky University Bachelor of Science (B.S.),  Computer Science 1981  – 1986 Northern Kentucky University Bachelor of Science (B.S.),  Computer Science 1981  – 1986 Northern Kentucky University Bachelor of Science (B.S.),  Computer Science 1981  – 1986 Northern Kentucky University Bachelor of Science (B.S.),  Mathematics 1981  – 1986 Northern Kentucky University Bachelor of Science (B.S.),  Mathematics 1981  – 1986 Northern Kentucky University Bachelor of Science (B.S.),  Mathematics 1981  – 1986 ", "Languages Chinese  Chinese  Chinese  Skills Software Development Troubleshooting TCP/IP Databases Servers Program Management Operating Systems Unix Security XML SQL Technical Support Hardware Project Management DNS Computer Hardware Active Directory IT Service Management Integration Programming Networking Disaster Recovery Windows Server Enterprise Architecture Microsoft SQL Server System Administration SDLC Java Windows Vendor Management Software Project... Agile Methodologies Visio IT Strategy Linux Software Installation Requirements Analysis Business Analysis ITIL TPF Dell Workstations IT Management SharePoint Information Technology Data Center XP Software Documentation IT Operations Systems Analysis Testing See 35+     See less Skills  Software Development Troubleshooting TCP/IP Databases Servers Program Management Operating Systems Unix Security XML SQL Technical Support Hardware Project Management DNS Computer Hardware Active Directory IT Service Management Integration Programming Networking Disaster Recovery Windows Server Enterprise Architecture Microsoft SQL Server System Administration SDLC Java Windows Vendor Management Software Project... Agile Methodologies Visio IT Strategy Linux Software Installation Requirements Analysis Business Analysis ITIL TPF Dell Workstations IT Management SharePoint Information Technology Data Center XP Software Documentation IT Operations Systems Analysis Testing See 35+     See less Software Development Troubleshooting TCP/IP Databases Servers Program Management Operating Systems Unix Security XML SQL Technical Support Hardware Project Management DNS Computer Hardware Active Directory IT Service Management Integration Programming Networking Disaster Recovery Windows Server Enterprise Architecture Microsoft SQL Server System Administration SDLC Java Windows Vendor Management Software Project... Agile Methodologies Visio IT Strategy Linux Software Installation Requirements Analysis Business Analysis ITIL TPF Dell Workstations IT Management SharePoint Information Technology Data Center XP Software Documentation IT Operations Systems Analysis Testing See 35+     See less Software Development Troubleshooting TCP/IP Databases Servers Program Management Operating Systems Unix Security XML SQL Technical Support Hardware Project Management DNS Computer Hardware Active Directory IT Service Management Integration Programming Networking Disaster Recovery Windows Server Enterprise Architecture Microsoft SQL Server System Administration SDLC Java Windows Vendor Management Software Project... Agile Methodologies Visio IT Strategy Linux Software Installation Requirements Analysis Business Analysis ITIL TPF Dell Workstations IT Management SharePoint Information Technology Data Center XP Software Documentation IT Operations Systems Analysis Testing See 35+     See less ", "Experience Systems Support Analyst 5 - Infrastructure Engineering Support Wells Fargo February 2015  – Present (7 months) Systems Engineer II Time Warner Cable July 2014  –  December 2014  (6 months) Charlotte, NC Systems Intelligence Engineer Time Warner Cable October 2009  –  July 2014  (4 years 10 months) Charlotte, NC Infrastructure Support Merck Pharmaceuticals June 2009  –  October 2009  (5 months) Charlotte, North Carolina Area Systems Administrator\\IT Specialist Universal Meeting Management May 2008  –  December 2008  (8 months) Raleigh, NC Systems Management Integrator Professional IBM Corporation January 2000  –  May 2008  (8 years 5 months) Research Triangle Park, NC Systems Support Analyst 5 - Infrastructure Engineering Support Wells Fargo February 2015  – Present (7 months) Systems Support Analyst 5 - Infrastructure Engineering Support Wells Fargo February 2015  – Present (7 months) Systems Engineer II Time Warner Cable July 2014  –  December 2014  (6 months) Charlotte, NC Systems Engineer II Time Warner Cable July 2014  –  December 2014  (6 months) Charlotte, NC Systems Intelligence Engineer Time Warner Cable October 2009  –  July 2014  (4 years 10 months) Charlotte, NC Systems Intelligence Engineer Time Warner Cable October 2009  –  July 2014  (4 years 10 months) Charlotte, NC Infrastructure Support Merck Pharmaceuticals June 2009  –  October 2009  (5 months) Charlotte, North Carolina Area Infrastructure Support Merck Pharmaceuticals June 2009  –  October 2009  (5 months) Charlotte, North Carolina Area Systems Administrator\\IT Specialist Universal Meeting Management May 2008  –  December 2008  (8 months) Raleigh, NC Systems Administrator\\IT Specialist Universal Meeting Management May 2008  –  December 2008  (8 months) Raleigh, NC Systems Management Integrator Professional IBM Corporation January 2000  –  May 2008  (8 years 5 months) Research Triangle Park, NC Systems Management Integrator Professional IBM Corporation January 2000  –  May 2008  (8 years 5 months) Research Triangle Park, NC Skills Microsoft Office Telecommunications Troubleshooting Project Management Windows SQL Microsoft Excel Customer Service Linux Team Leadership HTML Java Process Improvement Management Microsoft Word Microsoft SQL Server C++ Program Management Active Directory Windows Server Project Planning See 6+     See less Skills  Microsoft Office Telecommunications Troubleshooting Project Management Windows SQL Microsoft Excel Customer Service Linux Team Leadership HTML Java Process Improvement Management Microsoft Word Microsoft SQL Server C++ Program Management Active Directory Windows Server Project Planning See 6+     See less Microsoft Office Telecommunications Troubleshooting Project Management Windows SQL Microsoft Excel Customer Service Linux Team Leadership HTML Java Process Improvement Management Microsoft Word Microsoft SQL Server C++ Program Management Active Directory Windows Server Project Planning See 6+     See less Microsoft Office Telecommunications Troubleshooting Project Management Windows SQL Microsoft Excel Customer Service Linux Team Leadership HTML Java Process Improvement Management Microsoft Word Microsoft SQL Server C++ Program Management Active Directory Windows Server Project Planning See 6+     See less Education Johnson C. Smith University - JCSU Bachelor of Science (BS),  Information Technology 1995  – 1999 Johnson C. Smith University - JCSU Bachelor of Science (BS),  Information Technology 1995  – 1999 Johnson C. Smith University - JCSU Bachelor of Science (BS),  Information Technology 1995  – 1999 Johnson C. Smith University - JCSU Bachelor of Science (BS),  Information Technology 1995  – 1999 ", "Summary As an IT Service Delivery Professional, I excel at managing resources effectively, and in achieving high levels of customer satisfaction in service delivery.  \n \nThroughout my career, I have been known as a dedicated team lead with excellent technical, organizational, and interpersonal communication skills. I am skilled at managing multiple, large scale global projects, meeting contract requirements, budgets and schedules.  \n \nI am known for identifying and implementing new processes and best practices that drive positive results. I review, analyze, and improve or leverage existing processes and best practices. I have significant expertise in managing IT projects and resources and acting as a liaison between IT Delivery and clients. \n \n \nSome of my core competencies include: \n \n· Team Leadership \n· Project Management \n· Data Security \n· Regulatory & Internal Policy Compliance \n· Issue Resolution \n· Change Management \n· Data Availability  \n \nI can be reached through LinkedIn or at sedelmev@gmail.com. \n \nMy technical skills include:  \n \n· Unix OS (Solaris, AIX, Linux / Red Hat) \n· Virtualization \n· HACMP  \n· Windows OS \n· Tivoli Products \n· Distributed File Systems (AFS DFS, GSA) Summary As an IT Service Delivery Professional, I excel at managing resources effectively, and in achieving high levels of customer satisfaction in service delivery.  \n \nThroughout my career, I have been known as a dedicated team lead with excellent technical, organizational, and interpersonal communication skills. I am skilled at managing multiple, large scale global projects, meeting contract requirements, budgets and schedules.  \n \nI am known for identifying and implementing new processes and best practices that drive positive results. I review, analyze, and improve or leverage existing processes and best practices. I have significant expertise in managing IT projects and resources and acting as a liaison between IT Delivery and clients. \n \n \nSome of my core competencies include: \n \n· Team Leadership \n· Project Management \n· Data Security \n· Regulatory & Internal Policy Compliance \n· Issue Resolution \n· Change Management \n· Data Availability  \n \nI can be reached through LinkedIn or at sedelmev@gmail.com. \n \nMy technical skills include:  \n \n· Unix OS (Solaris, AIX, Linux / Red Hat) \n· Virtualization \n· HACMP  \n· Windows OS \n· Tivoli Products \n· Distributed File Systems (AFS DFS, GSA) As an IT Service Delivery Professional, I excel at managing resources effectively, and in achieving high levels of customer satisfaction in service delivery.  \n \nThroughout my career, I have been known as a dedicated team lead with excellent technical, organizational, and interpersonal communication skills. I am skilled at managing multiple, large scale global projects, meeting contract requirements, budgets and schedules.  \n \nI am known for identifying and implementing new processes and best practices that drive positive results. I review, analyze, and improve or leverage existing processes and best practices. I have significant expertise in managing IT projects and resources and acting as a liaison between IT Delivery and clients. \n \n \nSome of my core competencies include: \n \n· Team Leadership \n· Project Management \n· Data Security \n· Regulatory & Internal Policy Compliance \n· Issue Resolution \n· Change Management \n· Data Availability  \n \nI can be reached through LinkedIn or at sedelmev@gmail.com. \n \nMy technical skills include:  \n \n· Unix OS (Solaris, AIX, Linux / Red Hat) \n· Virtualization \n· HACMP  \n· Windows OS \n· Tivoli Products \n· Distributed File Systems (AFS DFS, GSA) As an IT Service Delivery Professional, I excel at managing resources effectively, and in achieving high levels of customer satisfaction in service delivery.  \n \nThroughout my career, I have been known as a dedicated team lead with excellent technical, organizational, and interpersonal communication skills. I am skilled at managing multiple, large scale global projects, meeting contract requirements, budgets and schedules.  \n \nI am known for identifying and implementing new processes and best practices that drive positive results. I review, analyze, and improve or leverage existing processes and best practices. I have significant expertise in managing IT projects and resources and acting as a liaison between IT Delivery and clients. \n \n \nSome of my core competencies include: \n \n· Team Leadership \n· Project Management \n· Data Security \n· Regulatory & Internal Policy Compliance \n· Issue Resolution \n· Change Management \n· Data Availability  \n \nI can be reached through LinkedIn or at sedelmev@gmail.com. \n \nMy technical skills include:  \n \n· Unix OS (Solaris, AIX, Linux / Red Hat) \n· Virtualization \n· HACMP  \n· Windows OS \n· Tivoli Products \n· Distributed File Systems (AFS DFS, GSA) Experience Advisory Project Manager / Service Delivery Manager IBM July 2010  – Present (5 years 2 months) In my role as Advisory Project Manager / Service Delivery Manager of a distributed environment for a leading commercial institution (Avis), I managed an account consisting of 600+ Unix / Windows servers in multiple global delivery centers supporting OS, Database, Middleware, Storage, Messaging, Tools, and other applications.  \n \nI also managed all delivery work associated with the Avis account (including projects, security compliance, change/problem management and new/RFS work), completing projects and implementing efficiencies in delivery, inventory, monitoring, currency, security, problem resolution, and change management. \n \nA few accomplishments I am proud of are: \n \n· Managed over 40 new customer RFS(Request For Services) including 80 new servers representing 8% growth from previous year supporting customers’ strategic initiatives. \n \n· Managed process improvement project implementing efficiencies in monitoring and automation, delivering significantly improved quality and average cost reductions in labor of about 25%. Team Lead / Technical Team Lead IBM June 2008  –  July 2010  (2 years 2 months) As the Team Lead, I provided technical guidance, account leadership and direction to support teams on projects and delivery issues. I managed 200+ servers across 20 different IBM Internal accounts and all account work including the planning and staffing of new projects, problems related to delivery, coordinating coverage and skills required for projects. \n \nSomething I am proud of: \n \n· Coordinated directly with account executives, delivery managers, and program managers, addressing new business requests, projects, financial interlock and regarding problem / change control.  Technical Services Professional / Technical Project Manager IBM January 2007  –  June 2008  (1 year 6 months) As the Technical Project Manager, I managed projects and provided technical and strategic guidance to delivery teams.  \n \nHere, I am proud of: \n \n· Managed Software group server consolidation project including complete hardware / software upgrade from SP frame architecture to P-series, successfully setting-up and migrating servers, applications, thousands of users, and terabytes of data 2 months ahead of schedule.  Technical Services Professional IBM 2005  –  2007  (2 years) In my role as the Technical Services Professional, I was the department and technical team lead.  \n \nSome accomplishments from this job are: \n \n· Coordinated transition of 3 different India teams into department support structure, managing global resource project, training and transitioning work to 3 different teams (Unix, intel and storage) supporting accounts in Fishkill / Burlington / Endicott / Rochester \n \n· Provided technical and project leadership to 25+ people (10 teams) as Department Team Lead, providing multi-platform support to over 50 accounts all across US. Senior Systems Management Integrator Professional IBM 2001  –  2004  (3 years) As the Senior Systems Management Integrator Professional, I was the Account Lead that provided support for 150+ AIX / Linux / Windows infrastructure servers. \n \nHere I am proud of: \n \n· Created technical solution divesting EIT customer, providing support for account until contract expired in 2004. Advisory Project Manager / Service Delivery Manager IBM July 2010  – Present (5 years 2 months) In my role as Advisory Project Manager / Service Delivery Manager of a distributed environment for a leading commercial institution (Avis), I managed an account consisting of 600+ Unix / Windows servers in multiple global delivery centers supporting OS, Database, Middleware, Storage, Messaging, Tools, and other applications.  \n \nI also managed all delivery work associated with the Avis account (including projects, security compliance, change/problem management and new/RFS work), completing projects and implementing efficiencies in delivery, inventory, monitoring, currency, security, problem resolution, and change management. \n \nA few accomplishments I am proud of are: \n \n· Managed over 40 new customer RFS(Request For Services) including 80 new servers representing 8% growth from previous year supporting customers’ strategic initiatives. \n \n· Managed process improvement project implementing efficiencies in monitoring and automation, delivering significantly improved quality and average cost reductions in labor of about 25%. Advisory Project Manager / Service Delivery Manager IBM July 2010  – Present (5 years 2 months) In my role as Advisory Project Manager / Service Delivery Manager of a distributed environment for a leading commercial institution (Avis), I managed an account consisting of 600+ Unix / Windows servers in multiple global delivery centers supporting OS, Database, Middleware, Storage, Messaging, Tools, and other applications.  \n \nI also managed all delivery work associated with the Avis account (including projects, security compliance, change/problem management and new/RFS work), completing projects and implementing efficiencies in delivery, inventory, monitoring, currency, security, problem resolution, and change management. \n \nA few accomplishments I am proud of are: \n \n· Managed over 40 new customer RFS(Request For Services) including 80 new servers representing 8% growth from previous year supporting customers’ strategic initiatives. \n \n· Managed process improvement project implementing efficiencies in monitoring and automation, delivering significantly improved quality and average cost reductions in labor of about 25%. Team Lead / Technical Team Lead IBM June 2008  –  July 2010  (2 years 2 months) As the Team Lead, I provided technical guidance, account leadership and direction to support teams on projects and delivery issues. I managed 200+ servers across 20 different IBM Internal accounts and all account work including the planning and staffing of new projects, problems related to delivery, coordinating coverage and skills required for projects. \n \nSomething I am proud of: \n \n· Coordinated directly with account executives, delivery managers, and program managers, addressing new business requests, projects, financial interlock and regarding problem / change control.  Team Lead / Technical Team Lead IBM June 2008  –  July 2010  (2 years 2 months) As the Team Lead, I provided technical guidance, account leadership and direction to support teams on projects and delivery issues. I managed 200+ servers across 20 different IBM Internal accounts and all account work including the planning and staffing of new projects, problems related to delivery, coordinating coverage and skills required for projects. \n \nSomething I am proud of: \n \n· Coordinated directly with account executives, delivery managers, and program managers, addressing new business requests, projects, financial interlock and regarding problem / change control.  Technical Services Professional / Technical Project Manager IBM January 2007  –  June 2008  (1 year 6 months) As the Technical Project Manager, I managed projects and provided technical and strategic guidance to delivery teams.  \n \nHere, I am proud of: \n \n· Managed Software group server consolidation project including complete hardware / software upgrade from SP frame architecture to P-series, successfully setting-up and migrating servers, applications, thousands of users, and terabytes of data 2 months ahead of schedule.  Technical Services Professional / Technical Project Manager IBM January 2007  –  June 2008  (1 year 6 months) As the Technical Project Manager, I managed projects and provided technical and strategic guidance to delivery teams.  \n \nHere, I am proud of: \n \n· Managed Software group server consolidation project including complete hardware / software upgrade from SP frame architecture to P-series, successfully setting-up and migrating servers, applications, thousands of users, and terabytes of data 2 months ahead of schedule.  Technical Services Professional IBM 2005  –  2007  (2 years) In my role as the Technical Services Professional, I was the department and technical team lead.  \n \nSome accomplishments from this job are: \n \n· Coordinated transition of 3 different India teams into department support structure, managing global resource project, training and transitioning work to 3 different teams (Unix, intel and storage) supporting accounts in Fishkill / Burlington / Endicott / Rochester \n \n· Provided technical and project leadership to 25+ people (10 teams) as Department Team Lead, providing multi-platform support to over 50 accounts all across US. Technical Services Professional IBM 2005  –  2007  (2 years) In my role as the Technical Services Professional, I was the department and technical team lead.  \n \nSome accomplishments from this job are: \n \n· Coordinated transition of 3 different India teams into department support structure, managing global resource project, training and transitioning work to 3 different teams (Unix, intel and storage) supporting accounts in Fishkill / Burlington / Endicott / Rochester \n \n· Provided technical and project leadership to 25+ people (10 teams) as Department Team Lead, providing multi-platform support to over 50 accounts all across US. Senior Systems Management Integrator Professional IBM 2001  –  2004  (3 years) As the Senior Systems Management Integrator Professional, I was the Account Lead that provided support for 150+ AIX / Linux / Windows infrastructure servers. \n \nHere I am proud of: \n \n· Created technical solution divesting EIT customer, providing support for account until contract expired in 2004. Senior Systems Management Integrator Professional IBM 2001  –  2004  (3 years) As the Senior Systems Management Integrator Professional, I was the Account Lead that provided support for 150+ AIX / Linux / Windows infrastructure servers. \n \nHere I am proud of: \n \n· Created technical solution divesting EIT customer, providing support for account until contract expired in 2004. Languages English Spanish English Spanish English Spanish Skills Project Management IT Service Management Service Delivery Management Business Analysis Incident Management Integration Service Management ITIL IT Strategy Requirements Analysis Skills  Project Management IT Service Management Service Delivery Management Business Analysis Incident Management Integration Service Management ITIL IT Strategy Requirements Analysis Project Management IT Service Management Service Delivery Management Business Analysis Incident Management Integration Service Management ITIL IT Strategy Requirements Analysis Project Management IT Service Management Service Delivery Management Business Analysis Incident Management Integration Service Management ITIL IT Strategy Requirements Analysis Education Anderson University Bachelor's Degree,  Computer Science and Math Anderson University Bachelor's Degree,  Computer Science and Math Anderson University Bachelor's Degree,  Computer Science and Math Anderson University Bachelor's Degree,  Computer Science and Math ", "Experience IT Security Administrator SR Xerox April 2012  – Present (3 years 5 months) Administers/develops IBM mainframe RACF security and in house mainframe Goodyear security system. IT Security Administrator SR./Business Development Supervisor Affiliated Computer Services November 2003  –  April 2012  (8 years 6 months) DATA SECURITY ADMINISTRATOR Lockheed Martin Information Technology May 2002  –  November 2003  (1 year 7 months) Developed, coded and maintained in-house security system which maintained individual applications and audited user activity within all applications. Tools used include COBOL, SAS, Telon, JCL and DB2 on a Windows 2000 client. \nProvided security administration and training for the Lockheed Martin Security team. \nProvided administration of SecurID cards and related files on the Sun Solaris using RSA ACE/Server software. SYSTEMS MANAGEMENT INTEGRATOR PROFESSIONAL IBM Global Services June 1994  –  April 2002  (7 years 11 months) Responsible for the testing, integration and maintenance of security software and procedures for the MVS/OS/390 and UNIX environments. Tools utilized include RACF, Vanguard, NC Syncom, Cobol, SAS, JCL, Telon, and DB2.  \n \n• Configured security for OS/390 accessing UNIX services. \n• Administered user IDs/Permits for UNIX utilizing VI Editor. \n• Set HFS (Hierarchical Files System) Permissions. \n• Developed, coded and maintained in-house security system which maintained individual applications and audited user activity within all applications. Tools used include COBOL, SAS, Telon, JCL and DB2 on a Windows NT client.  \n• Provided RACF security administration and implemented UNIX/Web Server security on OS/390 Security Server.  \n• Converted SDSF to RACF. \n• Implemented and tested MQ Series security. \n• Installed and configured Vanguard Version 3.3 \n• Modified RACF Templates with new version upgrades. \n• Tested RACF functionality after new upgrades. \n• Data Security team leader for Y2K (1998-2000) and disaster recovery (1998 - present).  \n• Documented procedures and standards for Goodyear Data Security including security administration, software maintenance, Y2K and disaster recovery. \n• Backup AS/400 operator IT Security Administrator SR Xerox April 2012  – Present (3 years 5 months) Administers/develops IBM mainframe RACF security and in house mainframe Goodyear security system. IT Security Administrator SR Xerox April 2012  – Present (3 years 5 months) Administers/develops IBM mainframe RACF security and in house mainframe Goodyear security system. IT Security Administrator SR./Business Development Supervisor Affiliated Computer Services November 2003  –  April 2012  (8 years 6 months) IT Security Administrator SR./Business Development Supervisor Affiliated Computer Services November 2003  –  April 2012  (8 years 6 months) DATA SECURITY ADMINISTRATOR Lockheed Martin Information Technology May 2002  –  November 2003  (1 year 7 months) Developed, coded and maintained in-house security system which maintained individual applications and audited user activity within all applications. Tools used include COBOL, SAS, Telon, JCL and DB2 on a Windows 2000 client. \nProvided security administration and training for the Lockheed Martin Security team. \nProvided administration of SecurID cards and related files on the Sun Solaris using RSA ACE/Server software. DATA SECURITY ADMINISTRATOR Lockheed Martin Information Technology May 2002  –  November 2003  (1 year 7 months) Developed, coded and maintained in-house security system which maintained individual applications and audited user activity within all applications. Tools used include COBOL, SAS, Telon, JCL and DB2 on a Windows 2000 client. \nProvided security administration and training for the Lockheed Martin Security team. \nProvided administration of SecurID cards and related files on the Sun Solaris using RSA ACE/Server software. SYSTEMS MANAGEMENT INTEGRATOR PROFESSIONAL IBM Global Services June 1994  –  April 2002  (7 years 11 months) Responsible for the testing, integration and maintenance of security software and procedures for the MVS/OS/390 and UNIX environments. Tools utilized include RACF, Vanguard, NC Syncom, Cobol, SAS, JCL, Telon, and DB2.  \n \n• Configured security for OS/390 accessing UNIX services. \n• Administered user IDs/Permits for UNIX utilizing VI Editor. \n• Set HFS (Hierarchical Files System) Permissions. \n• Developed, coded and maintained in-house security system which maintained individual applications and audited user activity within all applications. Tools used include COBOL, SAS, Telon, JCL and DB2 on a Windows NT client.  \n• Provided RACF security administration and implemented UNIX/Web Server security on OS/390 Security Server.  \n• Converted SDSF to RACF. \n• Implemented and tested MQ Series security. \n• Installed and configured Vanguard Version 3.3 \n• Modified RACF Templates with new version upgrades. \n• Tested RACF functionality after new upgrades. \n• Data Security team leader for Y2K (1998-2000) and disaster recovery (1998 - present).  \n• Documented procedures and standards for Goodyear Data Security including security administration, software maintenance, Y2K and disaster recovery. \n• Backup AS/400 operator SYSTEMS MANAGEMENT INTEGRATOR PROFESSIONAL IBM Global Services June 1994  –  April 2002  (7 years 11 months) Responsible for the testing, integration and maintenance of security software and procedures for the MVS/OS/390 and UNIX environments. Tools utilized include RACF, Vanguard, NC Syncom, Cobol, SAS, JCL, Telon, and DB2.  \n \n• Configured security for OS/390 accessing UNIX services. \n• Administered user IDs/Permits for UNIX utilizing VI Editor. \n• Set HFS (Hierarchical Files System) Permissions. \n• Developed, coded and maintained in-house security system which maintained individual applications and audited user activity within all applications. Tools used include COBOL, SAS, Telon, JCL and DB2 on a Windows NT client.  \n• Provided RACF security administration and implemented UNIX/Web Server security on OS/390 Security Server.  \n• Converted SDSF to RACF. \n• Implemented and tested MQ Series security. \n• Installed and configured Vanguard Version 3.3 \n• Modified RACF Templates with new version upgrades. \n• Tested RACF functionality after new upgrades. \n• Data Security team leader for Y2K (1998-2000) and disaster recovery (1998 - present).  \n• Documented procedures and standards for Goodyear Data Security including security administration, software maintenance, Y2K and disaster recovery. \n• Backup AS/400 operator Skills Security RACF Disaster Recovery JCL Mainframe Lotus Notes IBM Mainframe Unix Integration Leadership COBOL Skills  Security RACF Disaster Recovery JCL Mainframe Lotus Notes IBM Mainframe Unix Integration Leadership COBOL Security RACF Disaster Recovery JCL Mainframe Lotus Notes IBM Mainframe Unix Integration Leadership COBOL Security RACF Disaster Recovery JCL Mainframe Lotus Notes IBM Mainframe Unix Integration Leadership COBOL Education Malone University BA,  Business Management 1991  – 1992 University of Akron AAB,  Computer Programming Technology 1977  – 1991 Malone University BA,  Business Management 1991  – 1992 Malone University BA,  Business Management 1991  – 1992 Malone University BA,  Business Management 1991  – 1992 University of Akron AAB,  Computer Programming Technology 1977  – 1991 University of Akron AAB,  Computer Programming Technology 1977  – 1991 University of Akron AAB,  Computer Programming Technology 1977  – 1991 ", "Experience System Programmer Acxiom December 2009  –  December 2010  (1 year 1 month) Mainframe database system programmer providing all levels of support for IDMS, IMS, and ADABAS systems and their connections to CICS, DB2, and other DBMS's. Also provided backup support for Oracle. Systems Management Integrator Professional IBM Global Services January 1993  –  May 2007  (14 years 5 months) Mainframe Database System Programmer providing all levels of support for CICS, IDMS, and ADABAS systems and their connections to IMS, DB2, Oracle, and other DBMS's. System Programmer Acxiom December 2009  –  December 2010  (1 year 1 month) Mainframe database system programmer providing all levels of support for IDMS, IMS, and ADABAS systems and their connections to CICS, DB2, and other DBMS's. Also provided backup support for Oracle. System Programmer Acxiom December 2009  –  December 2010  (1 year 1 month) Mainframe database system programmer providing all levels of support for IDMS, IMS, and ADABAS systems and their connections to CICS, DB2, and other DBMS's. Also provided backup support for Oracle. Systems Management Integrator Professional IBM Global Services January 1993  –  May 2007  (14 years 5 months) Mainframe Database System Programmer providing all levels of support for CICS, IDMS, and ADABAS systems and their connections to IMS, DB2, Oracle, and other DBMS's. Systems Management Integrator Professional IBM Global Services January 1993  –  May 2007  (14 years 5 months) Mainframe Database System Programmer providing all levels of support for CICS, IDMS, and ADABAS systems and their connections to IMS, DB2, Oracle, and other DBMS's. ", "Experience Food Service Associate U of Mich Hospital May 2006  – Present (9 years 4 months) Sr. Systems Management Integrator Professional IBM 1999  –  2003  (4 years) Food Service Associate U of Mich Hospital May 2006  – Present (9 years 4 months) Food Service Associate U of Mich Hospital May 2006  – Present (9 years 4 months) Sr. Systems Management Integrator Professional IBM 1999  –  2003  (4 years) Sr. Systems Management Integrator Professional IBM 1999  –  2003  (4 years) Skills Microsoft Excel Customer Service Skills  Microsoft Excel Customer Service Microsoft Excel Customer Service Microsoft Excel Customer Service "]}