{"position": "Systems Software Engineer", "company": "Intel Corporation", "profiles": ["Summary Over 25 years experience in administrating, developing for and troubleshooting (many different flavours of) UNIX and Linux systems. A Linux hacker and solutions developer for over 20 years. \n \nSpecialties: Solutions development. integration, network configuration, programming, scripting, Internet services (apache, bind, postfix, sendmail, nntp), VOIP (asterisk), devops. \nI posses an exemplary ability to learn quickly about the variables involved and then methodically analyse and solve difficult problems. \n \nI like puzzles. But even more, I like solving them. Summary Over 25 years experience in administrating, developing for and troubleshooting (many different flavours of) UNIX and Linux systems. A Linux hacker and solutions developer for over 20 years. \n \nSpecialties: Solutions development. integration, network configuration, programming, scripting, Internet services (apache, bind, postfix, sendmail, nntp), VOIP (asterisk), devops. \nI posses an exemplary ability to learn quickly about the variables involved and then methodically analyse and solve difficult problems. \n \nI like puzzles. But even more, I like solving them. Over 25 years experience in administrating, developing for and troubleshooting (many different flavours of) UNIX and Linux systems. A Linux hacker and solutions developer for over 20 years. \n \nSpecialties: Solutions development. integration, network configuration, programming, scripting, Internet services (apache, bind, postfix, sendmail, nntp), VOIP (asterisk), devops. \nI posses an exemplary ability to learn quickly about the variables involved and then methodically analyse and solve difficult problems. \n \nI like puzzles. But even more, I like solving them. Over 25 years experience in administrating, developing for and troubleshooting (many different flavours of) UNIX and Linux systems. A Linux hacker and solutions developer for over 20 years. \n \nSpecialties: Solutions development. integration, network configuration, programming, scripting, Internet services (apache, bind, postfix, sendmail, nntp), VOIP (asterisk), devops. \nI posses an exemplary ability to learn quickly about the variables involved and then methodically analyse and solve difficult problems. \n \nI like puzzles. But even more, I like solving them. Experience Senior Systems Software Engineer Intel Corporation July 2012  – Present (3 years 2 months) Member of the Intel Manager for Lustre development team specializing in integrating Intel Manager for Lustre into the O/S, including package management, interfacing with system services such as NTP, Pacemaker, Corosync, etc. Senior Systems Software Engineer Whamcloud, Inc January 2011  –  July 2012  (1 year 7 months) Sr. support engineer; build system engineering; problem solver and troubleshooter. Senior Software Developer Oracle Corporation March 2010  –  January 2011  (11 months) Involved in various aspects of supporting the open source Lustre filesystem from investigating and resolving problems reported with the software to solving build engineering problems as well as community involvement. Senior Systems Software Engineer Sun Microsystems October 2007  –  March 2010  (2 years 6 months) Involved in various aspects of supporting the open source Lustre filesystem from investigating and resolving problems reported with the software to solving build engineering problems as well as community involvement. Senior Systems Software Engineer Cluster File Systems May 2004  –  November 2007  (3 years 7 months) Quality Assurance engineer for the Lustre filesystem. Developed and managed software for performing quality analysis of Lustre as well as managing several HPC clusters in the QA effort. Solutions Developer beONix Technology March 2003  –  May 2004  (1 year 3 months) Software developer providing innovative IT solutions to solve business problems. Release Engineering Mountain View Data October 2000  –  August 2001  (11 months) Responsible for managing the packaging of all software products for end user consumption. Consultant BC Tel Advanced Communications 1995  –  2001  (6 years) Problem solver and solutions designer. Networking Specialist Turbolinux May 2000  –  October 2000  (6 months) Responsible for the Internet facing services (web, ftp, mail, etc.) as well as security of the internal network resources from both internal and external threats. Owner InterLinx Support Services, Inc. June 1991  –  May 2000  (9 years) Owned a small consulting firm specializing in providing IT services including UNIX and Linux servers and Windows desktops. Senior Systems Software Engineer Intel Corporation July 2012  – Present (3 years 2 months) Member of the Intel Manager for Lustre development team specializing in integrating Intel Manager for Lustre into the O/S, including package management, interfacing with system services such as NTP, Pacemaker, Corosync, etc. Senior Systems Software Engineer Intel Corporation July 2012  – Present (3 years 2 months) Member of the Intel Manager for Lustre development team specializing in integrating Intel Manager for Lustre into the O/S, including package management, interfacing with system services such as NTP, Pacemaker, Corosync, etc. Senior Systems Software Engineer Whamcloud, Inc January 2011  –  July 2012  (1 year 7 months) Sr. support engineer; build system engineering; problem solver and troubleshooter. Senior Systems Software Engineer Whamcloud, Inc January 2011  –  July 2012  (1 year 7 months) Sr. support engineer; build system engineering; problem solver and troubleshooter. Senior Software Developer Oracle Corporation March 2010  –  January 2011  (11 months) Involved in various aspects of supporting the open source Lustre filesystem from investigating and resolving problems reported with the software to solving build engineering problems as well as community involvement. Senior Software Developer Oracle Corporation March 2010  –  January 2011  (11 months) Involved in various aspects of supporting the open source Lustre filesystem from investigating and resolving problems reported with the software to solving build engineering problems as well as community involvement. Senior Systems Software Engineer Sun Microsystems October 2007  –  March 2010  (2 years 6 months) Involved in various aspects of supporting the open source Lustre filesystem from investigating and resolving problems reported with the software to solving build engineering problems as well as community involvement. Senior Systems Software Engineer Sun Microsystems October 2007  –  March 2010  (2 years 6 months) Involved in various aspects of supporting the open source Lustre filesystem from investigating and resolving problems reported with the software to solving build engineering problems as well as community involvement. Senior Systems Software Engineer Cluster File Systems May 2004  –  November 2007  (3 years 7 months) Quality Assurance engineer for the Lustre filesystem. Developed and managed software for performing quality analysis of Lustre as well as managing several HPC clusters in the QA effort. Senior Systems Software Engineer Cluster File Systems May 2004  –  November 2007  (3 years 7 months) Quality Assurance engineer for the Lustre filesystem. Developed and managed software for performing quality analysis of Lustre as well as managing several HPC clusters in the QA effort. Solutions Developer beONix Technology March 2003  –  May 2004  (1 year 3 months) Software developer providing innovative IT solutions to solve business problems. Solutions Developer beONix Technology March 2003  –  May 2004  (1 year 3 months) Software developer providing innovative IT solutions to solve business problems. Release Engineering Mountain View Data October 2000  –  August 2001  (11 months) Responsible for managing the packaging of all software products for end user consumption. Release Engineering Mountain View Data October 2000  –  August 2001  (11 months) Responsible for managing the packaging of all software products for end user consumption. Consultant BC Tel Advanced Communications 1995  –  2001  (6 years) Problem solver and solutions designer. Consultant BC Tel Advanced Communications 1995  –  2001  (6 years) Problem solver and solutions designer. Networking Specialist Turbolinux May 2000  –  October 2000  (6 months) Responsible for the Internet facing services (web, ftp, mail, etc.) as well as security of the internal network resources from both internal and external threats. Networking Specialist Turbolinux May 2000  –  October 2000  (6 months) Responsible for the Internet facing services (web, ftp, mail, etc.) as well as security of the internal network resources from both internal and external threats. Owner InterLinx Support Services, Inc. June 1991  –  May 2000  (9 years) Owned a small consulting firm specializing in providing IT services including UNIX and Linux servers and Windows desktops. Owner InterLinx Support Services, Inc. June 1991  –  May 2000  (9 years) Owned a small consulting firm specializing in providing IT services including UNIX and Linux servers and Windows desktops. Skills Linux Unix File Systems High Performance... Scripting Operating Systems Apache Open Source Shell Scripting Distributed Systems Security Python High Availability Bind Programming Solaris Bash Linux Kernel Cluster Red Hat Linux Storage Sendmail Postfix System Architecture Integration Perl Scalability TCP/IP Hardware Virtualization Storage Area Networks Networking NNTP Windows System Automation Embedded Systems Debugging DNS Kernel Linux System... Troubleshooting Routers SAN VoIP RAID Unix Shell Scripting NAS Xen Git DevOps See 35+     See less Skills  Linux Unix File Systems High Performance... Scripting Operating Systems Apache Open Source Shell Scripting Distributed Systems Security Python High Availability Bind Programming Solaris Bash Linux Kernel Cluster Red Hat Linux Storage Sendmail Postfix System Architecture Integration Perl Scalability TCP/IP Hardware Virtualization Storage Area Networks Networking NNTP Windows System Automation Embedded Systems Debugging DNS Kernel Linux System... Troubleshooting Routers SAN VoIP RAID Unix Shell Scripting NAS Xen Git DevOps See 35+     See less Linux Unix File Systems High Performance... Scripting Operating Systems Apache Open Source Shell Scripting Distributed Systems Security Python High Availability Bind Programming Solaris Bash Linux Kernel Cluster Red Hat Linux Storage Sendmail Postfix System Architecture Integration Perl Scalability TCP/IP Hardware Virtualization Storage Area Networks Networking NNTP Windows System Automation Embedded Systems Debugging DNS Kernel Linux System... Troubleshooting Routers SAN VoIP RAID Unix Shell Scripting NAS Xen Git DevOps See 35+     See less Linux Unix File Systems High Performance... Scripting Operating Systems Apache Open Source Shell Scripting Distributed Systems Security Python High Availability Bind Programming Solaris Bash Linux Kernel Cluster Red Hat Linux Storage Sendmail Postfix System Architecture Integration Perl Scalability TCP/IP Hardware Virtualization Storage Area Networks Networking NNTP Windows System Automation Embedded Systems Debugging DNS Kernel Linux System... Troubleshooting Routers SAN VoIP RAID Unix Shell Scripting NAS Xen Git DevOps See 35+     See less Education DeVry Institute of Technology Computer programming 1986  – 1988 DeVry Institute of Technology Computer programming 1986  – 1988 DeVry Institute of Technology Computer programming 1986  – 1988 DeVry Institute of Technology Computer programming 1986  – 1988 ", "Summary Adept at mentoring and motivating individuals to excel. Strategic thinker and self-motivated to lead team in result driven in geographically dispersed environment. History of engineering the cutting edge products from early concept to market delivery. History of working with and supporting Blue chip customers. Certified SCRUM master driving and planning projects in Agile process. Troubleshooter recognized for incisive analytical abilities. \n \nSpecialties: \n \n- Bluetooth stack and profile development for mobile platforms. \n- Android Media framework. \n- Android Widevine DRM. \n- Data communication frameworks for PC and embedded systems . \n- Strong debugging and problem solving skills. \n- Effective project planning and management in Agile SCRUM process. \n- Certified SCRUM master. Summary Adept at mentoring and motivating individuals to excel. Strategic thinker and self-motivated to lead team in result driven in geographically dispersed environment. History of engineering the cutting edge products from early concept to market delivery. History of working with and supporting Blue chip customers. Certified SCRUM master driving and planning projects in Agile process. Troubleshooter recognized for incisive analytical abilities. \n \nSpecialties: \n \n- Bluetooth stack and profile development for mobile platforms. \n- Android Media framework. \n- Android Widevine DRM. \n- Data communication frameworks for PC and embedded systems . \n- Strong debugging and problem solving skills. \n- Effective project planning and management in Agile SCRUM process. \n- Certified SCRUM master. Adept at mentoring and motivating individuals to excel. Strategic thinker and self-motivated to lead team in result driven in geographically dispersed environment. History of engineering the cutting edge products from early concept to market delivery. History of working with and supporting Blue chip customers. Certified SCRUM master driving and planning projects in Agile process. Troubleshooter recognized for incisive analytical abilities. \n \nSpecialties: \n \n- Bluetooth stack and profile development for mobile platforms. \n- Android Media framework. \n- Android Widevine DRM. \n- Data communication frameworks for PC and embedded systems . \n- Strong debugging and problem solving skills. \n- Effective project planning and management in Agile SCRUM process. \n- Certified SCRUM master. Adept at mentoring and motivating individuals to excel. Strategic thinker and self-motivated to lead team in result driven in geographically dispersed environment. History of engineering the cutting edge products from early concept to market delivery. History of working with and supporting Blue chip customers. Certified SCRUM master driving and planning projects in Agile process. Troubleshooter recognized for incisive analytical abilities. \n \nSpecialties: \n \n- Bluetooth stack and profile development for mobile platforms. \n- Android Media framework. \n- Android Widevine DRM. \n- Data communication frameworks for PC and embedded systems . \n- Strong debugging and problem solving skills. \n- Effective project planning and management in Agile SCRUM process. \n- Certified SCRUM master. Experience Systems engineer Intel corporation February 2012  – Present (3 years 7 months) Portland, oregon area Engineering and integrating the following tasks for intel ATOM based mobile platforms. \n- Android system integration on Intel ATOM and core platforms. \n- Android media framework middleware integration.  \n- Intel graphics hardware components for classic and modular WIDEWINE DRM.  \n- Intel Wireless display, MIRACAST for Android platform. \n- Debugging the Android media components. Engineering Manager Fiserv March 2011  –  February 2012  (1 year) Corvallis, Oregon Area Senior Embedded Software Engineer iAnywhere, Sybase An SAP company. November 2004  –  May 2011  (6 years 7 months) corvallis, oregon area Engineering responsibilities - \n \n- Bluetooth stack (Lisbon & pre-Lisbon) and various profiles (HID,AV,HF,HDP,OBEX profiles,PAN) . \n- Implement and integrate stack and profiles to Mobile and PC platforms. \n- Support customers to integrate stack and profiles into their platforms.  \n- Profile and stack qualification testing with Profile Tuning Suite and proprietary tools.  \n- Re-engineering the code to comply with profile spec enhancements released by Bluetooth SIG.  \n- Integrating CESL, IEEE 11073-20601 health Informatics for Bluetooth health profile.  \n- WHQL driver signature with DTM for Bluetooth drivers. \n- Code coverage analysis using Visual Studio test system. Consulting Software Architect and Engineering Manager CoVideo Systems March 2003  –  November 2004  (1 year 9 months) - Architect video email and video conferencing solutions.  \n- Plan the project deadlines and Manage software engineering team. Firmware engineer PortalPlayer, Inc. 2000  –  2003  (3 years) Greater Seattle Area Engineered following modules for ARM TDMI processor based portable audio devices. \n \n- Communication modules for RS-232/USB/I2C/ interfaces several portable media players.  \n- UI frameworks. \n- Content management systems for various audio format files. \n- Framework to receive and send commands through I2C interface. \n- Test harness for communication manager functionalities. Software Engineer Aircell cellular August 1998  –  January 2000  (1 year 6 months) - Implemented the RADIUS (Remote Authentication Dial In User Service) for DSL service. \n- UI for IVR (Interactive Voice Response) Systems for call centre management. \n- Designed and coded interface modules for Intel dialogic hardware for IVR systems. Systems engineer Intel corporation February 2012  – Present (3 years 7 months) Portland, oregon area Engineering and integrating the following tasks for intel ATOM based mobile platforms. \n- Android system integration on Intel ATOM and core platforms. \n- Android media framework middleware integration.  \n- Intel graphics hardware components for classic and modular WIDEWINE DRM.  \n- Intel Wireless display, MIRACAST for Android platform. \n- Debugging the Android media components. Systems engineer Intel corporation February 2012  – Present (3 years 7 months) Portland, oregon area Engineering and integrating the following tasks for intel ATOM based mobile platforms. \n- Android system integration on Intel ATOM and core platforms. \n- Android media framework middleware integration.  \n- Intel graphics hardware components for classic and modular WIDEWINE DRM.  \n- Intel Wireless display, MIRACAST for Android platform. \n- Debugging the Android media components. Engineering Manager Fiserv March 2011  –  February 2012  (1 year) Corvallis, Oregon Area Engineering Manager Fiserv March 2011  –  February 2012  (1 year) Corvallis, Oregon Area Senior Embedded Software Engineer iAnywhere, Sybase An SAP company. November 2004  –  May 2011  (6 years 7 months) corvallis, oregon area Engineering responsibilities - \n \n- Bluetooth stack (Lisbon & pre-Lisbon) and various profiles (HID,AV,HF,HDP,OBEX profiles,PAN) . \n- Implement and integrate stack and profiles to Mobile and PC platforms. \n- Support customers to integrate stack and profiles into their platforms.  \n- Profile and stack qualification testing with Profile Tuning Suite and proprietary tools.  \n- Re-engineering the code to comply with profile spec enhancements released by Bluetooth SIG.  \n- Integrating CESL, IEEE 11073-20601 health Informatics for Bluetooth health profile.  \n- WHQL driver signature with DTM for Bluetooth drivers. \n- Code coverage analysis using Visual Studio test system. Senior Embedded Software Engineer iAnywhere, Sybase An SAP company. November 2004  –  May 2011  (6 years 7 months) corvallis, oregon area Engineering responsibilities - \n \n- Bluetooth stack (Lisbon & pre-Lisbon) and various profiles (HID,AV,HF,HDP,OBEX profiles,PAN) . \n- Implement and integrate stack and profiles to Mobile and PC platforms. \n- Support customers to integrate stack and profiles into their platforms.  \n- Profile and stack qualification testing with Profile Tuning Suite and proprietary tools.  \n- Re-engineering the code to comply with profile spec enhancements released by Bluetooth SIG.  \n- Integrating CESL, IEEE 11073-20601 health Informatics for Bluetooth health profile.  \n- WHQL driver signature with DTM for Bluetooth drivers. \n- Code coverage analysis using Visual Studio test system. Consulting Software Architect and Engineering Manager CoVideo Systems March 2003  –  November 2004  (1 year 9 months) - Architect video email and video conferencing solutions.  \n- Plan the project deadlines and Manage software engineering team. Consulting Software Architect and Engineering Manager CoVideo Systems March 2003  –  November 2004  (1 year 9 months) - Architect video email and video conferencing solutions.  \n- Plan the project deadlines and Manage software engineering team. Firmware engineer PortalPlayer, Inc. 2000  –  2003  (3 years) Greater Seattle Area Engineered following modules for ARM TDMI processor based portable audio devices. \n \n- Communication modules for RS-232/USB/I2C/ interfaces several portable media players.  \n- UI frameworks. \n- Content management systems for various audio format files. \n- Framework to receive and send commands through I2C interface. \n- Test harness for communication manager functionalities. Firmware engineer PortalPlayer, Inc. 2000  –  2003  (3 years) Greater Seattle Area Engineered following modules for ARM TDMI processor based portable audio devices. \n \n- Communication modules for RS-232/USB/I2C/ interfaces several portable media players.  \n- UI frameworks. \n- Content management systems for various audio format files. \n- Framework to receive and send commands through I2C interface. \n- Test harness for communication manager functionalities. Software Engineer Aircell cellular August 1998  –  January 2000  (1 year 6 months) - Implemented the RADIUS (Remote Authentication Dial In User Service) for DSL service. \n- UI for IVR (Interactive Voice Response) Systems for call centre management. \n- Designed and coded interface modules for Intel dialogic hardware for IVR systems. Software Engineer Aircell cellular August 1998  –  January 2000  (1 year 6 months) - Implemented the RADIUS (Remote Authentication Dial In User Service) for DSL service. \n- UI for IVR (Interactive Voice Response) Systems for call centre management. \n- Designed and coded interface modules for Intel dialogic hardware for IVR systems. Languages   Skills Embedded Systems Android C++ C Embedded Software Visual C++ Agile Methodologies Firmware Management Software Development Software Quality... Agile - Certified SCRUM... Intel ATOM based... Audio and Video Android Media Framework WIN32 Bluetooth stack and... C# SDLC See 4+     See less Skills  Embedded Systems Android C++ C Embedded Software Visual C++ Agile Methodologies Firmware Management Software Development Software Quality... Agile - Certified SCRUM... Intel ATOM based... Audio and Video Android Media Framework WIN32 Bluetooth stack and... C# SDLC See 4+     See less Embedded Systems Android C++ C Embedded Software Visual C++ Agile Methodologies Firmware Management Software Development Software Quality... Agile - Certified SCRUM... Intel ATOM based... Audio and Video Android Media Framework WIN32 Bluetooth stack and... C# SDLC See 4+     See less Embedded Systems Android C++ C Embedded Software Visual C++ Agile Methodologies Firmware Management Software Development Software Quality... Agile - Certified SCRUM... Intel ATOM based... Audio and Video Android Media Framework WIN32 Bluetooth stack and... C# SDLC See 4+     See less Education Andhra University Master of Computer sceince applications,  Computer science 1995  – 1998 Nagarjuna University Bachelor of Science,  Computer Science 1992  – 1995 Andhra University Master of Computer sceince applications,  Computer science 1995  – 1998 Andhra University Master of Computer sceince applications,  Computer science 1995  – 1998 Andhra University Master of Computer sceince applications,  Computer science 1995  – 1998 Nagarjuna University Bachelor of Science,  Computer Science 1992  – 1995 Nagarjuna University Bachelor of Science,  Computer Science 1992  – 1995 Nagarjuna University Bachelor of Science,  Computer Science 1992  – 1995 Honors & Awards ", "Experience Cluster Systems Software Engineer Intel Corporation July 2013  – Present (2 years 2 months) Champaign, IL Around early July of this year, I transitioned from the Atom team to Intel Cluster Ready team.  \n \nMy \"official\" job description includes ->  \n \n- developing cluster reference designs for Intel Xeon and Intel Xeon Phi based solutions \n- prototyping and developing innovative features for cluster system software components \n- providing rapid response and support for stakeholders \n \n \nOn a day to day basis, my work involves developing working knowledge of HPC cluster systems software components, related hardware components and HPC cluster programming models. I work directly with senior engineering staff building softwares and improving systems debugging skills. I get to play with cluster solutions integration, Linux system administration, cluster provisioning tools, resource management middlewares, different parallel programming models and different cluster interconnect fabrics. System Validation Engineer Intel Corporation March 2012  –  July 2013  (1 year 5 months) Austin, Texas In my first stint with Intel, I worked in Atom Validation Engineering team within Intel's Architecture Group. I got to dabble with the internals of Intel's 32nm and 22nm Atom phone and tablet SoCs.  \n \nMy \"official\" job description is as follows ->  \n \nCreated, defined and developed system validation environment and test suites. Used and applied emulation and platform-level tools and techniques to ensure performance to spec. Responsible for the development of methodologies, execution of validation plans, and debug of failures. Position requires a broad understanding of multiple system areas and requires interfacing with Architecture, Design, and Pre-silicon Validation teams in improving post-silicon test content and providing feedback for future on-die debug features \n \nMy primary focus area was performance validation of the graphics core. This involved, among activities mentioned above, comparison of benchmark numbers between runs on emulation with theoretical limits, on bare firmware without any overheads and on an operating system mimicking \"the real world\", debugging and root causing the differences and sweeping through various system settings with the underlying goal of extracting maximum performance.  \n \nThe combination of system settings and benchmark comparisons could often run into the thousands. Given necessity is the mother of invention, I ended up developing a rudimentary Python based automation tool chain that would let me execute all my tests over an extended period of time, typically weekends, gather data, apply post processing scripts and have the results ready for analysis. I continued to work on a formal automation framework that would eventually end up being used by the entire team to automate various kinds of testing. I was the primary author on a variety of modules, such as modules that would reboot the platform, send emails with results and errors, monitor testing for time outs, decode memory type settings. Graduate Research Assistant Center for Computation and Technology, LSU 2008  –  March 2012  (4 years) Research on CPU accelerators, nVidia GPUs, OpenCL, benchmarking, Scientific computing, High Performance Computing, temperature and power monitoring, algorithm analysis, parallel programming, multithreaded programming, linear algebra, CUDA. \n \nAdvisor: Dr. Thomas Sterling Undergraduate Research Assistant Center for Computation and Technology 2006  –  2008  (2 years) cluster construction, maintenance, documentation, troubleshooting, tech support, supercomputing research, high performance computing, program optimization, compiler optimization, performance tuning \n \nAdvisor: Dr. Thomas Sterling Math tutor Center for Academic Success 2005  –  2008  (3 years) Assisted undergraduate students with mathematics courses, contributed to codes with Matlab, Mathematica and web based portals like WebAssign and \nMyMatlab to visualize graphs and ease learning process \n \nAdvisor: Dr. Saundra McGuire Cluster Systems Software Engineer Intel Corporation July 2013  – Present (2 years 2 months) Champaign, IL Around early July of this year, I transitioned from the Atom team to Intel Cluster Ready team.  \n \nMy \"official\" job description includes ->  \n \n- developing cluster reference designs for Intel Xeon and Intel Xeon Phi based solutions \n- prototyping and developing innovative features for cluster system software components \n- providing rapid response and support for stakeholders \n \n \nOn a day to day basis, my work involves developing working knowledge of HPC cluster systems software components, related hardware components and HPC cluster programming models. I work directly with senior engineering staff building softwares and improving systems debugging skills. I get to play with cluster solutions integration, Linux system administration, cluster provisioning tools, resource management middlewares, different parallel programming models and different cluster interconnect fabrics. Cluster Systems Software Engineer Intel Corporation July 2013  – Present (2 years 2 months) Champaign, IL Around early July of this year, I transitioned from the Atom team to Intel Cluster Ready team.  \n \nMy \"official\" job description includes ->  \n \n- developing cluster reference designs for Intel Xeon and Intel Xeon Phi based solutions \n- prototyping and developing innovative features for cluster system software components \n- providing rapid response and support for stakeholders \n \n \nOn a day to day basis, my work involves developing working knowledge of HPC cluster systems software components, related hardware components and HPC cluster programming models. I work directly with senior engineering staff building softwares and improving systems debugging skills. I get to play with cluster solutions integration, Linux system administration, cluster provisioning tools, resource management middlewares, different parallel programming models and different cluster interconnect fabrics. System Validation Engineer Intel Corporation March 2012  –  July 2013  (1 year 5 months) Austin, Texas In my first stint with Intel, I worked in Atom Validation Engineering team within Intel's Architecture Group. I got to dabble with the internals of Intel's 32nm and 22nm Atom phone and tablet SoCs.  \n \nMy \"official\" job description is as follows ->  \n \nCreated, defined and developed system validation environment and test suites. Used and applied emulation and platform-level tools and techniques to ensure performance to spec. Responsible for the development of methodologies, execution of validation plans, and debug of failures. Position requires a broad understanding of multiple system areas and requires interfacing with Architecture, Design, and Pre-silicon Validation teams in improving post-silicon test content and providing feedback for future on-die debug features \n \nMy primary focus area was performance validation of the graphics core. This involved, among activities mentioned above, comparison of benchmark numbers between runs on emulation with theoretical limits, on bare firmware without any overheads and on an operating system mimicking \"the real world\", debugging and root causing the differences and sweeping through various system settings with the underlying goal of extracting maximum performance.  \n \nThe combination of system settings and benchmark comparisons could often run into the thousands. Given necessity is the mother of invention, I ended up developing a rudimentary Python based automation tool chain that would let me execute all my tests over an extended period of time, typically weekends, gather data, apply post processing scripts and have the results ready for analysis. I continued to work on a formal automation framework that would eventually end up being used by the entire team to automate various kinds of testing. I was the primary author on a variety of modules, such as modules that would reboot the platform, send emails with results and errors, monitor testing for time outs, decode memory type settings. System Validation Engineer Intel Corporation March 2012  –  July 2013  (1 year 5 months) Austin, Texas In my first stint with Intel, I worked in Atom Validation Engineering team within Intel's Architecture Group. I got to dabble with the internals of Intel's 32nm and 22nm Atom phone and tablet SoCs.  \n \nMy \"official\" job description is as follows ->  \n \nCreated, defined and developed system validation environment and test suites. Used and applied emulation and platform-level tools and techniques to ensure performance to spec. Responsible for the development of methodologies, execution of validation plans, and debug of failures. Position requires a broad understanding of multiple system areas and requires interfacing with Architecture, Design, and Pre-silicon Validation teams in improving post-silicon test content and providing feedback for future on-die debug features \n \nMy primary focus area was performance validation of the graphics core. This involved, among activities mentioned above, comparison of benchmark numbers between runs on emulation with theoretical limits, on bare firmware without any overheads and on an operating system mimicking \"the real world\", debugging and root causing the differences and sweeping through various system settings with the underlying goal of extracting maximum performance.  \n \nThe combination of system settings and benchmark comparisons could often run into the thousands. Given necessity is the mother of invention, I ended up developing a rudimentary Python based automation tool chain that would let me execute all my tests over an extended period of time, typically weekends, gather data, apply post processing scripts and have the results ready for analysis. I continued to work on a formal automation framework that would eventually end up being used by the entire team to automate various kinds of testing. I was the primary author on a variety of modules, such as modules that would reboot the platform, send emails with results and errors, monitor testing for time outs, decode memory type settings. Graduate Research Assistant Center for Computation and Technology, LSU 2008  –  March 2012  (4 years) Research on CPU accelerators, nVidia GPUs, OpenCL, benchmarking, Scientific computing, High Performance Computing, temperature and power monitoring, algorithm analysis, parallel programming, multithreaded programming, linear algebra, CUDA. \n \nAdvisor: Dr. Thomas Sterling Graduate Research Assistant Center for Computation and Technology, LSU 2008  –  March 2012  (4 years) Research on CPU accelerators, nVidia GPUs, OpenCL, benchmarking, Scientific computing, High Performance Computing, temperature and power monitoring, algorithm analysis, parallel programming, multithreaded programming, linear algebra, CUDA. \n \nAdvisor: Dr. Thomas Sterling Undergraduate Research Assistant Center for Computation and Technology 2006  –  2008  (2 years) cluster construction, maintenance, documentation, troubleshooting, tech support, supercomputing research, high performance computing, program optimization, compiler optimization, performance tuning \n \nAdvisor: Dr. Thomas Sterling Undergraduate Research Assistant Center for Computation and Technology 2006  –  2008  (2 years) cluster construction, maintenance, documentation, troubleshooting, tech support, supercomputing research, high performance computing, program optimization, compiler optimization, performance tuning \n \nAdvisor: Dr. Thomas Sterling Math tutor Center for Academic Success 2005  –  2008  (3 years) Assisted undergraduate students with mathematics courses, contributed to codes with Matlab, Mathematica and web based portals like WebAssign and \nMyMatlab to visualize graphs and ease learning process \n \nAdvisor: Dr. Saundra McGuire Math tutor Center for Academic Success 2005  –  2008  (3 years) Assisted undergraduate students with mathematics courses, contributed to codes with Matlab, Mathematica and web based portals like WebAssign and \nMyMatlab to visualize graphs and ease learning process \n \nAdvisor: Dr. Saundra McGuire Skills Supercomputing Parallel Programming CUDA C C++ Linux System Administration Compiler Optimization BLAS GPGPU GPU OpenCL Multithreading OpenMP MPI High Performance... Parallel Computing Computer Architecture Fortran Scientific Computing Algorithms Numerical Linear Algebra LAPACK Scientific Programming Parallel Algorithms Computational... SciPy Beowulf Clusters Silicon Validation Unix Shell Scripting Perl Mathematica Optimization SoC Testing Verilog See 21+     See less Skills  Supercomputing Parallel Programming CUDA C C++ Linux System Administration Compiler Optimization BLAS GPGPU GPU OpenCL Multithreading OpenMP MPI High Performance... Parallel Computing Computer Architecture Fortran Scientific Computing Algorithms Numerical Linear Algebra LAPACK Scientific Programming Parallel Algorithms Computational... SciPy Beowulf Clusters Silicon Validation Unix Shell Scripting Perl Mathematica Optimization SoC Testing Verilog See 21+     See less Supercomputing Parallel Programming CUDA C C++ Linux System Administration Compiler Optimization BLAS GPGPU GPU OpenCL Multithreading OpenMP MPI High Performance... Parallel Computing Computer Architecture Fortran Scientific Computing Algorithms Numerical Linear Algebra LAPACK Scientific Programming Parallel Algorithms Computational... SciPy Beowulf Clusters Silicon Validation Unix Shell Scripting Perl Mathematica Optimization SoC Testing Verilog See 21+     See less Supercomputing Parallel Programming CUDA C C++ Linux System Administration Compiler Optimization BLAS GPGPU GPU OpenCL Multithreading OpenMP MPI High Performance... Parallel Computing Computer Architecture Fortran Scientific Computing Algorithms Numerical Linear Algebra LAPACK Scientific Programming Parallel Algorithms Computational... SciPy Beowulf Clusters Silicon Validation Unix Shell Scripting Perl Mathematica Optimization SoC Testing Verilog See 21+     See less Education Louisiana State University MS,  Computer Engineering 2008  – 2011 Activities and Societies:  supercomputing research ,  beowulf bootcamp for high school students ,  IEEE ,  ACM ,  SIAM ,  chess ,  Linux support ,  Indian Students Association Louisiana State University BS,  Computer Engineering 2004  – 2008 Activities and Societies:  supercomputing research ,  leadership activities ,  Monster DLP program ,  LSU Leadershape ,  Certified Advanced Math tutor ,  Supercomputing student volunteer ,  IEEE ,  ACM ,  campus newspaper web editor ,  university dorms tech support ,  Linux Users Group ,  National Society for Collegiate Scholars ,  Communication Across Curriculum (advanced communication skills for engineers) National Junior School Physics ,  Chemistry , Mathematics,  Computer Science 2002  – 2004 class valedictorian Activities and Societies:  public speaking ,  quizzing ,  ISRO science fair winner ,  International Olympiad for Informatics Sindhi High School 1995  – 2002 Louisiana State University MS,  Computer Engineering 2008  – 2011 Activities and Societies:  supercomputing research ,  beowulf bootcamp for high school students ,  IEEE ,  ACM ,  SIAM ,  chess ,  Linux support ,  Indian Students Association Louisiana State University MS,  Computer Engineering 2008  – 2011 Activities and Societies:  supercomputing research ,  beowulf bootcamp for high school students ,  IEEE ,  ACM ,  SIAM ,  chess ,  Linux support ,  Indian Students Association Louisiana State University MS,  Computer Engineering 2008  – 2011 Activities and Societies:  supercomputing research ,  beowulf bootcamp for high school students ,  IEEE ,  ACM ,  SIAM ,  chess ,  Linux support ,  Indian Students Association Louisiana State University BS,  Computer Engineering 2004  – 2008 Activities and Societies:  supercomputing research ,  leadership activities ,  Monster DLP program ,  LSU Leadershape ,  Certified Advanced Math tutor ,  Supercomputing student volunteer ,  IEEE ,  ACM ,  campus newspaper web editor ,  university dorms tech support ,  Linux Users Group ,  National Society for Collegiate Scholars ,  Communication Across Curriculum (advanced communication skills for engineers) Louisiana State University BS,  Computer Engineering 2004  – 2008 Activities and Societies:  supercomputing research ,  leadership activities ,  Monster DLP program ,  LSU Leadershape ,  Certified Advanced Math tutor ,  Supercomputing student volunteer ,  IEEE ,  ACM ,  campus newspaper web editor ,  university dorms tech support ,  Linux Users Group ,  National Society for Collegiate Scholars ,  Communication Across Curriculum (advanced communication skills for engineers) Louisiana State University BS,  Computer Engineering 2004  – 2008 Activities and Societies:  supercomputing research ,  leadership activities ,  Monster DLP program ,  LSU Leadershape ,  Certified Advanced Math tutor ,  Supercomputing student volunteer ,  IEEE ,  ACM ,  campus newspaper web editor ,  university dorms tech support ,  Linux Users Group ,  National Society for Collegiate Scholars ,  Communication Across Curriculum (advanced communication skills for engineers) National Junior School Physics ,  Chemistry , Mathematics,  Computer Science 2002  – 2004 class valedictorian Activities and Societies:  public speaking ,  quizzing ,  ISRO science fair winner ,  International Olympiad for Informatics National Junior School Physics ,  Chemistry , Mathematics,  Computer Science 2002  – 2004 class valedictorian Activities and Societies:  public speaking ,  quizzing ,  ISRO science fair winner ,  International Olympiad for Informatics National Junior School Physics ,  Chemistry , Mathematics,  Computer Science 2002  – 2004 class valedictorian Activities and Societies:  public speaking ,  quizzing ,  ISRO science fair winner ,  International Olympiad for Informatics Sindhi High School 1995  – 2002 Sindhi High School 1995  – 2002 Sindhi High School 1995  – 2002 Honors & Awards Additional Honors & Awards Chancellor's List, Dean's List, Communication Across Curriculum Additional Honors & Awards Chancellor's List, Dean's List, Communication Across Curriculum Additional Honors & Awards Chancellor's List, Dean's List, Communication Across Curriculum Additional Honors & Awards Chancellor's List, Dean's List, Communication Across Curriculum ", "Languages English English English Skills kernel debugging Android Optimization Training Kernel Programming Device Drivers Debugging Linux Embedded Systems Embedded Software C Shell Scripting Embedded Linux ARM C++ Unix ClearCase Multithreading Perl Unix Shell Scripting Firmware Linux Kernel I2C USB TCP/IP Digital Signal... See 11+     See less Skills  kernel debugging Android Optimization Training Kernel Programming Device Drivers Debugging Linux Embedded Systems Embedded Software C Shell Scripting Embedded Linux ARM C++ Unix ClearCase Multithreading Perl Unix Shell Scripting Firmware Linux Kernel I2C USB TCP/IP Digital Signal... See 11+     See less kernel debugging Android Optimization Training Kernel Programming Device Drivers Debugging Linux Embedded Systems Embedded Software C Shell Scripting Embedded Linux ARM C++ Unix ClearCase Multithreading Perl Unix Shell Scripting Firmware Linux Kernel I2C USB TCP/IP Digital Signal... See 11+     See less kernel debugging Android Optimization Training Kernel Programming Device Drivers Debugging Linux Embedded Systems Embedded Software C Shell Scripting Embedded Linux ARM C++ Unix ClearCase Multithreading Perl Unix Shell Scripting Firmware Linux Kernel I2C USB TCP/IP Digital Signal... See 11+     See less Honors & Awards ", "Summary I am looking for full time opportunities in Network Security and Machine Learning domains and am looking to move to California. Right now, I work as an embedded systems software engineer with Intel in Portland. I graduated from the University of Arizona in May 2015 with a Masters degree in Computer Science, summa cum laude. I have a work experience of 7 years in the software industry before I joined for my Masters. I did my summer internship at Goldman Sachs in New York. Summary I am looking for full time opportunities in Network Security and Machine Learning domains and am looking to move to California. Right now, I work as an embedded systems software engineer with Intel in Portland. I graduated from the University of Arizona in May 2015 with a Masters degree in Computer Science, summa cum laude. I have a work experience of 7 years in the software industry before I joined for my Masters. I did my summer internship at Goldman Sachs in New York. I am looking for full time opportunities in Network Security and Machine Learning domains and am looking to move to California. Right now, I work as an embedded systems software engineer with Intel in Portland. I graduated from the University of Arizona in May 2015 with a Masters degree in Computer Science, summa cum laude. I have a work experience of 7 years in the software industry before I joined for my Masters. I did my summer internship at Goldman Sachs in New York. I am looking for full time opportunities in Network Security and Machine Learning domains and am looking to move to California. Right now, I work as an embedded systems software engineer with Intel in Portland. I graduated from the University of Arizona in May 2015 with a Masters degree in Computer Science, summa cum laude. I have a work experience of 7 years in the software industry before I joined for my Masters. I did my summer internship at Goldman Sachs in New York. Experience Embedded Software Engineer Intel Corporation August 2014  – Present (1 year 1 month) Portland, Oregon Area Graduate Assistant The University of Arizona January 2013  –  May 2014  (1 year 5 months) Tucson, Arizona Area Developed an application for department of astronomy that crawls and indexes latest data from NASA thus creating a single source astronomy tutelage portal www.teachastronomy.com. (C#, ASP.Net, Lucene, Java ,webservices, XML) Summer Intern Goldman Sachs June 2013  –  July 2013  (2 months) Greater New York City Area Developed an enhancement to a trading application, thus enabling system and trade profiling, which improved the performance by 5% (Java, C#, JUnit, Syncfusion.WPF). Junior Developer University of Arizona September 2012  –  December 2012  (4 months) Developed a .Net application which dynamically matches students to scholarships stored in SQLServer with LINQ/SubSonic Technology Lead Infosys December 2008  –  July 2012  (3 years 8 months) Hyderabad Area, India Was with the Infosys Research Labs.Developed and was involved in the full SDLC of a data masking product in .Net for a banking major that encrypts data from various databases (SQL Server, Oracle), Web Services and network stream intercepts (ISAPI). Also did Research on security and privacy issues in Cloud computing, Smartphone and Group key exchange protocols - published 5 research papers and filed for 2 Patents. Did a project doing modification of Hadoop source code to include data shredding functionality. Software Engineer Infosys August 2005  –  December 2008  (3 years 5 months) Development and maintenance of an application for a publishing domain client in .Net (along with TSQL, CSS, AJAX, Javascript) \nthat generates tag clouds, site maps for bot submission doing search engine optimization of a vertical search engine. \nDevelopment of an application for a construction client in .Net that provides cost information for construction professionals. \nBlackbox, white box and regression testing for a multi browser support of a web application. Embedded Software Engineer Intel Corporation August 2014  – Present (1 year 1 month) Portland, Oregon Area Embedded Software Engineer Intel Corporation August 2014  – Present (1 year 1 month) Portland, Oregon Area Graduate Assistant The University of Arizona January 2013  –  May 2014  (1 year 5 months) Tucson, Arizona Area Developed an application for department of astronomy that crawls and indexes latest data from NASA thus creating a single source astronomy tutelage portal www.teachastronomy.com. (C#, ASP.Net, Lucene, Java ,webservices, XML) Graduate Assistant The University of Arizona January 2013  –  May 2014  (1 year 5 months) Tucson, Arizona Area Developed an application for department of astronomy that crawls and indexes latest data from NASA thus creating a single source astronomy tutelage portal www.teachastronomy.com. (C#, ASP.Net, Lucene, Java ,webservices, XML) Summer Intern Goldman Sachs June 2013  –  July 2013  (2 months) Greater New York City Area Developed an enhancement to a trading application, thus enabling system and trade profiling, which improved the performance by 5% (Java, C#, JUnit, Syncfusion.WPF). Summer Intern Goldman Sachs June 2013  –  July 2013  (2 months) Greater New York City Area Developed an enhancement to a trading application, thus enabling system and trade profiling, which improved the performance by 5% (Java, C#, JUnit, Syncfusion.WPF). Junior Developer University of Arizona September 2012  –  December 2012  (4 months) Developed a .Net application which dynamically matches students to scholarships stored in SQLServer with LINQ/SubSonic Junior Developer University of Arizona September 2012  –  December 2012  (4 months) Developed a .Net application which dynamically matches students to scholarships stored in SQLServer with LINQ/SubSonic Technology Lead Infosys December 2008  –  July 2012  (3 years 8 months) Hyderabad Area, India Was with the Infosys Research Labs.Developed and was involved in the full SDLC of a data masking product in .Net for a banking major that encrypts data from various databases (SQL Server, Oracle), Web Services and network stream intercepts (ISAPI). Also did Research on security and privacy issues in Cloud computing, Smartphone and Group key exchange protocols - published 5 research papers and filed for 2 Patents. Did a project doing modification of Hadoop source code to include data shredding functionality. Technology Lead Infosys December 2008  –  July 2012  (3 years 8 months) Hyderabad Area, India Was with the Infosys Research Labs.Developed and was involved in the full SDLC of a data masking product in .Net for a banking major that encrypts data from various databases (SQL Server, Oracle), Web Services and network stream intercepts (ISAPI). Also did Research on security and privacy issues in Cloud computing, Smartphone and Group key exchange protocols - published 5 research papers and filed for 2 Patents. Did a project doing modification of Hadoop source code to include data shredding functionality. Software Engineer Infosys August 2005  –  December 2008  (3 years 5 months) Development and maintenance of an application for a publishing domain client in .Net (along with TSQL, CSS, AJAX, Javascript) \nthat generates tag clouds, site maps for bot submission doing search engine optimization of a vertical search engine. \nDevelopment of an application for a construction client in .Net that provides cost information for construction professionals. \nBlackbox, white box and regression testing for a multi browser support of a web application. Software Engineer Infosys August 2005  –  December 2008  (3 years 5 months) Development and maintenance of an application for a publishing domain client in .Net (along with TSQL, CSS, AJAX, Javascript) \nthat generates tag clouds, site maps for bot submission doing search engine optimization of a vertical search engine. \nDevelopment of an application for a construction client in .Net that provides cost information for construction professionals. \nBlackbox, white box and regression testing for a multi browser support of a web application. Languages Malayalam Native or bilingual proficiency Tamil Native or bilingual proficiency Kannada Professional working proficiency Telugu Limited working proficiency Marathi Elementary proficiency Hindi Native or bilingual proficiency French Elementary proficiency German Elementary proficiency Spanish Elementary proficiency Malayalam Native or bilingual proficiency Tamil Native or bilingual proficiency Kannada Professional working proficiency Telugu Limited working proficiency Marathi Elementary proficiency Hindi Native or bilingual proficiency French Elementary proficiency German Elementary proficiency Spanish Elementary proficiency Malayalam Native or bilingual proficiency Tamil Native or bilingual proficiency Kannada Professional working proficiency Telugu Limited working proficiency Marathi Elementary proficiency Hindi Native or bilingual proficiency French Elementary proficiency German Elementary proficiency Spanish Elementary proficiency Native or bilingual proficiency Native or bilingual proficiency Professional working proficiency Limited working proficiency Elementary proficiency Native or bilingual proficiency Elementary proficiency Elementary proficiency Elementary proficiency Skills XML Web Services C .NET C# JavaScript Unix SQL T-SQL PL/SQL Agile Methodologies AJAX ASP.NET Web Applications Microsoft SQL Server Oracle Network Security Information Security See 3+     See less Skills  XML Web Services C .NET C# JavaScript Unix SQL T-SQL PL/SQL Agile Methodologies AJAX ASP.NET Web Applications Microsoft SQL Server Oracle Network Security Information Security See 3+     See less XML Web Services C .NET C# JavaScript Unix SQL T-SQL PL/SQL Agile Methodologies AJAX ASP.NET Web Applications Microsoft SQL Server Oracle Network Security Information Security See 3+     See less XML Web Services C .NET C# JavaScript Unix SQL T-SQL PL/SQL Agile Methodologies AJAX ASP.NET Web Applications Microsoft SQL Server Oracle Network Security Information Security See 3+     See less Education University of Arizona Master of Science,  Computer Science 2012  – 2014 Activities and Societies:  phi kappa phi Birla Institute of Technology and Science Master of Science (M.S.),  Physics 2000  – 2005 Activities and Societies:  Mime Club ,  Photography Club ,  Karate ,  Treasurer for Kairali (Association of Malayalees in Pilani) Birla Institute of Technology and Science (BITS) Bachelor of Science,  Chemical Engineering 2000  – 2005 Activities and Societies:  Mime club ,  photography University of Arizona Master of Science,  Computer Science 2012  – 2014 Activities and Societies:  phi kappa phi University of Arizona Master of Science,  Computer Science 2012  – 2014 Activities and Societies:  phi kappa phi University of Arizona Master of Science,  Computer Science 2012  – 2014 Activities and Societies:  phi kappa phi Birla Institute of Technology and Science Master of Science (M.S.),  Physics 2000  – 2005 Activities and Societies:  Mime Club ,  Photography Club ,  Karate ,  Treasurer for Kairali (Association of Malayalees in Pilani) Birla Institute of Technology and Science Master of Science (M.S.),  Physics 2000  – 2005 Activities and Societies:  Mime Club ,  Photography Club ,  Karate ,  Treasurer for Kairali (Association of Malayalees in Pilani) Birla Institute of Technology and Science Master of Science (M.S.),  Physics 2000  – 2005 Activities and Societies:  Mime Club ,  Photography Club ,  Karate ,  Treasurer for Kairali (Association of Malayalees in Pilani) Birla Institute of Technology and Science (BITS) Bachelor of Science,  Chemical Engineering 2000  – 2005 Activities and Societies:  Mime club ,  photography Birla Institute of Technology and Science (BITS) Bachelor of Science,  Chemical Engineering 2000  – 2005 Activities and Societies:  Mime club ,  photography Birla Institute of Technology and Science (BITS) Bachelor of Science,  Chemical Engineering 2000  – 2005 Activities and Societies:  Mime club ,  photography Honors & Awards Honor Society Membership Phi Kappa Phi May 2014 Due to my exceptional academic excellence I was invited by Phi Kappa Phi to be an honorary member  Honor Society Membership Phi Kappa Phi May 2014 Due to my exceptional academic excellence I was invited by Phi Kappa Phi to be an honorary member  Honor Society Membership Phi Kappa Phi May 2014 Due to my exceptional academic excellence I was invited by Phi Kappa Phi to be an honorary member  Honor Society Membership Phi Kappa Phi May 2014 Due to my exceptional academic excellence I was invited by Phi Kappa Phi to be an honorary member  ", "Summary Embedded C/C++ software developer, with experience in mobile industry. Specialties:C/C++, embedded development. Summary Embedded C/C++ software developer, with experience in mobile industry. Specialties:C/C++, embedded development. Embedded C/C++ software developer, with experience in mobile industry. Specialties:C/C++, embedded development. Embedded C/C++ software developer, with experience in mobile industry. Specialties:C/C++, embedded development. Experience Sr.Systems Software Engineer Intel Corporation October 2014  – Present (11 months) Santa Clara, California Sr. Software Engineer Samsung Telecommunications America November 2012  –  October 2014  (2 years) San Jose Sr. Software Engineer Motorola Mobile Devices September 2010  –  November 2012  (2 years 3 months) Working as a graphics engineer for Android devices. Software Intern Samsung Telecommunications America August 2009  –  December 2009  (5 months) Designed, developed and optimized gesture recognition feature. Software Developer Azingo Inc. March 2007  –  July 2008  (1 year 5 months) Middle-ware module development for the Linux mobile. Software Test Engineer IBM Global Services, Pune August 2006  –  March 2007  (8 months) Developing test scripts in SQL for a data warehouse project. Sr.Systems Software Engineer Intel Corporation October 2014  – Present (11 months) Santa Clara, California Sr.Systems Software Engineer Intel Corporation October 2014  – Present (11 months) Santa Clara, California Sr. Software Engineer Samsung Telecommunications America November 2012  –  October 2014  (2 years) San Jose Sr. Software Engineer Samsung Telecommunications America November 2012  –  October 2014  (2 years) San Jose Sr. Software Engineer Motorola Mobile Devices September 2010  –  November 2012  (2 years 3 months) Working as a graphics engineer for Android devices. Sr. Software Engineer Motorola Mobile Devices September 2010  –  November 2012  (2 years 3 months) Working as a graphics engineer for Android devices. Software Intern Samsung Telecommunications America August 2009  –  December 2009  (5 months) Designed, developed and optimized gesture recognition feature. Software Intern Samsung Telecommunications America August 2009  –  December 2009  (5 months) Designed, developed and optimized gesture recognition feature. Software Developer Azingo Inc. March 2007  –  July 2008  (1 year 5 months) Middle-ware module development for the Linux mobile. Software Developer Azingo Inc. March 2007  –  July 2008  (1 year 5 months) Middle-ware module development for the Linux mobile. Software Test Engineer IBM Global Services, Pune August 2006  –  March 2007  (8 months) Developing test scripts in SQL for a data warehouse project. Software Test Engineer IBM Global Services, Pune August 2006  –  March 2007  (8 months) Developing test scripts in SQL for a data warehouse project. Skills Android 3D Graphics Mobile Software Linux C++ Embedded Systems 3D graphics Android Development C Mobile Applications Mobile Devices OpenGL Python Scrum Testing Embedded Software See 1+     See less Skills  Android 3D Graphics Mobile Software Linux C++ Embedded Systems 3D graphics Android Development C Mobile Applications Mobile Devices OpenGL Python Scrum Testing Embedded Software See 1+     See less Android 3D Graphics Mobile Software Linux C++ Embedded Systems 3D graphics Android Development C Mobile Applications Mobile Devices OpenGL Python Scrum Testing Embedded Software See 1+     See less Android 3D Graphics Mobile Software Linux C++ Embedded Systems 3D graphics Android Development C Mobile Applications Mobile Devices OpenGL Python Scrum Testing Embedded Software See 1+     See less Education The University of Texas at Dallas Masters,  Computer Science 2008  – 2010 Maharashtra Institute of Technology Bachelor of Engineering,  Computer Science 2002  – 2006 The University of Texas at Dallas Masters,  Computer Science 2008  – 2010 The University of Texas at Dallas Masters,  Computer Science 2008  – 2010 The University of Texas at Dallas Masters,  Computer Science 2008  – 2010 Maharashtra Institute of Technology Bachelor of Engineering,  Computer Science 2002  – 2006 Maharashtra Institute of Technology Bachelor of Engineering,  Computer Science 2002  – 2006 Maharashtra Institute of Technology Bachelor of Engineering,  Computer Science 2002  – 2006 ", "Summary Specialties: Software Architecture, Systems performance analysis, Python, Java, Perl, shell scripting, C, Operating Systems, Virtualization, Message Queues, Redis Summary Specialties: Software Architecture, Systems performance analysis, Python, Java, Perl, shell scripting, C, Operating Systems, Virtualization, Message Queues, Redis Specialties: Software Architecture, Systems performance analysis, Python, Java, Perl, shell scripting, C, Operating Systems, Virtualization, Message Queues, Redis Specialties: Software Architecture, Systems performance analysis, Python, Java, Perl, shell scripting, C, Operating Systems, Virtualization, Message Queues, Redis Experience Systems Software Engineer Intel Corporation October 2008  – Present (6 years 11 months) Grad Student The Pennsylvania State University September 2005  –  December 2008  (3 years 4 months) Grad student at Penn State Software Engineer / Programmer Analyst Infosys Technologies Ltd. May 2000  –  July 2004  (4 years 3 months) Systems Software Engineer Intel Corporation October 2008  – Present (6 years 11 months) Systems Software Engineer Intel Corporation October 2008  – Present (6 years 11 months) Grad Student The Pennsylvania State University September 2005  –  December 2008  (3 years 4 months) Grad student at Penn State Grad Student The Pennsylvania State University September 2005  –  December 2008  (3 years 4 months) Grad student at Penn State Software Engineer / Programmer Analyst Infosys Technologies Ltd. May 2000  –  July 2004  (4 years 3 months) Software Engineer / Programmer Analyst Infosys Technologies Ltd. May 2000  –  July 2004  (4 years 3 months) Languages English Native or bilingual proficiency Hindi Native or bilingual proficiency Russian Limited working proficiency English Native or bilingual proficiency Hindi Native or bilingual proficiency Russian Limited working proficiency English Native or bilingual proficiency Hindi Native or bilingual proficiency Russian Limited working proficiency Native or bilingual proficiency Native or bilingual proficiency Limited working proficiency Skills Programming Java Python C SQL Shell Scripting Unix Linux Operating Systems Software Design MySQL PostgreSQL Software Architecture Virtualization Perl Skills  Programming Java Python C SQL Shell Scripting Unix Linux Operating Systems Software Design MySQL PostgreSQL Software Architecture Virtualization Perl Programming Java Python C SQL Shell Scripting Unix Linux Operating Systems Software Design MySQL PostgreSQL Software Architecture Virtualization Perl Programming Java Python C SQL Shell Scripting Unix Linux Operating Systems Software Design MySQL PostgreSQL Software Architecture Virtualization Perl Education Penn State University Master's degree 2005  – 2007 MPEI Bachelors Degree 1995  – 1999 Penn State University Master's degree 2005  – 2007 Penn State University Master's degree 2005  – 2007 Penn State University Master's degree 2005  – 2007 MPEI Bachelors Degree 1995  – 1999 MPEI Bachelors Degree 1995  – 1999 MPEI Bachelors Degree 1995  – 1999 ", "Experience Software Engineer Cisco Systems August 2010  – Present (5 years 1 month) Systems Software Engineer Intel Corporation August 2009  –  August 2010  (1 year 1 month) Research Assistant University of Texas at Austin 2008  –  January 2010  (2 years) Member of Technical Staff Intern VMware May 2008  –  August 2008  (4 months) Teaching Assistant University of Texas at Austin August 2007  –  January 2008  (6 months) Member Technical Staff Cisco Offshore Dev. Center May 2004  –  July 2007  (3 years 3 months) Software Engineer Cisco Systems August 2010  – Present (5 years 1 month) Software Engineer Cisco Systems August 2010  – Present (5 years 1 month) Systems Software Engineer Intel Corporation August 2009  –  August 2010  (1 year 1 month) Systems Software Engineer Intel Corporation August 2009  –  August 2010  (1 year 1 month) Research Assistant University of Texas at Austin 2008  –  January 2010  (2 years) Research Assistant University of Texas at Austin 2008  –  January 2010  (2 years) Member of Technical Staff Intern VMware May 2008  –  August 2008  (4 months) Member of Technical Staff Intern VMware May 2008  –  August 2008  (4 months) Teaching Assistant University of Texas at Austin August 2007  –  January 2008  (6 months) Teaching Assistant University of Texas at Austin August 2007  –  January 2008  (6 months) Member Technical Staff Cisco Offshore Dev. Center May 2004  –  July 2007  (3 years 3 months) Member Technical Staff Cisco Offshore Dev. Center May 2004  –  July 2007  (3 years 3 months) Education The University of Texas at Austin 2007  – 2009 University of Madras The University of Texas at Austin 2007  – 2009 The University of Texas at Austin 2007  – 2009 The University of Texas at Austin 2007  – 2009 University of Madras University of Madras University of Madras ", "Experience Software Consultant Greater Philadelphia Area September 2004  – Present (11 years) Project Leader / Consultant Boone Packaging, Inc. March 2001  –  October 2004  (3 years 8 months) Software Developer Peregrine Systems, Inc. January 1997  –  February 2001  (4 years 2 months) Systems Analyst Hay Group, Inc. June 1993  –  January 1997  (3 years 8 months) Systems Software Engineer Intel Corporation May 1992  –  June 1993  (1 year 2 months) Multimedia and Supercomputing Components Group Software Consultant Greater Philadelphia Area September 2004  – Present (11 years) Software Consultant Greater Philadelphia Area September 2004  – Present (11 years) Project Leader / Consultant Boone Packaging, Inc. March 2001  –  October 2004  (3 years 8 months) Project Leader / Consultant Boone Packaging, Inc. March 2001  –  October 2004  (3 years 8 months) Software Developer Peregrine Systems, Inc. January 1997  –  February 2001  (4 years 2 months) Software Developer Peregrine Systems, Inc. January 1997  –  February 2001  (4 years 2 months) Systems Analyst Hay Group, Inc. June 1993  –  January 1997  (3 years 8 months) Systems Analyst Hay Group, Inc. June 1993  –  January 1997  (3 years 8 months) Systems Software Engineer Intel Corporation May 1992  –  June 1993  (1 year 2 months) Multimedia and Supercomputing Components Group Systems Software Engineer Intel Corporation May 1992  –  June 1993  (1 year 2 months) Multimedia and Supercomputing Components Group ", "Summary Experience with kernel development with focus on Memory Management. Several contributions to Linux kernel and Xen. Specialties:Memory Management. Summary Experience with kernel development with focus on Memory Management. Several contributions to Linux kernel and Xen. Specialties:Memory Management. Experience with kernel development with focus on Memory Management. Several contributions to Linux kernel and Xen. Specialties:Memory Management. Experience with kernel development with focus on Memory Management. Several contributions to Linux kernel and Xen. Specialties:Memory Management. Experience Systems Software Engineer Intel Corporation June 2012  – Present (3 years 3 months) Santa Clara, California Research Intern Microsoft Corporation May 2011  –  August 2011  (4 months) Working on enhanced caching facilities for Bing and SQL Server products, as part of \neXtreme Computing Group. Software Developer Google Summer of Code 2010 April 2010  –  August 2010  (5 months) Google Summer of Code (GSoC) is a global program that offers student developers stipends to write code for various open source software projects. \n \nI worked on project: 'Memory Compression for Virtualized Environments' as part of GSoC. Details: http://www.scribd.com/doc/28713197/Memory-Compression-for-Virtualized-Environments \n \nThe project was successfully completed and a prize money of $5000 was awarded. Member Technical Staff II VMware September 2006  –  April 2010  (3 years 8 months) Part of VMware ESX Resource Management team. Working on issues involving memory management and CPU scheduling. Systems Software Engineer Intel Corporation June 2012  – Present (3 years 3 months) Santa Clara, California Systems Software Engineer Intel Corporation June 2012  – Present (3 years 3 months) Santa Clara, California Research Intern Microsoft Corporation May 2011  –  August 2011  (4 months) Working on enhanced caching facilities for Bing and SQL Server products, as part of \neXtreme Computing Group. Research Intern Microsoft Corporation May 2011  –  August 2011  (4 months) Working on enhanced caching facilities for Bing and SQL Server products, as part of \neXtreme Computing Group. Software Developer Google Summer of Code 2010 April 2010  –  August 2010  (5 months) Google Summer of Code (GSoC) is a global program that offers student developers stipends to write code for various open source software projects. \n \nI worked on project: 'Memory Compression for Virtualized Environments' as part of GSoC. Details: http://www.scribd.com/doc/28713197/Memory-Compression-for-Virtualized-Environments \n \nThe project was successfully completed and a prize money of $5000 was awarded. Software Developer Google Summer of Code 2010 April 2010  –  August 2010  (5 months) Google Summer of Code (GSoC) is a global program that offers student developers stipends to write code for various open source software projects. \n \nI worked on project: 'Memory Compression for Virtualized Environments' as part of GSoC. Details: http://www.scribd.com/doc/28713197/Memory-Compression-for-Virtualized-Environments \n \nThe project was successfully completed and a prize money of $5000 was awarded. Member Technical Staff II VMware September 2006  –  April 2010  (3 years 8 months) Part of VMware ESX Resource Management team. Working on issues involving memory management and CPU scheduling. Member Technical Staff II VMware September 2006  –  April 2010  (3 years 8 months) Part of VMware ESX Resource Management team. Working on issues involving memory management and CPU scheduling. Languages English Full professional proficiency Hindi Native or bilingual proficiency English Full professional proficiency Hindi Native or bilingual proficiency English Full professional proficiency Hindi Native or bilingual proficiency Full professional proficiency Native or bilingual proficiency Skills Linux Linux Kernel Virtualization Operating Systems C Memory Management C++ OCaml Golang Computer Science Open Source Kernel Software Development Shell Scripting Debugging Distributed Systems See 1+     See less Skills  Linux Linux Kernel Virtualization Operating Systems C Memory Management C++ OCaml Golang Computer Science Open Source Kernel Software Development Shell Scripting Debugging Distributed Systems See 1+     See less Linux Linux Kernel Virtualization Operating Systems C Memory Management C++ OCaml Golang Computer Science Open Source Kernel Software Development Shell Scripting Debugging Distributed Systems See 1+     See less Linux Linux Kernel Virtualization Operating Systems C Memory Management C++ OCaml Golang Computer Science Open Source Kernel Software Development Shell Scripting Debugging Distributed Systems See 1+     See less Education University of Massachusetts, Amherst MS,  Computer Science 2010  – 2012 Coursera Machine Learning 2014  – 2014 Instructor: Andrew Ng (Stanford University) \nDuration: 10 weeks \n \nhttps://www.coursera.org/course/ml Guru Gobind Singh Indraprastha University B. Tech.,  Computer Science 2002  – 2006 University of Massachusetts, Amherst MS,  Computer Science 2010  – 2012 University of Massachusetts, Amherst MS,  Computer Science 2010  – 2012 University of Massachusetts, Amherst MS,  Computer Science 2010  – 2012 Coursera Machine Learning 2014  – 2014 Instructor: Andrew Ng (Stanford University) \nDuration: 10 weeks \n \nhttps://www.coursera.org/course/ml Coursera Machine Learning 2014  – 2014 Instructor: Andrew Ng (Stanford University) \nDuration: 10 weeks \n \nhttps://www.coursera.org/course/ml Coursera Machine Learning 2014  – 2014 Instructor: Andrew Ng (Stanford University) \nDuration: 10 weeks \n \nhttps://www.coursera.org/course/ml Guru Gobind Singh Indraprastha University B. Tech.,  Computer Science 2002  – 2006 Guru Gobind Singh Indraprastha University B. Tech.,  Computer Science 2002  – 2006 Guru Gobind Singh Indraprastha University B. Tech.,  Computer Science 2002  – 2006 Honors & Awards Additional Honors & Awards Worked on a project selected in Google Summer of Code 2010 program (Memory Compression for Virtualized Environments). Awarded $5000 for successful completion. \n(Mentor: Rik van Riel, Org: Linux Foundation) \n \nEvaluating effects of cache memory compression on embedded systems. Linux Symposium, Ottawa, 2007. Paper: http://ols.108.redhat.com/2007/Reprints/briglia-Reprint.pdf \n \nPublished article at LWN (Linux Weekly News): \n\"Compcache: in-memory compressed swapping\" \nhttp://lwn.net/Articles/334649/ \n(Date: May 26, 2009) \nReceived $200 for the article and few days of fame! \n \nSelected in Google Summer of Code 2006 program. Awarded $4500 for developing memory compression patches for Linux kernel: http://compcache.googlecode.com/ \nIts now included in mainline. \n(Mentor: Rik Van Riel, Senior Software Engineer, Redhat). \n \nDeveloped memory allocator which is now part of Xen hypervisor (replacing its default xmalloc engine). Additional Honors & Awards Worked on a project selected in Google Summer of Code 2010 program (Memory Compression for Virtualized Environments). Awarded $5000 for successful completion. \n(Mentor: Rik van Riel, Org: Linux Foundation) \n \nEvaluating effects of cache memory compression on embedded systems. Linux Symposium, Ottawa, 2007. Paper: http://ols.108.redhat.com/2007/Reprints/briglia-Reprint.pdf \n \nPublished article at LWN (Linux Weekly News): \n\"Compcache: in-memory compressed swapping\" \nhttp://lwn.net/Articles/334649/ \n(Date: May 26, 2009) \nReceived $200 for the article and few days of fame! \n \nSelected in Google Summer of Code 2006 program. Awarded $4500 for developing memory compression patches for Linux kernel: http://compcache.googlecode.com/ \nIts now included in mainline. \n(Mentor: Rik Van Riel, Senior Software Engineer, Redhat). \n \nDeveloped memory allocator which is now part of Xen hypervisor (replacing its default xmalloc engine). Additional Honors & Awards Worked on a project selected in Google Summer of Code 2010 program (Memory Compression for Virtualized Environments). Awarded $5000 for successful completion. \n(Mentor: Rik van Riel, Org: Linux Foundation) \n \nEvaluating effects of cache memory compression on embedded systems. Linux Symposium, Ottawa, 2007. Paper: http://ols.108.redhat.com/2007/Reprints/briglia-Reprint.pdf \n \nPublished article at LWN (Linux Weekly News): \n\"Compcache: in-memory compressed swapping\" \nhttp://lwn.net/Articles/334649/ \n(Date: May 26, 2009) \nReceived $200 for the article and few days of fame! \n \nSelected in Google Summer of Code 2006 program. Awarded $4500 for developing memory compression patches for Linux kernel: http://compcache.googlecode.com/ \nIts now included in mainline. \n(Mentor: Rik Van Riel, Senior Software Engineer, Redhat). \n \nDeveloped memory allocator which is now part of Xen hypervisor (replacing its default xmalloc engine). Additional Honors & Awards Worked on a project selected in Google Summer of Code 2010 program (Memory Compression for Virtualized Environments). Awarded $5000 for successful completion. \n(Mentor: Rik van Riel, Org: Linux Foundation) \n \nEvaluating effects of cache memory compression on embedded systems. Linux Symposium, Ottawa, 2007. Paper: http://ols.108.redhat.com/2007/Reprints/briglia-Reprint.pdf \n \nPublished article at LWN (Linux Weekly News): \n\"Compcache: in-memory compressed swapping\" \nhttp://lwn.net/Articles/334649/ \n(Date: May 26, 2009) \nReceived $200 for the article and few days of fame! \n \nSelected in Google Summer of Code 2006 program. Awarded $4500 for developing memory compression patches for Linux kernel: http://compcache.googlecode.com/ \nIts now included in mainline. \n(Mentor: Rik Van Riel, Senior Software Engineer, Redhat). \n \nDeveloped memory allocator which is now part of Xen hypervisor (replacing its default xmalloc engine). ", "Experience Systems Software Engineer Intel Corporation February 2011  – Present (4 years 7 months) Device Driver and Systems software specialist at Intel Mobile Communications Staff Engineer Infineon Technologies india pvt ltd October 2009  –  August 2010  (11 months) Development and maintenance of Device Drivers for peripherals on Mobile system like UICC card Driver, Drivers for Security algorithms, Display/Keypad Backlight, Vibrator driver, Accessory Driver, DMA driver, Haptics Driver, Bluetooth baseband layer development. Senior Software Engineer Infineon Technologies March 2006  –  September 2009  (3 years 7 months) Device Driver and Systems software specialist at Intel Mobile Communications Progammer Analysts Infosys Technologies Ltd April 2005  –  March 2006  (1 year) Developing Bluetooth software for mobile phones.  \nDeveloping API's for freescale mobile platform. Member Technical Staff Oracle Ndia Pvt Ltd June 2001  –  March 2005  (3 years 10 months) Worked for Oracle Server Technologies Group, Provide support for Oracle database, Perform tests of new features in oracle database, \nMaintain a software library used in Oracle database. Software Engineer Adamya Technocrats India Pvt Ltd October 2000  –  June 2001  (9 months) Implementation of Bluetooth Baseband layer, Link Manager Protocol and Host Controller interface (HCI). These three layers are the lowest layers of the Bluetooth protocol stack. involved in design, Coding & Testing of the Baseband services like Forward Error Correction using 1/3 & 2/3 methods, Cyclic Redundancy Check, Access Code generation, Access Code Correlation routine, Data Whitening, Finite state machine of Link Controller. Implementation of Link manager Functions like Authentication, Pairing, Connection establishment, Setting Link level Encryption, Generation of Link keys for Authentication, Implementation of functions in Host controller interface that control the events and initiate and establish Baseband level connection between two-Bluetooth units. Systems Software Engineer Intel Corporation February 2011  – Present (4 years 7 months) Device Driver and Systems software specialist at Intel Mobile Communications Systems Software Engineer Intel Corporation February 2011  – Present (4 years 7 months) Device Driver and Systems software specialist at Intel Mobile Communications Staff Engineer Infineon Technologies india pvt ltd October 2009  –  August 2010  (11 months) Development and maintenance of Device Drivers for peripherals on Mobile system like UICC card Driver, Drivers for Security algorithms, Display/Keypad Backlight, Vibrator driver, Accessory Driver, DMA driver, Haptics Driver, Bluetooth baseband layer development. Staff Engineer Infineon Technologies india pvt ltd October 2009  –  August 2010  (11 months) Development and maintenance of Device Drivers for peripherals on Mobile system like UICC card Driver, Drivers for Security algorithms, Display/Keypad Backlight, Vibrator driver, Accessory Driver, DMA driver, Haptics Driver, Bluetooth baseband layer development. Senior Software Engineer Infineon Technologies March 2006  –  September 2009  (3 years 7 months) Device Driver and Systems software specialist at Intel Mobile Communications Senior Software Engineer Infineon Technologies March 2006  –  September 2009  (3 years 7 months) Device Driver and Systems software specialist at Intel Mobile Communications Progammer Analysts Infosys Technologies Ltd April 2005  –  March 2006  (1 year) Developing Bluetooth software for mobile phones.  \nDeveloping API's for freescale mobile platform. Progammer Analysts Infosys Technologies Ltd April 2005  –  March 2006  (1 year) Developing Bluetooth software for mobile phones.  \nDeveloping API's for freescale mobile platform. Member Technical Staff Oracle Ndia Pvt Ltd June 2001  –  March 2005  (3 years 10 months) Worked for Oracle Server Technologies Group, Provide support for Oracle database, Perform tests of new features in oracle database, \nMaintain a software library used in Oracle database. Member Technical Staff Oracle Ndia Pvt Ltd June 2001  –  March 2005  (3 years 10 months) Worked for Oracle Server Technologies Group, Provide support for Oracle database, Perform tests of new features in oracle database, \nMaintain a software library used in Oracle database. Software Engineer Adamya Technocrats India Pvt Ltd October 2000  –  June 2001  (9 months) Implementation of Bluetooth Baseband layer, Link Manager Protocol and Host Controller interface (HCI). These three layers are the lowest layers of the Bluetooth protocol stack. involved in design, Coding & Testing of the Baseband services like Forward Error Correction using 1/3 & 2/3 methods, Cyclic Redundancy Check, Access Code generation, Access Code Correlation routine, Data Whitening, Finite state machine of Link Controller. Implementation of Link manager Functions like Authentication, Pairing, Connection establishment, Setting Link level Encryption, Generation of Link keys for Authentication, Implementation of functions in Host controller interface that control the events and initiate and establish Baseband level connection between two-Bluetooth units. Software Engineer Adamya Technocrats India Pvt Ltd October 2000  –  June 2001  (9 months) Implementation of Bluetooth Baseband layer, Link Manager Protocol and Host Controller interface (HCI). These three layers are the lowest layers of the Bluetooth protocol stack. involved in design, Coding & Testing of the Baseband services like Forward Error Correction using 1/3 & 2/3 methods, Cyclic Redundancy Check, Access Code generation, Access Code Correlation routine, Data Whitening, Finite state machine of Link Controller. Implementation of Link manager Functions like Authentication, Pairing, Connection establishment, Setting Link level Encryption, Generation of Link keys for Authentication, Implementation of functions in Host controller interface that control the events and initiate and establish Baseband level connection between two-Bluetooth units. Languages Hindi Kannada Urdu Hindi Kannada Urdu Hindi Kannada Urdu Skills Device Drivers Mobile Devices ARM Bluetooth Embedded Systems Cryptography Algorithms RTOS Mobile Communications Debugging Code Embedded Software Protocol Stacks Debugging Firmware ClearCase C Software Development Testing See 3+     See less Skills  Device Drivers Mobile Devices ARM Bluetooth Embedded Systems Cryptography Algorithms RTOS Mobile Communications Debugging Code Embedded Software Protocol Stacks Debugging Firmware ClearCase C Software Development Testing See 3+     See less Device Drivers Mobile Devices ARM Bluetooth Embedded Systems Cryptography Algorithms RTOS Mobile Communications Debugging Code Embedded Software Protocol Stacks Debugging Firmware ClearCase C Software Development Testing See 3+     See less Device Drivers Mobile Devices ARM Bluetooth Embedded Systems Cryptography Algorithms RTOS Mobile Communications Debugging Code Embedded Software Protocol Stacks Debugging Firmware ClearCase C Software Development Testing See 3+     See less Education Illinois Institute of Technology M.C.S,  Computer Science 2004  – 2006 University of Mysore B.E,  Computer Science and Engineer 1996  – 2000 Illinois Institute of Technology M.C.S,  Computer Science 2004  – 2006 Illinois Institute of Technology M.C.S,  Computer Science 2004  – 2006 Illinois Institute of Technology M.C.S,  Computer Science 2004  – 2006 University of Mysore B.E,  Computer Science and Engineer 1996  – 2000 University of Mysore B.E,  Computer Science and Engineer 1996  – 2000 University of Mysore B.E,  Computer Science and Engineer 1996  – 2000 ", "Summary Information Systems jack-of-all-trades. Systems Administration, SDLC, Auditing, project management, software development, database management Summary Information Systems jack-of-all-trades. Systems Administration, SDLC, Auditing, project management, software development, database management Information Systems jack-of-all-trades. Systems Administration, SDLC, Auditing, project management, software development, database management Information Systems jack-of-all-trades. Systems Administration, SDLC, Auditing, project management, software development, database management Experience Merchant Technical Services Engineer PayPal June 2013  – Present (2 years 3 months) Chandler, AZ Interface with merchants through telephone, e-ticket and social media support systems to resolve technical issues in the functioning or implementation of PayPal payment solutions. Address executive escalations regarding high level merchants who are encountering high visibility technical issues. Work with SMB merchants to review their current web solutions and API errors to put together a program to leverage PayPal systems to increase web site revenue and provide the best customer experience. Train and mentor other engineers on a local, national and global level with technical issues and problem investigation Server Operations/EBaR Support CompuCom November 2012  –  June 2013  (8 months) Chandler, AZ Perform server operations tasks including but not limited to server builds using Altiris, server decommissioning, on call server support for 24/7 coverage for IT supported servers in Chandler and Ocotillo sites. Also responsible for Electronic Backup and Recovery (EBaR) support including tape maintenance , troubleshooting and investigation. Responsible for cataloging and inventory of DLT tapes for Chandler main campus backups. Senior Systems/Database Engineer/IT Helpdesk Manager Loan Resolution Corp August 2009  –  October 2012  (3 years 3 months) Performed database administration duties, Windows Server Management, Active Directory Administration, Group Policy Administration, Web server administration and release management supervision. Successfully prepared the IT department in the auditing preparation for a SAS70 type two certification. Performed server backups, restores, archiving and workstation preparation on a companywide level. Implementation of a help desk ticketing/tracking system. Creation of monthly state of the IT department reports deliverable to the President of the corporation. Middleware Software Engineer Intel Corporation June 2007  –  May 2009  (2 years) Performed third level software technical support for three (3) manufacturing factories. Researched, programmed, developed, documented, tested and proliferated troubleshooting systems, procedures and scripts on a worldwide factory level. Cross-trained Automation and support engineers in Middleware systems. Headed up the project management of companywide change control management program roll out. Consulted with worldwide factory representatives as a liaison for changes regarding the new change management program. Maintained Middleware systems across 30+ servers and 300+ workstations. Attended worldwide meetings to exchange guidelines and best known resolutions to all factories. Managed day to day operations within the Middleware team environment. Information Systems Software Engineer Intel Corporation June 2006  –  June 2007  (1 year 1 month) Developed, owned, troubleshot, upgraded and documented Automation owned web pages used in 3 manufacturing factories on a 24/7 basis. Consulted with customers regarding customer needs and impromptu report generation. Performed SQL database management tasks such as user and role administration, database upgrades, and database backups. Performed server security management such as user role and file share administration. Global Automation Support Automation Engineer Intel Corporation June 2000  –  June 2006  (6 years 1 month) Performed VAX/VMS account creations. Developed software macros for the automated creation of VMS/VAX accounts. Provided first and second level support for factory automation products including VAX/VMS. Performed Windows NT/2000 server administration as well as SQL database administration. Owned and trained support center backup solution, Altiris. Created, distributed and updated system backup images for all support center maintained systems. Conducted training programs and managed front end day shift day to day operations. Engineering Technician Intel Corporation June 1997  –  June 2000  (3 years 1 month) Built, maintained, administrated and supported 17 Windows NT servers on two domains including one NT cluster server, 140 station controllers in manufacturing factory, and 30 shared PC's throughout manufacturing factory. Developed software applications for use in manufacturing factory. Performed database administration using SQL 6.0, 6.5 and 7.0 as well as Access '97/2000. Managed daily operations of Automation support technicians. Manufacturing technician Intel Corporation May 1993  –  June 1997  (4 years 2 months) in Photo-Lithography area, created weekly reports reflecting Lithography issues and equipment issues. Interfaced with area engineers to ensure resolution of machine issues and to facilitate the production schedule. Trained junior technicians in the operation and maintenance of Photo-lithography equipment Merchant Technical Services Engineer PayPal June 2013  – Present (2 years 3 months) Chandler, AZ Interface with merchants through telephone, e-ticket and social media support systems to resolve technical issues in the functioning or implementation of PayPal payment solutions. Address executive escalations regarding high level merchants who are encountering high visibility technical issues. Work with SMB merchants to review their current web solutions and API errors to put together a program to leverage PayPal systems to increase web site revenue and provide the best customer experience. Train and mentor other engineers on a local, national and global level with technical issues and problem investigation Merchant Technical Services Engineer PayPal June 2013  – Present (2 years 3 months) Chandler, AZ Interface with merchants through telephone, e-ticket and social media support systems to resolve technical issues in the functioning or implementation of PayPal payment solutions. Address executive escalations regarding high level merchants who are encountering high visibility technical issues. Work with SMB merchants to review their current web solutions and API errors to put together a program to leverage PayPal systems to increase web site revenue and provide the best customer experience. Train and mentor other engineers on a local, national and global level with technical issues and problem investigation Server Operations/EBaR Support CompuCom November 2012  –  June 2013  (8 months) Chandler, AZ Perform server operations tasks including but not limited to server builds using Altiris, server decommissioning, on call server support for 24/7 coverage for IT supported servers in Chandler and Ocotillo sites. Also responsible for Electronic Backup and Recovery (EBaR) support including tape maintenance , troubleshooting and investigation. Responsible for cataloging and inventory of DLT tapes for Chandler main campus backups. Server Operations/EBaR Support CompuCom November 2012  –  June 2013  (8 months) Chandler, AZ Perform server operations tasks including but not limited to server builds using Altiris, server decommissioning, on call server support for 24/7 coverage for IT supported servers in Chandler and Ocotillo sites. Also responsible for Electronic Backup and Recovery (EBaR) support including tape maintenance , troubleshooting and investigation. Responsible for cataloging and inventory of DLT tapes for Chandler main campus backups. Senior Systems/Database Engineer/IT Helpdesk Manager Loan Resolution Corp August 2009  –  October 2012  (3 years 3 months) Performed database administration duties, Windows Server Management, Active Directory Administration, Group Policy Administration, Web server administration and release management supervision. Successfully prepared the IT department in the auditing preparation for a SAS70 type two certification. Performed server backups, restores, archiving and workstation preparation on a companywide level. Implementation of a help desk ticketing/tracking system. Creation of monthly state of the IT department reports deliverable to the President of the corporation. Senior Systems/Database Engineer/IT Helpdesk Manager Loan Resolution Corp August 2009  –  October 2012  (3 years 3 months) Performed database administration duties, Windows Server Management, Active Directory Administration, Group Policy Administration, Web server administration and release management supervision. Successfully prepared the IT department in the auditing preparation for a SAS70 type two certification. Performed server backups, restores, archiving and workstation preparation on a companywide level. Implementation of a help desk ticketing/tracking system. Creation of monthly state of the IT department reports deliverable to the President of the corporation. Middleware Software Engineer Intel Corporation June 2007  –  May 2009  (2 years) Performed third level software technical support for three (3) manufacturing factories. Researched, programmed, developed, documented, tested and proliferated troubleshooting systems, procedures and scripts on a worldwide factory level. Cross-trained Automation and support engineers in Middleware systems. Headed up the project management of companywide change control management program roll out. Consulted with worldwide factory representatives as a liaison for changes regarding the new change management program. Maintained Middleware systems across 30+ servers and 300+ workstations. Attended worldwide meetings to exchange guidelines and best known resolutions to all factories. Managed day to day operations within the Middleware team environment. Middleware Software Engineer Intel Corporation June 2007  –  May 2009  (2 years) Performed third level software technical support for three (3) manufacturing factories. Researched, programmed, developed, documented, tested and proliferated troubleshooting systems, procedures and scripts on a worldwide factory level. Cross-trained Automation and support engineers in Middleware systems. Headed up the project management of companywide change control management program roll out. Consulted with worldwide factory representatives as a liaison for changes regarding the new change management program. Maintained Middleware systems across 30+ servers and 300+ workstations. Attended worldwide meetings to exchange guidelines and best known resolutions to all factories. Managed day to day operations within the Middleware team environment. Information Systems Software Engineer Intel Corporation June 2006  –  June 2007  (1 year 1 month) Developed, owned, troubleshot, upgraded and documented Automation owned web pages used in 3 manufacturing factories on a 24/7 basis. Consulted with customers regarding customer needs and impromptu report generation. Performed SQL database management tasks such as user and role administration, database upgrades, and database backups. Performed server security management such as user role and file share administration. Information Systems Software Engineer Intel Corporation June 2006  –  June 2007  (1 year 1 month) Developed, owned, troubleshot, upgraded and documented Automation owned web pages used in 3 manufacturing factories on a 24/7 basis. Consulted with customers regarding customer needs and impromptu report generation. Performed SQL database management tasks such as user and role administration, database upgrades, and database backups. Performed server security management such as user role and file share administration. Global Automation Support Automation Engineer Intel Corporation June 2000  –  June 2006  (6 years 1 month) Performed VAX/VMS account creations. Developed software macros for the automated creation of VMS/VAX accounts. Provided first and second level support for factory automation products including VAX/VMS. Performed Windows NT/2000 server administration as well as SQL database administration. Owned and trained support center backup solution, Altiris. Created, distributed and updated system backup images for all support center maintained systems. Conducted training programs and managed front end day shift day to day operations. Global Automation Support Automation Engineer Intel Corporation June 2000  –  June 2006  (6 years 1 month) Performed VAX/VMS account creations. Developed software macros for the automated creation of VMS/VAX accounts. Provided first and second level support for factory automation products including VAX/VMS. Performed Windows NT/2000 server administration as well as SQL database administration. Owned and trained support center backup solution, Altiris. Created, distributed and updated system backup images for all support center maintained systems. Conducted training programs and managed front end day shift day to day operations. Engineering Technician Intel Corporation June 1997  –  June 2000  (3 years 1 month) Built, maintained, administrated and supported 17 Windows NT servers on two domains including one NT cluster server, 140 station controllers in manufacturing factory, and 30 shared PC's throughout manufacturing factory. Developed software applications for use in manufacturing factory. Performed database administration using SQL 6.0, 6.5 and 7.0 as well as Access '97/2000. Managed daily operations of Automation support technicians. Engineering Technician Intel Corporation June 1997  –  June 2000  (3 years 1 month) Built, maintained, administrated and supported 17 Windows NT servers on two domains including one NT cluster server, 140 station controllers in manufacturing factory, and 30 shared PC's throughout manufacturing factory. Developed software applications for use in manufacturing factory. Performed database administration using SQL 6.0, 6.5 and 7.0 as well as Access '97/2000. Managed daily operations of Automation support technicians. Manufacturing technician Intel Corporation May 1993  –  June 1997  (4 years 2 months) in Photo-Lithography area, created weekly reports reflecting Lithography issues and equipment issues. Interfaced with area engineers to ensure resolution of machine issues and to facilitate the production schedule. Trained junior technicians in the operation and maintenance of Photo-lithography equipment Manufacturing technician Intel Corporation May 1993  –  June 1997  (4 years 2 months) in Photo-Lithography area, created weekly reports reflecting Lithography issues and equipment issues. Interfaced with area engineers to ensure resolution of machine issues and to facilitate the production schedule. Trained junior technicians in the operation and maintenance of Photo-lithography equipment Skills Microsoft SQL Server JavaScript Web Development Call Center Strategic Planning Perl Outlook Negotiation Unix Windows SQL Testing Databases Debugging Linux Shell Scripting Sales C++ Customer Service SDLC Microsoft Office On-call Support VMS VAX IIS Altiris Five9 Auditing SSAE 16 SAS70 Iso 9000 helpdesk Troubleshooting Microsoft Exchange Technical Support Call Centers Help Desk Support ISO 9000 Servers See 24+     See less Skills  Microsoft SQL Server JavaScript Web Development Call Center Strategic Planning Perl Outlook Negotiation Unix Windows SQL Testing Databases Debugging Linux Shell Scripting Sales C++ Customer Service SDLC Microsoft Office On-call Support VMS VAX IIS Altiris Five9 Auditing SSAE 16 SAS70 Iso 9000 helpdesk Troubleshooting Microsoft Exchange Technical Support Call Centers Help Desk Support ISO 9000 Servers See 24+     See less Microsoft SQL Server JavaScript Web Development Call Center Strategic Planning Perl Outlook Negotiation Unix Windows SQL Testing Databases Debugging Linux Shell Scripting Sales C++ Customer Service SDLC Microsoft Office On-call Support VMS VAX IIS Altiris Five9 Auditing SSAE 16 SAS70 Iso 9000 helpdesk Troubleshooting Microsoft Exchange Technical Support Call Centers Help Desk Support ISO 9000 Servers See 24+     See less Microsoft SQL Server JavaScript Web Development Call Center Strategic Planning Perl Outlook Negotiation Unix Windows SQL Testing Databases Debugging Linux Shell Scripting Sales C++ Customer Service SDLC Microsoft Office On-call Support VMS VAX IIS Altiris Five9 Auditing SSAE 16 SAS70 Iso 9000 helpdesk Troubleshooting Microsoft Exchange Technical Support Call Centers Help Desk Support ISO 9000 Servers See 24+     See less Education Arizona State University BS,  Psychology 1993  – 1995 Mesa Community College AAS,  Psychology 1990  – 1993 Arizona State University BS,  Psychology 1993  – 1995 Arizona State University BS,  Psychology 1993  – 1995 Arizona State University BS,  Psychology 1993  – 1995 Mesa Community College AAS,  Psychology 1990  – 1993 Mesa Community College AAS,  Psychology 1990  – 1993 Mesa Community College AAS,  Psychology 1990  – 1993 ", "Experience Systems Software Engineer Intel Corporation October 2014  – Present (11 months) Portland, Oregon Area Software Developer KAKAO March 2014  –  September 2014  (7 months) Seoul, Korea Server-side Research Assistant Accenture October 2013  –  January 2014  (4 months) Seoul, Korea Systems Software Intern NVIDIA May 2012  –  August 2012  (4 months) Santa Clara, CA CUDA Driver Research Student Carnegie Mellon University April 2011  –  December 2011  (9 months) Systems Software Engineer Intel Corporation October 2014  – Present (11 months) Portland, Oregon Area Systems Software Engineer Intel Corporation October 2014  – Present (11 months) Portland, Oregon Area Software Developer KAKAO March 2014  –  September 2014  (7 months) Seoul, Korea Server-side Software Developer KAKAO March 2014  –  September 2014  (7 months) Seoul, Korea Server-side Research Assistant Accenture October 2013  –  January 2014  (4 months) Seoul, Korea Research Assistant Accenture October 2013  –  January 2014  (4 months) Seoul, Korea Systems Software Intern NVIDIA May 2012  –  August 2012  (4 months) Santa Clara, CA CUDA Driver Systems Software Intern NVIDIA May 2012  –  August 2012  (4 months) Santa Clara, CA CUDA Driver Research Student Carnegie Mellon University April 2011  –  December 2011  (9 months) Research Student Carnegie Mellon University April 2011  –  December 2011  (9 months) Skills C Java Ruby Python C++ ARM assembly MIPS assembly x86 Assembly Verilog Matlab Simics Git Subversion Computer Architecture Embedded Systems Operating Systems Ruby on Rails Spring Framework Play Framework MySQL See 5+     See less Skills  C Java Ruby Python C++ ARM assembly MIPS assembly x86 Assembly Verilog Matlab Simics Git Subversion Computer Architecture Embedded Systems Operating Systems Ruby on Rails Spring Framework Play Framework MySQL See 5+     See less C Java Ruby Python C++ ARM assembly MIPS assembly x86 Assembly Verilog Matlab Simics Git Subversion Computer Architecture Embedded Systems Operating Systems Ruby on Rails Spring Framework Play Framework MySQL See 5+     See less C Java Ruby Python C++ ARM assembly MIPS assembly x86 Assembly Verilog Matlab Simics Git Subversion Computer Architecture Embedded Systems Operating Systems Ruby on Rails Spring Framework Play Framework MySQL See 5+     See less Education Carnegie Mellon University Master of Science; Bachelor of Science,  Electrical and Computer Engineering; Electrical and Computer Engineering 2006  – 2012 Worcester Academy 2003  – 2006 Carnegie Mellon University Master of Science; Bachelor of Science,  Electrical and Computer Engineering; Electrical and Computer Engineering 2006  – 2012 Carnegie Mellon University Master of Science; Bachelor of Science,  Electrical and Computer Engineering; Electrical and Computer Engineering 2006  – 2012 Carnegie Mellon University Master of Science; Bachelor of Science,  Electrical and Computer Engineering; Electrical and Computer Engineering 2006  – 2012 Worcester Academy 2003  – 2006 Worcester Academy 2003  – 2006 Worcester Academy 2003  – 2006 Honors & Awards Dean’s List Carnegie Institute of Technology Fall 2011 Dean’s List Carnegie Institute of Technology Fall 2011 Dean’s List Carnegie Institute of Technology Fall 2011 Dean’s List Carnegie Institute of Technology Fall 2011 ", "Summary Experienced in Embedded System SW & HW Design, including BSP, Driver stacks and HW Interfacing. Successful track record implementing Consumer Electronic Embedded SW stacks on various platforms and driving production quality and performance conscious in all design aspects.Have an extensive portfolio of Linux and Windows Kernel Drivers development, and platform bring up. Enjoy designing embedded systems from scratch and bringing them to life and optimizing code and developing post analysis tools. Summary Experienced in Embedded System SW & HW Design, including BSP, Driver stacks and HW Interfacing. Successful track record implementing Consumer Electronic Embedded SW stacks on various platforms and driving production quality and performance conscious in all design aspects.Have an extensive portfolio of Linux and Windows Kernel Drivers development, and platform bring up. Enjoy designing embedded systems from scratch and bringing them to life and optimizing code and developing post analysis tools. Experienced in Embedded System SW & HW Design, including BSP, Driver stacks and HW Interfacing. Successful track record implementing Consumer Electronic Embedded SW stacks on various platforms and driving production quality and performance conscious in all design aspects.Have an extensive portfolio of Linux and Windows Kernel Drivers development, and platform bring up. Enjoy designing embedded systems from scratch and bringing them to life and optimizing code and developing post analysis tools. Experienced in Embedded System SW & HW Design, including BSP, Driver stacks and HW Interfacing. Successful track record implementing Consumer Electronic Embedded SW stacks on various platforms and driving production quality and performance conscious in all design aspects.Have an extensive portfolio of Linux and Windows Kernel Drivers development, and platform bring up. Enjoy designing embedded systems from scratch and bringing them to life and optimizing code and developing post analysis tools. Skills Linux Kernel USB Embedded Linux System SW Device Drivers Embedded Software ARM RTOS SoC I2C Kernel Android Processors SPI Qt JTAG Windows Programming See 2+     See less Skills  Linux Kernel USB Embedded Linux System SW Device Drivers Embedded Software ARM RTOS SoC I2C Kernel Android Processors SPI Qt JTAG Windows Programming See 2+     See less Linux Kernel USB Embedded Linux System SW Device Drivers Embedded Software ARM RTOS SoC I2C Kernel Android Processors SPI Qt JTAG Windows Programming See 2+     See less Linux Kernel USB Embedded Linux System SW Device Drivers Embedded Software ARM RTOS SoC I2C Kernel Android Processors SPI Qt JTAG Windows Programming See 2+     See less ", "Summary Experienced electrical engineer with over sixteen years of industry experience currently working on Renewable Energy related products at Intel. \n \nIn addition to holding a BS in Electronics Engineering, I recently graduated from Oregon Institute of Technology with a second Bachelors Degree in Renewable Energy Engineering. OIT is the only accredited institution in the country offering Bachelors and Masters programs in this advanced curriculum of energy system analysis and design; including energy efficient buildings and power systems such as solar thermal, PV, wind, geothermal, hydro-power and fuel cells. \n \nI have an extensive background in many diverse disciplines of electrical engineering and data networking. A solid ‘hands-on’ background in both Field and Test Engineering followed by extensive experience in product development gives me a distinct advantage in designing innovative solutions to modern energy system problems. As a successful first-time entrepreneur, I was responsible for the ground-up design, build-out and daily operations of the Portland area Internet Service Provider DSL-Only. \n \nThese experiences led to over 10 years of private consulting in system architecture and design engineering at leading consulting firms - giving me valuable experience in customer-facing engineering roles. Summary Experienced electrical engineer with over sixteen years of industry experience currently working on Renewable Energy related products at Intel. \n \nIn addition to holding a BS in Electronics Engineering, I recently graduated from Oregon Institute of Technology with a second Bachelors Degree in Renewable Energy Engineering. OIT is the only accredited institution in the country offering Bachelors and Masters programs in this advanced curriculum of energy system analysis and design; including energy efficient buildings and power systems such as solar thermal, PV, wind, geothermal, hydro-power and fuel cells. \n \nI have an extensive background in many diverse disciplines of electrical engineering and data networking. A solid ‘hands-on’ background in both Field and Test Engineering followed by extensive experience in product development gives me a distinct advantage in designing innovative solutions to modern energy system problems. As a successful first-time entrepreneur, I was responsible for the ground-up design, build-out and daily operations of the Portland area Internet Service Provider DSL-Only. \n \nThese experiences led to over 10 years of private consulting in system architecture and design engineering at leading consulting firms - giving me valuable experience in customer-facing engineering roles. Experienced electrical engineer with over sixteen years of industry experience currently working on Renewable Energy related products at Intel. \n \nIn addition to holding a BS in Electronics Engineering, I recently graduated from Oregon Institute of Technology with a second Bachelors Degree in Renewable Energy Engineering. OIT is the only accredited institution in the country offering Bachelors and Masters programs in this advanced curriculum of energy system analysis and design; including energy efficient buildings and power systems such as solar thermal, PV, wind, geothermal, hydro-power and fuel cells. \n \nI have an extensive background in many diverse disciplines of electrical engineering and data networking. A solid ‘hands-on’ background in both Field and Test Engineering followed by extensive experience in product development gives me a distinct advantage in designing innovative solutions to modern energy system problems. As a successful first-time entrepreneur, I was responsible for the ground-up design, build-out and daily operations of the Portland area Internet Service Provider DSL-Only. \n \nThese experiences led to over 10 years of private consulting in system architecture and design engineering at leading consulting firms - giving me valuable experience in customer-facing engineering roles. Experienced electrical engineer with over sixteen years of industry experience currently working on Renewable Energy related products at Intel. \n \nIn addition to holding a BS in Electronics Engineering, I recently graduated from Oregon Institute of Technology with a second Bachelors Degree in Renewable Energy Engineering. OIT is the only accredited institution in the country offering Bachelors and Masters programs in this advanced curriculum of energy system analysis and design; including energy efficient buildings and power systems such as solar thermal, PV, wind, geothermal, hydro-power and fuel cells. \n \nI have an extensive background in many diverse disciplines of electrical engineering and data networking. A solid ‘hands-on’ background in both Field and Test Engineering followed by extensive experience in product development gives me a distinct advantage in designing innovative solutions to modern energy system problems. As a successful first-time entrepreneur, I was responsible for the ground-up design, build-out and daily operations of the Portland area Internet Service Provider DSL-Only. \n \nThese experiences led to over 10 years of private consulting in system architecture and design engineering at leading consulting firms - giving me valuable experience in customer-facing engineering roles. Experience Hardware, Systems & Software Engineer Intel Corporation November 2013  – Present (1 year 10 months) (via Advanced Technology Resources) IOT - Internet of Things Group \nHaving moved our Energy Analytics technology to the IOT product group, we are now developing and productizing our sensor products for use in HVAC and other applications. Hardware Engineer Intel Labs May 2013  –  November 2013  (7 months) (via Advanced Technology Resources, Inc.) Developing Energy Monitoring and Cloud Analytics technology for use on AC Load and power systems. Technical Marketing Engineer Intel Corporation April 2013  –  May 2013  (2 months) (via MindTeck) Designing and coding a project to demonstrate Renewable Energy resources to Data Center power systems Project Manager US Army Corps of Engineers December 2012  –  April 2013  (5 months) (via Ensoftek) in Portland, OR Electronics Engineer III Bonneville Power Administration August 2011  –  July 2012  (1 year) (via David Evans & Assoc.) BPA Control Center in Vancouver, WA Design, implement and improve computer and telecommunications projects for Bonneville Power Administration, a division of the US Dept. of Energy and the Pacific Northwest Regional Balancing Authority for the US power grid. Programmer Analyst CenturyLink April 2011  –  August 2011  (5 months) Vancouver, WA Analyzed data and communications errors for DSLAM, switch and network device management. Developed methods and processes for mitigating and controlling ongoing issues. Network & Systems Engineer Fullscope August 2007  –  October 2008  (1 year 3 months) Architected, implemented & maintained Microsoft Dynamics AX Enterprise Resource Planning (ERP) software, network and server systems for clients. Developed software and maintained SQL and other server back-ends. \nExtensive use of Virtual Machines to develop, test and simulate multi-server/multi-site enterprise infrastructures.  \nDeveloped company wide server infrastructure for all business systems including email, FTP, and VPN. Network Engineer and Application Developer Qwest at Microsoft February 2007  –  June 2007  (5 months) Built tools in C#, SQL and PERL to monitor performance of Microsoft's Global WAN networks. Staff Consultant, Network & Broadband Systems RBA International 2002  –  2006  (4 years) Vancouver, WA Chief duty was client problem analysis and system solution design based on current computer and communication technologies. Extensive experience in network engineering, computer hardware, software, servers and web services allowed me to provide innovative cutting edge solutions for both new and existing systems. Designed and provisioned Internet/Data/Voice/VOIP services using modern broadband and wireless technologies. \nLight development in HTML, C# .NET, ASP, Java, & JSP. Full administration of MS/Active Directory and Linux server systems. Well versed in servers & PCs system builds using Intel Architecture & RAID (FC, SATA, SCSI). \nDesigned a large scale production Wi-Fi® provisioning/management system for a local WISP based on RADIUS, Linux, Apache/Tomcat, JSP, Java Servlets, SOAP/Webservices. Implemented radios, app and network solutions. \nDesigned and implemented a multi-site (with collocation in secure host site) routed voice/data TCP/IP network over T1/DS3 links on Cisco hardware. Included VOIP servers, client/server apps, and VPNs. \nAssisted in development of a multi-tier Java based Web Application (Apache Struts) for a medical card company and helped develop a VB/SQL medical database access application using SQL, C# .NET and Win Forms. Technical Marketing Engineer Intel Corporation 1999  –  2001  (2 years) Broadband Access Operation \nCore role in product development cycle as the direct Marketing/R&D liaison to engineering teams. Primary technical interface for marketing organization to product development teams for Intel's home networking equipment. Products included Ethernet switches, DSL, Wi-Fi, & HPNA in PCI, USB, & Ethernet Residential Gateway (using embedded Red Hat Linux) form factors. \nDesigned & built the Technical Marketing Labs, including end-to-end ATM & IP networks. (DSLAMs, Routers, EtherSwitches, Win2K/AD PCs/Servers, & data/electrical infrastructures). Created detailed competitive analysis of DSL & Cable products for marketing team and product feedback to engineering, including testing/evaluating beta and competitor units to improve product design. \nPrimary technical resource for worldwide sales engagements for broadband CPE. Wrote technical white papers, conducted in-depth test and evaluation of hardware and software. Technical interface for customer issue resolution. \nProvided worldwide tradeshow support for the organization including design, implementation, setup, teardown, and live demonstrations of DSL and Wi-Fi networking products. \nEngaged with networking standards bodies (DSL Forum, Wi-Fi Alliance, WiMAX Forum, IEEE, ITU, ETSI) to maintaining working technical knowledge and promote Intel's interests and objectives in the networking arena. President, CEO & Chief Architect DSL Only, Inc 1998  –  1999  (1 year) Portland, Oregon Area Developed and executed a business plan for a local Internet Service Provider specializing in Asymmetric Digital Subscriber Lines. (ADSL) Built a customer base of ~2000 users in 2 years. Sold company in 2001 at >3500 users. \nDesigned and implemented the ISP's Frame Relay, ATM, and IP networks from the ground up. This included user services such as POP3/IMAP, SMTP, DNS, WINS, SQL, Web and FTP servers on WinNT 4.0. \nProvided Customer Care & Technical Support services for ADSL and ATM/Frame services. Test Integration Engineer Intel Corporation 1995  –  1998  (3 years) Participated in Intel design cycle for Intel Processors, Motherboards, and Systems. \nInterfaced with Design, BIOS, and Product Engineering teams to solve technical issues. \nCreated tests, processes and sequences for use in end-of-line board and system manufacturing. Hardware, Systems & Software Engineer Intel Corporation November 2013  – Present (1 year 10 months) (via Advanced Technology Resources) IOT - Internet of Things Group \nHaving moved our Energy Analytics technology to the IOT product group, we are now developing and productizing our sensor products for use in HVAC and other applications. Hardware, Systems & Software Engineer Intel Corporation November 2013  – Present (1 year 10 months) (via Advanced Technology Resources) IOT - Internet of Things Group \nHaving moved our Energy Analytics technology to the IOT product group, we are now developing and productizing our sensor products for use in HVAC and other applications. Hardware Engineer Intel Labs May 2013  –  November 2013  (7 months) (via Advanced Technology Resources, Inc.) Developing Energy Monitoring and Cloud Analytics technology for use on AC Load and power systems. Hardware Engineer Intel Labs May 2013  –  November 2013  (7 months) (via Advanced Technology Resources, Inc.) Developing Energy Monitoring and Cloud Analytics technology for use on AC Load and power systems. Technical Marketing Engineer Intel Corporation April 2013  –  May 2013  (2 months) (via MindTeck) Designing and coding a project to demonstrate Renewable Energy resources to Data Center power systems Technical Marketing Engineer Intel Corporation April 2013  –  May 2013  (2 months) (via MindTeck) Designing and coding a project to demonstrate Renewable Energy resources to Data Center power systems Project Manager US Army Corps of Engineers December 2012  –  April 2013  (5 months) (via Ensoftek) in Portland, OR Project Manager US Army Corps of Engineers December 2012  –  April 2013  (5 months) (via Ensoftek) in Portland, OR Electronics Engineer III Bonneville Power Administration August 2011  –  July 2012  (1 year) (via David Evans & Assoc.) BPA Control Center in Vancouver, WA Design, implement and improve computer and telecommunications projects for Bonneville Power Administration, a division of the US Dept. of Energy and the Pacific Northwest Regional Balancing Authority for the US power grid. Electronics Engineer III Bonneville Power Administration August 2011  –  July 2012  (1 year) (via David Evans & Assoc.) BPA Control Center in Vancouver, WA Design, implement and improve computer and telecommunications projects for Bonneville Power Administration, a division of the US Dept. of Energy and the Pacific Northwest Regional Balancing Authority for the US power grid. Programmer Analyst CenturyLink April 2011  –  August 2011  (5 months) Vancouver, WA Analyzed data and communications errors for DSLAM, switch and network device management. Developed methods and processes for mitigating and controlling ongoing issues. Programmer Analyst CenturyLink April 2011  –  August 2011  (5 months) Vancouver, WA Analyzed data and communications errors for DSLAM, switch and network device management. Developed methods and processes for mitigating and controlling ongoing issues. Network & Systems Engineer Fullscope August 2007  –  October 2008  (1 year 3 months) Architected, implemented & maintained Microsoft Dynamics AX Enterprise Resource Planning (ERP) software, network and server systems for clients. Developed software and maintained SQL and other server back-ends. \nExtensive use of Virtual Machines to develop, test and simulate multi-server/multi-site enterprise infrastructures.  \nDeveloped company wide server infrastructure for all business systems including email, FTP, and VPN. Network & Systems Engineer Fullscope August 2007  –  October 2008  (1 year 3 months) Architected, implemented & maintained Microsoft Dynamics AX Enterprise Resource Planning (ERP) software, network and server systems for clients. Developed software and maintained SQL and other server back-ends. \nExtensive use of Virtual Machines to develop, test and simulate multi-server/multi-site enterprise infrastructures.  \nDeveloped company wide server infrastructure for all business systems including email, FTP, and VPN. Network Engineer and Application Developer Qwest at Microsoft February 2007  –  June 2007  (5 months) Built tools in C#, SQL and PERL to monitor performance of Microsoft's Global WAN networks. Network Engineer and Application Developer Qwest at Microsoft February 2007  –  June 2007  (5 months) Built tools in C#, SQL and PERL to monitor performance of Microsoft's Global WAN networks. Staff Consultant, Network & Broadband Systems RBA International 2002  –  2006  (4 years) Vancouver, WA Chief duty was client problem analysis and system solution design based on current computer and communication technologies. Extensive experience in network engineering, computer hardware, software, servers and web services allowed me to provide innovative cutting edge solutions for both new and existing systems. Designed and provisioned Internet/Data/Voice/VOIP services using modern broadband and wireless technologies. \nLight development in HTML, C# .NET, ASP, Java, & JSP. Full administration of MS/Active Directory and Linux server systems. Well versed in servers & PCs system builds using Intel Architecture & RAID (FC, SATA, SCSI). \nDesigned a large scale production Wi-Fi® provisioning/management system for a local WISP based on RADIUS, Linux, Apache/Tomcat, JSP, Java Servlets, SOAP/Webservices. Implemented radios, app and network solutions. \nDesigned and implemented a multi-site (with collocation in secure host site) routed voice/data TCP/IP network over T1/DS3 links on Cisco hardware. Included VOIP servers, client/server apps, and VPNs. \nAssisted in development of a multi-tier Java based Web Application (Apache Struts) for a medical card company and helped develop a VB/SQL medical database access application using SQL, C# .NET and Win Forms. Staff Consultant, Network & Broadband Systems RBA International 2002  –  2006  (4 years) Vancouver, WA Chief duty was client problem analysis and system solution design based on current computer and communication technologies. Extensive experience in network engineering, computer hardware, software, servers and web services allowed me to provide innovative cutting edge solutions for both new and existing systems. Designed and provisioned Internet/Data/Voice/VOIP services using modern broadband and wireless technologies. \nLight development in HTML, C# .NET, ASP, Java, & JSP. Full administration of MS/Active Directory and Linux server systems. Well versed in servers & PCs system builds using Intel Architecture & RAID (FC, SATA, SCSI). \nDesigned a large scale production Wi-Fi® provisioning/management system for a local WISP based on RADIUS, Linux, Apache/Tomcat, JSP, Java Servlets, SOAP/Webservices. Implemented radios, app and network solutions. \nDesigned and implemented a multi-site (with collocation in secure host site) routed voice/data TCP/IP network over T1/DS3 links on Cisco hardware. Included VOIP servers, client/server apps, and VPNs. \nAssisted in development of a multi-tier Java based Web Application (Apache Struts) for a medical card company and helped develop a VB/SQL medical database access application using SQL, C# .NET and Win Forms. Technical Marketing Engineer Intel Corporation 1999  –  2001  (2 years) Broadband Access Operation \nCore role in product development cycle as the direct Marketing/R&D liaison to engineering teams. Primary technical interface for marketing organization to product development teams for Intel's home networking equipment. Products included Ethernet switches, DSL, Wi-Fi, & HPNA in PCI, USB, & Ethernet Residential Gateway (using embedded Red Hat Linux) form factors. \nDesigned & built the Technical Marketing Labs, including end-to-end ATM & IP networks. (DSLAMs, Routers, EtherSwitches, Win2K/AD PCs/Servers, & data/electrical infrastructures). Created detailed competitive analysis of DSL & Cable products for marketing team and product feedback to engineering, including testing/evaluating beta and competitor units to improve product design. \nPrimary technical resource for worldwide sales engagements for broadband CPE. Wrote technical white papers, conducted in-depth test and evaluation of hardware and software. Technical interface for customer issue resolution. \nProvided worldwide tradeshow support for the organization including design, implementation, setup, teardown, and live demonstrations of DSL and Wi-Fi networking products. \nEngaged with networking standards bodies (DSL Forum, Wi-Fi Alliance, WiMAX Forum, IEEE, ITU, ETSI) to maintaining working technical knowledge and promote Intel's interests and objectives in the networking arena. Technical Marketing Engineer Intel Corporation 1999  –  2001  (2 years) Broadband Access Operation \nCore role in product development cycle as the direct Marketing/R&D liaison to engineering teams. Primary technical interface for marketing organization to product development teams for Intel's home networking equipment. Products included Ethernet switches, DSL, Wi-Fi, & HPNA in PCI, USB, & Ethernet Residential Gateway (using embedded Red Hat Linux) form factors. \nDesigned & built the Technical Marketing Labs, including end-to-end ATM & IP networks. (DSLAMs, Routers, EtherSwitches, Win2K/AD PCs/Servers, & data/electrical infrastructures). Created detailed competitive analysis of DSL & Cable products for marketing team and product feedback to engineering, including testing/evaluating beta and competitor units to improve product design. \nPrimary technical resource for worldwide sales engagements for broadband CPE. Wrote technical white papers, conducted in-depth test and evaluation of hardware and software. Technical interface for customer issue resolution. \nProvided worldwide tradeshow support for the organization including design, implementation, setup, teardown, and live demonstrations of DSL and Wi-Fi networking products. \nEngaged with networking standards bodies (DSL Forum, Wi-Fi Alliance, WiMAX Forum, IEEE, ITU, ETSI) to maintaining working technical knowledge and promote Intel's interests and objectives in the networking arena. President, CEO & Chief Architect DSL Only, Inc 1998  –  1999  (1 year) Portland, Oregon Area Developed and executed a business plan for a local Internet Service Provider specializing in Asymmetric Digital Subscriber Lines. (ADSL) Built a customer base of ~2000 users in 2 years. Sold company in 2001 at >3500 users. \nDesigned and implemented the ISP's Frame Relay, ATM, and IP networks from the ground up. This included user services such as POP3/IMAP, SMTP, DNS, WINS, SQL, Web and FTP servers on WinNT 4.0. \nProvided Customer Care & Technical Support services for ADSL and ATM/Frame services. President, CEO & Chief Architect DSL Only, Inc 1998  –  1999  (1 year) Portland, Oregon Area Developed and executed a business plan for a local Internet Service Provider specializing in Asymmetric Digital Subscriber Lines. (ADSL) Built a customer base of ~2000 users in 2 years. Sold company in 2001 at >3500 users. \nDesigned and implemented the ISP's Frame Relay, ATM, and IP networks from the ground up. This included user services such as POP3/IMAP, SMTP, DNS, WINS, SQL, Web and FTP servers on WinNT 4.0. \nProvided Customer Care & Technical Support services for ADSL and ATM/Frame services. Test Integration Engineer Intel Corporation 1995  –  1998  (3 years) Participated in Intel design cycle for Intel Processors, Motherboards, and Systems. \nInterfaced with Design, BIOS, and Product Engineering teams to solve technical issues. \nCreated tests, processes and sequences for use in end-of-line board and system manufacturing. Test Integration Engineer Intel Corporation 1995  –  1998  (3 years) Participated in Intel design cycle for Intel Processors, Motherboards, and Systems. \nInterfaced with Design, BIOS, and Product Engineering teams to solve technical issues. \nCreated tests, processes and sequences for use in end-of-line board and system manufacturing. Skills Electrical Engineering Renewable Energy Electronics Power Electronics Power Transmission Telecommunications Network Engineering Systems Engineering Systems Analysis Technical Communication Cisco Linux Windows Active Directory AutoCAD Visio Databases Cisco Technologies Hardware Integration Embedded Systems Networking Computer Hardware Solar Energy Servers SQL Wind Energy Efficiency Power Systems Photovoltaics TCP/IP Java Power Distribution Energy Management Energy Audits Energy Programming Enterprise Software System Architecture SCADA Solar Thermal Control Systems Design C# Software Development Technical Writing Fuel Cells Solar Power Wind Power See 33+     See less Skills  Electrical Engineering Renewable Energy Electronics Power Electronics Power Transmission Telecommunications Network Engineering Systems Engineering Systems Analysis Technical Communication Cisco Linux Windows Active Directory AutoCAD Visio Databases Cisco Technologies Hardware Integration Embedded Systems Networking Computer Hardware Solar Energy Servers SQL Wind Energy Efficiency Power Systems Photovoltaics TCP/IP Java Power Distribution Energy Management Energy Audits Energy Programming Enterprise Software System Architecture SCADA Solar Thermal Control Systems Design C# Software Development Technical Writing Fuel Cells Solar Power Wind Power See 33+     See less Electrical Engineering Renewable Energy Electronics Power Electronics Power Transmission Telecommunications Network Engineering Systems Engineering Systems Analysis Technical Communication Cisco Linux Windows Active Directory AutoCAD Visio Databases Cisco Technologies Hardware Integration Embedded Systems Networking Computer Hardware Solar Energy Servers SQL Wind Energy Efficiency Power Systems Photovoltaics TCP/IP Java Power Distribution Energy Management Energy Audits Energy Programming Enterprise Software System Architecture SCADA Solar Thermal Control Systems Design C# Software Development Technical Writing Fuel Cells Solar Power Wind Power See 33+     See less Electrical Engineering Renewable Energy Electronics Power Electronics Power Transmission Telecommunications Network Engineering Systems Engineering Systems Analysis Technical Communication Cisco Linux Windows Active Directory AutoCAD Visio Databases Cisco Technologies Hardware Integration Embedded Systems Networking Computer Hardware Solar Energy Servers SQL Wind Energy Efficiency Power Systems Photovoltaics TCP/IP Java Power Distribution Energy Management Energy Audits Energy Programming Enterprise Software System Architecture SCADA Solar Thermal Control Systems Design C# Software Development Technical Writing Fuel Cells Solar Power Wind Power See 33+     See less Education Oregon Institute of Technology Bachelors of Science,  Renewable Energy Engineering; Energy Engineering 2008  – 2011 Course path leading towards a Masters of Science in Energy Engineering. Senior Project is a data monitoring and logging system for complex hybrid power systems including charge control of multiple charge sources. Oregon Institute of Technology Bachelors of Science,  Electronics Engineering 1989  – 1994 RF and Telecom Senior Course Path \n \nStudied RF & antenna design, analog and digital design, transmission lines, high power, spectrum analyzers, oscilloscopes. Oregon Institute of Technology Bachelors of Science,  Renewable Energy Engineering; Energy Engineering 2008  – 2011 Course path leading towards a Masters of Science in Energy Engineering. Senior Project is a data monitoring and logging system for complex hybrid power systems including charge control of multiple charge sources. Oregon Institute of Technology Bachelors of Science,  Renewable Energy Engineering; Energy Engineering 2008  – 2011 Course path leading towards a Masters of Science in Energy Engineering. Senior Project is a data monitoring and logging system for complex hybrid power systems including charge control of multiple charge sources. Oregon Institute of Technology Bachelors of Science,  Renewable Energy Engineering; Energy Engineering 2008  – 2011 Course path leading towards a Masters of Science in Energy Engineering. Senior Project is a data monitoring and logging system for complex hybrid power systems including charge control of multiple charge sources. Oregon Institute of Technology Bachelors of Science,  Electronics Engineering 1989  – 1994 RF and Telecom Senior Course Path \n \nStudied RF & antenna design, analog and digital design, transmission lines, high power, spectrum analyzers, oscilloscopes. Oregon Institute of Technology Bachelors of Science,  Electronics Engineering 1989  – 1994 RF and Telecom Senior Course Path \n \nStudied RF & antenna design, analog and digital design, transmission lines, high power, spectrum analyzers, oscilloscopes. Oregon Institute of Technology Bachelors of Science,  Electronics Engineering 1989  – 1994 RF and Telecom Senior Course Path \n \nStudied RF & antenna design, analog and digital design, transmission lines, high power, spectrum analyzers, oscilloscopes. ", "Summary Extensive experience in ASIC/FPGA development & verification, implementation of signal/image processing algorithms in hardware and software, and in the design of robust and reliable embedded software for time-critical (real-time) applications. Also experienced in project and general management. Summary Extensive experience in ASIC/FPGA development & verification, implementation of signal/image processing algorithms in hardware and software, and in the design of robust and reliable embedded software for time-critical (real-time) applications. Also experienced in project and general management. Extensive experience in ASIC/FPGA development & verification, implementation of signal/image processing algorithms in hardware and software, and in the design of robust and reliable embedded software for time-critical (real-time) applications. Also experienced in project and general management. Extensive experience in ASIC/FPGA development & verification, implementation of signal/image processing algorithms in hardware and software, and in the design of robust and reliable embedded software for time-critical (real-time) applications. Also experienced in project and general management. Experience Sr. Staff CAE Synopsys December 2012  – Present (2 years 9 months) Hillsboro, Oregon Staff Engineer MIPS Technologies March 2011  –  November 2012  (1 year 9 months) Beaverton, Oregon Systems/Software Engineer Intel Corporation February 2010  –  January 2011  (1 year) Portland, Oregon Area Software/Systems Engineer OpenBlox LLC December 2008  –  January 2010  (1 year 2 months) Portland, Oregon Area ASIC Verification Lead/Architect Ambric, Inc. June 2005  –  November 2008  (3 years 6 months) Portland, Oregon Area Electrical Engineering Manager/Architect Electro Scientifc Industries, Inc. February 2004  –  May 2005  (1 year 4 months) Portland, Oregon Area Hardware Architect/Manager Teseda Corporation June 2001  –  January 2004  (2 years 8 months) Portland, Oregon Area Hardware/Software Engineer/Architect Tektronix August 1997  –  May 2001  (3 years 10 months) Beaverton, Oregon President/CEO Deccan Corporation July 1994  –  July 1997  (3 years 1 month) Hillsboro, Oregon Sr. Staff CAE Synopsys December 2012  – Present (2 years 9 months) Hillsboro, Oregon Sr. Staff CAE Synopsys December 2012  – Present (2 years 9 months) Hillsboro, Oregon Staff Engineer MIPS Technologies March 2011  –  November 2012  (1 year 9 months) Beaverton, Oregon Staff Engineer MIPS Technologies March 2011  –  November 2012  (1 year 9 months) Beaverton, Oregon Systems/Software Engineer Intel Corporation February 2010  –  January 2011  (1 year) Portland, Oregon Area Systems/Software Engineer Intel Corporation February 2010  –  January 2011  (1 year) Portland, Oregon Area Software/Systems Engineer OpenBlox LLC December 2008  –  January 2010  (1 year 2 months) Portland, Oregon Area Software/Systems Engineer OpenBlox LLC December 2008  –  January 2010  (1 year 2 months) Portland, Oregon Area ASIC Verification Lead/Architect Ambric, Inc. June 2005  –  November 2008  (3 years 6 months) Portland, Oregon Area ASIC Verification Lead/Architect Ambric, Inc. June 2005  –  November 2008  (3 years 6 months) Portland, Oregon Area Electrical Engineering Manager/Architect Electro Scientifc Industries, Inc. February 2004  –  May 2005  (1 year 4 months) Portland, Oregon Area Electrical Engineering Manager/Architect Electro Scientifc Industries, Inc. February 2004  –  May 2005  (1 year 4 months) Portland, Oregon Area Hardware Architect/Manager Teseda Corporation June 2001  –  January 2004  (2 years 8 months) Portland, Oregon Area Hardware Architect/Manager Teseda Corporation June 2001  –  January 2004  (2 years 8 months) Portland, Oregon Area Hardware/Software Engineer/Architect Tektronix August 1997  –  May 2001  (3 years 10 months) Beaverton, Oregon Hardware/Software Engineer/Architect Tektronix August 1997  –  May 2001  (3 years 10 months) Beaverton, Oregon President/CEO Deccan Corporation July 1994  –  July 1997  (3 years 1 month) Hillsboro, Oregon President/CEO Deccan Corporation July 1994  –  July 1997  (3 years 1 month) Hillsboro, Oregon Skills Debugging ASIC Verilog FPGA Embedded Software Hardware Architecture Testing PCB design Embedded Systems SystemVerilog Algorithms Digital Signal... Processors C RTL design Semiconductors Perl Open Verification... SoC Software Design Management TCL Python C++ See 9+     See less Skills  Debugging ASIC Verilog FPGA Embedded Software Hardware Architecture Testing PCB design Embedded Systems SystemVerilog Algorithms Digital Signal... Processors C RTL design Semiconductors Perl Open Verification... SoC Software Design Management TCL Python C++ See 9+     See less Debugging ASIC Verilog FPGA Embedded Software Hardware Architecture Testing PCB design Embedded Systems SystemVerilog Algorithms Digital Signal... Processors C RTL design Semiconductors Perl Open Verification... SoC Software Design Management TCL Python C++ See 9+     See less Debugging ASIC Verilog FPGA Embedded Software Hardware Architecture Testing PCB design Embedded Systems SystemVerilog Algorithms Digital Signal... Processors C RTL design Semiconductors Perl Open Verification... SoC Software Design Management TCL Python C++ See 9+     See less Education Oregon Health and Science University MSEE 1994  – 1997 Illinois Institute of Technology BSEE 1977  – 1978 Indian Institute of Technology, Delhi 1975  – 1976 Oregon Health and Science University MSEE 1994  – 1997 Oregon Health and Science University MSEE 1994  – 1997 Oregon Health and Science University MSEE 1994  – 1997 Illinois Institute of Technology BSEE 1977  – 1978 Illinois Institute of Technology BSEE 1977  – 1978 Illinois Institute of Technology BSEE 1977  – 1978 Indian Institute of Technology, Delhi 1975  – 1976 Indian Institute of Technology, Delhi 1975  – 1976 Indian Institute of Technology, Delhi 1975  – 1976 ", "Experience Technical Director Verizon Business / Specialized Services July 2001  – Present (14 years 2 months) Infrastructure Architect XUMA March 2000  –  July 2001  (1 year 5 months) Systems Software Engineer Intel Corporation June 1997  –  March 2000  (2 years 10 months) Technical Director Verizon Business / Specialized Services July 2001  – Present (14 years 2 months) Technical Director Verizon Business / Specialized Services July 2001  – Present (14 years 2 months) Infrastructure Architect XUMA March 2000  –  July 2001  (1 year 5 months) Infrastructure Architect XUMA March 2000  –  July 2001  (1 year 5 months) Systems Software Engineer Intel Corporation June 1997  –  March 2000  (2 years 10 months) Systems Software Engineer Intel Corporation June 1997  –  March 2000  (2 years 10 months) Skills Data Center Unix Security Cloud Computing Virtualization Managed Services SaaS Enterprise Architecture Agile Methodologies Disaster Recovery Professional Services Integration Vendor Management Perl Enterprise Software Solution Selling Linux Unix Shell Scripting IT Strategy Solaris VoIP Telecommunications ITIL Network Security Solution Architecture Cisco Technologies See 11+     See less Skills  Data Center Unix Security Cloud Computing Virtualization Managed Services SaaS Enterprise Architecture Agile Methodologies Disaster Recovery Professional Services Integration Vendor Management Perl Enterprise Software Solution Selling Linux Unix Shell Scripting IT Strategy Solaris VoIP Telecommunications ITIL Network Security Solution Architecture Cisco Technologies See 11+     See less Data Center Unix Security Cloud Computing Virtualization Managed Services SaaS Enterprise Architecture Agile Methodologies Disaster Recovery Professional Services Integration Vendor Management Perl Enterprise Software Solution Selling Linux Unix Shell Scripting IT Strategy Solaris VoIP Telecommunications ITIL Network Security Solution Architecture Cisco Technologies See 11+     See less Data Center Unix Security Cloud Computing Virtualization Managed Services SaaS Enterprise Architecture Agile Methodologies Disaster Recovery Professional Services Integration Vendor Management Perl Enterprise Software Solution Selling Linux Unix Shell Scripting IT Strategy Solaris VoIP Telecommunications ITIL Network Security Solution Architecture Cisco Technologies See 11+     See less ", "Skills Embedded Software Embedded Systems Device Drivers LTE Embedded Linux GSM Bluetooth 3GPP Debugging Android Software Development Mobile Devices WCDMA UMTS Perl Agile Methodologies Software Engineering Linux ARM C Wireless See 6+     See less Skills  Embedded Software Embedded Systems Device Drivers LTE Embedded Linux GSM Bluetooth 3GPP Debugging Android Software Development Mobile Devices WCDMA UMTS Perl Agile Methodologies Software Engineering Linux ARM C Wireless See 6+     See less Embedded Software Embedded Systems Device Drivers LTE Embedded Linux GSM Bluetooth 3GPP Debugging Android Software Development Mobile Devices WCDMA UMTS Perl Agile Methodologies Software Engineering Linux ARM C Wireless See 6+     See less Embedded Software Embedded Systems Device Drivers LTE Embedded Linux GSM Bluetooth 3GPP Debugging Android Software Development Mobile Devices WCDMA UMTS Perl Agile Methodologies Software Engineering Linux ARM C Wireless See 6+     See less ", "Summary Multimedia Frameworks: OpenMAX IL \n \nProficient in C targeting embedded software running on Linux/Windows. \n \nVideo Codecs H.264 (Functional level Understanding) and streaming protocols RTP/RTSP \n \nPorting and Algorithm Optimization of Video Algorithms on DSP architectures VLIW and SIMD, Memory Management, DMA implementation for Codec and Cache Optimization \n \nExtensive experience in programming TI DSP's C6455, DM642, DM6446 and OMAP.  \n \nMultimedia Framework: Gstreamer plugin development Specialties:DSP processor architectures, Video Codec (H.264), Digital Signal Processing and Digital Image processing algorithms Summary Multimedia Frameworks: OpenMAX IL \n \nProficient in C targeting embedded software running on Linux/Windows. \n \nVideo Codecs H.264 (Functional level Understanding) and streaming protocols RTP/RTSP \n \nPorting and Algorithm Optimization of Video Algorithms on DSP architectures VLIW and SIMD, Memory Management, DMA implementation for Codec and Cache Optimization \n \nExtensive experience in programming TI DSP's C6455, DM642, DM6446 and OMAP.  \n \nMultimedia Framework: Gstreamer plugin development Specialties:DSP processor architectures, Video Codec (H.264), Digital Signal Processing and Digital Image processing algorithms Multimedia Frameworks: OpenMAX IL \n \nProficient in C targeting embedded software running on Linux/Windows. \n \nVideo Codecs H.264 (Functional level Understanding) and streaming protocols RTP/RTSP \n \nPorting and Algorithm Optimization of Video Algorithms on DSP architectures VLIW and SIMD, Memory Management, DMA implementation for Codec and Cache Optimization \n \nExtensive experience in programming TI DSP's C6455, DM642, DM6446 and OMAP.  \n \nMultimedia Framework: Gstreamer plugin development Specialties:DSP processor architectures, Video Codec (H.264), Digital Signal Processing and Digital Image processing algorithms Multimedia Frameworks: OpenMAX IL \n \nProficient in C targeting embedded software running on Linux/Windows. \n \nVideo Codecs H.264 (Functional level Understanding) and streaming protocols RTP/RTSP \n \nPorting and Algorithm Optimization of Video Algorithms on DSP architectures VLIW and SIMD, Memory Management, DMA implementation for Codec and Cache Optimization \n \nExtensive experience in programming TI DSP's C6455, DM642, DM6446 and OMAP.  \n \nMultimedia Framework: Gstreamer plugin development Specialties:DSP processor architectures, Video Codec (H.264), Digital Signal Processing and Digital Image processing algorithms Experience Sr. Systems Software Engineer Intel Corporation March 2012  – Present (3 years 6 months) Folsom, California Sr. Software Engineer Larsen & Toubro Infotech December 2009  –  February 2012  (2 years 3 months) San Diego, California Android products: Tablets and Smart Phones \nDevelopment and Integration of Android Library space Multimedia components, OpenMax IL layer, Gstreamer plugin development and Android Multimedia Framework architectures Software Engineer TATA ELXSI July 2007  –  October 2009  (2 years 4 months) Bangalore Development, Porting and Optimization of Video algorithms (H.264, Mpeg-2 Encoder and Decoder) on TI VLIW DSP processors (DM642 and C6455) targetting for Video Conferencing Solutions and SP8.3 SIMD processor from SPI Embedded Engineer eInfochips March 2006  –  June 2007  (1 year 4 months) Ahmedabad, India Development of Multimedia Digital Media Recorder on Linux Operating system and TI DM6446 Davinci platform. Capture Audio and Video using V4l2 driver, Integrate Audio (AAC) and Video (H.264) Encoders and streaming using RTP/RTSP protoco Sr. Systems Software Engineer Intel Corporation March 2012  – Present (3 years 6 months) Folsom, California Sr. Systems Software Engineer Intel Corporation March 2012  – Present (3 years 6 months) Folsom, California Sr. Software Engineer Larsen & Toubro Infotech December 2009  –  February 2012  (2 years 3 months) San Diego, California Android products: Tablets and Smart Phones \nDevelopment and Integration of Android Library space Multimedia components, OpenMax IL layer, Gstreamer plugin development and Android Multimedia Framework architectures Sr. Software Engineer Larsen & Toubro Infotech December 2009  –  February 2012  (2 years 3 months) San Diego, California Android products: Tablets and Smart Phones \nDevelopment and Integration of Android Library space Multimedia components, OpenMax IL layer, Gstreamer plugin development and Android Multimedia Framework architectures Software Engineer TATA ELXSI July 2007  –  October 2009  (2 years 4 months) Bangalore Development, Porting and Optimization of Video algorithms (H.264, Mpeg-2 Encoder and Decoder) on TI VLIW DSP processors (DM642 and C6455) targetting for Video Conferencing Solutions and SP8.3 SIMD processor from SPI Software Engineer TATA ELXSI July 2007  –  October 2009  (2 years 4 months) Bangalore Development, Porting and Optimization of Video algorithms (H.264, Mpeg-2 Encoder and Decoder) on TI VLIW DSP processors (DM642 and C6455) targetting for Video Conferencing Solutions and SP8.3 SIMD processor from SPI Embedded Engineer eInfochips March 2006  –  June 2007  (1 year 4 months) Ahmedabad, India Development of Multimedia Digital Media Recorder on Linux Operating system and TI DM6446 Davinci platform. Capture Audio and Video using V4l2 driver, Integrate Audio (AAC) and Video (H.264) Encoders and streaming using RTP/RTSP protoco Embedded Engineer eInfochips March 2006  –  June 2007  (1 year 4 months) Ahmedabad, India Development of Multimedia Digital Media Recorder on Linux Operating system and TI DM6446 Davinci platform. Capture Audio and Video using V4l2 driver, Integrate Audio (AAC) and Video (H.264) Encoders and streaming using RTP/RTSP protoco Skills Embedded Software DSP H.264 Porting OMAP Digital Signal... Codecs Skills  Embedded Software DSP H.264 Porting OMAP Digital Signal... Codecs Embedded Software DSP H.264 Porting OMAP Digital Signal... Codecs Embedded Software DSP H.264 Porting OMAP Digital Signal... Codecs Education Holy Mary Institute of Technology and Science B.Tech,  Electronics and Communication Engineering 2001  – 2005 Holy Mary Institute of Technology and Science B.Tech,  Electronics and Communication Engineering 2001  – 2005 Holy Mary Institute of Technology and Science B.Tech,  Electronics and Communication Engineering 2001  – 2005 Holy Mary Institute of Technology and Science B.Tech,  Electronics and Communication Engineering 2001  – 2005 ", "Experience Wireless Systems Engineer Qualcomm June 2013  – Present (2 years 3 months) San Diego, CA Graduate Teaching Assistant University of Florida August 2011  –  May 2013  (1 year 10 months) Gainesville, Florida NFC Systems and Software Engineer Intel Corporation May 2012  –  December 2012  (8 months) Portland, Oregon Area Assistant Developer Louisiana DHH - University of New Orleans July 2010  –  April 2011  (10 months) Wireless Systems Engineer Qualcomm June 2013  – Present (2 years 3 months) San Diego, CA Wireless Systems Engineer Qualcomm June 2013  – Present (2 years 3 months) San Diego, CA Graduate Teaching Assistant University of Florida August 2011  –  May 2013  (1 year 10 months) Gainesville, Florida Graduate Teaching Assistant University of Florida August 2011  –  May 2013  (1 year 10 months) Gainesville, Florida NFC Systems and Software Engineer Intel Corporation May 2012  –  December 2012  (8 months) Portland, Oregon Area NFC Systems and Software Engineer Intel Corporation May 2012  –  December 2012  (8 months) Portland, Oregon Area Assistant Developer Louisiana DHH - University of New Orleans July 2010  –  April 2011  (10 months) Assistant Developer Louisiana DHH - University of New Orleans July 2010  –  April 2011  (10 months) Skills Wireless Communications Digital Signal... Software Defined Radio Matlab C++ C Python GNURadio Perl C# PHP MySQL Wireless Software Engineering Embedded Systems VHDL Algorithms Digital Signal... Embedded Software See 4+     See less Skills  Wireless Communications Digital Signal... Software Defined Radio Matlab C++ C Python GNURadio Perl C# PHP MySQL Wireless Software Engineering Embedded Systems VHDL Algorithms Digital Signal... Embedded Software See 4+     See less Wireless Communications Digital Signal... Software Defined Radio Matlab C++ C Python GNURadio Perl C# PHP MySQL Wireless Software Engineering Embedded Systems VHDL Algorithms Digital Signal... Embedded Software See 4+     See less Wireless Communications Digital Signal... Software Defined Radio Matlab C++ C Python GNURadio Perl C# PHP MySQL Wireless Software Engineering Embedded Systems VHDL Algorithms Digital Signal... Embedded Software See 4+     See less Education University of Florida Master of Science (MS),  Electrical Engineering - Signals and Systems 2011  – 2013 Louisiana State University Bachelor of Science (BS),  Computer Engineering 2007  – 2011 University of Florida Master of Science (MS),  Electrical Engineering - Signals and Systems 2011  – 2013 University of Florida Master of Science (MS),  Electrical Engineering - Signals and Systems 2011  – 2013 University of Florida Master of Science (MS),  Electrical Engineering - Signals and Systems 2011  – 2013 Louisiana State University Bachelor of Science (BS),  Computer Engineering 2007  – 2011 Louisiana State University Bachelor of Science (BS),  Computer Engineering 2007  – 2011 Louisiana State University Bachelor of Science (BS),  Computer Engineering 2007  – 2011 ", "Summary * Innovative, versatile, and very experienced executive with a proven ability to manage multimillion-dollar software projects and related teams in high-performance, demanding environments. \n \n* Experienced leader of global teams with a wide range of technical solutions implemented across a variety of platforms (mainframe, mid-range, and distributed) and technologies (JAVA, .NET, ORACLE, SQL Server, VM Ware, HP Quality Center, XCode, N-Tier Distributed development, UNIX, SAS, ASP, AutoLISP, C++, Hadoop -Hive/PIG) \n \n* Extremely strong people/program leader with a reputation for doing the impossible, devising methods to develop and implement effective solutions where others have failed. \n \n* Proven strategist with strengths in analysis, tactical development and implementation across multiple disciplines and functions, streamlining procedures and enhancing productivity.  \n \n* Astute leader and team-builder with track record of quickly increasing motivation, cohesiveness, performance, efficiency, and team productivity. \n \n*Quality advocate, with history of initiating quality-control and -assurance programs and activities. \n \nSpecialties: Business and Technical Strategy Development \nProduct Development \nEnterprise Architecture  \nLeading Technical Teams \nSoftware Performance Management \nProgram/Project Management \nVendor Management Summary * Innovative, versatile, and very experienced executive with a proven ability to manage multimillion-dollar software projects and related teams in high-performance, demanding environments. \n \n* Experienced leader of global teams with a wide range of technical solutions implemented across a variety of platforms (mainframe, mid-range, and distributed) and technologies (JAVA, .NET, ORACLE, SQL Server, VM Ware, HP Quality Center, XCode, N-Tier Distributed development, UNIX, SAS, ASP, AutoLISP, C++, Hadoop -Hive/PIG) \n \n* Extremely strong people/program leader with a reputation for doing the impossible, devising methods to develop and implement effective solutions where others have failed. \n \n* Proven strategist with strengths in analysis, tactical development and implementation across multiple disciplines and functions, streamlining procedures and enhancing productivity.  \n \n* Astute leader and team-builder with track record of quickly increasing motivation, cohesiveness, performance, efficiency, and team productivity. \n \n*Quality advocate, with history of initiating quality-control and -assurance programs and activities. \n \nSpecialties: Business and Technical Strategy Development \nProduct Development \nEnterprise Architecture  \nLeading Technical Teams \nSoftware Performance Management \nProgram/Project Management \nVendor Management * Innovative, versatile, and very experienced executive with a proven ability to manage multimillion-dollar software projects and related teams in high-performance, demanding environments. \n \n* Experienced leader of global teams with a wide range of technical solutions implemented across a variety of platforms (mainframe, mid-range, and distributed) and technologies (JAVA, .NET, ORACLE, SQL Server, VM Ware, HP Quality Center, XCode, N-Tier Distributed development, UNIX, SAS, ASP, AutoLISP, C++, Hadoop -Hive/PIG) \n \n* Extremely strong people/program leader with a reputation for doing the impossible, devising methods to develop and implement effective solutions where others have failed. \n \n* Proven strategist with strengths in analysis, tactical development and implementation across multiple disciplines and functions, streamlining procedures and enhancing productivity.  \n \n* Astute leader and team-builder with track record of quickly increasing motivation, cohesiveness, performance, efficiency, and team productivity. \n \n*Quality advocate, with history of initiating quality-control and -assurance programs and activities. \n \nSpecialties: Business and Technical Strategy Development \nProduct Development \nEnterprise Architecture  \nLeading Technical Teams \nSoftware Performance Management \nProgram/Project Management \nVendor Management * Innovative, versatile, and very experienced executive with a proven ability to manage multimillion-dollar software projects and related teams in high-performance, demanding environments. \n \n* Experienced leader of global teams with a wide range of technical solutions implemented across a variety of platforms (mainframe, mid-range, and distributed) and technologies (JAVA, .NET, ORACLE, SQL Server, VM Ware, HP Quality Center, XCode, N-Tier Distributed development, UNIX, SAS, ASP, AutoLISP, C++, Hadoop -Hive/PIG) \n \n* Extremely strong people/program leader with a reputation for doing the impossible, devising methods to develop and implement effective solutions where others have failed. \n \n* Proven strategist with strengths in analysis, tactical development and implementation across multiple disciplines and functions, streamlining procedures and enhancing productivity.  \n \n* Astute leader and team-builder with track record of quickly increasing motivation, cohesiveness, performance, efficiency, and team productivity. \n \n*Quality advocate, with history of initiating quality-control and -assurance programs and activities. \n \nSpecialties: Business and Technical Strategy Development \nProduct Development \nEnterprise Architecture  \nLeading Technical Teams \nSoftware Performance Management \nProgram/Project Management \nVendor Management Experience President and CEO Dexter Enterprise Solutions, LLC May 2015  – Present (4 months) Tempe, AZ Responsibilities include: \n•\tCreating, communicating, and implementing the organization's vision, mission, and overall direction.  \n•\tLeading the development and implementation of the overall organization's strategy. \n•\tDeveloping a culture focused on results, respect, world-class product and services, and continuous improvement. \n•\tBuilding, developing and maintaining a strong leadership team. \n•\tEnsure the company is appropriately organized and staffed. \n•\tEnsure that expenditures are within the authorized annual budget of the Company. \n•\tAssess the principal risks of the Company and to ensure that these risks are being monitored and managed. \n•\tEnsure that the Company maintains high standards of corporate citizenship and social responsibility wherever it does business. \n•\tEvaluating the success of the organization. \n•\tMaintaining awareness of both the external and internal competitive landscape, opportunities for expansion, customers, markets, and new industry developments. \n Development Manager/Lead Technical Architect/Data Quality Manager American Express April 2004  –  May 2015  (11 years 2 months) Phoenix, Arizona Area Responsible for the technical strategy, leadership, and development for software and hardware solutions integrated across distributed, mid-range, and mainframe solutions. Responsible for the management of combined annual operational, technical infrastructure upgrade, and project budgets of over $2.5 MM US. Responsible for development, testing and support teams of up to twenty resources including management across multiple competing technical vendors. Key achievements: \n \n• American Express MCC/IC Decision Tree – Led a project to identify the known Merchant Category Code /Industry Code business rules, designed and developed and working prototype, and aggressively worked to complete a implementation within the Want to Honor Sales Finalization process in Q4 2006 providing an annual savings of over $400,000 through quality improvements.  \n \n• Demand Management Save - Partnered with business and technology teams to introduce a demand management save for MMDB of over $500,000 in 2009.  \n \n• A 500% improvement in web performance for Registered Card in 2009 – received Chairman’s Award for Innovation;  \n \n• Identification/mitigation of key constraints within Next Generation Selects – a very complex marketing content management system leveraging Vignette Content Management, over 64 virtual servers – VM Ware, Oracle, JAVA, MQ, Oracle, and integrations to several key internally developed applications. \n \n• Initiated Global Network Services and Information Management data quality program to identify, track, and improve issues across the financial network through automated scorecards, policy establishment, regional communications and governance (Sybase, SQL Server, SAS, Unix, Microstrategy, Hadoop Hive/Pig) Director, Application Development / Support, Manager, System Administration ORANGE COUNTY TEACHERS FEDERAL CREDIT UNION (OCTFCU) 2002  –  2004  (2 years) Manage project management, system administration, and software development teams of up to 15 members to develop, implement, administer, and support core transaction-processing solutions. Define IT vision and strategy; coordinate across departments to develop roadmaps. Manage cross-departmental, multidisciplinary teams, including Marketing, Human Resource, Compliance, Security, Operations, and Finance members, of up to 35 in developing and implementing large-scale projects. Liaise with and report to upper management to resolve and address challenges and communicate projects’ status. Develop and manage vendor relationships, contracts, and service-level agreements (SLAs). Train, mentor, and coach team members and identify potential leaders for development. Key achievements: \n \n• Provided Project Management introductory training courses. \n \n• Devised and applied formal enterprise-application architecture and IT application portfolio-management strategies to gain consistency and efficiency in operations. \n \n• Championed and implemented effective Decision Support System involving ASP and SQL Server 2000, supporting static/parametric reporting, drill-down reports, multiple data-source interfaces, Crystal Reports access, aggregate reports with drill-down capabilities, and data exporting to MS Excel. \n \n• Initiated streamlined development solutions using .NET, ASP, SQL Server, JavaScript, and XML to implement host financial-system solutions (transaction processing). \n \n• Developed multiple business-to-business (B2B) solutions and spearheaded development of overflow interface for Real Estate teams. \n \n• Implemented and delivered continuing training; developed cohesive team and more than doubled productivity within 18 months. \n \n• Managed department budget and financial goals. \n \n• Managed complex software vendor relationships across mainframe and distributed platforms Owner, Systems/Software Engineer DexterB 2000  –  2002  (2 years) Provided engineering and management expertise for firm focused on CAD software products, including Panels 2001 software, a C++ Windows application for use within AutoCAD environment. Oversaw all management functions as well as software development and engineering, including strategic planning, marketing, financials, QA, support, and relationship management. Managed development projects and developed and delivered technical instruction. Key achievements: \n \n• Developed and deployed multiple customized solutions employing ASP, C++, SQL Server, ARX, VBA, Visual Basic, and AutoCAD. \n \n• Employed AutoCAD, Visual Basic, ASP, HTML, and SQL Server 2000 to develop integrated, server-based 3-D drawing-generation application that fully automated the creation of design layouts, saving over $2.2 million annually in design costs. \n \n• Created and presented training for personnel and clients on ASP, AutoCAD, AutoLisp, Java, and VBA. Engineering Manager / Vice President, Client Services, Manager, Ascendant Development, Core Engineer Hypercom 1999  –  2000  (1 year) Promoted through 3 positions within 4 months, managing 6 functions for company specializing in eCommerce transaction processing applications: credit/debit-card processing, electronic receipt capture, network-provider interfaces, and internal transaction support. Oversaw and directed Project Management, Configuration Engineering, Ascendant Development, Document Control, Training, and Sales Support functions with teams of up to 23 members, tasked with providing supportive transaction-processing software. Created, implemented, and ensured compliance with risk-assessment and quality-assurance plans. Key achievements: \n \n• In development environment utilizing C, C++, Java, Oracle, and SQL Server, enacted strategies that resulted in improved development procedures. \n \n• Achieved scheduled performance requirements while improving product quality. \n \n• Commended by senior management for achieving dramatic morale and team-performance improvement. Systems / Software Engineer Intel Corporation 1996  –  1999  (3 years) Created, developed, and coded specific applications for one of world’s premier computer-based corporations. Managed multiple engineering functions and activities throughout development life cycle. Analyzed projects’ scope; defined requirements; managed projects; and developed and supported applications for use in ramping new technologies to manufacture and market. Oversaw risk-assessment and quality-assurance activities for assigned projects. Key achievements: \n \n• Spearheaded ISO 9002 certification initiatives for Assembly Technology Development MIS Department. \n \n• Drove and managed strategic data-integrity and engineering-analysis programs for STTD Automation. \n \n• Enhanced Manufacturing’s testing/analysis capabilities through development of Web-based Engineering Analysis Tools. \n \n• Designed and developed NT/AutoCAD 12/13-based design tool to expedite manufacturing and was critical contributor on a project resulting in capital avoidance of nearly $10 million. \n \n• Developed ASP tool to automate inter-site file transfer via Intranet. \n \n• Created and deployed UNIX-based station (tool) controller for FX Testers. \n \n• Tasked with leading continuous improvement efforts via Virtual Factory Automation Change Control Board and Brown Bag Brainstorming Group, founded to enhance peer-to-peer training. Owner, Systems / Software Engineer EXECUCAD, INC 1992  –  1996  (4 years) Designed and developed solutions for company specializing in computer-aided drafting (CAD) packages for use in AutoCAD applications in architectural, civil, electrical, structural, and mechanical-design fields. \nPerformed wide range of technical and management functions, from technical project development and management through financial, sales, marketing, and client-support activities. Led projects throughout development and implementation life cycle, from definition and design through QA, implementation, end-user training, and troubleshooting/maintenance. Supervised and performed in accordance with QA/QC and risk assessment principles. Key achievements: \n \n• Developed Automated Restaurant Design and Panel Schedule applications for the construction industry leveraging AutoLisp, Visual Basic, C/C++, SQL environment. Staff Sergeant, Geographic Intelligence Specialist United States Marine Corps 1987  –  1993  (6 years) Honorably served in the USMC for six years including active participation in Desert Shield/Desert Storm. \n \n• Meritoriously promoted twice \n \n• Received three awards for excellence of performance on international projects. President and CEO Dexter Enterprise Solutions, LLC May 2015  – Present (4 months) Tempe, AZ Responsibilities include: \n•\tCreating, communicating, and implementing the organization's vision, mission, and overall direction.  \n•\tLeading the development and implementation of the overall organization's strategy. \n•\tDeveloping a culture focused on results, respect, world-class product and services, and continuous improvement. \n•\tBuilding, developing and maintaining a strong leadership team. \n•\tEnsure the company is appropriately organized and staffed. \n•\tEnsure that expenditures are within the authorized annual budget of the Company. \n•\tAssess the principal risks of the Company and to ensure that these risks are being monitored and managed. \n•\tEnsure that the Company maintains high standards of corporate citizenship and social responsibility wherever it does business. \n•\tEvaluating the success of the organization. \n•\tMaintaining awareness of both the external and internal competitive landscape, opportunities for expansion, customers, markets, and new industry developments. \n President and CEO Dexter Enterprise Solutions, LLC May 2015  – Present (4 months) Tempe, AZ Responsibilities include: \n•\tCreating, communicating, and implementing the organization's vision, mission, and overall direction.  \n•\tLeading the development and implementation of the overall organization's strategy. \n•\tDeveloping a culture focused on results, respect, world-class product and services, and continuous improvement. \n•\tBuilding, developing and maintaining a strong leadership team. \n•\tEnsure the company is appropriately organized and staffed. \n•\tEnsure that expenditures are within the authorized annual budget of the Company. \n•\tAssess the principal risks of the Company and to ensure that these risks are being monitored and managed. \n•\tEnsure that the Company maintains high standards of corporate citizenship and social responsibility wherever it does business. \n•\tEvaluating the success of the organization. \n•\tMaintaining awareness of both the external and internal competitive landscape, opportunities for expansion, customers, markets, and new industry developments. \n Development Manager/Lead Technical Architect/Data Quality Manager American Express April 2004  –  May 2015  (11 years 2 months) Phoenix, Arizona Area Responsible for the technical strategy, leadership, and development for software and hardware solutions integrated across distributed, mid-range, and mainframe solutions. Responsible for the management of combined annual operational, technical infrastructure upgrade, and project budgets of over $2.5 MM US. Responsible for development, testing and support teams of up to twenty resources including management across multiple competing technical vendors. Key achievements: \n \n• American Express MCC/IC Decision Tree – Led a project to identify the known Merchant Category Code /Industry Code business rules, designed and developed and working prototype, and aggressively worked to complete a implementation within the Want to Honor Sales Finalization process in Q4 2006 providing an annual savings of over $400,000 through quality improvements.  \n \n• Demand Management Save - Partnered with business and technology teams to introduce a demand management save for MMDB of over $500,000 in 2009.  \n \n• A 500% improvement in web performance for Registered Card in 2009 – received Chairman’s Award for Innovation;  \n \n• Identification/mitigation of key constraints within Next Generation Selects – a very complex marketing content management system leveraging Vignette Content Management, over 64 virtual servers – VM Ware, Oracle, JAVA, MQ, Oracle, and integrations to several key internally developed applications. \n \n• Initiated Global Network Services and Information Management data quality program to identify, track, and improve issues across the financial network through automated scorecards, policy establishment, regional communications and governance (Sybase, SQL Server, SAS, Unix, Microstrategy, Hadoop Hive/Pig) Development Manager/Lead Technical Architect/Data Quality Manager American Express April 2004  –  May 2015  (11 years 2 months) Phoenix, Arizona Area Responsible for the technical strategy, leadership, and development for software and hardware solutions integrated across distributed, mid-range, and mainframe solutions. Responsible for the management of combined annual operational, technical infrastructure upgrade, and project budgets of over $2.5 MM US. Responsible for development, testing and support teams of up to twenty resources including management across multiple competing technical vendors. Key achievements: \n \n• American Express MCC/IC Decision Tree – Led a project to identify the known Merchant Category Code /Industry Code business rules, designed and developed and working prototype, and aggressively worked to complete a implementation within the Want to Honor Sales Finalization process in Q4 2006 providing an annual savings of over $400,000 through quality improvements.  \n \n• Demand Management Save - Partnered with business and technology teams to introduce a demand management save for MMDB of over $500,000 in 2009.  \n \n• A 500% improvement in web performance for Registered Card in 2009 – received Chairman’s Award for Innovation;  \n \n• Identification/mitigation of key constraints within Next Generation Selects – a very complex marketing content management system leveraging Vignette Content Management, over 64 virtual servers – VM Ware, Oracle, JAVA, MQ, Oracle, and integrations to several key internally developed applications. \n \n• Initiated Global Network Services and Information Management data quality program to identify, track, and improve issues across the financial network through automated scorecards, policy establishment, regional communications and governance (Sybase, SQL Server, SAS, Unix, Microstrategy, Hadoop Hive/Pig) Director, Application Development / Support, Manager, System Administration ORANGE COUNTY TEACHERS FEDERAL CREDIT UNION (OCTFCU) 2002  –  2004  (2 years) Manage project management, system administration, and software development teams of up to 15 members to develop, implement, administer, and support core transaction-processing solutions. Define IT vision and strategy; coordinate across departments to develop roadmaps. Manage cross-departmental, multidisciplinary teams, including Marketing, Human Resource, Compliance, Security, Operations, and Finance members, of up to 35 in developing and implementing large-scale projects. Liaise with and report to upper management to resolve and address challenges and communicate projects’ status. Develop and manage vendor relationships, contracts, and service-level agreements (SLAs). Train, mentor, and coach team members and identify potential leaders for development. Key achievements: \n \n• Provided Project Management introductory training courses. \n \n• Devised and applied formal enterprise-application architecture and IT application portfolio-management strategies to gain consistency and efficiency in operations. \n \n• Championed and implemented effective Decision Support System involving ASP and SQL Server 2000, supporting static/parametric reporting, drill-down reports, multiple data-source interfaces, Crystal Reports access, aggregate reports with drill-down capabilities, and data exporting to MS Excel. \n \n• Initiated streamlined development solutions using .NET, ASP, SQL Server, JavaScript, and XML to implement host financial-system solutions (transaction processing). \n \n• Developed multiple business-to-business (B2B) solutions and spearheaded development of overflow interface for Real Estate teams. \n \n• Implemented and delivered continuing training; developed cohesive team and more than doubled productivity within 18 months. \n \n• Managed department budget and financial goals. \n \n• Managed complex software vendor relationships across mainframe and distributed platforms Director, Application Development / Support, Manager, System Administration ORANGE COUNTY TEACHERS FEDERAL CREDIT UNION (OCTFCU) 2002  –  2004  (2 years) Manage project management, system administration, and software development teams of up to 15 members to develop, implement, administer, and support core transaction-processing solutions. Define IT vision and strategy; coordinate across departments to develop roadmaps. Manage cross-departmental, multidisciplinary teams, including Marketing, Human Resource, Compliance, Security, Operations, and Finance members, of up to 35 in developing and implementing large-scale projects. Liaise with and report to upper management to resolve and address challenges and communicate projects’ status. Develop and manage vendor relationships, contracts, and service-level agreements (SLAs). Train, mentor, and coach team members and identify potential leaders for development. Key achievements: \n \n• Provided Project Management introductory training courses. \n \n• Devised and applied formal enterprise-application architecture and IT application portfolio-management strategies to gain consistency and efficiency in operations. \n \n• Championed and implemented effective Decision Support System involving ASP and SQL Server 2000, supporting static/parametric reporting, drill-down reports, multiple data-source interfaces, Crystal Reports access, aggregate reports with drill-down capabilities, and data exporting to MS Excel. \n \n• Initiated streamlined development solutions using .NET, ASP, SQL Server, JavaScript, and XML to implement host financial-system solutions (transaction processing). \n \n• Developed multiple business-to-business (B2B) solutions and spearheaded development of overflow interface for Real Estate teams. \n \n• Implemented and delivered continuing training; developed cohesive team and more than doubled productivity within 18 months. \n \n• Managed department budget and financial goals. \n \n• Managed complex software vendor relationships across mainframe and distributed platforms Owner, Systems/Software Engineer DexterB 2000  –  2002  (2 years) Provided engineering and management expertise for firm focused on CAD software products, including Panels 2001 software, a C++ Windows application for use within AutoCAD environment. Oversaw all management functions as well as software development and engineering, including strategic planning, marketing, financials, QA, support, and relationship management. Managed development projects and developed and delivered technical instruction. Key achievements: \n \n• Developed and deployed multiple customized solutions employing ASP, C++, SQL Server, ARX, VBA, Visual Basic, and AutoCAD. \n \n• Employed AutoCAD, Visual Basic, ASP, HTML, and SQL Server 2000 to develop integrated, server-based 3-D drawing-generation application that fully automated the creation of design layouts, saving over $2.2 million annually in design costs. \n \n• Created and presented training for personnel and clients on ASP, AutoCAD, AutoLisp, Java, and VBA. Owner, Systems/Software Engineer DexterB 2000  –  2002  (2 years) Provided engineering and management expertise for firm focused on CAD software products, including Panels 2001 software, a C++ Windows application for use within AutoCAD environment. Oversaw all management functions as well as software development and engineering, including strategic planning, marketing, financials, QA, support, and relationship management. Managed development projects and developed and delivered technical instruction. Key achievements: \n \n• Developed and deployed multiple customized solutions employing ASP, C++, SQL Server, ARX, VBA, Visual Basic, and AutoCAD. \n \n• Employed AutoCAD, Visual Basic, ASP, HTML, and SQL Server 2000 to develop integrated, server-based 3-D drawing-generation application that fully automated the creation of design layouts, saving over $2.2 million annually in design costs. \n \n• Created and presented training for personnel and clients on ASP, AutoCAD, AutoLisp, Java, and VBA. Engineering Manager / Vice President, Client Services, Manager, Ascendant Development, Core Engineer Hypercom 1999  –  2000  (1 year) Promoted through 3 positions within 4 months, managing 6 functions for company specializing in eCommerce transaction processing applications: credit/debit-card processing, electronic receipt capture, network-provider interfaces, and internal transaction support. Oversaw and directed Project Management, Configuration Engineering, Ascendant Development, Document Control, Training, and Sales Support functions with teams of up to 23 members, tasked with providing supportive transaction-processing software. Created, implemented, and ensured compliance with risk-assessment and quality-assurance plans. Key achievements: \n \n• In development environment utilizing C, C++, Java, Oracle, and SQL Server, enacted strategies that resulted in improved development procedures. \n \n• Achieved scheduled performance requirements while improving product quality. \n \n• Commended by senior management for achieving dramatic morale and team-performance improvement. Engineering Manager / Vice President, Client Services, Manager, Ascendant Development, Core Engineer Hypercom 1999  –  2000  (1 year) Promoted through 3 positions within 4 months, managing 6 functions for company specializing in eCommerce transaction processing applications: credit/debit-card processing, electronic receipt capture, network-provider interfaces, and internal transaction support. Oversaw and directed Project Management, Configuration Engineering, Ascendant Development, Document Control, Training, and Sales Support functions with teams of up to 23 members, tasked with providing supportive transaction-processing software. Created, implemented, and ensured compliance with risk-assessment and quality-assurance plans. Key achievements: \n \n• In development environment utilizing C, C++, Java, Oracle, and SQL Server, enacted strategies that resulted in improved development procedures. \n \n• Achieved scheduled performance requirements while improving product quality. \n \n• Commended by senior management for achieving dramatic morale and team-performance improvement. Systems / Software Engineer Intel Corporation 1996  –  1999  (3 years) Created, developed, and coded specific applications for one of world’s premier computer-based corporations. Managed multiple engineering functions and activities throughout development life cycle. Analyzed projects’ scope; defined requirements; managed projects; and developed and supported applications for use in ramping new technologies to manufacture and market. Oversaw risk-assessment and quality-assurance activities for assigned projects. Key achievements: \n \n• Spearheaded ISO 9002 certification initiatives for Assembly Technology Development MIS Department. \n \n• Drove and managed strategic data-integrity and engineering-analysis programs for STTD Automation. \n \n• Enhanced Manufacturing’s testing/analysis capabilities through development of Web-based Engineering Analysis Tools. \n \n• Designed and developed NT/AutoCAD 12/13-based design tool to expedite manufacturing and was critical contributor on a project resulting in capital avoidance of nearly $10 million. \n \n• Developed ASP tool to automate inter-site file transfer via Intranet. \n \n• Created and deployed UNIX-based station (tool) controller for FX Testers. \n \n• Tasked with leading continuous improvement efforts via Virtual Factory Automation Change Control Board and Brown Bag Brainstorming Group, founded to enhance peer-to-peer training. Systems / Software Engineer Intel Corporation 1996  –  1999  (3 years) Created, developed, and coded specific applications for one of world’s premier computer-based corporations. Managed multiple engineering functions and activities throughout development life cycle. Analyzed projects’ scope; defined requirements; managed projects; and developed and supported applications for use in ramping new technologies to manufacture and market. Oversaw risk-assessment and quality-assurance activities for assigned projects. Key achievements: \n \n• Spearheaded ISO 9002 certification initiatives for Assembly Technology Development MIS Department. \n \n• Drove and managed strategic data-integrity and engineering-analysis programs for STTD Automation. \n \n• Enhanced Manufacturing’s testing/analysis capabilities through development of Web-based Engineering Analysis Tools. \n \n• Designed and developed NT/AutoCAD 12/13-based design tool to expedite manufacturing and was critical contributor on a project resulting in capital avoidance of nearly $10 million. \n \n• Developed ASP tool to automate inter-site file transfer via Intranet. \n \n• Created and deployed UNIX-based station (tool) controller for FX Testers. \n \n• Tasked with leading continuous improvement efforts via Virtual Factory Automation Change Control Board and Brown Bag Brainstorming Group, founded to enhance peer-to-peer training. Owner, Systems / Software Engineer EXECUCAD, INC 1992  –  1996  (4 years) Designed and developed solutions for company specializing in computer-aided drafting (CAD) packages for use in AutoCAD applications in architectural, civil, electrical, structural, and mechanical-design fields. \nPerformed wide range of technical and management functions, from technical project development and management through financial, sales, marketing, and client-support activities. Led projects throughout development and implementation life cycle, from definition and design through QA, implementation, end-user training, and troubleshooting/maintenance. Supervised and performed in accordance with QA/QC and risk assessment principles. Key achievements: \n \n• Developed Automated Restaurant Design and Panel Schedule applications for the construction industry leveraging AutoLisp, Visual Basic, C/C++, SQL environment. Owner, Systems / Software Engineer EXECUCAD, INC 1992  –  1996  (4 years) Designed and developed solutions for company specializing in computer-aided drafting (CAD) packages for use in AutoCAD applications in architectural, civil, electrical, structural, and mechanical-design fields. \nPerformed wide range of technical and management functions, from technical project development and management through financial, sales, marketing, and client-support activities. Led projects throughout development and implementation life cycle, from definition and design through QA, implementation, end-user training, and troubleshooting/maintenance. Supervised and performed in accordance with QA/QC and risk assessment principles. Key achievements: \n \n• Developed Automated Restaurant Design and Panel Schedule applications for the construction industry leveraging AutoLisp, Visual Basic, C/C++, SQL environment. Staff Sergeant, Geographic Intelligence Specialist United States Marine Corps 1987  –  1993  (6 years) Honorably served in the USMC for six years including active participation in Desert Shield/Desert Storm. \n \n• Meritoriously promoted twice \n \n• Received three awards for excellence of performance on international projects. Staff Sergeant, Geographic Intelligence Specialist United States Marine Corps 1987  –  1993  (6 years) Honorably served in the USMC for six years including active participation in Desert Shield/Desert Storm. \n \n• Meritoriously promoted twice \n \n• Received three awards for excellence of performance on international projects. Languages English Native or bilingual proficiency English Native or bilingual proficiency English Native or bilingual proficiency Native or bilingual proficiency Skills Enterprise Architecture SDLC Analysis Relational Databases Requirements Gathering Databases Distributed Systems Software Project... Database Design Systems Analysis Certified Scrum Master... Requirements Analysis SQL Server Solution Architecture Vendor Management Integration VB.NET Application Development Data Warehousing SQL Business Intelligence Business Analysis Process Development Visual Basic ASP Agile IIS Application Architecture SOA C# XML Agile Project Management Windows Unix Software Development System Architecture Visio .NET Testing Process Improvement T-SQL Mentoring Business Management Deployment Six Sigma Theory of Constraints Pareto Gantt Microsoft SQL Server See 34+     See less Skills  Enterprise Architecture SDLC Analysis Relational Databases Requirements Gathering Databases Distributed Systems Software Project... Database Design Systems Analysis Certified Scrum Master... Requirements Analysis SQL Server Solution Architecture Vendor Management Integration VB.NET Application Development Data Warehousing SQL Business Intelligence Business Analysis Process Development Visual Basic ASP Agile IIS Application Architecture SOA C# XML Agile Project Management Windows Unix Software Development System Architecture Visio .NET Testing Process Improvement T-SQL Mentoring Business Management Deployment Six Sigma Theory of Constraints Pareto Gantt Microsoft SQL Server See 34+     See less Enterprise Architecture SDLC Analysis Relational Databases Requirements Gathering Databases Distributed Systems Software Project... Database Design Systems Analysis Certified Scrum Master... Requirements Analysis SQL Server Solution Architecture Vendor Management Integration VB.NET Application Development Data Warehousing SQL Business Intelligence Business Analysis Process Development Visual Basic ASP Agile IIS Application Architecture SOA C# XML Agile Project Management Windows Unix Software Development System Architecture Visio .NET Testing Process Improvement T-SQL Mentoring Business Management Deployment Six Sigma Theory of Constraints Pareto Gantt Microsoft SQL Server See 34+     See less Enterprise Architecture SDLC Analysis Relational Databases Requirements Gathering Databases Distributed Systems Software Project... Database Design Systems Analysis Certified Scrum Master... Requirements Analysis SQL Server Solution Architecture Vendor Management Integration VB.NET Application Development Data Warehousing SQL Business Intelligence Business Analysis Process Development Visual Basic ASP Agile IIS Application Architecture SOA C# XML Agile Project Management Windows Unix Software Development System Architecture Visio .NET Testing Process Improvement T-SQL Mentoring Business Management Deployment Six Sigma Theory of Constraints Pareto Gantt Microsoft SQL Server See 34+     See less Education ASPE Certified ScrumMaster Workshop 2013  – 2013 American Express Six Sigma Black Belt Training,  Six Sigma 2006  – 2006 American Express Sigma Yellow Belt Training,  Six Sigma 2006  – 2006 American Express Sigma Green Belt Training,  Six Sigma 2005  – 2005 University of Phoenix Master of Business Administration,  Business 1999  – 2001 University of Phoenix Bachelor of Science, Business Information Systems,  Information Systems 1997  – 1999 ASPE Certified ScrumMaster Workshop 2013  – 2013 ASPE Certified ScrumMaster Workshop 2013  – 2013 ASPE Certified ScrumMaster Workshop 2013  – 2013 American Express Six Sigma Black Belt Training,  Six Sigma 2006  – 2006 American Express Six Sigma Black Belt Training,  Six Sigma 2006  – 2006 American Express Six Sigma Black Belt Training,  Six Sigma 2006  – 2006 American Express Sigma Yellow Belt Training,  Six Sigma 2006  – 2006 American Express Sigma Yellow Belt Training,  Six Sigma 2006  – 2006 American Express Sigma Yellow Belt Training,  Six Sigma 2006  – 2006 American Express Sigma Green Belt Training,  Six Sigma 2005  – 2005 American Express Sigma Green Belt Training,  Six Sigma 2005  – 2005 American Express Sigma Green Belt Training,  Six Sigma 2005  – 2005 University of Phoenix Master of Business Administration,  Business 1999  – 2001 University of Phoenix Master of Business Administration,  Business 1999  – 2001 University of Phoenix Master of Business Administration,  Business 1999  – 2001 University of Phoenix Bachelor of Science, Business Information Systems,  Information Systems 1997  – 1999 University of Phoenix Bachelor of Science, Business Information Systems,  Information Systems 1997  – 1999 University of Phoenix Bachelor of Science, Business Information Systems,  Information Systems 1997  – 1999 "]}