{"position": "Systems Integrator", "company": "IBM", "profiles": ["Experience Systems Integrator IBM Global Services Systems Integrator IBM Global Services Systems Integrator IBM Global Services Skills Enterprise Server... Skills  Enterprise Server... Enterprise Server... Enterprise Server... ", "Summary After 15 years in the warehousing & distribution consulting business, joined my wife Debra in home building with New Tradition Homes. Realized home building was my calling, building some of the highest quality luxury homes in the Charlotte region. Specialties:High-end energy efficient luxury homes. Summary After 15 years in the warehousing & distribution consulting business, joined my wife Debra in home building with New Tradition Homes. Realized home building was my calling, building some of the highest quality luxury homes in the Charlotte region. Specialties:High-end energy efficient luxury homes. After 15 years in the warehousing & distribution consulting business, joined my wife Debra in home building with New Tradition Homes. Realized home building was my calling, building some of the highest quality luxury homes in the Charlotte region. Specialties:High-end energy efficient luxury homes. After 15 years in the warehousing & distribution consulting business, joined my wife Debra in home building with New Tradition Homes. Realized home building was my calling, building some of the highest quality luxury homes in the Charlotte region. Specialties:High-end energy efficient luxury homes. Experience Owner New Tradition Homes of NC, LLC 1998  – Present (17 years) Builder of some of the finest luxury homes in the Charlotte, NC region Owner / Consultant Advanced Distribution Designs June 1993  –  December 1998  (5 years 7 months) Distribution industry consultant assisting a variety of large corporations integrate multi-million dollar real-time distribution center management systems. Systems Integrator IBM January 1985  –  June 1993  (8 years 6 months) Systems integrator to IBM customers with large distribution facility networks. Designed customized solutions for real-time distribution center management. Rolled up the sleeves and worked hands-on to install systems, manage startup, and ensure stability. Owner New Tradition Homes of NC, LLC 1998  – Present (17 years) Builder of some of the finest luxury homes in the Charlotte, NC region Owner New Tradition Homes of NC, LLC 1998  – Present (17 years) Builder of some of the finest luxury homes in the Charlotte, NC region Owner / Consultant Advanced Distribution Designs June 1993  –  December 1998  (5 years 7 months) Distribution industry consultant assisting a variety of large corporations integrate multi-million dollar real-time distribution center management systems. Owner / Consultant Advanced Distribution Designs June 1993  –  December 1998  (5 years 7 months) Distribution industry consultant assisting a variety of large corporations integrate multi-million dollar real-time distribution center management systems. Systems Integrator IBM January 1985  –  June 1993  (8 years 6 months) Systems integrator to IBM customers with large distribution facility networks. Designed customized solutions for real-time distribution center management. Rolled up the sleeves and worked hands-on to install systems, manage startup, and ensure stability. Systems Integrator IBM January 1985  –  June 1993  (8 years 6 months) Systems integrator to IBM customers with large distribution facility networks. Designed customized solutions for real-time distribution center management. Rolled up the sleeves and worked hands-on to install systems, manage startup, and ensure stability. Skills Construction Construction Management Renovation Residential Homes Contractors Contract Negotiation Contract Management Project Estimation Value Engineering AutoCAD Process Scheduler Green Building Project Management Subcontracting New Custom Homes Tiles See 1+     See less Skills  Construction Construction Management Renovation Residential Homes Contractors Contract Negotiation Contract Management Project Estimation Value Engineering AutoCAD Process Scheduler Green Building Project Management Subcontracting New Custom Homes Tiles See 1+     See less Construction Construction Management Renovation Residential Homes Contractors Contract Negotiation Contract Management Project Estimation Value Engineering AutoCAD Process Scheduler Green Building Project Management Subcontracting New Custom Homes Tiles See 1+     See less Construction Construction Management Renovation Residential Homes Contractors Contract Negotiation Contract Management Project Estimation Value Engineering AutoCAD Process Scheduler Green Building Project Management Subcontracting New Custom Homes Tiles See 1+     See less Education North Carolina State University BS, MS,  Engineering , Computer Science 1978  – 1984 North Carolina State University BS, MS,  Engineering , Computer Science 1978  – 1984 North Carolina State University BS, MS,  Engineering , Computer Science 1978  – 1984 North Carolina State University BS, MS,  Engineering , Computer Science 1978  – 1984 Honors & Awards Additional Honors & Awards 2008 Charlotte Parade of Homes Award Winner Additional Honors & Awards 2008 Charlotte Parade of Homes Award Winner Additional Honors & Awards 2008 Charlotte Parade of Homes Award Winner Additional Honors & Awards 2008 Charlotte Parade of Homes Award Winner ", "Experience Systems Engineer III First Citizens Bank September 2013  – Present (2 years) Raleigh, NC Server Operations senior engineer on 6+ member team supporting 1200+ servers with MS Windows Server 2003/2008/2012 solutions. Steadystate devices includes HP ProLiant hardware with MS Windows Hyper-V and vSphere VMware virtual solutions with a national support structure. Responsible for compliance and asset management, using MS SCCM/SCOM 2012 and other tools. \nITIL 2011 Foundation certified. \nMSCA 2012 courses 411, 412 completed. Systems Engineer II First Citizens Bank March 2008  –  August 2013  (5 years 6 months) Raleigh, NC Server Operations team engineer on ProLiant Bladesystem & racked hardware with Windows Server 2003/2008 systems providing 24x7x365 support. Support tools included HP Insight Control v7 and MS System Center Configuration Manager 2007. Systems Integrator IBM November 2000  –  March 2008  (7 years 5 months) RTP, NC Systems Integrator with IBM Global Business, working with remote accounts for 24x7x365 in complex Windows, IIS, Clustering, Citrix MetaFrame applications for eCommerce solutions. Systems Administrator Interpath Communications, Inc. October 1997  –  November 2000  (3 years 2 months) Raleigh, NC Windows Operations Systems Administrator, growing company from hosting BackOffice solutions to 200+ distributed solutions with web sites, database hosting and networking solutions. Systems Engineer III First Citizens Bank September 2013  – Present (2 years) Raleigh, NC Server Operations senior engineer on 6+ member team supporting 1200+ servers with MS Windows Server 2003/2008/2012 solutions. Steadystate devices includes HP ProLiant hardware with MS Windows Hyper-V and vSphere VMware virtual solutions with a national support structure. Responsible for compliance and asset management, using MS SCCM/SCOM 2012 and other tools. \nITIL 2011 Foundation certified. \nMSCA 2012 courses 411, 412 completed. Systems Engineer III First Citizens Bank September 2013  – Present (2 years) Raleigh, NC Server Operations senior engineer on 6+ member team supporting 1200+ servers with MS Windows Server 2003/2008/2012 solutions. Steadystate devices includes HP ProLiant hardware with MS Windows Hyper-V and vSphere VMware virtual solutions with a national support structure. Responsible for compliance and asset management, using MS SCCM/SCOM 2012 and other tools. \nITIL 2011 Foundation certified. \nMSCA 2012 courses 411, 412 completed. Systems Engineer II First Citizens Bank March 2008  –  August 2013  (5 years 6 months) Raleigh, NC Server Operations team engineer on ProLiant Bladesystem & racked hardware with Windows Server 2003/2008 systems providing 24x7x365 support. Support tools included HP Insight Control v7 and MS System Center Configuration Manager 2007. Systems Engineer II First Citizens Bank March 2008  –  August 2013  (5 years 6 months) Raleigh, NC Server Operations team engineer on ProLiant Bladesystem & racked hardware with Windows Server 2003/2008 systems providing 24x7x365 support. Support tools included HP Insight Control v7 and MS System Center Configuration Manager 2007. Systems Integrator IBM November 2000  –  March 2008  (7 years 5 months) RTP, NC Systems Integrator with IBM Global Business, working with remote accounts for 24x7x365 in complex Windows, IIS, Clustering, Citrix MetaFrame applications for eCommerce solutions. Systems Integrator IBM November 2000  –  March 2008  (7 years 5 months) RTP, NC Systems Integrator with IBM Global Business, working with remote accounts for 24x7x365 in complex Windows, IIS, Clustering, Citrix MetaFrame applications for eCommerce solutions. Systems Administrator Interpath Communications, Inc. October 1997  –  November 2000  (3 years 2 months) Raleigh, NC Windows Operations Systems Administrator, growing company from hosting BackOffice solutions to 200+ distributed solutions with web sites, database hosting and networking solutions. Systems Administrator Interpath Communications, Inc. October 1997  –  November 2000  (3 years 2 months) Raleigh, NC Windows Operations Systems Administrator, growing company from hosting BackOffice solutions to 200+ distributed solutions with web sites, database hosting and networking solutions. Skills Windows System... HP Proliant Windows Server Windows 2008 Active Directory DNS Powershell IIS SCCM Cisco IOS DHCP Netbackup Disaster Recovery Network Administration Group Policy SAN See 1+     See less Skills  Windows System... HP Proliant Windows Server Windows 2008 Active Directory DNS Powershell IIS SCCM Cisco IOS DHCP Netbackup Disaster Recovery Network Administration Group Policy SAN See 1+     See less Windows System... HP Proliant Windows Server Windows 2008 Active Directory DNS Powershell IIS SCCM Cisco IOS DHCP Netbackup Disaster Recovery Network Administration Group Policy SAN See 1+     See less Windows System... HP Proliant Windows Server Windows 2008 Active Directory DNS Powershell IIS SCCM Cisco IOS DHCP Netbackup Disaster Recovery Network Administration Group Policy SAN See 1+     See less Education North Carolina State University Bachelor's degree,  Electrical and Electronics Engineering 1991  – 1994 North Carolina State University Bachelor's degree,  Electrical and Electronics Engineering 1991  – 1994 North Carolina State University Bachelor's degree,  Electrical and Electronics Engineering 1991  – 1994 North Carolina State University Bachelor's degree,  Electrical and Electronics Engineering 1991  – 1994 ", "Summary I install and provide technical support for z/OS operating system and ISV software. Summary I install and provide technical support for z/OS operating system and ISV software. I install and provide technical support for z/OS operating system and ISV software. I install and provide technical support for z/OS operating system and ISV software. Experience Systems Integrator IBM Global Services January 1999  – Present (16 years 8 months) Rochester, NY Team lead for department of 30+ system integrator/programmers and distribute work assigments for multiple IBM clients. Install z/OS operating system and ISV software and provide technical support to end users. Conduct Security health checks to ensure systems are audit complaint, participate in customer Disaster recovery tests and provide 24/7 z/OS system support. Application Support analyst Adler and Associates January 1993  –  August 1998  (5 years 8 months) Washington, DC Provided application support for the U.S. Department of State VISA and passport applications. Modified COBOL programs and provided telephone technical support to end users. Systems Analyst Mitchell Systems Corporation January 1984  –  December 1992  (9 years) Washington D.C. Systems Integrator IBM Global Services January 1999  – Present (16 years 8 months) Rochester, NY Team lead for department of 30+ system integrator/programmers and distribute work assigments for multiple IBM clients. Install z/OS operating system and ISV software and provide technical support to end users. Conduct Security health checks to ensure systems are audit complaint, participate in customer Disaster recovery tests and provide 24/7 z/OS system support. Systems Integrator IBM Global Services January 1999  – Present (16 years 8 months) Rochester, NY Team lead for department of 30+ system integrator/programmers and distribute work assigments for multiple IBM clients. Install z/OS operating system and ISV software and provide technical support to end users. Conduct Security health checks to ensure systems are audit complaint, participate in customer Disaster recovery tests and provide 24/7 z/OS system support. Application Support analyst Adler and Associates January 1993  –  August 1998  (5 years 8 months) Washington, DC Provided application support for the U.S. Department of State VISA and passport applications. Modified COBOL programs and provided telephone technical support to end users. Application Support analyst Adler and Associates January 1993  –  August 1998  (5 years 8 months) Washington, DC Provided application support for the U.S. Department of State VISA and passport applications. Modified COBOL programs and provided telephone technical support to end users. Systems Analyst Mitchell Systems Corporation January 1984  –  December 1992  (9 years) Washington D.C. Systems Analyst Mitchell Systems Corporation January 1984  –  December 1992  (9 years) Washington D.C. Skills Disaster Recovery Operating Systems Security Troubleshooting Technical Support z/OS Integration Enterprise Software COBOL Business Analysis Enterprise Architecture Unix Services JCL ITIL Project Management Vendor Management Customer Service Leadership Mainframe Process Improvement Databases IT Operations Strategic Planning Unix IT Service Management Team Building VTAM RACF Linux ACF2 Mainview TCP/IP Microsoft Excel z/VM Control-M IT Security Policies Tomcat CA-7 Microsoft Office Cloud Computing Java Enterprise Edition See 26+     See less Skills  Disaster Recovery Operating Systems Security Troubleshooting Technical Support z/OS Integration Enterprise Software COBOL Business Analysis Enterprise Architecture Unix Services JCL ITIL Project Management Vendor Management Customer Service Leadership Mainframe Process Improvement Databases IT Operations Strategic Planning Unix IT Service Management Team Building VTAM RACF Linux ACF2 Mainview TCP/IP Microsoft Excel z/VM Control-M IT Security Policies Tomcat CA-7 Microsoft Office Cloud Computing Java Enterprise Edition See 26+     See less Disaster Recovery Operating Systems Security Troubleshooting Technical Support z/OS Integration Enterprise Software COBOL Business Analysis Enterprise Architecture Unix Services JCL ITIL Project Management Vendor Management Customer Service Leadership Mainframe Process Improvement Databases IT Operations Strategic Planning Unix IT Service Management Team Building VTAM RACF Linux ACF2 Mainview TCP/IP Microsoft Excel z/VM Control-M IT Security Policies Tomcat CA-7 Microsoft Office Cloud Computing Java Enterprise Edition See 26+     See less Disaster Recovery Operating Systems Security Troubleshooting Technical Support z/OS Integration Enterprise Software COBOL Business Analysis Enterprise Architecture Unix Services JCL ITIL Project Management Vendor Management Customer Service Leadership Mainframe Process Improvement Databases IT Operations Strategic Planning Unix IT Service Management Team Building VTAM RACF Linux ACF2 Mainview TCP/IP Microsoft Excel z/VM Control-M IT Security Policies Tomcat CA-7 Microsoft Office Cloud Computing Java Enterprise Edition See 26+     See less Education Virginia Tech B.S.,  Finance 1978  – 1982 Virginia Tech B.S.,  Finance 1978  – 1982 Virginia Tech B.S.,  Finance 1978  – 1982 Virginia Tech B.S.,  Finance 1978  – 1982 Honors & Awards Additional Honors & Awards IBM 100% Club Additional Honors & Awards IBM 100% Club Additional Honors & Awards IBM 100% Club Additional Honors & Awards IBM 100% Club ", "Skills Telecommunications Channel Partners WAN SIP VPN Collaboration Solutions Solution Selling Routers Managed Services Wireless VMware Video Conferencing CCNA Juniper Enterprise Software Skills  Telecommunications Channel Partners WAN SIP VPN Collaboration Solutions Solution Selling Routers Managed Services Wireless VMware Video Conferencing CCNA Juniper Enterprise Software Telecommunications Channel Partners WAN SIP VPN Collaboration Solutions Solution Selling Routers Managed Services Wireless VMware Video Conferencing CCNA Juniper Enterprise Software Telecommunications Channel Partners WAN SIP VPN Collaboration Solutions Solution Selling Routers Managed Services Wireless VMware Video Conferencing CCNA Juniper Enterprise Software ", "Experience Systems Integrator IBM Systems Integrator IBM Systems Integrator IBM Education Morehead State University BS,  Mathematics 1985  – 1988 Morehead State University BS,  Mathematics 1985  – 1988 Morehead State University BS,  Mathematics 1985  – 1988 Morehead State University BS,  Mathematics 1985  – 1988 ", "Experience Systems Integrator IBM Systems Integrator IBM Systems Integrator IBM Skills Data Center Disaster Recovery IT Service Management Skills  Data Center Disaster Recovery IT Service Management Data Center Disaster Recovery IT Service Management Data Center Disaster Recovery IT Service Management Education Monroe College 1998  – 2000 Monroe College 1998  – 2000 Monroe College 1998  – 2000 Monroe College 1998  – 2000 ", "Experience Systems Integrator IBM Systems Integrator IBM Systems Integrator IBM ", "Experience Systems Integrator IBM Global Services Systems Integrator IBM Global Services Systems Integrator IBM Global Services Skills AIX Unix Integration Websphere Solaris Solution Architecture Enterprise Architecture Virtualization ITIL SOA VMware Shell Scripting Skills  AIX Unix Integration Websphere Solaris Solution Architecture Enterprise Architecture Virtualization ITIL SOA VMware Shell Scripting AIX Unix Integration Websphere Solaris Solution Architecture Enterprise Architecture Virtualization ITIL SOA VMware Shell Scripting AIX Unix Integration Websphere Solaris Solution Architecture Enterprise Architecture Virtualization ITIL SOA VMware Shell Scripting ", "Summary Experienced entrepreneur and executive with 15+ years operating experience specializing in scaling and expansion phases of high growth, global companies in digital arena, including LinkedIn, Google, and Yahoo!. Hybrid functional background across product and program management, international market development and operations, and business development roles including startup and international work experience. Summary Experienced entrepreneur and executive with 15+ years operating experience specializing in scaling and expansion phases of high growth, global companies in digital arena, including LinkedIn, Google, and Yahoo!. Hybrid functional background across product and program management, international market development and operations, and business development roles including startup and international work experience. Experienced entrepreneur and executive with 15+ years operating experience specializing in scaling and expansion phases of high growth, global companies in digital arena, including LinkedIn, Google, and Yahoo!. Hybrid functional background across product and program management, international market development and operations, and business development roles including startup and international work experience. Experienced entrepreneur and executive with 15+ years operating experience specializing in scaling and expansion phases of high growth, global companies in digital arena, including LinkedIn, Google, and Yahoo!. Hybrid functional background across product and program management, international market development and operations, and business development roles including startup and international work experience. Experience Founder & CEO H2 November 2009  – Present (5 years 10 months) Palo Alto, CA • H2 is the premier global leadership network for the digital industry. Headquartered in Silicon Valley with chapters in major technology markets around the world, its mission is to advance education and leadership development in the fields of digital entrepreneurship and innovation. \n• Lead global operations and program development for H2, working with global team and partners across chapters spanning the US, Europe, Asia, and Latin America regions. Program offerings include Chapter Forums, H2 Insights, and annual H2O Global Summit. \n• Current global chapters: Berlin, China, India, London, New York, Sao Paulo, Silicon Valley (HQ), Singapore, Tel Aviv and Tokyo. Director, International Operations LinkedIn May 2009  –  June 2011  (2 years 2 months) Mountain View, CA • Led development of formal cross-functional international expansion strategy and business plan to address growth opportunities in markets outside the US.  \n• Supported market entry analysis and development efforts (including growth, engagement, and monetization activity) for key emerging markets in the APAC and LATAM regions.  \n• Supported opening of company's first APAC office in India. As initial team member of India operations startup team, supported all key early activities (across strategic partnerships, sales, marketing and PR, and recruiting). \n• Managed key early monetization activities and partnerships across India, Latin America, and Southeast Asia. Director, Strategic Partnerships LinkedIn May 2008  –  April 2009  (1 year) Mountain View, CA • As early member of corporate development and strategy team, supported and managed company's portfolio of strategic relationships.  \n• Worked closely with Product & Growth teams on early integrations to drive usage of LinkedIn functionality and content within the enterprise. Product Manager Google May 2005  –  December 2007  (2 years 8 months) Mountain View, CA • Joined initial unit on product team responsible for localization and international rollout of product suite and support for international market entry planning for APAC and LATAM regions.  \n• As co-lead and landing team member for India product management team, ran point on development product localization strategy and related execution of local content partnerships. \n• Led initial developer outreach and advocacy efforts in India for OpenSocial and orkut container launches, working with local developer community. Strategic Partner Manager Google July 2003  –  April 2005  (1 year 10 months) Mountain View, CA • Managed and developed initial portfolio of monetization relationships with major strategic syndication partners for AdSense for Content launch. \n• Joined dedicated international syndication team focused on expansion of efforts into emerging international markets across EMEA, APAC, and LATAM. Program Manager Yahoo! May 1998  –  December 1999  (1 year 8 months) Santa Clara, CA • Moved into newly formed strategic alliances group dedicated to driving off-network growth and engagement efforts via strategic partnerships.  \n• Developed and supported OEM offerings for major distribution partners, including PC OEMs and ISPs. Product Manager Yahoo! May 1996  –  April 1998  (2 years) Santa Clara, CA • Joined initial community products team as early employee with responsibility for launching and managing classifieds and employment properties. \n• Worked closely with engineering team to develop data input and feed processing channels, and with partnerships team to source content. Systems Integrator IBM July 1993  –  April 1996  (2 years 10 months) Palo Alto, CA • As member of charter business unit focused on Internet integration services, led client engagements to develop web-based content and e-commerce applications. \n• Clients included The New York Times, Los Angeles Times, America Online, American Greetings, Golf Digest, and CareerPath. Founder & CEO H2 November 2009  – Present (5 years 10 months) Palo Alto, CA • H2 is the premier global leadership network for the digital industry. Headquartered in Silicon Valley with chapters in major technology markets around the world, its mission is to advance education and leadership development in the fields of digital entrepreneurship and innovation. \n• Lead global operations and program development for H2, working with global team and partners across chapters spanning the US, Europe, Asia, and Latin America regions. Program offerings include Chapter Forums, H2 Insights, and annual H2O Global Summit. \n• Current global chapters: Berlin, China, India, London, New York, Sao Paulo, Silicon Valley (HQ), Singapore, Tel Aviv and Tokyo. Founder & CEO H2 November 2009  – Present (5 years 10 months) Palo Alto, CA • H2 is the premier global leadership network for the digital industry. Headquartered in Silicon Valley with chapters in major technology markets around the world, its mission is to advance education and leadership development in the fields of digital entrepreneurship and innovation. \n• Lead global operations and program development for H2, working with global team and partners across chapters spanning the US, Europe, Asia, and Latin America regions. Program offerings include Chapter Forums, H2 Insights, and annual H2O Global Summit. \n• Current global chapters: Berlin, China, India, London, New York, Sao Paulo, Silicon Valley (HQ), Singapore, Tel Aviv and Tokyo. Director, International Operations LinkedIn May 2009  –  June 2011  (2 years 2 months) Mountain View, CA • Led development of formal cross-functional international expansion strategy and business plan to address growth opportunities in markets outside the US.  \n• Supported market entry analysis and development efforts (including growth, engagement, and monetization activity) for key emerging markets in the APAC and LATAM regions.  \n• Supported opening of company's first APAC office in India. As initial team member of India operations startup team, supported all key early activities (across strategic partnerships, sales, marketing and PR, and recruiting). \n• Managed key early monetization activities and partnerships across India, Latin America, and Southeast Asia. Director, International Operations LinkedIn May 2009  –  June 2011  (2 years 2 months) Mountain View, CA • Led development of formal cross-functional international expansion strategy and business plan to address growth opportunities in markets outside the US.  \n• Supported market entry analysis and development efforts (including growth, engagement, and monetization activity) for key emerging markets in the APAC and LATAM regions.  \n• Supported opening of company's first APAC office in India. As initial team member of India operations startup team, supported all key early activities (across strategic partnerships, sales, marketing and PR, and recruiting). \n• Managed key early monetization activities and partnerships across India, Latin America, and Southeast Asia. Director, Strategic Partnerships LinkedIn May 2008  –  April 2009  (1 year) Mountain View, CA • As early member of corporate development and strategy team, supported and managed company's portfolio of strategic relationships.  \n• Worked closely with Product & Growth teams on early integrations to drive usage of LinkedIn functionality and content within the enterprise. Director, Strategic Partnerships LinkedIn May 2008  –  April 2009  (1 year) Mountain View, CA • As early member of corporate development and strategy team, supported and managed company's portfolio of strategic relationships.  \n• Worked closely with Product & Growth teams on early integrations to drive usage of LinkedIn functionality and content within the enterprise. Product Manager Google May 2005  –  December 2007  (2 years 8 months) Mountain View, CA • Joined initial unit on product team responsible for localization and international rollout of product suite and support for international market entry planning for APAC and LATAM regions.  \n• As co-lead and landing team member for India product management team, ran point on development product localization strategy and related execution of local content partnerships. \n• Led initial developer outreach and advocacy efforts in India for OpenSocial and orkut container launches, working with local developer community. Product Manager Google May 2005  –  December 2007  (2 years 8 months) Mountain View, CA • Joined initial unit on product team responsible for localization and international rollout of product suite and support for international market entry planning for APAC and LATAM regions.  \n• As co-lead and landing team member for India product management team, ran point on development product localization strategy and related execution of local content partnerships. \n• Led initial developer outreach and advocacy efforts in India for OpenSocial and orkut container launches, working with local developer community. Strategic Partner Manager Google July 2003  –  April 2005  (1 year 10 months) Mountain View, CA • Managed and developed initial portfolio of monetization relationships with major strategic syndication partners for AdSense for Content launch. \n• Joined dedicated international syndication team focused on expansion of efforts into emerging international markets across EMEA, APAC, and LATAM. Strategic Partner Manager Google July 2003  –  April 2005  (1 year 10 months) Mountain View, CA • Managed and developed initial portfolio of monetization relationships with major strategic syndication partners for AdSense for Content launch. \n• Joined dedicated international syndication team focused on expansion of efforts into emerging international markets across EMEA, APAC, and LATAM. Program Manager Yahoo! May 1998  –  December 1999  (1 year 8 months) Santa Clara, CA • Moved into newly formed strategic alliances group dedicated to driving off-network growth and engagement efforts via strategic partnerships.  \n• Developed and supported OEM offerings for major distribution partners, including PC OEMs and ISPs. Program Manager Yahoo! May 1998  –  December 1999  (1 year 8 months) Santa Clara, CA • Moved into newly formed strategic alliances group dedicated to driving off-network growth and engagement efforts via strategic partnerships.  \n• Developed and supported OEM offerings for major distribution partners, including PC OEMs and ISPs. Product Manager Yahoo! May 1996  –  April 1998  (2 years) Santa Clara, CA • Joined initial community products team as early employee with responsibility for launching and managing classifieds and employment properties. \n• Worked closely with engineering team to develop data input and feed processing channels, and with partnerships team to source content. Product Manager Yahoo! May 1996  –  April 1998  (2 years) Santa Clara, CA • Joined initial community products team as early employee with responsibility for launching and managing classifieds and employment properties. \n• Worked closely with engineering team to develop data input and feed processing channels, and with partnerships team to source content. Systems Integrator IBM July 1993  –  April 1996  (2 years 10 months) Palo Alto, CA • As member of charter business unit focused on Internet integration services, led client engagements to develop web-based content and e-commerce applications. \n• Clients included The New York Times, Los Angeles Times, America Online, American Greetings, Golf Digest, and CareerPath. Systems Integrator IBM July 1993  –  April 1996  (2 years 10 months) Palo Alto, CA • As member of charter business unit focused on Internet integration services, led client engagements to develop web-based content and e-commerce applications. \n• Clients included The New York Times, Los Angeles Times, America Online, American Greetings, Golf Digest, and CareerPath. Skills Start-ups Monetization International Marketing Product Management Analytics Strategic Partnerships Mobile Devices Business Development Strategy Enterprise Software E-commerce Cross-functional Team... Entrepreneurship CRM Program Management Venture Capital Business Planning Executive Management Leadership Management See 5+     See less Skills  Start-ups Monetization International Marketing Product Management Analytics Strategic Partnerships Mobile Devices Business Development Strategy Enterprise Software E-commerce Cross-functional Team... Entrepreneurship CRM Program Management Venture Capital Business Planning Executive Management Leadership Management See 5+     See less Start-ups Monetization International Marketing Product Management Analytics Strategic Partnerships Mobile Devices Business Development Strategy Enterprise Software E-commerce Cross-functional Team... Entrepreneurship CRM Program Management Venture Capital Business Planning Executive Management Leadership Management See 5+     See less Start-ups Monetization International Marketing Product Management Analytics Strategic Partnerships Mobile Devices Business Development Strategy Enterprise Software E-commerce Cross-functional Team... Entrepreneurship CRM Program Management Venture Capital Business Planning Executive Management Leadership Management See 5+     See less Education University of California, Berkeley Bachelor of Science,  Electrical Engineering & Computer Science Santa Clara University Master of Business Administration University of California, Berkeley Bachelor of Science,  Electrical Engineering & Computer Science University of California, Berkeley Bachelor of Science,  Electrical Engineering & Computer Science University of California, Berkeley Bachelor of Science,  Electrical Engineering & Computer Science Santa Clara University Master of Business Administration Santa Clara University Master of Business Administration Santa Clara University Master of Business Administration ", "Summary Tertiary qualified, Senior Program Manager and Strategy Consultant with over 15 years experience and a strong track record designing and delivering end-to-end, technology-based, strategic business improvement projects to local and global organisations in the finance, ICT, utilities, retail and public sectors. I have proven success leading teams to successfully implement strategic change; actively managing project controls and best practices to ensure on time, within budget delivery. \nWith strong interpersonal skills and highly effective stakeholder management skills, I enjoy managing and mentoring onshore and offshore project teams; and developing internal and external relationships up to “C” and board level and with vendors. I possess high level analytical and problem solving skills with proven ability to maximise performance outcomes and consistently exceed expectations and targets. I am dynamic, driven, motivated, flexible yet decisive; and have a sales-oriented approach underpinned by strong product, service and customer focus. \n \nSpecialties: PRINCE2 Certified, Diploma in Program Management, ITIL certification and Certified Scrum Master \n•\tBroad experience and demonstrable success in program/project management; Enterprise Resource Planning (ERP), Business Process Management (BPM), CRM processes and IT systems; test management; service oriented architecture (SOA); and shared services \n•\tStrong consultative solution selling skills, supported by capacity to increase business growth and improve organisational performance, and effectiveness Summary Tertiary qualified, Senior Program Manager and Strategy Consultant with over 15 years experience and a strong track record designing and delivering end-to-end, technology-based, strategic business improvement projects to local and global organisations in the finance, ICT, utilities, retail and public sectors. I have proven success leading teams to successfully implement strategic change; actively managing project controls and best practices to ensure on time, within budget delivery. \nWith strong interpersonal skills and highly effective stakeholder management skills, I enjoy managing and mentoring onshore and offshore project teams; and developing internal and external relationships up to “C” and board level and with vendors. I possess high level analytical and problem solving skills with proven ability to maximise performance outcomes and consistently exceed expectations and targets. I am dynamic, driven, motivated, flexible yet decisive; and have a sales-oriented approach underpinned by strong product, service and customer focus. \n \nSpecialties: PRINCE2 Certified, Diploma in Program Management, ITIL certification and Certified Scrum Master \n•\tBroad experience and demonstrable success in program/project management; Enterprise Resource Planning (ERP), Business Process Management (BPM), CRM processes and IT systems; test management; service oriented architecture (SOA); and shared services \n•\tStrong consultative solution selling skills, supported by capacity to increase business growth and improve organisational performance, and effectiveness Tertiary qualified, Senior Program Manager and Strategy Consultant with over 15 years experience and a strong track record designing and delivering end-to-end, technology-based, strategic business improvement projects to local and global organisations in the finance, ICT, utilities, retail and public sectors. I have proven success leading teams to successfully implement strategic change; actively managing project controls and best practices to ensure on time, within budget delivery. \nWith strong interpersonal skills and highly effective stakeholder management skills, I enjoy managing and mentoring onshore and offshore project teams; and developing internal and external relationships up to “C” and board level and with vendors. I possess high level analytical and problem solving skills with proven ability to maximise performance outcomes and consistently exceed expectations and targets. I am dynamic, driven, motivated, flexible yet decisive; and have a sales-oriented approach underpinned by strong product, service and customer focus. \n \nSpecialties: PRINCE2 Certified, Diploma in Program Management, ITIL certification and Certified Scrum Master \n•\tBroad experience and demonstrable success in program/project management; Enterprise Resource Planning (ERP), Business Process Management (BPM), CRM processes and IT systems; test management; service oriented architecture (SOA); and shared services \n•\tStrong consultative solution selling skills, supported by capacity to increase business growth and improve organisational performance, and effectiveness Tertiary qualified, Senior Program Manager and Strategy Consultant with over 15 years experience and a strong track record designing and delivering end-to-end, technology-based, strategic business improvement projects to local and global organisations in the finance, ICT, utilities, retail and public sectors. I have proven success leading teams to successfully implement strategic change; actively managing project controls and best practices to ensure on time, within budget delivery. \nWith strong interpersonal skills and highly effective stakeholder management skills, I enjoy managing and mentoring onshore and offshore project teams; and developing internal and external relationships up to “C” and board level and with vendors. I possess high level analytical and problem solving skills with proven ability to maximise performance outcomes and consistently exceed expectations and targets. I am dynamic, driven, motivated, flexible yet decisive; and have a sales-oriented approach underpinned by strong product, service and customer focus. \n \nSpecialties: PRINCE2 Certified, Diploma in Program Management, ITIL certification and Certified Scrum Master \n•\tBroad experience and demonstrable success in program/project management; Enterprise Resource Planning (ERP), Business Process Management (BPM), CRM processes and IT systems; test management; service oriented architecture (SOA); and shared services \n•\tStrong consultative solution selling skills, supported by capacity to increase business growth and improve organisational performance, and effectiveness Experience Senior Project Manager Schweppes Australia March 2015  – Present (6 months) Melbourne Area, Australia Project Manager – Trade Promotion Management (TPM) \n Joined Project immediately after the Business Case was approved and Project Delivery had commenced \n Responsible and accountable for the whole project including delivery technical, business process and people capability change \n Managed Systems Integrator, UXC Red Rock to deliver Oracle’s Demantra TPM solution \nManaged Business Process and Business Benefits vendor, PwC \n Managed Project Team involving, Project Technical Lead, Business Lead, Change Manager, \nTechnical Solution Architect, Vendor Project Leads, Test Manager and SME’s. \n Delivered first 3 stages of a 9 stage project including Feasibility, Plan and Proof of Concept Build. \n Managed the build of integrations between Demantra and SAP ERP Senior Project Manager Schweppes Australia March 2015  – Present (6 months) Melbourne Area, Australia Senior Project Manager Australia Post December 2011  –  March 2015  (3 years 4 months) Melbourne Area, Australia Initiated the workforce access project from the Idea phase for Corporate Affairs. Provided a single channel for the CardSafe (PCI-DSS) Program to engage IT with a number of projects.  \nResponsibilities and Key Achievements \n \nSenior Project Manager – Workforce Access: \n•\tManaged a team to pull together a business case for the workforce access project \n•\tThe objective of the project was to roll out the Intranet to a wider workforce within Australia Post \n•\tLead a team consisting of Solution Architect, Business Analyst, Technical Designers, Developers and Infrastructure Resources \n \nIT Engagement Manager – CardSafe: \n•\tCreated an IT engagement model and process to fast-track IT requirements from the project \n•\tProvided the CardSafe PCI-DSS compliance project with a single point of contact for all IT engagement projects \n•\tCaptured IT requirements from Business Processes mapped and create Work Orders for IT to provide estimates/schedules and solution recommendations \n•\tProject managed the portfolio of IT initiatives and gained PCI-DSS Compliance for Australia Post across a number of Credit Data Environments. \n \nSenior Project Manager – Enterprise Online Verification EOV) and Proof of Age (POA) \n•\tPOA and WOV are the first of a number of Identity projects from Retail Digital Identity Services \n•\tCurrently managing EOV through Evaluate phase and POA through Delivery \n•\tEOV will have a Business Case ready by May 2013 and the first Proof of Age card will be delivered by July 2013 \n•\tLiaising with internal and external providers to achieve tight timelines and meet business expectations \nSenior Project Manager – Contact Centre & Customer Operations PC Asset Replacement \n•\tManaging the rollout of new hardware across Contact Centres and Customer Operations \n•\tReplacing over 700 PC’s across 3 sites Brisbane and Melbourne Senior Project Manager Australia Post December 2011  –  March 2015  (3 years 4 months) Online Program Delivery Manager Telstra November 2010  –  October 2011  (1 year) Melbourne Area, Australia Lead the On-Line Program Delivery Team across multiple projects to deliver capability on the Terlstra.com website. \nResponsibilities and Key Achievements \n•\tLead a team of Project Managers, Business Analysts, SME's and Testers \n•\tEnsure the efficient operation of the On-line program delivery team in the development of online capability, which drive customers to utilise on-line services.  \n•\tResponsible for effective management skills in order to lead a team to deliver value added on-line applications and enhancements that allow customers to Buy, Manage their Account and Self Serve. \n•\tEnsure that Telstra on-line channel workloads are prioritised and executed in line with operational capability, customer needs and resource and budget \n•\tRegularly monitor the performance of various online applications to ensure business and customer benefits are maximised.  \n•\tMonitor effectiveness of the Online channel and recommend actions to improve performance to target \n•\tManaging project scope, key stakeholders and business requirements  \n•\tCommunicating and ensuring the understanding of agreed project objectives to project team members.  \n•\tManaging deadlines, budget and funds and escalating unanticipated variations for approval.  \n•\tEnsuring Business Requirements are captured and has been approved by the relevant stakeholders. Senior Consultant UXC Consulting January 2008  –  July 2010  (2 years 7 months) Melbourne Area, Australia Senior Consultant engaged on the following assignments: \nLead Business Analyst, Institutional Business Systems, ANZ \nHuman Resources Transformation Program Manager, WHK Group \nSenior Consultant, Service Oriented Architecture (SOA), Myer \nProject Manager, Enterprise Program Management (EPM), Telstra \nProject Portfolio Manager, Management Information, Reporting & Analytics (MIRA), Telstra \nSenior Project Manager, ANZ Bank Management Consultant Lina Consulting Ltd May 2005  –  October 2007  (2 years 6 months) United Kingdom Project Manager, E-On UK \nProject Manager, British Telecommunications (BT) \nProject Manager, London Borough of Lambeth \nCRM Consultant, Charnwood Borough Council \nSenior Business Analyst, Coventry City Council IT & Operations Director 4Si Solutions Ltd May 2003  –  May 2005  (2 years 1 month) United Kingdom Responsible for developing IT and operations strategy for the new company \n•\tAchieved Canon dealership status within six months as a direct result of presenting IT and operations strategy and business plan to Canon. \n•\tDeveloped infrastructure, applications and processes, enabling the company to grow rapidly, partnering with technical organisations and high profile clients throughout the UK. Manager of Customer Relationship Management Merrill Lynch HSBC April 2001  –  July 2002  (1 year 4 months) United Kingdom Delivered large technical and non-technical programs of work and best practices to international organisation with redefinition and delivery of CRM strategy and solutions. \n•\tPlanned CRM program management and client operational information management initiatives. \n•\tReporting to the COO and placed in charge of planning and prioritising all CRM projects and initiatives. \n•\tDelivered Siebel Sales, e-Marketing and Call Centre for Financial Services. \n•\tIdentified performance improvement initiatives and produced benefit cases and applied project management methodology to develop the associated software and web-based systems. \n•\tManaged the development, implementation and testing of new processes, systems, change and business process re-engineering to the call centre. \n•\tDelivered tax reporting capabilities to UK and international clients. \n•\tMaximised the full capabilities of Siebel Call Centre module integrated with back office systems. \n•\tManaged systems integrator, IBM and set up a program Management framework of tools and templates to govern projects consistently. Business Project Manager Cable & Wireless September 1999  –  March 2001  (1 year 7 months) United Kingdom Engaged to CRM team in the Global Transformation/Change program. Responsible for defining CRM strategy and delivering both Siebel and CRM programs to the UK and scale-up for global rollout. \n•\tDefined Siebel forecasting strategy and aligned sales forecasts with business planning by sharing information with SAP. \n•\tOnline program management office system to enable project managers to design programs, upload plans, manage benefits, monitor risks and issues, produce highlight or progress reports, manage stakeholder communications and provided an interface with program support. \n•\tManaged multiple internal and external teams to deliver campaign analysis and management, lead management, reporting and prospect data management capabilities. \n•\tManaged systems integrator, IBM and business integrator, PriceWaterhouseCoopers through entire SDLC which included test and release management Project Manager Premier Screw & Repetition August 1998  –  September 1999  (1 year 2 months) Leicester, United Kingdom Engaged to redefine the IT strategy and implement new network, including training. \n•\tProject managed Year 2000 project to ensure all systems could survive Year 2000 roll-over. \n•\tUndertook business analysis to identify improvements in systems and process and designed IT strategy to improve the systems in the organisation. \n•\tDelivered both infrastructure and applications projects from requirements capture to training and UAT \n•\tManaged vendor selection and delivery of new server, network and desktop environment. Project Manager/Senior Business Analyst BAE Systems May 1997  –  July 1998  (1 year 3 months) United Kingdom •\tIdentified IT requirements to automate new processes; and produced training and development strategy for effective delivery of new processes using Business Process Re-Engineering (BPM) and organisation-wide IT. \n•\tProject Manager of Communications on corporate Year 2000 program. \n•\tDelivered business case, Business Process Management (BPM) for BAAN ERP. Design Engineer Rolls-Royce February 1997  –  May 1997  (4 months) Derby, United Kingdom Contract Role: Design Nuclear Fuel Handling Equipment for Naval Submarines. Senior Project Manager Schweppes Australia March 2015  – Present (6 months) Melbourne Area, Australia Project Manager – Trade Promotion Management (TPM) \n Joined Project immediately after the Business Case was approved and Project Delivery had commenced \n Responsible and accountable for the whole project including delivery technical, business process and people capability change \n Managed Systems Integrator, UXC Red Rock to deliver Oracle’s Demantra TPM solution \nManaged Business Process and Business Benefits vendor, PwC \n Managed Project Team involving, Project Technical Lead, Business Lead, Change Manager, \nTechnical Solution Architect, Vendor Project Leads, Test Manager and SME’s. \n Delivered first 3 stages of a 9 stage project including Feasibility, Plan and Proof of Concept Build. \n Managed the build of integrations between Demantra and SAP ERP Senior Project Manager Schweppes Australia March 2015  – Present (6 months) Melbourne Area, Australia Project Manager – Trade Promotion Management (TPM) \n Joined Project immediately after the Business Case was approved and Project Delivery had commenced \n Responsible and accountable for the whole project including delivery technical, business process and people capability change \n Managed Systems Integrator, UXC Red Rock to deliver Oracle’s Demantra TPM solution \nManaged Business Process and Business Benefits vendor, PwC \n Managed Project Team involving, Project Technical Lead, Business Lead, Change Manager, \nTechnical Solution Architect, Vendor Project Leads, Test Manager and SME’s. \n Delivered first 3 stages of a 9 stage project including Feasibility, Plan and Proof of Concept Build. \n Managed the build of integrations between Demantra and SAP ERP Senior Project Manager Schweppes Australia March 2015  – Present (6 months) Melbourne Area, Australia Senior Project Manager Schweppes Australia March 2015  – Present (6 months) Melbourne Area, Australia Senior Project Manager Australia Post December 2011  –  March 2015  (3 years 4 months) Melbourne Area, Australia Initiated the workforce access project from the Idea phase for Corporate Affairs. Provided a single channel for the CardSafe (PCI-DSS) Program to engage IT with a number of projects.  \nResponsibilities and Key Achievements \n \nSenior Project Manager – Workforce Access: \n•\tManaged a team to pull together a business case for the workforce access project \n•\tThe objective of the project was to roll out the Intranet to a wider workforce within Australia Post \n•\tLead a team consisting of Solution Architect, Business Analyst, Technical Designers, Developers and Infrastructure Resources \n \nIT Engagement Manager – CardSafe: \n•\tCreated an IT engagement model and process to fast-track IT requirements from the project \n•\tProvided the CardSafe PCI-DSS compliance project with a single point of contact for all IT engagement projects \n•\tCaptured IT requirements from Business Processes mapped and create Work Orders for IT to provide estimates/schedules and solution recommendations \n•\tProject managed the portfolio of IT initiatives and gained PCI-DSS Compliance for Australia Post across a number of Credit Data Environments. \n \nSenior Project Manager – Enterprise Online Verification EOV) and Proof of Age (POA) \n•\tPOA and WOV are the first of a number of Identity projects from Retail Digital Identity Services \n•\tCurrently managing EOV through Evaluate phase and POA through Delivery \n•\tEOV will have a Business Case ready by May 2013 and the first Proof of Age card will be delivered by July 2013 \n•\tLiaising with internal and external providers to achieve tight timelines and meet business expectations \nSenior Project Manager – Contact Centre & Customer Operations PC Asset Replacement \n•\tManaging the rollout of new hardware across Contact Centres and Customer Operations \n•\tReplacing over 700 PC’s across 3 sites Brisbane and Melbourne Senior Project Manager Australia Post December 2011  –  March 2015  (3 years 4 months) Melbourne Area, Australia Initiated the workforce access project from the Idea phase for Corporate Affairs. Provided a single channel for the CardSafe (PCI-DSS) Program to engage IT with a number of projects.  \nResponsibilities and Key Achievements \n \nSenior Project Manager – Workforce Access: \n•\tManaged a team to pull together a business case for the workforce access project \n•\tThe objective of the project was to roll out the Intranet to a wider workforce within Australia Post \n•\tLead a team consisting of Solution Architect, Business Analyst, Technical Designers, Developers and Infrastructure Resources \n \nIT Engagement Manager – CardSafe: \n•\tCreated an IT engagement model and process to fast-track IT requirements from the project \n•\tProvided the CardSafe PCI-DSS compliance project with a single point of contact for all IT engagement projects \n•\tCaptured IT requirements from Business Processes mapped and create Work Orders for IT to provide estimates/schedules and solution recommendations \n•\tProject managed the portfolio of IT initiatives and gained PCI-DSS Compliance for Australia Post across a number of Credit Data Environments. \n \nSenior Project Manager – Enterprise Online Verification EOV) and Proof of Age (POA) \n•\tPOA and WOV are the first of a number of Identity projects from Retail Digital Identity Services \n•\tCurrently managing EOV through Evaluate phase and POA through Delivery \n•\tEOV will have a Business Case ready by May 2013 and the first Proof of Age card will be delivered by July 2013 \n•\tLiaising with internal and external providers to achieve tight timelines and meet business expectations \nSenior Project Manager – Contact Centre & Customer Operations PC Asset Replacement \n•\tManaging the rollout of new hardware across Contact Centres and Customer Operations \n•\tReplacing over 700 PC’s across 3 sites Brisbane and Melbourne Senior Project Manager Australia Post December 2011  –  March 2015  (3 years 4 months) Senior Project Manager Australia Post December 2011  –  March 2015  (3 years 4 months) Online Program Delivery Manager Telstra November 2010  –  October 2011  (1 year) Melbourne Area, Australia Lead the On-Line Program Delivery Team across multiple projects to deliver capability on the Terlstra.com website. \nResponsibilities and Key Achievements \n•\tLead a team of Project Managers, Business Analysts, SME's and Testers \n•\tEnsure the efficient operation of the On-line program delivery team in the development of online capability, which drive customers to utilise on-line services.  \n•\tResponsible for effective management skills in order to lead a team to deliver value added on-line applications and enhancements that allow customers to Buy, Manage their Account and Self Serve. \n•\tEnsure that Telstra on-line channel workloads are prioritised and executed in line with operational capability, customer needs and resource and budget \n•\tRegularly monitor the performance of various online applications to ensure business and customer benefits are maximised.  \n•\tMonitor effectiveness of the Online channel and recommend actions to improve performance to target \n•\tManaging project scope, key stakeholders and business requirements  \n•\tCommunicating and ensuring the understanding of agreed project objectives to project team members.  \n•\tManaging deadlines, budget and funds and escalating unanticipated variations for approval.  \n•\tEnsuring Business Requirements are captured and has been approved by the relevant stakeholders. Online Program Delivery Manager Telstra November 2010  –  October 2011  (1 year) Melbourne Area, Australia Lead the On-Line Program Delivery Team across multiple projects to deliver capability on the Terlstra.com website. \nResponsibilities and Key Achievements \n•\tLead a team of Project Managers, Business Analysts, SME's and Testers \n•\tEnsure the efficient operation of the On-line program delivery team in the development of online capability, which drive customers to utilise on-line services.  \n•\tResponsible for effective management skills in order to lead a team to deliver value added on-line applications and enhancements that allow customers to Buy, Manage their Account and Self Serve. \n•\tEnsure that Telstra on-line channel workloads are prioritised and executed in line with operational capability, customer needs and resource and budget \n•\tRegularly monitor the performance of various online applications to ensure business and customer benefits are maximised.  \n•\tMonitor effectiveness of the Online channel and recommend actions to improve performance to target \n•\tManaging project scope, key stakeholders and business requirements  \n•\tCommunicating and ensuring the understanding of agreed project objectives to project team members.  \n•\tManaging deadlines, budget and funds and escalating unanticipated variations for approval.  \n•\tEnsuring Business Requirements are captured and has been approved by the relevant stakeholders. Senior Consultant UXC Consulting January 2008  –  July 2010  (2 years 7 months) Melbourne Area, Australia Senior Consultant engaged on the following assignments: \nLead Business Analyst, Institutional Business Systems, ANZ \nHuman Resources Transformation Program Manager, WHK Group \nSenior Consultant, Service Oriented Architecture (SOA), Myer \nProject Manager, Enterprise Program Management (EPM), Telstra \nProject Portfolio Manager, Management Information, Reporting & Analytics (MIRA), Telstra \nSenior Project Manager, ANZ Bank Senior Consultant UXC Consulting January 2008  –  July 2010  (2 years 7 months) Melbourne Area, Australia Senior Consultant engaged on the following assignments: \nLead Business Analyst, Institutional Business Systems, ANZ \nHuman Resources Transformation Program Manager, WHK Group \nSenior Consultant, Service Oriented Architecture (SOA), Myer \nProject Manager, Enterprise Program Management (EPM), Telstra \nProject Portfolio Manager, Management Information, Reporting & Analytics (MIRA), Telstra \nSenior Project Manager, ANZ Bank Management Consultant Lina Consulting Ltd May 2005  –  October 2007  (2 years 6 months) United Kingdom Project Manager, E-On UK \nProject Manager, British Telecommunications (BT) \nProject Manager, London Borough of Lambeth \nCRM Consultant, Charnwood Borough Council \nSenior Business Analyst, Coventry City Council Management Consultant Lina Consulting Ltd May 2005  –  October 2007  (2 years 6 months) United Kingdom Project Manager, E-On UK \nProject Manager, British Telecommunications (BT) \nProject Manager, London Borough of Lambeth \nCRM Consultant, Charnwood Borough Council \nSenior Business Analyst, Coventry City Council IT & Operations Director 4Si Solutions Ltd May 2003  –  May 2005  (2 years 1 month) United Kingdom Responsible for developing IT and operations strategy for the new company \n•\tAchieved Canon dealership status within six months as a direct result of presenting IT and operations strategy and business plan to Canon. \n•\tDeveloped infrastructure, applications and processes, enabling the company to grow rapidly, partnering with technical organisations and high profile clients throughout the UK. IT & Operations Director 4Si Solutions Ltd May 2003  –  May 2005  (2 years 1 month) United Kingdom Responsible for developing IT and operations strategy for the new company \n•\tAchieved Canon dealership status within six months as a direct result of presenting IT and operations strategy and business plan to Canon. \n•\tDeveloped infrastructure, applications and processes, enabling the company to grow rapidly, partnering with technical organisations and high profile clients throughout the UK. Manager of Customer Relationship Management Merrill Lynch HSBC April 2001  –  July 2002  (1 year 4 months) United Kingdom Delivered large technical and non-technical programs of work and best practices to international organisation with redefinition and delivery of CRM strategy and solutions. \n•\tPlanned CRM program management and client operational information management initiatives. \n•\tReporting to the COO and placed in charge of planning and prioritising all CRM projects and initiatives. \n•\tDelivered Siebel Sales, e-Marketing and Call Centre for Financial Services. \n•\tIdentified performance improvement initiatives and produced benefit cases and applied project management methodology to develop the associated software and web-based systems. \n•\tManaged the development, implementation and testing of new processes, systems, change and business process re-engineering to the call centre. \n•\tDelivered tax reporting capabilities to UK and international clients. \n•\tMaximised the full capabilities of Siebel Call Centre module integrated with back office systems. \n•\tManaged systems integrator, IBM and set up a program Management framework of tools and templates to govern projects consistently. Manager of Customer Relationship Management Merrill Lynch HSBC April 2001  –  July 2002  (1 year 4 months) United Kingdom Delivered large technical and non-technical programs of work and best practices to international organisation with redefinition and delivery of CRM strategy and solutions. \n•\tPlanned CRM program management and client operational information management initiatives. \n•\tReporting to the COO and placed in charge of planning and prioritising all CRM projects and initiatives. \n•\tDelivered Siebel Sales, e-Marketing and Call Centre for Financial Services. \n•\tIdentified performance improvement initiatives and produced benefit cases and applied project management methodology to develop the associated software and web-based systems. \n•\tManaged the development, implementation and testing of new processes, systems, change and business process re-engineering to the call centre. \n•\tDelivered tax reporting capabilities to UK and international clients. \n•\tMaximised the full capabilities of Siebel Call Centre module integrated with back office systems. \n•\tManaged systems integrator, IBM and set up a program Management framework of tools and templates to govern projects consistently. Business Project Manager Cable & Wireless September 1999  –  March 2001  (1 year 7 months) United Kingdom Engaged to CRM team in the Global Transformation/Change program. Responsible for defining CRM strategy and delivering both Siebel and CRM programs to the UK and scale-up for global rollout. \n•\tDefined Siebel forecasting strategy and aligned sales forecasts with business planning by sharing information with SAP. \n•\tOnline program management office system to enable project managers to design programs, upload plans, manage benefits, monitor risks and issues, produce highlight or progress reports, manage stakeholder communications and provided an interface with program support. \n•\tManaged multiple internal and external teams to deliver campaign analysis and management, lead management, reporting and prospect data management capabilities. \n•\tManaged systems integrator, IBM and business integrator, PriceWaterhouseCoopers through entire SDLC which included test and release management Business Project Manager Cable & Wireless September 1999  –  March 2001  (1 year 7 months) United Kingdom Engaged to CRM team in the Global Transformation/Change program. Responsible for defining CRM strategy and delivering both Siebel and CRM programs to the UK and scale-up for global rollout. \n•\tDefined Siebel forecasting strategy and aligned sales forecasts with business planning by sharing information with SAP. \n•\tOnline program management office system to enable project managers to design programs, upload plans, manage benefits, monitor risks and issues, produce highlight or progress reports, manage stakeholder communications and provided an interface with program support. \n•\tManaged multiple internal and external teams to deliver campaign analysis and management, lead management, reporting and prospect data management capabilities. \n•\tManaged systems integrator, IBM and business integrator, PriceWaterhouseCoopers through entire SDLC which included test and release management Project Manager Premier Screw & Repetition August 1998  –  September 1999  (1 year 2 months) Leicester, United Kingdom Engaged to redefine the IT strategy and implement new network, including training. \n•\tProject managed Year 2000 project to ensure all systems could survive Year 2000 roll-over. \n•\tUndertook business analysis to identify improvements in systems and process and designed IT strategy to improve the systems in the organisation. \n•\tDelivered both infrastructure and applications projects from requirements capture to training and UAT \n•\tManaged vendor selection and delivery of new server, network and desktop environment. Project Manager Premier Screw & Repetition August 1998  –  September 1999  (1 year 2 months) Leicester, United Kingdom Engaged to redefine the IT strategy and implement new network, including training. \n•\tProject managed Year 2000 project to ensure all systems could survive Year 2000 roll-over. \n•\tUndertook business analysis to identify improvements in systems and process and designed IT strategy to improve the systems in the organisation. \n•\tDelivered both infrastructure and applications projects from requirements capture to training and UAT \n•\tManaged vendor selection and delivery of new server, network and desktop environment. Project Manager/Senior Business Analyst BAE Systems May 1997  –  July 1998  (1 year 3 months) United Kingdom •\tIdentified IT requirements to automate new processes; and produced training and development strategy for effective delivery of new processes using Business Process Re-Engineering (BPM) and organisation-wide IT. \n•\tProject Manager of Communications on corporate Year 2000 program. \n•\tDelivered business case, Business Process Management (BPM) for BAAN ERP. Project Manager/Senior Business Analyst BAE Systems May 1997  –  July 1998  (1 year 3 months) United Kingdom •\tIdentified IT requirements to automate new processes; and produced training and development strategy for effective delivery of new processes using Business Process Re-Engineering (BPM) and organisation-wide IT. \n•\tProject Manager of Communications on corporate Year 2000 program. \n•\tDelivered business case, Business Process Management (BPM) for BAAN ERP. Design Engineer Rolls-Royce February 1997  –  May 1997  (4 months) Derby, United Kingdom Contract Role: Design Nuclear Fuel Handling Equipment for Naval Submarines. Design Engineer Rolls-Royce February 1997  –  May 1997  (4 months) Derby, United Kingdom Contract Role: Design Nuclear Fuel Handling Equipment for Naval Submarines. Skills Business Process Business Process... IT Strategy CRM Business Analysis Strategy Project Portfolio... Project Management Management Project Delivery PMO Skills  Business Process Business Process... IT Strategy CRM Business Analysis Strategy Project Portfolio... Project Management Management Project Delivery PMO Business Process Business Process... IT Strategy CRM Business Analysis Strategy Project Portfolio... Project Management Management Project Delivery PMO Business Process Business Process... IT Strategy CRM Business Analysis Strategy Project Portfolio... Project Management Management Project Delivery PMO Education Kingston University MSc,  Manufacturing Systems 1995  – 1996 University of Manchester - Institute of Science and Technology BEng,  Mechanical Engineering 1990  – 1994 Kingston University MSc,  Manufacturing Systems 1995  – 1996 Kingston University MSc,  Manufacturing Systems 1995  – 1996 Kingston University MSc,  Manufacturing Systems 1995  – 1996 University of Manchester - Institute of Science and Technology BEng,  Mechanical Engineering 1990  – 1994 University of Manchester - Institute of Science and Technology BEng,  Mechanical Engineering 1990  – 1994 University of Manchester - Institute of Science and Technology BEng,  Mechanical Engineering 1990  – 1994 ", "Summary Office Manager responsible for all administrative tasks, inventory control and procurement, shipping & receiving, database & record management, and bookkeeping. Technical background in systems programming, systems integration solutions and database design & implementation. Excellent office and technical skills, expert project planning & management, outstanding communication and organizational skills with high level of commitment to customer satisfaction. Summary Office Manager responsible for all administrative tasks, inventory control and procurement, shipping & receiving, database & record management, and bookkeeping. Technical background in systems programming, systems integration solutions and database design & implementation. Excellent office and technical skills, expert project planning & management, outstanding communication and organizational skills with high level of commitment to customer satisfaction. Office Manager responsible for all administrative tasks, inventory control and procurement, shipping & receiving, database & record management, and bookkeeping. Technical background in systems programming, systems integration solutions and database design & implementation. Excellent office and technical skills, expert project planning & management, outstanding communication and organizational skills with high level of commitment to customer satisfaction. Office Manager responsible for all administrative tasks, inventory control and procurement, shipping & receiving, database & record management, and bookkeeping. Technical background in systems programming, systems integration solutions and database design & implementation. Excellent office and technical skills, expert project planning & management, outstanding communication and organizational skills with high level of commitment to customer satisfaction. Experience Office Manager dB Innovations, LLC March 2011  – Present (4 years 6 months) Endicott, NY Office Manager for Electronics Manufacturing company performing all administrative, inventory control and ordering, shipping and receiving, and bookkeeping/basic accounting tasks. Developed spreadsheets for tracking schedules, product orders, system repairs and completed work. Daily professional interaction with engineers, subcontractors, vendors, technicians, sales personnel and customers to prioritize and schedule work, ensure customer requirements are met and problems are resolved, price and procure parts, and provide technical and administrative information as needed. Extensive experience using Parts and Vendors Inventory software to track all system parts, vendor information, assemblies, cost and pricing. Designed, implemented and continually maintain parts stockroom. Extensive experience using Peachtree Accounting software, performing all accounts payable and receivable tasks, account reconciliation, bill payments, banking and end of year preparation for taxes. Designed and created database using Microsoft Access to track vendor part repairs, including repair history, customer impact and repair cost. Responsible for testing new software releases for new/upgraded products and editing new/updated technical user manuals. Community Volunteer Community January 1996  – Present (19 years 8 months) Active volunteer and leader in community, school and church organizations. Co-leader for chapter of international Mothers and Families organization (Mothers & More - 100+ local members). Provided event planning - social, educational, community outreach, etc; oversaw all committees; maintained schedules; wrote newsletter column; helped plan and maintain financial budget; led monthly meetings; assisted in fundraising; provided newspaper and tv publicity. School PTA vice president and program chairperson. Coordinated large programs; planned and maintained financial budgets; planned and assisted in fundraising; interfaced with program chairmen, teachers, administration & students. Church religious education teacher. Planned weekly lessons and provided classroom instruction. School Cross Country Booster Club Chairperson. Coordinate fundraising activities; work with coaches to plan and implement team events. Teacher Aide and Office Clerk Union Endicott CSD September 2007  –  March 2011  (3 years 7 months) Substitute teacher aide in the Union Endicott schools as well as a substitute typist in the school main offices and health clerk in the health offices. As a teacher aide, worked as a classroom aide, as a Special Ed program aide, as a computer lab aide and as a one-on-one student aide. Worked in four long-term substitute aide positions (approximately 2 months each) as well as worked on a day-to-day on-call basis. As substitute office personnel, answered phones, interfaced with parents and children school staff, did clerical work and provided some basic medical assistance and recordkeeping. Systems Programmer/Integrator Lockheed Martin February 1992  –  November 1998  (6 years 10 months) Owego, NY Software Programmer/Integrator supporting internal and external Integrated Logistics Support (ILS) customers. Designed, programmed and integrated software and databases to build MIL standard systems and tools used by technical manuals, parts provisioning, logistics engineering and training personnel. Extensively interfaced with customers, on- and offsite. Provided technical support in analyzing customer requirements, writing and editing proposals. Using object-oriented technology, designed and implemented prototype digital data repository system focused on storing Interactive Electronic Technical Manual (IETM) data. Based on prototype, developed Technical Document Management system used for electronic technical manual configuration management, revision control, data reuse, etc. Systems Integrator IBM November 1990  –  February 1992  (1 year 4 months) Manassas, VA Systems Integrator for IBM Federal Systems’ customers. Analyzed customer requirements, developed and implemented system solutions by integrating COTS (commercial off-the-shelf) products. Wrote, edited and reviewed technical sections of customer proposals. Extensively interfaced with customers, vendors, program office, procurement, marketing, engineering and legal. Lead systems integrator for Navy document management and publishing system prototype. Systems Programmer IBM June 1984  –  November 1990  (6 years 6 months) Owego, NY Systems Programmer for mainframe MVS support team, providing system support through software installation/customization, problem resolution, system performance analysis and improvement. Extensively interfaced with IBM internal customers. Designed and implemented integrated suite of MVS software products for distribution at all IBM Northeast Region locations. Office Manager dB Innovations, LLC March 2011  – Present (4 years 6 months) Endicott, NY Office Manager for Electronics Manufacturing company performing all administrative, inventory control and ordering, shipping and receiving, and bookkeeping/basic accounting tasks. Developed spreadsheets for tracking schedules, product orders, system repairs and completed work. Daily professional interaction with engineers, subcontractors, vendors, technicians, sales personnel and customers to prioritize and schedule work, ensure customer requirements are met and problems are resolved, price and procure parts, and provide technical and administrative information as needed. Extensive experience using Parts and Vendors Inventory software to track all system parts, vendor information, assemblies, cost and pricing. Designed, implemented and continually maintain parts stockroom. Extensive experience using Peachtree Accounting software, performing all accounts payable and receivable tasks, account reconciliation, bill payments, banking and end of year preparation for taxes. Designed and created database using Microsoft Access to track vendor part repairs, including repair history, customer impact and repair cost. Responsible for testing new software releases for new/upgraded products and editing new/updated technical user manuals. Office Manager dB Innovations, LLC March 2011  – Present (4 years 6 months) Endicott, NY Office Manager for Electronics Manufacturing company performing all administrative, inventory control and ordering, shipping and receiving, and bookkeeping/basic accounting tasks. Developed spreadsheets for tracking schedules, product orders, system repairs and completed work. Daily professional interaction with engineers, subcontractors, vendors, technicians, sales personnel and customers to prioritize and schedule work, ensure customer requirements are met and problems are resolved, price and procure parts, and provide technical and administrative information as needed. Extensive experience using Parts and Vendors Inventory software to track all system parts, vendor information, assemblies, cost and pricing. Designed, implemented and continually maintain parts stockroom. Extensive experience using Peachtree Accounting software, performing all accounts payable and receivable tasks, account reconciliation, bill payments, banking and end of year preparation for taxes. Designed and created database using Microsoft Access to track vendor part repairs, including repair history, customer impact and repair cost. Responsible for testing new software releases for new/upgraded products and editing new/updated technical user manuals. Community Volunteer Community January 1996  – Present (19 years 8 months) Active volunteer and leader in community, school and church organizations. Co-leader for chapter of international Mothers and Families organization (Mothers & More - 100+ local members). Provided event planning - social, educational, community outreach, etc; oversaw all committees; maintained schedules; wrote newsletter column; helped plan and maintain financial budget; led monthly meetings; assisted in fundraising; provided newspaper and tv publicity. School PTA vice president and program chairperson. Coordinated large programs; planned and maintained financial budgets; planned and assisted in fundraising; interfaced with program chairmen, teachers, administration & students. Church religious education teacher. Planned weekly lessons and provided classroom instruction. School Cross Country Booster Club Chairperson. Coordinate fundraising activities; work with coaches to plan and implement team events. Community Volunteer Community January 1996  – Present (19 years 8 months) Active volunteer and leader in community, school and church organizations. Co-leader for chapter of international Mothers and Families organization (Mothers & More - 100+ local members). Provided event planning - social, educational, community outreach, etc; oversaw all committees; maintained schedules; wrote newsletter column; helped plan and maintain financial budget; led monthly meetings; assisted in fundraising; provided newspaper and tv publicity. School PTA vice president and program chairperson. Coordinated large programs; planned and maintained financial budgets; planned and assisted in fundraising; interfaced with program chairmen, teachers, administration & students. Church religious education teacher. Planned weekly lessons and provided classroom instruction. School Cross Country Booster Club Chairperson. Coordinate fundraising activities; work with coaches to plan and implement team events. Teacher Aide and Office Clerk Union Endicott CSD September 2007  –  March 2011  (3 years 7 months) Substitute teacher aide in the Union Endicott schools as well as a substitute typist in the school main offices and health clerk in the health offices. As a teacher aide, worked as a classroom aide, as a Special Ed program aide, as a computer lab aide and as a one-on-one student aide. Worked in four long-term substitute aide positions (approximately 2 months each) as well as worked on a day-to-day on-call basis. As substitute office personnel, answered phones, interfaced with parents and children school staff, did clerical work and provided some basic medical assistance and recordkeeping. Teacher Aide and Office Clerk Union Endicott CSD September 2007  –  March 2011  (3 years 7 months) Substitute teacher aide in the Union Endicott schools as well as a substitute typist in the school main offices and health clerk in the health offices. As a teacher aide, worked as a classroom aide, as a Special Ed program aide, as a computer lab aide and as a one-on-one student aide. Worked in four long-term substitute aide positions (approximately 2 months each) as well as worked on a day-to-day on-call basis. As substitute office personnel, answered phones, interfaced with parents and children school staff, did clerical work and provided some basic medical assistance and recordkeeping. Systems Programmer/Integrator Lockheed Martin February 1992  –  November 1998  (6 years 10 months) Owego, NY Software Programmer/Integrator supporting internal and external Integrated Logistics Support (ILS) customers. Designed, programmed and integrated software and databases to build MIL standard systems and tools used by technical manuals, parts provisioning, logistics engineering and training personnel. Extensively interfaced with customers, on- and offsite. Provided technical support in analyzing customer requirements, writing and editing proposals. Using object-oriented technology, designed and implemented prototype digital data repository system focused on storing Interactive Electronic Technical Manual (IETM) data. Based on prototype, developed Technical Document Management system used for electronic technical manual configuration management, revision control, data reuse, etc. Systems Programmer/Integrator Lockheed Martin February 1992  –  November 1998  (6 years 10 months) Owego, NY Software Programmer/Integrator supporting internal and external Integrated Logistics Support (ILS) customers. Designed, programmed and integrated software and databases to build MIL standard systems and tools used by technical manuals, parts provisioning, logistics engineering and training personnel. Extensively interfaced with customers, on- and offsite. Provided technical support in analyzing customer requirements, writing and editing proposals. Using object-oriented technology, designed and implemented prototype digital data repository system focused on storing Interactive Electronic Technical Manual (IETM) data. Based on prototype, developed Technical Document Management system used for electronic technical manual configuration management, revision control, data reuse, etc. Systems Integrator IBM November 1990  –  February 1992  (1 year 4 months) Manassas, VA Systems Integrator for IBM Federal Systems’ customers. Analyzed customer requirements, developed and implemented system solutions by integrating COTS (commercial off-the-shelf) products. Wrote, edited and reviewed technical sections of customer proposals. Extensively interfaced with customers, vendors, program office, procurement, marketing, engineering and legal. Lead systems integrator for Navy document management and publishing system prototype. Systems Integrator IBM November 1990  –  February 1992  (1 year 4 months) Manassas, VA Systems Integrator for IBM Federal Systems’ customers. Analyzed customer requirements, developed and implemented system solutions by integrating COTS (commercial off-the-shelf) products. Wrote, edited and reviewed technical sections of customer proposals. Extensively interfaced with customers, vendors, program office, procurement, marketing, engineering and legal. Lead systems integrator for Navy document management and publishing system prototype. Systems Programmer IBM June 1984  –  November 1990  (6 years 6 months) Owego, NY Systems Programmer for mainframe MVS support team, providing system support through software installation/customization, problem resolution, system performance analysis and improvement. Extensively interfaced with IBM internal customers. Designed and implemented integrated suite of MVS software products for distribution at all IBM Northeast Region locations. Systems Programmer IBM June 1984  –  November 1990  (6 years 6 months) Owego, NY Systems Programmer for mainframe MVS support team, providing system support through software installation/customization, problem resolution, system performance analysis and improvement. Extensively interfaced with IBM internal customers. Designed and implemented integrated suite of MVS software products for distribution at all IBM Northeast Region locations. Skills Educational Leadership Customer Service Event Planning Microsoft Office Classroom Management Educational Technology Early Childhood... Community Outreach Nonprofits Lesson Planning Special Education Elementary Education Public Speaking Tutoring Project Planning Leadership Writing & Editing Databases Inventory Management Bookkeeping Systems Integration Organization Proposal Writing Office Management See 9+     See less Skills  Educational Leadership Customer Service Event Planning Microsoft Office Classroom Management Educational Technology Early Childhood... Community Outreach Nonprofits Lesson Planning Special Education Elementary Education Public Speaking Tutoring Project Planning Leadership Writing & Editing Databases Inventory Management Bookkeeping Systems Integration Organization Proposal Writing Office Management See 9+     See less Educational Leadership Customer Service Event Planning Microsoft Office Classroom Management Educational Technology Early Childhood... Community Outreach Nonprofits Lesson Planning Special Education Elementary Education Public Speaking Tutoring Project Planning Leadership Writing & Editing Databases Inventory Management Bookkeeping Systems Integration Organization Proposal Writing Office Management See 9+     See less Educational Leadership Customer Service Event Planning Microsoft Office Classroom Management Educational Technology Early Childhood... Community Outreach Nonprofits Lesson Planning Special Education Elementary Education Public Speaking Tutoring Project Planning Leadership Writing & Editing Databases Inventory Management Bookkeeping Systems Integration Organization Proposal Writing Office Management See 9+     See less Education Le Moyne College Bachelor of Arts (B.A.),  Computer Science 1980  – 1984 Minored in Business and Math Le Moyne College Bachelor of Arts (B.A.),  Computer Science 1980  – 1984 Minored in Business and Math Le Moyne College Bachelor of Arts (B.A.),  Computer Science 1980  – 1984 Minored in Business and Math Le Moyne College Bachelor of Arts (B.A.),  Computer Science 1980  – 1984 Minored in Business and Math ", "Experience Systems Integrator IBM Systems Integrator IBM Systems Integrator IBM Skills Requirements Analysis IT Strategy Disaster Recovery Business Intelligence Visio Enterprise Architecture Business Analysis Virtualization SDLC PMO Cloud Computing Integration SOA Software Development Project Management Program Management Vendor Management Software Project... IT Service Management IT Management Solution Architecture Project Portfolio... See 7+     See less Skills  Requirements Analysis IT Strategy Disaster Recovery Business Intelligence Visio Enterprise Architecture Business Analysis Virtualization SDLC PMO Cloud Computing Integration SOA Software Development Project Management Program Management Vendor Management Software Project... IT Service Management IT Management Solution Architecture Project Portfolio... See 7+     See less Requirements Analysis IT Strategy Disaster Recovery Business Intelligence Visio Enterprise Architecture Business Analysis Virtualization SDLC PMO Cloud Computing Integration SOA Software Development Project Management Program Management Vendor Management Software Project... IT Service Management IT Management Solution Architecture Project Portfolio... See 7+     See less Requirements Analysis IT Strategy Disaster Recovery Business Intelligence Visio Enterprise Architecture Business Analysis Virtualization SDLC PMO Cloud Computing Integration SOA Software Development Project Management Program Management Vendor Management Software Project... IT Service Management IT Management Solution Architecture Project Portfolio... See 7+     See less Education Pace University Bachelors,  Information Systems Pace University Bachelors,  Information Systems Pace University Bachelors,  Information Systems Pace University Bachelors,  Information Systems ", "Skills Vendor Management IT Strategy Program Management Project Management Management Strategy Business Process SDLC IT Management PMO SharePoint Quality Assurance Consulting Leadership Outsourcing Resource Management Software Development Project Planning Information Technology Business Analysis Disaster Recovery Process Improvement Change Management Management Consulting Business Intelligence Agile Methodologies Data Warehousing Operations Management Software Project... Business Process... Visio MS Project Budgets Telecommunications Agile Project Management Team Building Security Strategic Planning E-commerce Product Development Requirements Analysis Enterprise Architecture Databases Integration Project Portfolio... PMP CRM Cross-functional Team... See 33+     See less Skills  Vendor Management IT Strategy Program Management Project Management Management Strategy Business Process SDLC IT Management PMO SharePoint Quality Assurance Consulting Leadership Outsourcing Resource Management Software Development Project Planning Information Technology Business Analysis Disaster Recovery Process Improvement Change Management Management Consulting Business Intelligence Agile Methodologies Data Warehousing Operations Management Software Project... Business Process... Visio MS Project Budgets Telecommunications Agile Project Management Team Building Security Strategic Planning E-commerce Product Development Requirements Analysis Enterprise Architecture Databases Integration Project Portfolio... PMP CRM Cross-functional Team... See 33+     See less Vendor Management IT Strategy Program Management Project Management Management Strategy Business Process SDLC IT Management PMO SharePoint Quality Assurance Consulting Leadership Outsourcing Resource Management Software Development Project Planning Information Technology Business Analysis Disaster Recovery Process Improvement Change Management Management Consulting Business Intelligence Agile Methodologies Data Warehousing Operations Management Software Project... Business Process... Visio MS Project Budgets Telecommunications Agile Project Management Team Building Security Strategic Planning E-commerce Product Development Requirements Analysis Enterprise Architecture Databases Integration Project Portfolio... PMP CRM Cross-functional Team... See 33+     See less Vendor Management IT Strategy Program Management Project Management Management Strategy Business Process SDLC IT Management PMO SharePoint Quality Assurance Consulting Leadership Outsourcing Resource Management Software Development Project Planning Information Technology Business Analysis Disaster Recovery Process Improvement Change Management Management Consulting Business Intelligence Agile Methodologies Data Warehousing Operations Management Software Project... Business Process... Visio MS Project Budgets Telecommunications Agile Project Management Team Building Security Strategic Planning E-commerce Product Development Requirements Analysis Enterprise Architecture Databases Integration Project Portfolio... PMP CRM Cross-functional Team... See 33+     See less ", "Experience Account Manager - Major Accounts Experian Business Development Manager Experian - Corpfin August 2005  – Present (10 years 1 month) Manchester, United Kingdom - Field Based I manage ongoing relationships with Corpfin clients throughout the UK and generate New Business outside this customer base. The services we provide include M&A Data, Business Information, B2B Marketing Insight, Identity & Fraud solutions, Background Checking, Credit Risk data. Account Manager Byford Computer Services 2002  –  2005  (3 years) manchester UK - Field based B2B New Business Sales and Account Management. Focussed on Mobile computing, Networking, Software Sales. Byford were a systems integrator and IBM Business Partner. Partner Development Manager Cable & Wireless Communications 2001  –  2002  (1 year) Warrington, United Kingdom - Field Based Establishing a Partner Channel for a new Cable & Wireless SaaS offering. Account Manager Byford Computer Services Limited 1996  –  2001  (5 years) Manchester - Field Based B2B New Business Sales and Account Management. Focussed on Mobile computing, Networking, Software Sales. Byford were a systems integrator and IBM Business Partner. Account Manager - Major Accounts Experian Account Manager - Major Accounts Experian Business Development Manager Experian - Corpfin August 2005  – Present (10 years 1 month) Manchester, United Kingdom - Field Based I manage ongoing relationships with Corpfin clients throughout the UK and generate New Business outside this customer base. The services we provide include M&A Data, Business Information, B2B Marketing Insight, Identity & Fraud solutions, Background Checking, Credit Risk data. Business Development Manager Experian - Corpfin August 2005  – Present (10 years 1 month) Manchester, United Kingdom - Field Based I manage ongoing relationships with Corpfin clients throughout the UK and generate New Business outside this customer base. The services we provide include M&A Data, Business Information, B2B Marketing Insight, Identity & Fraud solutions, Background Checking, Credit Risk data. Account Manager Byford Computer Services 2002  –  2005  (3 years) manchester UK - Field based B2B New Business Sales and Account Management. Focussed on Mobile computing, Networking, Software Sales. Byford were a systems integrator and IBM Business Partner. Account Manager Byford Computer Services 2002  –  2005  (3 years) manchester UK - Field based B2B New Business Sales and Account Management. Focussed on Mobile computing, Networking, Software Sales. Byford were a systems integrator and IBM Business Partner. Partner Development Manager Cable & Wireless Communications 2001  –  2002  (1 year) Warrington, United Kingdom - Field Based Establishing a Partner Channel for a new Cable & Wireless SaaS offering. Partner Development Manager Cable & Wireless Communications 2001  –  2002  (1 year) Warrington, United Kingdom - Field Based Establishing a Partner Channel for a new Cable & Wireless SaaS offering. Account Manager Byford Computer Services Limited 1996  –  2001  (5 years) Manchester - Field Based B2B New Business Sales and Account Management. Focussed on Mobile computing, Networking, Software Sales. Byford were a systems integrator and IBM Business Partner. Account Manager Byford Computer Services Limited 1996  –  2001  (5 years) Manchester - Field Based B2B New Business Sales and Account Management. Focussed on Mobile computing, Networking, Software Sales. Byford were a systems integrator and IBM Business Partner. Languages Spanish Elementary proficiency Spanish Elementary proficiency Spanish Elementary proficiency Elementary proficiency Skills Corporate Finance Private Equity Mergers Venture Capital Business Strategy New Business Development Business Planning Business Development Strategy Business Acquisition Sales Negotiation Business Acumen Consultative Selling... SPIN Selling Cloud Computing SaaS Establishing Strategic... Customer Retention Channel Sales Presentations Corporate Recovery Data Analysis B2B Marketing Problem Solving Team Management Managed Services See 12+     See less Skills  Corporate Finance Private Equity Mergers Venture Capital Business Strategy New Business Development Business Planning Business Development Strategy Business Acquisition Sales Negotiation Business Acumen Consultative Selling... SPIN Selling Cloud Computing SaaS Establishing Strategic... Customer Retention Channel Sales Presentations Corporate Recovery Data Analysis B2B Marketing Problem Solving Team Management Managed Services See 12+     See less Corporate Finance Private Equity Mergers Venture Capital Business Strategy New Business Development Business Planning Business Development Strategy Business Acquisition Sales Negotiation Business Acumen Consultative Selling... SPIN Selling Cloud Computing SaaS Establishing Strategic... Customer Retention Channel Sales Presentations Corporate Recovery Data Analysis B2B Marketing Problem Solving Team Management Managed Services See 12+     See less Corporate Finance Private Equity Mergers Venture Capital Business Strategy New Business Development Business Planning Business Development Strategy Business Acquisition Sales Negotiation Business Acumen Consultative Selling... SPIN Selling Cloud Computing SaaS Establishing Strategic... Customer Retention Channel Sales Presentations Corporate Recovery Data Analysis B2B Marketing Problem Solving Team Management Managed Services See 12+     See less Education The University of Sheffield Bachelor of Arts (BA),  History 1988  – 1991 St Ambrose College, Hale Barns, Cheshire 1981  – 1988 The University of Sheffield Bachelor of Arts (BA),  History 1988  – 1991 The University of Sheffield Bachelor of Arts (BA),  History 1988  – 1991 The University of Sheffield Bachelor of Arts (BA),  History 1988  – 1991 St Ambrose College, Hale Barns, Cheshire 1981  – 1988 St Ambrose College, Hale Barns, Cheshire 1981  – 1988 St Ambrose College, Hale Barns, Cheshire 1981  – 1988 ", "Summary ◦ Solutions Design ◦ Systems and Technology Integration ◦ Technical Software Sales ◦ \n \nDeeply technical software systems integrator and developer with over 20 years experience at a Fortune 100 company. Equally comfortable engaging in technical sales, services, development, project management and instruction. Unique combination of leading edge, technical abilities and polished communication skills allows for flexible transitions within the sales cycle. Ability to function at any level in an organization to deliver consistently superior client satisfaction. Recognized as an innovator who strives for and exceeds standards in excellence. Ability to learn quickly demonstrated by successful career transitions among development, sales, consulting and services, as well as successful technical transitions to big data, cloud, Java and other emerging technologies. Continues to embrace new technical challenges. Summary ◦ Solutions Design ◦ Systems and Technology Integration ◦ Technical Software Sales ◦ \n \nDeeply technical software systems integrator and developer with over 20 years experience at a Fortune 100 company. Equally comfortable engaging in technical sales, services, development, project management and instruction. Unique combination of leading edge, technical abilities and polished communication skills allows for flexible transitions within the sales cycle. Ability to function at any level in an organization to deliver consistently superior client satisfaction. Recognized as an innovator who strives for and exceeds standards in excellence. Ability to learn quickly demonstrated by successful career transitions among development, sales, consulting and services, as well as successful technical transitions to big data, cloud, Java and other emerging technologies. Continues to embrace new technical challenges. ◦ Solutions Design ◦ Systems and Technology Integration ◦ Technical Software Sales ◦ \n \nDeeply technical software systems integrator and developer with over 20 years experience at a Fortune 100 company. Equally comfortable engaging in technical sales, services, development, project management and instruction. Unique combination of leading edge, technical abilities and polished communication skills allows for flexible transitions within the sales cycle. Ability to function at any level in an organization to deliver consistently superior client satisfaction. Recognized as an innovator who strives for and exceeds standards in excellence. Ability to learn quickly demonstrated by successful career transitions among development, sales, consulting and services, as well as successful technical transitions to big data, cloud, Java and other emerging technologies. Continues to embrace new technical challenges. ◦ Solutions Design ◦ Systems and Technology Integration ◦ Technical Software Sales ◦ \n \nDeeply technical software systems integrator and developer with over 20 years experience at a Fortune 100 company. Equally comfortable engaging in technical sales, services, development, project management and instruction. Unique combination of leading edge, technical abilities and polished communication skills allows for flexible transitions within the sales cycle. Ability to function at any level in an organization to deliver consistently superior client satisfaction. Recognized as an innovator who strives for and exceeds standards in excellence. Ability to learn quickly demonstrated by successful career transitions among development, sales, consulting and services, as well as successful technical transitions to big data, cloud, Java and other emerging technologies. Continues to embrace new technical challenges. Experience Executive IT Specialist, Deployment Software Engineer IBM Software Group, Information Management October 2010  – Present (4 years 11 months) Raleigh-Durham, North Carolina Area Reporting to IBM’s Big Data Software Development and Engineering organization, focusing on IBM BigInsights and related big data technologies. Responsible for leading, architecting, designing, coding and delivering prototypes that employ innovative approaches in this emerging field. Leveraging open source and IBM technologies such as Hadoop, HBase, Hive, Pig, Sqoop, BigSheets, Big SQL, R, Big R, Jaql, text analytics, geospatial and Eclipse development tooling to deliver insights and visualization of big data. Experience with numerous industries including finance, insurance, bioinformatics, healthcare, pharmaceutical, automotive, telecommunications and online marketing. \n•\tConsistently provided superior technical expertise resulting in approximately $7M of revenue over 3 years \n•\tDelivered successful client prototypes analyzing large volumes of structured and unstructured data using on-premises, cloud and hybrid solutions \n•\tRequested by upper management to lead critical, complex and challenging customer engagements to restore customer satisfaction \n•\tCreated intellectual capital and co-published a WebSphere Developers Domain article on big data application development \n•\tLed one year special development project under the CTO office to drive an innovative bioinformatics marketplace using a cloud environment with a large internationally dispersed development team Executive IT Specialist, Client Technical Specialist IBM Sales & Distribution June 1997  –  October 2010  (13 years 5 months) Raleigh-Durham, North Carolina Area Responsible for leading, designing and implementing prototypes for clients across North America using emerging technologies including application development of web, portal and mashup prototypes leveraging Java and Web 2.0 technologies applying SOA (Service-Oriented Architecture). Created servlets, portlets and widgets that integrate disparate applications, databases, messaging systems and other enterprise systems on various platforms. Provided prototypes, presentations and demonstrations that communicate business value of technical solutions. Mentored colleagues in both technical and professional careers. \n•\tConsistently delivered superior technical engagements resulting in many multi-million dollar wins \n•\tDelivered successful client prototypes involving complex integration of disparate technologies and applications \n•\tCreated worldwide instruction materials and IBM product certification exams \n•\tCo-led Portal and Mashups Technical Competency Council \n•\tPublished articles on WebSphere Developers Domain on portlet development Senior Software Engineer, Lead Systems Integrator IBM Software Group, Tivoli December 1994  –  June 1997  (2 years 7 months) Raleigh-Durham, North Carolina Area Responsible for leading and providing consulting and professional services in network and systems management to clients worldwide. \n•\tAtlanta Committee for the Olympic Games - Led 15-month project as the Lead Technical Systems Integrator for IBM’s involvement in network and systems management \n•\tEnterprise Summit Shoot Out - Lead presenter and systems integrator for two consecutive year wins for IBM Advisory Programmer, Brand Manager IBM Networking Software Division November 1992  –  December 1994  (2 years 2 months) Raleigh-Durham, North Carolina Area Brand Manager responsible for worldwide technical marketing of IBM’s network and systems management products and services, concentrating in automated operations and integration. Responsible for providing technical leadership on complex enterprise-wide management engagements. Advisory Systems Engineer, Networking Specialist IBM United States Marketing & Services December 1986  –  November 1992  (6 years) Greater Boston Area Responsible for providing contracted, fee-based consulting and services (1/91 to 11/92). Responsible for sales and implementation of IBM network products for cross industry accounts (12/86 to 1/91). Concentration in network and systems management utilizing the IBM Tivoli NetView family of products, controllers, modems and local area networks. Represented IBM nationally at trade shows and IBM user groups (TCA, COMNET, INTERFACE, SHARE, GUIDE) Senior Associate Engineer, Lead Project Engineer IBM General Technology Division July 1983  –  December 1986  (3 years 6 months) East Fishkill, New York Responsible for I/O circuit design, analysis and problem determination in bipolar semiconductor technologies. \n•\tAccurate and reliable circuit design including leadership of joint custom products with IBM lab in France \n•\tCo-author of three IBM Technical Disclosure Publications \n•\tRecipient of five Cost Effectiveness Awards for significant savings in manufacturing Executive IT Specialist, Deployment Software Engineer IBM Software Group, Information Management October 2010  – Present (4 years 11 months) Raleigh-Durham, North Carolina Area Reporting to IBM’s Big Data Software Development and Engineering organization, focusing on IBM BigInsights and related big data technologies. Responsible for leading, architecting, designing, coding and delivering prototypes that employ innovative approaches in this emerging field. Leveraging open source and IBM technologies such as Hadoop, HBase, Hive, Pig, Sqoop, BigSheets, Big SQL, R, Big R, Jaql, text analytics, geospatial and Eclipse development tooling to deliver insights and visualization of big data. Experience with numerous industries including finance, insurance, bioinformatics, healthcare, pharmaceutical, automotive, telecommunications and online marketing. \n•\tConsistently provided superior technical expertise resulting in approximately $7M of revenue over 3 years \n•\tDelivered successful client prototypes analyzing large volumes of structured and unstructured data using on-premises, cloud and hybrid solutions \n•\tRequested by upper management to lead critical, complex and challenging customer engagements to restore customer satisfaction \n•\tCreated intellectual capital and co-published a WebSphere Developers Domain article on big data application development \n•\tLed one year special development project under the CTO office to drive an innovative bioinformatics marketplace using a cloud environment with a large internationally dispersed development team Executive IT Specialist, Deployment Software Engineer IBM Software Group, Information Management October 2010  – Present (4 years 11 months) Raleigh-Durham, North Carolina Area Reporting to IBM’s Big Data Software Development and Engineering organization, focusing on IBM BigInsights and related big data technologies. Responsible for leading, architecting, designing, coding and delivering prototypes that employ innovative approaches in this emerging field. Leveraging open source and IBM technologies such as Hadoop, HBase, Hive, Pig, Sqoop, BigSheets, Big SQL, R, Big R, Jaql, text analytics, geospatial and Eclipse development tooling to deliver insights and visualization of big data. Experience with numerous industries including finance, insurance, bioinformatics, healthcare, pharmaceutical, automotive, telecommunications and online marketing. \n•\tConsistently provided superior technical expertise resulting in approximately $7M of revenue over 3 years \n•\tDelivered successful client prototypes analyzing large volumes of structured and unstructured data using on-premises, cloud and hybrid solutions \n•\tRequested by upper management to lead critical, complex and challenging customer engagements to restore customer satisfaction \n•\tCreated intellectual capital and co-published a WebSphere Developers Domain article on big data application development \n•\tLed one year special development project under the CTO office to drive an innovative bioinformatics marketplace using a cloud environment with a large internationally dispersed development team Executive IT Specialist, Client Technical Specialist IBM Sales & Distribution June 1997  –  October 2010  (13 years 5 months) Raleigh-Durham, North Carolina Area Responsible for leading, designing and implementing prototypes for clients across North America using emerging technologies including application development of web, portal and mashup prototypes leveraging Java and Web 2.0 technologies applying SOA (Service-Oriented Architecture). Created servlets, portlets and widgets that integrate disparate applications, databases, messaging systems and other enterprise systems on various platforms. Provided prototypes, presentations and demonstrations that communicate business value of technical solutions. Mentored colleagues in both technical and professional careers. \n•\tConsistently delivered superior technical engagements resulting in many multi-million dollar wins \n•\tDelivered successful client prototypes involving complex integration of disparate technologies and applications \n•\tCreated worldwide instruction materials and IBM product certification exams \n•\tCo-led Portal and Mashups Technical Competency Council \n•\tPublished articles on WebSphere Developers Domain on portlet development Executive IT Specialist, Client Technical Specialist IBM Sales & Distribution June 1997  –  October 2010  (13 years 5 months) Raleigh-Durham, North Carolina Area Responsible for leading, designing and implementing prototypes for clients across North America using emerging technologies including application development of web, portal and mashup prototypes leveraging Java and Web 2.0 technologies applying SOA (Service-Oriented Architecture). Created servlets, portlets and widgets that integrate disparate applications, databases, messaging systems and other enterprise systems on various platforms. Provided prototypes, presentations and demonstrations that communicate business value of technical solutions. Mentored colleagues in both technical and professional careers. \n•\tConsistently delivered superior technical engagements resulting in many multi-million dollar wins \n•\tDelivered successful client prototypes involving complex integration of disparate technologies and applications \n•\tCreated worldwide instruction materials and IBM product certification exams \n•\tCo-led Portal and Mashups Technical Competency Council \n•\tPublished articles on WebSphere Developers Domain on portlet development Senior Software Engineer, Lead Systems Integrator IBM Software Group, Tivoli December 1994  –  June 1997  (2 years 7 months) Raleigh-Durham, North Carolina Area Responsible for leading and providing consulting and professional services in network and systems management to clients worldwide. \n•\tAtlanta Committee for the Olympic Games - Led 15-month project as the Lead Technical Systems Integrator for IBM’s involvement in network and systems management \n•\tEnterprise Summit Shoot Out - Lead presenter and systems integrator for two consecutive year wins for IBM Senior Software Engineer, Lead Systems Integrator IBM Software Group, Tivoli December 1994  –  June 1997  (2 years 7 months) Raleigh-Durham, North Carolina Area Responsible for leading and providing consulting and professional services in network and systems management to clients worldwide. \n•\tAtlanta Committee for the Olympic Games - Led 15-month project as the Lead Technical Systems Integrator for IBM’s involvement in network and systems management \n•\tEnterprise Summit Shoot Out - Lead presenter and systems integrator for two consecutive year wins for IBM Advisory Programmer, Brand Manager IBM Networking Software Division November 1992  –  December 1994  (2 years 2 months) Raleigh-Durham, North Carolina Area Brand Manager responsible for worldwide technical marketing of IBM’s network and systems management products and services, concentrating in automated operations and integration. Responsible for providing technical leadership on complex enterprise-wide management engagements. Advisory Programmer, Brand Manager IBM Networking Software Division November 1992  –  December 1994  (2 years 2 months) Raleigh-Durham, North Carolina Area Brand Manager responsible for worldwide technical marketing of IBM’s network and systems management products and services, concentrating in automated operations and integration. Responsible for providing technical leadership on complex enterprise-wide management engagements. Advisory Systems Engineer, Networking Specialist IBM United States Marketing & Services December 1986  –  November 1992  (6 years) Greater Boston Area Responsible for providing contracted, fee-based consulting and services (1/91 to 11/92). Responsible for sales and implementation of IBM network products for cross industry accounts (12/86 to 1/91). Concentration in network and systems management utilizing the IBM Tivoli NetView family of products, controllers, modems and local area networks. Represented IBM nationally at trade shows and IBM user groups (TCA, COMNET, INTERFACE, SHARE, GUIDE) Advisory Systems Engineer, Networking Specialist IBM United States Marketing & Services December 1986  –  November 1992  (6 years) Greater Boston Area Responsible for providing contracted, fee-based consulting and services (1/91 to 11/92). Responsible for sales and implementation of IBM network products for cross industry accounts (12/86 to 1/91). Concentration in network and systems management utilizing the IBM Tivoli NetView family of products, controllers, modems and local area networks. Represented IBM nationally at trade shows and IBM user groups (TCA, COMNET, INTERFACE, SHARE, GUIDE) Senior Associate Engineer, Lead Project Engineer IBM General Technology Division July 1983  –  December 1986  (3 years 6 months) East Fishkill, New York Responsible for I/O circuit design, analysis and problem determination in bipolar semiconductor technologies. \n•\tAccurate and reliable circuit design including leadership of joint custom products with IBM lab in France \n•\tCo-author of three IBM Technical Disclosure Publications \n•\tRecipient of five Cost Effectiveness Awards for significant savings in manufacturing Senior Associate Engineer, Lead Project Engineer IBM General Technology Division July 1983  –  December 1986  (3 years 6 months) East Fishkill, New York Responsible for I/O circuit design, analysis and problem determination in bipolar semiconductor technologies. \n•\tAccurate and reliable circuit design including leadership of joint custom products with IBM lab in France \n•\tCo-author of three IBM Technical Disclosure Publications \n•\tRecipient of five Cost Effectiveness Awards for significant savings in manufacturing Skills Enterprise Software Websphere WebSphere Application... AIX Virtualization Project Management VMware Requirements Analysis SaaS Solution Architecture Solution Selling IT Strategy Cloud Computing Sametime IT Service Management DB2 WebSphere Portal Technical Leadership Software Development Unix Storage Integration EAI Disaster Recovery Enterprise Architecture J2EE Application... SOA Agile Methodologies J2EE Web Services Linux Lotus SDLC Program Management Business Intelligence Software Project... Big Data Data Center Lotus Notes Middleware Java Windows Pre-sales Java Enterprise Edition WebSphere IBM AIX Apache Spark Hadoop See 32+     See less Skills  Enterprise Software Websphere WebSphere Application... AIX Virtualization Project Management VMware Requirements Analysis SaaS Solution Architecture Solution Selling IT Strategy Cloud Computing Sametime IT Service Management DB2 WebSphere Portal Technical Leadership Software Development Unix Storage Integration EAI Disaster Recovery Enterprise Architecture J2EE Application... SOA Agile Methodologies J2EE Web Services Linux Lotus SDLC Program Management Business Intelligence Software Project... Big Data Data Center Lotus Notes Middleware Java Windows Pre-sales Java Enterprise Edition WebSphere IBM AIX Apache Spark Hadoop See 32+     See less Enterprise Software Websphere WebSphere Application... AIX Virtualization Project Management VMware Requirements Analysis SaaS Solution Architecture Solution Selling IT Strategy Cloud Computing Sametime IT Service Management DB2 WebSphere Portal Technical Leadership Software Development Unix Storage Integration EAI Disaster Recovery Enterprise Architecture J2EE Application... SOA Agile Methodologies J2EE Web Services Linux Lotus SDLC Program Management Business Intelligence Software Project... Big Data Data Center Lotus Notes Middleware Java Windows Pre-sales Java Enterprise Edition WebSphere IBM AIX Apache Spark Hadoop See 32+     See less Enterprise Software Websphere WebSphere Application... AIX Virtualization Project Management VMware Requirements Analysis SaaS Solution Architecture Solution Selling IT Strategy Cloud Computing Sametime IT Service Management DB2 WebSphere Portal Technical Leadership Software Development Unix Storage Integration EAI Disaster Recovery Enterprise Architecture J2EE Application... SOA Agile Methodologies J2EE Web Services Linux Lotus SDLC Program Management Business Intelligence Software Project... Big Data Data Center Lotus Notes Middleware Java Windows Pre-sales Java Enterprise Edition WebSphere IBM AIX Apache Spark Hadoop See 32+     See less Education Syracuse University Masters,  Electrical Engineering 1985  – 1988 University of Illinois at Urbana-Champaign Bachelors,  Electrical Engineering 1979  – 1983 Syracuse University Masters,  Electrical Engineering 1985  – 1988 Syracuse University Masters,  Electrical Engineering 1985  – 1988 Syracuse University Masters,  Electrical Engineering 1985  – 1988 University of Illinois at Urbana-Champaign Bachelors,  Electrical Engineering 1979  – 1983 University of Illinois at Urbana-Champaign Bachelors,  Electrical Engineering 1979  – 1983 University of Illinois at Urbana-Champaign Bachelors,  Electrical Engineering 1979  – 1983 ", "Experience Senior Systems Integrator IBM Global Services September 1978  – Present (37 years) Charlotte, North Carolina Area Senior Systems Integrator IBM Global Services September 1978  – Present (37 years) Charlotte, North Carolina Area Senior Systems Integrator IBM Global Services September 1978  – Present (37 years) Charlotte, North Carolina Area Skills ITIL Data Center Business Process PMP AIX Project Management Active Directory SOA Program Management Windows Server Enterprise Architecture IT Service Management Requirements Analysis Business Analysis Virtualization IT Strategy Integration Solution Architecture VMware Unix Linux Servers Cloud Computing Strategy See 9+     See less Skills  ITIL Data Center Business Process PMP AIX Project Management Active Directory SOA Program Management Windows Server Enterprise Architecture IT Service Management Requirements Analysis Business Analysis Virtualization IT Strategy Integration Solution Architecture VMware Unix Linux Servers Cloud Computing Strategy See 9+     See less ITIL Data Center Business Process PMP AIX Project Management Active Directory SOA Program Management Windows Server Enterprise Architecture IT Service Management Requirements Analysis Business Analysis Virtualization IT Strategy Integration Solution Architecture VMware Unix Linux Servers Cloud Computing Strategy See 9+     See less ITIL Data Center Business Process PMP AIX Project Management Active Directory SOA Program Management Windows Server Enterprise Architecture IT Service Management Requirements Analysis Business Analysis Virtualization IT Strategy Integration Solution Architecture VMware Unix Linux Servers Cloud Computing Strategy See 9+     See less "]}