{"position": "Team Lead", "company": "Intel Corporation", "profiles": ["Experience Security FW Integration team lead Intel Corporation December 2014  – Present (9 months) Folsom, California Continuous Integration Product Owner and team manager Intel Corporation 2014  –  August 2014  (less than a year) Jerusalem, Israel Owner of continuous integration solutions for an organization that includes several hundred engineers in multiple geos and delivers to multiple projects at the same time. Defined the strategy for all supported projects to provide scalable and affordable solutions in a timely manner. Acted as one voice for customer requests and sole owner for execution and prioritization. Product Owner and Software / Firmware Engineering manager Intel Corporation 2011  –  2013  (2 years) Jerusalem, Israel Owner of the feature (Dynamic Application Loader) cross all supported (Core and SOC) platforms and project. Managing a team of Software and Firmware engineers responsible of the development and validation of different versions of the product. Responsibilities included getting the requirements from customers (project teams) and translating them into meaningful tasks for the team. Priorities properly and be able to commit to the different project on execution and quality. After two years, managed to reduce the HC in the team significantly, although the number of supported projects and features continuously increased. Introduced meaningful changes to the way things were done in the organization before and helped set the new methodology for managing and execution of features within the design center. Managed to introduce successful Agile working approach delivering to projects managed in waterfall project management. Software / Firmware Validation Manager Intel Corporation 2007  –  2013  (6 years) Jerusalem, Israel Validation Manager of different teams and products throughout the years (AMT Software, SCS, AMT SDK, DAL, NFC and others). Manage teams of validation engineers (14 – 23) including Full time, Interns and Contractors. Responsible for the products quality, people management and engineer’s career development. Managed to deliver high quality products to all projects, creating teams of skillful professionals with great work atmosphere. Coach and promote individuals from the team, and help them perform better and faster. Project Engineering Validation Manager Intel Corporation 2008  –  2009  (1 year) Jerusalem, Israel Manage all the Validation aspects of a Software / Firmware project in the organization. Responsible of representing the organization in the different engineering forums. Collecting information, setting targets and monitor progress of all the validation teams. Automation Team Lead Intel Corporation 2006  –  2007  (1 year) Jerusalem, Israel Leading automation activities and tool development for validation organization of over 100 Engineers. Introduction of regression packages and high percentage of test automation cross products. Consolidation of tools and development of new frameworks and tools to address requirements of new features. Directly leading small teams of engineers (3-4) and a few dozen indirectly. Validation team lead Intel Corporation 2005  –  2006  (1 year) Jerusalem, Israel Validation owner of a feature or two in the product. Defining the validation scope and strategy and directly leading 3-4 engineers and their tasks assignment and tracking Automation Developer Intel Corporation 2004  –  2005  (1 year) Jerusalem, Israel Tool automation and framework developer. Mostly coded in .Net environment with C# and slightly with Ruby and Java. Main achievement was the introduction of a complex framework to address custom needs of the products under test. Firmware Test Engineer Intel Corporation June 2002  –  2004  (2 years) Jerusalem, Israel Responsible of executing Test cycles, filing bugs and exposing defects for different software and firmware products. Mainly focused on network drivers and manageability products Statistics recorder Segev Statistics October 2002  –  June 2003  (9 months) Jerusalem, Israel Record and distribute basketball game statistics during “Hapoel Jerusalem” Basketball club Home games NOC Operator Deltathree September 2000  –  June 2003  (2 years 10 months) Jerusalem, Israel Monitoring the Company’s network (LAN + WAN), Identifying potential issues and failures, troubleshoot and solve them. Acting as second tier customer support. Computer Laboratory instructor Azrieli College of Engineering Jerusalem עזריאלי מכללה אקדמית להנדסה ירושלים October 2001  –  August 2002  (11 months) Jerusalem, Israel Maintaining Lab in a working conditions at all times. Providing help and first line of support for all students Chemicals warehouseman Intel Corporation November 1998  –  May 1999  (7 months) Jerusalem, Israel Co Founder “Lahmaniot Al Haboker” September 1998  –  May 1999  (9 months) Mevaseret Zion, Israel Established a profitable business of rolls and other bakery products delivery directly to customer’s house. Built the business from scratch, managed the entire operation from accounting to actual products delivery Youth Instructor Community Center 1992  –  1995  (3 years) Mevaseret Zion, Israel Security FW Integration team lead Intel Corporation December 2014  – Present (9 months) Folsom, California Security FW Integration team lead Intel Corporation December 2014  – Present (9 months) Folsom, California Continuous Integration Product Owner and team manager Intel Corporation 2014  –  August 2014  (less than a year) Jerusalem, Israel Owner of continuous integration solutions for an organization that includes several hundred engineers in multiple geos and delivers to multiple projects at the same time. Defined the strategy for all supported projects to provide scalable and affordable solutions in a timely manner. Acted as one voice for customer requests and sole owner for execution and prioritization. Continuous Integration Product Owner and team manager Intel Corporation 2014  –  August 2014  (less than a year) Jerusalem, Israel Owner of continuous integration solutions for an organization that includes several hundred engineers in multiple geos and delivers to multiple projects at the same time. Defined the strategy for all supported projects to provide scalable and affordable solutions in a timely manner. Acted as one voice for customer requests and sole owner for execution and prioritization. Product Owner and Software / Firmware Engineering manager Intel Corporation 2011  –  2013  (2 years) Jerusalem, Israel Owner of the feature (Dynamic Application Loader) cross all supported (Core and SOC) platforms and project. Managing a team of Software and Firmware engineers responsible of the development and validation of different versions of the product. Responsibilities included getting the requirements from customers (project teams) and translating them into meaningful tasks for the team. Priorities properly and be able to commit to the different project on execution and quality. After two years, managed to reduce the HC in the team significantly, although the number of supported projects and features continuously increased. Introduced meaningful changes to the way things were done in the organization before and helped set the new methodology for managing and execution of features within the design center. Managed to introduce successful Agile working approach delivering to projects managed in waterfall project management. Product Owner and Software / Firmware Engineering manager Intel Corporation 2011  –  2013  (2 years) Jerusalem, Israel Owner of the feature (Dynamic Application Loader) cross all supported (Core and SOC) platforms and project. Managing a team of Software and Firmware engineers responsible of the development and validation of different versions of the product. Responsibilities included getting the requirements from customers (project teams) and translating them into meaningful tasks for the team. Priorities properly and be able to commit to the different project on execution and quality. After two years, managed to reduce the HC in the team significantly, although the number of supported projects and features continuously increased. Introduced meaningful changes to the way things were done in the organization before and helped set the new methodology for managing and execution of features within the design center. Managed to introduce successful Agile working approach delivering to projects managed in waterfall project management. Software / Firmware Validation Manager Intel Corporation 2007  –  2013  (6 years) Jerusalem, Israel Validation Manager of different teams and products throughout the years (AMT Software, SCS, AMT SDK, DAL, NFC and others). Manage teams of validation engineers (14 – 23) including Full time, Interns and Contractors. Responsible for the products quality, people management and engineer’s career development. Managed to deliver high quality products to all projects, creating teams of skillful professionals with great work atmosphere. Coach and promote individuals from the team, and help them perform better and faster. Software / Firmware Validation Manager Intel Corporation 2007  –  2013  (6 years) Jerusalem, Israel Validation Manager of different teams and products throughout the years (AMT Software, SCS, AMT SDK, DAL, NFC and others). Manage teams of validation engineers (14 – 23) including Full time, Interns and Contractors. Responsible for the products quality, people management and engineer’s career development. Managed to deliver high quality products to all projects, creating teams of skillful professionals with great work atmosphere. Coach and promote individuals from the team, and help them perform better and faster. Project Engineering Validation Manager Intel Corporation 2008  –  2009  (1 year) Jerusalem, Israel Manage all the Validation aspects of a Software / Firmware project in the organization. Responsible of representing the organization in the different engineering forums. Collecting information, setting targets and monitor progress of all the validation teams. Project Engineering Validation Manager Intel Corporation 2008  –  2009  (1 year) Jerusalem, Israel Manage all the Validation aspects of a Software / Firmware project in the organization. Responsible of representing the organization in the different engineering forums. Collecting information, setting targets and monitor progress of all the validation teams. Automation Team Lead Intel Corporation 2006  –  2007  (1 year) Jerusalem, Israel Leading automation activities and tool development for validation organization of over 100 Engineers. Introduction of regression packages and high percentage of test automation cross products. Consolidation of tools and development of new frameworks and tools to address requirements of new features. Directly leading small teams of engineers (3-4) and a few dozen indirectly. Automation Team Lead Intel Corporation 2006  –  2007  (1 year) Jerusalem, Israel Leading automation activities and tool development for validation organization of over 100 Engineers. Introduction of regression packages and high percentage of test automation cross products. Consolidation of tools and development of new frameworks and tools to address requirements of new features. Directly leading small teams of engineers (3-4) and a few dozen indirectly. Validation team lead Intel Corporation 2005  –  2006  (1 year) Jerusalem, Israel Validation owner of a feature or two in the product. Defining the validation scope and strategy and directly leading 3-4 engineers and their tasks assignment and tracking Validation team lead Intel Corporation 2005  –  2006  (1 year) Jerusalem, Israel Validation owner of a feature or two in the product. Defining the validation scope and strategy and directly leading 3-4 engineers and their tasks assignment and tracking Automation Developer Intel Corporation 2004  –  2005  (1 year) Jerusalem, Israel Tool automation and framework developer. Mostly coded in .Net environment with C# and slightly with Ruby and Java. Main achievement was the introduction of a complex framework to address custom needs of the products under test. Automation Developer Intel Corporation 2004  –  2005  (1 year) Jerusalem, Israel Tool automation and framework developer. Mostly coded in .Net environment with C# and slightly with Ruby and Java. Main achievement was the introduction of a complex framework to address custom needs of the products under test. Firmware Test Engineer Intel Corporation June 2002  –  2004  (2 years) Jerusalem, Israel Responsible of executing Test cycles, filing bugs and exposing defects for different software and firmware products. Mainly focused on network drivers and manageability products Firmware Test Engineer Intel Corporation June 2002  –  2004  (2 years) Jerusalem, Israel Responsible of executing Test cycles, filing bugs and exposing defects for different software and firmware products. Mainly focused on network drivers and manageability products Statistics recorder Segev Statistics October 2002  –  June 2003  (9 months) Jerusalem, Israel Record and distribute basketball game statistics during “Hapoel Jerusalem” Basketball club Home games Statistics recorder Segev Statistics October 2002  –  June 2003  (9 months) Jerusalem, Israel Record and distribute basketball game statistics during “Hapoel Jerusalem” Basketball club Home games NOC Operator Deltathree September 2000  –  June 2003  (2 years 10 months) Jerusalem, Israel Monitoring the Company’s network (LAN + WAN), Identifying potential issues and failures, troubleshoot and solve them. Acting as second tier customer support. NOC Operator Deltathree September 2000  –  June 2003  (2 years 10 months) Jerusalem, Israel Monitoring the Company’s network (LAN + WAN), Identifying potential issues and failures, troubleshoot and solve them. Acting as second tier customer support. Computer Laboratory instructor Azrieli College of Engineering Jerusalem עזריאלי מכללה אקדמית להנדסה ירושלים October 2001  –  August 2002  (11 months) Jerusalem, Israel Maintaining Lab in a working conditions at all times. Providing help and first line of support for all students Computer Laboratory instructor Azrieli College of Engineering Jerusalem עזריאלי מכללה אקדמית להנדסה ירושלים October 2001  –  August 2002  (11 months) Jerusalem, Israel Maintaining Lab in a working conditions at all times. Providing help and first line of support for all students Chemicals warehouseman Intel Corporation November 1998  –  May 1999  (7 months) Jerusalem, Israel Chemicals warehouseman Intel Corporation November 1998  –  May 1999  (7 months) Jerusalem, Israel Co Founder “Lahmaniot Al Haboker” September 1998  –  May 1999  (9 months) Mevaseret Zion, Israel Established a profitable business of rolls and other bakery products delivery directly to customer’s house. Built the business from scratch, managed the entire operation from accounting to actual products delivery Co Founder “Lahmaniot Al Haboker” September 1998  –  May 1999  (9 months) Mevaseret Zion, Israel Established a profitable business of rolls and other bakery products delivery directly to customer’s house. Built the business from scratch, managed the entire operation from accounting to actual products delivery Youth Instructor Community Center 1992  –  1995  (3 years) Mevaseret Zion, Israel Youth Instructor Community Center 1992  –  1995  (3 years) Mevaseret Zion, Israel Languages Hebrew English Hebrew English Hebrew English Skills Debugging Embedded Software Software Engineering Embedded Systems Software Development System Architecture Agile Methodologies Agile & Waterfall... People Management Project Management Product Development Test Automation Software Validation Engineering Firmware Testing Management C# Integration Software Design See 5+     See less Skills  Debugging Embedded Software Software Engineering Embedded Systems Software Development System Architecture Agile Methodologies Agile & Waterfall... People Management Project Management Product Development Test Automation Software Validation Engineering Firmware Testing Management C# Integration Software Design See 5+     See less Debugging Embedded Software Software Engineering Embedded Systems Software Development System Architecture Agile Methodologies Agile & Waterfall... People Management Project Management Product Development Test Automation Software Validation Engineering Firmware Testing Management C# Integration Software Design See 5+     See less Debugging Embedded Software Software Engineering Embedded Systems Software Development System Architecture Agile Methodologies Agile & Waterfall... People Management Project Management Product Development Test Automation Software Validation Engineering Firmware Testing Management C# Integration Software Design See 5+     See less Education Jerusalem College of Engineering, Jerusalem, Israel Bachelor of Science (BSc),  Software Engineering 1999  – 2003 Jerusalem College of Engineering, Jerusalem, Israel Bachelor of Science (BSc),  Software Engineering 1999  – 2003 Jerusalem College of Engineering, Jerusalem, Israel Bachelor of Science (BSc),  Software Engineering 1999  – 2003 Jerusalem College of Engineering, Jerusalem, Israel Bachelor of Science (BSc),  Software Engineering 1999  – 2003 Honors & Awards ", "Skills Device Drivers Processors Embedded Systems Linux Debugging Programming Software Engineering Multithreading Embedded Linux Embedded Software Systems Engineering Software Design Linux Kernel Software Project... People Development System Architecture See 1+     See less Skills  Device Drivers Processors Embedded Systems Linux Debugging Programming Software Engineering Multithreading Embedded Linux Embedded Software Systems Engineering Software Design Linux Kernel Software Project... People Development System Architecture See 1+     See less Device Drivers Processors Embedded Systems Linux Debugging Programming Software Engineering Multithreading Embedded Linux Embedded Software Systems Engineering Software Design Linux Kernel Software Project... People Development System Architecture See 1+     See less Device Drivers Processors Embedded Systems Linux Debugging Programming Software Engineering Multithreading Embedded Linux Embedded Software Systems Engineering Software Design Linux Kernel Software Project... People Development System Architecture See 1+     See less ", "Skills Semiconductors Intel Cross-functional Team... Program Management Manufacturing Supply Chain Management Product Development Process Engineering Product Marketing Engineering Management Continuous Improvement Semiconductor Industry SPC Process Improvement Project Management Engineering Supply Management SoC IC Operations Management See 5+     See less Skills  Semiconductors Intel Cross-functional Team... Program Management Manufacturing Supply Chain Management Product Development Process Engineering Product Marketing Engineering Management Continuous Improvement Semiconductor Industry SPC Process Improvement Project Management Engineering Supply Management SoC IC Operations Management See 5+     See less Semiconductors Intel Cross-functional Team... Program Management Manufacturing Supply Chain Management Product Development Process Engineering Product Marketing Engineering Management Continuous Improvement Semiconductor Industry SPC Process Improvement Project Management Engineering Supply Management SoC IC Operations Management See 5+     See less Semiconductors Intel Cross-functional Team... Program Management Manufacturing Supply Chain Management Product Development Process Engineering Product Marketing Engineering Management Continuous Improvement Semiconductor Industry SPC Process Improvement Project Management Engineering Supply Management SoC IC Operations Management See 5+     See less ", "Experience Strategic Patent Finance Team Lead Intel Corporation July 2013  – Present (2 years 2 months) Strategic Financial Specialist & Finance Team Project Manager Intel Corporation August 2011  –  July 2013  (2 years) Senior Financial Analyst Intel August 2009  –  August 2011  (2 years 1 month) Lean Manufacturing Specialist Delphi June 2008  –  August 2008  (3 months) Financial Analyst Delphi July 2004  –  September 2007  (3 years 3 months) Strategic Patent Finance Team Lead Intel Corporation July 2013  – Present (2 years 2 months) Strategic Patent Finance Team Lead Intel Corporation July 2013  – Present (2 years 2 months) Strategic Financial Specialist & Finance Team Project Manager Intel Corporation August 2011  –  July 2013  (2 years) Strategic Financial Specialist & Finance Team Project Manager Intel Corporation August 2011  –  July 2013  (2 years) Senior Financial Analyst Intel August 2009  –  August 2011  (2 years 1 month) Senior Financial Analyst Intel August 2009  –  August 2011  (2 years 1 month) Lean Manufacturing Specialist Delphi June 2008  –  August 2008  (3 months) Lean Manufacturing Specialist Delphi June 2008  –  August 2008  (3 months) Financial Analyst Delphi July 2004  –  September 2007  (3 years 3 months) Financial Analyst Delphi July 2004  –  September 2007  (3 years 3 months) Skills Financial Analysis Financial Modeling Project Management Forecasting Financial Reporting Finance Corporate Finance Strategy Valuation Cross-functional Team... Analysis Data Analysis Skills  Financial Analysis Financial Modeling Project Management Forecasting Financial Reporting Finance Corporate Finance Strategy Valuation Cross-functional Team... Analysis Data Analysis Financial Analysis Financial Modeling Project Management Forecasting Financial Reporting Finance Corporate Finance Strategy Valuation Cross-functional Team... Analysis Data Analysis Financial Analysis Financial Modeling Project Management Forecasting Financial Reporting Finance Corporate Finance Strategy Valuation Cross-functional Team... Analysis Data Analysis Education The Ohio State University Fisher College of Business M.B.A.,  Corporate Finance and Operations Mgmt 2007  – 2009 Miami University B.S.,  Finance 2000  – 2004 The Ohio State University Fisher College of Business M.B.A.,  Corporate Finance and Operations Mgmt 2007  – 2009 The Ohio State University Fisher College of Business M.B.A.,  Corporate Finance and Operations Mgmt 2007  – 2009 The Ohio State University Fisher College of Business M.B.A.,  Corporate Finance and Operations Mgmt 2007  – 2009 Miami University B.S.,  Finance 2000  – 2004 Miami University B.S.,  Finance 2000  – 2004 Miami University B.S.,  Finance 2000  – 2004 ", "Skills Process Improvement Data Analysis Financial Analysis Financial Reporting Financial Modeling Analysis Cross-functional Team... Finance Forecasting P Sarbanes-Oxley Act Strategic Financial... Strategy Accounting Leadership Program Management See 1+     See less Skills  Process Improvement Data Analysis Financial Analysis Financial Reporting Financial Modeling Analysis Cross-functional Team... Finance Forecasting P Sarbanes-Oxley Act Strategic Financial... Strategy Accounting Leadership Program Management See 1+     See less Process Improvement Data Analysis Financial Analysis Financial Reporting Financial Modeling Analysis Cross-functional Team... Finance Forecasting P Sarbanes-Oxley Act Strategic Financial... Strategy Accounting Leadership Program Management See 1+     See less Process Improvement Data Analysis Financial Analysis Financial Reporting Financial Modeling Analysis Cross-functional Team... Finance Forecasting P Sarbanes-Oxley Act Strategic Financial... Strategy Accounting Leadership Program Management See 1+     See less Honors & Awards ", "Summary Emmy® Award Winner, recognized by National Academy of Television Arts and Sciences for development of HDMI Technology (High Definition Multimedia Interface). 60th Annual Technology & Engineering Emmy® Awards, Jan 7th 2009 \n \nIntel Achievement Award Winner 2010 for making Intel the world’s premier cryptographic material service to the PC and Consumer Electronics Industries (Highest Company recognition) \n \nMasters Degree in Information Management (MSIM) at Arizona State University, W.P. Carey School of Business. May 2009 \n \nLean Six Sigma Black Belt Certified (June 2015) \n \nITIL Foundation Certification - IT Service Management from EXIN \n \nCompTIA Security + Certifiation  \n \nAchieved Intel Corporation 2008 IT Excellence Award (highest IT Department recognition) for exceeding high standards in operation of a secure signing facility.  \n \n20 years overall experience in Information Technology (IT) \n \nSeveral years of Project Management experience including EDI B2B, Web development, client-server implementations and Info Sec Operations \n \nOver 7 years Applications Development experience on VB 6, .NET and PHP \n \nOver 7 years of Information Security experience (Security+ Certified Professional)  \n \nOver 3 years of experience in the Banking industry \n \nFull English /Spanish bilingual \n \nJorge Rivera, Jr. \nCell: (480) 213-9727 \njorgerivera87@gmail.com \n \nSpecialties: Information Security, Management, Project Management, Business Continuity, Disaster Recovery, Process Improvement, Software Development, IT Operations and Support, Content Protection, ITIL Foundation Summary Emmy® Award Winner, recognized by National Academy of Television Arts and Sciences for development of HDMI Technology (High Definition Multimedia Interface). 60th Annual Technology & Engineering Emmy® Awards, Jan 7th 2009 \n \nIntel Achievement Award Winner 2010 for making Intel the world’s premier cryptographic material service to the PC and Consumer Electronics Industries (Highest Company recognition) \n \nMasters Degree in Information Management (MSIM) at Arizona State University, W.P. Carey School of Business. May 2009 \n \nLean Six Sigma Black Belt Certified (June 2015) \n \nITIL Foundation Certification - IT Service Management from EXIN \n \nCompTIA Security + Certifiation  \n \nAchieved Intel Corporation 2008 IT Excellence Award (highest IT Department recognition) for exceeding high standards in operation of a secure signing facility.  \n \n20 years overall experience in Information Technology (IT) \n \nSeveral years of Project Management experience including EDI B2B, Web development, client-server implementations and Info Sec Operations \n \nOver 7 years Applications Development experience on VB 6, .NET and PHP \n \nOver 7 years of Information Security experience (Security+ Certified Professional)  \n \nOver 3 years of experience in the Banking industry \n \nFull English /Spanish bilingual \n \nJorge Rivera, Jr. \nCell: (480) 213-9727 \njorgerivera87@gmail.com \n \nSpecialties: Information Security, Management, Project Management, Business Continuity, Disaster Recovery, Process Improvement, Software Development, IT Operations and Support, Content Protection, ITIL Foundation Emmy® Award Winner, recognized by National Academy of Television Arts and Sciences for development of HDMI Technology (High Definition Multimedia Interface). 60th Annual Technology & Engineering Emmy® Awards, Jan 7th 2009 \n \nIntel Achievement Award Winner 2010 for making Intel the world’s premier cryptographic material service to the PC and Consumer Electronics Industries (Highest Company recognition) \n \nMasters Degree in Information Management (MSIM) at Arizona State University, W.P. Carey School of Business. May 2009 \n \nLean Six Sigma Black Belt Certified (June 2015) \n \nITIL Foundation Certification - IT Service Management from EXIN \n \nCompTIA Security + Certifiation  \n \nAchieved Intel Corporation 2008 IT Excellence Award (highest IT Department recognition) for exceeding high standards in operation of a secure signing facility.  \n \n20 years overall experience in Information Technology (IT) \n \nSeveral years of Project Management experience including EDI B2B, Web development, client-server implementations and Info Sec Operations \n \nOver 7 years Applications Development experience on VB 6, .NET and PHP \n \nOver 7 years of Information Security experience (Security+ Certified Professional)  \n \nOver 3 years of experience in the Banking industry \n \nFull English /Spanish bilingual \n \nJorge Rivera, Jr. \nCell: (480) 213-9727 \njorgerivera87@gmail.com \n \nSpecialties: Information Security, Management, Project Management, Business Continuity, Disaster Recovery, Process Improvement, Software Development, IT Operations and Support, Content Protection, ITIL Foundation Emmy® Award Winner, recognized by National Academy of Television Arts and Sciences for development of HDMI Technology (High Definition Multimedia Interface). 60th Annual Technology & Engineering Emmy® Awards, Jan 7th 2009 \n \nIntel Achievement Award Winner 2010 for making Intel the world’s premier cryptographic material service to the PC and Consumer Electronics Industries (Highest Company recognition) \n \nMasters Degree in Information Management (MSIM) at Arizona State University, W.P. Carey School of Business. May 2009 \n \nLean Six Sigma Black Belt Certified (June 2015) \n \nITIL Foundation Certification - IT Service Management from EXIN \n \nCompTIA Security + Certifiation  \n \nAchieved Intel Corporation 2008 IT Excellence Award (highest IT Department recognition) for exceeding high standards in operation of a secure signing facility.  \n \n20 years overall experience in Information Technology (IT) \n \nSeveral years of Project Management experience including EDI B2B, Web development, client-server implementations and Info Sec Operations \n \nOver 7 years Applications Development experience on VB 6, .NET and PHP \n \nOver 7 years of Information Security experience (Security+ Certified Professional)  \n \nOver 3 years of experience in the Banking industry \n \nFull English /Spanish bilingual \n \nJorge Rivera, Jr. \nCell: (480) 213-9727 \njorgerivera87@gmail.com \n \nSpecialties: Information Security, Management, Project Management, Business Continuity, Disaster Recovery, Process Improvement, Software Development, IT Operations and Support, Content Protection, ITIL Foundation Experience Information Security Operations Team Lead Intel Corporation 2005  – Present (10 years) Operations Team Lead: Currently leading the operations team that drives the generation of cryptographic material for the PC and Consumer Electrics Industries. \nSoftware Development Integration: Interface for development projects that deploy applications running on current production environment \nBusiness Continuity: Participated in Business Continuity and Disaster Recovery efforts for production environment Sr. Application Developer First Data Corporation 2003  –  2005  (2 years) •\tSr. Application Developer: In charge of Open systems applications: Visual Fox Pro, PHP/ MySQL, VB 6.0 and VB.NET, also provided Intranet support for the Tempe Site. In charge of Novell & Windows 2003 servers used to host FTP applications for the majority of Banks & financial institutions nationwide. IT Response Center Shift Team Lead Intel Corporation 2000  –  2002  (2 years) •\tIT Response Center Shift Team lead: Americas Region Information Technology Response Center: Shift #5 Coordinator managed a four-person team. Responsible for hardware and software support for automation applications (NT, VAX and Unix environments) at the following sites: Costa Rica, Chandler, Arizona (ATD), Folsom, California, Bedford, MA, Dupont, WA and Asia Pacific Region IT Support Specialist Intel Corporation 1999  –  2002  (3 years) Software Application Support, Team Lead  EDI Director EAN Costa Rica 1995  –  1999  (4 years) Promote E-Commerce Solutions and automation to entire Retail Industry \nRepresent EAN Costa Rica on International Technical Forums  \nProgram Management  \nProject Management  Information Security Operations Team Lead Intel Corporation 2005  – Present (10 years) Operations Team Lead: Currently leading the operations team that drives the generation of cryptographic material for the PC and Consumer Electrics Industries. \nSoftware Development Integration: Interface for development projects that deploy applications running on current production environment \nBusiness Continuity: Participated in Business Continuity and Disaster Recovery efforts for production environment Information Security Operations Team Lead Intel Corporation 2005  – Present (10 years) Operations Team Lead: Currently leading the operations team that drives the generation of cryptographic material for the PC and Consumer Electrics Industries. \nSoftware Development Integration: Interface for development projects that deploy applications running on current production environment \nBusiness Continuity: Participated in Business Continuity and Disaster Recovery efforts for production environment Sr. Application Developer First Data Corporation 2003  –  2005  (2 years) •\tSr. Application Developer: In charge of Open systems applications: Visual Fox Pro, PHP/ MySQL, VB 6.0 and VB.NET, also provided Intranet support for the Tempe Site. In charge of Novell & Windows 2003 servers used to host FTP applications for the majority of Banks & financial institutions nationwide. Sr. Application Developer First Data Corporation 2003  –  2005  (2 years) •\tSr. Application Developer: In charge of Open systems applications: Visual Fox Pro, PHP/ MySQL, VB 6.0 and VB.NET, also provided Intranet support for the Tempe Site. In charge of Novell & Windows 2003 servers used to host FTP applications for the majority of Banks & financial institutions nationwide. IT Response Center Shift Team Lead Intel Corporation 2000  –  2002  (2 years) •\tIT Response Center Shift Team lead: Americas Region Information Technology Response Center: Shift #5 Coordinator managed a four-person team. Responsible for hardware and software support for automation applications (NT, VAX and Unix environments) at the following sites: Costa Rica, Chandler, Arizona (ATD), Folsom, California, Bedford, MA, Dupont, WA and Asia Pacific Region IT Response Center Shift Team Lead Intel Corporation 2000  –  2002  (2 years) •\tIT Response Center Shift Team lead: Americas Region Information Technology Response Center: Shift #5 Coordinator managed a four-person team. Responsible for hardware and software support for automation applications (NT, VAX and Unix environments) at the following sites: Costa Rica, Chandler, Arizona (ATD), Folsom, California, Bedford, MA, Dupont, WA and Asia Pacific Region IT Support Specialist Intel Corporation 1999  –  2002  (3 years) Software Application Support, Team Lead  IT Support Specialist Intel Corporation 1999  –  2002  (3 years) Software Application Support, Team Lead  EDI Director EAN Costa Rica 1995  –  1999  (4 years) Promote E-Commerce Solutions and automation to entire Retail Industry \nRepresent EAN Costa Rica on International Technical Forums  \nProgram Management  \nProject Management  EDI Director EAN Costa Rica 1995  –  1999  (4 years) Promote E-Commerce Solutions and automation to entire Retail Industry \nRepresent EAN Costa Rica on International Technical Forums  \nProgram Management  \nProject Management  Languages English Spanish English Spanish English Spanish Skills Information Security Lean Six Sigma Black... Process Improvement Business Continuity Disaster Recovery Project Management Program Management Software Development Integration IT Management Six Sigma Technical Training Teaching ITIL .NET Business Intelligence IT Service Management Network Security Intel Data Center Business Process Windows Server Management IT Operations PMP Unix Outsourcing Strategy Vendor Management See 14+     See less Skills  Information Security Lean Six Sigma Black... Process Improvement Business Continuity Disaster Recovery Project Management Program Management Software Development Integration IT Management Six Sigma Technical Training Teaching ITIL .NET Business Intelligence IT Service Management Network Security Intel Data Center Business Process Windows Server Management IT Operations PMP Unix Outsourcing Strategy Vendor Management See 14+     See less Information Security Lean Six Sigma Black... Process Improvement Business Continuity Disaster Recovery Project Management Program Management Software Development Integration IT Management Six Sigma Technical Training Teaching ITIL .NET Business Intelligence IT Service Management Network Security Intel Data Center Business Process Windows Server Management IT Operations PMP Unix Outsourcing Strategy Vendor Management See 14+     See less Information Security Lean Six Sigma Black... Process Improvement Business Continuity Disaster Recovery Project Management Program Management Software Development Integration IT Management Six Sigma Technical Training Teaching ITIL .NET Business Intelligence IT Service Management Network Security Intel Data Center Business Process Windows Server Management IT Operations PMP Unix Outsourcing Strategy Vendor Management See 14+     See less Education Arizona State University - W. P. Carey School of Business Master of Science in Information Management,  Information Management , Business, BI, Enterprise Applications 2008  – 2009 - Data & Information Management \n- Strategic Value of Information Technology \n- Business Intelligence \n- Information Security and Controls \n- Business Process and Workflow Analysis \n- Enterprise Application Integration \n- Managing Enterprise Systems \n- IT Services and Project Management \n- Knowledge and Semantics Management \n- Applied Project Universidad Internacional de las Américas Bachelor’s Degree,  Information Systems , Software Development , Bachelors Degree in Information Systems 1991  – 1995 Computer Information Systems \nSoftware Development  \nProject Management Arizona State University - W. P. Carey School of Business Master of Science in Information Management,  Information Management , Business, BI, Enterprise Applications 2008  – 2009 - Data & Information Management \n- Strategic Value of Information Technology \n- Business Intelligence \n- Information Security and Controls \n- Business Process and Workflow Analysis \n- Enterprise Application Integration \n- Managing Enterprise Systems \n- IT Services and Project Management \n- Knowledge and Semantics Management \n- Applied Project Arizona State University - W. P. Carey School of Business Master of Science in Information Management,  Information Management , Business, BI, Enterprise Applications 2008  – 2009 - Data & Information Management \n- Strategic Value of Information Technology \n- Business Intelligence \n- Information Security and Controls \n- Business Process and Workflow Analysis \n- Enterprise Application Integration \n- Managing Enterprise Systems \n- IT Services and Project Management \n- Knowledge and Semantics Management \n- Applied Project Arizona State University - W. P. Carey School of Business Master of Science in Information Management,  Information Management , Business, BI, Enterprise Applications 2008  – 2009 - Data & Information Management \n- Strategic Value of Information Technology \n- Business Intelligence \n- Information Security and Controls \n- Business Process and Workflow Analysis \n- Enterprise Application Integration \n- Managing Enterprise Systems \n- IT Services and Project Management \n- Knowledge and Semantics Management \n- Applied Project Universidad Internacional de las Américas Bachelor’s Degree,  Information Systems , Software Development , Bachelors Degree in Information Systems 1991  – 1995 Computer Information Systems \nSoftware Development  \nProject Management Universidad Internacional de las Américas Bachelor’s Degree,  Information Systems , Software Development , Bachelors Degree in Information Systems 1991  – 1995 Computer Information Systems \nSoftware Development  \nProject Management Universidad Internacional de las Américas Bachelor’s Degree,  Information Systems , Software Development , Bachelors Degree in Information Systems 1991  – 1995 Computer Information Systems \nSoftware Development  \nProject Management Honors & Awards Emmy® Award National Academy of Television Arts and Sciences January 2009 Emmy® Award Winner, recognized by National Academy of Television Arts and Sciences for development of HDMI Technology (High Definition Multimedia Interface). 60th Annual Technology & Engineering Emmy® Awards, Jan 7th 2009 Intel Achievement Award Intel Corporation February 2010 Intel Achievement Award Winner 2010 for making Intel the world’s premier cryptographic material service to the PC and Consumer Electronics Industries (Highest Company recognition) IT Excellence Award Intel Corporation May 2008 Intel Corporation 2008 IT Excellence Award (highest IT Department recognition) for exceeding high standards in operation of a secure signing facility. IT Bureaucracy Busting Intel Corporation September 2011 IT Bureaucracy Busting Award Q4-2011: Using Six Sigma process improvement methodologies, team replaced a time-consuming and costly physical order delivery process with electronic ordering and delivery, reducing operations time by 70%, defects by 90% and order delivery time by 80%. Emmy® Award National Academy of Television Arts and Sciences January 2009 Emmy® Award Winner, recognized by National Academy of Television Arts and Sciences for development of HDMI Technology (High Definition Multimedia Interface). 60th Annual Technology & Engineering Emmy® Awards, Jan 7th 2009 Emmy® Award National Academy of Television Arts and Sciences January 2009 Emmy® Award Winner, recognized by National Academy of Television Arts and Sciences for development of HDMI Technology (High Definition Multimedia Interface). 60th Annual Technology & Engineering Emmy® Awards, Jan 7th 2009 Emmy® Award National Academy of Television Arts and Sciences January 2009 Emmy® Award Winner, recognized by National Academy of Television Arts and Sciences for development of HDMI Technology (High Definition Multimedia Interface). 60th Annual Technology & Engineering Emmy® Awards, Jan 7th 2009 Intel Achievement Award Intel Corporation February 2010 Intel Achievement Award Winner 2010 for making Intel the world’s premier cryptographic material service to the PC and Consumer Electronics Industries (Highest Company recognition) Intel Achievement Award Intel Corporation February 2010 Intel Achievement Award Winner 2010 for making Intel the world’s premier cryptographic material service to the PC and Consumer Electronics Industries (Highest Company recognition) Intel Achievement Award Intel Corporation February 2010 Intel Achievement Award Winner 2010 for making Intel the world’s premier cryptographic material service to the PC and Consumer Electronics Industries (Highest Company recognition) IT Excellence Award Intel Corporation May 2008 Intel Corporation 2008 IT Excellence Award (highest IT Department recognition) for exceeding high standards in operation of a secure signing facility. IT Excellence Award Intel Corporation May 2008 Intel Corporation 2008 IT Excellence Award (highest IT Department recognition) for exceeding high standards in operation of a secure signing facility. IT Excellence Award Intel Corporation May 2008 Intel Corporation 2008 IT Excellence Award (highest IT Department recognition) for exceeding high standards in operation of a secure signing facility. IT Bureaucracy Busting Intel Corporation September 2011 IT Bureaucracy Busting Award Q4-2011: Using Six Sigma process improvement methodologies, team replaced a time-consuming and costly physical order delivery process with electronic ordering and delivery, reducing operations time by 70%, defects by 90% and order delivery time by 80%. IT Bureaucracy Busting Intel Corporation September 2011 IT Bureaucracy Busting Award Q4-2011: Using Six Sigma process improvement methodologies, team replaced a time-consuming and costly physical order delivery process with electronic ordering and delivery, reducing operations time by 70%, defects by 90% and order delivery time by 80%. IT Bureaucracy Busting Intel Corporation September 2011 IT Bureaucracy Busting Award Q4-2011: Using Six Sigma process improvement methodologies, team replaced a time-consuming and costly physical order delivery process with electronic ordering and delivery, reducing operations time by 70%, defects by 90% and order delivery time by 80%. ", "Skills Software Engineering Software Design Software Development C# C++ C .NET Java Software Project... Programming Object Oriented Design OOP Objective-C Cross-platform... Agile Methodologies Agile Win32 API MFC Mac OS Mac OS X Cocoa Visual Studio Xcode Perforce Subversion OS X Project Management Debugging XML SDLC SQL Microsoft SQL Server SQLite Embedded Software BIOS UEFI Scrum WPF WinForms Android Development Android SDK TFS Leadership Team Leadership Technical Leadership Strategic Leadership Perl Multithreading Device Drivers Android See 35+     See less Skills  Software Engineering Software Design Software Development C# C++ C .NET Java Software Project... Programming Object Oriented Design OOP Objective-C Cross-platform... Agile Methodologies Agile Win32 API MFC Mac OS Mac OS X Cocoa Visual Studio Xcode Perforce Subversion OS X Project Management Debugging XML SDLC SQL Microsoft SQL Server SQLite Embedded Software BIOS UEFI Scrum WPF WinForms Android Development Android SDK TFS Leadership Team Leadership Technical Leadership Strategic Leadership Perl Multithreading Device Drivers Android See 35+     See less Software Engineering Software Design Software Development C# C++ C .NET Java Software Project... Programming Object Oriented Design OOP Objective-C Cross-platform... Agile Methodologies Agile Win32 API MFC Mac OS Mac OS X Cocoa Visual Studio Xcode Perforce Subversion OS X Project Management Debugging XML SDLC SQL Microsoft SQL Server SQLite Embedded Software BIOS UEFI Scrum WPF WinForms Android Development Android SDK TFS Leadership Team Leadership Technical Leadership Strategic Leadership Perl Multithreading Device Drivers Android See 35+     See less Software Engineering Software Design Software Development C# C++ C .NET Java Software Project... Programming Object Oriented Design OOP Objective-C Cross-platform... Agile Methodologies Agile Win32 API MFC Mac OS Mac OS X Cocoa Visual Studio Xcode Perforce Subversion OS X Project Management Debugging XML SDLC SQL Microsoft SQL Server SQLite Embedded Software BIOS UEFI Scrum WPF WinForms Android Development Android SDK TFS Leadership Team Leadership Technical Leadership Strategic Leadership Perl Multithreading Device Drivers Android See 35+     See less ", "Summary I have over 22 years experience covering all phases of software development and understanding the PC architecture at the CPU and chipset level. My current position trained me in HPC (High Performance Computing) and highly parallelized programming in Linux and it's unique problems and hurdles. Desired goals would be working in a stimulating environment where I am challenged to learn new skills and forced to think creatively to solve hard problems. Software architecture, leading design efforts, and even helping with implementation should be included in my ideal position. Summary I have over 22 years experience covering all phases of software development and understanding the PC architecture at the CPU and chipset level. My current position trained me in HPC (High Performance Computing) and highly parallelized programming in Linux and it's unique problems and hurdles. Desired goals would be working in a stimulating environment where I am challenged to learn new skills and forced to think creatively to solve hard problems. Software architecture, leading design efforts, and even helping with implementation should be included in my ideal position. I have over 22 years experience covering all phases of software development and understanding the PC architecture at the CPU and chipset level. My current position trained me in HPC (High Performance Computing) and highly parallelized programming in Linux and it's unique problems and hurdles. Desired goals would be working in a stimulating environment where I am challenged to learn new skills and forced to think creatively to solve hard problems. Software architecture, leading design efforts, and even helping with implementation should be included in my ideal position. I have over 22 years experience covering all phases of software development and understanding the PC architecture at the CPU and chipset level. My current position trained me in HPC (High Performance Computing) and highly parallelized programming in Linux and it's unique problems and hurdles. Desired goals would be working in a stimulating environment where I am challenged to learn new skills and forced to think creatively to solve hard problems. Software architecture, leading design efforts, and even helping with implementation should be included in my ideal position. Experience Senior Software Engineer and Software Platform Debug Team Lead Intel Corporation March 2010  – Present (5 years 6 months) Hillsboro, OR Senior Software Engineer and Software Platform Debug Team Lead Intel Corporation March 2010  – Present (5 years 6 months) Hillsboro, OR Senior Software Engineer and Software Platform Debug Team Lead Intel Corporation March 2010  – Present (5 years 6 months) Hillsboro, OR Skills Debugging Embedded Systems Intel Software Engineering .NET C C++ Testing Architecture Linux Computer Architecture C# Software Development Agile Methodologies Software Design Programming See 1+     See less Skills  Debugging Embedded Systems Intel Software Engineering .NET C C++ Testing Architecture Linux Computer Architecture C# Software Development Agile Methodologies Software Design Programming See 1+     See less Debugging Embedded Systems Intel Software Engineering .NET C C++ Testing Architecture Linux Computer Architecture C# Software Development Agile Methodologies Software Design Programming See 1+     See less Debugging Embedded Systems Intel Software Engineering .NET C C++ Testing Architecture Linux Computer Architecture C# Software Development Agile Methodologies Software Design Programming See 1+     See less ", "Skills Line Management Program Management Process Development Mobile Devices Planning Analysis Software Project... Project Portfolio... People Management SW business management Coaching Operations Management Management Project Planning Leadership Change Management Customer-focused Selling Symbian Product Management Mobile Technology Process Simulation Telecommunications Mobile Communications Start-ups R&D Orienteering Mobile Applications Embedded Software See 13+     See less Skills  Line Management Program Management Process Development Mobile Devices Planning Analysis Software Project... Project Portfolio... People Management SW business management Coaching Operations Management Management Project Planning Leadership Change Management Customer-focused Selling Symbian Product Management Mobile Technology Process Simulation Telecommunications Mobile Communications Start-ups R&D Orienteering Mobile Applications Embedded Software See 13+     See less Line Management Program Management Process Development Mobile Devices Planning Analysis Software Project... Project Portfolio... People Management SW business management Coaching Operations Management Management Project Planning Leadership Change Management Customer-focused Selling Symbian Product Management Mobile Technology Process Simulation Telecommunications Mobile Communications Start-ups R&D Orienteering Mobile Applications Embedded Software See 13+     See less Line Management Program Management Process Development Mobile Devices Planning Analysis Software Project... Project Portfolio... People Management SW business management Coaching Operations Management Management Project Planning Leadership Change Management Customer-focused Selling Symbian Product Management Mobile Technology Process Simulation Telecommunications Mobile Communications Start-ups R&D Orienteering Mobile Applications Embedded Software See 13+     See less ", "Languages French Native or bilingual proficiency English Full professional proficiency French Native or bilingual proficiency English Full professional proficiency French Native or bilingual proficiency English Full professional proficiency Native or bilingual proficiency Full professional proficiency Skills Embedded Software Bluetooth C Linux Embedded Linux Embedded Systems Software Development Embedded C WiFi ISTQB Certified Skills  Embedded Software Bluetooth C Linux Embedded Linux Embedded Systems Software Development Embedded C WiFi ISTQB Certified Embedded Software Bluetooth C Linux Embedded Linux Embedded Systems Software Development Embedded C WiFi ISTQB Certified Embedded Software Bluetooth C Linux Embedded Linux Embedded Systems Software Development Embedded C WiFi ISTQB Certified ", "Experience Predictive Analytics Project Manager & Team Lead Intel Corporation January 2013  – Present (2 years 8 months) Israel Management of predictive modeling and analytics projects, Data Mining and Machine Learning algorithms solutions, from inception through post-implementation monitoring, in the area of chips manufacturing and testing. BI Project Manager Intel Corporation January 2012  –  January 2013  (1 year 1 month) Owner of Intel’s worldwide HR organization BI tools and solutions; Initiated, designed and implemented BI solutions for HR organization; Lead a team of 10-15 members; strong cross HR business acumen Project Manager & Team Lead Intel Corporation January 2010  –  December 2011  (2 years) End to end leadership of regional & Global projects; direct supervisor of 5-10 employees; owner of several HR information/BI systems and reporting tools; experienced in business process management and improvement; designed, developed and maintained automated solutions Business Analyst Intel September 2008  –  December 2009  (1 year 4 months) Ownership of Staffing reporting system including troubleshooting and maintenance; Design and improve business processes while focusing on efficiency and effectiveness; Facilitate budget monitoring process. System Analyst Amdocs January 2007  –  August 2008  (1 year 8 months) Implementation of OSS (Operational Services Systems) systems for communication companies, Analyzing customer’s unique business needs; Adopting and customizing core-product system to meet the customer’s specific requirements and the corresponding systems limitations; Defining and consolidating technical solutions for the customer’s requirements. Business Analyst Student Intel December 2004  –  December 2006  (2 years 1 month) Design, develop and implement monitoring solutions for the hiring process; Measure and monitor business performance; Train and support end-users; Analyze data and take part in designing a new reporting module. Predictive Analytics Project Manager & Team Lead Intel Corporation January 2013  – Present (2 years 8 months) Israel Management of predictive modeling and analytics projects, Data Mining and Machine Learning algorithms solutions, from inception through post-implementation monitoring, in the area of chips manufacturing and testing. Predictive Analytics Project Manager & Team Lead Intel Corporation January 2013  – Present (2 years 8 months) Israel Management of predictive modeling and analytics projects, Data Mining and Machine Learning algorithms solutions, from inception through post-implementation monitoring, in the area of chips manufacturing and testing. BI Project Manager Intel Corporation January 2012  –  January 2013  (1 year 1 month) Owner of Intel’s worldwide HR organization BI tools and solutions; Initiated, designed and implemented BI solutions for HR organization; Lead a team of 10-15 members; strong cross HR business acumen BI Project Manager Intel Corporation January 2012  –  January 2013  (1 year 1 month) Owner of Intel’s worldwide HR organization BI tools and solutions; Initiated, designed and implemented BI solutions for HR organization; Lead a team of 10-15 members; strong cross HR business acumen Project Manager & Team Lead Intel Corporation January 2010  –  December 2011  (2 years) End to end leadership of regional & Global projects; direct supervisor of 5-10 employees; owner of several HR information/BI systems and reporting tools; experienced in business process management and improvement; designed, developed and maintained automated solutions Project Manager & Team Lead Intel Corporation January 2010  –  December 2011  (2 years) End to end leadership of regional & Global projects; direct supervisor of 5-10 employees; owner of several HR information/BI systems and reporting tools; experienced in business process management and improvement; designed, developed and maintained automated solutions Business Analyst Intel September 2008  –  December 2009  (1 year 4 months) Ownership of Staffing reporting system including troubleshooting and maintenance; Design and improve business processes while focusing on efficiency and effectiveness; Facilitate budget monitoring process. Business Analyst Intel September 2008  –  December 2009  (1 year 4 months) Ownership of Staffing reporting system including troubleshooting and maintenance; Design and improve business processes while focusing on efficiency and effectiveness; Facilitate budget monitoring process. System Analyst Amdocs January 2007  –  August 2008  (1 year 8 months) Implementation of OSS (Operational Services Systems) systems for communication companies, Analyzing customer’s unique business needs; Adopting and customizing core-product system to meet the customer’s specific requirements and the corresponding systems limitations; Defining and consolidating technical solutions for the customer’s requirements. System Analyst Amdocs January 2007  –  August 2008  (1 year 8 months) Implementation of OSS (Operational Services Systems) systems for communication companies, Analyzing customer’s unique business needs; Adopting and customizing core-product system to meet the customer’s specific requirements and the corresponding systems limitations; Defining and consolidating technical solutions for the customer’s requirements. Business Analyst Student Intel December 2004  –  December 2006  (2 years 1 month) Design, develop and implement monitoring solutions for the hiring process; Measure and monitor business performance; Train and support end-users; Analyze data and take part in designing a new reporting module. Business Analyst Student Intel December 2004  –  December 2006  (2 years 1 month) Design, develop and implement monitoring solutions for the hiring process; Measure and monitor business performance; Train and support end-users; Analyze data and take part in designing a new reporting module. Languages English English English Skills Project Planning Business Intelligence SQL Data Warehousing Analysis Testing Project Management PMP Visio Data Mining Process Improvement Analytics BI UML Visual Basic Software Project... Program Management Requirements Gathering Microsoft Office Microsoft Excel Kaizen Knowledge Management Key Performance... Quality Center Problem Solving User Experience Predictive Analytics Data Analysis Data Management Business Analysis Large-scale Data... Machine Learning Project Portfolio... Project Delivery Lean IT Team Leadership Team Management Team-oriented Result Oriented Data Quality Industrial Engineering MBA See 27+     See less Skills  Project Planning Business Intelligence SQL Data Warehousing Analysis Testing Project Management PMP Visio Data Mining Process Improvement Analytics BI UML Visual Basic Software Project... Program Management Requirements Gathering Microsoft Office Microsoft Excel Kaizen Knowledge Management Key Performance... Quality Center Problem Solving User Experience Predictive Analytics Data Analysis Data Management Business Analysis Large-scale Data... Machine Learning Project Portfolio... Project Delivery Lean IT Team Leadership Team Management Team-oriented Result Oriented Data Quality Industrial Engineering MBA See 27+     See less Project Planning Business Intelligence SQL Data Warehousing Analysis Testing Project Management PMP Visio Data Mining Process Improvement Analytics BI UML Visual Basic Software Project... Program Management Requirements Gathering Microsoft Office Microsoft Excel Kaizen Knowledge Management Key Performance... Quality Center Problem Solving User Experience Predictive Analytics Data Analysis Data Management Business Analysis Large-scale Data... Machine Learning Project Portfolio... Project Delivery Lean IT Team Leadership Team Management Team-oriented Result Oriented Data Quality Industrial Engineering MBA See 27+     See less Project Planning Business Intelligence SQL Data Warehousing Analysis Testing Project Management PMP Visio Data Mining Process Improvement Analytics BI UML Visual Basic Software Project... Program Management Requirements Gathering Microsoft Office Microsoft Excel Kaizen Knowledge Management Key Performance... Quality Center Problem Solving User Experience Predictive Analytics Data Analysis Data Management Business Analysis Large-scale Data... Machine Learning Project Portfolio... Project Delivery Lean IT Team Leadership Team Management Team-oriented Result Oriented Data Quality Industrial Engineering MBA See 27+     See less Education PMI PMP,  PMP Certified 2010  – 2010 Tel Aviv University MBA,  Business Management 2007  – 2010 Activities and Societies:  Information Systems management Technion - Israel Institute of Technology BSc,  Industrial Eng.& Management 2002  – 2006 Activities and Societies:  Information &Knowledge Systems Engineering PMI PMP,  PMP Certified 2010  – 2010 PMI PMP,  PMP Certified 2010  – 2010 PMI PMP,  PMP Certified 2010  – 2010 Tel Aviv University MBA,  Business Management 2007  – 2010 Activities and Societies:  Information Systems management Tel Aviv University MBA,  Business Management 2007  – 2010 Activities and Societies:  Information Systems management Tel Aviv University MBA,  Business Management 2007  – 2010 Activities and Societies:  Information Systems management Technion - Israel Institute of Technology BSc,  Industrial Eng.& Management 2002  – 2006 Activities and Societies:  Information &Knowledge Systems Engineering Technion - Israel Institute of Technology BSc,  Industrial Eng.& Management 2002  – 2006 Activities and Societies:  Information &Knowledge Systems Engineering Technion - Israel Institute of Technology BSc,  Industrial Eng.& Management 2002  – 2006 Activities and Societies:  Information &Knowledge Systems Engineering ", "Skills RF Wireless Microwave Semiconductors Electrical Engineering 4G System Design Engineering Management Cellular Communications GSM Analog FPGA Electronics Systems Engineering RF Engineering PCB design Firmware R&D See 3+     See less Skills  RF Wireless Microwave Semiconductors Electrical Engineering 4G System Design Engineering Management Cellular Communications GSM Analog FPGA Electronics Systems Engineering RF Engineering PCB design Firmware R&D See 3+     See less RF Wireless Microwave Semiconductors Electrical Engineering 4G System Design Engineering Management Cellular Communications GSM Analog FPGA Electronics Systems Engineering RF Engineering PCB design Firmware R&D See 3+     See less RF Wireless Microwave Semiconductors Electrical Engineering 4G System Design Engineering Management Cellular Communications GSM Analog FPGA Electronics Systems Engineering RF Engineering PCB design Firmware R&D See 3+     See less ", "Skills Marketing Strategy Cross-functional Team... Program Management Strategy Product Development Product Marketing Market Research Analytics Strategic Partnerships Consumer Electronics Competitive Intelligence Quantitative Research Positioning Creative Direction Business Development Product Management Research Market Intelligence Marketing Management Multi-channel Marketing Analysis Strategic Planning Mobile Devices User Experience Marketing Segmentation Customer Insight Market Analysis Product Launch Integrated Marketing Business Strategy Management Marketing Communications Budgets Go-to-market Strategy Project Planning Marketing Research Strategic Thinking Product Planning Advertising Leadership Product Innovation Qualitative Research B2B Marketing Brand Management Competitive Analysis Demand Generation Global Marketing Market Planning Pricing Strategy See 35+     See less Skills  Marketing Strategy Cross-functional Team... Program Management Strategy Product Development Product Marketing Market Research Analytics Strategic Partnerships Consumer Electronics Competitive Intelligence Quantitative Research Positioning Creative Direction Business Development Product Management Research Market Intelligence Marketing Management Multi-channel Marketing Analysis Strategic Planning Mobile Devices User Experience Marketing Segmentation Customer Insight Market Analysis Product Launch Integrated Marketing Business Strategy Management Marketing Communications Budgets Go-to-market Strategy Project Planning Marketing Research Strategic Thinking Product Planning Advertising Leadership Product Innovation Qualitative Research B2B Marketing Brand Management Competitive Analysis Demand Generation Global Marketing Market Planning Pricing Strategy See 35+     See less Marketing Strategy Cross-functional Team... Program Management Strategy Product Development Product Marketing Market Research Analytics Strategic Partnerships Consumer Electronics Competitive Intelligence Quantitative Research Positioning Creative Direction Business Development Product Management Research Market Intelligence Marketing Management Multi-channel Marketing Analysis Strategic Planning Mobile Devices User Experience Marketing Segmentation Customer Insight Market Analysis Product Launch Integrated Marketing Business Strategy Management Marketing Communications Budgets Go-to-market Strategy Project Planning Marketing Research Strategic Thinking Product Planning Advertising Leadership Product Innovation Qualitative Research B2B Marketing Brand Management Competitive Analysis Demand Generation Global Marketing Market Planning Pricing Strategy See 35+     See less Marketing Strategy Cross-functional Team... Program Management Strategy Product Development Product Marketing Market Research Analytics Strategic Partnerships Consumer Electronics Competitive Intelligence Quantitative Research Positioning Creative Direction Business Development Product Management Research Market Intelligence Marketing Management Multi-channel Marketing Analysis Strategic Planning Mobile Devices User Experience Marketing Segmentation Customer Insight Market Analysis Product Launch Integrated Marketing Business Strategy Management Marketing Communications Budgets Go-to-market Strategy Project Planning Marketing Research Strategic Thinking Product Planning Advertising Leadership Product Innovation Qualitative Research B2B Marketing Brand Management Competitive Analysis Demand Generation Global Marketing Market Planning Pricing Strategy See 35+     See less ", "Skills Software Development Windows Network Security Security Computer Security Win32 C++ C Software Design Multithreading Object Oriented Design C# Python Testing Visual Studio .NET Scrum LDAP System Architecture Win32 API Software Engineering Firewalls Distributed Systems TCP/IP Debugging See 10+     See less Skills  Software Development Windows Network Security Security Computer Security Win32 C++ C Software Design Multithreading Object Oriented Design C# Python Testing Visual Studio .NET Scrum LDAP System Architecture Win32 API Software Engineering Firewalls Distributed Systems TCP/IP Debugging See 10+     See less Software Development Windows Network Security Security Computer Security Win32 C++ C Software Design Multithreading Object Oriented Design C# Python Testing Visual Studio .NET Scrum LDAP System Architecture Win32 API Software Engineering Firewalls Distributed Systems TCP/IP Debugging See 10+     See less Software Development Windows Network Security Security Computer Security Win32 C++ C Software Design Multithreading Object Oriented Design C# Python Testing Visual Studio .NET Scrum LDAP System Architecture Win32 API Software Engineering Firewalls Distributed Systems TCP/IP Debugging See 10+     See less ", "Skills SoC ASIC RTL design Verilog VLSI Specman TCL Device Drivers Ethernet Logic Design SystemVerilog Debugging RTL Design Skills  SoC ASIC RTL design Verilog VLSI Specman TCL Device Drivers Ethernet Logic Design SystemVerilog Debugging RTL Design SoC ASIC RTL design Verilog VLSI Specman TCL Device Drivers Ethernet Logic Design SystemVerilog Debugging RTL Design SoC ASIC RTL design Verilog VLSI Specman TCL Device Drivers Ethernet Logic Design SystemVerilog Debugging RTL Design ", "Skills SAP R/3 SAP SD SAP Implementation ABAP Business Process Business Analysis Materials Management Supply Chain SAP BW ERP Integration SAP Netweaver Requirements Analysis Pre-sales SAP APO SAP ERP Supply Chain Management SNP SAP SD Project Management Strategy Legacy Systems SAP MM SAP BI Solution Architecture Requirements Gathering Testing EDI SAP FI Cross-functional Team... Global Delivery Master Data Management Data Migration ECC Business Intelligence Gap Analysis Consulting Process Consulting SAP Supply Chain See 25+     See less Skills  SAP R/3 SAP SD SAP Implementation ABAP Business Process Business Analysis Materials Management Supply Chain SAP BW ERP Integration SAP Netweaver Requirements Analysis Pre-sales SAP APO SAP ERP Supply Chain Management SNP SAP SD Project Management Strategy Legacy Systems SAP MM SAP BI Solution Architecture Requirements Gathering Testing EDI SAP FI Cross-functional Team... Global Delivery Master Data Management Data Migration ECC Business Intelligence Gap Analysis Consulting Process Consulting SAP Supply Chain See 25+     See less SAP R/3 SAP SD SAP Implementation ABAP Business Process Business Analysis Materials Management Supply Chain SAP BW ERP Integration SAP Netweaver Requirements Analysis Pre-sales SAP APO SAP ERP Supply Chain Management SNP SAP SD Project Management Strategy Legacy Systems SAP MM SAP BI Solution Architecture Requirements Gathering Testing EDI SAP FI Cross-functional Team... Global Delivery Master Data Management Data Migration ECC Business Intelligence Gap Analysis Consulting Process Consulting SAP Supply Chain See 25+     See less SAP R/3 SAP SD SAP Implementation ABAP Business Process Business Analysis Materials Management Supply Chain SAP BW ERP Integration SAP Netweaver Requirements Analysis Pre-sales SAP APO SAP ERP Supply Chain Management SNP SAP SD Project Management Strategy Legacy Systems SAP MM SAP BI Solution Architecture Requirements Gathering Testing EDI SAP FI Cross-functional Team... Global Delivery Master Data Management Data Migration ECC Business Intelligence Gap Analysis Consulting Process Consulting SAP Supply Chain See 25+     See less ", "Summary I have 13 years of experience in architecting and developing software/firmware in many diverse areas of technological fields. I have developed products in the areas of highly scalable/available distributed telecom switches (Both VOIP and PSTN protocols), indoor positioning systems. Right now I am leading the firmware team at Intel to develop a high density 3D NAND based enterprise SSD product over PCIe interface. I am passionate about getting complex cutting edge technologies to production. Summary I have 13 years of experience in architecting and developing software/firmware in many diverse areas of technological fields. I have developed products in the areas of highly scalable/available distributed telecom switches (Both VOIP and PSTN protocols), indoor positioning systems. Right now I am leading the firmware team at Intel to develop a high density 3D NAND based enterprise SSD product over PCIe interface. I am passionate about getting complex cutting edge technologies to production. I have 13 years of experience in architecting and developing software/firmware in many diverse areas of technological fields. I have developed products in the areas of highly scalable/available distributed telecom switches (Both VOIP and PSTN protocols), indoor positioning systems. Right now I am leading the firmware team at Intel to develop a high density 3D NAND based enterprise SSD product over PCIe interface. I am passionate about getting complex cutting edge technologies to production. I have 13 years of experience in architecting and developing software/firmware in many diverse areas of technological fields. I have developed products in the areas of highly scalable/available distributed telecom switches (Both VOIP and PSTN protocols), indoor positioning systems. Right now I am leading the firmware team at Intel to develop a high density 3D NAND based enterprise SSD product over PCIe interface. I am passionate about getting complex cutting edge technologies to production. Experience Firmware Team Lead Intel Corporation June 2014  – Present (1 year 3 months) Folsom, CA Leading a team of 10+ engineers for firmware development of Intel's PCIe/NVMe and 3D NAND based (dual core) product with focus area on NAND Channel Configuration. Staff Engineer Qualcomm June 2008  –  June 2014  (6 years 1 month) Santa Clara Indoor Positioning Systems, VoIP, QChat, PTT, iDen, SIP, Hadoop, Splunk, C++, Perl, DNS, IMS, VoLTE, Linux, Windows Senior Engineer Envio Networks June 2006  –  January 2008  (1 year 8 months) Bangaluru, Karnataka, India BREW, Java, Mobile Application, C, SVN, Windows Senior Software Engineer Winphoria-Motorola Core Networks Divison 2005  –  2006  (1 year) Bangaluru, Karnataka, India IMS, SIP, RTP, VoIP, Network Optimization, Linux Research Engineer CDOT (Centre of Development Telematics) 2002  –  2004  (2 years) Embedded Systems, RTOS, eCos, SS7, SIP, H.323, MEGACO, C++, Linux, Solaris, SCTP, Signaling Gateway, JTAG, trace32, RTP Firmware Team Lead Intel Corporation June 2014  – Present (1 year 3 months) Folsom, CA Leading a team of 10+ engineers for firmware development of Intel's PCIe/NVMe and 3D NAND based (dual core) product with focus area on NAND Channel Configuration. Firmware Team Lead Intel Corporation June 2014  – Present (1 year 3 months) Folsom, CA Leading a team of 10+ engineers for firmware development of Intel's PCIe/NVMe and 3D NAND based (dual core) product with focus area on NAND Channel Configuration. Staff Engineer Qualcomm June 2008  –  June 2014  (6 years 1 month) Santa Clara Indoor Positioning Systems, VoIP, QChat, PTT, iDen, SIP, Hadoop, Splunk, C++, Perl, DNS, IMS, VoLTE, Linux, Windows Staff Engineer Qualcomm June 2008  –  June 2014  (6 years 1 month) Santa Clara Indoor Positioning Systems, VoIP, QChat, PTT, iDen, SIP, Hadoop, Splunk, C++, Perl, DNS, IMS, VoLTE, Linux, Windows Senior Engineer Envio Networks June 2006  –  January 2008  (1 year 8 months) Bangaluru, Karnataka, India BREW, Java, Mobile Application, C, SVN, Windows Senior Engineer Envio Networks June 2006  –  January 2008  (1 year 8 months) Bangaluru, Karnataka, India BREW, Java, Mobile Application, C, SVN, Windows Senior Software Engineer Winphoria-Motorola Core Networks Divison 2005  –  2006  (1 year) Bangaluru, Karnataka, India IMS, SIP, RTP, VoIP, Network Optimization, Linux Senior Software Engineer Winphoria-Motorola Core Networks Divison 2005  –  2006  (1 year) Bangaluru, Karnataka, India IMS, SIP, RTP, VoIP, Network Optimization, Linux Research Engineer CDOT (Centre of Development Telematics) 2002  –  2004  (2 years) Embedded Systems, RTOS, eCos, SS7, SIP, H.323, MEGACO, C++, Linux, Solaris, SCTP, Signaling Gateway, JTAG, trace32, RTP Research Engineer CDOT (Centre of Development Telematics) 2002  –  2004  (2 years) Embedded Systems, RTOS, eCos, SS7, SIP, H.323, MEGACO, C++, Linux, Solaris, SCTP, Signaling Gateway, JTAG, trace32, RTP Languages Hindi Native or bilingual proficiency Bengali Native or bilingual proficiency English Full professional proficiency Hindi Native or bilingual proficiency Bengali Native or bilingual proficiency English Full professional proficiency Hindi Native or bilingual proficiency Bengali Native or bilingual proficiency English Full professional proficiency Native or bilingual proficiency Native or bilingual proficiency Full professional proficiency Skills SIP LTE Wireless C GSM Perl C++ Telecommunications RTOS UMTS Device Drivers Linux Embedded Systems Unix WiMAX Solaris SS7 VoIP Firmware See 4+     See less Skills  SIP LTE Wireless C GSM Perl C++ Telecommunications RTOS UMTS Device Drivers Linux Embedded Systems Unix WiMAX Solaris SS7 VoIP Firmware See 4+     See less SIP LTE Wireless C GSM Perl C++ Telecommunications RTOS UMTS Device Drivers Linux Embedded Systems Unix WiMAX Solaris SS7 VoIP Firmware See 4+     See less SIP LTE Wireless C GSM Perl C++ Telecommunications RTOS UMTS Device Drivers Linux Embedded Systems Unix WiMAX Solaris SS7 VoIP Firmware See 4+     See less Education National Institute of Technology Calicut Bachelor of Technology (B.Tech.),  Computer Science 1998  – 2002 Ramakrishna Mission Highschool 1986  – 1996 National Institute of Technology Calicut Bachelor of Technology (B.Tech.),  Computer Science 1998  – 2002 National Institute of Technology Calicut Bachelor of Technology (B.Tech.),  Computer Science 1998  – 2002 National Institute of Technology Calicut Bachelor of Technology (B.Tech.),  Computer Science 1998  – 2002 Ramakrishna Mission Highschool 1986  – 1996 Ramakrishna Mission Highschool 1986  – 1996 Ramakrishna Mission Highschool 1986  – 1996 ", "Skills Financial Forecasting Financial Analysis Financial Modeling Forecasting Strategic Influence Financial Goals Department Budgeting Expense Allocation Microsoft Excel PowerPoint Cost Savings Strategies IT Solutions Experienced Business... Cross-functional Team... Building Business... Leadership Sarbanes-Oxley Act Business Analysis Process Improvement Program Management Strategic Planning Business Process... See 7+     See less Skills  Financial Forecasting Financial Analysis Financial Modeling Forecasting Strategic Influence Financial Goals Department Budgeting Expense Allocation Microsoft Excel PowerPoint Cost Savings Strategies IT Solutions Experienced Business... Cross-functional Team... Building Business... Leadership Sarbanes-Oxley Act Business Analysis Process Improvement Program Management Strategic Planning Business Process... See 7+     See less Financial Forecasting Financial Analysis Financial Modeling Forecasting Strategic Influence Financial Goals Department Budgeting Expense Allocation Microsoft Excel PowerPoint Cost Savings Strategies IT Solutions Experienced Business... Cross-functional Team... Building Business... Leadership Sarbanes-Oxley Act Business Analysis Process Improvement Program Management Strategic Planning Business Process... See 7+     See less Financial Forecasting Financial Analysis Financial Modeling Forecasting Strategic Influence Financial Goals Department Budgeting Expense Allocation Microsoft Excel PowerPoint Cost Savings Strategies IT Solutions Experienced Business... Cross-functional Team... Building Business... Leadership Sarbanes-Oxley Act Business Analysis Process Improvement Program Management Strategic Planning Business Process... See 7+     See less ", "Summary 17+ years experience in software and hardware validation, product development, and project management. 5+ years experience in development, delivery and leadership of educational programs and community-sponsored organizations. Extensive background in hardware and software validation and testing and launching a product from conception to customer. 5+ years experience in team, personnel and organizational development. Change Agent for Optimized, Innovative and Efficient validation practices. Expert in deploying Agile Model for product development. \n \nSpecialties: Innovator, Change Agent, Strategist, Visionary, Leader, Getting Job Done, Deliver Results. Summary 17+ years experience in software and hardware validation, product development, and project management. 5+ years experience in development, delivery and leadership of educational programs and community-sponsored organizations. Extensive background in hardware and software validation and testing and launching a product from conception to customer. 5+ years experience in team, personnel and organizational development. Change Agent for Optimized, Innovative and Efficient validation practices. Expert in deploying Agile Model for product development. \n \nSpecialties: Innovator, Change Agent, Strategist, Visionary, Leader, Getting Job Done, Deliver Results. 17+ years experience in software and hardware validation, product development, and project management. 5+ years experience in development, delivery and leadership of educational programs and community-sponsored organizations. Extensive background in hardware and software validation and testing and launching a product from conception to customer. 5+ years experience in team, personnel and organizational development. Change Agent for Optimized, Innovative and Efficient validation practices. Expert in deploying Agile Model for product development. \n \nSpecialties: Innovator, Change Agent, Strategist, Visionary, Leader, Getting Job Done, Deliver Results. 17+ years experience in software and hardware validation, product development, and project management. 5+ years experience in development, delivery and leadership of educational programs and community-sponsored organizations. Extensive background in hardware and software validation and testing and launching a product from conception to customer. 5+ years experience in team, personnel and organizational development. Change Agent for Optimized, Innovative and Efficient validation practices. Expert in deploying Agile Model for product development. \n \nSpecialties: Innovator, Change Agent, Strategist, Visionary, Leader, Getting Job Done, Deliver Results. Experience Product Owner Intel Corporation June 2013  – Present (2 years 3 months) Program Director WITI (Women in Technology International) May 2013  – Present (2 years 4 months) Software Manager Intel Corporation August 2010  –  June 2013  (2 years 11 months) Software Validation Architect and Test Planning Manager Intel Corp. October 2008  –  August 2010  (1 year 11 months) Product Validation and Ramp Manager Intel December 2007  –  September 2008  (10 months) Product Development Team Lead Intel Corporation March 2006  –  December 2007  (1 year 10 months) Technical Integrator and Product Validation Team Lead Intel Corporation July 2004  –  March 2006  (1 year 9 months) Folsom, California Senior Product Development Engineer Intel Corporation July 1997  –  July 2004  (7 years 1 month) Folsom, CA Product Owner Intel Corporation June 2013  – Present (2 years 3 months) Product Owner Intel Corporation June 2013  – Present (2 years 3 months) Program Director WITI (Women in Technology International) May 2013  – Present (2 years 4 months) Program Director WITI (Women in Technology International) May 2013  – Present (2 years 4 months) Software Manager Intel Corporation August 2010  –  June 2013  (2 years 11 months) Software Manager Intel Corporation August 2010  –  June 2013  (2 years 11 months) Software Validation Architect and Test Planning Manager Intel Corp. October 2008  –  August 2010  (1 year 11 months) Software Validation Architect and Test Planning Manager Intel Corp. October 2008  –  August 2010  (1 year 11 months) Product Validation and Ramp Manager Intel December 2007  –  September 2008  (10 months) Product Validation and Ramp Manager Intel December 2007  –  September 2008  (10 months) Product Development Team Lead Intel Corporation March 2006  –  December 2007  (1 year 10 months) Product Development Team Lead Intel Corporation March 2006  –  December 2007  (1 year 10 months) Technical Integrator and Product Validation Team Lead Intel Corporation July 2004  –  March 2006  (1 year 9 months) Folsom, California Technical Integrator and Product Validation Team Lead Intel Corporation July 2004  –  March 2006  (1 year 9 months) Folsom, California Senior Product Development Engineer Intel Corporation July 1997  –  July 2004  (7 years 1 month) Folsom, CA Senior Product Development Engineer Intel Corporation July 1997  –  July 2004  (7 years 1 month) Folsom, CA Languages Hindi Hindi Hindi Skills Leadership Semiconductors Program Management Product Management Embedded Systems Product Development Debugging SoC Cross-functional Team... Project Management ASIC Testing Software Development Perl Agile Methodologies Distributed Systems Automated Software... Intel Process Improvement Strategy Manufacturing Team Management Software Engineering Device Drivers Management Manufacturing Validation Software Validation Performance and Use... Joint Venture and... IC Computer Architecture Processors Strategic Partnerships Embedded Software System Architecture Engineering Management Microprocessors Hardware Architecture Firmware Verilog EDA Hardware FPGA Semiconductor Industry Wireless SystemVerilog TCL Digital Signal... Functional Verification Simulations See 35+     See less Skills  Leadership Semiconductors Program Management Product Management Embedded Systems Product Development Debugging SoC Cross-functional Team... Project Management ASIC Testing Software Development Perl Agile Methodologies Distributed Systems Automated Software... Intel Process Improvement Strategy Manufacturing Team Management Software Engineering Device Drivers Management Manufacturing Validation Software Validation Performance and Use... Joint Venture and... IC Computer Architecture Processors Strategic Partnerships Embedded Software System Architecture Engineering Management Microprocessors Hardware Architecture Firmware Verilog EDA Hardware FPGA Semiconductor Industry Wireless SystemVerilog TCL Digital Signal... Functional Verification Simulations See 35+     See less Leadership Semiconductors Program Management Product Management Embedded Systems Product Development Debugging SoC Cross-functional Team... Project Management ASIC Testing Software Development Perl Agile Methodologies Distributed Systems Automated Software... Intel Process Improvement Strategy Manufacturing Team Management Software Engineering Device Drivers Management Manufacturing Validation Software Validation Performance and Use... Joint Venture and... IC Computer Architecture Processors Strategic Partnerships Embedded Software System Architecture Engineering Management Microprocessors Hardware Architecture Firmware Verilog EDA Hardware FPGA Semiconductor Industry Wireless SystemVerilog TCL Digital Signal... Functional Verification Simulations See 35+     See less Leadership Semiconductors Program Management Product Management Embedded Systems Product Development Debugging SoC Cross-functional Team... Project Management ASIC Testing Software Development Perl Agile Methodologies Distributed Systems Automated Software... Intel Process Improvement Strategy Manufacturing Team Management Software Engineering Device Drivers Management Manufacturing Validation Software Validation Performance and Use... Joint Venture and... IC Computer Architecture Processors Strategic Partnerships Embedded Software System Architecture Engineering Management Microprocessors Hardware Architecture Firmware Verilog EDA Hardware FPGA Semiconductor Industry Wireless SystemVerilog TCL Digital Signal... Functional Verification Simulations See 35+     See less Education California State University-Sacramento MS 1994  – 1997 Bangalore University Bachelors 1989  – 1993 California State University-Sacramento MS 1994  – 1997 California State University-Sacramento MS 1994  – 1997 California State University-Sacramento MS 1994  – 1997 Bangalore University Bachelors 1989  – 1993 Bangalore University Bachelors 1989  – 1993 Bangalore University Bachelors 1989  – 1993 ", "Summary Michael is self-motivated, creative and organized sales and marketing professional with over 20 years practical experience in IT and Telecom industry. Strong international background in marketing, business development, project management and people management experience. \n \nSpecialties: Sales, Marketing, PR, Start-up, Biz process optimization, Strategic thinking, Leadership, Influencing, Development, Media communications. Summary Michael is self-motivated, creative and organized sales and marketing professional with over 20 years practical experience in IT and Telecom industry. Strong international background in marketing, business development, project management and people management experience. \n \nSpecialties: Sales, Marketing, PR, Start-up, Biz process optimization, Strategic thinking, Leadership, Influencing, Development, Media communications. Michael is self-motivated, creative and organized sales and marketing professional with over 20 years practical experience in IT and Telecom industry. Strong international background in marketing, business development, project management and people management experience. \n \nSpecialties: Sales, Marketing, PR, Start-up, Biz process optimization, Strategic thinking, Leadership, Influencing, Development, Media communications. Michael is self-motivated, creative and organized sales and marketing professional with over 20 years practical experience in IT and Telecom industry. Strong international background in marketing, business development, project management and people management experience. \n \nSpecialties: Sales, Marketing, PR, Start-up, Biz process optimization, Strategic thinking, Leadership, Influencing, Development, Media communications. Experience Business Development Consultant (Freelance Service) Broadcom May 2014  –  February 2015  (10 months) Moscow, Russian Federation Responsibilities: \nCarry out local business development activities and promote local sales in Russia and CIS with main focus on Service Providers (Operators) in the territory. Maintain the relationship with key potential customer and players who are already using Broadcom’s technologies for mutual updates about roadmaps and projects. Engage with key decision makers related to potential Broadcom-based equipment and with Broadcom's global OEMs and ODMs customers to promote and close deals with Broadcom-based solution. \n New Business Development and Telecom Sales Manager Intel Technologies July 2011  –  November 2013  (2 years 5 months) Moscow, Russian Federation Responsibilities: \n•\tWide market analysis, discovery and development of new business direction (smartphones and tablets , 3G | LTE terminal equipment , M2M solutions , OTT and IPTV television) with a focus on the telecommunications market; \n•\tIncrease market share of solutions based on Intel technologies for both consumer and corporate segments of the market through direct channels of telecom operators and independent retail  \n•\tBuild executive level relationships in Telecom accounts. Determine the needs of covered accounts and influence on roadmap of the corporation. \n•\tProject management and coordination of virtual working groups between different divisions of the corporation for the introduction of promising new products on the market Retail Marketing Manager - Team Lead Intel Corporation UK Limited May 2010  –  July 2011  (1 year 3 months) Moscow, Russian Federation Develop and drive covered Retail (both large and small format) engagement strategy in Russia and CIS with the primary focus on influencing assortment: product marketing support of seasonal preparation process that address product/price situation in region; defining and tracking key indicators in sales, Intel's assets usage in retailers marketing deliverables and ROI of marketing investments. Marketing Development Team Lead Intel Corporation UK Limited March 2009  –  June 2010  (1 year 4 months) Marketing Development Team Lead - Coach MDM team, Develop and drive marketing strategies in Russia and CIS countries, and support MNC's co-marketing activities planning and implementations. Market Development Manager (Taiwan) Intel Microelectronics Asia Ltd. July 2008  –  February 2009  (8 months) Taiwan Assignment in Taipei, Taiwan. Close work with Asustek worldwide marketing team on joint program coordination for emerging markets and Netbook (EeePC) co-marketing. Drive marketing strategy for Latin America (Brazil and Mexico) to support Asus business startup. Market Development Manager Intel January 2006  –  July 2008  (2 years 7 months) Market Development Manager for multi national accounts, Russia and CIS retail/MNCs co-program coordination and support different departments in mobility promotions. Drive integrated marketing strategy in Russia/CIS retail. Mobility Platform Manager for Russia and CIS Intel July 2004  –  January 2006  (1 year 7 months) Mobility Platform Manager for Russia and CIS  \ncountries and Market Development Manager for Acer, Asus, Toshiba, Sony, LG, Samsung, Rover Computers and iRU. Responsibilities: Develop and drive marketing strategies focused on mobility in Russia and CIS countries. Close relations with key MNCs, LOEMs and channel customers in co- \nmarketing activities planning and implementations. Intel’s Early Access Program (Telco WiFi ecosystem enabling) management in Russia/CIS; development and verification (WVP) wireless ecosystem overall; communications and implementation of joined marketing actions with Wireless Internet Service Providers. Channel Field Sales Engineer in St. Petersburg and North-West Russia region Intel July 2000  –  July 2004  (4 years 1 month) Channel Field Sales Engineer in St. Petersburg  \nand North-West Russia region. Channel Representative - South Russia, Armenia & Georgia Intel July 1997  –  July 2000  (3 years 1 month) Channel representative in Central and South  \nRussia Region, Armenia and Georgia - based in Volgograd - with following responsibilities: build channel (biz start-up) and develop distribution in new territories. Engineer JSC Aequitas August 1995  –  July 1997  (2 years) developer of networking and communications solutions for a variety of market sectors including: telecommunications, state-owned enterprises, industrial companies, the financial sector, the area of small and medium-sized businesses. Specialty in system integration: design and installation of structured cabling systems. Business Development Consultant (Freelance Service) Broadcom May 2014  –  February 2015  (10 months) Moscow, Russian Federation Responsibilities: \nCarry out local business development activities and promote local sales in Russia and CIS with main focus on Service Providers (Operators) in the territory. Maintain the relationship with key potential customer and players who are already using Broadcom’s technologies for mutual updates about roadmaps and projects. Engage with key decision makers related to potential Broadcom-based equipment and with Broadcom's global OEMs and ODMs customers to promote and close deals with Broadcom-based solution. \n Business Development Consultant (Freelance Service) Broadcom May 2014  –  February 2015  (10 months) Moscow, Russian Federation Responsibilities: \nCarry out local business development activities and promote local sales in Russia and CIS with main focus on Service Providers (Operators) in the territory. Maintain the relationship with key potential customer and players who are already using Broadcom’s technologies for mutual updates about roadmaps and projects. Engage with key decision makers related to potential Broadcom-based equipment and with Broadcom's global OEMs and ODMs customers to promote and close deals with Broadcom-based solution. \n New Business Development and Telecom Sales Manager Intel Technologies July 2011  –  November 2013  (2 years 5 months) Moscow, Russian Federation Responsibilities: \n•\tWide market analysis, discovery and development of new business direction (smartphones and tablets , 3G | LTE terminal equipment , M2M solutions , OTT and IPTV television) with a focus on the telecommunications market; \n•\tIncrease market share of solutions based on Intel technologies for both consumer and corporate segments of the market through direct channels of telecom operators and independent retail  \n•\tBuild executive level relationships in Telecom accounts. Determine the needs of covered accounts and influence on roadmap of the corporation. \n•\tProject management and coordination of virtual working groups between different divisions of the corporation for the introduction of promising new products on the market New Business Development and Telecom Sales Manager Intel Technologies July 2011  –  November 2013  (2 years 5 months) Moscow, Russian Federation Responsibilities: \n•\tWide market analysis, discovery and development of new business direction (smartphones and tablets , 3G | LTE terminal equipment , M2M solutions , OTT and IPTV television) with a focus on the telecommunications market; \n•\tIncrease market share of solutions based on Intel technologies for both consumer and corporate segments of the market through direct channels of telecom operators and independent retail  \n•\tBuild executive level relationships in Telecom accounts. Determine the needs of covered accounts and influence on roadmap of the corporation. \n•\tProject management and coordination of virtual working groups between different divisions of the corporation for the introduction of promising new products on the market Retail Marketing Manager - Team Lead Intel Corporation UK Limited May 2010  –  July 2011  (1 year 3 months) Moscow, Russian Federation Develop and drive covered Retail (both large and small format) engagement strategy in Russia and CIS with the primary focus on influencing assortment: product marketing support of seasonal preparation process that address product/price situation in region; defining and tracking key indicators in sales, Intel's assets usage in retailers marketing deliverables and ROI of marketing investments. Retail Marketing Manager - Team Lead Intel Corporation UK Limited May 2010  –  July 2011  (1 year 3 months) Moscow, Russian Federation Develop and drive covered Retail (both large and small format) engagement strategy in Russia and CIS with the primary focus on influencing assortment: product marketing support of seasonal preparation process that address product/price situation in region; defining and tracking key indicators in sales, Intel's assets usage in retailers marketing deliverables and ROI of marketing investments. Marketing Development Team Lead Intel Corporation UK Limited March 2009  –  June 2010  (1 year 4 months) Marketing Development Team Lead - Coach MDM team, Develop and drive marketing strategies in Russia and CIS countries, and support MNC's co-marketing activities planning and implementations. Marketing Development Team Lead Intel Corporation UK Limited March 2009  –  June 2010  (1 year 4 months) Marketing Development Team Lead - Coach MDM team, Develop and drive marketing strategies in Russia and CIS countries, and support MNC's co-marketing activities planning and implementations. Market Development Manager (Taiwan) Intel Microelectronics Asia Ltd. July 2008  –  February 2009  (8 months) Taiwan Assignment in Taipei, Taiwan. Close work with Asustek worldwide marketing team on joint program coordination for emerging markets and Netbook (EeePC) co-marketing. Drive marketing strategy for Latin America (Brazil and Mexico) to support Asus business startup. Market Development Manager (Taiwan) Intel Microelectronics Asia Ltd. July 2008  –  February 2009  (8 months) Taiwan Assignment in Taipei, Taiwan. Close work with Asustek worldwide marketing team on joint program coordination for emerging markets and Netbook (EeePC) co-marketing. Drive marketing strategy for Latin America (Brazil and Mexico) to support Asus business startup. Market Development Manager Intel January 2006  –  July 2008  (2 years 7 months) Market Development Manager for multi national accounts, Russia and CIS retail/MNCs co-program coordination and support different departments in mobility promotions. Drive integrated marketing strategy in Russia/CIS retail. Market Development Manager Intel January 2006  –  July 2008  (2 years 7 months) Market Development Manager for multi national accounts, Russia and CIS retail/MNCs co-program coordination and support different departments in mobility promotions. Drive integrated marketing strategy in Russia/CIS retail. Mobility Platform Manager for Russia and CIS Intel July 2004  –  January 2006  (1 year 7 months) Mobility Platform Manager for Russia and CIS  \ncountries and Market Development Manager for Acer, Asus, Toshiba, Sony, LG, Samsung, Rover Computers and iRU. Responsibilities: Develop and drive marketing strategies focused on mobility in Russia and CIS countries. Close relations with key MNCs, LOEMs and channel customers in co- \nmarketing activities planning and implementations. Intel’s Early Access Program (Telco WiFi ecosystem enabling) management in Russia/CIS; development and verification (WVP) wireless ecosystem overall; communications and implementation of joined marketing actions with Wireless Internet Service Providers. Mobility Platform Manager for Russia and CIS Intel July 2004  –  January 2006  (1 year 7 months) Mobility Platform Manager for Russia and CIS  \ncountries and Market Development Manager for Acer, Asus, Toshiba, Sony, LG, Samsung, Rover Computers and iRU. Responsibilities: Develop and drive marketing strategies focused on mobility in Russia and CIS countries. Close relations with key MNCs, LOEMs and channel customers in co- \nmarketing activities planning and implementations. Intel’s Early Access Program (Telco WiFi ecosystem enabling) management in Russia/CIS; development and verification (WVP) wireless ecosystem overall; communications and implementation of joined marketing actions with Wireless Internet Service Providers. Channel Field Sales Engineer in St. Petersburg and North-West Russia region Intel July 2000  –  July 2004  (4 years 1 month) Channel Field Sales Engineer in St. Petersburg  \nand North-West Russia region. Channel Field Sales Engineer in St. Petersburg and North-West Russia region Intel July 2000  –  July 2004  (4 years 1 month) Channel Field Sales Engineer in St. Petersburg  \nand North-West Russia region. Channel Representative - South Russia, Armenia & Georgia Intel July 1997  –  July 2000  (3 years 1 month) Channel representative in Central and South  \nRussia Region, Armenia and Georgia - based in Volgograd - with following responsibilities: build channel (biz start-up) and develop distribution in new territories. Channel Representative - South Russia, Armenia & Georgia Intel July 1997  –  July 2000  (3 years 1 month) Channel representative in Central and South  \nRussia Region, Armenia and Georgia - based in Volgograd - with following responsibilities: build channel (biz start-up) and develop distribution in new territories. Engineer JSC Aequitas August 1995  –  July 1997  (2 years) developer of networking and communications solutions for a variety of market sectors including: telecommunications, state-owned enterprises, industrial companies, the financial sector, the area of small and medium-sized businesses. Specialty in system integration: design and installation of structured cabling systems. Engineer JSC Aequitas August 1995  –  July 1997  (2 years) developer of networking and communications solutions for a variety of market sectors including: telecommunications, state-owned enterprises, industrial companies, the financial sector, the area of small and medium-sized businesses. Specialty in system integration: design and installation of structured cabling systems. Languages English Full professional proficiency Russian Native or bilingual proficiency Chinese Elementary proficiency English Full professional proficiency Russian Native or bilingual proficiency Chinese Elementary proficiency English Full professional proficiency Russian Native or bilingual proficiency Chinese Elementary proficiency Full professional proficiency Native or bilingual proficiency Elementary proficiency Skills Marketing Strategic Thinking Social Influence Public Relations Go-to-market Strategy Leadership Sales Business Strategy Wireless Product Marketing Key Account Management Product Development New Business Development Product Management Management Start-ups Marketing Strategy Competitive Analysis Integrated Marketing Business Development Marketing Management Strategic Partnerships Project Planning Channel B2B Channel Partners Cross-functional Team... Account Management Sales Management Strategy Multi-channel Marketing Retail International Sales Semiconductors Pricing Solution Selling Partner Management Market Analysis Team Management Demand Generation Business Planning Mobile Devices CRM Sales Operations Market Research Product Launch Cloud Computing Direct Sales Business Alliances Telecommunications See 35+     See less Skills  Marketing Strategic Thinking Social Influence Public Relations Go-to-market Strategy Leadership Sales Business Strategy Wireless Product Marketing Key Account Management Product Development New Business Development Product Management Management Start-ups Marketing Strategy Competitive Analysis Integrated Marketing Business Development Marketing Management Strategic Partnerships Project Planning Channel B2B Channel Partners Cross-functional Team... Account Management Sales Management Strategy Multi-channel Marketing Retail International Sales Semiconductors Pricing Solution Selling Partner Management Market Analysis Team Management Demand Generation Business Planning Mobile Devices CRM Sales Operations Market Research Product Launch Cloud Computing Direct Sales Business Alliances Telecommunications See 35+     See less Marketing Strategic Thinking Social Influence Public Relations Go-to-market Strategy Leadership Sales Business Strategy Wireless Product Marketing Key Account Management Product Development New Business Development Product Management Management Start-ups Marketing Strategy Competitive Analysis Integrated Marketing Business Development Marketing Management Strategic Partnerships Project Planning Channel B2B Channel Partners Cross-functional Team... Account Management Sales Management Strategy Multi-channel Marketing Retail International Sales Semiconductors Pricing Solution Selling Partner Management Market Analysis Team Management Demand Generation Business Planning Mobile Devices CRM Sales Operations Market Research Product Launch Cloud Computing Direct Sales Business Alliances Telecommunications See 35+     See less Marketing Strategic Thinking Social Influence Public Relations Go-to-market Strategy Leadership Sales Business Strategy Wireless Product Marketing Key Account Management Product Development New Business Development Product Management Management Start-ups Marketing Strategy Competitive Analysis Integrated Marketing Business Development Marketing Management Strategic Partnerships Project Planning Channel B2B Channel Partners Cross-functional Team... Account Management Sales Management Strategy Multi-channel Marketing Retail International Sales Semiconductors Pricing Solution Selling Partner Management Market Analysis Team Management Demand Generation Business Planning Mobile Devices CRM Sales Operations Market Research Product Launch Cloud Computing Direct Sales Business Alliances Telecommunications See 35+     See less Honors & Awards Special Regional award for outstanding work during 1998 in EMEA region. Intel Technologies Inc. December 1998 Recognition award for successful Intel Centrino Mobile Technology launch in Russia in 2003. Intel, Country Marketing and PR September 2003 EMEA Divisional recognition Award for best ever BTS campaign focused on mobility in RCIS. Intel, Corporate Marketing Group December 2004 EMEA Recognition Awards in Q3/06 for FIFA World Cup Joint Marketing Program with Toshiba Intel Corporation October 2006 EMEA Recognition Awards in Q4/07 for Sony VAIO and BMW Federal Roadshow Joint Marketing program Intel Corporation December 2007 http://www.cnews.ru/news/line/index.shtml?2006/08/14/208446 \nhttp://www.sptc.ru/perl/showfile.fcgi?fsmode=articles&filename=20061101.html \n Intel RCIS Special Recognition award Q4’10 for achieving breakthrough sales-in and sales-out of Core i5 and Core i3 systems in top Russian retail for Xmas season 2010. Intel Corporation February 2011 EMEA Recognition Award 2012 for introduction of first Intel SoC based smartphone MegaFon MINT on Russian market (4th project worldwide) Intel Corporation February 2013 Special Regional award for outstanding work during 1998 in EMEA region. Intel Technologies Inc. December 1998 Special Regional award for outstanding work during 1998 in EMEA region. Intel Technologies Inc. December 1998 Special Regional award for outstanding work during 1998 in EMEA region. Intel Technologies Inc. December 1998 Recognition award for successful Intel Centrino Mobile Technology launch in Russia in 2003. Intel, Country Marketing and PR September 2003 Recognition award for successful Intel Centrino Mobile Technology launch in Russia in 2003. Intel, Country Marketing and PR September 2003 Recognition award for successful Intel Centrino Mobile Technology launch in Russia in 2003. Intel, Country Marketing and PR September 2003 EMEA Divisional recognition Award for best ever BTS campaign focused on mobility in RCIS. Intel, Corporate Marketing Group December 2004 EMEA Divisional recognition Award for best ever BTS campaign focused on mobility in RCIS. Intel, Corporate Marketing Group December 2004 EMEA Divisional recognition Award for best ever BTS campaign focused on mobility in RCIS. Intel, Corporate Marketing Group December 2004 EMEA Recognition Awards in Q3/06 for FIFA World Cup Joint Marketing Program with Toshiba Intel Corporation October 2006 EMEA Recognition Awards in Q3/06 for FIFA World Cup Joint Marketing Program with Toshiba Intel Corporation October 2006 EMEA Recognition Awards in Q3/06 for FIFA World Cup Joint Marketing Program with Toshiba Intel Corporation October 2006 EMEA Recognition Awards in Q4/07 for Sony VAIO and BMW Federal Roadshow Joint Marketing program Intel Corporation December 2007 http://www.cnews.ru/news/line/index.shtml?2006/08/14/208446 \nhttp://www.sptc.ru/perl/showfile.fcgi?fsmode=articles&filename=20061101.html \n EMEA Recognition Awards in Q4/07 for Sony VAIO and BMW Federal Roadshow Joint Marketing program Intel Corporation December 2007 http://www.cnews.ru/news/line/index.shtml?2006/08/14/208446 \nhttp://www.sptc.ru/perl/showfile.fcgi?fsmode=articles&filename=20061101.html \n EMEA Recognition Awards in Q4/07 for Sony VAIO and BMW Federal Roadshow Joint Marketing program Intel Corporation December 2007 http://www.cnews.ru/news/line/index.shtml?2006/08/14/208446 \nhttp://www.sptc.ru/perl/showfile.fcgi?fsmode=articles&filename=20061101.html \n Intel RCIS Special Recognition award Q4’10 for achieving breakthrough sales-in and sales-out of Core i5 and Core i3 systems in top Russian retail for Xmas season 2010. Intel Corporation February 2011 Intel RCIS Special Recognition award Q4’10 for achieving breakthrough sales-in and sales-out of Core i5 and Core i3 systems in top Russian retail for Xmas season 2010. Intel Corporation February 2011 Intel RCIS Special Recognition award Q4’10 for achieving breakthrough sales-in and sales-out of Core i5 and Core i3 systems in top Russian retail for Xmas season 2010. Intel Corporation February 2011 EMEA Recognition Award 2012 for introduction of first Intel SoC based smartphone MegaFon MINT on Russian market (4th project worldwide) Intel Corporation February 2013 EMEA Recognition Award 2012 for introduction of first Intel SoC based smartphone MegaFon MINT on Russian market (4th project worldwide) Intel Corporation February 2013 EMEA Recognition Award 2012 for introduction of first Intel SoC based smartphone MegaFon MINT on Russian market (4th project worldwide) Intel Corporation February 2013 ", "Experience Mechanical Team Lead Intel Corporation 2011  – Present (4 years) DuPont, WA Scoped, planned, designed, and developed HVM Solid State Drive Enclosures meeting cost and schedule constraints using internal and external design resources  \n•\tInterfaced extensively with Asian ODM partners and vendors for DFx reviews and compliance.  \n•\tDesigned Intel’s first thixomolded SSD enclosure and carried through to production. Mechanical Architect Intel Corporation 2006  –  2011  (5 years) DuPont, WA Returned to Individual Contributor after group downsizing. Vetted, designed, and developed several client laptop and all-in-one systems, concepts, and prototypes. \n•\tBalanced inputs from Principal Engineers, ID, and manufacturing and produced to unique all-in-one system for OEM, from initial concept to retail shelf, using applied design expertise and negotiation skills.  \n•\tProvided design, direction, and support for all rapid prototype components, expediting system level decisions and delivering key hardware for milestones during development of two Gateway HVM systems \n•\tDesigned, procured, delivered Laptop Reference Design prototypes using common building blocks \n•\tCreated innovative snap together hinge-less tablet/keyboard interface utilizing friction cam  \n•\tHeld weekly mentoring sessions with junior engineers in Shanghai Mechanical Design Manager Intel Corporation 2005  –  2006  (1 year) DuPont, WA Given Management role after unexpected departure of team manager. Managed team of mechanical and thermal engineers and technicians to deliver several concept and production-level desktop system designs. \n•\tLed team to consistently deliver designs on time and within budget.  \n•\tDeveloped Product Life Cycle process tailored to group’s project resulting is clear expectations, ownership, and review milestones for system development. Mechanical Architect Intel Corporation 2003  –  2005  (2 years) DuPont, WA Vetted, designed, and developed several desktop and living room systems and concepts. \n•\tDeveloped Intel’s First Consumer Electronic (CE) Concept Platform for the Living Room \n•\tInterfaced and guided European OEM on their first CE PC design by working with Taiwan ODM \n•\tArchitected new concepts in conjunction with cross functional team  \n•\tQuickly developed, procured, and delivered numerous show units \n•\tDebugged, modified, and assembled show units until functional and cosmetically appealing Mechanical Design Manager Intel Corporation 2000  –  2003  (3 years) DuPont, WA Managed group of mechanical design engineers and technicians to deliver Intel reference cooling and retention designs for server processors and chipsets \n•\tLead Design Integrator for Xeon processor cooling solutions. Lead mechanical, structural and thermal engineers to develop the CPU thermal and mechanical retention solutions for rack servers. \n•\tPatent award for integrated heat sink removal tool \n•\tDeveloped Intel’s first liquid cooling system for a 1U server \n•\tCo-developed with vendor a R134a phase change cooling system for a 1U server Lead Mechanical Engineer Intel 1997  –  2000  (3 years) DuPont, WA Lead the concept team in designing and developing smaller innovative desktop PCs using Pro/Engineer.  \n•\tInterfaced with industrial designers and customers to create initial system layout, detail design, thermal and acoustic design, material selection, bill of materials, prototype procurement, part and tool quotes, tool sampling and first article inspections. Mechanical Engineer Siemens - Pelton and Crane 1991  –  1996  (5 years) Charlotte, NC Lead US Engineer for new multi-national development of a new dental operatory chair. Created final design and procured production tooling for castings, molded plastics, and sheetmetal. Interfaced with industrial designers in the conceptual stages to develop initial prototypes. System Administrator of CAD system, managed databases and provided user support. Project Engineer Collier-Keyworth 1989  –  1991  (2 years) Liberty, NC Designed and developed variety of office chair tilting mechanisms from stamped sheetmetal and weldments. Created cost reduction designs by utilizing highly formed surfaced sheetmetal. Managed Drafting personnel, CAD/CAM systems, and the R&D laboratory. Senior Mechanical Engineer Pratt & Whitney 1985  –  1989  (4 years) West Palm Beach, Florida Developed and improved a number of innovative aerospace engine and engine component designs, including Space Shuttle Main Engine LOX preburner impeller, final rotational balancing system for the SSME LOX assembly, Tantalum bellows controller for the RL-10A-4 rocket engine, as well as other turbofan jet engines. Mechanical Team Lead Intel Corporation 2011  – Present (4 years) DuPont, WA Scoped, planned, designed, and developed HVM Solid State Drive Enclosures meeting cost and schedule constraints using internal and external design resources  \n•\tInterfaced extensively with Asian ODM partners and vendors for DFx reviews and compliance.  \n•\tDesigned Intel’s first thixomolded SSD enclosure and carried through to production. Mechanical Team Lead Intel Corporation 2011  – Present (4 years) DuPont, WA Scoped, planned, designed, and developed HVM Solid State Drive Enclosures meeting cost and schedule constraints using internal and external design resources  \n•\tInterfaced extensively with Asian ODM partners and vendors for DFx reviews and compliance.  \n•\tDesigned Intel’s first thixomolded SSD enclosure and carried through to production. Mechanical Architect Intel Corporation 2006  –  2011  (5 years) DuPont, WA Returned to Individual Contributor after group downsizing. Vetted, designed, and developed several client laptop and all-in-one systems, concepts, and prototypes. \n•\tBalanced inputs from Principal Engineers, ID, and manufacturing and produced to unique all-in-one system for OEM, from initial concept to retail shelf, using applied design expertise and negotiation skills.  \n•\tProvided design, direction, and support for all rapid prototype components, expediting system level decisions and delivering key hardware for milestones during development of two Gateway HVM systems \n•\tDesigned, procured, delivered Laptop Reference Design prototypes using common building blocks \n•\tCreated innovative snap together hinge-less tablet/keyboard interface utilizing friction cam  \n•\tHeld weekly mentoring sessions with junior engineers in Shanghai Mechanical Architect Intel Corporation 2006  –  2011  (5 years) DuPont, WA Returned to Individual Contributor after group downsizing. Vetted, designed, and developed several client laptop and all-in-one systems, concepts, and prototypes. \n•\tBalanced inputs from Principal Engineers, ID, and manufacturing and produced to unique all-in-one system for OEM, from initial concept to retail shelf, using applied design expertise and negotiation skills.  \n•\tProvided design, direction, and support for all rapid prototype components, expediting system level decisions and delivering key hardware for milestones during development of two Gateway HVM systems \n•\tDesigned, procured, delivered Laptop Reference Design prototypes using common building blocks \n•\tCreated innovative snap together hinge-less tablet/keyboard interface utilizing friction cam  \n•\tHeld weekly mentoring sessions with junior engineers in Shanghai Mechanical Design Manager Intel Corporation 2005  –  2006  (1 year) DuPont, WA Given Management role after unexpected departure of team manager. Managed team of mechanical and thermal engineers and technicians to deliver several concept and production-level desktop system designs. \n•\tLed team to consistently deliver designs on time and within budget.  \n•\tDeveloped Product Life Cycle process tailored to group’s project resulting is clear expectations, ownership, and review milestones for system development. Mechanical Design Manager Intel Corporation 2005  –  2006  (1 year) DuPont, WA Given Management role after unexpected departure of team manager. Managed team of mechanical and thermal engineers and technicians to deliver several concept and production-level desktop system designs. \n•\tLed team to consistently deliver designs on time and within budget.  \n•\tDeveloped Product Life Cycle process tailored to group’s project resulting is clear expectations, ownership, and review milestones for system development. Mechanical Architect Intel Corporation 2003  –  2005  (2 years) DuPont, WA Vetted, designed, and developed several desktop and living room systems and concepts. \n•\tDeveloped Intel’s First Consumer Electronic (CE) Concept Platform for the Living Room \n•\tInterfaced and guided European OEM on their first CE PC design by working with Taiwan ODM \n•\tArchitected new concepts in conjunction with cross functional team  \n•\tQuickly developed, procured, and delivered numerous show units \n•\tDebugged, modified, and assembled show units until functional and cosmetically appealing Mechanical Architect Intel Corporation 2003  –  2005  (2 years) DuPont, WA Vetted, designed, and developed several desktop and living room systems and concepts. \n•\tDeveloped Intel’s First Consumer Electronic (CE) Concept Platform for the Living Room \n•\tInterfaced and guided European OEM on their first CE PC design by working with Taiwan ODM \n•\tArchitected new concepts in conjunction with cross functional team  \n•\tQuickly developed, procured, and delivered numerous show units \n•\tDebugged, modified, and assembled show units until functional and cosmetically appealing Mechanical Design Manager Intel Corporation 2000  –  2003  (3 years) DuPont, WA Managed group of mechanical design engineers and technicians to deliver Intel reference cooling and retention designs for server processors and chipsets \n•\tLead Design Integrator for Xeon processor cooling solutions. Lead mechanical, structural and thermal engineers to develop the CPU thermal and mechanical retention solutions for rack servers. \n•\tPatent award for integrated heat sink removal tool \n•\tDeveloped Intel’s first liquid cooling system for a 1U server \n•\tCo-developed with vendor a R134a phase change cooling system for a 1U server Mechanical Design Manager Intel Corporation 2000  –  2003  (3 years) DuPont, WA Managed group of mechanical design engineers and technicians to deliver Intel reference cooling and retention designs for server processors and chipsets \n•\tLead Design Integrator for Xeon processor cooling solutions. Lead mechanical, structural and thermal engineers to develop the CPU thermal and mechanical retention solutions for rack servers. \n•\tPatent award for integrated heat sink removal tool \n•\tDeveloped Intel’s first liquid cooling system for a 1U server \n•\tCo-developed with vendor a R134a phase change cooling system for a 1U server Lead Mechanical Engineer Intel 1997  –  2000  (3 years) DuPont, WA Lead the concept team in designing and developing smaller innovative desktop PCs using Pro/Engineer.  \n•\tInterfaced with industrial designers and customers to create initial system layout, detail design, thermal and acoustic design, material selection, bill of materials, prototype procurement, part and tool quotes, tool sampling and first article inspections. Lead Mechanical Engineer Intel 1997  –  2000  (3 years) DuPont, WA Lead the concept team in designing and developing smaller innovative desktop PCs using Pro/Engineer.  \n•\tInterfaced with industrial designers and customers to create initial system layout, detail design, thermal and acoustic design, material selection, bill of materials, prototype procurement, part and tool quotes, tool sampling and first article inspections. Mechanical Engineer Siemens - Pelton and Crane 1991  –  1996  (5 years) Charlotte, NC Lead US Engineer for new multi-national development of a new dental operatory chair. Created final design and procured production tooling for castings, molded plastics, and sheetmetal. Interfaced with industrial designers in the conceptual stages to develop initial prototypes. System Administrator of CAD system, managed databases and provided user support. Mechanical Engineer Siemens - Pelton and Crane 1991  –  1996  (5 years) Charlotte, NC Lead US Engineer for new multi-national development of a new dental operatory chair. Created final design and procured production tooling for castings, molded plastics, and sheetmetal. Interfaced with industrial designers in the conceptual stages to develop initial prototypes. System Administrator of CAD system, managed databases and provided user support. Project Engineer Collier-Keyworth 1989  –  1991  (2 years) Liberty, NC Designed and developed variety of office chair tilting mechanisms from stamped sheetmetal and weldments. Created cost reduction designs by utilizing highly formed surfaced sheetmetal. Managed Drafting personnel, CAD/CAM systems, and the R&D laboratory. Project Engineer Collier-Keyworth 1989  –  1991  (2 years) Liberty, NC Designed and developed variety of office chair tilting mechanisms from stamped sheetmetal and weldments. Created cost reduction designs by utilizing highly formed surfaced sheetmetal. Managed Drafting personnel, CAD/CAM systems, and the R&D laboratory. Senior Mechanical Engineer Pratt & Whitney 1985  –  1989  (4 years) West Palm Beach, Florida Developed and improved a number of innovative aerospace engine and engine component designs, including Space Shuttle Main Engine LOX preburner impeller, final rotational balancing system for the SSME LOX assembly, Tantalum bellows controller for the RL-10A-4 rocket engine, as well as other turbofan jet engines. Senior Mechanical Engineer Pratt & Whitney 1985  –  1989  (4 years) West Palm Beach, Florida Developed and improved a number of innovative aerospace engine and engine component designs, including Space Shuttle Main Engine LOX preburner impeller, final rotational balancing system for the SSME LOX assembly, Tantalum bellows controller for the RL-10A-4 rocket engine, as well as other turbofan jet engines. Skills Program Management Semiconductors Engineering Management CAD Manufacturing Design for Manufacturing Mechanical Engineering Engineering Embedded Systems Intel Product Design Product Management Pro Engineer Product Engineering Solidworks Thermal Analysis Product Development Cross-functional Team... Design of Experiments Processors Electronics Testing Sheet Metal IC Debugging PCB design Semiconductor Industry Manufacturing... See 13+     See less Skills  Program Management Semiconductors Engineering Management CAD Manufacturing Design for Manufacturing Mechanical Engineering Engineering Embedded Systems Intel Product Design Product Management Pro Engineer Product Engineering Solidworks Thermal Analysis Product Development Cross-functional Team... Design of Experiments Processors Electronics Testing Sheet Metal IC Debugging PCB design Semiconductor Industry Manufacturing... See 13+     See less Program Management Semiconductors Engineering Management CAD Manufacturing Design for Manufacturing Mechanical Engineering Engineering Embedded Systems Intel Product Design Product Management Pro Engineer Product Engineering Solidworks Thermal Analysis Product Development Cross-functional Team... Design of Experiments Processors Electronics Testing Sheet Metal IC Debugging PCB design Semiconductor Industry Manufacturing... See 13+     See less Program Management Semiconductors Engineering Management CAD Manufacturing Design for Manufacturing Mechanical Engineering Engineering Embedded Systems Intel Product Design Product Management Pro Engineer Product Engineering Solidworks Thermal Analysis Product Development Cross-functional Team... Design of Experiments Processors Electronics Testing Sheet Metal IC Debugging PCB design Semiconductor Industry Manufacturing... See 13+     See less Education North Carolina State University Bachelor of Science (BS),  Mechanical Engineering 1981  – 1985 North Carolina State University Bachelor of Science (BS),  Mechanical Engineering 1981  – 1985 North Carolina State University Bachelor of Science (BS),  Mechanical Engineering 1981  – 1985 North Carolina State University Bachelor of Science (BS),  Mechanical Engineering 1981  – 1985 ", "Experience PDE SW/HW team lead Intel Corporation August 2013  – Present (2 years 1 month) Israel Team Lead role is overseeing and providing leadership to senior and junior level Test Development/Product Engineers in a new product development environment. Responsible for the future and current products SW & HW platforms development. engaged in all HW development aspect from the PDE perspective. leading the SW development efforts for the new platforms and products. \non top of that involved in system level validation development as a complimentary test suite to the ATE one in order to guaranty the outgoing number of defects. SOC PDE Team Lead Intel Corporation July 2012  – Present (3 years 2 months) Austin, Texas Area Team Lead role is overseeing and providing leadership to senior and junior level Test Development/Product Engineers in a new product development environment.  Responsible for the technical performance and performance to schedule of the Test Development/Product Engineering team.  The team is involved in the development of final test programs for evaluation, qualification, characterization and production testing .  Test Development\\Product Engineer is responsible for procuring production hardware; such as ATE test PCBs and handler contact kits, as well as device bench characterization, product manufacturability tasks, and the Qualification of new devices. The Team Lead is also required to develop ATE test solutions and perform product engineering tasks for new products in addition to the team lead role Senior HSIO PDE/EV Eng. Intel May 2010  –  June 2012  (2 years 2 months) All as in PDE position and: \nResponsible for Electrical Validation on multiple SKUs of silicon, hardware boards and running debug software and/firmware across variations of process, voltage, temperature corners  \n- Able to proactively anticipate debug, validation needs and interact with ODM on test plan review, test result review, and travel to ODM site for EVT/DVT/PVT power on, debug, and follow thru with mass production issues  \n- Performing hands on measurements on various IO modules in functional, signal quality and timing areas of USB*and/or SATA and//or PCI-E and/or Video and/or Audio and/or Voltage Regulators and/or Clocks distribution and others  \n- Interpreting and transfers industry Standards, Design Specifications, Compliance Test Specifications to test execution plan as test references  \n- Communicating with multiple Geo hardware board design and validation teams on sighting debug and status update  \n- Executing and driving EV test plans and provide progress report and result indicators in a timely manner  \n- Providing technical support on deployed development platforms and reference designs including schematic/layout reviews and feedback PDE Eng. Intel May 2007  –  May 2010  (3 years 1 month) - Responsible for ensuring the testability and manufacturability of integrated circuits from the component feasibility stage through production ramp  \n- Design, development and validate testability circuits as well as evaluate, develop and debug complex test methods  \n- Responsible for the development and debug of complex software programs to convert design validation vectors and drive complex test equipment  \n- Develop and debug test patterns for component debug, validation and production test  \n- Design and debug validation and production test hardware solutions, and handle integrated circuit debug, validation and redesign to guarantee component margin to specification  \n- Analyze component specifications versus performance to ensure optimal match of component requirements with production equipment capability with specific emphasis on yield analysis and bin split capability  \n- Analyze early customer returns with emphasis on test hole closure activities  \n- Responsible for the optimization of component production relative to both quality and cost constraints  \n- Plan and schedule daily tasks, develop solutions to problems utilizing formal education and judgment based on standard practices HW Eng / Logic designer Radcom Ltd. May 2006  –  June 2007  (1 year 2 months) HW Eng Unitronics 2004  –  2006  (2 years) PDE SW/HW team lead Intel Corporation August 2013  – Present (2 years 1 month) Israel Team Lead role is overseeing and providing leadership to senior and junior level Test Development/Product Engineers in a new product development environment. Responsible for the future and current products SW & HW platforms development. engaged in all HW development aspect from the PDE perspective. leading the SW development efforts for the new platforms and products. \non top of that involved in system level validation development as a complimentary test suite to the ATE one in order to guaranty the outgoing number of defects. PDE SW/HW team lead Intel Corporation August 2013  – Present (2 years 1 month) Israel Team Lead role is overseeing and providing leadership to senior and junior level Test Development/Product Engineers in a new product development environment. Responsible for the future and current products SW & HW platforms development. engaged in all HW development aspect from the PDE perspective. leading the SW development efforts for the new platforms and products. \non top of that involved in system level validation development as a complimentary test suite to the ATE one in order to guaranty the outgoing number of defects. SOC PDE Team Lead Intel Corporation July 2012  – Present (3 years 2 months) Austin, Texas Area Team Lead role is overseeing and providing leadership to senior and junior level Test Development/Product Engineers in a new product development environment.  Responsible for the technical performance and performance to schedule of the Test Development/Product Engineering team.  The team is involved in the development of final test programs for evaluation, qualification, characterization and production testing .  Test Development\\Product Engineer is responsible for procuring production hardware; such as ATE test PCBs and handler contact kits, as well as device bench characterization, product manufacturability tasks, and the Qualification of new devices. The Team Lead is also required to develop ATE test solutions and perform product engineering tasks for new products in addition to the team lead role SOC PDE Team Lead Intel Corporation July 2012  – Present (3 years 2 months) Austin, Texas Area Team Lead role is overseeing and providing leadership to senior and junior level Test Development/Product Engineers in a new product development environment.  Responsible for the technical performance and performance to schedule of the Test Development/Product Engineering team.  The team is involved in the development of final test programs for evaluation, qualification, characterization and production testing .  Test Development\\Product Engineer is responsible for procuring production hardware; such as ATE test PCBs and handler contact kits, as well as device bench characterization, product manufacturability tasks, and the Qualification of new devices. The Team Lead is also required to develop ATE test solutions and perform product engineering tasks for new products in addition to the team lead role Senior HSIO PDE/EV Eng. Intel May 2010  –  June 2012  (2 years 2 months) All as in PDE position and: \nResponsible for Electrical Validation on multiple SKUs of silicon, hardware boards and running debug software and/firmware across variations of process, voltage, temperature corners  \n- Able to proactively anticipate debug, validation needs and interact with ODM on test plan review, test result review, and travel to ODM site for EVT/DVT/PVT power on, debug, and follow thru with mass production issues  \n- Performing hands on measurements on various IO modules in functional, signal quality and timing areas of USB*and/or SATA and//or PCI-E and/or Video and/or Audio and/or Voltage Regulators and/or Clocks distribution and others  \n- Interpreting and transfers industry Standards, Design Specifications, Compliance Test Specifications to test execution plan as test references  \n- Communicating with multiple Geo hardware board design and validation teams on sighting debug and status update  \n- Executing and driving EV test plans and provide progress report and result indicators in a timely manner  \n- Providing technical support on deployed development platforms and reference designs including schematic/layout reviews and feedback Senior HSIO PDE/EV Eng. Intel May 2010  –  June 2012  (2 years 2 months) All as in PDE position and: \nResponsible for Electrical Validation on multiple SKUs of silicon, hardware boards and running debug software and/firmware across variations of process, voltage, temperature corners  \n- Able to proactively anticipate debug, validation needs and interact with ODM on test plan review, test result review, and travel to ODM site for EVT/DVT/PVT power on, debug, and follow thru with mass production issues  \n- Performing hands on measurements on various IO modules in functional, signal quality and timing areas of USB*and/or SATA and//or PCI-E and/or Video and/or Audio and/or Voltage Regulators and/or Clocks distribution and others  \n- Interpreting and transfers industry Standards, Design Specifications, Compliance Test Specifications to test execution plan as test references  \n- Communicating with multiple Geo hardware board design and validation teams on sighting debug and status update  \n- Executing and driving EV test plans and provide progress report and result indicators in a timely manner  \n- Providing technical support on deployed development platforms and reference designs including schematic/layout reviews and feedback PDE Eng. Intel May 2007  –  May 2010  (3 years 1 month) - Responsible for ensuring the testability and manufacturability of integrated circuits from the component feasibility stage through production ramp  \n- Design, development and validate testability circuits as well as evaluate, develop and debug complex test methods  \n- Responsible for the development and debug of complex software programs to convert design validation vectors and drive complex test equipment  \n- Develop and debug test patterns for component debug, validation and production test  \n- Design and debug validation and production test hardware solutions, and handle integrated circuit debug, validation and redesign to guarantee component margin to specification  \n- Analyze component specifications versus performance to ensure optimal match of component requirements with production equipment capability with specific emphasis on yield analysis and bin split capability  \n- Analyze early customer returns with emphasis on test hole closure activities  \n- Responsible for the optimization of component production relative to both quality and cost constraints  \n- Plan and schedule daily tasks, develop solutions to problems utilizing formal education and judgment based on standard practices PDE Eng. Intel May 2007  –  May 2010  (3 years 1 month) - Responsible for ensuring the testability and manufacturability of integrated circuits from the component feasibility stage through production ramp  \n- Design, development and validate testability circuits as well as evaluate, develop and debug complex test methods  \n- Responsible for the development and debug of complex software programs to convert design validation vectors and drive complex test equipment  \n- Develop and debug test patterns for component debug, validation and production test  \n- Design and debug validation and production test hardware solutions, and handle integrated circuit debug, validation and redesign to guarantee component margin to specification  \n- Analyze component specifications versus performance to ensure optimal match of component requirements with production equipment capability with specific emphasis on yield analysis and bin split capability  \n- Analyze early customer returns with emphasis on test hole closure activities  \n- Responsible for the optimization of component production relative to both quality and cost constraints  \n- Plan and schedule daily tasks, develop solutions to problems utilizing formal education and judgment based on standard practices HW Eng / Logic designer Radcom Ltd. May 2006  –  June 2007  (1 year 2 months) HW Eng / Logic designer Radcom Ltd. May 2006  –  June 2007  (1 year 2 months) HW Eng Unitronics 2004  –  2006  (2 years) HW Eng Unitronics 2004  –  2006  (2 years) Skills Debugging PCB design Testing IC Hardware PCIe Semiconductors Embedded Systems ASIC SoC Verilog VLSI Test Planning FPGA RTL design Processors Embedded Software SystemVerilog DFT Hardware Architecture TCL Logic Design RTL coding VHDL Signal Integrity Perl Test Engineering Product Engineering Mixed Signal Microprocessors See 15+     See less Skills  Debugging PCB design Testing IC Hardware PCIe Semiconductors Embedded Systems ASIC SoC Verilog VLSI Test Planning FPGA RTL design Processors Embedded Software SystemVerilog DFT Hardware Architecture TCL Logic Design RTL coding VHDL Signal Integrity Perl Test Engineering Product Engineering Mixed Signal Microprocessors See 15+     See less Debugging PCB design Testing IC Hardware PCIe Semiconductors Embedded Systems ASIC SoC Verilog VLSI Test Planning FPGA RTL design Processors Embedded Software SystemVerilog DFT Hardware Architecture TCL Logic Design RTL coding VHDL Signal Integrity Perl Test Engineering Product Engineering Mixed Signal Microprocessors See 15+     See less Debugging PCB design Testing IC Hardware PCIe Semiconductors Embedded Systems ASIC SoC Verilog VLSI Test Planning FPGA RTL design Processors Embedded Software SystemVerilog DFT Hardware Architecture TCL Logic Design RTL coding VHDL Signal Integrity Perl Test Engineering Product Engineering Mixed Signal Microprocessors See 15+     See less Education Technion-Machon Technologi Le' Israel BSc.EE 2000  – 2004 Technion-Machon Technologi Le' Israel BSc.EE 2000  – 2004 Technion-Machon Technologi Le' Israel BSc.EE 2000  – 2004 Technion-Machon Technologi Le' Israel BSc.EE 2000  – 2004 ", "Experience MNC Customer Sales Center Team Lead Intel Corporation April 2013  – Present (2 years 5 months) Berlin Area, Germany Dell EMEA Business Manager Intel GmbH November 2008  –  March 2013  (4 years 5 months)  Account Management Dell EMEA for the SMB segment \n Creation and implementation of innovative and demand creation multimillion dollar comarketing \nprograms for 13 countries for which I carry full budgetary responsibility \n Strategic business development of the region for mature and growth markets \n Main focus is driving sustainable growth of Intel's sales out and Market share through \nmarketing activities and training \n Management of the training team (6 people), which are based in several Dell call centre’s \n communicating on all management levels \n Managing the relationship with the INTEL virtual country team regarding my segment, \ntraining budget and activities Channel Account Manager Intel GmbH September 2005  –  October 2008  (3 years 2 months)  Account Management of key channel customers in the East German area \n Responsible for all sales and marketing development activities with Intel's channel \ncustomer in the covered area \n Main focus is driving sales of Intel's branded products to the top 15 channel customers \nand driving the successful implementation of channel programs and initiatives \n The product portfolio covers the full breadth of the Regional Channel Organization \nproduct range, with focus on CPUs, Servers, Motherboards and NICs \n Regular tasks include all aspects of account management for the identified top \ncustomers, in particular communication of Intel's strategies and roadmaps, driving \nprojects with the customers to closure and market development activities \n Other key tasks are training of the broad customer base at Intel Customer Conference \n(ICC) and other events as well as support of demand creation activities like trade show \nsupport, distributor trainings or other customer events \n Managing virtual teams for special events including CeBIT, Intel Channel Conference and \nmany partner events for which I received widespread recognition from both my customers \nand Intel management. Channel Account Manager Oracle GmbH November 2001  –  August 2005  (3 years 10 months)  Overall control of Oracle partner business (system integrators and alliances) with total \nlicense target of € 4 million \n Strategic management of 3 Oracle partners (e.g. PC-Ware AG) and positioning of \nsuitable software solutions \n Coordination of all partner marketing events and activities in relation to Oracle \n Involvement in the complete sales-cycle of deals from demand generation to deal closure \n Responsible for drafting and carrying out of partner business plans \n Analysis of market trends and development and of partner business \n Customer and partner presentation: product, solutions and licensing \n Assessment of partner potential and current projects MNC Customer Sales Center Team Lead Intel Corporation April 2013  – Present (2 years 5 months) Berlin Area, Germany MNC Customer Sales Center Team Lead Intel Corporation April 2013  – Present (2 years 5 months) Berlin Area, Germany Dell EMEA Business Manager Intel GmbH November 2008  –  March 2013  (4 years 5 months)  Account Management Dell EMEA for the SMB segment \n Creation and implementation of innovative and demand creation multimillion dollar comarketing \nprograms for 13 countries for which I carry full budgetary responsibility \n Strategic business development of the region for mature and growth markets \n Main focus is driving sustainable growth of Intel's sales out and Market share through \nmarketing activities and training \n Management of the training team (6 people), which are based in several Dell call centre’s \n communicating on all management levels \n Managing the relationship with the INTEL virtual country team regarding my segment, \ntraining budget and activities Dell EMEA Business Manager Intel GmbH November 2008  –  March 2013  (4 years 5 months)  Account Management Dell EMEA for the SMB segment \n Creation and implementation of innovative and demand creation multimillion dollar comarketing \nprograms for 13 countries for which I carry full budgetary responsibility \n Strategic business development of the region for mature and growth markets \n Main focus is driving sustainable growth of Intel's sales out and Market share through \nmarketing activities and training \n Management of the training team (6 people), which are based in several Dell call centre’s \n communicating on all management levels \n Managing the relationship with the INTEL virtual country team regarding my segment, \ntraining budget and activities Channel Account Manager Intel GmbH September 2005  –  October 2008  (3 years 2 months)  Account Management of key channel customers in the East German area \n Responsible for all sales and marketing development activities with Intel's channel \ncustomer in the covered area \n Main focus is driving sales of Intel's branded products to the top 15 channel customers \nand driving the successful implementation of channel programs and initiatives \n The product portfolio covers the full breadth of the Regional Channel Organization \nproduct range, with focus on CPUs, Servers, Motherboards and NICs \n Regular tasks include all aspects of account management for the identified top \ncustomers, in particular communication of Intel's strategies and roadmaps, driving \nprojects with the customers to closure and market development activities \n Other key tasks are training of the broad customer base at Intel Customer Conference \n(ICC) and other events as well as support of demand creation activities like trade show \nsupport, distributor trainings or other customer events \n Managing virtual teams for special events including CeBIT, Intel Channel Conference and \nmany partner events for which I received widespread recognition from both my customers \nand Intel management. Channel Account Manager Intel GmbH September 2005  –  October 2008  (3 years 2 months)  Account Management of key channel customers in the East German area \n Responsible for all sales and marketing development activities with Intel's channel \ncustomer in the covered area \n Main focus is driving sales of Intel's branded products to the top 15 channel customers \nand driving the successful implementation of channel programs and initiatives \n The product portfolio covers the full breadth of the Regional Channel Organization \nproduct range, with focus on CPUs, Servers, Motherboards and NICs \n Regular tasks include all aspects of account management for the identified top \ncustomers, in particular communication of Intel's strategies and roadmaps, driving \nprojects with the customers to closure and market development activities \n Other key tasks are training of the broad customer base at Intel Customer Conference \n(ICC) and other events as well as support of demand creation activities like trade show \nsupport, distributor trainings or other customer events \n Managing virtual teams for special events including CeBIT, Intel Channel Conference and \nmany partner events for which I received widespread recognition from both my customers \nand Intel management. Channel Account Manager Oracle GmbH November 2001  –  August 2005  (3 years 10 months)  Overall control of Oracle partner business (system integrators and alliances) with total \nlicense target of € 4 million \n Strategic management of 3 Oracle partners (e.g. PC-Ware AG) and positioning of \nsuitable software solutions \n Coordination of all partner marketing events and activities in relation to Oracle \n Involvement in the complete sales-cycle of deals from demand generation to deal closure \n Responsible for drafting and carrying out of partner business plans \n Analysis of market trends and development and of partner business \n Customer and partner presentation: product, solutions and licensing \n Assessment of partner potential and current projects Channel Account Manager Oracle GmbH November 2001  –  August 2005  (3 years 10 months)  Overall control of Oracle partner business (system integrators and alliances) with total \nlicense target of € 4 million \n Strategic management of 3 Oracle partners (e.g. PC-Ware AG) and positioning of \nsuitable software solutions \n Coordination of all partner marketing events and activities in relation to Oracle \n Involvement in the complete sales-cycle of deals from demand generation to deal closure \n Responsible for drafting and carrying out of partner business plans \n Analysis of market trends and development and of partner business \n Customer and partner presentation: product, solutions and licensing \n Assessment of partner potential and current projects Skills Channel Business Development Business Alliances Intel Demand Generation Account Management Selling Skills  Channel Business Development Business Alliances Intel Demand Generation Account Management Selling Channel Business Development Business Alliances Intel Demand Generation Account Management Selling Channel Business Development Business Alliances Intel Demand Generation Account Management Selling Education Technical University of Berlin 1994  – 2000 Technical University of Berlin 1994  – 2000 Technical University of Berlin 1994  – 2000 Technical University of Berlin 1994  – 2000 "]}