{"position": "Technical Writer", "company": "Intel Corporation", "profiles": ["Summary Self-managing technical writer with engineering background. Experienced with both end-user and engineering documents, as well as editing, desktop publishing, and graphics applications. Highly organized with proven skills in writing / editing, leadership, problem solving, and team building. Summary Self-managing technical writer with engineering background. Experienced with both end-user and engineering documents, as well as editing, desktop publishing, and graphics applications. Highly organized with proven skills in writing / editing, leadership, problem solving, and team building. Self-managing technical writer with engineering background. Experienced with both end-user and engineering documents, as well as editing, desktop publishing, and graphics applications. Highly organized with proven skills in writing / editing, leadership, problem solving, and team building. Self-managing technical writer with engineering background. Experienced with both end-user and engineering documents, as well as editing, desktop publishing, and graphics applications. Highly organized with proven skills in writing / editing, leadership, problem solving, and team building. Experience Technical Writer Intel Corporation May 2008  – Present (7 years 4 months) Currently working on software developer's manuals. Responsible for new product / feature integration, researching issues and implementing corrections, publishing and posting as well as managing HSD database for document requests. Technical Writer Intel Corporation October 2003  –  May 2008  (4 years 8 months) Responsible for the creation of end-user / integrator installation and user guides for server boards and systems, including full-color graphical quick start installation guides, and peel and stick labels. Create illustrations or work with illustrator. Edit engineering documents for content consistency, grammar, legal issues, and to make them customer-ready. Run weekly meetings to determine project priorities and schedules. Mentor junior team member in all aspects of technical writing. Technical Marketing Engineer Intel Corporation October 2000  –  October 2003  (3 years 1 month) Responsible for the capture, tracking and closure of all technical marketing issues including creation, editing, & posting all technical documentation to support.intel.com, enabling the White Box channel customer base as well as creation & delivery of product training. Signal Integrity Engineer Intel Corporation October 1999  –  October 2000  (1 year 1 month) Responsible for two system Front Side Bus designs using the latest Intel Processors (Foster), completed layout guidelines, i/o buffer model cleanup, memory simulations, processor simulations, post-layout simulations for entire boards as well as analysis of nets exhibiting SI violations, and topology file work to support auto routing for CAD layout team. Technical Marketing Engineer Intel Corporation May 1997  –  October 1999  (2 years 6 months) Responsible for creating, editing and posting customer product collateral, resolution of customer issues/requests, resolving board/system failures to root cause and then driving root cause back into product & process. Direct customer contact and support including communication of technical product information, Monthly Conversion Summaries, Technical Advisories, and Technical Product Specifications, as well as reviewing and posting test reports, qualification lists, BIOS releases, software utilities, etc. on web site and maintaining and updating the web site directories. Technical Writer Intel Corporation May 2008  – Present (7 years 4 months) Currently working on software developer's manuals. Responsible for new product / feature integration, researching issues and implementing corrections, publishing and posting as well as managing HSD database for document requests. Technical Writer Intel Corporation May 2008  – Present (7 years 4 months) Currently working on software developer's manuals. Responsible for new product / feature integration, researching issues and implementing corrections, publishing and posting as well as managing HSD database for document requests. Technical Writer Intel Corporation October 2003  –  May 2008  (4 years 8 months) Responsible for the creation of end-user / integrator installation and user guides for server boards and systems, including full-color graphical quick start installation guides, and peel and stick labels. Create illustrations or work with illustrator. Edit engineering documents for content consistency, grammar, legal issues, and to make them customer-ready. Run weekly meetings to determine project priorities and schedules. Mentor junior team member in all aspects of technical writing. Technical Writer Intel Corporation October 2003  –  May 2008  (4 years 8 months) Responsible for the creation of end-user / integrator installation and user guides for server boards and systems, including full-color graphical quick start installation guides, and peel and stick labels. Create illustrations or work with illustrator. Edit engineering documents for content consistency, grammar, legal issues, and to make them customer-ready. Run weekly meetings to determine project priorities and schedules. Mentor junior team member in all aspects of technical writing. Technical Marketing Engineer Intel Corporation October 2000  –  October 2003  (3 years 1 month) Responsible for the capture, tracking and closure of all technical marketing issues including creation, editing, & posting all technical documentation to support.intel.com, enabling the White Box channel customer base as well as creation & delivery of product training. Technical Marketing Engineer Intel Corporation October 2000  –  October 2003  (3 years 1 month) Responsible for the capture, tracking and closure of all technical marketing issues including creation, editing, & posting all technical documentation to support.intel.com, enabling the White Box channel customer base as well as creation & delivery of product training. Signal Integrity Engineer Intel Corporation October 1999  –  October 2000  (1 year 1 month) Responsible for two system Front Side Bus designs using the latest Intel Processors (Foster), completed layout guidelines, i/o buffer model cleanup, memory simulations, processor simulations, post-layout simulations for entire boards as well as analysis of nets exhibiting SI violations, and topology file work to support auto routing for CAD layout team. Signal Integrity Engineer Intel Corporation October 1999  –  October 2000  (1 year 1 month) Responsible for two system Front Side Bus designs using the latest Intel Processors (Foster), completed layout guidelines, i/o buffer model cleanup, memory simulations, processor simulations, post-layout simulations for entire boards as well as analysis of nets exhibiting SI violations, and topology file work to support auto routing for CAD layout team. Technical Marketing Engineer Intel Corporation May 1997  –  October 1999  (2 years 6 months) Responsible for creating, editing and posting customer product collateral, resolution of customer issues/requests, resolving board/system failures to root cause and then driving root cause back into product & process. Direct customer contact and support including communication of technical product information, Monthly Conversion Summaries, Technical Advisories, and Technical Product Specifications, as well as reviewing and posting test reports, qualification lists, BIOS releases, software utilities, etc. on web site and maintaining and updating the web site directories. Technical Marketing Engineer Intel Corporation May 1997  –  October 1999  (2 years 6 months) Responsible for creating, editing and posting customer product collateral, resolution of customer issues/requests, resolving board/system failures to root cause and then driving root cause back into product & process. Direct customer contact and support including communication of technical product information, Monthly Conversion Summaries, Technical Advisories, and Technical Product Specifications, as well as reviewing and posting test reports, qualification lists, BIOS releases, software utilities, etc. on web site and maintaining and updating the web site directories. Skills Technical Writing Semiconductors Product Management Processors Product Development Data Center Software Documentation Intel FrameMaker Technical Documentation Servers Technical Marketing Technical Communication Semiconductor Industry Integration Skills  Technical Writing Semiconductors Product Management Processors Product Development Data Center Software Documentation Intel FrameMaker Technical Documentation Servers Technical Marketing Technical Communication Semiconductor Industry Integration Technical Writing Semiconductors Product Management Processors Product Development Data Center Software Documentation Intel FrameMaker Technical Documentation Servers Technical Marketing Technical Communication Semiconductor Industry Integration Technical Writing Semiconductors Product Management Processors Product Development Data Center Software Documentation Intel FrameMaker Technical Documentation Servers Technical Marketing Technical Communication Semiconductor Industry Integration Education Purdue University BSEE 1993  – 1997 Purdue University BSEE 1993  – 1997 Purdue University BSEE 1993  – 1997 Purdue University BSEE 1993  – 1997 ", "Experience Senior Technical Writer Intel Corporation (formerly LSI) February 2009  – Present (6 years 7 months) * Write and deliver quality documentation for integrated development environment that configures network processors and related software that programs the processors \n* Create DITA XML topics, design topic structures, and implement documents through maps (DITA maps, book maps) \n* Participate as lead writer in work planning and tool development \n* Train new team members and contractors in DITA and content management practices \n* Customize and format developer level documentation (API guides, design specifications) Senior Information Developer (Tech. Writer) BMC Software 1998  –  2008  (10 years) Related Experience and Work Performed Previous Companies 1983  –  1998  (15 years) Multiple Senior Technical Writer Intel Corporation (formerly LSI) February 2009  – Present (6 years 7 months) * Write and deliver quality documentation for integrated development environment that configures network processors and related software that programs the processors \n* Create DITA XML topics, design topic structures, and implement documents through maps (DITA maps, book maps) \n* Participate as lead writer in work planning and tool development \n* Train new team members and contractors in DITA and content management practices \n* Customize and format developer level documentation (API guides, design specifications) Senior Technical Writer Intel Corporation (formerly LSI) February 2009  – Present (6 years 7 months) * Write and deliver quality documentation for integrated development environment that configures network processors and related software that programs the processors \n* Create DITA XML topics, design topic structures, and implement documents through maps (DITA maps, book maps) \n* Participate as lead writer in work planning and tool development \n* Train new team members and contractors in DITA and content management practices \n* Customize and format developer level documentation (API guides, design specifications) Senior Information Developer (Tech. Writer) BMC Software 1998  –  2008  (10 years) Senior Information Developer (Tech. Writer) BMC Software 1998  –  2008  (10 years) Related Experience and Work Performed Previous Companies 1983  –  1998  (15 years) Multiple Related Experience and Work Performed Previous Companies 1983  –  1998  (15 years) Multiple Languages Spanish Spanish Spanish Skills White Papers FrameMaker DITA Online Help RoboHelp XMetal Technical Communication Release Notes Technical Documentation Manuals Single Sourcing Technical Writing Adobe Acrobat Content Development SnagIt DITA XML Structured Authoring Content Management Guides Information Design Software Documentation Visio Information Architecture XML Reference Manuals Technical Editing Information Development Online Help Development MadCap Flare Editing Agile Methodologies See 16+     See less Skills  White Papers FrameMaker DITA Online Help RoboHelp XMetal Technical Communication Release Notes Technical Documentation Manuals Single Sourcing Technical Writing Adobe Acrobat Content Development SnagIt DITA XML Structured Authoring Content Management Guides Information Design Software Documentation Visio Information Architecture XML Reference Manuals Technical Editing Information Development Online Help Development MadCap Flare Editing Agile Methodologies See 16+     See less White Papers FrameMaker DITA Online Help RoboHelp XMetal Technical Communication Release Notes Technical Documentation Manuals Single Sourcing Technical Writing Adobe Acrobat Content Development SnagIt DITA XML Structured Authoring Content Management Guides Information Design Software Documentation Visio Information Architecture XML Reference Manuals Technical Editing Information Development Online Help Development MadCap Flare Editing Agile Methodologies See 16+     See less White Papers FrameMaker DITA Online Help RoboHelp XMetal Technical Communication Release Notes Technical Documentation Manuals Single Sourcing Technical Writing Adobe Acrobat Content Development SnagIt DITA XML Structured Authoring Content Management Guides Information Design Software Documentation Visio Information Architecture XML Reference Manuals Technical Editing Information Development Online Help Development MadCap Flare Editing Agile Methodologies See 16+     See less Education Northwestern University B.S. 1973  – 1977 Northwestern University B.S. 1973  – 1977 Northwestern University B.S. 1973  – 1977 Northwestern University B.S. 1973  – 1977 Honors & Awards Additional Honors & Awards -- Society for Technical Communication (STC), International Competition, Award of Merit, 2005  \n-- Austin Chapter, STC, Distinguished Technical Communication award (Best of Show), 2005 Additional Honors & Awards -- Society for Technical Communication (STC), International Competition, Award of Merit, 2005  \n-- Austin Chapter, STC, Distinguished Technical Communication award (Best of Show), 2005 Additional Honors & Awards -- Society for Technical Communication (STC), International Competition, Award of Merit, 2005  \n-- Austin Chapter, STC, Distinguished Technical Communication award (Best of Show), 2005 Additional Honors & Awards -- Society for Technical Communication (STC), International Competition, Award of Merit, 2005  \n-- Austin Chapter, STC, Distinguished Technical Communication award (Best of Show), 2005 ", "Summary Experienced technical writer and editor with excellent interpersonal and project management skills. Ability to drive a project from start (information gathering) to finish (publication/launch/etc) across a range of authoring tools and delivery methods. Skilled at meeting challenging deadlines and working in chaotic environments.  \n \nMy knowledge and skills are derived from a diverse work experience: government, small business, and large corporation. I thrive on learning in any environment! Summary Experienced technical writer and editor with excellent interpersonal and project management skills. Ability to drive a project from start (information gathering) to finish (publication/launch/etc) across a range of authoring tools and delivery methods. Skilled at meeting challenging deadlines and working in chaotic environments.  \n \nMy knowledge and skills are derived from a diverse work experience: government, small business, and large corporation. I thrive on learning in any environment! Experienced technical writer and editor with excellent interpersonal and project management skills. Ability to drive a project from start (information gathering) to finish (publication/launch/etc) across a range of authoring tools and delivery methods. Skilled at meeting challenging deadlines and working in chaotic environments.  \n \nMy knowledge and skills are derived from a diverse work experience: government, small business, and large corporation. I thrive on learning in any environment! Experienced technical writer and editor with excellent interpersonal and project management skills. Ability to drive a project from start (information gathering) to finish (publication/launch/etc) across a range of authoring tools and delivery methods. Skilled at meeting challenging deadlines and working in chaotic environments.  \n \nMy knowledge and skills are derived from a diverse work experience: government, small business, and large corporation. I thrive on learning in any environment! Experience Project Lead Technical Writer Intel Corporation January 2015  – Present (8 months) Portland, Oregon Area Project Lead Technical Writer for the Datacenter Group at Intel Corporation. Responsible for identifying and implementing process improvements, coordinating training, and forecasting and managing workload for a team of four technical writers.  Technical Writer Intel Corporation (contractor: PTI Global) October 2013  –  January 2015  (1 year 4 months) Technical Writer with the Enterprise Content Solutions (ECS) team and the Open Source Technology Center (OTC). Worked on projects across a range of Intel business units including documentation for a new Ultrabook reference design system and technical editing for software, hardware, Wi-Fi and wireless display products. Owner and Chocolatier Portland Truffle LLC 2006  –  2012  (6 years) Established and ran a small business focused on creating quality custom chocolates and confections for customers ranging from individuals to large upscale hotels and national corporations. Responsible for creation and editing of all web content, marketing materials and printed collaterals. City Planner City of Portland December 1995  –  July 2008  (12 years 8 months) Reviewed development plans for compliance with City Zoning Codes, including Land Use Reviews (conditional uses, variances, etc.) and permit plan review and approval. Worked directly with developers, contractors, homeowners and citizens through various stages of the review and construction process. Internal responsibilities included training new employees, creation and maintenance of scheduling and other organization systems, and process management review and systems overhaul. Project Lead Technical Writer Intel Corporation January 2015  – Present (8 months) Portland, Oregon Area Project Lead Technical Writer for the Datacenter Group at Intel Corporation. Responsible for identifying and implementing process improvements, coordinating training, and forecasting and managing workload for a team of four technical writers.  Project Lead Technical Writer Intel Corporation January 2015  – Present (8 months) Portland, Oregon Area Project Lead Technical Writer for the Datacenter Group at Intel Corporation. Responsible for identifying and implementing process improvements, coordinating training, and forecasting and managing workload for a team of four technical writers.  Technical Writer Intel Corporation (contractor: PTI Global) October 2013  –  January 2015  (1 year 4 months) Technical Writer with the Enterprise Content Solutions (ECS) team and the Open Source Technology Center (OTC). Worked on projects across a range of Intel business units including documentation for a new Ultrabook reference design system and technical editing for software, hardware, Wi-Fi and wireless display products. Technical Writer Intel Corporation (contractor: PTI Global) October 2013  –  January 2015  (1 year 4 months) Technical Writer with the Enterprise Content Solutions (ECS) team and the Open Source Technology Center (OTC). Worked on projects across a range of Intel business units including documentation for a new Ultrabook reference design system and technical editing for software, hardware, Wi-Fi and wireless display products. Owner and Chocolatier Portland Truffle LLC 2006  –  2012  (6 years) Established and ran a small business focused on creating quality custom chocolates and confections for customers ranging from individuals to large upscale hotels and national corporations. Responsible for creation and editing of all web content, marketing materials and printed collaterals. Owner and Chocolatier Portland Truffle LLC 2006  –  2012  (6 years) Established and ran a small business focused on creating quality custom chocolates and confections for customers ranging from individuals to large upscale hotels and national corporations. Responsible for creation and editing of all web content, marketing materials and printed collaterals. City Planner City of Portland December 1995  –  July 2008  (12 years 8 months) Reviewed development plans for compliance with City Zoning Codes, including Land Use Reviews (conditional uses, variances, etc.) and permit plan review and approval. Worked directly with developers, contractors, homeowners and citizens through various stages of the review and construction process. Internal responsibilities included training new employees, creation and maintenance of scheduling and other organization systems, and process management review and systems overhaul. City Planner City of Portland December 1995  –  July 2008  (12 years 8 months) Reviewed development plans for compliance with City Zoning Codes, including Land Use Reviews (conditional uses, variances, etc.) and permit plan review and approval. Worked directly with developers, contractors, homeowners and citizens through various stages of the review and construction process. Internal responsibilities included training new employees, creation and maintenance of scheduling and other organization systems, and process management review and systems overhaul. Skills Technical Writing Copywriting Editing Professional Writing Project Management Website Updating Systems Analysis Urban Planning Data Management QuickBooks Social Media Marketing Skills  Technical Writing Copywriting Editing Professional Writing Project Management Website Updating Systems Analysis Urban Planning Data Management QuickBooks Social Media Marketing Technical Writing Copywriting Editing Professional Writing Project Management Website Updating Systems Analysis Urban Planning Data Management QuickBooks Social Media Marketing Technical Writing Copywriting Editing Professional Writing Project Management Website Updating Systems Analysis Urban Planning Data Management QuickBooks Social Media Marketing Education Portland State University Bachelor of Science (B.S.),  City/Urban , Community and Regional Planning University of Colorado at Boulder Portland State University Bachelor of Science (B.S.),  City/Urban , Community and Regional Planning Portland State University Bachelor of Science (B.S.),  City/Urban , Community and Regional Planning Portland State University Bachelor of Science (B.S.),  City/Urban , Community and Regional Planning University of Colorado at Boulder University of Colorado at Boulder University of Colorado at Boulder ", "Summary I'm a writer, researcher, and analyst for the technology sector. My writing ranges from deep-dive technical content to marketing materials. On the research and analysis side, I investigate technologies and products to help my business customers make better decisions. Summary I'm a writer, researcher, and analyst for the technology sector. My writing ranges from deep-dive technical content to marketing materials. On the research and analysis side, I investigate technologies and products to help my business customers make better decisions. I'm a writer, researcher, and analyst for the technology sector. My writing ranges from deep-dive technical content to marketing materials. On the research and analysis side, I investigate technologies and products to help my business customers make better decisions. I'm a writer, researcher, and analyst for the technology sector. My writing ranges from deep-dive technical content to marketing materials. On the research and analysis side, I investigate technologies and products to help my business customers make better decisions. Experience Technology Writer and Business Analyst Magleaf Inc (a one-man show) 2002  – Present (13 years) Chicago Area I write about technology, the businesses that create it, and the people who use it, for customers that range from tech giants to start-ups. Current subjects include the Internet of Things, software-defined everything, network-functions virtualization, security, big-data analytics, cloud and mobile computing, parallelism, and competitive intelligence. Technical Writer Intel Corporation 2005  –  2006  (1 year) Portland, Oregon Area (Remote) Wrote white papers, technical briefs, and web content about Intel's compilers, libraries, and other software-development tools. Technical Writer Intel Corporation 2001  –  2002  (1 year) Portland, Oregon Area Designed training curricula and wrote technical documentation for software developers. Edited application notes, white papers, and other technical documents for style and quality. IT Project Manager and Technical Writer California Federal Bank 1996  –  2001  (5 years) Sacramento, California Area Managed and documented major infrastructure projects for data and voice. Co-founded the team that deployed Internet access to the user base and that built the company's first intranet. Research and Grant Writer University of California Center for Neuroscience 1994  –  1996  (2 years) Davis, CA Wrote, co-wrote, and ghost-wrote academic papers, grants, books, and encyclopedia chapters. Equities Data Analyst Morningstar 1992  –  1994  (2 years) Chicago, IL Founded US Equities division, managed team of writers and data analysts. Technology Writer and Business Analyst Magleaf Inc (a one-man show) 2002  – Present (13 years) Chicago Area I write about technology, the businesses that create it, and the people who use it, for customers that range from tech giants to start-ups. Current subjects include the Internet of Things, software-defined everything, network-functions virtualization, security, big-data analytics, cloud and mobile computing, parallelism, and competitive intelligence. Technology Writer and Business Analyst Magleaf Inc (a one-man show) 2002  – Present (13 years) Chicago Area I write about technology, the businesses that create it, and the people who use it, for customers that range from tech giants to start-ups. Current subjects include the Internet of Things, software-defined everything, network-functions virtualization, security, big-data analytics, cloud and mobile computing, parallelism, and competitive intelligence. Technical Writer Intel Corporation 2005  –  2006  (1 year) Portland, Oregon Area (Remote) Wrote white papers, technical briefs, and web content about Intel's compilers, libraries, and other software-development tools. Technical Writer Intel Corporation 2005  –  2006  (1 year) Portland, Oregon Area (Remote) Wrote white papers, technical briefs, and web content about Intel's compilers, libraries, and other software-development tools. Technical Writer Intel Corporation 2001  –  2002  (1 year) Portland, Oregon Area Designed training curricula and wrote technical documentation for software developers. Edited application notes, white papers, and other technical documents for style and quality. Technical Writer Intel Corporation 2001  –  2002  (1 year) Portland, Oregon Area Designed training curricula and wrote technical documentation for software developers. Edited application notes, white papers, and other technical documents for style and quality. IT Project Manager and Technical Writer California Federal Bank 1996  –  2001  (5 years) Sacramento, California Area Managed and documented major infrastructure projects for data and voice. Co-founded the team that deployed Internet access to the user base and that built the company's first intranet. IT Project Manager and Technical Writer California Federal Bank 1996  –  2001  (5 years) Sacramento, California Area Managed and documented major infrastructure projects for data and voice. Co-founded the team that deployed Internet access to the user base and that built the company's first intranet. Research and Grant Writer University of California Center for Neuroscience 1994  –  1996  (2 years) Davis, CA Wrote, co-wrote, and ghost-wrote academic papers, grants, books, and encyclopedia chapters. Research and Grant Writer University of California Center for Neuroscience 1994  –  1996  (2 years) Davis, CA Wrote, co-wrote, and ghost-wrote academic papers, grants, books, and encyclopedia chapters. Equities Data Analyst Morningstar 1992  –  1994  (2 years) Chicago, IL Founded US Equities division, managed team of writers and data analysts. Equities Data Analyst Morningstar 1992  –  1994  (2 years) Chicago, IL Founded US Equities division, managed team of writers and data analysts. Languages   Skills Web Content Technical Writing Editing Technical Documentation Manuals Web Design Competitive Intelligence Competitive Analysis Skills  Web Content Technical Writing Editing Technical Documentation Manuals Web Design Competitive Intelligence Competitive Analysis Web Content Technical Writing Editing Technical Documentation Manuals Web Design Competitive Intelligence Competitive Analysis Web Content Technical Writing Editing Technical Documentation Manuals Web Design Competitive Intelligence Competitive Analysis Education University of Illinois at Urbana-Champaign BA with High Distinction,  English Seven-year BA, starting in physics, passing through filmmaking and sculpture, to English. University of Illinois at Urbana-Champaign BA with High Distinction,  English Seven-year BA, starting in physics, passing through filmmaking and sculpture, to English. University of Illinois at Urbana-Champaign BA with High Distinction,  English Seven-year BA, starting in physics, passing through filmmaking and sculpture, to English. University of Illinois at Urbana-Champaign BA with High Distinction,  English Seven-year BA, starting in physics, passing through filmmaking and sculpture, to English. Honors & Awards ", "Skills Editing Web Content Blogging PowerPoint DITA Technical Writing Content Management Copywriting Social Media Research Wordpress Copy Editing Adobe Acrobat Skills  Editing Web Content Blogging PowerPoint DITA Technical Writing Content Management Copywriting Social Media Research Wordpress Copy Editing Adobe Acrobat Editing Web Content Blogging PowerPoint DITA Technical Writing Content Management Copywriting Social Media Research Wordpress Copy Editing Adobe Acrobat Editing Web Content Blogging PowerPoint DITA Technical Writing Content Management Copywriting Social Media Research Wordpress Copy Editing Adobe Acrobat ", "Skills FrameMaker Content Management Technical Documentation Technical Writing Technical Communication Semiconductors Program Management Online Help Corporate Communications Cross-functional Team... Product Marketing Strategic Planning Competitive Analysis Process Improvement Software Documentation Management Testing DITA See 3+     See less Skills  FrameMaker Content Management Technical Documentation Technical Writing Technical Communication Semiconductors Program Management Online Help Corporate Communications Cross-functional Team... Product Marketing Strategic Planning Competitive Analysis Process Improvement Software Documentation Management Testing DITA See 3+     See less FrameMaker Content Management Technical Documentation Technical Writing Technical Communication Semiconductors Program Management Online Help Corporate Communications Cross-functional Team... Product Marketing Strategic Planning Competitive Analysis Process Improvement Software Documentation Management Testing DITA See 3+     See less FrameMaker Content Management Technical Documentation Technical Writing Technical Communication Semiconductors Program Management Online Help Corporate Communications Cross-functional Team... Product Marketing Strategic Planning Competitive Analysis Process Improvement Software Documentation Management Testing DITA See 3+     See less ", "Summary Experienced Senior Technical Writer : \n \n\tProven track record of having successfully completed and delivered projects on time, with strong emphasis on quality. \n\tCreated online help, User Manuals, White papers, Database Guides, Installation Guides, Configuration Guides, product brochures, trouble-shooting documentation and Training Guides from scratch. \n\tExperienced in effort estimation and execution of documentation projects for enterprise-wide applications. \n\tActively participated in the creation of functional specification and design documents. \n\tPossess an incisive perspective of technology trends and an understanding of design. Summary Experienced Senior Technical Writer : \n \n\tProven track record of having successfully completed and delivered projects on time, with strong emphasis on quality. \n\tCreated online help, User Manuals, White papers, Database Guides, Installation Guides, Configuration Guides, product brochures, trouble-shooting documentation and Training Guides from scratch. \n\tExperienced in effort estimation and execution of documentation projects for enterprise-wide applications. \n\tActively participated in the creation of functional specification and design documents. \n\tPossess an incisive perspective of technology trends and an understanding of design. Experienced Senior Technical Writer : \n \n\tProven track record of having successfully completed and delivered projects on time, with strong emphasis on quality. \n\tCreated online help, User Manuals, White papers, Database Guides, Installation Guides, Configuration Guides, product brochures, trouble-shooting documentation and Training Guides from scratch. \n\tExperienced in effort estimation and execution of documentation projects for enterprise-wide applications. \n\tActively participated in the creation of functional specification and design documents. \n\tPossess an incisive perspective of technology trends and an understanding of design. Experienced Senior Technical Writer : \n \n\tProven track record of having successfully completed and delivered projects on time, with strong emphasis on quality. \n\tCreated online help, User Manuals, White papers, Database Guides, Installation Guides, Configuration Guides, product brochures, trouble-shooting documentation and Training Guides from scratch. \n\tExperienced in effort estimation and execution of documentation projects for enterprise-wide applications. \n\tActively participated in the creation of functional specification and design documents. \n\tPossess an incisive perspective of technology trends and an understanding of design. Experience Senior Technical Writer Intel Corporation October 2014  – Present (11 months) Technical Writer NetApp October 2012  –  September 2014  (2 years) India Specialist Wipro Technologies October 2010  –  September 2012  (2 years) Sr. Technical Writer Razorsight February 2007  –  August 2007  (7 months) Sr. Technical Writer RMi Technologies India Pvt Ltd/Raza Microelectronics Inc November 2005  –  January 2007  (1 year 3 months) Technical Writer SysArris Software Pvt Ltd/ArisGlobal Software Pvt Ltd December 2002  –  November 2005  (3 years) Technical Writer Technical Writer ArisGlobal 2002  –  2005  (3 years) Senior Technical Writer Intel Corporation October 2014  – Present (11 months) Senior Technical Writer Intel Corporation October 2014  – Present (11 months) Technical Writer NetApp October 2012  –  September 2014  (2 years) India Technical Writer NetApp October 2012  –  September 2014  (2 years) India Specialist Wipro Technologies October 2010  –  September 2012  (2 years) Specialist Wipro Technologies October 2010  –  September 2012  (2 years) Sr. Technical Writer Razorsight February 2007  –  August 2007  (7 months) Sr. Technical Writer Razorsight February 2007  –  August 2007  (7 months) Sr. Technical Writer RMi Technologies India Pvt Ltd/Raza Microelectronics Inc November 2005  –  January 2007  (1 year 3 months) Sr. Technical Writer RMi Technologies India Pvt Ltd/Raza Microelectronics Inc November 2005  –  January 2007  (1 year 3 months) Technical Writer SysArris Software Pvt Ltd/ArisGlobal Software Pvt Ltd December 2002  –  November 2005  (3 years) Technical Writer Technical Writer SysArris Software Pvt Ltd/ArisGlobal Software Pvt Ltd December 2002  –  November 2005  (3 years) Technical Writer Technical Writer ArisGlobal 2002  –  2005  (3 years) Technical Writer ArisGlobal 2002  –  2005  (3 years) Skills Online Help FrameMaker Skills  Online Help FrameMaker Online Help FrameMaker Online Help FrameMaker Education Bangalore University B.Arch,  Architecture 1995  – 2000 Bangalore University B.Arch,  Architecture 1995  – 2000 Bangalore University B.Arch,  Architecture 1995  – 2000 Bangalore University B.Arch,  Architecture 1995  – 2000 ", "Summary Mr. Richardson has extensive experience in the technical writing, course development, and instruction fields. He has been a Technical Publications Manager in the defense industry, and a senior technical writer in the defense, telecommunications and commercial industries. He has extensive leadership abilities with proven track records as a Technical Publications Manager, senior technical writer and course developer with a team of 3 to 7 members, as an instructor with 10 to 80 students, and as a second class petty officer in the US Navy in charge of 5 to 150 shipmates. He has setup, forecasted, and maintained project schedules, and helped develop and implement all phases of documentation and training including Military Specifications and ISO9000 standards. He has setup and scheduled courses for various projects throughout his career and he has had the privilege to help with the interviewing and hiring decisions for additional Technical Writers and Instructors throughout his career. Mr. Richardson is versed in many software applications pertaining to the technical writing and course development arena. \n \nSpecialties:  \nElectronics Technology background,  \nTechnical Communications including: Technical Writer, Course Development, and Instructor.  \nProject Manager. Summary Mr. Richardson has extensive experience in the technical writing, course development, and instruction fields. He has been a Technical Publications Manager in the defense industry, and a senior technical writer in the defense, telecommunications and commercial industries. He has extensive leadership abilities with proven track records as a Technical Publications Manager, senior technical writer and course developer with a team of 3 to 7 members, as an instructor with 10 to 80 students, and as a second class petty officer in the US Navy in charge of 5 to 150 shipmates. He has setup, forecasted, and maintained project schedules, and helped develop and implement all phases of documentation and training including Military Specifications and ISO9000 standards. He has setup and scheduled courses for various projects throughout his career and he has had the privilege to help with the interviewing and hiring decisions for additional Technical Writers and Instructors throughout his career. Mr. Richardson is versed in many software applications pertaining to the technical writing and course development arena. \n \nSpecialties:  \nElectronics Technology background,  \nTechnical Communications including: Technical Writer, Course Development, and Instructor.  \nProject Manager. Mr. Richardson has extensive experience in the technical writing, course development, and instruction fields. He has been a Technical Publications Manager in the defense industry, and a senior technical writer in the defense, telecommunications and commercial industries. He has extensive leadership abilities with proven track records as a Technical Publications Manager, senior technical writer and course developer with a team of 3 to 7 members, as an instructor with 10 to 80 students, and as a second class petty officer in the US Navy in charge of 5 to 150 shipmates. He has setup, forecasted, and maintained project schedules, and helped develop and implement all phases of documentation and training including Military Specifications and ISO9000 standards. He has setup and scheduled courses for various projects throughout his career and he has had the privilege to help with the interviewing and hiring decisions for additional Technical Writers and Instructors throughout his career. Mr. Richardson is versed in many software applications pertaining to the technical writing and course development arena. \n \nSpecialties:  \nElectronics Technology background,  \nTechnical Communications including: Technical Writer, Course Development, and Instructor.  \nProject Manager. Mr. Richardson has extensive experience in the technical writing, course development, and instruction fields. He has been a Technical Publications Manager in the defense industry, and a senior technical writer in the defense, telecommunications and commercial industries. He has extensive leadership abilities with proven track records as a Technical Publications Manager, senior technical writer and course developer with a team of 3 to 7 members, as an instructor with 10 to 80 students, and as a second class petty officer in the US Navy in charge of 5 to 150 shipmates. He has setup, forecasted, and maintained project schedules, and helped develop and implement all phases of documentation and training including Military Specifications and ISO9000 standards. He has setup and scheduled courses for various projects throughout his career and he has had the privilege to help with the interviewing and hiring decisions for additional Technical Writers and Instructors throughout his career. Mr. Richardson is versed in many software applications pertaining to the technical writing and course development arena. \n \nSpecialties:  \nElectronics Technology background,  \nTechnical Communications including: Technical Writer, Course Development, and Instructor.  \nProject Manager. Experience Lead Technical Writer Intel Corporation March 2012  – Present (3 years 6 months) King of Prussia, PA Plan and manage projects for Intel True Scale hardware and software user documentation. \nDevelop and write user documentation, online help and release notes for Intel True Scale hardware and software. Senior Technical Writer QLogic June 2008  –  March 2012  (3 years 10 months) King of Prussia, PA Develop and write user documentation, online help and release notets for InfiniBand hardware and software. Sr. Technical Writer (Contract) TruePosition, Inc. January 2008  –  June 2008  (6 months) Document PM and Writer for LMU Next Gereration Documents. Sr. Technical Writer (Contract) First Energy July 2007  –  January 2008  (7 months) Research and write policies and standards for the network architecture \nDevelop template format and style guide for the policy and standards documents Sr. Technical Writer (Contract) Grove Worldwide February 2007  –  July 2007  (6 months) * Technical Writing activities accomplished while telecommuting from home office and include: \no Research of information pertaining to projects  \no Development and update of Technical Manuals \no Validation of technical documentation Technical Publications Manager SRA International, Inc. October 2005  –  February 2007  (1 year 5 months) Manager, Technical Publications, Tobyhanna Army Depot, responsible for: \no Development of project schedules \no Assignment of projects and activities to four team members \no Interface with other Tobyhanna departments including Training \no Development of Power Point presentations for meetings \no Review documents for technical information and format \n \n* Liaison to Tobyhanna Army Depot Technical Publications Manager \n \n* Activities include: \no Development of processes, procedures and style guides for the Technical Publications team \no Development of template for work package style technical manuals (Mil-Spec 40051) \no Research of information pertaining to projects  \no Development and updating of Technical Manuals \no Validation of technical documentation Technical Writer TruePosition, Inc. August 2003  –  October 2005  (2 years 3 months) * Responsible for scheduling and assigning activities of four team members \n \n* Activities include: \no Development and update of installation and upgrade manuals for EMS, SCOUT, and WLG equipment, and the WLS System \no Development of release notes documentation for releases \no Update standards and styles for documentation \no Update of FrameMaker formats to mach changes in styles for the documentation \no Development of schedules for installation team \no Development of PowerPoint presentations for documentation design meetings \no Research and analysis of needs for resources \no Development of training guide for Tech Pubs group to learn new FrameMaker formats, styles, and uses Senior Technical Writer First Horizon Mortgage 2002  –  2003  (1 year) Development of processes and procedures for IS functions \nDevelopment of IS tasks Computer Based Training for IS employees to come up to speed on the new policies and procedures \nDevelopment of illustrations and screen shots for documentation \nDevelopment of standards and styles for documentation Lead Technical Writer Intel Corporation March 2012  – Present (3 years 6 months) King of Prussia, PA Plan and manage projects for Intel True Scale hardware and software user documentation. \nDevelop and write user documentation, online help and release notes for Intel True Scale hardware and software. Lead Technical Writer Intel Corporation March 2012  – Present (3 years 6 months) King of Prussia, PA Plan and manage projects for Intel True Scale hardware and software user documentation. \nDevelop and write user documentation, online help and release notes for Intel True Scale hardware and software. Senior Technical Writer QLogic June 2008  –  March 2012  (3 years 10 months) King of Prussia, PA Develop and write user documentation, online help and release notets for InfiniBand hardware and software. Senior Technical Writer QLogic June 2008  –  March 2012  (3 years 10 months) King of Prussia, PA Develop and write user documentation, online help and release notets for InfiniBand hardware and software. Sr. Technical Writer (Contract) TruePosition, Inc. January 2008  –  June 2008  (6 months) Document PM and Writer for LMU Next Gereration Documents. Sr. Technical Writer (Contract) TruePosition, Inc. January 2008  –  June 2008  (6 months) Document PM and Writer for LMU Next Gereration Documents. Sr. Technical Writer (Contract) First Energy July 2007  –  January 2008  (7 months) Research and write policies and standards for the network architecture \nDevelop template format and style guide for the policy and standards documents Sr. Technical Writer (Contract) First Energy July 2007  –  January 2008  (7 months) Research and write policies and standards for the network architecture \nDevelop template format and style guide for the policy and standards documents Sr. Technical Writer (Contract) Grove Worldwide February 2007  –  July 2007  (6 months) * Technical Writing activities accomplished while telecommuting from home office and include: \no Research of information pertaining to projects  \no Development and update of Technical Manuals \no Validation of technical documentation Sr. Technical Writer (Contract) Grove Worldwide February 2007  –  July 2007  (6 months) * Technical Writing activities accomplished while telecommuting from home office and include: \no Research of information pertaining to projects  \no Development and update of Technical Manuals \no Validation of technical documentation Technical Publications Manager SRA International, Inc. October 2005  –  February 2007  (1 year 5 months) Manager, Technical Publications, Tobyhanna Army Depot, responsible for: \no Development of project schedules \no Assignment of projects and activities to four team members \no Interface with other Tobyhanna departments including Training \no Development of Power Point presentations for meetings \no Review documents for technical information and format \n \n* Liaison to Tobyhanna Army Depot Technical Publications Manager \n \n* Activities include: \no Development of processes, procedures and style guides for the Technical Publications team \no Development of template for work package style technical manuals (Mil-Spec 40051) \no Research of information pertaining to projects  \no Development and updating of Technical Manuals \no Validation of technical documentation Technical Publications Manager SRA International, Inc. October 2005  –  February 2007  (1 year 5 months) Manager, Technical Publications, Tobyhanna Army Depot, responsible for: \no Development of project schedules \no Assignment of projects and activities to four team members \no Interface with other Tobyhanna departments including Training \no Development of Power Point presentations for meetings \no Review documents for technical information and format \n \n* Liaison to Tobyhanna Army Depot Technical Publications Manager \n \n* Activities include: \no Development of processes, procedures and style guides for the Technical Publications team \no Development of template for work package style technical manuals (Mil-Spec 40051) \no Research of information pertaining to projects  \no Development and updating of Technical Manuals \no Validation of technical documentation Technical Writer TruePosition, Inc. August 2003  –  October 2005  (2 years 3 months) * Responsible for scheduling and assigning activities of four team members \n \n* Activities include: \no Development and update of installation and upgrade manuals for EMS, SCOUT, and WLG equipment, and the WLS System \no Development of release notes documentation for releases \no Update standards and styles for documentation \no Update of FrameMaker formats to mach changes in styles for the documentation \no Development of schedules for installation team \no Development of PowerPoint presentations for documentation design meetings \no Research and analysis of needs for resources \no Development of training guide for Tech Pubs group to learn new FrameMaker formats, styles, and uses Technical Writer TruePosition, Inc. August 2003  –  October 2005  (2 years 3 months) * Responsible for scheduling and assigning activities of four team members \n \n* Activities include: \no Development and update of installation and upgrade manuals for EMS, SCOUT, and WLG equipment, and the WLS System \no Development of release notes documentation for releases \no Update standards and styles for documentation \no Update of FrameMaker formats to mach changes in styles for the documentation \no Development of schedules for installation team \no Development of PowerPoint presentations for documentation design meetings \no Research and analysis of needs for resources \no Development of training guide for Tech Pubs group to learn new FrameMaker formats, styles, and uses Senior Technical Writer First Horizon Mortgage 2002  –  2003  (1 year) Development of processes and procedures for IS functions \nDevelopment of IS tasks Computer Based Training for IS employees to come up to speed on the new policies and procedures \nDevelopment of illustrations and screen shots for documentation \nDevelopment of standards and styles for documentation Senior Technical Writer First Horizon Mortgage 2002  –  2003  (1 year) Development of processes and procedures for IS functions \nDevelopment of IS tasks Computer Based Training for IS employees to come up to speed on the new policies and procedures \nDevelopment of illustrations and screen shots for documentation \nDevelopment of standards and styles for documentation Skills Technical Communication Technical Writing Scheduling Formatting Documentation Document Management Technical Documentation FrameMaker RoboHelp Adobe Acrobat Software Documentation Manuals SnagIt Online Help Release Notes Document Design Telecommunications DITA Single Sourcing Visio Structured Authoring SGML SharePoint HTML Help Guides Online Help Development Information Mapping Content Management Word XML PowerPoint MS Project Writing Information Architecture Reference Manuals Microsoft Office Excel Information Design Photoshop Quality Assurance Desktop Publishing Course Development Research Instructional Design Style Guides Technical Training HTML PDF CMS FrontPage See 35+     See less Skills  Technical Communication Technical Writing Scheduling Formatting Documentation Document Management Technical Documentation FrameMaker RoboHelp Adobe Acrobat Software Documentation Manuals SnagIt Online Help Release Notes Document Design Telecommunications DITA Single Sourcing Visio Structured Authoring SGML SharePoint HTML Help Guides Online Help Development Information Mapping Content Management Word XML PowerPoint MS Project Writing Information Architecture Reference Manuals Microsoft Office Excel Information Design Photoshop Quality Assurance Desktop Publishing Course Development Research Instructional Design Style Guides Technical Training HTML PDF CMS FrontPage See 35+     See less Technical Communication Technical Writing Scheduling Formatting Documentation Document Management Technical Documentation FrameMaker RoboHelp Adobe Acrobat Software Documentation Manuals SnagIt Online Help Release Notes Document Design Telecommunications DITA Single Sourcing Visio Structured Authoring SGML SharePoint HTML Help Guides Online Help Development Information Mapping Content Management Word XML PowerPoint MS Project Writing Information Architecture Reference Manuals Microsoft Office Excel Information Design Photoshop Quality Assurance Desktop Publishing Course Development Research Instructional Design Style Guides Technical Training HTML PDF CMS FrontPage See 35+     See less Technical Communication Technical Writing Scheduling Formatting Documentation Document Management Technical Documentation FrameMaker RoboHelp Adobe Acrobat Software Documentation Manuals SnagIt Online Help Release Notes Document Design Telecommunications DITA Single Sourcing Visio Structured Authoring SGML SharePoint HTML Help Guides Online Help Development Information Mapping Content Management Word XML PowerPoint MS Project Writing Information Architecture Reference Manuals Microsoft Office Excel Information Design Photoshop Quality Assurance Desktop Publishing Course Development Research Instructional Design Style Guides Technical Training HTML PDF CMS FrontPage See 35+     See less Education Almeda University Master of Business Administration (MBA),  Business Administration and Management , General 2014 Almeda University BS,  Electronics Technology 2000  – 2004 Richardson High School Basic 1972  – 1976 Almeda University Master of Business Administration (MBA),  Business Administration and Management , General 2014 Almeda University Master of Business Administration (MBA),  Business Administration and Management , General 2014 Almeda University Master of Business Administration (MBA),  Business Administration and Management , General 2014 Almeda University BS,  Electronics Technology 2000  – 2004 Almeda University BS,  Electronics Technology 2000  – 2004 Almeda University BS,  Electronics Technology 2000  – 2004 Richardson High School Basic 1972  – 1976 Richardson High School Basic 1972  – 1976 Richardson High School Basic 1972  – 1976 ", "Summary Accomplished at definition, development, and launching of new products and services for global markets. Includes Customer Research, Use Case and Requirements Development, Technical Marketing, Marketing Management, Project Management, and Technical Writing. Additional experience in software development, business development, strategic marketing, and technical training. Certified in Localization by Calif. State Univ. and AILIA Lang. Tech. Research Centre, Quebec, Canada. Specialties:Use case and requirements development, business process development, strategic marketing, IT experience, global channel experience, technical marketing, marketing management, customer research. Summary Accomplished at definition, development, and launching of new products and services for global markets. Includes Customer Research, Use Case and Requirements Development, Technical Marketing, Marketing Management, Project Management, and Technical Writing. Additional experience in software development, business development, strategic marketing, and technical training. Certified in Localization by Calif. State Univ. and AILIA Lang. Tech. Research Centre, Quebec, Canada. Specialties:Use case and requirements development, business process development, strategic marketing, IT experience, global channel experience, technical marketing, marketing management, customer research. Accomplished at definition, development, and launching of new products and services for global markets. Includes Customer Research, Use Case and Requirements Development, Technical Marketing, Marketing Management, Project Management, and Technical Writing. Additional experience in software development, business development, strategic marketing, and technical training. Certified in Localization by Calif. State Univ. and AILIA Lang. Tech. Research Centre, Quebec, Canada. Specialties:Use case and requirements development, business process development, strategic marketing, IT experience, global channel experience, technical marketing, marketing management, customer research. Accomplished at definition, development, and launching of new products and services for global markets. Includes Customer Research, Use Case and Requirements Development, Technical Marketing, Marketing Management, Project Management, and Technical Writing. Additional experience in software development, business development, strategic marketing, and technical training. Certified in Localization by Calif. State Univ. and AILIA Lang. Tech. Research Centre, Quebec, Canada. Specialties:Use case and requirements development, business process development, strategic marketing, IT experience, global channel experience, technical marketing, marketing management, customer research. Experience Sr. Technical Writer Intel Corporation January 2014  – Present (1 year 8 months) Hillsboro, OR Supporting new Intel Custom Foundry group. Hardware baby! Sr. Technical Writer Intel Corporation May 2012  –  December 2013  (1 year 8 months) Jones Farm Campus, Hillsboro, OR Supporting new Cloud Services initiative for Intel (Software and Services Group). Sr. Technical Writer (consulting) Intel Corporation November 2011  –  May 2012  (7 months) Hillsboro, OR I rejoined the SW Development team I previously worked for on a new contract. Supporting Intel AppUp SDK and services. Sr. Technical Writer (Consulting at Intel) Wizard Technical Staffing May 2010  –  May 2011  (1 year 1 month) Writing SDK Reference documents to support application developer community for Intel App Store (AppUp center). Developing Help systems for Visual Studio, Eclipse, and Qt Creator. Sr. Technical Writer Usability Architects (Consulting at Intel) January 2009  –  December 2009  (1 year) Consulting through Usability Architects for major semiconductor manufacturer to help document technical and user SW products for new HW/SW graphics product line. Usage Model/Requirements Development Usability Architects (Consulting at Intel) July 2007  –  December 2008  (1 year 6 months) Consulting through Usability Architects for major semiconductor manufacturer to help develop and document usage models for future products and develop actionable and measurable requirements to guide product groups. Product Marketing Engineer Intel Corp July 2005  –  December 2006  (1 year 6 months) Aligned computing industry with Intel’s PC vision so that industry HW and SW was ready to enable new/improved usage models. \n• Drove internal consensus across divisions and geographies for office and home PC visions for future year PCs \n• Published office and home PC visions in OEM presentations and printed brochures for broader industry dissemination \n• Managed web portal and evolved structure/content to increase hits by 20% \n• Developed web content to support PC vision for public web portal Project Manager/Business Analyst Intel Corp. September 2000  –  July 2005  (4 years 11 months) Defined, developed, and managed SW solution roadmap process; defined and managed IT requirements process; deployed new IT solutions. \n• Managed rollout of Microsoft Windows Sharepoint Services to two Intel business units to increase employee productivity of targeted teams 15% \n• Defined SW solution roadmap process to communicate joint Intel-ISV efforts; managed the process to publish solution roadmaps \n• Developed solution requirements to help drive new IT investments through customer and stakeholder surveys/interviews; developed/published use cases for high priority solutions \n• Defined automated requirements process as part of a larger IT solution requirements and management process; managed the process through two cycles of requirements gathering/development; published use cases and requirements \n• Defined and managed development of IT web services for IT strategic planning team Technical Marketing Manager Intel Corporation July 1996  –  September 2000  (4 years 3 months) Managed processor and motherboard TME teams; drove product, tool, and business acumen improvements across divisions/geographies. \n• Hired, trained, developed, and managed eight TMEs across two Intel sites \no Processor TMEs launched/supported flagship Intel processors \no Motherboard team launched/supported 18 desktop and workstation products \n• Drove worldwide, cross-division teams to provide superior driver installation process, new debug tools for integrators, and better overall business acumen Sr. Technical Writer Intel Corporation January 2014  – Present (1 year 8 months) Hillsboro, OR Supporting new Intel Custom Foundry group. Hardware baby! Sr. Technical Writer Intel Corporation January 2014  – Present (1 year 8 months) Hillsboro, OR Supporting new Intel Custom Foundry group. Hardware baby! Sr. Technical Writer Intel Corporation May 2012  –  December 2013  (1 year 8 months) Jones Farm Campus, Hillsboro, OR Supporting new Cloud Services initiative for Intel (Software and Services Group). Sr. Technical Writer Intel Corporation May 2012  –  December 2013  (1 year 8 months) Jones Farm Campus, Hillsboro, OR Supporting new Cloud Services initiative for Intel (Software and Services Group). Sr. Technical Writer (consulting) Intel Corporation November 2011  –  May 2012  (7 months) Hillsboro, OR I rejoined the SW Development team I previously worked for on a new contract. Supporting Intel AppUp SDK and services. Sr. Technical Writer (consulting) Intel Corporation November 2011  –  May 2012  (7 months) Hillsboro, OR I rejoined the SW Development team I previously worked for on a new contract. Supporting Intel AppUp SDK and services. Sr. Technical Writer (Consulting at Intel) Wizard Technical Staffing May 2010  –  May 2011  (1 year 1 month) Writing SDK Reference documents to support application developer community for Intel App Store (AppUp center). Developing Help systems for Visual Studio, Eclipse, and Qt Creator. Sr. Technical Writer (Consulting at Intel) Wizard Technical Staffing May 2010  –  May 2011  (1 year 1 month) Writing SDK Reference documents to support application developer community for Intel App Store (AppUp center). Developing Help systems for Visual Studio, Eclipse, and Qt Creator. Sr. Technical Writer Usability Architects (Consulting at Intel) January 2009  –  December 2009  (1 year) Consulting through Usability Architects for major semiconductor manufacturer to help document technical and user SW products for new HW/SW graphics product line. Sr. Technical Writer Usability Architects (Consulting at Intel) January 2009  –  December 2009  (1 year) Consulting through Usability Architects for major semiconductor manufacturer to help document technical and user SW products for new HW/SW graphics product line. Usage Model/Requirements Development Usability Architects (Consulting at Intel) July 2007  –  December 2008  (1 year 6 months) Consulting through Usability Architects for major semiconductor manufacturer to help develop and document usage models for future products and develop actionable and measurable requirements to guide product groups. Usage Model/Requirements Development Usability Architects (Consulting at Intel) July 2007  –  December 2008  (1 year 6 months) Consulting through Usability Architects for major semiconductor manufacturer to help develop and document usage models for future products and develop actionable and measurable requirements to guide product groups. Product Marketing Engineer Intel Corp July 2005  –  December 2006  (1 year 6 months) Aligned computing industry with Intel’s PC vision so that industry HW and SW was ready to enable new/improved usage models. \n• Drove internal consensus across divisions and geographies for office and home PC visions for future year PCs \n• Published office and home PC visions in OEM presentations and printed brochures for broader industry dissemination \n• Managed web portal and evolved structure/content to increase hits by 20% \n• Developed web content to support PC vision for public web portal Product Marketing Engineer Intel Corp July 2005  –  December 2006  (1 year 6 months) Aligned computing industry with Intel’s PC vision so that industry HW and SW was ready to enable new/improved usage models. \n• Drove internal consensus across divisions and geographies for office and home PC visions for future year PCs \n• Published office and home PC visions in OEM presentations and printed brochures for broader industry dissemination \n• Managed web portal and evolved structure/content to increase hits by 20% \n• Developed web content to support PC vision for public web portal Project Manager/Business Analyst Intel Corp. September 2000  –  July 2005  (4 years 11 months) Defined, developed, and managed SW solution roadmap process; defined and managed IT requirements process; deployed new IT solutions. \n• Managed rollout of Microsoft Windows Sharepoint Services to two Intel business units to increase employee productivity of targeted teams 15% \n• Defined SW solution roadmap process to communicate joint Intel-ISV efforts; managed the process to publish solution roadmaps \n• Developed solution requirements to help drive new IT investments through customer and stakeholder surveys/interviews; developed/published use cases for high priority solutions \n• Defined automated requirements process as part of a larger IT solution requirements and management process; managed the process through two cycles of requirements gathering/development; published use cases and requirements \n• Defined and managed development of IT web services for IT strategic planning team Project Manager/Business Analyst Intel Corp. September 2000  –  July 2005  (4 years 11 months) Defined, developed, and managed SW solution roadmap process; defined and managed IT requirements process; deployed new IT solutions. \n• Managed rollout of Microsoft Windows Sharepoint Services to two Intel business units to increase employee productivity of targeted teams 15% \n• Defined SW solution roadmap process to communicate joint Intel-ISV efforts; managed the process to publish solution roadmaps \n• Developed solution requirements to help drive new IT investments through customer and stakeholder surveys/interviews; developed/published use cases for high priority solutions \n• Defined automated requirements process as part of a larger IT solution requirements and management process; managed the process through two cycles of requirements gathering/development; published use cases and requirements \n• Defined and managed development of IT web services for IT strategic planning team Technical Marketing Manager Intel Corporation July 1996  –  September 2000  (4 years 3 months) Managed processor and motherboard TME teams; drove product, tool, and business acumen improvements across divisions/geographies. \n• Hired, trained, developed, and managed eight TMEs across two Intel sites \no Processor TMEs launched/supported flagship Intel processors \no Motherboard team launched/supported 18 desktop and workstation products \n• Drove worldwide, cross-division teams to provide superior driver installation process, new debug tools for integrators, and better overall business acumen Technical Marketing Manager Intel Corporation July 1996  –  September 2000  (4 years 3 months) Managed processor and motherboard TME teams; drove product, tool, and business acumen improvements across divisions/geographies. \n• Hired, trained, developed, and managed eight TMEs across two Intel sites \no Processor TMEs launched/supported flagship Intel processors \no Motherboard team launched/supported 18 desktop and workstation products \n• Drove worldwide, cross-division teams to provide superior driver installation process, new debug tools for integrators, and better overall business acumen Skills Marketing Strategy Information Technology Technical Marketing Project Management Product Launch Technical Writing Process Improvement Program Management SharePoint Business Development Skills  Marketing Strategy Information Technology Technical Marketing Project Management Product Launch Technical Writing Process Improvement Program Management SharePoint Business Development Marketing Strategy Information Technology Technical Marketing Project Management Product Launch Technical Writing Process Improvement Program Management SharePoint Business Development Marketing Strategy Information Technology Technical Marketing Project Management Product Launch Technical Writing Process Improvement Program Management SharePoint Business Development Education California State University-Chico Certification,  Localization 2009  – 2010 Activities and Societies:  Certified in Localization through California State University - Chico and AILIA Language Technology Research Center ,  Quebec ,  Canada. San Jose State University B.A.,  U.S. History Santa Clara University M.A.,  Biblical Studies Activities and Societies:  Master of Arts from Jesuit School of Theology Berkeley (now part of Santa Clara University). California State University-Chico Certification,  Localization 2009  – 2010 Activities and Societies:  Certified in Localization through California State University - Chico and AILIA Language Technology Research Center ,  Quebec ,  Canada. California State University-Chico Certification,  Localization 2009  – 2010 Activities and Societies:  Certified in Localization through California State University - Chico and AILIA Language Technology Research Center ,  Quebec ,  Canada. California State University-Chico Certification,  Localization 2009  – 2010 Activities and Societies:  Certified in Localization through California State University - Chico and AILIA Language Technology Research Center ,  Quebec ,  Canada. San Jose State University B.A.,  U.S. History San Jose State University B.A.,  U.S. History San Jose State University B.A.,  U.S. History Santa Clara University M.A.,  Biblical Studies Activities and Societies:  Master of Arts from Jesuit School of Theology Berkeley (now part of Santa Clara University). Santa Clara University M.A.,  Biblical Studies Activities and Societies:  Master of Arts from Jesuit School of Theology Berkeley (now part of Santa Clara University). Santa Clara University M.A.,  Biblical Studies Activities and Societies:  Master of Arts from Jesuit School of Theology Berkeley (now part of Santa Clara University). Honors & Awards Additional Honors & Awards Intel Achievement Award (1996) Additional Honors & Awards Intel Achievement Award (1996) Additional Honors & Awards Intel Achievement Award (1996) Additional Honors & Awards Intel Achievement Award (1996) ", "Skills Circuit Design Accounting Telephony MPLS Project Management Ethernet Purchasing Telecommunications Software Documentation Troubleshooting Team Leadership Call Center Training Vendor Management SIP Business Process Team Building Process Improvement Wireless T1 Technical Writing DSL IP Network Design Testing Visio Human Resources VoIP Technical Documentation Recruiting Technical Communication Call Centers Networking Management See 19+     See less Skills  Circuit Design Accounting Telephony MPLS Project Management Ethernet Purchasing Telecommunications Software Documentation Troubleshooting Team Leadership Call Center Training Vendor Management SIP Business Process Team Building Process Improvement Wireless T1 Technical Writing DSL IP Network Design Testing Visio Human Resources VoIP Technical Documentation Recruiting Technical Communication Call Centers Networking Management See 19+     See less Circuit Design Accounting Telephony MPLS Project Management Ethernet Purchasing Telecommunications Software Documentation Troubleshooting Team Leadership Call Center Training Vendor Management SIP Business Process Team Building Process Improvement Wireless T1 Technical Writing DSL IP Network Design Testing Visio Human Resources VoIP Technical Documentation Recruiting Technical Communication Call Centers Networking Management See 19+     See less Circuit Design Accounting Telephony MPLS Project Management Ethernet Purchasing Telecommunications Software Documentation Troubleshooting Team Leadership Call Center Training Vendor Management SIP Business Process Team Building Process Improvement Wireless T1 Technical Writing DSL IP Network Design Testing Visio Human Resources VoIP Technical Documentation Recruiting Technical Communication Call Centers Networking Management See 19+     See less ", "Summary Experienced marketing and technical communication professional who can organize documents and people, create templates, improve processes, and mentor staff. Detail-driven editor, writer, graphic artist, public speaker, marketer, and certified educator. A one-stop resource who can turn raw data into clear, consistent, brand-compliant, easy-to-understand verbiage. Expertise in desktop publishing and technical communication applications, with background in education and training.  \n \nEqually comfortable in a one-man technical/marketing communication department or among a team of writers and illustrators.  \n \nCommunication expertise in most media: Written, spoken, published, illustrative, photographic, electronic; user/installation manuals, online help, presentations, speeches, audio/video scripts, marketing collateral, competitive analyses. \n \nI’m looking for an opportunity that will let me work as an editor, technical writer, marketer, copy writer, graphic artist, public speaker, educator, manager...any combination of the above! Specialties:Emphasis on FrameMaker, Illustrator, Photoshop, RoboHelp. Template/design creation, style maintenance, graphic standards, editing for clarity and consistency.  \n \nAlso good with creative ideas and solutions, ad concepts, names, messaging.... Summary Experienced marketing and technical communication professional who can organize documents and people, create templates, improve processes, and mentor staff. Detail-driven editor, writer, graphic artist, public speaker, marketer, and certified educator. A one-stop resource who can turn raw data into clear, consistent, brand-compliant, easy-to-understand verbiage. Expertise in desktop publishing and technical communication applications, with background in education and training.  \n \nEqually comfortable in a one-man technical/marketing communication department or among a team of writers and illustrators.  \n \nCommunication expertise in most media: Written, spoken, published, illustrative, photographic, electronic; user/installation manuals, online help, presentations, speeches, audio/video scripts, marketing collateral, competitive analyses. \n \nI’m looking for an opportunity that will let me work as an editor, technical writer, marketer, copy writer, graphic artist, public speaker, educator, manager...any combination of the above! Specialties:Emphasis on FrameMaker, Illustrator, Photoshop, RoboHelp. Template/design creation, style maintenance, graphic standards, editing for clarity and consistency.  \n \nAlso good with creative ideas and solutions, ad concepts, names, messaging.... Experienced marketing and technical communication professional who can organize documents and people, create templates, improve processes, and mentor staff. Detail-driven editor, writer, graphic artist, public speaker, marketer, and certified educator. A one-stop resource who can turn raw data into clear, consistent, brand-compliant, easy-to-understand verbiage. Expertise in desktop publishing and technical communication applications, with background in education and training.  \n \nEqually comfortable in a one-man technical/marketing communication department or among a team of writers and illustrators.  \n \nCommunication expertise in most media: Written, spoken, published, illustrative, photographic, electronic; user/installation manuals, online help, presentations, speeches, audio/video scripts, marketing collateral, competitive analyses. \n \nI’m looking for an opportunity that will let me work as an editor, technical writer, marketer, copy writer, graphic artist, public speaker, educator, manager...any combination of the above! Specialties:Emphasis on FrameMaker, Illustrator, Photoshop, RoboHelp. Template/design creation, style maintenance, graphic standards, editing for clarity and consistency.  \n \nAlso good with creative ideas and solutions, ad concepts, names, messaging.... Experienced marketing and technical communication professional who can organize documents and people, create templates, improve processes, and mentor staff. Detail-driven editor, writer, graphic artist, public speaker, marketer, and certified educator. A one-stop resource who can turn raw data into clear, consistent, brand-compliant, easy-to-understand verbiage. Expertise in desktop publishing and technical communication applications, with background in education and training.  \n \nEqually comfortable in a one-man technical/marketing communication department or among a team of writers and illustrators.  \n \nCommunication expertise in most media: Written, spoken, published, illustrative, photographic, electronic; user/installation manuals, online help, presentations, speeches, audio/video scripts, marketing collateral, competitive analyses. \n \nI’m looking for an opportunity that will let me work as an editor, technical writer, marketer, copy writer, graphic artist, public speaker, educator, manager...any combination of the above! Specialties:Emphasis on FrameMaker, Illustrator, Photoshop, RoboHelp. Template/design creation, style maintenance, graphic standards, editing for clarity and consistency.  \n \nAlso good with creative ideas and solutions, ad concepts, names, messaging.... Experience Senior Technical Writer Intel Corporation (contractor: PTI Global) July 2013  – Present (2 years 2 months) Chandler, AZ FrameMaker, RoboHelp, Word, Visio, Illustrator expert supporting engineering and marketing in the Cache Acceleration, Data Center, and Mobile Devices groups. Tasks include writing user/installation manuals and white papers; creating Visio graphics for a new processor; and writing, editing, and maintaining a WebHelp system (in RoboHelp) for a digital signage software solution, which is currently supported in six languages. Technical and Marketing Writer/Editor newmanic devices January 2009  –  September 2013  (4 years 9 months) Created technical and marketing communication content and templates for various clients, including a wireless communication provider, a government housing agency, and a digital signage software developer. Deliverables included web content, sales brochures, PowerPoint presentations, user/installation documentation, technical communication templates, an RFI for a voice-over-IP phone system upgrade, and miscellaneous marcom collateral. Technical Writer Intel Corporation (contractor: Insight) July 2012  –  July 2013  (1 year 1 month) Hillsboro, OR FrameMaker, Word, and PowerPoint expert supporting engineers in the Data Center Platform Application Engineering (DCPAE) group. Tasks included editing and revising content created by engineers, mostly in FrameMaker v8 and v10, to fix writing and branding issues, cross-references, conditional text, variables, and formatting problems. Considerable amount of work in Word, Excel, PowerPoint, XMetaL, and other applications. I also created a handbook of technical style guidelines and processes for technical authors and branding editors for the DCPAE and other tech pubs groups within Intel. Technical Publications Architect Columbia Helicopters December 2009  –  July 2012  (2 years 8 months) Document architect and writer for a heavy-lift aviation company, working with people of widely different backgrounds and expertises, from aviation engineers to shop floor mechanics.  \n \nCreated ATA-compliant multibook FrameMaker 10 templates that automated page effectivities, nonstandard page numbering, and generation of 80- to 100-page lists of over 16,000 part numbers from 2000- to 3000-page illustrated parts catalogs, saving untold hours of manual updates.  \n \nDesigned FrameMaker templates, Excel spreadsheets and formulas, and Access database processes to convert raw engineering information into reusable yet aircraft-specific wiring manuals, reducing Engineering’s time spent updating wiring diagrams for each aircraft.  \n \nUpdated service/overhaul manuals, illustrated parts catalogs, and other documents. \n \nEdited existing and created new raster and vector graphics. Technical Publications Manager GE Security January 2004  –  November 2008  (4 years 11 months) Manage a global team of nine technical writers/illustrators, in three countries, responsible for all end-user documentation for video, key control, cargo, intrusion, home networking, and access products.  \n \nMaintain an archive of source documentation and graphics libraries at six global sites, a total of 3,000 documents and more than 50,000 pages.  \n \nAuthor and maintain a comprehensive Style & Usage Manual for a global technical communication group with guidelines for documentation appearance/layout, grammar/mechanics, spellings, processes, and graphics.  \n \nCreate FrameMaker, Word, RoboHelp, InDesign, and PageMaker templates, based on corporate branding guidelines. Technical Writer/ Production Artist Orenco Systems November 2001  –  December 2003  (2 years 2 months) Manage projects for new product documentation; write user, installation, operation, safety manuals; create illustrations for marketing collateral; create case studies, magazine ads, posters; conduct survey/statistical research for corporate planning; update web content, troubleshoot intranet applications. Editor Oregon Baseball Campaign 1998  –  2003  (5 years) Promote the movement to bring Major League Baseball to Portland (volunteer basis). Create supporting materials to combat several myths about Portland's viability for MLB, set up and manage the organization's forums, and edit all website materials. Sr. Technical Writer VideoTele.com January 2000  –  June 2001  (1 year 6 months) Write user, installation, service, and reference manuals for hardware and software products; create illustrations for manuals and sales collateral; write HTML code for an improved user interface. Product Marketing Manager Tektronix June 1993  –  January 2000  (6 years 8 months) Write user, installation, service, and reference manuals for hardware and software products; create technical illustrations; convert documents to HTML. \n \nResearch competitive information; write white papers, sales releases, sales reference guides, competitive guides; write articles for publication in internationally distributed periodicals. Coordinate new-hire sales training.  \n \nCreate training modules for hardware/software products and trained field technicians, sales people, and customers on features, operations, and repair procedures; write internal sales and technical articles; interview engineering; edit monthly technical journal. Teacher Hillsboro School District January 1990  –  June 1993  (3 years 6 months) Teach language arts, yearbook, newspaper, computers, US History, geography, shop, leadership, ESL. For half of my tenure at HUHSD I also worked two secondary part-time jobs, at Sequent and at PCC. Technical Writer Sequent June 1992  –  December 1992  (7 months) Document manufacturing and sales operations for ISO certification; create FrameMaker templates. Instructor Portland Community College January 1991  –  June 1992  (1 year 6 months) Teach ESL to adults of varying proficiency levels. Teacher Los Angeles Unified School District August 1985  –  October 1989  (4 years 3 months) Teach language arts, creative writing, US History, geography, citizenship, ESL. Senior Technical Writer Intel Corporation (contractor: PTI Global) July 2013  – Present (2 years 2 months) Chandler, AZ FrameMaker, RoboHelp, Word, Visio, Illustrator expert supporting engineering and marketing in the Cache Acceleration, Data Center, and Mobile Devices groups. Tasks include writing user/installation manuals and white papers; creating Visio graphics for a new processor; and writing, editing, and maintaining a WebHelp system (in RoboHelp) for a digital signage software solution, which is currently supported in six languages. Senior Technical Writer Intel Corporation (contractor: PTI Global) July 2013  – Present (2 years 2 months) Chandler, AZ FrameMaker, RoboHelp, Word, Visio, Illustrator expert supporting engineering and marketing in the Cache Acceleration, Data Center, and Mobile Devices groups. Tasks include writing user/installation manuals and white papers; creating Visio graphics for a new processor; and writing, editing, and maintaining a WebHelp system (in RoboHelp) for a digital signage software solution, which is currently supported in six languages. Technical and Marketing Writer/Editor newmanic devices January 2009  –  September 2013  (4 years 9 months) Created technical and marketing communication content and templates for various clients, including a wireless communication provider, a government housing agency, and a digital signage software developer. Deliverables included web content, sales brochures, PowerPoint presentations, user/installation documentation, technical communication templates, an RFI for a voice-over-IP phone system upgrade, and miscellaneous marcom collateral. Technical and Marketing Writer/Editor newmanic devices January 2009  –  September 2013  (4 years 9 months) Created technical and marketing communication content and templates for various clients, including a wireless communication provider, a government housing agency, and a digital signage software developer. Deliverables included web content, sales brochures, PowerPoint presentations, user/installation documentation, technical communication templates, an RFI for a voice-over-IP phone system upgrade, and miscellaneous marcom collateral. Technical Writer Intel Corporation (contractor: Insight) July 2012  –  July 2013  (1 year 1 month) Hillsboro, OR FrameMaker, Word, and PowerPoint expert supporting engineers in the Data Center Platform Application Engineering (DCPAE) group. Tasks included editing and revising content created by engineers, mostly in FrameMaker v8 and v10, to fix writing and branding issues, cross-references, conditional text, variables, and formatting problems. Considerable amount of work in Word, Excel, PowerPoint, XMetaL, and other applications. I also created a handbook of technical style guidelines and processes for technical authors and branding editors for the DCPAE and other tech pubs groups within Intel. Technical Writer Intel Corporation (contractor: Insight) July 2012  –  July 2013  (1 year 1 month) Hillsboro, OR FrameMaker, Word, and PowerPoint expert supporting engineers in the Data Center Platform Application Engineering (DCPAE) group. Tasks included editing and revising content created by engineers, mostly in FrameMaker v8 and v10, to fix writing and branding issues, cross-references, conditional text, variables, and formatting problems. Considerable amount of work in Word, Excel, PowerPoint, XMetaL, and other applications. I also created a handbook of technical style guidelines and processes for technical authors and branding editors for the DCPAE and other tech pubs groups within Intel. Technical Publications Architect Columbia Helicopters December 2009  –  July 2012  (2 years 8 months) Document architect and writer for a heavy-lift aviation company, working with people of widely different backgrounds and expertises, from aviation engineers to shop floor mechanics.  \n \nCreated ATA-compliant multibook FrameMaker 10 templates that automated page effectivities, nonstandard page numbering, and generation of 80- to 100-page lists of over 16,000 part numbers from 2000- to 3000-page illustrated parts catalogs, saving untold hours of manual updates.  \n \nDesigned FrameMaker templates, Excel spreadsheets and formulas, and Access database processes to convert raw engineering information into reusable yet aircraft-specific wiring manuals, reducing Engineering’s time spent updating wiring diagrams for each aircraft.  \n \nUpdated service/overhaul manuals, illustrated parts catalogs, and other documents. \n \nEdited existing and created new raster and vector graphics. Technical Publications Architect Columbia Helicopters December 2009  –  July 2012  (2 years 8 months) Document architect and writer for a heavy-lift aviation company, working with people of widely different backgrounds and expertises, from aviation engineers to shop floor mechanics.  \n \nCreated ATA-compliant multibook FrameMaker 10 templates that automated page effectivities, nonstandard page numbering, and generation of 80- to 100-page lists of over 16,000 part numbers from 2000- to 3000-page illustrated parts catalogs, saving untold hours of manual updates.  \n \nDesigned FrameMaker templates, Excel spreadsheets and formulas, and Access database processes to convert raw engineering information into reusable yet aircraft-specific wiring manuals, reducing Engineering’s time spent updating wiring diagrams for each aircraft.  \n \nUpdated service/overhaul manuals, illustrated parts catalogs, and other documents. \n \nEdited existing and created new raster and vector graphics. Technical Publications Manager GE Security January 2004  –  November 2008  (4 years 11 months) Manage a global team of nine technical writers/illustrators, in three countries, responsible for all end-user documentation for video, key control, cargo, intrusion, home networking, and access products.  \n \nMaintain an archive of source documentation and graphics libraries at six global sites, a total of 3,000 documents and more than 50,000 pages.  \n \nAuthor and maintain a comprehensive Style & Usage Manual for a global technical communication group with guidelines for documentation appearance/layout, grammar/mechanics, spellings, processes, and graphics.  \n \nCreate FrameMaker, Word, RoboHelp, InDesign, and PageMaker templates, based on corporate branding guidelines. Technical Publications Manager GE Security January 2004  –  November 2008  (4 years 11 months) Manage a global team of nine technical writers/illustrators, in three countries, responsible for all end-user documentation for video, key control, cargo, intrusion, home networking, and access products.  \n \nMaintain an archive of source documentation and graphics libraries at six global sites, a total of 3,000 documents and more than 50,000 pages.  \n \nAuthor and maintain a comprehensive Style & Usage Manual for a global technical communication group with guidelines for documentation appearance/layout, grammar/mechanics, spellings, processes, and graphics.  \n \nCreate FrameMaker, Word, RoboHelp, InDesign, and PageMaker templates, based on corporate branding guidelines. Technical Writer/ Production Artist Orenco Systems November 2001  –  December 2003  (2 years 2 months) Manage projects for new product documentation; write user, installation, operation, safety manuals; create illustrations for marketing collateral; create case studies, magazine ads, posters; conduct survey/statistical research for corporate planning; update web content, troubleshoot intranet applications. Technical Writer/ Production Artist Orenco Systems November 2001  –  December 2003  (2 years 2 months) Manage projects for new product documentation; write user, installation, operation, safety manuals; create illustrations for marketing collateral; create case studies, magazine ads, posters; conduct survey/statistical research for corporate planning; update web content, troubleshoot intranet applications. Editor Oregon Baseball Campaign 1998  –  2003  (5 years) Promote the movement to bring Major League Baseball to Portland (volunteer basis). Create supporting materials to combat several myths about Portland's viability for MLB, set up and manage the organization's forums, and edit all website materials. Editor Oregon Baseball Campaign 1998  –  2003  (5 years) Promote the movement to bring Major League Baseball to Portland (volunteer basis). Create supporting materials to combat several myths about Portland's viability for MLB, set up and manage the organization's forums, and edit all website materials. Sr. Technical Writer VideoTele.com January 2000  –  June 2001  (1 year 6 months) Write user, installation, service, and reference manuals for hardware and software products; create illustrations for manuals and sales collateral; write HTML code for an improved user interface. Sr. Technical Writer VideoTele.com January 2000  –  June 2001  (1 year 6 months) Write user, installation, service, and reference manuals for hardware and software products; create illustrations for manuals and sales collateral; write HTML code for an improved user interface. Product Marketing Manager Tektronix June 1993  –  January 2000  (6 years 8 months) Write user, installation, service, and reference manuals for hardware and software products; create technical illustrations; convert documents to HTML. \n \nResearch competitive information; write white papers, sales releases, sales reference guides, competitive guides; write articles for publication in internationally distributed periodicals. Coordinate new-hire sales training.  \n \nCreate training modules for hardware/software products and trained field technicians, sales people, and customers on features, operations, and repair procedures; write internal sales and technical articles; interview engineering; edit monthly technical journal. Product Marketing Manager Tektronix June 1993  –  January 2000  (6 years 8 months) Write user, installation, service, and reference manuals for hardware and software products; create technical illustrations; convert documents to HTML. \n \nResearch competitive information; write white papers, sales releases, sales reference guides, competitive guides; write articles for publication in internationally distributed periodicals. Coordinate new-hire sales training.  \n \nCreate training modules for hardware/software products and trained field technicians, sales people, and customers on features, operations, and repair procedures; write internal sales and technical articles; interview engineering; edit monthly technical journal. Teacher Hillsboro School District January 1990  –  June 1993  (3 years 6 months) Teach language arts, yearbook, newspaper, computers, US History, geography, shop, leadership, ESL. For half of my tenure at HUHSD I also worked two secondary part-time jobs, at Sequent and at PCC. Teacher Hillsboro School District January 1990  –  June 1993  (3 years 6 months) Teach language arts, yearbook, newspaper, computers, US History, geography, shop, leadership, ESL. For half of my tenure at HUHSD I also worked two secondary part-time jobs, at Sequent and at PCC. Technical Writer Sequent June 1992  –  December 1992  (7 months) Document manufacturing and sales operations for ISO certification; create FrameMaker templates. Technical Writer Sequent June 1992  –  December 1992  (7 months) Document manufacturing and sales operations for ISO certification; create FrameMaker templates. Instructor Portland Community College January 1991  –  June 1992  (1 year 6 months) Teach ESL to adults of varying proficiency levels. Instructor Portland Community College January 1991  –  June 1992  (1 year 6 months) Teach ESL to adults of varying proficiency levels. Teacher Los Angeles Unified School District August 1985  –  October 1989  (4 years 3 months) Teach language arts, creative writing, US History, geography, citizenship, ESL. Teacher Los Angeles Unified School District August 1985  –  October 1989  (4 years 3 months) Teach language arts, creative writing, US History, geography, citizenship, ESL. Skills FrameMaker Microsoft Word Microsoft Excel Illustrator Photoshop PowerPoint Guitar Pro Editing Writing RoboHelp Technical Writing Technical Communication Product Development Training Technical Documentation Manuals Software Documentation Proofreading Project Management Online Help Leadership HTML Adobe Acrobat InDesign Microsoft Office Windows Marketing Communications Training Leadership SnagIt Security Dreamweaver Web Content Guides Content Management Visio JustSystems XMetaL SDL Trisoft FrameScript Anacapa Management Style Guides Troubleshooting Structured Authoring English grammar Product Marketing Team Building Captivate White Papers Information Architecture Marketing See 35+     See less Skills  FrameMaker Microsoft Word Microsoft Excel Illustrator Photoshop PowerPoint Guitar Pro Editing Writing RoboHelp Technical Writing Technical Communication Product Development Training Technical Documentation Manuals Software Documentation Proofreading Project Management Online Help Leadership HTML Adobe Acrobat InDesign Microsoft Office Windows Marketing Communications Training Leadership SnagIt Security Dreamweaver Web Content Guides Content Management Visio JustSystems XMetaL SDL Trisoft FrameScript Anacapa Management Style Guides Troubleshooting Structured Authoring English grammar Product Marketing Team Building Captivate White Papers Information Architecture Marketing See 35+     See less FrameMaker Microsoft Word Microsoft Excel Illustrator Photoshop PowerPoint Guitar Pro Editing Writing RoboHelp Technical Writing Technical Communication Product Development Training Technical Documentation Manuals Software Documentation Proofreading Project Management Online Help Leadership HTML Adobe Acrobat InDesign Microsoft Office Windows Marketing Communications Training Leadership SnagIt Security Dreamweaver Web Content Guides Content Management Visio JustSystems XMetaL SDL Trisoft FrameScript Anacapa Management Style Guides Troubleshooting Structured Authoring English grammar Product Marketing Team Building Captivate White Papers Information Architecture Marketing See 35+     See less FrameMaker Microsoft Word Microsoft Excel Illustrator Photoshop PowerPoint Guitar Pro Editing Writing RoboHelp Technical Writing Technical Communication Product Development Training Technical Documentation Manuals Software Documentation Proofreading Project Management Online Help Leadership HTML Adobe Acrobat InDesign Microsoft Office Windows Marketing Communications Training Leadership SnagIt Security Dreamweaver Web Content Guides Content Management Visio JustSystems XMetaL SDL Trisoft FrameScript Anacapa Management Style Guides Troubleshooting Structured Authoring English grammar Product Marketing Team Building Captivate White Papers Information Architecture Marketing See 35+     See less Education University of Phoenix MBA,  Technology Management LA Unified School District Teaching Credential,  Secondary Education: Language Arts ,  Social Science California State University-Northridge BA,  English Alemany English ,  Music University of Phoenix MBA,  Technology Management University of Phoenix MBA,  Technology Management University of Phoenix MBA,  Technology Management LA Unified School District Teaching Credential,  Secondary Education: Language Arts ,  Social Science LA Unified School District Teaching Credential,  Secondary Education: Language Arts ,  Social Science LA Unified School District Teaching Credential,  Secondary Education: Language Arts ,  Social Science California State University-Northridge BA,  English California State University-Northridge BA,  English California State University-Northridge BA,  English Alemany English ,  Music Alemany English ,  Music Alemany English ,  Music ", "Experience Technical Writer Intel Corporation July 2015  – Present (2 months) Stow, MA McAfee is now part of Intel Security. Technical Writer McAfee, Inc. August 2012  –  June 2015  (2 years 11 months) Stow, MA I moved with the Cloud Identity Manager product group to McAfee from Intel. Technical Writer Intel Corporation October 2010  –  July 2012  (1 year 10 months) Stow, MA Technical Writer CA, Inc. (now CA Technologies) 2007  –  2010  (3 years) Framingham, MA Software Engineer Instrumentation Laboratory 1984  –  1985  (1 year) Lexington, MA Software Engineer Coulter Biomedical Research Corporation 1981  –  1984  (3 years) Concord, MA Research Assistant Coulter Biomedical Research Corporation 1980  –  1981  (1 year) Concord, MA Technical Writer Intel Corporation July 2015  – Present (2 months) Stow, MA McAfee is now part of Intel Security. Technical Writer Intel Corporation July 2015  – Present (2 months) Stow, MA McAfee is now part of Intel Security. Technical Writer McAfee, Inc. August 2012  –  June 2015  (2 years 11 months) Stow, MA I moved with the Cloud Identity Manager product group to McAfee from Intel. Technical Writer McAfee, Inc. August 2012  –  June 2015  (2 years 11 months) Stow, MA I moved with the Cloud Identity Manager product group to McAfee from Intel. Technical Writer Intel Corporation October 2010  –  July 2012  (1 year 10 months) Stow, MA Technical Writer Intel Corporation October 2010  –  July 2012  (1 year 10 months) Stow, MA Technical Writer CA, Inc. (now CA Technologies) 2007  –  2010  (3 years) Framingham, MA Technical Writer CA, Inc. (now CA Technologies) 2007  –  2010  (3 years) Framingham, MA Software Engineer Instrumentation Laboratory 1984  –  1985  (1 year) Lexington, MA Software Engineer Instrumentation Laboratory 1984  –  1985  (1 year) Lexington, MA Software Engineer Coulter Biomedical Research Corporation 1981  –  1984  (3 years) Concord, MA Software Engineer Coulter Biomedical Research Corporation 1981  –  1984  (3 years) Concord, MA Research Assistant Coulter Biomedical Research Corporation 1980  –  1981  (1 year) Concord, MA Research Assistant Coulter Biomedical Research Corporation 1980  –  1981  (1 year) Concord, MA Education University of Massachusetts Lowell Certificate,  Technical Writing 2005  – 2006 Washington University in St. Louis BA,  Biology Worcester Polytechnic Institute Computer Science Courses University of Massachusetts Lowell Certificate,  Technical Writing 2005  – 2006 University of Massachusetts Lowell Certificate,  Technical Writing 2005  – 2006 University of Massachusetts Lowell Certificate,  Technical Writing 2005  – 2006 Washington University in St. Louis BA,  Biology Washington University in St. Louis BA,  Biology Washington University in St. Louis BA,  Biology Worcester Polytechnic Institute Computer Science Courses Worcester Polytechnic Institute Computer Science Courses Worcester Polytechnic Institute Computer Science Courses Honors & Awards ", "Summary Your first line of defense from expensive customer support calls is providing great customer documentation. Great documentation is the result of developing and applying three principles: \n1. Developing a thorough understanding of your audience. \n2. Developing a thorough understanding of how your product or service fulfills a need. \n3. Creating a documentation plan to provide just enough information at just the right time and place. \n \nThat's where a technical writer comes in. \n \nTechnical writers and communicators provide various commodities of the \"Total User Experience,\" from marketing, sales, training, and customer support. This can include a wide range of end-user collateral, such as online help systems, training guides and tutorials, and support documentation. \n \nA technical writer can also improve the internal communications in your development process. Examples include producing clear product specifications, developing use case analysis, diagramming architecture and data flow, and assisting with user interface design, or quality assurance. \n \nAs a technical writer, I provide easy and painless user assistance documentation right where it's needed - and in whatever forms that work best for you and your audience. I have a wide breadth of experience in many industries, including high-tech. \n \nI have produced entire publication sets online in HTML, Windows Help, embedded UI help, and PDF formats. I have mastered the best methods for technical communication, and have consulted at many of the high profile corporations in Portland and the greater Pacific Northwest area. \n \nSpecialties: Help systems for consumer electronics products, banking information systems, health insurance information systems, retail information systems, manufacturing supply chain infrastructure, secure networking, UNIX and Windows architecture, QA methodologies, translation and localization, single-sourcing methodologies, HTML, PDF, Word, FrontPage, Visio, Illustrator, many others. Summary Your first line of defense from expensive customer support calls is providing great customer documentation. Great documentation is the result of developing and applying three principles: \n1. Developing a thorough understanding of your audience. \n2. Developing a thorough understanding of how your product or service fulfills a need. \n3. Creating a documentation plan to provide just enough information at just the right time and place. \n \nThat's where a technical writer comes in. \n \nTechnical writers and communicators provide various commodities of the \"Total User Experience,\" from marketing, sales, training, and customer support. This can include a wide range of end-user collateral, such as online help systems, training guides and tutorials, and support documentation. \n \nA technical writer can also improve the internal communications in your development process. Examples include producing clear product specifications, developing use case analysis, diagramming architecture and data flow, and assisting with user interface design, or quality assurance. \n \nAs a technical writer, I provide easy and painless user assistance documentation right where it's needed - and in whatever forms that work best for you and your audience. I have a wide breadth of experience in many industries, including high-tech. \n \nI have produced entire publication sets online in HTML, Windows Help, embedded UI help, and PDF formats. I have mastered the best methods for technical communication, and have consulted at many of the high profile corporations in Portland and the greater Pacific Northwest area. \n \nSpecialties: Help systems for consumer electronics products, banking information systems, health insurance information systems, retail information systems, manufacturing supply chain infrastructure, secure networking, UNIX and Windows architecture, QA methodologies, translation and localization, single-sourcing methodologies, HTML, PDF, Word, FrontPage, Visio, Illustrator, many others. Your first line of defense from expensive customer support calls is providing great customer documentation. Great documentation is the result of developing and applying three principles: \n1. Developing a thorough understanding of your audience. \n2. Developing a thorough understanding of how your product or service fulfills a need. \n3. Creating a documentation plan to provide just enough information at just the right time and place. \n \nThat's where a technical writer comes in. \n \nTechnical writers and communicators provide various commodities of the \"Total User Experience,\" from marketing, sales, training, and customer support. This can include a wide range of end-user collateral, such as online help systems, training guides and tutorials, and support documentation. \n \nA technical writer can also improve the internal communications in your development process. Examples include producing clear product specifications, developing use case analysis, diagramming architecture and data flow, and assisting with user interface design, or quality assurance. \n \nAs a technical writer, I provide easy and painless user assistance documentation right where it's needed - and in whatever forms that work best for you and your audience. I have a wide breadth of experience in many industries, including high-tech. \n \nI have produced entire publication sets online in HTML, Windows Help, embedded UI help, and PDF formats. I have mastered the best methods for technical communication, and have consulted at many of the high profile corporations in Portland and the greater Pacific Northwest area. \n \nSpecialties: Help systems for consumer electronics products, banking information systems, health insurance information systems, retail information systems, manufacturing supply chain infrastructure, secure networking, UNIX and Windows architecture, QA methodologies, translation and localization, single-sourcing methodologies, HTML, PDF, Word, FrontPage, Visio, Illustrator, many others. Your first line of defense from expensive customer support calls is providing great customer documentation. Great documentation is the result of developing and applying three principles: \n1. Developing a thorough understanding of your audience. \n2. Developing a thorough understanding of how your product or service fulfills a need. \n3. Creating a documentation plan to provide just enough information at just the right time and place. \n \nThat's where a technical writer comes in. \n \nTechnical writers and communicators provide various commodities of the \"Total User Experience,\" from marketing, sales, training, and customer support. This can include a wide range of end-user collateral, such as online help systems, training guides and tutorials, and support documentation. \n \nA technical writer can also improve the internal communications in your development process. Examples include producing clear product specifications, developing use case analysis, diagramming architecture and data flow, and assisting with user interface design, or quality assurance. \n \nAs a technical writer, I provide easy and painless user assistance documentation right where it's needed - and in whatever forms that work best for you and your audience. I have a wide breadth of experience in many industries, including high-tech. \n \nI have produced entire publication sets online in HTML, Windows Help, embedded UI help, and PDF formats. I have mastered the best methods for technical communication, and have consulted at many of the high profile corporations in Portland and the greater Pacific Northwest area. \n \nSpecialties: Help systems for consumer electronics products, banking information systems, health insurance information systems, retail information systems, manufacturing supply chain infrastructure, secure networking, UNIX and Windows architecture, QA methodologies, translation and localization, single-sourcing methodologies, HTML, PDF, Word, FrontPage, Visio, Illustrator, many others. Experience Technical writer Vesta Corporation July 2014  –  February 2015  (8 months) Tigard, OR Continuing to add content to the documents I created during my last assignment here. In addition: \nCreated a content specification for Vesta's web re-launch. This included specific marketing messages that highlight Vesta's flagship PaaS, including concept introduction, selling points, and stand-out in a crowded market. \nCreated another content specification for the web portal for Vesta's vSafe product. This included a user guide, contextual help pop-ups, concepts and procedures. \nWhat sets this job apart was my growing fascination and enthusiasm to learn all about their PaaS offering, and the industry overall, such that I was able to create a series of authoritative articles and white papers. \nContracting at Vesta via ProKarma staffing agency. Technical Writer Vesta Corporation February 2014  –  April 2014  (3 months) Portland, Oregon Area Produced a set of documentation for a payment processing gateway. This included API specifications, use case scenarios, test cases, call flow diagrams. Covered security topics for financial data handling, including PCI compliance. Technical details on how to implement and deploy payment processing, and detect and handle fraud, including detecting identity theft. Worked with web redesign group to design content and user experience. \nContracting at Vesta via ProKarma staffing agency. Technical writer Intel Corporation May 2012  –  November 2013  (1 year 7 months) Hillsboro - Produced a set of software installation procedures. This consisted of 100 HTML con-ceptual and procedural pages, including screen captures, tables and diagrams. \nTarget audience: Software developers.  \nSoftware tools: Designer, SharePoint, Visio, SQL Server Management Studio. \n- Produced a set of disaster recovery procedural documents. These documents had high visibility within the IT management team, and were tested in a “desk exercise” for accuracy and readability. \nTarget audience: IT disaster recovery technical team. \nSoftware tools: Word, SharePoint, Visio, Excel. \n- Consolidated technical support information from diverse locations and formats, including interviews with developers, into a developer-centric Wiki. It covered enterprise software packages and configuration and integration topics on HP Quality Center (HPQC), Jama Contour, and many internally developed software tools. \n- Produced a set of “gold build” installation reference guides for building from the ground-up, the product lifecycle management (PLC) and requirements traceability software product used at Intel. \n- Produce Knowledge Articles in ServiceNow for JIRA project management system. \nTarget Audience: IT Help Desk, level 1 & 2. \nSoftware tools: ServiceNow, JIRA. \nContracting to Intel via Everest Consulting agency. Technical Writer Xerox June 2008  –  September 2011  (3 years 4 months) Portland, Oregon Area Created online help systems for workgroup laser and solid ink printers using a single-source content management system. Manage multiple simultaneous versions in a product family, as well as multiple languages for international support. \nContracting to Xerox via Addecco Technical, and Vanderhouwen & Associates staffing agencies. Technical Writer The Standard February 2008  –  June 2008  (5 months) Portland, Oregon Area Create user documentation for a new enterprise billing and invoicing system. \nContracting at The Standard via Vanderhouwen & Associates staffing agency. Technical Writer Regence Blue Cross Blue Shield of Oregon May 2007  –  December 2007  (8 months) Portland, Oregon Area Produced disaster recovery procedural documents for the company’s IT systems and infrastructure. Worked with teams over long distances. Audience is the company’s internal IT recovery team. \nContracting at Regence BCBS via Modis staffing agency, Technical Writer ADP Dealer Services August 2006  –  November 2006  (4 months) Portland, Oregon Area Produced several software technical specifications, Statement of Work documents, and internal architectural specifications to coordinate business activities with ADP’s financial businesses partners. Produced disaster recovery and escalation procedures documents to support and co-ordinate I.T. and technical service departments. Helped to re-purpose aging technical documents into an internal Wikipedia. \nContracting at ADP Dealer Services via Modis staffing agency. Information Engineer Intel August 2000  –  April 2006  (5 years 9 months) Managed user documentation projects for retail and OEM. Technical contributor in team projects, design and produce user guides, embedded help files and web pages for networking products supported across multiple operating systems. Produced a documentation architecture specification to help technical writers determine content and presentation method for new tech pubs projects. Web Developer Bergfreunde Ski Club September 1998  –  March 2002  (3 years 7 months) Designed, published and maintained website, featuring hundreds of HTML content pages. Technical Writer Consolidated Freightways (via Modis staffing agency) 1999  –  1999  (less than a year) Portland, Oregon Area Technical Writer Intel Corporation (via CDS staffing agency) July 1996  –  February 1998  (1 year 8 months) Portland, Oregon Area Produce a set of user guides to cover a set of data analysis tools to support the SAP-based supply chain management system. The resulting document was nearly 250 pages, and simultaneously published in paper, PDF and Windows Help formats. Technical writer Vesta Corporation July 2014  –  February 2015  (8 months) Tigard, OR Continuing to add content to the documents I created during my last assignment here. In addition: \nCreated a content specification for Vesta's web re-launch. This included specific marketing messages that highlight Vesta's flagship PaaS, including concept introduction, selling points, and stand-out in a crowded market. \nCreated another content specification for the web portal for Vesta's vSafe product. This included a user guide, contextual help pop-ups, concepts and procedures. \nWhat sets this job apart was my growing fascination and enthusiasm to learn all about their PaaS offering, and the industry overall, such that I was able to create a series of authoritative articles and white papers. \nContracting at Vesta via ProKarma staffing agency. Technical writer Vesta Corporation July 2014  –  February 2015  (8 months) Tigard, OR Continuing to add content to the documents I created during my last assignment here. In addition: \nCreated a content specification for Vesta's web re-launch. This included specific marketing messages that highlight Vesta's flagship PaaS, including concept introduction, selling points, and stand-out in a crowded market. \nCreated another content specification for the web portal for Vesta's vSafe product. This included a user guide, contextual help pop-ups, concepts and procedures. \nWhat sets this job apart was my growing fascination and enthusiasm to learn all about their PaaS offering, and the industry overall, such that I was able to create a series of authoritative articles and white papers. \nContracting at Vesta via ProKarma staffing agency. Technical Writer Vesta Corporation February 2014  –  April 2014  (3 months) Portland, Oregon Area Produced a set of documentation for a payment processing gateway. This included API specifications, use case scenarios, test cases, call flow diagrams. Covered security topics for financial data handling, including PCI compliance. Technical details on how to implement and deploy payment processing, and detect and handle fraud, including detecting identity theft. Worked with web redesign group to design content and user experience. \nContracting at Vesta via ProKarma staffing agency. Technical Writer Vesta Corporation February 2014  –  April 2014  (3 months) Portland, Oregon Area Produced a set of documentation for a payment processing gateway. This included API specifications, use case scenarios, test cases, call flow diagrams. Covered security topics for financial data handling, including PCI compliance. Technical details on how to implement and deploy payment processing, and detect and handle fraud, including detecting identity theft. Worked with web redesign group to design content and user experience. \nContracting at Vesta via ProKarma staffing agency. Technical writer Intel Corporation May 2012  –  November 2013  (1 year 7 months) Hillsboro - Produced a set of software installation procedures. This consisted of 100 HTML con-ceptual and procedural pages, including screen captures, tables and diagrams. \nTarget audience: Software developers.  \nSoftware tools: Designer, SharePoint, Visio, SQL Server Management Studio. \n- Produced a set of disaster recovery procedural documents. These documents had high visibility within the IT management team, and were tested in a “desk exercise” for accuracy and readability. \nTarget audience: IT disaster recovery technical team. \nSoftware tools: Word, SharePoint, Visio, Excel. \n- Consolidated technical support information from diverse locations and formats, including interviews with developers, into a developer-centric Wiki. It covered enterprise software packages and configuration and integration topics on HP Quality Center (HPQC), Jama Contour, and many internally developed software tools. \n- Produced a set of “gold build” installation reference guides for building from the ground-up, the product lifecycle management (PLC) and requirements traceability software product used at Intel. \n- Produce Knowledge Articles in ServiceNow for JIRA project management system. \nTarget Audience: IT Help Desk, level 1 & 2. \nSoftware tools: ServiceNow, JIRA. \nContracting to Intel via Everest Consulting agency. Technical writer Intel Corporation May 2012  –  November 2013  (1 year 7 months) Hillsboro - Produced a set of software installation procedures. This consisted of 100 HTML con-ceptual and procedural pages, including screen captures, tables and diagrams. \nTarget audience: Software developers.  \nSoftware tools: Designer, SharePoint, Visio, SQL Server Management Studio. \n- Produced a set of disaster recovery procedural documents. These documents had high visibility within the IT management team, and were tested in a “desk exercise” for accuracy and readability. \nTarget audience: IT disaster recovery technical team. \nSoftware tools: Word, SharePoint, Visio, Excel. \n- Consolidated technical support information from diverse locations and formats, including interviews with developers, into a developer-centric Wiki. It covered enterprise software packages and configuration and integration topics on HP Quality Center (HPQC), Jama Contour, and many internally developed software tools. \n- Produced a set of “gold build” installation reference guides for building from the ground-up, the product lifecycle management (PLC) and requirements traceability software product used at Intel. \n- Produce Knowledge Articles in ServiceNow for JIRA project management system. \nTarget Audience: IT Help Desk, level 1 & 2. \nSoftware tools: ServiceNow, JIRA. \nContracting to Intel via Everest Consulting agency. Technical Writer Xerox June 2008  –  September 2011  (3 years 4 months) Portland, Oregon Area Created online help systems for workgroup laser and solid ink printers using a single-source content management system. Manage multiple simultaneous versions in a product family, as well as multiple languages for international support. \nContracting to Xerox via Addecco Technical, and Vanderhouwen & Associates staffing agencies. Technical Writer Xerox June 2008  –  September 2011  (3 years 4 months) Portland, Oregon Area Created online help systems for workgroup laser and solid ink printers using a single-source content management system. Manage multiple simultaneous versions in a product family, as well as multiple languages for international support. \nContracting to Xerox via Addecco Technical, and Vanderhouwen & Associates staffing agencies. Technical Writer The Standard February 2008  –  June 2008  (5 months) Portland, Oregon Area Create user documentation for a new enterprise billing and invoicing system. \nContracting at The Standard via Vanderhouwen & Associates staffing agency. Technical Writer The Standard February 2008  –  June 2008  (5 months) Portland, Oregon Area Create user documentation for a new enterprise billing and invoicing system. \nContracting at The Standard via Vanderhouwen & Associates staffing agency. Technical Writer Regence Blue Cross Blue Shield of Oregon May 2007  –  December 2007  (8 months) Portland, Oregon Area Produced disaster recovery procedural documents for the company’s IT systems and infrastructure. Worked with teams over long distances. Audience is the company’s internal IT recovery team. \nContracting at Regence BCBS via Modis staffing agency, Technical Writer Regence Blue Cross Blue Shield of Oregon May 2007  –  December 2007  (8 months) Portland, Oregon Area Produced disaster recovery procedural documents for the company’s IT systems and infrastructure. Worked with teams over long distances. Audience is the company’s internal IT recovery team. \nContracting at Regence BCBS via Modis staffing agency, Technical Writer ADP Dealer Services August 2006  –  November 2006  (4 months) Portland, Oregon Area Produced several software technical specifications, Statement of Work documents, and internal architectural specifications to coordinate business activities with ADP’s financial businesses partners. Produced disaster recovery and escalation procedures documents to support and co-ordinate I.T. and technical service departments. Helped to re-purpose aging technical documents into an internal Wikipedia. \nContracting at ADP Dealer Services via Modis staffing agency. Technical Writer ADP Dealer Services August 2006  –  November 2006  (4 months) Portland, Oregon Area Produced several software technical specifications, Statement of Work documents, and internal architectural specifications to coordinate business activities with ADP’s financial businesses partners. Produced disaster recovery and escalation procedures documents to support and co-ordinate I.T. and technical service departments. Helped to re-purpose aging technical documents into an internal Wikipedia. \nContracting at ADP Dealer Services via Modis staffing agency. Information Engineer Intel August 2000  –  April 2006  (5 years 9 months) Managed user documentation projects for retail and OEM. Technical contributor in team projects, design and produce user guides, embedded help files and web pages for networking products supported across multiple operating systems. Produced a documentation architecture specification to help technical writers determine content and presentation method for new tech pubs projects. Information Engineer Intel August 2000  –  April 2006  (5 years 9 months) Managed user documentation projects for retail and OEM. Technical contributor in team projects, design and produce user guides, embedded help files and web pages for networking products supported across multiple operating systems. Produced a documentation architecture specification to help technical writers determine content and presentation method for new tech pubs projects. Web Developer Bergfreunde Ski Club September 1998  –  March 2002  (3 years 7 months) Designed, published and maintained website, featuring hundreds of HTML content pages. Web Developer Bergfreunde Ski Club September 1998  –  March 2002  (3 years 7 months) Designed, published and maintained website, featuring hundreds of HTML content pages. Technical Writer Consolidated Freightways (via Modis staffing agency) 1999  –  1999  (less than a year) Portland, Oregon Area Technical Writer Consolidated Freightways (via Modis staffing agency) 1999  –  1999  (less than a year) Portland, Oregon Area Technical Writer Intel Corporation (via CDS staffing agency) July 1996  –  February 1998  (1 year 8 months) Portland, Oregon Area Produce a set of user guides to cover a set of data analysis tools to support the SAP-based supply chain management system. The resulting document was nearly 250 pages, and simultaneously published in paper, PDF and Windows Help formats. Technical Writer Intel Corporation (via CDS staffing agency) July 1996  –  February 1998  (1 year 8 months) Portland, Oregon Area Produce a set of user guides to cover a set of data analysis tools to support the SAP-based supply chain management system. The resulting document was nearly 250 pages, and simultaneously published in paper, PDF and Windows Help formats. Skills Visio FrontPage HTML Illustrator Pdf Online Help Single Sourcing MadCap Flare Microsoft Office Adobe Acrobat Dreamweaver SharePoint AuthorIt SourceSafe Instructional Design Technical Writing Author-it Usability Testing Software Documentation RoboHelp Technical Documentation Manuals FrameMaker Technical Communication See 9+     See less Skills  Visio FrontPage HTML Illustrator Pdf Online Help Single Sourcing MadCap Flare Microsoft Office Adobe Acrobat Dreamweaver SharePoint AuthorIt SourceSafe Instructional Design Technical Writing Author-it Usability Testing Software Documentation RoboHelp Technical Documentation Manuals FrameMaker Technical Communication See 9+     See less Visio FrontPage HTML Illustrator Pdf Online Help Single Sourcing MadCap Flare Microsoft Office Adobe Acrobat Dreamweaver SharePoint AuthorIt SourceSafe Instructional Design Technical Writing Author-it Usability Testing Software Documentation RoboHelp Technical Documentation Manuals FrameMaker Technical Communication See 9+     See less Visio FrontPage HTML Illustrator Pdf Online Help Single Sourcing MadCap Flare Microsoft Office Adobe Acrobat Dreamweaver SharePoint AuthorIt SourceSafe Instructional Design Technical Writing Author-it Usability Testing Software Documentation RoboHelp Technical Documentation Manuals FrameMaker Technical Communication See 9+     See less Education Portland State University Computer Science 1982  – 1984 Portland Community College Associates,  Computer Science 1980  – 1982 Portland State University Computer Science 1982  – 1984 Portland State University Computer Science 1982  – 1984 Portland State University Computer Science 1982  – 1984 Portland Community College Associates,  Computer Science 1980  – 1982 Portland Community College Associates,  Computer Science 1980  – 1982 Portland Community College Associates,  Computer Science 1980  – 1982 ", "Summary Technical writer with experience in hardware and software documentation. Primarily favor XML-based methods of document production. Specialties:HTML, XML, Online Help Summary Technical writer with experience in hardware and software documentation. Primarily favor XML-based methods of document production. Specialties:HTML, XML, Online Help Technical writer with experience in hardware and software documentation. Primarily favor XML-based methods of document production. Specialties:HTML, XML, Online Help Technical writer with experience in hardware and software documentation. Primarily favor XML-based methods of document production. Specialties:HTML, XML, Online Help Experience Senior Technical Writer Intel Corporation November 2014  – Present (10 months) Senior Technical Writer Avago Technologies May 2014  –  November 2014  (7 months) Senior Technical Writer LSI Corporation October 2012  –  May 2014  (1 year 8 months) Austin, Texas Area Senior Technical Writer Volunteer Run Free Texas November 2012  –  March 2014  (1 year 5 months) Work with at-risk youth one night a week to help teach them ways physical activity can help improve their lives. Technical Marketing Writer SolarWinds April 2011  –  October 2012  (1 year 7 months) Technical Writer NetLogic Microsystems 2009  –  2011  (2 years) Technical Writer RMI Corporation November 2007  –  2011  (4 years) Technical Writer Pyxis November 2005  –  June 2007  (1 year 8 months) Advanced Technical Writer Altera January 2005  –  November 2005  (11 months) Senior Technical Writer KLA-Tencor 2001  –  2005  (4 years) eNewsletter Coordinator WetFeet.com 2000  –  2000  (less than a year) Senior Technical Writer Intel Corporation November 2014  – Present (10 months) Senior Technical Writer Intel Corporation November 2014  – Present (10 months) Senior Technical Writer Avago Technologies May 2014  –  November 2014  (7 months) Senior Technical Writer Avago Technologies May 2014  –  November 2014  (7 months) Senior Technical Writer LSI Corporation October 2012  –  May 2014  (1 year 8 months) Austin, Texas Area Senior Technical Writer Senior Technical Writer LSI Corporation October 2012  –  May 2014  (1 year 8 months) Austin, Texas Area Senior Technical Writer Volunteer Run Free Texas November 2012  –  March 2014  (1 year 5 months) Work with at-risk youth one night a week to help teach them ways physical activity can help improve their lives. Volunteer Run Free Texas November 2012  –  March 2014  (1 year 5 months) Work with at-risk youth one night a week to help teach them ways physical activity can help improve their lives. Technical Marketing Writer SolarWinds April 2011  –  October 2012  (1 year 7 months) Technical Marketing Writer SolarWinds April 2011  –  October 2012  (1 year 7 months) Technical Writer NetLogic Microsystems 2009  –  2011  (2 years) Technical Writer NetLogic Microsystems 2009  –  2011  (2 years) Technical Writer RMI Corporation November 2007  –  2011  (4 years) Technical Writer RMI Corporation November 2007  –  2011  (4 years) Technical Writer Pyxis November 2005  –  June 2007  (1 year 8 months) Technical Writer Pyxis November 2005  –  June 2007  (1 year 8 months) Advanced Technical Writer Altera January 2005  –  November 2005  (11 months) Advanced Technical Writer Altera January 2005  –  November 2005  (11 months) Senior Technical Writer KLA-Tencor 2001  –  2005  (4 years) Senior Technical Writer KLA-Tencor 2001  –  2005  (4 years) eNewsletter Coordinator WetFeet.com 2000  –  2000  (less than a year) eNewsletter Coordinator WetFeet.com 2000  –  2000  (less than a year) Skills RoboHelp Training Software Documentation XMetal HTML Technical Documentation FrameMaker Online Help FrontPage Technical Writing SnagIt Structured Authoring XML Online Help Development Technical Communication Visio Single Sourcing Adobe Acrobat DITA Product Management Release Notes Manuals Content Management See 8+     See less Skills  RoboHelp Training Software Documentation XMetal HTML Technical Documentation FrameMaker Online Help FrontPage Technical Writing SnagIt Structured Authoring XML Online Help Development Technical Communication Visio Single Sourcing Adobe Acrobat DITA Product Management Release Notes Manuals Content Management See 8+     See less RoboHelp Training Software Documentation XMetal HTML Technical Documentation FrameMaker Online Help FrontPage Technical Writing SnagIt Structured Authoring XML Online Help Development Technical Communication Visio Single Sourcing Adobe Acrobat DITA Product Management Release Notes Manuals Content Management See 8+     See less RoboHelp Training Software Documentation XMetal HTML Technical Documentation FrameMaker Online Help FrontPage Technical Writing SnagIt Structured Authoring XML Online Help Development Technical Communication Visio Single Sourcing Adobe Acrobat DITA Product Management Release Notes Manuals Content Management See 8+     See less Education Southeastern Louisiana University 1998  – 2000 California State University-East Bay BA,  English 1995  – 1998 Bonnabel 1986  – 1988 Southeastern Louisiana University 1998  – 2000 Southeastern Louisiana University 1998  – 2000 Southeastern Louisiana University 1998  – 2000 California State University-East Bay BA,  English 1995  – 1998 California State University-East Bay BA,  English 1995  – 1998 California State University-East Bay BA,  English 1995  – 1998 Bonnabel 1986  – 1988 Bonnabel 1986  – 1988 Bonnabel 1986  – 1988 Honors & Awards Additional Honors & Awards Presented paper at STC conference as graduate student. Additional Honors & Awards Presented paper at STC conference as graduate student. Additional Honors & Awards Presented paper at STC conference as graduate student. Additional Honors & Awards Presented paper at STC conference as graduate student. ", "Experience Technical Writer VersaLogic Corporation October 2014  – Present (11 months) Tualatin, Oregon Technical Writer VersaLogic Corporation October 2014  – Present (11 months) Tualatin, Oregon Technical Writer VersaLogic Corporation October 2014  – Present (11 months) Tualatin, Oregon Skills Technical Documentation Technical Writing Technical Communication Hardware Content Management Manuals Software Documentation Electronics Testing Editing Program Management Semiconductors Troubleshooting Information Architecture Visio Cross-functional Team... Process Improvement See 2+     See less Skills  Technical Documentation Technical Writing Technical Communication Hardware Content Management Manuals Software Documentation Electronics Testing Editing Program Management Semiconductors Troubleshooting Information Architecture Visio Cross-functional Team... Process Improvement See 2+     See less Technical Documentation Technical Writing Technical Communication Hardware Content Management Manuals Software Documentation Electronics Testing Editing Program Management Semiconductors Troubleshooting Information Architecture Visio Cross-functional Team... Process Improvement See 2+     See less Technical Documentation Technical Writing Technical Communication Hardware Content Management Manuals Software Documentation Electronics Testing Editing Program Management Semiconductors Troubleshooting Information Architecture Visio Cross-functional Team... Process Improvement See 2+     See less ", "Summary Self-motivated Senior Technical Writer / Project Manager with proven success in leading teams, people and projects, and extensive experience in all phases of Software Development Life Cycle, technical architecture, and operations. Consistently produces well-written print and web-based content for internal and end-user audiences. Demonstrated strength in effectively communicating with cross-functional teams, subject matter experts and target audiences while successfully integrating customer concerns and requirements into clearly written material. Hands-on project management experience from inception to launch. \n \nExpertise includes:  \n• Technical Documentation / Training \n• Cross-Function Communication \n• Needs Assessment \n• System / User Interface Design \n• Troubleshooting / Problem Solving \n• Software Development \n• Project Management \n• People Management \n• Mentoring and Professional Development \n \n \ndmj464@gmail.com \n503-380-4191 Summary Self-motivated Senior Technical Writer / Project Manager with proven success in leading teams, people and projects, and extensive experience in all phases of Software Development Life Cycle, technical architecture, and operations. Consistently produces well-written print and web-based content for internal and end-user audiences. Demonstrated strength in effectively communicating with cross-functional teams, subject matter experts and target audiences while successfully integrating customer concerns and requirements into clearly written material. Hands-on project management experience from inception to launch. \n \nExpertise includes:  \n• Technical Documentation / Training \n• Cross-Function Communication \n• Needs Assessment \n• System / User Interface Design \n• Troubleshooting / Problem Solving \n• Software Development \n• Project Management \n• People Management \n• Mentoring and Professional Development \n \n \ndmj464@gmail.com \n503-380-4191 Self-motivated Senior Technical Writer / Project Manager with proven success in leading teams, people and projects, and extensive experience in all phases of Software Development Life Cycle, technical architecture, and operations. Consistently produces well-written print and web-based content for internal and end-user audiences. Demonstrated strength in effectively communicating with cross-functional teams, subject matter experts and target audiences while successfully integrating customer concerns and requirements into clearly written material. Hands-on project management experience from inception to launch. \n \nExpertise includes:  \n• Technical Documentation / Training \n• Cross-Function Communication \n• Needs Assessment \n• System / User Interface Design \n• Troubleshooting / Problem Solving \n• Software Development \n• Project Management \n• People Management \n• Mentoring and Professional Development \n \n \ndmj464@gmail.com \n503-380-4191 Self-motivated Senior Technical Writer / Project Manager with proven success in leading teams, people and projects, and extensive experience in all phases of Software Development Life Cycle, technical architecture, and operations. Consistently produces well-written print and web-based content for internal and end-user audiences. Demonstrated strength in effectively communicating with cross-functional teams, subject matter experts and target audiences while successfully integrating customer concerns and requirements into clearly written material. Hands-on project management experience from inception to launch. \n \nExpertise includes:  \n• Technical Documentation / Training \n• Cross-Function Communication \n• Needs Assessment \n• System / User Interface Design \n• Troubleshooting / Problem Solving \n• Software Development \n• Project Management \n• People Management \n• Mentoring and Professional Development \n \n \ndmj464@gmail.com \n503-380-4191 Experience Sr. Technical Writer Intel Corporation January 2015  – Present (8 months) Hillsboro, OR Developing and maintaining datasheets, specifications, product briefs, application notes, and other related documentation for Intel’s Ethernet controllers, adapters and related networking hardware. Contract Technical Writer Intel Corporation via Experis Manpower Group March 2013  –  January 2015  (1 year 11 months) Hillsboro, OR Developing and maintaining datasheets, specifications, product briefs, application notes, and other related documentation for Intel’s Ethernet controllers, adapters and related networking hardware. Development Manager, Software Apps ADP Dealer Services March 2003  –  November 2012  (9 years 9 months) Portland, Oregon Led a team of Software Engineers and an Online Help Architect in providing infrastructure support for centralized Technical Publications group and cloud-based delivery of online help, printed documentation and training materials. Managed multiple projects from inception to launch. Managed a team of Technical Writers responsible for end-user and support-based product documentation. Focused on project management, process improvement, standards definition, cost reduction and user support. \n \n• Managed and served as an integral part of Infrastructure Engineering team providing tools, processes and support for centralized Documentation and Training Development group, resulting in improved productivity through increased focus on content development. \n \n• Implemented and managed web-based documentation / training delivery to all end-user clients and support personnel, which enabled on-demand access to product / process documentation. \n \n• Reduced application suite disc space requirements 30% by implementing a cloud-based online help model. \n \n• Saved the company $150K in the first year by implementing cloud-based online help for ADP Dealer Management Systems applications. Development Supervisor ADP Dealer Services January 2001  –  March 2003  (2 years 3 months) Portland, Oregon Directed a team of Software Engineers to provide infrastructure support for the centralized Technical Publications group, and provide web-based delivery of end-user and support-based product and process documentation. Managed multiple projects from inception to launch. \n \n• Assembled and managed an Infrastructure Engineering team providing tools, processes and support for centralized Documentation and Training Development group, resulting in productivity gains through increased focus on content development. \n \n• Led cross-functional team to implement internal documentation publishing system, providing a foundation for the move from print-based reproduction and distribution to web-based content delivery. \n \n• Reduced documentation reproduction costs by implementing PDF-based documentation delivery. \n \n• Saved the company $180K annually by moving subscription-based support documentation from CD / DVD-based to web-based delivery. Senior Technical Writer/Project Lead ADP Dealer Services May 1998  –  December 2000  (2 years 8 months) Portland, Oregon Wrote, maintained and coordinated print and online documentation for the UNIX system software portion of ADP’s turnkey automotive Dealership Management Systems. As project lead, developed plans and detailed schedules; and coordinated / monitored the work of other writers. Technical Writer Network Associates November 1994  –  April 1998  (3 years 6 months) Beaverton, Oregon Authored, maintained and coordinated all related printed and web-based documentation / online help for one of NAI’s network monitoring and analysis applications for both UNIX and Windows platforms. As Project Lead, developed plans, functional specifications, and detailed schedules, while coordinating and monitoring the work of other writers. Additional responsibilities included Acting Manager during an eight-week sabbatical. Technical Writer Mentor Graphics July 1988  –  November 1994  (6 years 5 months) Wilsonville, Oregon Wrote and maintained several manuals and training materials in the Mentor Graphics Logic Synthesis and Timing Analysis product lines, involving VHDL Synthesis, Schematic Capture, Timing Analysis, and Top-Down Electronic Design applications. Sr. Technical Writer Intel Corporation January 2015  – Present (8 months) Hillsboro, OR Developing and maintaining datasheets, specifications, product briefs, application notes, and other related documentation for Intel’s Ethernet controllers, adapters and related networking hardware. Sr. Technical Writer Intel Corporation January 2015  – Present (8 months) Hillsboro, OR Developing and maintaining datasheets, specifications, product briefs, application notes, and other related documentation for Intel’s Ethernet controllers, adapters and related networking hardware. Contract Technical Writer Intel Corporation via Experis Manpower Group March 2013  –  January 2015  (1 year 11 months) Hillsboro, OR Developing and maintaining datasheets, specifications, product briefs, application notes, and other related documentation for Intel’s Ethernet controllers, adapters and related networking hardware. Contract Technical Writer Intel Corporation via Experis Manpower Group March 2013  –  January 2015  (1 year 11 months) Hillsboro, OR Developing and maintaining datasheets, specifications, product briefs, application notes, and other related documentation for Intel’s Ethernet controllers, adapters and related networking hardware. Development Manager, Software Apps ADP Dealer Services March 2003  –  November 2012  (9 years 9 months) Portland, Oregon Led a team of Software Engineers and an Online Help Architect in providing infrastructure support for centralized Technical Publications group and cloud-based delivery of online help, printed documentation and training materials. Managed multiple projects from inception to launch. Managed a team of Technical Writers responsible for end-user and support-based product documentation. Focused on project management, process improvement, standards definition, cost reduction and user support. \n \n• Managed and served as an integral part of Infrastructure Engineering team providing tools, processes and support for centralized Documentation and Training Development group, resulting in improved productivity through increased focus on content development. \n \n• Implemented and managed web-based documentation / training delivery to all end-user clients and support personnel, which enabled on-demand access to product / process documentation. \n \n• Reduced application suite disc space requirements 30% by implementing a cloud-based online help model. \n \n• Saved the company $150K in the first year by implementing cloud-based online help for ADP Dealer Management Systems applications. Development Manager, Software Apps ADP Dealer Services March 2003  –  November 2012  (9 years 9 months) Portland, Oregon Led a team of Software Engineers and an Online Help Architect in providing infrastructure support for centralized Technical Publications group and cloud-based delivery of online help, printed documentation and training materials. Managed multiple projects from inception to launch. Managed a team of Technical Writers responsible for end-user and support-based product documentation. Focused on project management, process improvement, standards definition, cost reduction and user support. \n \n• Managed and served as an integral part of Infrastructure Engineering team providing tools, processes and support for centralized Documentation and Training Development group, resulting in improved productivity through increased focus on content development. \n \n• Implemented and managed web-based documentation / training delivery to all end-user clients and support personnel, which enabled on-demand access to product / process documentation. \n \n• Reduced application suite disc space requirements 30% by implementing a cloud-based online help model. \n \n• Saved the company $150K in the first year by implementing cloud-based online help for ADP Dealer Management Systems applications. Development Supervisor ADP Dealer Services January 2001  –  March 2003  (2 years 3 months) Portland, Oregon Directed a team of Software Engineers to provide infrastructure support for the centralized Technical Publications group, and provide web-based delivery of end-user and support-based product and process documentation. Managed multiple projects from inception to launch. \n \n• Assembled and managed an Infrastructure Engineering team providing tools, processes and support for centralized Documentation and Training Development group, resulting in productivity gains through increased focus on content development. \n \n• Led cross-functional team to implement internal documentation publishing system, providing a foundation for the move from print-based reproduction and distribution to web-based content delivery. \n \n• Reduced documentation reproduction costs by implementing PDF-based documentation delivery. \n \n• Saved the company $180K annually by moving subscription-based support documentation from CD / DVD-based to web-based delivery. Development Supervisor ADP Dealer Services January 2001  –  March 2003  (2 years 3 months) Portland, Oregon Directed a team of Software Engineers to provide infrastructure support for the centralized Technical Publications group, and provide web-based delivery of end-user and support-based product and process documentation. Managed multiple projects from inception to launch. \n \n• Assembled and managed an Infrastructure Engineering team providing tools, processes and support for centralized Documentation and Training Development group, resulting in productivity gains through increased focus on content development. \n \n• Led cross-functional team to implement internal documentation publishing system, providing a foundation for the move from print-based reproduction and distribution to web-based content delivery. \n \n• Reduced documentation reproduction costs by implementing PDF-based documentation delivery. \n \n• Saved the company $180K annually by moving subscription-based support documentation from CD / DVD-based to web-based delivery. Senior Technical Writer/Project Lead ADP Dealer Services May 1998  –  December 2000  (2 years 8 months) Portland, Oregon Wrote, maintained and coordinated print and online documentation for the UNIX system software portion of ADP’s turnkey automotive Dealership Management Systems. As project lead, developed plans and detailed schedules; and coordinated / monitored the work of other writers. Senior Technical Writer/Project Lead ADP Dealer Services May 1998  –  December 2000  (2 years 8 months) Portland, Oregon Wrote, maintained and coordinated print and online documentation for the UNIX system software portion of ADP’s turnkey automotive Dealership Management Systems. As project lead, developed plans and detailed schedules; and coordinated / monitored the work of other writers. Technical Writer Network Associates November 1994  –  April 1998  (3 years 6 months) Beaverton, Oregon Authored, maintained and coordinated all related printed and web-based documentation / online help for one of NAI’s network monitoring and analysis applications for both UNIX and Windows platforms. As Project Lead, developed plans, functional specifications, and detailed schedules, while coordinating and monitoring the work of other writers. Additional responsibilities included Acting Manager during an eight-week sabbatical. Technical Writer Network Associates November 1994  –  April 1998  (3 years 6 months) Beaverton, Oregon Authored, maintained and coordinated all related printed and web-based documentation / online help for one of NAI’s network monitoring and analysis applications for both UNIX and Windows platforms. As Project Lead, developed plans, functional specifications, and detailed schedules, while coordinating and monitoring the work of other writers. Additional responsibilities included Acting Manager during an eight-week sabbatical. Technical Writer Mentor Graphics July 1988  –  November 1994  (6 years 5 months) Wilsonville, Oregon Wrote and maintained several manuals and training materials in the Mentor Graphics Logic Synthesis and Timing Analysis product lines, involving VHDL Synthesis, Schematic Capture, Timing Analysis, and Top-Down Electronic Design applications. Technical Writer Mentor Graphics July 1988  –  November 1994  (6 years 5 months) Wilsonville, Oregon Wrote and maintained several manuals and training materials in the Mentor Graphics Logic Synthesis and Timing Analysis product lines, involving VHDL Synthesis, Schematic Capture, Timing Analysis, and Top-Down Electronic Design applications. Skills Agile Methodologies Scrum Software Development Program Management Test Driven Development Integration Software Project... Technical Writing Technical Documentation Team Leadership SharePoint Cross-functional Team... Project Management Troubleshooting Analysis Management Unix Training Online Help Testing SDLC Visio See 7+     See less Skills  Agile Methodologies Scrum Software Development Program Management Test Driven Development Integration Software Project... Technical Writing Technical Documentation Team Leadership SharePoint Cross-functional Team... Project Management Troubleshooting Analysis Management Unix Training Online Help Testing SDLC Visio See 7+     See less Agile Methodologies Scrum Software Development Program Management Test Driven Development Integration Software Project... Technical Writing Technical Documentation Team Leadership SharePoint Cross-functional Team... Project Management Troubleshooting Analysis Management Unix Training Online Help Testing SDLC Visio See 7+     See less Agile Methodologies Scrum Software Development Program Management Test Driven Development Integration Software Project... Technical Writing Technical Documentation Team Leadership SharePoint Cross-functional Team... Project Management Troubleshooting Analysis Management Unix Training Online Help Testing SDLC Visio See 7+     See less Education Oregon Institute of Technology BS,  Computer Systems Engineering Technology 1982  – 1988 Activities and Societies:  Phi Delta Theta Oregon Institute of Technology BS,  Industrial Management Technology 1992  – 1994 Oregon Institute of Technology BS,  Computer Systems Engineering Technology 1982  – 1988 Activities and Societies:  Phi Delta Theta Oregon Institute of Technology BS,  Computer Systems Engineering Technology 1982  – 1988 Activities and Societies:  Phi Delta Theta Oregon Institute of Technology BS,  Computer Systems Engineering Technology 1982  – 1988 Activities and Societies:  Phi Delta Theta Oregon Institute of Technology BS,  Industrial Management Technology 1992  – 1994 Oregon Institute of Technology BS,  Industrial Management Technology 1992  – 1994 Oregon Institute of Technology BS,  Industrial Management Technology 1992  – 1994 "]}