{"position": "Technical Project-Program Manager", "company": "Intel Corporation", "profiles": ["Languages Persian Persian Persian Skills Mobile Devices CDMA Mobile Communications LTE Wireless Mobile Technology GSM Telecommunications UMTS Product Management Program Management Software Project... Product Lifecycle... Software Development Cellular Communications Skills  Mobile Devices CDMA Mobile Communications LTE Wireless Mobile Technology GSM Telecommunications UMTS Product Management Program Management Software Project... Product Lifecycle... Software Development Cellular Communications Mobile Devices CDMA Mobile Communications LTE Wireless Mobile Technology GSM Telecommunications UMTS Product Management Program Management Software Project... Product Lifecycle... Software Development Cellular Communications Mobile Devices CDMA Mobile Communications LTE Wireless Mobile Technology GSM Telecommunications UMTS Product Management Program Management Software Project... Product Lifecycle... Software Development Cellular Communications ", "Skills Data Center CRM Cloud Computing Program Management Strategy PMP ITIL SDLC Project Management Business Process Business Analysis Management Pre-sales Project Portfolio... Disaster Recovery Change Management Security Leadership Virtualization Project Planning Go-to-market Strategy Consulting Storage See 8+     See less Skills  Data Center CRM Cloud Computing Program Management Strategy PMP ITIL SDLC Project Management Business Process Business Analysis Management Pre-sales Project Portfolio... Disaster Recovery Change Management Security Leadership Virtualization Project Planning Go-to-market Strategy Consulting Storage See 8+     See less Data Center CRM Cloud Computing Program Management Strategy PMP ITIL SDLC Project Management Business Process Business Analysis Management Pre-sales Project Portfolio... Disaster Recovery Change Management Security Leadership Virtualization Project Planning Go-to-market Strategy Consulting Storage See 8+     See less Data Center CRM Cloud Computing Program Management Strategy PMP ITIL SDLC Project Management Business Process Business Analysis Management Pre-sales Project Portfolio... Disaster Recovery Change Management Security Leadership Virtualization Project Planning Go-to-market Strategy Consulting Storage See 8+     See less ", "Summary I am an award-winning, solutions-oriented professional with demonstrated success leading large-scale, complex, enterprise projects using top-notch program and project management skills. I have experience across many disciplines including finance, human resources, and information technology. I excel at leading teams to consistently meet project deadlines and exceed expectations. I have keen business acumen with recognized talent for leveraging international, cross-functional resources to address business and operational needs leading to increased efficiency and productivity. I have successfully led teams to perform at high levels. I am passionate about process improvement and creating fun, team-oriented environments. Summary I am an award-winning, solutions-oriented professional with demonstrated success leading large-scale, complex, enterprise projects using top-notch program and project management skills. I have experience across many disciplines including finance, human resources, and information technology. I excel at leading teams to consistently meet project deadlines and exceed expectations. I have keen business acumen with recognized talent for leveraging international, cross-functional resources to address business and operational needs leading to increased efficiency and productivity. I have successfully led teams to perform at high levels. I am passionate about process improvement and creating fun, team-oriented environments. I am an award-winning, solutions-oriented professional with demonstrated success leading large-scale, complex, enterprise projects using top-notch program and project management skills. I have experience across many disciplines including finance, human resources, and information technology. I excel at leading teams to consistently meet project deadlines and exceed expectations. I have keen business acumen with recognized talent for leveraging international, cross-functional resources to address business and operational needs leading to increased efficiency and productivity. I have successfully led teams to perform at high levels. I am passionate about process improvement and creating fun, team-oriented environments. I am an award-winning, solutions-oriented professional with demonstrated success leading large-scale, complex, enterprise projects using top-notch program and project management skills. I have experience across many disciplines including finance, human resources, and information technology. I excel at leading teams to consistently meet project deadlines and exceed expectations. I have keen business acumen with recognized talent for leveraging international, cross-functional resources to address business and operational needs leading to increased efficiency and productivity. I have successfully led teams to perform at high levels. I am passionate about process improvement and creating fun, team-oriented environments. Experience Process Consultant and Program Manager Intel Corporation July 2015  – Present (2 months) Global Marketing and Communications Group Sr. Program Manager Intel Corporation 2014  – Present (1 year) Drive multiple Data Center Group programs simultaneously and work with key stakeholders to identify and implement lowest cost/risk solutions. Assess risk, identify issues, and partner cross-organizationally to resolve problems. Work with cross-functional teams to get organized and plan timelines to complete programs on time and on budget. Create, review, and approve user and technical requirements for completeness and clarity. Keep everybody on track towards the goal! Sr. Project Manager, IT and HR Intel Corporation 2002  –  2014  (12 years) •Over a 12 year period, drove planning, development and execution of enterprise IT and HR programs and projects. \n•Led cross-functional, multi-geo teams to implement enterprise tools used by 100K+ employees worldwide to make decisions related to hiring, content management, stock options, health benefits, pay and expenses, relocation and leaves of absence.  \n•Managed stakeholders from VP to first-line managers across multiple regulatory disciplines such as legal and finance. Product Line/Service Manager Intel Corporation 2011  –  2012  (1 year) •Technical owner of Learn and Develop service and online learning tools which receive 1.4M hits annually, include more than 8,000 active courses, and are used by 140,000 employees and contract workers. Partnered with service team to achieve customer satisfaction while reducing cost of ownership.  \n•Owned Intel relationship with vendor. \n•Successfully drove multi-year service roadmap and annual plans based on supply, demand, and portfolio priorities. \n•Point of escalation for all service related matters including major incidents. \n•Drove 45% internal incident reduction YOY. Usability Team Lead and Web Publisher Intel Corporation 2000  –  2002  (2 years) •Led user experience team that made improvements to HR content and online tools on Intel’s intranet.  \n•Developed and delivered usability training and coached team members on usability methodology and techniques.  \n•Analyzed usability needs, developed usability plans, recruited participants, and coordinated usability test schedules.  \n•Facilitated focus groups and usability sessions with employees; documented results and made design improvement recommendations to content owners and tool designers.  \n•Published HR content and forms to the intranet, partnering with content owners to receive information and ensure legal and fiduciary accuracy. Technical Writer/Training and Documentation Specialist Intel Corporation 1998  –  2000  (2 years) •Designed, developed, and coordinated training and documentation for Financial Services.  \n•Trained Financial Services employees worldwide. \n•Developed the Intel* Create & Share* Camera Pack User Manuals.  \n•Created online help systems for Intel® Email Postcard and Intel® Snapshot software applications Senior Administrative Assistant Intel Corporation December 1996  –  1998  (2 years) Process Consultant and Program Manager Intel Corporation July 2015  – Present (2 months) Global Marketing and Communications Group Process Consultant and Program Manager Intel Corporation July 2015  – Present (2 months) Global Marketing and Communications Group Sr. Program Manager Intel Corporation 2014  – Present (1 year) Drive multiple Data Center Group programs simultaneously and work with key stakeholders to identify and implement lowest cost/risk solutions. Assess risk, identify issues, and partner cross-organizationally to resolve problems. Work with cross-functional teams to get organized and plan timelines to complete programs on time and on budget. Create, review, and approve user and technical requirements for completeness and clarity. Keep everybody on track towards the goal! Sr. Program Manager Intel Corporation 2014  – Present (1 year) Drive multiple Data Center Group programs simultaneously and work with key stakeholders to identify and implement lowest cost/risk solutions. Assess risk, identify issues, and partner cross-organizationally to resolve problems. Work with cross-functional teams to get organized and plan timelines to complete programs on time and on budget. Create, review, and approve user and technical requirements for completeness and clarity. Keep everybody on track towards the goal! Sr. Project Manager, IT and HR Intel Corporation 2002  –  2014  (12 years) •Over a 12 year period, drove planning, development and execution of enterprise IT and HR programs and projects. \n•Led cross-functional, multi-geo teams to implement enterprise tools used by 100K+ employees worldwide to make decisions related to hiring, content management, stock options, health benefits, pay and expenses, relocation and leaves of absence.  \n•Managed stakeholders from VP to first-line managers across multiple regulatory disciplines such as legal and finance. Sr. Project Manager, IT and HR Intel Corporation 2002  –  2014  (12 years) •Over a 12 year period, drove planning, development and execution of enterprise IT and HR programs and projects. \n•Led cross-functional, multi-geo teams to implement enterprise tools used by 100K+ employees worldwide to make decisions related to hiring, content management, stock options, health benefits, pay and expenses, relocation and leaves of absence.  \n•Managed stakeholders from VP to first-line managers across multiple regulatory disciplines such as legal and finance. Product Line/Service Manager Intel Corporation 2011  –  2012  (1 year) •Technical owner of Learn and Develop service and online learning tools which receive 1.4M hits annually, include more than 8,000 active courses, and are used by 140,000 employees and contract workers. Partnered with service team to achieve customer satisfaction while reducing cost of ownership.  \n•Owned Intel relationship with vendor. \n•Successfully drove multi-year service roadmap and annual plans based on supply, demand, and portfolio priorities. \n•Point of escalation for all service related matters including major incidents. \n•Drove 45% internal incident reduction YOY. Product Line/Service Manager Intel Corporation 2011  –  2012  (1 year) •Technical owner of Learn and Develop service and online learning tools which receive 1.4M hits annually, include more than 8,000 active courses, and are used by 140,000 employees and contract workers. Partnered with service team to achieve customer satisfaction while reducing cost of ownership.  \n•Owned Intel relationship with vendor. \n•Successfully drove multi-year service roadmap and annual plans based on supply, demand, and portfolio priorities. \n•Point of escalation for all service related matters including major incidents. \n•Drove 45% internal incident reduction YOY. Usability Team Lead and Web Publisher Intel Corporation 2000  –  2002  (2 years) •Led user experience team that made improvements to HR content and online tools on Intel’s intranet.  \n•Developed and delivered usability training and coached team members on usability methodology and techniques.  \n•Analyzed usability needs, developed usability plans, recruited participants, and coordinated usability test schedules.  \n•Facilitated focus groups and usability sessions with employees; documented results and made design improvement recommendations to content owners and tool designers.  \n•Published HR content and forms to the intranet, partnering with content owners to receive information and ensure legal and fiduciary accuracy. Usability Team Lead and Web Publisher Intel Corporation 2000  –  2002  (2 years) •Led user experience team that made improvements to HR content and online tools on Intel’s intranet.  \n•Developed and delivered usability training and coached team members on usability methodology and techniques.  \n•Analyzed usability needs, developed usability plans, recruited participants, and coordinated usability test schedules.  \n•Facilitated focus groups and usability sessions with employees; documented results and made design improvement recommendations to content owners and tool designers.  \n•Published HR content and forms to the intranet, partnering with content owners to receive information and ensure legal and fiduciary accuracy. Technical Writer/Training and Documentation Specialist Intel Corporation 1998  –  2000  (2 years) •Designed, developed, and coordinated training and documentation for Financial Services.  \n•Trained Financial Services employees worldwide. \n•Developed the Intel* Create & Share* Camera Pack User Manuals.  \n•Created online help systems for Intel® Email Postcard and Intel® Snapshot software applications Technical Writer/Training and Documentation Specialist Intel Corporation 1998  –  2000  (2 years) •Designed, developed, and coordinated training and documentation for Financial Services.  \n•Trained Financial Services employees worldwide. \n•Developed the Intel* Create & Share* Camera Pack User Manuals.  \n•Created online help systems for Intel® Email Postcard and Intel® Snapshot software applications Senior Administrative Assistant Intel Corporation December 1996  –  1998  (2 years) Senior Administrative Assistant Intel Corporation December 1996  –  1998  (2 years) Skills Cross-functional Team... Program Management Business Analysis Project Management PMP Human Resources Software Development... PMI MS Project Scrum Project Planning Leadership Project Portfolio... Software Project... Team Leadership Organization Usability Testing Product Management Certified Scrum Master... Scope Management Project Scope... Strategic Planning Data-driven Decision... Outsourced HR Services Stakeholder Management Cross Functional Team... Multi-cultural team... IT Solutions Enterprise Software Agile Methodologies Vendor Management Agile Project Management Retrospectives Production Support Stabilization Enterprise Content... SWP Deliverables PERT Product Requirement... Problem Analysis WBS User Experience Business Process... Process Improvement Business Process... Software Development See 32+     See less Skills  Cross-functional Team... Program Management Business Analysis Project Management PMP Human Resources Software Development... PMI MS Project Scrum Project Planning Leadership Project Portfolio... Software Project... Team Leadership Organization Usability Testing Product Management Certified Scrum Master... Scope Management Project Scope... Strategic Planning Data-driven Decision... Outsourced HR Services Stakeholder Management Cross Functional Team... Multi-cultural team... IT Solutions Enterprise Software Agile Methodologies Vendor Management Agile Project Management Retrospectives Production Support Stabilization Enterprise Content... SWP Deliverables PERT Product Requirement... Problem Analysis WBS User Experience Business Process... Process Improvement Business Process... Software Development See 32+     See less Cross-functional Team... Program Management Business Analysis Project Management PMP Human Resources Software Development... PMI MS Project Scrum Project Planning Leadership Project Portfolio... Software Project... Team Leadership Organization Usability Testing Product Management Certified Scrum Master... Scope Management Project Scope... Strategic Planning Data-driven Decision... Outsourced HR Services Stakeholder Management Cross Functional Team... Multi-cultural team... IT Solutions Enterprise Software Agile Methodologies Vendor Management Agile Project Management Retrospectives Production Support Stabilization Enterprise Content... SWP Deliverables PERT Product Requirement... Problem Analysis WBS User Experience Business Process... Process Improvement Business Process... Software Development See 32+     See less Cross-functional Team... Program Management Business Analysis Project Management PMP Human Resources Software Development... PMI MS Project Scrum Project Planning Leadership Project Portfolio... Software Project... Team Leadership Organization Usability Testing Product Management Certified Scrum Master... Scope Management Project Scope... Strategic Planning Data-driven Decision... Outsourced HR Services Stakeholder Management Cross Functional Team... Multi-cultural team... IT Solutions Enterprise Software Agile Methodologies Vendor Management Agile Project Management Retrospectives Production Support Stabilization Enterprise Content... SWP Deliverables PERT Product Requirement... Problem Analysis WBS User Experience Business Process... Process Improvement Business Process... Software Development See 32+     See less Education Western Oregon University Bachelor's degree,  Psychology Western Oregon University Bachelor's degree,  Psychology Western Oregon University Bachelor's degree,  Psychology Western Oregon University Bachelor's degree,  Psychology Honors & Awards Intel Achievement Award Intel May 2011 Received Intel's highest honor as the Technical Project Manager for the Stock Option Exchange project. IT Excellence Award Intel 2009 For flawless, easy to use Stock Option Exchange Tools.  Intel Achievement Award Intel May 2011 Received Intel's highest honor as the Technical Project Manager for the Stock Option Exchange project. Intel Achievement Award Intel May 2011 Received Intel's highest honor as the Technical Project Manager for the Stock Option Exchange project. Intel Achievement Award Intel May 2011 Received Intel's highest honor as the Technical Project Manager for the Stock Option Exchange project. IT Excellence Award Intel 2009 For flawless, easy to use Stock Option Exchange Tools.  IT Excellence Award Intel 2009 For flawless, easy to use Stock Option Exchange Tools.  IT Excellence Award Intel 2009 For flawless, easy to use Stock Option Exchange Tools.  ", "Skills SDLC Software Project... Intel Software Development Cross-functional Team... Process Improvement PMP Agile Project Management Program Management Semiconductors PMO Project Management Agile Methodologies Integration Requirements Analysis Scrum Embedded Systems Software Documentation Vendor Management See 4+     See less Skills  SDLC Software Project... Intel Software Development Cross-functional Team... Process Improvement PMP Agile Project Management Program Management Semiconductors PMO Project Management Agile Methodologies Integration Requirements Analysis Scrum Embedded Systems Software Documentation Vendor Management See 4+     See less SDLC Software Project... Intel Software Development Cross-functional Team... Process Improvement PMP Agile Project Management Program Management Semiconductors PMO Project Management Agile Methodologies Integration Requirements Analysis Scrum Embedded Systems Software Documentation Vendor Management See 4+     See less SDLC Software Project... Intel Software Development Cross-functional Team... Process Improvement PMP Agile Project Management Program Management Semiconductors PMO Project Management Agile Methodologies Integration Requirements Analysis Scrum Embedded Systems Software Documentation Vendor Management See 4+     See less ", "Skills Cross-functional Team... Program Management Skills  Cross-functional Team... Program Management Cross-functional Team... Program Management Cross-functional Team... Program Management ", "Experience Software Program Manager Intel Corporation October 2012  – Present (2 years 11 months) Jerusalem Linux WiFi core and PC products lines (WiFi) Software program manager \n \nincluding:  \nWiFi Linux group execution management ,  \nwork plans,  \ncontinuous integration,  \ninterfaces and coordination with validation, system and firmware groups. \nLeading development and release process both internaly and with customers. Software Program Manager Intel Corporation October 2012  – Present (2 years 11 months) Jerusalem Linux WiFi core and PC products lines (WiFi) Software program manager \n \nincluding:  \nWiFi Linux group execution management ,  \nwork plans,  \ncontinuous integration,  \ninterfaces and coordination with validation, system and firmware groups. \nLeading development and release process both internaly and with customers. Software Program Manager Intel Corporation October 2012  – Present (2 years 11 months) Jerusalem Linux WiFi core and PC products lines (WiFi) Software program manager \n \nincluding:  \nWiFi Linux group execution management ,  \nwork plans,  \ncontinuous integration,  \ninterfaces and coordination with validation, system and firmware groups. \nLeading development and release process both internaly and with customers. Languages English Hebrew English Hebrew English Hebrew Skills Open Source Mobile Android WLAN Embedded Linux Kernel C Wireless Linux Kernel Linux Agile Scrum Continuous Integration Jenkins Operating Systems Mobile Devices Agile Methodologies See 2+     See less Skills  Open Source Mobile Android WLAN Embedded Linux Kernel C Wireless Linux Kernel Linux Agile Scrum Continuous Integration Jenkins Operating Systems Mobile Devices Agile Methodologies See 2+     See less Open Source Mobile Android WLAN Embedded Linux Kernel C Wireless Linux Kernel Linux Agile Scrum Continuous Integration Jenkins Operating Systems Mobile Devices Agile Methodologies See 2+     See less Open Source Mobile Android WLAN Embedded Linux Kernel C Wireless Linux Kernel Linux Agile Scrum Continuous Integration Jenkins Operating Systems Mobile Devices Agile Methodologies See 2+     See less Education Ben-Gurion University of the Negev Msc Student,  Math 2005  – 2008 Ben-Gurion University of the Negev Bsc,  Math and computer science 1998  – 2001 Ben-Gurion University of the Negev Msc Student,  Math 2005  – 2008 Ben-Gurion University of the Negev Msc Student,  Math 2005  – 2008 Ben-Gurion University of the Negev Msc Student,  Math 2005  – 2008 Ben-Gurion University of the Negev Bsc,  Math and computer science 1998  – 2001 Ben-Gurion University of the Negev Bsc,  Math and computer science 1998  – 2001 Ben-Gurion University of the Negev Bsc,  Math and computer science 1998  – 2001 ", "Summary Widely experienced technical project manager with over fifteen years of hands-on product definition, development, and delivery. Industry background includes renewable energy, energy markets, semiconductors, software products, and e-commerce. Adept at leading/driving cross-functional teams to implement and deliver critical software applications and products. Business acumen to deal with stakeholders from all functional areas and satisfying their diverse needs and expectations. Coordination of enterprise teams across geographies of as many as 38 individuals that include: subject matter experts, software developers, quality assurance engineers, and business analysts. Awarded the Project Management Professional (PMP) certification from the Project Management Institute (PMI). \n \nSpecialties: Strategic Planning, Program/Project Management, Renewable Energy, Vendor Management, Earned Value Management (EVM) , Software Development Manager, Requirements Management, ERP, Systems Analysis, SAP R/3, Application Development, Systems Integration, Commercial/OEM Products.  \n \nExtensive experience in electricity energy markets. Summary Widely experienced technical project manager with over fifteen years of hands-on product definition, development, and delivery. Industry background includes renewable energy, energy markets, semiconductors, software products, and e-commerce. Adept at leading/driving cross-functional teams to implement and deliver critical software applications and products. Business acumen to deal with stakeholders from all functional areas and satisfying their diverse needs and expectations. Coordination of enterprise teams across geographies of as many as 38 individuals that include: subject matter experts, software developers, quality assurance engineers, and business analysts. Awarded the Project Management Professional (PMP) certification from the Project Management Institute (PMI). \n \nSpecialties: Strategic Planning, Program/Project Management, Renewable Energy, Vendor Management, Earned Value Management (EVM) , Software Development Manager, Requirements Management, ERP, Systems Analysis, SAP R/3, Application Development, Systems Integration, Commercial/OEM Products.  \n \nExtensive experience in electricity energy markets. Widely experienced technical project manager with over fifteen years of hands-on product definition, development, and delivery. Industry background includes renewable energy, energy markets, semiconductors, software products, and e-commerce. Adept at leading/driving cross-functional teams to implement and deliver critical software applications and products. Business acumen to deal with stakeholders from all functional areas and satisfying their diverse needs and expectations. Coordination of enterprise teams across geographies of as many as 38 individuals that include: subject matter experts, software developers, quality assurance engineers, and business analysts. Awarded the Project Management Professional (PMP) certification from the Project Management Institute (PMI). \n \nSpecialties: Strategic Planning, Program/Project Management, Renewable Energy, Vendor Management, Earned Value Management (EVM) , Software Development Manager, Requirements Management, ERP, Systems Analysis, SAP R/3, Application Development, Systems Integration, Commercial/OEM Products.  \n \nExtensive experience in electricity energy markets. Widely experienced technical project manager with over fifteen years of hands-on product definition, development, and delivery. Industry background includes renewable energy, energy markets, semiconductors, software products, and e-commerce. Adept at leading/driving cross-functional teams to implement and deliver critical software applications and products. Business acumen to deal with stakeholders from all functional areas and satisfying their diverse needs and expectations. Coordination of enterprise teams across geographies of as many as 38 individuals that include: subject matter experts, software developers, quality assurance engineers, and business analysts. Awarded the Project Management Professional (PMP) certification from the Project Management Institute (PMI). \n \nSpecialties: Strategic Planning, Program/Project Management, Renewable Energy, Vendor Management, Earned Value Management (EVM) , Software Development Manager, Requirements Management, ERP, Systems Analysis, SAP R/3, Application Development, Systems Integration, Commercial/OEM Products.  \n \nExtensive experience in electricity energy markets. Experience Manager, Program Lifecycle and Process California Independent System Operator July 2013  – Present (2 years 2 months) Folsom Strategic Initiative Manager/Program Manager California Independent System Operator 2010  –  June 2013  (3 years) Energy Market Redesign Program Manager California Independent System Operator 2005  –  2009  (4 years) Intel Embedded Graphics Driver Program Manager Intel Corporation 2005  –  2005  (less than a year) Senior Project Manager California Independent System Operator 2002  –  2005  (3 years) Technical Project Manager (Contract) ARTIST direct Inc 2000  –  2001  (1 year) Software Development Manager (Founding Member) Pandesic LLC 1997  –  2000  (3 years) Senior Software Developer/Development Team Lead Intel Corporation 1990  –  1997  (7 years) Manager, Program Lifecycle and Process California Independent System Operator July 2013  – Present (2 years 2 months) Folsom Manager, Program Lifecycle and Process California Independent System Operator July 2013  – Present (2 years 2 months) Folsom Strategic Initiative Manager/Program Manager California Independent System Operator 2010  –  June 2013  (3 years) Strategic Initiative Manager/Program Manager California Independent System Operator 2010  –  June 2013  (3 years) Energy Market Redesign Program Manager California Independent System Operator 2005  –  2009  (4 years) Energy Market Redesign Program Manager California Independent System Operator 2005  –  2009  (4 years) Intel Embedded Graphics Driver Program Manager Intel Corporation 2005  –  2005  (less than a year) Intel Embedded Graphics Driver Program Manager Intel Corporation 2005  –  2005  (less than a year) Senior Project Manager California Independent System Operator 2002  –  2005  (3 years) Senior Project Manager California Independent System Operator 2002  –  2005  (3 years) Technical Project Manager (Contract) ARTIST direct Inc 2000  –  2001  (1 year) Technical Project Manager (Contract) ARTIST direct Inc 2000  –  2001  (1 year) Software Development Manager (Founding Member) Pandesic LLC 1997  –  2000  (3 years) Software Development Manager (Founding Member) Pandesic LLC 1997  –  2000  (3 years) Senior Software Developer/Development Team Lead Intel Corporation 1990  –  1997  (7 years) Senior Software Developer/Development Team Lead Intel Corporation 1990  –  1997  (7 years) Skills Program Management Vendor Management ERP Integration Application Development PMP PMI PMO SAP R/3 Cross-functional Team... SDLC Team Leadership MS Project Software Development Project Management Strategic Planning Business Process IT Strategy Enterprise Architecture Quality Assurance Business Analysis Analysis Project Portfolio... Management Leadership E-commerce Oracle Business Process... Software Project... Requirements Analysis Business Intelligence SAP Enterprise Software Resource Management Visio SharePoint IT Management Agile Project Management Process Improvement ITIL Governance Outsourcing IT Service Management Agile Methodologies Project Delivery Information Technology Solution Architecture Requirements Gathering Change Management Business Transformation See 35+     See less Skills  Program Management Vendor Management ERP Integration Application Development PMP PMI PMO SAP R/3 Cross-functional Team... SDLC Team Leadership MS Project Software Development Project Management Strategic Planning Business Process IT Strategy Enterprise Architecture Quality Assurance Business Analysis Analysis Project Portfolio... Management Leadership E-commerce Oracle Business Process... Software Project... Requirements Analysis Business Intelligence SAP Enterprise Software Resource Management Visio SharePoint IT Management Agile Project Management Process Improvement ITIL Governance Outsourcing IT Service Management Agile Methodologies Project Delivery Information Technology Solution Architecture Requirements Gathering Change Management Business Transformation See 35+     See less Program Management Vendor Management ERP Integration Application Development PMP PMI PMO SAP R/3 Cross-functional Team... SDLC Team Leadership MS Project Software Development Project Management Strategic Planning Business Process IT Strategy Enterprise Architecture Quality Assurance Business Analysis Analysis Project Portfolio... Management Leadership E-commerce Oracle Business Process... Software Project... Requirements Analysis Business Intelligence SAP Enterprise Software Resource Management Visio SharePoint IT Management Agile Project Management Process Improvement ITIL Governance Outsourcing IT Service Management Agile Methodologies Project Delivery Information Technology Solution Architecture Requirements Gathering Change Management Business Transformation See 35+     See less Program Management Vendor Management ERP Integration Application Development PMP PMI PMO SAP R/3 Cross-functional Team... SDLC Team Leadership MS Project Software Development Project Management Strategic Planning Business Process IT Strategy Enterprise Architecture Quality Assurance Business Analysis Analysis Project Portfolio... Management Leadership E-commerce Oracle Business Process... Software Project... Requirements Analysis Business Intelligence SAP Enterprise Software Resource Management Visio SharePoint IT Management Agile Project Management Process Improvement ITIL Governance Outsourcing IT Service Management Agile Methodologies Project Delivery Information Technology Solution Architecture Requirements Gathering Change Management Business Transformation See 35+     See less Education California State University-Chico Bachelor of Science University of California, Davis Continuing Education California State University-Chico Bachelor of Science California State University-Chico Bachelor of Science California State University-Chico Bachelor of Science University of California, Davis Continuing Education University of California, Davis Continuing Education University of California, Davis Continuing Education ", "Summary Over 20 years experience in Information Systems, Quality and Process Engineering, Software Test Engineering, Technical Project Management and Business and Systems Analysis, in multi-tier development environments. Extensive experience in Process Improvement initiatives utilizing Capability Maturity Model Integration, (CMMI), ITIL and Six Sigma Quality Improvement methodologies. Expert “hands on” technical professional with extensive experience utilizing industry standard tooling to produce high quality products in all aspects of the Software Development Lifecycle ranging from business and systems requirements, software and systems test planning, strategizing and execution. \n \n-Specialties: \n-Affordable Care Act ACA - Health Benefit Exchange - SHOP \n-Smart Meter/Smart Grid - Energy/Utilities \n-CMMI Scampi A Appraiser \n-ITIL Foundations Certified \n-Six Sigma Greenbelt Equivalent \n-HP Quality Center Expert \n-Rational Requisite Pro, Rational Rose Expert \n-Quick Test Pro (QTP) \n-SOA Test/XML Spy \n-HIPPA Legal & Regulatory (Healthcare) \n-HAMP - Government (Freddie/Fannie Mae) \n-Healthcare (Data Security, Clinical/Financial Analysis) \n-Operational Readiness Planning/Execution \n-Technical Project Management \n-Software Quality Test Engineering \n-Process Engineering \n-Process Improvement Summary Over 20 years experience in Information Systems, Quality and Process Engineering, Software Test Engineering, Technical Project Management and Business and Systems Analysis, in multi-tier development environments. Extensive experience in Process Improvement initiatives utilizing Capability Maturity Model Integration, (CMMI), ITIL and Six Sigma Quality Improvement methodologies. Expert “hands on” technical professional with extensive experience utilizing industry standard tooling to produce high quality products in all aspects of the Software Development Lifecycle ranging from business and systems requirements, software and systems test planning, strategizing and execution. \n \n-Specialties: \n-Affordable Care Act ACA - Health Benefit Exchange - SHOP \n-Smart Meter/Smart Grid - Energy/Utilities \n-CMMI Scampi A Appraiser \n-ITIL Foundations Certified \n-Six Sigma Greenbelt Equivalent \n-HP Quality Center Expert \n-Rational Requisite Pro, Rational Rose Expert \n-Quick Test Pro (QTP) \n-SOA Test/XML Spy \n-HIPPA Legal & Regulatory (Healthcare) \n-HAMP - Government (Freddie/Fannie Mae) \n-Healthcare (Data Security, Clinical/Financial Analysis) \n-Operational Readiness Planning/Execution \n-Technical Project Management \n-Software Quality Test Engineering \n-Process Engineering \n-Process Improvement Over 20 years experience in Information Systems, Quality and Process Engineering, Software Test Engineering, Technical Project Management and Business and Systems Analysis, in multi-tier development environments. Extensive experience in Process Improvement initiatives utilizing Capability Maturity Model Integration, (CMMI), ITIL and Six Sigma Quality Improvement methodologies. Expert “hands on” technical professional with extensive experience utilizing industry standard tooling to produce high quality products in all aspects of the Software Development Lifecycle ranging from business and systems requirements, software and systems test planning, strategizing and execution. \n \n-Specialties: \n-Affordable Care Act ACA - Health Benefit Exchange - SHOP \n-Smart Meter/Smart Grid - Energy/Utilities \n-CMMI Scampi A Appraiser \n-ITIL Foundations Certified \n-Six Sigma Greenbelt Equivalent \n-HP Quality Center Expert \n-Rational Requisite Pro, Rational Rose Expert \n-Quick Test Pro (QTP) \n-SOA Test/XML Spy \n-HIPPA Legal & Regulatory (Healthcare) \n-HAMP - Government (Freddie/Fannie Mae) \n-Healthcare (Data Security, Clinical/Financial Analysis) \n-Operational Readiness Planning/Execution \n-Technical Project Management \n-Software Quality Test Engineering \n-Process Engineering \n-Process Improvement Over 20 years experience in Information Systems, Quality and Process Engineering, Software Test Engineering, Technical Project Management and Business and Systems Analysis, in multi-tier development environments. Extensive experience in Process Improvement initiatives utilizing Capability Maturity Model Integration, (CMMI), ITIL and Six Sigma Quality Improvement methodologies. Expert “hands on” technical professional with extensive experience utilizing industry standard tooling to produce high quality products in all aspects of the Software Development Lifecycle ranging from business and systems requirements, software and systems test planning, strategizing and execution. \n \n-Specialties: \n-Affordable Care Act ACA - Health Benefit Exchange - SHOP \n-Smart Meter/Smart Grid - Energy/Utilities \n-CMMI Scampi A Appraiser \n-ITIL Foundations Certified \n-Six Sigma Greenbelt Equivalent \n-HP Quality Center Expert \n-Rational Requisite Pro, Rational Rose Expert \n-Quick Test Pro (QTP) \n-SOA Test/XML Spy \n-HIPPA Legal & Regulatory (Healthcare) \n-HAMP - Government (Freddie/Fannie Mae) \n-Healthcare (Data Security, Clinical/Financial Analysis) \n-Operational Readiness Planning/Execution \n-Technical Project Management \n-Software Quality Test Engineering \n-Process Engineering \n-Process Improvement Experience IT Technical Program Manager Intel Corporation January 2015  – Present (8 months) Health Benefit Exchange - ACA SHOP -Project Management- Operational Readiness Quantum Consulting Services October 2012  –  October 2014  (2 years 1 month) Covered California Health Benefit Exchange Manager, Strategic Architecture & Integration - Test Manager, Advanced Meter Initiative - SoCalGas Capgemini SA&I February 2011  –  July 2012  (1 year 6 months) CGGS Manager - Business Architect State of Nevada Capgemini Government Solutions LLC July 2010  –  February 2011  (8 months) Senior IT Systems Analyst HomEq Servicing - Sapphire Technologies February 2010  –  August 2010  (7 months) Lead, Software Quality Assurance - Process Engineer California Independent System Operator April 2003  –  October 2009  (6 years 7 months) Technical Project Manager- Senior IT Systems Analyst California Independent System Operator April 2003  –  April 2007  (4 years 1 month) Technical Project Management-Senior Business & Systems Analyst California Systems Consultants June 2002  –  April 2003  (11 months) Manager, Analytical Services Info Sys Consulting Services June 2001  –  June 2002  (1 year 1 month) Information Systems/Network Administrator GPS Wholesale & Supply June 2000  –  June 2001  (1 year 1 month) Financial/Clinical Healthcare IT Systems Analyst Sierra Nevada Memorial Hospital April 1995  –  June 2000  (5 years 3 months) Information Systems Healthcare Analyst Marshall Hospital June 1994  –  June 1995  (1 year 1 month) Information Systems/ Data Specialist Tahoe Forest Hospital April 1989  –  June 1994  (5 years 3 months) IT Technical Program Manager Intel Corporation January 2015  – Present (8 months) IT Technical Program Manager Intel Corporation January 2015  – Present (8 months) Health Benefit Exchange - ACA SHOP -Project Management- Operational Readiness Quantum Consulting Services October 2012  –  October 2014  (2 years 1 month) Covered California Health Benefit Exchange Health Benefit Exchange - ACA SHOP -Project Management- Operational Readiness Quantum Consulting Services October 2012  –  October 2014  (2 years 1 month) Covered California Health Benefit Exchange Manager, Strategic Architecture & Integration - Test Manager, Advanced Meter Initiative - SoCalGas Capgemini SA&I February 2011  –  July 2012  (1 year 6 months) Manager, Strategic Architecture & Integration - Test Manager, Advanced Meter Initiative - SoCalGas Capgemini SA&I February 2011  –  July 2012  (1 year 6 months) CGGS Manager - Business Architect State of Nevada Capgemini Government Solutions LLC July 2010  –  February 2011  (8 months) CGGS Manager - Business Architect State of Nevada Capgemini Government Solutions LLC July 2010  –  February 2011  (8 months) Senior IT Systems Analyst HomEq Servicing - Sapphire Technologies February 2010  –  August 2010  (7 months) Senior IT Systems Analyst HomEq Servicing - Sapphire Technologies February 2010  –  August 2010  (7 months) Lead, Software Quality Assurance - Process Engineer California Independent System Operator April 2003  –  October 2009  (6 years 7 months) Lead, Software Quality Assurance - Process Engineer California Independent System Operator April 2003  –  October 2009  (6 years 7 months) Technical Project Manager- Senior IT Systems Analyst California Independent System Operator April 2003  –  April 2007  (4 years 1 month) Technical Project Manager- Senior IT Systems Analyst California Independent System Operator April 2003  –  April 2007  (4 years 1 month) Technical Project Management-Senior Business & Systems Analyst California Systems Consultants June 2002  –  April 2003  (11 months) Technical Project Management-Senior Business & Systems Analyst California Systems Consultants June 2002  –  April 2003  (11 months) Manager, Analytical Services Info Sys Consulting Services June 2001  –  June 2002  (1 year 1 month) Manager, Analytical Services Info Sys Consulting Services June 2001  –  June 2002  (1 year 1 month) Information Systems/Network Administrator GPS Wholesale & Supply June 2000  –  June 2001  (1 year 1 month) Information Systems/Network Administrator GPS Wholesale & Supply June 2000  –  June 2001  (1 year 1 month) Financial/Clinical Healthcare IT Systems Analyst Sierra Nevada Memorial Hospital April 1995  –  June 2000  (5 years 3 months) Financial/Clinical Healthcare IT Systems Analyst Sierra Nevada Memorial Hospital April 1995  –  June 2000  (5 years 3 months) Information Systems Healthcare Analyst Marshall Hospital June 1994  –  June 1995  (1 year 1 month) Information Systems Healthcare Analyst Marshall Hospital June 1994  –  June 1995  (1 year 1 month) Information Systems/ Data Specialist Tahoe Forest Hospital April 1989  –  June 1994  (5 years 3 months) Information Systems/ Data Specialist Tahoe Forest Hospital April 1989  –  June 1994  (5 years 3 months) Skills Quality Center Rational ITIL SDLC Requirements Analysis Business Analysis Visio Software Project... Business Process... MS Project Integration Business Process Process Improvement Project Management IT Strategy Testing Enterprise Architecture Resource Management Project Delivery Oracle User Acceptance Testing Outsourcing Software Development Agile Methodologies SOA Project Planning Systems Analysis CMMI Quality Assurance System Testing Management PMP Business Intelligence Scrum Software Quality... SharePoint PMO Requirements Gathering Project Portfolio... Vendor Management Strategy HP Quality Center Microsoft Project See 28+     See less Skills  Quality Center Rational ITIL SDLC Requirements Analysis Business Analysis Visio Software Project... Business Process... MS Project Integration Business Process Process Improvement Project Management IT Strategy Testing Enterprise Architecture Resource Management Project Delivery Oracle User Acceptance Testing Outsourcing Software Development Agile Methodologies SOA Project Planning Systems Analysis CMMI Quality Assurance System Testing Management PMP Business Intelligence Scrum Software Quality... SharePoint PMO Requirements Gathering Project Portfolio... Vendor Management Strategy HP Quality Center Microsoft Project See 28+     See less Quality Center Rational ITIL SDLC Requirements Analysis Business Analysis Visio Software Project... Business Process... MS Project Integration Business Process Process Improvement Project Management IT Strategy Testing Enterprise Architecture Resource Management Project Delivery Oracle User Acceptance Testing Outsourcing Software Development Agile Methodologies SOA Project Planning Systems Analysis CMMI Quality Assurance System Testing Management PMP Business Intelligence Scrum Software Quality... SharePoint PMO Requirements Gathering Project Portfolio... Vendor Management Strategy HP Quality Center Microsoft Project See 28+     See less Quality Center Rational ITIL SDLC Requirements Analysis Business Analysis Visio Software Project... Business Process... MS Project Integration Business Process Process Improvement Project Management IT Strategy Testing Enterprise Architecture Resource Management Project Delivery Oracle User Acceptance Testing Outsourcing Software Development Agile Methodologies SOA Project Planning Systems Analysis CMMI Quality Assurance System Testing Management PMP Business Intelligence Scrum Software Quality... SharePoint PMO Requirements Gathering Project Portfolio... Vendor Management Strategy HP Quality Center Microsoft Project See 28+     See less Education PMI Institute PMP,  Project Management 2015  – 2015 Sierra College - Computer Science 1995 - 1999 Computer Science 1995  – 1999 American Management Association (AMA) Technical Project Management Carnegie Mellon University CMMI SCAMPI A Appraiser Certified Information Technology Infrastructure Library (ITIL) ITIL Foundations Certified Juran Institute - Quality Improvement Six Sigma - Greenbelt Equivalent Trained Microsoft Certified Database Administrator (MCDBA, MCP) MCDBA - Microsoft SQL Database Administration PMI Institute PMP,  Project Management 2015  – 2015 PMI Institute PMP,  Project Management 2015  – 2015 PMI Institute PMP,  Project Management 2015  – 2015 Sierra College - Computer Science 1995 - 1999 Computer Science 1995  – 1999 Sierra College - Computer Science 1995 - 1999 Computer Science 1995  – 1999 Sierra College - Computer Science 1995 - 1999 Computer Science 1995  – 1999 American Management Association (AMA) Technical Project Management American Management Association (AMA) Technical Project Management American Management Association (AMA) Technical Project Management Carnegie Mellon University CMMI SCAMPI A Appraiser Certified Carnegie Mellon University CMMI SCAMPI A Appraiser Certified Carnegie Mellon University CMMI SCAMPI A Appraiser Certified Information Technology Infrastructure Library (ITIL) ITIL Foundations Certified Information Technology Infrastructure Library (ITIL) ITIL Foundations Certified Information Technology Infrastructure Library (ITIL) ITIL Foundations Certified Juran Institute - Quality Improvement Six Sigma - Greenbelt Equivalent Trained Juran Institute - Quality Improvement Six Sigma - Greenbelt Equivalent Trained Juran Institute - Quality Improvement Six Sigma - Greenbelt Equivalent Trained Microsoft Certified Database Administrator (MCDBA, MCP) MCDBA - Microsoft SQL Database Administration Microsoft Certified Database Administrator (MCDBA, MCP) MCDBA - Microsoft SQL Database Administration Microsoft Certified Database Administrator (MCDBA, MCP) MCDBA - Microsoft SQL Database Administration ", "Skills Program Management Software Project... Software Development SDLC Vendor Management Requirements Analysis Agile Methodologies Business Intelligence Integration Business Process Management Cross-functional Team... Enterprise Architecture IT Strategy Solution Architecture Global Delivery Product Management Business Analysis Software Design IT Service Management IT Service Delivery Leading Change Strategic Planning Enterprise Software Databases Leadership Unix Oracle Project Planning Process Improvement Microsoft SQL Server Testing Team Management Architecture Star Schema Business Process... Pricing Quote to Cash Demand Forecasting Team Building Team Leadership See 26+     See less Skills  Program Management Software Project... Software Development SDLC Vendor Management Requirements Analysis Agile Methodologies Business Intelligence Integration Business Process Management Cross-functional Team... Enterprise Architecture IT Strategy Solution Architecture Global Delivery Product Management Business Analysis Software Design IT Service Management IT Service Delivery Leading Change Strategic Planning Enterprise Software Databases Leadership Unix Oracle Project Planning Process Improvement Microsoft SQL Server Testing Team Management Architecture Star Schema Business Process... Pricing Quote to Cash Demand Forecasting Team Building Team Leadership See 26+     See less Program Management Software Project... Software Development SDLC Vendor Management Requirements Analysis Agile Methodologies Business Intelligence Integration Business Process Management Cross-functional Team... Enterprise Architecture IT Strategy Solution Architecture Global Delivery Product Management Business Analysis Software Design IT Service Management IT Service Delivery Leading Change Strategic Planning Enterprise Software Databases Leadership Unix Oracle Project Planning Process Improvement Microsoft SQL Server Testing Team Management Architecture Star Schema Business Process... Pricing Quote to Cash Demand Forecasting Team Building Team Leadership See 26+     See less Program Management Software Project... Software Development SDLC Vendor Management Requirements Analysis Agile Methodologies Business Intelligence Integration Business Process Management Cross-functional Team... Enterprise Architecture IT Strategy Solution Architecture Global Delivery Product Management Business Analysis Software Design IT Service Management IT Service Delivery Leading Change Strategic Planning Enterprise Software Databases Leadership Unix Oracle Project Planning Process Improvement Microsoft SQL Server Testing Team Management Architecture Star Schema Business Process... Pricing Quote to Cash Demand Forecasting Team Building Team Leadership See 26+     See less ", "Skills Software Project... Project Planning Project Execution Program Management Project Management Software Documentation Manufacturing SDLC PMP Cross-functional Team... Software Development Management Agile Methodologies Business Process CRM Process Improvement Enterprise Software Strategy Scrum Product Management Security Product Development Change Management Outsourcing Enterprise Architecture Project Portfolio... Business Intelligence Integration Training Requirements Analysis IT Strategy Intel Business Analysis Cloud Computing PMO Vendor Management Testing Business Process... See 23+     See less Skills  Software Project... Project Planning Project Execution Program Management Project Management Software Documentation Manufacturing SDLC PMP Cross-functional Team... Software Development Management Agile Methodologies Business Process CRM Process Improvement Enterprise Software Strategy Scrum Product Management Security Product Development Change Management Outsourcing Enterprise Architecture Project Portfolio... Business Intelligence Integration Training Requirements Analysis IT Strategy Intel Business Analysis Cloud Computing PMO Vendor Management Testing Business Process... See 23+     See less Software Project... Project Planning Project Execution Program Management Project Management Software Documentation Manufacturing SDLC PMP Cross-functional Team... Software Development Management Agile Methodologies Business Process CRM Process Improvement Enterprise Software Strategy Scrum Product Management Security Product Development Change Management Outsourcing Enterprise Architecture Project Portfolio... Business Intelligence Integration Training Requirements Analysis IT Strategy Intel Business Analysis Cloud Computing PMO Vendor Management Testing Business Process... See 23+     See less Software Project... Project Planning Project Execution Program Management Project Management Software Documentation Manufacturing SDLC PMP Cross-functional Team... Software Development Management Agile Methodologies Business Process CRM Process Improvement Enterprise Software Strategy Scrum Product Management Security Product Development Change Management Outsourcing Enterprise Architecture Project Portfolio... Business Intelligence Integration Training Requirements Analysis IT Strategy Intel Business Analysis Cloud Computing PMO Vendor Management Testing Business Process... See 23+     See less ", "Summary Entertainment technology professional with extensive software and web management experience. Self-professed information junkie. \n \nSpecialties: Portfolio and program management; online content production; Agile project management; online gaming; personnel acquisition, training and management; systems engineering; business analysis; customer collaboration and evangelism; supplier and partner management; contract negotiation and compliance; CSPO and CSM. Summary Entertainment technology professional with extensive software and web management experience. Self-professed information junkie. \n \nSpecialties: Portfolio and program management; online content production; Agile project management; online gaming; personnel acquisition, training and management; systems engineering; business analysis; customer collaboration and evangelism; supplier and partner management; contract negotiation and compliance; CSPO and CSM. Entertainment technology professional with extensive software and web management experience. Self-professed information junkie. \n \nSpecialties: Portfolio and program management; online content production; Agile project management; online gaming; personnel acquisition, training and management; systems engineering; business analysis; customer collaboration and evangelism; supplier and partner management; contract negotiation and compliance; CSPO and CSM. Entertainment technology professional with extensive software and web management experience. Self-professed information junkie. \n \nSpecialties: Portfolio and program management; online content production; Agile project management; online gaming; personnel acquisition, training and management; systems engineering; business analysis; customer collaboration and evangelism; supplier and partner management; contract negotiation and compliance; CSPO and CSM. Languages   Skills Agile Project Management Program Management Integration Agile Methodologies Scrum Software Project... Video Games Project Management Product Management Software Development Business Analysis Cloud Computing Game Development ITIL Cross-functional Team... Mobile Applications Web Development Mobile Games Mobile Devices Social Games IT Service Management User Experience SDLC Software Engineering E-commerce Management Technical Project... Department Budget... Private Cloud Tableau Business Intelligence Analytics See 17+     See less Skills  Agile Project Management Program Management Integration Agile Methodologies Scrum Software Project... Video Games Project Management Product Management Software Development Business Analysis Cloud Computing Game Development ITIL Cross-functional Team... Mobile Applications Web Development Mobile Games Mobile Devices Social Games IT Service Management User Experience SDLC Software Engineering E-commerce Management Technical Project... Department Budget... Private Cloud Tableau Business Intelligence Analytics See 17+     See less Agile Project Management Program Management Integration Agile Methodologies Scrum Software Project... Video Games Project Management Product Management Software Development Business Analysis Cloud Computing Game Development ITIL Cross-functional Team... Mobile Applications Web Development Mobile Games Mobile Devices Social Games IT Service Management User Experience SDLC Software Engineering E-commerce Management Technical Project... Department Budget... Private Cloud Tableau Business Intelligence Analytics See 17+     See less Agile Project Management Program Management Integration Agile Methodologies Scrum Software Project... Video Games Project Management Product Management Software Development Business Analysis Cloud Computing Game Development ITIL Cross-functional Team... Mobile Applications Web Development Mobile Games Mobile Devices Social Games IT Service Management User Experience SDLC Software Engineering E-commerce Management Technical Project... Department Budget... Private Cloud Tableau Business Intelligence Analytics See 17+     See less Honors & Awards ", "Summary Diversity Strategist and Staffing Program Manager Seeking World Class Talent for Intel Corporation. Responsible for building the strategies that position Intel as an employer of choice and sustain our corporate leadership visibility in industry with, but not exclusively limited to, women and under-represented minorities.  \n \nStrengths:  \n• Empathy \n- I understand \"the other guy's\"​ point of view and can use it to bring teams together.  \n\"Some people think only intellect counts: knowing how to solve problems, knowing how to get by, knowing how to identify an advantage and seize it. But the functions of intellect are insufficient without courage, love, friendship, compassion and empathy.\"​ \n- Dean Koontz  \n \n• Consistency \n- I think that people function best in a consistent environment where the rules are clear and are applied to everyone equally.  \n\"The secret of success is consistency of purpose.\"​ \n-Benjamin Disraeli  \n \n• Harmony \n- I think conflict is a waste of time and energy so I usually try to find areas where we can all agree. \n- I use my ability to empathize to find the harmony in working relationships. \n- My way may not be THE way but don’t criticize because YOUR way may not be THE way either \n\"You don't get harmony when everybody sings the same note.\"​ \n-Doug Floyd  \n \n• Maximizer \n- I've always preferred focusing on people’s strengths rather than their weaknesses.  \n- I think everyone has the potential to be EXCELLENT at SOMETHING \n\"Continuous excellent effort, not maximum strength or superior IQ, is the key to unlocking your potential as an achiever.\"​ \n-Greg Werner \n \n- I can usually find the positive in people and I DO give points for effort.  \n- If you are sincerely putting forth your best effort, I will go above and beyond to help you succeed \n\"We must expect to fail... but fail in a learning posture, determined not to repeat the mistakes, and to maximize the benefits from what is learned in the process. \" \n-Ted W. Engstrom  \n \n Summary Diversity Strategist and Staffing Program Manager Seeking World Class Talent for Intel Corporation. Responsible for building the strategies that position Intel as an employer of choice and sustain our corporate leadership visibility in industry with, but not exclusively limited to, women and under-represented minorities.  \n \nStrengths:  \n• Empathy \n- I understand \"the other guy's\"​ point of view and can use it to bring teams together.  \n\"Some people think only intellect counts: knowing how to solve problems, knowing how to get by, knowing how to identify an advantage and seize it. But the functions of intellect are insufficient without courage, love, friendship, compassion and empathy.\"​ \n- Dean Koontz  \n \n• Consistency \n- I think that people function best in a consistent environment where the rules are clear and are applied to everyone equally.  \n\"The secret of success is consistency of purpose.\"​ \n-Benjamin Disraeli  \n \n• Harmony \n- I think conflict is a waste of time and energy so I usually try to find areas where we can all agree. \n- I use my ability to empathize to find the harmony in working relationships. \n- My way may not be THE way but don’t criticize because YOUR way may not be THE way either \n\"You don't get harmony when everybody sings the same note.\"​ \n-Doug Floyd  \n \n• Maximizer \n- I've always preferred focusing on people’s strengths rather than their weaknesses.  \n- I think everyone has the potential to be EXCELLENT at SOMETHING \n\"Continuous excellent effort, not maximum strength or superior IQ, is the key to unlocking your potential as an achiever.\"​ \n-Greg Werner \n \n- I can usually find the positive in people and I DO give points for effort.  \n- If you are sincerely putting forth your best effort, I will go above and beyond to help you succeed \n\"We must expect to fail... but fail in a learning posture, determined not to repeat the mistakes, and to maximize the benefits from what is learned in the process. \" \n-Ted W. Engstrom  \n \n Diversity Strategist and Staffing Program Manager Seeking World Class Talent for Intel Corporation. Responsible for building the strategies that position Intel as an employer of choice and sustain our corporate leadership visibility in industry with, but not exclusively limited to, women and under-represented minorities.  \n \nStrengths:  \n• Empathy \n- I understand \"the other guy's\"​ point of view and can use it to bring teams together.  \n\"Some people think only intellect counts: knowing how to solve problems, knowing how to get by, knowing how to identify an advantage and seize it. But the functions of intellect are insufficient without courage, love, friendship, compassion and empathy.\"​ \n- Dean Koontz  \n \n• Consistency \n- I think that people function best in a consistent environment where the rules are clear and are applied to everyone equally.  \n\"The secret of success is consistency of purpose.\"​ \n-Benjamin Disraeli  \n \n• Harmony \n- I think conflict is a waste of time and energy so I usually try to find areas where we can all agree. \n- I use my ability to empathize to find the harmony in working relationships. \n- My way may not be THE way but don’t criticize because YOUR way may not be THE way either \n\"You don't get harmony when everybody sings the same note.\"​ \n-Doug Floyd  \n \n• Maximizer \n- I've always preferred focusing on people’s strengths rather than their weaknesses.  \n- I think everyone has the potential to be EXCELLENT at SOMETHING \n\"Continuous excellent effort, not maximum strength or superior IQ, is the key to unlocking your potential as an achiever.\"​ \n-Greg Werner \n \n- I can usually find the positive in people and I DO give points for effort.  \n- If you are sincerely putting forth your best effort, I will go above and beyond to help you succeed \n\"We must expect to fail... but fail in a learning posture, determined not to repeat the mistakes, and to maximize the benefits from what is learned in the process. \" \n-Ted W. Engstrom  \n \n Diversity Strategist and Staffing Program Manager Seeking World Class Talent for Intel Corporation. Responsible for building the strategies that position Intel as an employer of choice and sustain our corporate leadership visibility in industry with, but not exclusively limited to, women and under-represented minorities.  \n \nStrengths:  \n• Empathy \n- I understand \"the other guy's\"​ point of view and can use it to bring teams together.  \n\"Some people think only intellect counts: knowing how to solve problems, knowing how to get by, knowing how to identify an advantage and seize it. But the functions of intellect are insufficient without courage, love, friendship, compassion and empathy.\"​ \n- Dean Koontz  \n \n• Consistency \n- I think that people function best in a consistent environment where the rules are clear and are applied to everyone equally.  \n\"The secret of success is consistency of purpose.\"​ \n-Benjamin Disraeli  \n \n• Harmony \n- I think conflict is a waste of time and energy so I usually try to find areas where we can all agree. \n- I use my ability to empathize to find the harmony in working relationships. \n- My way may not be THE way but don’t criticize because YOUR way may not be THE way either \n\"You don't get harmony when everybody sings the same note.\"​ \n-Doug Floyd  \n \n• Maximizer \n- I've always preferred focusing on people’s strengths rather than their weaknesses.  \n- I think everyone has the potential to be EXCELLENT at SOMETHING \n\"Continuous excellent effort, not maximum strength or superior IQ, is the key to unlocking your potential as an achiever.\"​ \n-Greg Werner \n \n- I can usually find the positive in people and I DO give points for effort.  \n- If you are sincerely putting forth your best effort, I will go above and beyond to help you succeed \n\"We must expect to fail... but fail in a learning posture, determined not to repeat the mistakes, and to maximize the benefits from what is learned in the process. \" \n-Ted W. Engstrom  \n \n Experience Diversity Staffing Program Manager Intel Corporation May 2012  – Present (3 years 4 months) Responsible for building the strategies that position Intel as an employer of choice and sustain our corporate leadership visibility in industry with, but not exclusively limited to, women and under-represented minorities.  Technical Project Manager Intel Corporation October 2008  –  May 2012  (3 years 8 months) Planned and managed technical projects to meet specific objectives or goals. Provided leadership for the project team and key interfaces to the project stakeholders. Identified tasks, determined dependencies, identified and assigned specific resources, communicated expectations to team members, obtained task effort and duration estimates from team members, and created/tracked progress against the project schedule. Assessed risk and identified issues. Coordinated resources with other functions. Reviewed user and technical requirements for completeness and clarity. Thorough knowledge of business practices and IT PLC processes. Senior Program Manager McKesson 2007  –  2008  (1 year) Managed programs for large pharmaceutical client including project scope and objective definition, coordination of program development and implementation of projects, interfacing with the client on all matters. \n \nWorked closely with various departments (e.g. marketing, computer services, finance), providing a single point of contact for the implementation of projects.  Technical Project Manager/Senior Web Designer Intel Corporation 2003  –  2007  (4 years) Diversity Staffing Program Manager Intel Corporation May 2012  – Present (3 years 4 months) Responsible for building the strategies that position Intel as an employer of choice and sustain our corporate leadership visibility in industry with, but not exclusively limited to, women and under-represented minorities.  Diversity Staffing Program Manager Intel Corporation May 2012  – Present (3 years 4 months) Responsible for building the strategies that position Intel as an employer of choice and sustain our corporate leadership visibility in industry with, but not exclusively limited to, women and under-represented minorities.  Technical Project Manager Intel Corporation October 2008  –  May 2012  (3 years 8 months) Planned and managed technical projects to meet specific objectives or goals. Provided leadership for the project team and key interfaces to the project stakeholders. Identified tasks, determined dependencies, identified and assigned specific resources, communicated expectations to team members, obtained task effort and duration estimates from team members, and created/tracked progress against the project schedule. Assessed risk and identified issues. Coordinated resources with other functions. Reviewed user and technical requirements for completeness and clarity. Thorough knowledge of business practices and IT PLC processes. Technical Project Manager Intel Corporation October 2008  –  May 2012  (3 years 8 months) Planned and managed technical projects to meet specific objectives or goals. Provided leadership for the project team and key interfaces to the project stakeholders. Identified tasks, determined dependencies, identified and assigned specific resources, communicated expectations to team members, obtained task effort and duration estimates from team members, and created/tracked progress against the project schedule. Assessed risk and identified issues. Coordinated resources with other functions. Reviewed user and technical requirements for completeness and clarity. Thorough knowledge of business practices and IT PLC processes. Senior Program Manager McKesson 2007  –  2008  (1 year) Managed programs for large pharmaceutical client including project scope and objective definition, coordination of program development and implementation of projects, interfacing with the client on all matters. \n \nWorked closely with various departments (e.g. marketing, computer services, finance), providing a single point of contact for the implementation of projects.  Senior Program Manager McKesson 2007  –  2008  (1 year) Managed programs for large pharmaceutical client including project scope and objective definition, coordination of program development and implementation of projects, interfacing with the client on all matters. \n \nWorked closely with various departments (e.g. marketing, computer services, finance), providing a single point of contact for the implementation of projects.  Technical Project Manager/Senior Web Designer Intel Corporation 2003  –  2007  (4 years) Technical Project Manager/Senior Web Designer Intel Corporation 2003  –  2007  (4 years) Skills Technical and... Diverse Talent... Customer Orientation Cultivating... Cross-functional Team... Technical Project... Project Management Program Management Agile Methodologies Agile & Waterfall... Long-term Customer... Relationship Building Diversity & Inclusion Equality & Diversity Skills  Technical and... Diverse Talent... Customer Orientation Cultivating... Cross-functional Team... Technical Project... Project Management Program Management Agile Methodologies Agile & Waterfall... Long-term Customer... Relationship Building Diversity & Inclusion Equality & Diversity Technical and... Diverse Talent... Customer Orientation Cultivating... Cross-functional Team... Technical Project... Project Management Program Management Agile Methodologies Agile & Waterfall... Long-term Customer... Relationship Building Diversity & Inclusion Equality & Diversity Technical and... Diverse Talent... Customer Orientation Cultivating... Cross-functional Team... Technical Project... Project Management Program Management Agile Methodologies Agile & Waterfall... Long-term Customer... Relationship Building Diversity & Inclusion Equality & Diversity Education Southern University and Agricultural and Mechanical College at Baton Rouge Bachelor of Science (BS),  Electrical and Electronics Engineering 1992  – 1997 Southern University and Agricultural and Mechanical College at Baton Rouge Bachelor of Science (BS),  Electrical and Electronics Engineering 1992  – 1997 Southern University and Agricultural and Mechanical College at Baton Rouge Bachelor of Science (BS),  Electrical and Electronics Engineering 1992  – 1997 Southern University and Agricultural and Mechanical College at Baton Rouge Bachelor of Science (BS),  Electrical and Electronics Engineering 1992  – 1997 ", "Summary Self motivated professional with a vast experience on Semiconductor industry (15+ years). From Reliability and stress condition definition, Test Program Content Development, Assy/Test Technology Development, Product Qualification Plan Definition, HVM Certification Plan Definition, to a high volume ramp in a complex manufacturing environment. \n \n \nSome of my knowledge include (but not limited to): \n- Lean for Manufacturing, Development, Implementation and High Volume ramp. \n- Fab, Assembly and Test Process Interaction Knowledge (on several process technologies, from 65nm to 14nm, and from C4 OLGA to FCMBx). \n- Problem Solving and Data analysis Techniques. \n- Six Sigma. \n- Hands on Experience as Quality and Reliability Engineering on Stress development as well as quality control implementation (for Silicon and Packaging) \n- Test Program development knowledge (for stress and testing) \n- 12+ Years of Mgr experience. Summary Self motivated professional with a vast experience on Semiconductor industry (15+ years). From Reliability and stress condition definition, Test Program Content Development, Assy/Test Technology Development, Product Qualification Plan Definition, HVM Certification Plan Definition, to a high volume ramp in a complex manufacturing environment. \n \n \nSome of my knowledge include (but not limited to): \n- Lean for Manufacturing, Development, Implementation and High Volume ramp. \n- Fab, Assembly and Test Process Interaction Knowledge (on several process technologies, from 65nm to 14nm, and from C4 OLGA to FCMBx). \n- Problem Solving and Data analysis Techniques. \n- Six Sigma. \n- Hands on Experience as Quality and Reliability Engineering on Stress development as well as quality control implementation (for Silicon and Packaging) \n- Test Program development knowledge (for stress and testing) \n- 12+ Years of Mgr experience. Self motivated professional with a vast experience on Semiconductor industry (15+ years). From Reliability and stress condition definition, Test Program Content Development, Assy/Test Technology Development, Product Qualification Plan Definition, HVM Certification Plan Definition, to a high volume ramp in a complex manufacturing environment. \n \n \nSome of my knowledge include (but not limited to): \n- Lean for Manufacturing, Development, Implementation and High Volume ramp. \n- Fab, Assembly and Test Process Interaction Knowledge (on several process technologies, from 65nm to 14nm, and from C4 OLGA to FCMBx). \n- Problem Solving and Data analysis Techniques. \n- Six Sigma. \n- Hands on Experience as Quality and Reliability Engineering on Stress development as well as quality control implementation (for Silicon and Packaging) \n- Test Program development knowledge (for stress and testing) \n- 12+ Years of Mgr experience. Self motivated professional with a vast experience on Semiconductor industry (15+ years). From Reliability and stress condition definition, Test Program Content Development, Assy/Test Technology Development, Product Qualification Plan Definition, HVM Certification Plan Definition, to a high volume ramp in a complex manufacturing environment. \n \n \nSome of my knowledge include (but not limited to): \n- Lean for Manufacturing, Development, Implementation and High Volume ramp. \n- Fab, Assembly and Test Process Interaction Knowledge (on several process technologies, from 65nm to 14nm, and from C4 OLGA to FCMBx). \n- Problem Solving and Data analysis Techniques. \n- Six Sigma. \n- Hands on Experience as Quality and Reliability Engineering on Stress development as well as quality control implementation (for Silicon and Packaging) \n- Test Program development knowledge (for stress and testing) \n- 12+ Years of Mgr experience. Experience Intel Custom Foundry HVM Program Manager Intel Corporation July 2014  – Present (1 year 2 months) Portland, Oregon Area Drive development and implementation of scalable Manufacturing Infrastructure processes and systems to successfully support ICF's growing business and their product ramps. Technical Project Mgmt - Assy & Test Technology Transfer for High End Servers and SoC Intel Corporation October 2010  –  July 2014  (3 years 10 months) Phoenix, Arizona Area ATO organization is responsible for the Technology Transfer from Development Site to HVM Site, ensuring that Technology meets or exceeds the quality standards as well as maintaining or improving the manufacturability requirements to ensure a flawless product ramp to meet customer demands. At the same time, ATO works with TD partners on future process technologies to incorporate all learning from current technologies on deployment. Technical Project Manager for New Product Introduction Intel Corporation February 2009  –  September 2010  (1 year 8 months) Costa Rica On charge of the transfer and certification of state of the art CPU for High End Servers and Graphics Processors. Single point of contact between Costa Rica Factory and Technology development sites located accross the world (Malasya, USA, etc). Technical Project Manager (Transfer Mgr) Intel Corporation July 2008  –  January 2009  (7 months) Phoenix, Arizona Area Working as Transfer Manager for the new generation 8core/45nm Server product and next generation of Intel Graphic processor between Assy Test Technology Development Division and Costa Rica Factory to ensure a flawless implementation to HVM. Being the link between Technology Development Site and Costa Rica Factory to cordinate all departments activities to achieve the critical milestones as scheduled. Technical Project Manager for New Product Introduction Intel Corporation March 2007  –  July 2008  (1 year 5 months) Costa Rica As New Product Introduction Mgr for High End Servers (Xeon MP and Itanium) and Graphics Processor, I am responsible to work with all Factory teams to develop and execute a readiness plan for product validation and Factory certification. At the same time, I am the single point of contact between Factory and all divisional teams involve in the Product and Process Technology development. Current product roadmap under my responsibility includes the top three High End products for Intel Corporation. On this position I need to interact with multifunctional teams located on different countries to achieve a common goal and meet the planned schedule (Malaysia, India and USA). I am also responsible to identify critical hidden factors or risk areas and define a plan to overcome those obstacles. Enterprise Microprocessor Group QnR Manager (for Costa Rica group) Intel Corporation June 2005  –  March 2007  (1 year 10 months) Costa Rica On charge of the Costa Rica Enterprise Microprocessor Group QnR Team which direct report to the EMG division in USA. This team is focus on the backend development for Itanium II and Xeon MP Products, including Test Quality, ESD stress development, Burn In development and Qualification process definition/execution. In 2006 the Itanium II (Montecito dual core on 90nm Fab process) and Xeon MP (Tulsa dual core on 65nm Fab process) products were fully supported by the CR EMG team, meeting the best case schedule in both products while achieving all the quality and reliability goals. I owned the Tulsa QRE Lead role during all the backend development process until the final introduction to HVM. Product Quality and Reliability Group Leader Intel Corporation April 2002  –  May 2005  (3 years 2 months) Costa Rica On charge of the CR PQRE team during 3 years, supervising 16 engineers plus two technicians. Responsible for the local factory support for products on HVM and NPI stages. Chair of the CR QnR NPI WG responsible for the proper planning and execution of all CR QnR resources for upcoming products/technologies (including 860, 1260, 1262 and 1264 process technologies). Chair of the Product JQT meeting which manages all QRE recourses at VF level. Chair of the Prescott PPL PRT which manage and disposition 7Mu affected material across 4 sites around the world. Development Product Quality and Reliability Eng Intel Corporation September 2000  –  March 2002  (1 year 7 months) Portland, Oregon Area Working on Intel Oregon for 1.5yrs assignment for the development of 870 chipset (Itanium II chipset on 858 processes). Owned the Burn In development for SNCM/SNCG/SPS chipsets and HVM Optimization plans definition. Burn In development activities for 870 chipset included (but not limited to): DFT definition and validation, Circuit Board bias definition, Circuit Board debug, patterns development (LFSR, BSCAN, SRAM), pattern conversion from S9K format to TEX Oven format and the subsequent debug which required direct interaction with DE/PE team. Worked with DE to perform pre-silicon validation using Shark tool. During assignment, I also supported the Burn In development for other products like SIOH, MHRD, PLUMAS and PLACER working with PG teams on the transfer for MFG. Product Quality and Reliability Engineer for CPU Intel Corporation January 2000  –  September 2000  (9 months) Costa Rica Working as Product QRE supporting the introduction of Katmai (856 process) and Coppermine (858 process) CPU products for OLGA and FCPGA platforms. Responsible for the product health and outgoing quality of these products from Costa Rica Factory. Technical Support Group Supervisor on CPU Mfg floor Intel Corporation October 1998  –  December 1999  (1 year 3 months) Costa Rica Worked as Technical Supervisor in the C4 OLGA Manufacturing area. On charge of 13 Technicians. Responsible for Preventive, Corrective and Improvement Maintenance for all Manufacturing Equipment, including Die Prep, Assembly, Test and Finish area. Single Technical Supervisor for Shift 5 during the whole C4 OLGA process introduction in Costa Rica Factory. Process Engineer on Ceramic Filter process Motorola Mobility October 1997  –  October 1998  (1 year 1 month) Costa Rica Process Engineer for the Surface Mounted Ceramic Filter production process. Responsible for the New Product Introduction, and the continuous improvement of the quality and yield. PVC Plant Manager and Polymer Engineer Phelps Dodge January 1997  –  October 1997  (10 months) Costa Rica Worked as Polymer Engineer and PVC Plant Manager. As Polymer Engineer, I was responsible to identify improvement areas in the PVC production process and develop the proper solution. Example of that was the “fish eye” problem that was fixed by the implementation of a spray system for the plastic component addition inside the mixing machine. As PVC plan Manager, I was responsible for the monthly PVC production to fulfill the demand required by the main Building Wire plant while finding ways to increase the PVC plant capacity. Example of that was the implementation of a new feeding system to load the plastic material without stopping operations, which allowed increasing the plant capacity from 200 Tons to 300 Tons a month Process Engineer for Building Wire production process Phelps Dodge June 1996  –  December 1996  (7 months) Costa Rica Process Engineer responsible for the whole Building Wire Production line, including Drawing Process, Twisting process, Bunching process and Extrusion Process. Products manufactured at this plant included cables like THHN, TSJ, TGP, THN, etc. Research and Development Engineer Costa Rica Institute of Electricity and Telecomunications March 1994  –  December 1995  (1 year 10 months) Costa Rica \tWorked as Research and Development Engineer in the Telecommunications Department. Responsible to design Electronic Equipment to Improve Old Analog Telephonic Equipments by adding new digital features and services. Main project consisted of adding the capability to disconnect/reconnect overdue customers remotely via modem, and to be able to monitor/record the traffic calls for each user. This specific project required the design of an interface board between the telephonic central and a PC computer. It was also developed a program on C++ language to perform all the control required. Intel Custom Foundry HVM Program Manager Intel Corporation July 2014  – Present (1 year 2 months) Portland, Oregon Area Drive development and implementation of scalable Manufacturing Infrastructure processes and systems to successfully support ICF's growing business and their product ramps. Intel Custom Foundry HVM Program Manager Intel Corporation July 2014  – Present (1 year 2 months) Portland, Oregon Area Drive development and implementation of scalable Manufacturing Infrastructure processes and systems to successfully support ICF's growing business and their product ramps. Technical Project Mgmt - Assy & Test Technology Transfer for High End Servers and SoC Intel Corporation October 2010  –  July 2014  (3 years 10 months) Phoenix, Arizona Area ATO organization is responsible for the Technology Transfer from Development Site to HVM Site, ensuring that Technology meets or exceeds the quality standards as well as maintaining or improving the manufacturability requirements to ensure a flawless product ramp to meet customer demands. At the same time, ATO works with TD partners on future process technologies to incorporate all learning from current technologies on deployment. Technical Project Mgmt - Assy & Test Technology Transfer for High End Servers and SoC Intel Corporation October 2010  –  July 2014  (3 years 10 months) Phoenix, Arizona Area ATO organization is responsible for the Technology Transfer from Development Site to HVM Site, ensuring that Technology meets or exceeds the quality standards as well as maintaining or improving the manufacturability requirements to ensure a flawless product ramp to meet customer demands. At the same time, ATO works with TD partners on future process technologies to incorporate all learning from current technologies on deployment. Technical Project Manager for New Product Introduction Intel Corporation February 2009  –  September 2010  (1 year 8 months) Costa Rica On charge of the transfer and certification of state of the art CPU for High End Servers and Graphics Processors. Single point of contact between Costa Rica Factory and Technology development sites located accross the world (Malasya, USA, etc). Technical Project Manager for New Product Introduction Intel Corporation February 2009  –  September 2010  (1 year 8 months) Costa Rica On charge of the transfer and certification of state of the art CPU for High End Servers and Graphics Processors. Single point of contact between Costa Rica Factory and Technology development sites located accross the world (Malasya, USA, etc). Technical Project Manager (Transfer Mgr) Intel Corporation July 2008  –  January 2009  (7 months) Phoenix, Arizona Area Working as Transfer Manager for the new generation 8core/45nm Server product and next generation of Intel Graphic processor between Assy Test Technology Development Division and Costa Rica Factory to ensure a flawless implementation to HVM. Being the link between Technology Development Site and Costa Rica Factory to cordinate all departments activities to achieve the critical milestones as scheduled. Technical Project Manager (Transfer Mgr) Intel Corporation July 2008  –  January 2009  (7 months) Phoenix, Arizona Area Working as Transfer Manager for the new generation 8core/45nm Server product and next generation of Intel Graphic processor between Assy Test Technology Development Division and Costa Rica Factory to ensure a flawless implementation to HVM. Being the link between Technology Development Site and Costa Rica Factory to cordinate all departments activities to achieve the critical milestones as scheduled. Technical Project Manager for New Product Introduction Intel Corporation March 2007  –  July 2008  (1 year 5 months) Costa Rica As New Product Introduction Mgr for High End Servers (Xeon MP and Itanium) and Graphics Processor, I am responsible to work with all Factory teams to develop and execute a readiness plan for product validation and Factory certification. At the same time, I am the single point of contact between Factory and all divisional teams involve in the Product and Process Technology development. Current product roadmap under my responsibility includes the top three High End products for Intel Corporation. On this position I need to interact with multifunctional teams located on different countries to achieve a common goal and meet the planned schedule (Malaysia, India and USA). I am also responsible to identify critical hidden factors or risk areas and define a plan to overcome those obstacles. Technical Project Manager for New Product Introduction Intel Corporation March 2007  –  July 2008  (1 year 5 months) Costa Rica As New Product Introduction Mgr for High End Servers (Xeon MP and Itanium) and Graphics Processor, I am responsible to work with all Factory teams to develop and execute a readiness plan for product validation and Factory certification. At the same time, I am the single point of contact between Factory and all divisional teams involve in the Product and Process Technology development. Current product roadmap under my responsibility includes the top three High End products for Intel Corporation. On this position I need to interact with multifunctional teams located on different countries to achieve a common goal and meet the planned schedule (Malaysia, India and USA). I am also responsible to identify critical hidden factors or risk areas and define a plan to overcome those obstacles. Enterprise Microprocessor Group QnR Manager (for Costa Rica group) Intel Corporation June 2005  –  March 2007  (1 year 10 months) Costa Rica On charge of the Costa Rica Enterprise Microprocessor Group QnR Team which direct report to the EMG division in USA. This team is focus on the backend development for Itanium II and Xeon MP Products, including Test Quality, ESD stress development, Burn In development and Qualification process definition/execution. In 2006 the Itanium II (Montecito dual core on 90nm Fab process) and Xeon MP (Tulsa dual core on 65nm Fab process) products were fully supported by the CR EMG team, meeting the best case schedule in both products while achieving all the quality and reliability goals. I owned the Tulsa QRE Lead role during all the backend development process until the final introduction to HVM. Enterprise Microprocessor Group QnR Manager (for Costa Rica group) Intel Corporation June 2005  –  March 2007  (1 year 10 months) Costa Rica On charge of the Costa Rica Enterprise Microprocessor Group QnR Team which direct report to the EMG division in USA. This team is focus on the backend development for Itanium II and Xeon MP Products, including Test Quality, ESD stress development, Burn In development and Qualification process definition/execution. In 2006 the Itanium II (Montecito dual core on 90nm Fab process) and Xeon MP (Tulsa dual core on 65nm Fab process) products were fully supported by the CR EMG team, meeting the best case schedule in both products while achieving all the quality and reliability goals. I owned the Tulsa QRE Lead role during all the backend development process until the final introduction to HVM. Product Quality and Reliability Group Leader Intel Corporation April 2002  –  May 2005  (3 years 2 months) Costa Rica On charge of the CR PQRE team during 3 years, supervising 16 engineers plus two technicians. Responsible for the local factory support for products on HVM and NPI stages. Chair of the CR QnR NPI WG responsible for the proper planning and execution of all CR QnR resources for upcoming products/technologies (including 860, 1260, 1262 and 1264 process technologies). Chair of the Product JQT meeting which manages all QRE recourses at VF level. Chair of the Prescott PPL PRT which manage and disposition 7Mu affected material across 4 sites around the world. Product Quality and Reliability Group Leader Intel Corporation April 2002  –  May 2005  (3 years 2 months) Costa Rica On charge of the CR PQRE team during 3 years, supervising 16 engineers plus two technicians. Responsible for the local factory support for products on HVM and NPI stages. Chair of the CR QnR NPI WG responsible for the proper planning and execution of all CR QnR resources for upcoming products/technologies (including 860, 1260, 1262 and 1264 process technologies). Chair of the Product JQT meeting which manages all QRE recourses at VF level. Chair of the Prescott PPL PRT which manage and disposition 7Mu affected material across 4 sites around the world. Development Product Quality and Reliability Eng Intel Corporation September 2000  –  March 2002  (1 year 7 months) Portland, Oregon Area Working on Intel Oregon for 1.5yrs assignment for the development of 870 chipset (Itanium II chipset on 858 processes). Owned the Burn In development for SNCM/SNCG/SPS chipsets and HVM Optimization plans definition. Burn In development activities for 870 chipset included (but not limited to): DFT definition and validation, Circuit Board bias definition, Circuit Board debug, patterns development (LFSR, BSCAN, SRAM), pattern conversion from S9K format to TEX Oven format and the subsequent debug which required direct interaction with DE/PE team. Worked with DE to perform pre-silicon validation using Shark tool. During assignment, I also supported the Burn In development for other products like SIOH, MHRD, PLUMAS and PLACER working with PG teams on the transfer for MFG. Development Product Quality and Reliability Eng Intel Corporation September 2000  –  March 2002  (1 year 7 months) Portland, Oregon Area Working on Intel Oregon for 1.5yrs assignment for the development of 870 chipset (Itanium II chipset on 858 processes). Owned the Burn In development for SNCM/SNCG/SPS chipsets and HVM Optimization plans definition. Burn In development activities for 870 chipset included (but not limited to): DFT definition and validation, Circuit Board bias definition, Circuit Board debug, patterns development (LFSR, BSCAN, SRAM), pattern conversion from S9K format to TEX Oven format and the subsequent debug which required direct interaction with DE/PE team. Worked with DE to perform pre-silicon validation using Shark tool. During assignment, I also supported the Burn In development for other products like SIOH, MHRD, PLUMAS and PLACER working with PG teams on the transfer for MFG. Product Quality and Reliability Engineer for CPU Intel Corporation January 2000  –  September 2000  (9 months) Costa Rica Working as Product QRE supporting the introduction of Katmai (856 process) and Coppermine (858 process) CPU products for OLGA and FCPGA platforms. Responsible for the product health and outgoing quality of these products from Costa Rica Factory. Product Quality and Reliability Engineer for CPU Intel Corporation January 2000  –  September 2000  (9 months) Costa Rica Working as Product QRE supporting the introduction of Katmai (856 process) and Coppermine (858 process) CPU products for OLGA and FCPGA platforms. Responsible for the product health and outgoing quality of these products from Costa Rica Factory. Technical Support Group Supervisor on CPU Mfg floor Intel Corporation October 1998  –  December 1999  (1 year 3 months) Costa Rica Worked as Technical Supervisor in the C4 OLGA Manufacturing area. On charge of 13 Technicians. Responsible for Preventive, Corrective and Improvement Maintenance for all Manufacturing Equipment, including Die Prep, Assembly, Test and Finish area. Single Technical Supervisor for Shift 5 during the whole C4 OLGA process introduction in Costa Rica Factory. Technical Support Group Supervisor on CPU Mfg floor Intel Corporation October 1998  –  December 1999  (1 year 3 months) Costa Rica Worked as Technical Supervisor in the C4 OLGA Manufacturing area. On charge of 13 Technicians. Responsible for Preventive, Corrective and Improvement Maintenance for all Manufacturing Equipment, including Die Prep, Assembly, Test and Finish area. Single Technical Supervisor for Shift 5 during the whole C4 OLGA process introduction in Costa Rica Factory. Process Engineer on Ceramic Filter process Motorola Mobility October 1997  –  October 1998  (1 year 1 month) Costa Rica Process Engineer for the Surface Mounted Ceramic Filter production process. Responsible for the New Product Introduction, and the continuous improvement of the quality and yield. Process Engineer on Ceramic Filter process Motorola Mobility October 1997  –  October 1998  (1 year 1 month) Costa Rica Process Engineer for the Surface Mounted Ceramic Filter production process. Responsible for the New Product Introduction, and the continuous improvement of the quality and yield. PVC Plant Manager and Polymer Engineer Phelps Dodge January 1997  –  October 1997  (10 months) Costa Rica Worked as Polymer Engineer and PVC Plant Manager. As Polymer Engineer, I was responsible to identify improvement areas in the PVC production process and develop the proper solution. Example of that was the “fish eye” problem that was fixed by the implementation of a spray system for the plastic component addition inside the mixing machine. As PVC plan Manager, I was responsible for the monthly PVC production to fulfill the demand required by the main Building Wire plant while finding ways to increase the PVC plant capacity. Example of that was the implementation of a new feeding system to load the plastic material without stopping operations, which allowed increasing the plant capacity from 200 Tons to 300 Tons a month PVC Plant Manager and Polymer Engineer Phelps Dodge January 1997  –  October 1997  (10 months) Costa Rica Worked as Polymer Engineer and PVC Plant Manager. As Polymer Engineer, I was responsible to identify improvement areas in the PVC production process and develop the proper solution. Example of that was the “fish eye” problem that was fixed by the implementation of a spray system for the plastic component addition inside the mixing machine. As PVC plan Manager, I was responsible for the monthly PVC production to fulfill the demand required by the main Building Wire plant while finding ways to increase the PVC plant capacity. Example of that was the implementation of a new feeding system to load the plastic material without stopping operations, which allowed increasing the plant capacity from 200 Tons to 300 Tons a month Process Engineer for Building Wire production process Phelps Dodge June 1996  –  December 1996  (7 months) Costa Rica Process Engineer responsible for the whole Building Wire Production line, including Drawing Process, Twisting process, Bunching process and Extrusion Process. Products manufactured at this plant included cables like THHN, TSJ, TGP, THN, etc. Process Engineer for Building Wire production process Phelps Dodge June 1996  –  December 1996  (7 months) Costa Rica Process Engineer responsible for the whole Building Wire Production line, including Drawing Process, Twisting process, Bunching process and Extrusion Process. Products manufactured at this plant included cables like THHN, TSJ, TGP, THN, etc. Research and Development Engineer Costa Rica Institute of Electricity and Telecomunications March 1994  –  December 1995  (1 year 10 months) Costa Rica \tWorked as Research and Development Engineer in the Telecommunications Department. Responsible to design Electronic Equipment to Improve Old Analog Telephonic Equipments by adding new digital features and services. Main project consisted of adding the capability to disconnect/reconnect overdue customers remotely via modem, and to be able to monitor/record the traffic calls for each user. This specific project required the design of an interface board between the telephonic central and a PC computer. It was also developed a program on C++ language to perform all the control required. Research and Development Engineer Costa Rica Institute of Electricity and Telecomunications March 1994  –  December 1995  (1 year 10 months) Costa Rica \tWorked as Research and Development Engineer in the Telecommunications Department. Responsible to design Electronic Equipment to Improve Old Analog Telephonic Equipments by adding new digital features and services. Main project consisted of adding the capability to disconnect/reconnect overdue customers remotely via modem, and to be able to monitor/record the traffic calls for each user. This specific project required the design of an interface board between the telephonic central and a PC computer. It was also developed a program on C++ language to perform all the control required. Languages English Spanish English Spanish English Spanish Skills Testing Electronics Lean Manufacturing Semiconductors Continuous Improvement Intel Product Development Silicon Design of Experiments Semiconductor Industry Project Management Process Engineering IC Debugging Engineering Quality Management People Development C++ Test Program Development Burn In Stress... Defect Identification Semiconductors Quality... Foundry Management C++ programing PEARL programing Fab, Assembly and Test... Package Stress... Six Sigman Technology Transfer... JTAG and TAP programing C4 process FCBGA process FCLGA process FCMB process OSAT ASIC Lean manufacturing See 22+     See less Skills  Testing Electronics Lean Manufacturing Semiconductors Continuous Improvement Intel Product Development Silicon Design of Experiments Semiconductor Industry Project Management Process Engineering IC Debugging Engineering Quality Management People Development C++ Test Program Development Burn In Stress... Defect Identification Semiconductors Quality... Foundry Management C++ programing PEARL programing Fab, Assembly and Test... Package Stress... Six Sigman Technology Transfer... JTAG and TAP programing C4 process FCBGA process FCLGA process FCMB process OSAT ASIC Lean manufacturing See 22+     See less Testing Electronics Lean Manufacturing Semiconductors Continuous Improvement Intel Product Development Silicon Design of Experiments Semiconductor Industry Project Management Process Engineering IC Debugging Engineering Quality Management People Development C++ Test Program Development Burn In Stress... Defect Identification Semiconductors Quality... Foundry Management C++ programing PEARL programing Fab, Assembly and Test... Package Stress... Six Sigman Technology Transfer... JTAG and TAP programing C4 process FCBGA process FCLGA process FCMB process OSAT ASIC Lean manufacturing See 22+     See less Testing Electronics Lean Manufacturing Semiconductors Continuous Improvement Intel Product Development Silicon Design of Experiments Semiconductor Industry Project Management Process Engineering IC Debugging Engineering Quality Management People Development C++ Test Program Development Burn In Stress... Defect Identification Semiconductors Quality... Foundry Management C++ programing PEARL programing Fab, Assembly and Test... Package Stress... Six Sigman Technology Transfer... JTAG and TAP programing C4 process FCBGA process FCLGA process FCMB process OSAT ASIC Lean manufacturing See 22+     See less Education Universidad de Costa Rica Licenciado,  Electrical Engineering 1994  – 1996 Participated in Soccer Teams, EE congress organization, University Week Celebration Organization. Activities and Societies:  Asociation of EE Students at University of Costa Rica Universidad de Costa Rica Bachelor,  Electrical Engineering 1988  – 1993 Universidad de Costa Rica Licenciado,  Electrical Engineering 1994  – 1996 Participated in Soccer Teams, EE congress organization, University Week Celebration Organization. Activities and Societies:  Asociation of EE Students at University of Costa Rica Universidad de Costa Rica Licenciado,  Electrical Engineering 1994  – 1996 Participated in Soccer Teams, EE congress organization, University Week Celebration Organization. Activities and Societies:  Asociation of EE Students at University of Costa Rica Universidad de Costa Rica Licenciado,  Electrical Engineering 1994  – 1996 Participated in Soccer Teams, EE congress organization, University Week Celebration Organization. Activities and Societies:  Asociation of EE Students at University of Costa Rica Universidad de Costa Rica Bachelor,  Electrical Engineering 1988  – 1993 Universidad de Costa Rica Bachelor,  Electrical Engineering 1988  – 1993 Universidad de Costa Rica Bachelor,  Electrical Engineering 1988  – 1993 ", "Summary 16 years of mobile industry knowledge, 10 years of leadership experience (with line duties) with a foundation in software development. Single point of contact within Nokia for software deliverables for Sprint and Vivo with volumes exceeding 1 million phones per year. Summary 16 years of mobile industry knowledge, 10 years of leadership experience (with line duties) with a foundation in software development. Single point of contact within Nokia for software deliverables for Sprint and Vivo with volumes exceeding 1 million phones per year. 16 years of mobile industry knowledge, 10 years of leadership experience (with line duties) with a foundation in software development. Single point of contact within Nokia for software deliverables for Sprint and Vivo with volumes exceeding 1 million phones per year. 16 years of mobile industry knowledge, 10 years of leadership experience (with line duties) with a foundation in software development. Single point of contact within Nokia for software deliverables for Sprint and Vivo with volumes exceeding 1 million phones per year. Experience Program Manager Intel Corporation July 2011  – Present (4 years 2 months) Santa Clara Program Manager Intel Corporation July 2011  – Present (4 years 2 months) Santa Clara Program Manager Intel Corporation July 2011  – Present (4 years 2 months) Santa Clara Skills Program Management Mobile Devices Mobile Communications Wireless Product Management Product Lifecycle... Telecommunications CDMA Embedded Systems Product Planning Mobile Technology Software Project... Cross-functional Team... Cellular Communications Software Development Skills  Program Management Mobile Devices Mobile Communications Wireless Product Management Product Lifecycle... Telecommunications CDMA Embedded Systems Product Planning Mobile Technology Software Project... Cross-functional Team... Cellular Communications Software Development Program Management Mobile Devices Mobile Communications Wireless Product Management Product Lifecycle... Telecommunications CDMA Embedded Systems Product Planning Mobile Technology Software Project... Cross-functional Team... Cellular Communications Software Development Program Management Mobile Devices Mobile Communications Wireless Product Management Product Lifecycle... Telecommunications CDMA Embedded Systems Product Planning Mobile Technology Software Project... Cross-functional Team... Cellular Communications Software Development Education University of Twente MS,  Electric Engineering 1985  – 1989 Noordelijke Hogeschool Leeuwarden BS,  Electrical Engineering 1981  – 1985 University of Twente MS,  Electric Engineering 1985  – 1989 University of Twente MS,  Electric Engineering 1985  – 1989 University of Twente MS,  Electric Engineering 1985  – 1989 Noordelijke Hogeschool Leeuwarden BS,  Electrical Engineering 1981  – 1985 Noordelijke Hogeschool Leeuwarden BS,  Electrical Engineering 1981  – 1985 Noordelijke Hogeschool Leeuwarden BS,  Electrical Engineering 1981  – 1985 ", "Summary Amy is a demonstrated leader in the area of technical project management, internationalization and localization, and people management. She is an excellent communicator and problem solver. Amy's outstanding customer service, attention to detail, and people skills will add value to any organization. Summary Amy is a demonstrated leader in the area of technical project management, internationalization and localization, and people management. She is an excellent communicator and problem solver. Amy's outstanding customer service, attention to detail, and people skills will add value to any organization. Amy is a demonstrated leader in the area of technical project management, internationalization and localization, and people management. She is an excellent communicator and problem solver. Amy's outstanding customer service, attention to detail, and people skills will add value to any organization. Amy is a demonstrated leader in the area of technical project management, internationalization and localization, and people management. She is an excellent communicator and problem solver. Amy's outstanding customer service, attention to detail, and people skills will add value to any organization. Skills Skills     ", "Languages Tamil Kannada Tamil Kannada Tamil Kannada Skills Software Project... Agile Methodologies Program Management Agile Project Management SDLC Software Development Scrum PMP Requirements Analysis PMO Business Analysis Integration Vendor Management Cross-functional Team... Product Management Project Management Software Engineering Project Portfolio... SharePoint ITIL SFDC Salesforce.com Cloud Applications Intel SOA SQL Unix C++ Certified Scrum Master... Cloud Computing CRM IT Strategy SaaS Global Delivery IT Service Management IT Management Outsourcing Solution Architecture Development Of Employees Telecommunications Enterprise Software Business Intelligence Process Improvement Management Enterprise Architecture Requirements Gathering Partner Management Big Data Team Management PMI See 35+     See less Skills  Software Project... Agile Methodologies Program Management Agile Project Management SDLC Software Development Scrum PMP Requirements Analysis PMO Business Analysis Integration Vendor Management Cross-functional Team... Product Management Project Management Software Engineering Project Portfolio... SharePoint ITIL SFDC Salesforce.com Cloud Applications Intel SOA SQL Unix C++ Certified Scrum Master... Cloud Computing CRM IT Strategy SaaS Global Delivery IT Service Management IT Management Outsourcing Solution Architecture Development Of Employees Telecommunications Enterprise Software Business Intelligence Process Improvement Management Enterprise Architecture Requirements Gathering Partner Management Big Data Team Management PMI See 35+     See less Software Project... Agile Methodologies Program Management Agile Project Management SDLC Software Development Scrum PMP Requirements Analysis PMO Business Analysis Integration Vendor Management Cross-functional Team... Product Management Project Management Software Engineering Project Portfolio... SharePoint ITIL SFDC Salesforce.com Cloud Applications Intel SOA SQL Unix C++ Certified Scrum Master... Cloud Computing CRM IT Strategy SaaS Global Delivery IT Service Management IT Management Outsourcing Solution Architecture Development Of Employees Telecommunications Enterprise Software Business Intelligence Process Improvement Management Enterprise Architecture Requirements Gathering Partner Management Big Data Team Management PMI See 35+     See less Software Project... Agile Methodologies Program Management Agile Project Management SDLC Software Development Scrum PMP Requirements Analysis PMO Business Analysis Integration Vendor Management Cross-functional Team... Product Management Project Management Software Engineering Project Portfolio... SharePoint ITIL SFDC Salesforce.com Cloud Applications Intel SOA SQL Unix C++ Certified Scrum Master... Cloud Computing CRM IT Strategy SaaS Global Delivery IT Service Management IT Management Outsourcing Solution Architecture Development Of Employees Telecommunications Enterprise Software Business Intelligence Process Improvement Management Enterprise Architecture Requirements Gathering Partner Management Big Data Team Management PMI See 35+     See less ", "Summary PMP® certified Program/Project Manager having 12 years of experience in Software development in technology industry and most recently as a Project Manager in the area of Business Intelligence, Analytics & Cloud Computing. \n \nWorking at multiple levels with Engineering, Sales & Marketing, Sponsors, Customers, systems integrator partners to manage the end-to-end Product/project life cycle. \n \nTechnical experience in the diversified field of Business Intelligence, Data-warehouse, Hadoop (Big Data), HANA, Analytics SaaS/ITaaS (Software as a Service & IT as a Service), Virtualization, Cloud Apps & Cloud Application Management for platforms (CAPM), Server & Storage technologies, Data Center, Real Time Operating System.  \n \nSpecialties:  \nProgram Management methodologies, \nHands-on SW development (C/C++, Perl, Ruby, Linux, Windows, OOAD, VxWorks, CITRIX XenServer, Data Structure, Algorithms),  \nSW Release Management,  \nConsistent history of success and high achievement \nRisk Management,  \nBudget Planning & Management,  \nCustomer Engagement,  \nVendor Management,  \nSW security, \nQuality and Process Improvement.  \nSoft Skills include Leadership, communication, team building, organizational skills, creative thinking and ability to drive results, mentoring. Summary PMP® certified Program/Project Manager having 12 years of experience in Software development in technology industry and most recently as a Project Manager in the area of Business Intelligence, Analytics & Cloud Computing. \n \nWorking at multiple levels with Engineering, Sales & Marketing, Sponsors, Customers, systems integrator partners to manage the end-to-end Product/project life cycle. \n \nTechnical experience in the diversified field of Business Intelligence, Data-warehouse, Hadoop (Big Data), HANA, Analytics SaaS/ITaaS (Software as a Service & IT as a Service), Virtualization, Cloud Apps & Cloud Application Management for platforms (CAPM), Server & Storage technologies, Data Center, Real Time Operating System.  \n \nSpecialties:  \nProgram Management methodologies, \nHands-on SW development (C/C++, Perl, Ruby, Linux, Windows, OOAD, VxWorks, CITRIX XenServer, Data Structure, Algorithms),  \nSW Release Management,  \nConsistent history of success and high achievement \nRisk Management,  \nBudget Planning & Management,  \nCustomer Engagement,  \nVendor Management,  \nSW security, \nQuality and Process Improvement.  \nSoft Skills include Leadership, communication, team building, organizational skills, creative thinking and ability to drive results, mentoring. PMP® certified Program/Project Manager having 12 years of experience in Software development in technology industry and most recently as a Project Manager in the area of Business Intelligence, Analytics & Cloud Computing. \n \nWorking at multiple levels with Engineering, Sales & Marketing, Sponsors, Customers, systems integrator partners to manage the end-to-end Product/project life cycle. \n \nTechnical experience in the diversified field of Business Intelligence, Data-warehouse, Hadoop (Big Data), HANA, Analytics SaaS/ITaaS (Software as a Service & IT as a Service), Virtualization, Cloud Apps & Cloud Application Management for platforms (CAPM), Server & Storage technologies, Data Center, Real Time Operating System.  \n \nSpecialties:  \nProgram Management methodologies, \nHands-on SW development (C/C++, Perl, Ruby, Linux, Windows, OOAD, VxWorks, CITRIX XenServer, Data Structure, Algorithms),  \nSW Release Management,  \nConsistent history of success and high achievement \nRisk Management,  \nBudget Planning & Management,  \nCustomer Engagement,  \nVendor Management,  \nSW security, \nQuality and Process Improvement.  \nSoft Skills include Leadership, communication, team building, organizational skills, creative thinking and ability to drive results, mentoring. PMP® certified Program/Project Manager having 12 years of experience in Software development in technology industry and most recently as a Project Manager in the area of Business Intelligence, Analytics & Cloud Computing. \n \nWorking at multiple levels with Engineering, Sales & Marketing, Sponsors, Customers, systems integrator partners to manage the end-to-end Product/project life cycle. \n \nTechnical experience in the diversified field of Business Intelligence, Data-warehouse, Hadoop (Big Data), HANA, Analytics SaaS/ITaaS (Software as a Service & IT as a Service), Virtualization, Cloud Apps & Cloud Application Management for platforms (CAPM), Server & Storage technologies, Data Center, Real Time Operating System.  \n \nSpecialties:  \nProgram Management methodologies, \nHands-on SW development (C/C++, Perl, Ruby, Linux, Windows, OOAD, VxWorks, CITRIX XenServer, Data Structure, Algorithms),  \nSW Release Management,  \nConsistent history of success and high achievement \nRisk Management,  \nBudget Planning & Management,  \nCustomer Engagement,  \nVendor Management,  \nSW security, \nQuality and Process Improvement.  \nSoft Skills include Leadership, communication, team building, organizational skills, creative thinking and ability to drive results, mentoring. Experience Technical Project Manager Intel Corporation August 2013  – Present (2 years 1 month) Bengaluru Area, India Enterprise Capability: Business Intelligence/Analytics/Big Data/Data-warehouse Project Lead/Program Manager Intel Corporation January 2010  –  July 2013  (3 years 7 months) Bengaluru Area, India Program Manager in the area of cloud computing (SaaS) and Virtualization. Software Engineer Intel Technolgy India Pvt Ltd April 2006  –  December 2009  (3 years 9 months) Software Design and Development for Server Management/Data center Management, Storage Technologies. Software Engineer Aricent Group August 2005  –  April 2006  (9 months) Bengaluru Area, India Software Design and Development for telecom Routers (UMTS/CDMA). Software Engineer Mahindra Satyam July 2003  –  August 2005  (2 years 2 months) Hyderabad/Bengaluru Software Development in System/Embedded domain Technical Project Manager Intel Corporation August 2013  – Present (2 years 1 month) Bengaluru Area, India Enterprise Capability: Business Intelligence/Analytics/Big Data/Data-warehouse Technical Project Manager Intel Corporation August 2013  – Present (2 years 1 month) Bengaluru Area, India Enterprise Capability: Business Intelligence/Analytics/Big Data/Data-warehouse Project Lead/Program Manager Intel Corporation January 2010  –  July 2013  (3 years 7 months) Bengaluru Area, India Program Manager in the area of cloud computing (SaaS) and Virtualization. Project Lead/Program Manager Intel Corporation January 2010  –  July 2013  (3 years 7 months) Bengaluru Area, India Program Manager in the area of cloud computing (SaaS) and Virtualization. Software Engineer Intel Technolgy India Pvt Ltd April 2006  –  December 2009  (3 years 9 months) Software Design and Development for Server Management/Data center Management, Storage Technologies. Software Engineer Intel Technolgy India Pvt Ltd April 2006  –  December 2009  (3 years 9 months) Software Design and Development for Server Management/Data center Management, Storage Technologies. Software Engineer Aricent Group August 2005  –  April 2006  (9 months) Bengaluru Area, India Software Design and Development for telecom Routers (UMTS/CDMA). Software Engineer Aricent Group August 2005  –  April 2006  (9 months) Bengaluru Area, India Software Design and Development for telecom Routers (UMTS/CDMA). Software Engineer Mahindra Satyam July 2003  –  August 2005  (2 years 2 months) Hyderabad/Bengaluru Software Development in System/Embedded domain Software Engineer Mahindra Satyam July 2003  –  August 2005  (2 years 2 months) Hyderabad/Bengaluru Software Development in System/Embedded domain Skills Linux Debugging Program Management SDLC Embedded Systems C Embedded Software Software Quality... Software Design Enterprise Software Software Engineering... SaaS Scrum Business Intelligence Hadoop Agile Scrum Data Warehouse... Big Data Datawarehouse Digital Marketing See 5+     See less Skills  Linux Debugging Program Management SDLC Embedded Systems C Embedded Software Software Quality... Software Design Enterprise Software Software Engineering... SaaS Scrum Business Intelligence Hadoop Agile Scrum Data Warehouse... Big Data Datawarehouse Digital Marketing See 5+     See less Linux Debugging Program Management SDLC Embedded Systems C Embedded Software Software Quality... Software Design Enterprise Software Software Engineering... SaaS Scrum Business Intelligence Hadoop Agile Scrum Data Warehouse... Big Data Datawarehouse Digital Marketing See 5+     See less Linux Debugging Program Management SDLC Embedded Systems C Embedded Software Software Quality... Software Design Enterprise Software Software Engineering... SaaS Scrum Business Intelligence Hadoop Agile Scrum Data Warehouse... Big Data Datawarehouse Digital Marketing See 5+     See less Education Birla Institute of Technology B.E.,  Elcectronics and Communication 1999  – 2003 Birla Institute of Technology B.E.,  Elcectronics and Communication 1999  – 2003 Birla Institute of Technology B.E.,  Elcectronics and Communication 1999  – 2003 Birla Institute of Technology B.E.,  Elcectronics and Communication 1999  – 2003 ", "Summary \t20+ years of experience in all phases of Software and Project Management Life cycles and Operations Management. Software development using Agile Methodologies. \n\t10+ years of experience leading Major technology transfers from Logic Technology Development Facility to Virtual Factories both within the US and International.  \n\t10+ years’ experience in Org wide Long Range Planning, Budgeting and Resource management, Vendor Management, Procurement, Contract creation/renewal, Security Management, On-boarding etc., \n\tAs Factory Sort Manufacturing (FSM) Project Manager, responsible for multiple Cross-Site Virtual Factory projects. \n\tAs Integration Engineer at Ocotillo Site Automation led LEAN initiatives in resolving Factory issues. \n\tAs Technology Transfer Lead, helped startup 3 different factories in 5 Major Process technologies. Worked with X-Org and X-Geo teams in successful project executions. \n\tHighly regarded by peers for cross domain integrated automation expertise. \n\tEffective Crisis Manager with ability to lead technical teams and quickly resolve crisis events. \n\tReceived multiple Department and Organization level awards for upholding Intel Values \n\tRegular participant in Information Technology and Factory Sort Manufacturing mentor-ship programs as both Mentor and Mentee. \n\tMultiple Group Leader Experience and Engineering Manager Experience Summary \t20+ years of experience in all phases of Software and Project Management Life cycles and Operations Management. Software development using Agile Methodologies. \n\t10+ years of experience leading Major technology transfers from Logic Technology Development Facility to Virtual Factories both within the US and International.  \n\t10+ years’ experience in Org wide Long Range Planning, Budgeting and Resource management, Vendor Management, Procurement, Contract creation/renewal, Security Management, On-boarding etc., \n\tAs Factory Sort Manufacturing (FSM) Project Manager, responsible for multiple Cross-Site Virtual Factory projects. \n\tAs Integration Engineer at Ocotillo Site Automation led LEAN initiatives in resolving Factory issues. \n\tAs Technology Transfer Lead, helped startup 3 different factories in 5 Major Process technologies. Worked with X-Org and X-Geo teams in successful project executions. \n\tHighly regarded by peers for cross domain integrated automation expertise. \n\tEffective Crisis Manager with ability to lead technical teams and quickly resolve crisis events. \n\tReceived multiple Department and Organization level awards for upholding Intel Values \n\tRegular participant in Information Technology and Factory Sort Manufacturing mentor-ship programs as both Mentor and Mentee. \n\tMultiple Group Leader Experience and Engineering Manager Experience \t20+ years of experience in all phases of Software and Project Management Life cycles and Operations Management. Software development using Agile Methodologies. \n\t10+ years of experience leading Major technology transfers from Logic Technology Development Facility to Virtual Factories both within the US and International.  \n\t10+ years’ experience in Org wide Long Range Planning, Budgeting and Resource management, Vendor Management, Procurement, Contract creation/renewal, Security Management, On-boarding etc., \n\tAs Factory Sort Manufacturing (FSM) Project Manager, responsible for multiple Cross-Site Virtual Factory projects. \n\tAs Integration Engineer at Ocotillo Site Automation led LEAN initiatives in resolving Factory issues. \n\tAs Technology Transfer Lead, helped startup 3 different factories in 5 Major Process technologies. Worked with X-Org and X-Geo teams in successful project executions. \n\tHighly regarded by peers for cross domain integrated automation expertise. \n\tEffective Crisis Manager with ability to lead technical teams and quickly resolve crisis events. \n\tReceived multiple Department and Organization level awards for upholding Intel Values \n\tRegular participant in Information Technology and Factory Sort Manufacturing mentor-ship programs as both Mentor and Mentee. \n\tMultiple Group Leader Experience and Engineering Manager Experience \t20+ years of experience in all phases of Software and Project Management Life cycles and Operations Management. Software development using Agile Methodologies. \n\t10+ years of experience leading Major technology transfers from Logic Technology Development Facility to Virtual Factories both within the US and International.  \n\t10+ years’ experience in Org wide Long Range Planning, Budgeting and Resource management, Vendor Management, Procurement, Contract creation/renewal, Security Management, On-boarding etc., \n\tAs Factory Sort Manufacturing (FSM) Project Manager, responsible for multiple Cross-Site Virtual Factory projects. \n\tAs Integration Engineer at Ocotillo Site Automation led LEAN initiatives in resolving Factory issues. \n\tAs Technology Transfer Lead, helped startup 3 different factories in 5 Major Process technologies. Worked with X-Org and X-Geo teams in successful project executions. \n\tHighly regarded by peers for cross domain integrated automation expertise. \n\tEffective Crisis Manager with ability to lead technical teams and quickly resolve crisis events. \n\tReceived multiple Department and Organization level awards for upholding Intel Values \n\tRegular participant in Information Technology and Factory Sort Manufacturing mentor-ship programs as both Mentor and Mentee. \n\tMultiple Group Leader Experience and Engineering Manager Experience Experience Technical Project/Program Manager Intel Corporation December 2012  –  July 2015  (2 years 8 months) Phoenix, Arizona Area INTEL CUSTOM FOUNDRY Operations Systems Engineer \n\tContent Management Project Lead: As the chair of the Content Management working group, my responsibilities includes prioritizing requirements, providing impact analysis to IT to deliver the project, architecture/approving the solution, conducting map-days for execution of the projects and production release followed by support and sustaining.  \n\tMDM Project Lead: Defined the Charter for Master Data Management within Foundry and kicked off the Project for MDM to optimize and remove redundant data sources within the Organization. \n\tICF Systems Architecture Lead: Manage a meeting to understand the systems requirements of ICF and define a Roadmap with IT and track the project to completion. Reporting Framework (SSRS and SPBI), Enterprise Data Warehouse (Teradata) HR Data and Competitive Analysis and Customer Offering and Pricing are a few of the ICF Org projects that I architect, implement, communicate and support.  \n\tSecurity Management Working Group Chair : Defined architecture, designed and implemented a solution to consolidate, converge and streamline access control/security access for all of the organizations services and applications. \nINTEL FOUNDRY SERVICES : Core Services Manager: \n\tIFS Service Lead for the Intel Foundry Core Service Applications. Managed a team of Business Analysts and System Analysts and drove IT to Build, Support and sustain these services that are used by both Internal and External Foundry Customers.  \n\tBPMS Lead: To help close the OHS(Organization Health Survey) Action Required of a lack of a Business Process Management tool for ICF, Implemented BPLogix Process Director. Set up the Infrastructure, built a team to support the Org requirements and create Work flows to automate Business process, defined optimized Business Process and closed the gap in concerns with the employee effectiveness. Operations Lead Intel Corporation January 2012  –  December 2012  (1 year) Phoenix, Arizona Area \tFile Transfer Service Manager: Work with Enterprise customers in provisioning their Secure File Transfer needs. Own the Enterprise SFT instance, supporting 15+ and growing enterprise customers. \n-\tRe-negotiated contract and support structure for Secure File Transfer services provided by IBM. Initial contract signed with Sterling did not meet the needs of the organization once they were acquired by IBM. \n\tOperations Lead: As a Staff member reporting to executive members, working on standardizing Process, Monitors and Support structure across the group. FSM - Manufacturing IT - Integration Engineer Intel Corp April 2001  –  December 2011  (10 years 9 months) Phoenix, Arizona Area Technical Domain and Operations Lead: \n\tDomain transfer lead for Multiple 300mm process technology transfer from LTD to Virtual Factory.  \n\tManaging Product Installation to ensure 100% VF Plan of Record Matching (POR) for each technology transfer to enable Run-the-Lot (RTL), Level 1D (L1D) and factory ramp milestones. \n \nStaff Integration Engineer: \n\tWith extensive knowledge of cross-domain integrated automation systems, provide Crisis Management  \n\tResolve critical factory issues using many of the A3 structure and framework tools and techniques like Model based Problem Solving, 5Why, Direct observation and 7 Step problem solving. \n \nProject Lead:  \n\tZero Cycle Time Metrology project impacting Multiple Factories to reduce Cycle Time spend on Metrology on older technologies. Role involved design analysis, end-user analysis, defining HW requirements and executing to the overall VF project plan and scheduling and enabling features of Adaptive metrology for earlier process technologies. \n\tW2K EOL project impacting all 300MM sites. Responsibilities include VF scheduling, ensuring quality in project collaterals and supporting site technical reviews and deployments. Provided monthly VF status updates in the Post Ramp Automation program meeting.  \n\tOSA Central Deployment Organization at Arizona ensuring timely deployment of new capabilities and enabling 100% VF Plan of Record (POR) matching. Played a major role in defining CDO processes and direction to the virtual factory.  \n\tTechnical Project Lead for Single Automation Environment Project – Led early engagement and path finding for the Single Automation Environment Project. This involved detail analysis of issues and obstacles, solutions and best options for the proposal. This led to approval by TD and IT-FSM management for proof of concepts – Received Divisional Recognition Award. Software Consultant Rapidigm August 1998  –  April 2001  (2 years 9 months) Worked at Multiple locations: \n \nINTEL Corporation\tProject: AMPS \n\tKey Areas of Involvement: Involved in design, development, and maintenance of architectural network for TIBCO (subject based messaging). \n\tNature of Project: A web-based project which uses the client server technology and subject based messaging technology to transfer data from one database to another.  \n \nAIR LIQUIDE America Corporation, Houston, TX\tProject: TIGAL, REPLICATION \n\tKey Areas of Involvement: Involved in design, development, and end user training. \n\tNature of Project: Inventory Management system of controlled access to Air Liquide’s products with automated re-supply, simplified billing, Internet – Account Setup, access to Inventory Information, and detailed reports. \n \nBechtel Inc, Houston, TX Project: XL-ESPWin/XL-ESPWin2K \n\tKey Areas of Involvement: User analysis, Design, Development, Proliferation, Support and Sustaining. \n\tNature of Project: In-house Estimating Toolkit of Bechtel Inc, Houston.  \n Software Consultant Tata Elxsi November 1996  –  July 1998  (1 year 9 months) Started off at Tata Elxsi, Bangalore \nWorked at TCS, Mumbai \n \nWorked for Penske Logistics, Cleveland, OHIO \n\tKey Areas of Involvement: Responsible for System Study, Design and Development. \n\tProjects:  \nLog Management System and Computer Based Training (CBT) development.  \n Software Consultant Konikkara Indus Software Solutions September 1994  –  November 1996  (2 years 3 months) Bengaluru Area, India Konikkara Indus Software System, India\tProfile: Programmer Analyst \n\tKey Areas of Involvement: Responsible for System Study, Design and Development. \n\tProjects:  \no\tElectronic Data Processing for Tea Factory, Inventory Control System, Service Call Analysis System and Plantation Management System. \n Technical Project/Program Manager Intel Corporation December 2012  –  July 2015  (2 years 8 months) Phoenix, Arizona Area INTEL CUSTOM FOUNDRY Operations Systems Engineer \n\tContent Management Project Lead: As the chair of the Content Management working group, my responsibilities includes prioritizing requirements, providing impact analysis to IT to deliver the project, architecture/approving the solution, conducting map-days for execution of the projects and production release followed by support and sustaining.  \n\tMDM Project Lead: Defined the Charter for Master Data Management within Foundry and kicked off the Project for MDM to optimize and remove redundant data sources within the Organization. \n\tICF Systems Architecture Lead: Manage a meeting to understand the systems requirements of ICF and define a Roadmap with IT and track the project to completion. Reporting Framework (SSRS and SPBI), Enterprise Data Warehouse (Teradata) HR Data and Competitive Analysis and Customer Offering and Pricing are a few of the ICF Org projects that I architect, implement, communicate and support.  \n\tSecurity Management Working Group Chair : Defined architecture, designed and implemented a solution to consolidate, converge and streamline access control/security access for all of the organizations services and applications. \nINTEL FOUNDRY SERVICES : Core Services Manager: \n\tIFS Service Lead for the Intel Foundry Core Service Applications. Managed a team of Business Analysts and System Analysts and drove IT to Build, Support and sustain these services that are used by both Internal and External Foundry Customers.  \n\tBPMS Lead: To help close the OHS(Organization Health Survey) Action Required of a lack of a Business Process Management tool for ICF, Implemented BPLogix Process Director. Set up the Infrastructure, built a team to support the Org requirements and create Work flows to automate Business process, defined optimized Business Process and closed the gap in concerns with the employee effectiveness. Technical Project/Program Manager Intel Corporation December 2012  –  July 2015  (2 years 8 months) Phoenix, Arizona Area INTEL CUSTOM FOUNDRY Operations Systems Engineer \n\tContent Management Project Lead: As the chair of the Content Management working group, my responsibilities includes prioritizing requirements, providing impact analysis to IT to deliver the project, architecture/approving the solution, conducting map-days for execution of the projects and production release followed by support and sustaining.  \n\tMDM Project Lead: Defined the Charter for Master Data Management within Foundry and kicked off the Project for MDM to optimize and remove redundant data sources within the Organization. \n\tICF Systems Architecture Lead: Manage a meeting to understand the systems requirements of ICF and define a Roadmap with IT and track the project to completion. Reporting Framework (SSRS and SPBI), Enterprise Data Warehouse (Teradata) HR Data and Competitive Analysis and Customer Offering and Pricing are a few of the ICF Org projects that I architect, implement, communicate and support.  \n\tSecurity Management Working Group Chair : Defined architecture, designed and implemented a solution to consolidate, converge and streamline access control/security access for all of the organizations services and applications. \nINTEL FOUNDRY SERVICES : Core Services Manager: \n\tIFS Service Lead for the Intel Foundry Core Service Applications. Managed a team of Business Analysts and System Analysts and drove IT to Build, Support and sustain these services that are used by both Internal and External Foundry Customers.  \n\tBPMS Lead: To help close the OHS(Organization Health Survey) Action Required of a lack of a Business Process Management tool for ICF, Implemented BPLogix Process Director. Set up the Infrastructure, built a team to support the Org requirements and create Work flows to automate Business process, defined optimized Business Process and closed the gap in concerns with the employee effectiveness. Operations Lead Intel Corporation January 2012  –  December 2012  (1 year) Phoenix, Arizona Area \tFile Transfer Service Manager: Work with Enterprise customers in provisioning their Secure File Transfer needs. Own the Enterprise SFT instance, supporting 15+ and growing enterprise customers. \n-\tRe-negotiated contract and support structure for Secure File Transfer services provided by IBM. Initial contract signed with Sterling did not meet the needs of the organization once they were acquired by IBM. \n\tOperations Lead: As a Staff member reporting to executive members, working on standardizing Process, Monitors and Support structure across the group. Operations Lead Intel Corporation January 2012  –  December 2012  (1 year) Phoenix, Arizona Area \tFile Transfer Service Manager: Work with Enterprise customers in provisioning their Secure File Transfer needs. Own the Enterprise SFT instance, supporting 15+ and growing enterprise customers. \n-\tRe-negotiated contract and support structure for Secure File Transfer services provided by IBM. Initial contract signed with Sterling did not meet the needs of the organization once they were acquired by IBM. \n\tOperations Lead: As a Staff member reporting to executive members, working on standardizing Process, Monitors and Support structure across the group. FSM - Manufacturing IT - Integration Engineer Intel Corp April 2001  –  December 2011  (10 years 9 months) Phoenix, Arizona Area Technical Domain and Operations Lead: \n\tDomain transfer lead for Multiple 300mm process technology transfer from LTD to Virtual Factory.  \n\tManaging Product Installation to ensure 100% VF Plan of Record Matching (POR) for each technology transfer to enable Run-the-Lot (RTL), Level 1D (L1D) and factory ramp milestones. \n \nStaff Integration Engineer: \n\tWith extensive knowledge of cross-domain integrated automation systems, provide Crisis Management  \n\tResolve critical factory issues using many of the A3 structure and framework tools and techniques like Model based Problem Solving, 5Why, Direct observation and 7 Step problem solving. \n \nProject Lead:  \n\tZero Cycle Time Metrology project impacting Multiple Factories to reduce Cycle Time spend on Metrology on older technologies. Role involved design analysis, end-user analysis, defining HW requirements and executing to the overall VF project plan and scheduling and enabling features of Adaptive metrology for earlier process technologies. \n\tW2K EOL project impacting all 300MM sites. Responsibilities include VF scheduling, ensuring quality in project collaterals and supporting site technical reviews and deployments. Provided monthly VF status updates in the Post Ramp Automation program meeting.  \n\tOSA Central Deployment Organization at Arizona ensuring timely deployment of new capabilities and enabling 100% VF Plan of Record (POR) matching. Played a major role in defining CDO processes and direction to the virtual factory.  \n\tTechnical Project Lead for Single Automation Environment Project – Led early engagement and path finding for the Single Automation Environment Project. This involved detail analysis of issues and obstacles, solutions and best options for the proposal. This led to approval by TD and IT-FSM management for proof of concepts – Received Divisional Recognition Award. FSM - Manufacturing IT - Integration Engineer Intel Corp April 2001  –  December 2011  (10 years 9 months) Phoenix, Arizona Area Technical Domain and Operations Lead: \n\tDomain transfer lead for Multiple 300mm process technology transfer from LTD to Virtual Factory.  \n\tManaging Product Installation to ensure 100% VF Plan of Record Matching (POR) for each technology transfer to enable Run-the-Lot (RTL), Level 1D (L1D) and factory ramp milestones. \n \nStaff Integration Engineer: \n\tWith extensive knowledge of cross-domain integrated automation systems, provide Crisis Management  \n\tResolve critical factory issues using many of the A3 structure and framework tools and techniques like Model based Problem Solving, 5Why, Direct observation and 7 Step problem solving. \n \nProject Lead:  \n\tZero Cycle Time Metrology project impacting Multiple Factories to reduce Cycle Time spend on Metrology on older technologies. Role involved design analysis, end-user analysis, defining HW requirements and executing to the overall VF project plan and scheduling and enabling features of Adaptive metrology for earlier process technologies. \n\tW2K EOL project impacting all 300MM sites. Responsibilities include VF scheduling, ensuring quality in project collaterals and supporting site technical reviews and deployments. Provided monthly VF status updates in the Post Ramp Automation program meeting.  \n\tOSA Central Deployment Organization at Arizona ensuring timely deployment of new capabilities and enabling 100% VF Plan of Record (POR) matching. Played a major role in defining CDO processes and direction to the virtual factory.  \n\tTechnical Project Lead for Single Automation Environment Project – Led early engagement and path finding for the Single Automation Environment Project. This involved detail analysis of issues and obstacles, solutions and best options for the proposal. This led to approval by TD and IT-FSM management for proof of concepts – Received Divisional Recognition Award. Software Consultant Rapidigm August 1998  –  April 2001  (2 years 9 months) Worked at Multiple locations: \n \nINTEL Corporation\tProject: AMPS \n\tKey Areas of Involvement: Involved in design, development, and maintenance of architectural network for TIBCO (subject based messaging). \n\tNature of Project: A web-based project which uses the client server technology and subject based messaging technology to transfer data from one database to another.  \n \nAIR LIQUIDE America Corporation, Houston, TX\tProject: TIGAL, REPLICATION \n\tKey Areas of Involvement: Involved in design, development, and end user training. \n\tNature of Project: Inventory Management system of controlled access to Air Liquide’s products with automated re-supply, simplified billing, Internet – Account Setup, access to Inventory Information, and detailed reports. \n \nBechtel Inc, Houston, TX Project: XL-ESPWin/XL-ESPWin2K \n\tKey Areas of Involvement: User analysis, Design, Development, Proliferation, Support and Sustaining. \n\tNature of Project: In-house Estimating Toolkit of Bechtel Inc, Houston.  \n Software Consultant Rapidigm August 1998  –  April 2001  (2 years 9 months) Worked at Multiple locations: \n \nINTEL Corporation\tProject: AMPS \n\tKey Areas of Involvement: Involved in design, development, and maintenance of architectural network for TIBCO (subject based messaging). \n\tNature of Project: A web-based project which uses the client server technology and subject based messaging technology to transfer data from one database to another.  \n \nAIR LIQUIDE America Corporation, Houston, TX\tProject: TIGAL, REPLICATION \n\tKey Areas of Involvement: Involved in design, development, and end user training. \n\tNature of Project: Inventory Management system of controlled access to Air Liquide’s products with automated re-supply, simplified billing, Internet – Account Setup, access to Inventory Information, and detailed reports. \n \nBechtel Inc, Houston, TX Project: XL-ESPWin/XL-ESPWin2K \n\tKey Areas of Involvement: User analysis, Design, Development, Proliferation, Support and Sustaining. \n\tNature of Project: In-house Estimating Toolkit of Bechtel Inc, Houston.  \n Software Consultant Tata Elxsi November 1996  –  July 1998  (1 year 9 months) Started off at Tata Elxsi, Bangalore \nWorked at TCS, Mumbai \n \nWorked for Penske Logistics, Cleveland, OHIO \n\tKey Areas of Involvement: Responsible for System Study, Design and Development. \n\tProjects:  \nLog Management System and Computer Based Training (CBT) development.  \n Software Consultant Tata Elxsi November 1996  –  July 1998  (1 year 9 months) Started off at Tata Elxsi, Bangalore \nWorked at TCS, Mumbai \n \nWorked for Penske Logistics, Cleveland, OHIO \n\tKey Areas of Involvement: Responsible for System Study, Design and Development. \n\tProjects:  \nLog Management System and Computer Based Training (CBT) development.  \n Software Consultant Konikkara Indus Software Solutions September 1994  –  November 1996  (2 years 3 months) Bengaluru Area, India Konikkara Indus Software System, India\tProfile: Programmer Analyst \n\tKey Areas of Involvement: Responsible for System Study, Design and Development. \n\tProjects:  \no\tElectronic Data Processing for Tea Factory, Inventory Control System, Service Call Analysis System and Plantation Management System. \n Software Consultant Konikkara Indus Software Solutions September 1994  –  November 1996  (2 years 3 months) Bengaluru Area, India Konikkara Indus Software System, India\tProfile: Programmer Analyst \n\tKey Areas of Involvement: Responsible for System Study, Design and Development. \n\tProjects:  \no\tElectronic Data Processing for Tea Factory, Inventory Control System, Service Call Analysis System and Plantation Management System. \n Languages Tamil Tamil Tamil Skills Software Development Intel SQL Linux Agile Methodologies Unix Perl Debugging Software Engineering C Shell Scripting Software Project... Microsoft SQL Server TCP/IP C++ System Architecture Programming Software Design Operating Systems Embedded Systems See 5+     See less Skills  Software Development Intel SQL Linux Agile Methodologies Unix Perl Debugging Software Engineering C Shell Scripting Software Project... Microsoft SQL Server TCP/IP C++ System Architecture Programming Software Design Operating Systems Embedded Systems See 5+     See less Software Development Intel SQL Linux Agile Methodologies Unix Perl Debugging Software Engineering C Shell Scripting Software Project... Microsoft SQL Server TCP/IP C++ System Architecture Programming Software Design Operating Systems Embedded Systems See 5+     See less Software Development Intel SQL Linux Agile Methodologies Unix Perl Debugging Software Engineering C Shell Scripting Software Project... Microsoft SQL Server TCP/IP C++ System Architecture Programming Software Design Operating Systems Embedded Systems See 5+     See less Education Arizona State University M.Eng,  Software Engineering 2007  – 2009 Arizona State University - W. P. Carey School of Business MBA,  Business Administration 2007  – 2009 Madurai Kamaraj University B.Eng,  Computer Science 1991  – 1995 Bachelor of Engineering in Computer Science St Josephs Boys High School 1988  – 1990 Kotagiri Public School 1981  – 1988 Arizona State University M.Eng,  Software Engineering 2007  – 2009 Arizona State University M.Eng,  Software Engineering 2007  – 2009 Arizona State University M.Eng,  Software Engineering 2007  – 2009 Arizona State University - W. P. Carey School of Business MBA,  Business Administration 2007  – 2009 Arizona State University - W. P. Carey School of Business MBA,  Business Administration 2007  – 2009 Arizona State University - W. P. Carey School of Business MBA,  Business Administration 2007  – 2009 Madurai Kamaraj University B.Eng,  Computer Science 1991  – 1995 Bachelor of Engineering in Computer Science Madurai Kamaraj University B.Eng,  Computer Science 1991  – 1995 Bachelor of Engineering in Computer Science Madurai Kamaraj University B.Eng,  Computer Science 1991  – 1995 Bachelor of Engineering in Computer Science St Josephs Boys High School 1988  – 1990 St Josephs Boys High School 1988  – 1990 St Josephs Boys High School 1988  – 1990 Kotagiri Public School 1981  – 1988 Kotagiri Public School 1981  – 1988 Kotagiri Public School 1981  – 1988 ", "Summary Currently working as a technical project manager and engineer on a team responsible for platform power and performance optimization for mobile products. Manages three projects for the team with responsibilities including regular collaboration meetings, status reports, interfacing with clients, and integrating with driver and firmware teams. Also the lead engineer for WiGig and WiDi power optimization on all projects. \n \nI am always looking for more opportunities for leadership roles with greater scope, and I can offer the unique skills of a project manager with technical expertise. My interests include high-level concept design as well as strategic planning, resource management and allocation, and operations consulting. In addition to my technical degree, I have studied user-centered design, industrial design, human computer interaction and organizational behavior. I continue to educate myself in these and other business areas through online courses. \n \nPersonal Skills: \n- Leadership \n- Organization \n- Detail orientation \n- Time management \n- Communication \n- Planning and scheduling \n \nExtra-curricular: \n- President of the Northwestern University Alumni Club of Portland \n- Intel Education Service Corps \n- Volunteer Career Mentor at Dress for Success, Oregon  \n- Volunteer Lacrosse Coach, Sunset Girls 5/6 \n \nIn my free time I enjoy community service, traveling, photography and outdoor activities. I am SCUBA certified, work as an interior design consultant for friends, and am writing a young-adult adventure novel. Summary Currently working as a technical project manager and engineer on a team responsible for platform power and performance optimization for mobile products. Manages three projects for the team with responsibilities including regular collaboration meetings, status reports, interfacing with clients, and integrating with driver and firmware teams. Also the lead engineer for WiGig and WiDi power optimization on all projects. \n \nI am always looking for more opportunities for leadership roles with greater scope, and I can offer the unique skills of a project manager with technical expertise. My interests include high-level concept design as well as strategic planning, resource management and allocation, and operations consulting. In addition to my technical degree, I have studied user-centered design, industrial design, human computer interaction and organizational behavior. I continue to educate myself in these and other business areas through online courses. \n \nPersonal Skills: \n- Leadership \n- Organization \n- Detail orientation \n- Time management \n- Communication \n- Planning and scheduling \n \nExtra-curricular: \n- President of the Northwestern University Alumni Club of Portland \n- Intel Education Service Corps \n- Volunteer Career Mentor at Dress for Success, Oregon  \n- Volunteer Lacrosse Coach, Sunset Girls 5/6 \n \nIn my free time I enjoy community service, traveling, photography and outdoor activities. I am SCUBA certified, work as an interior design consultant for friends, and am writing a young-adult adventure novel. Currently working as a technical project manager and engineer on a team responsible for platform power and performance optimization for mobile products. Manages three projects for the team with responsibilities including regular collaboration meetings, status reports, interfacing with clients, and integrating with driver and firmware teams. Also the lead engineer for WiGig and WiDi power optimization on all projects. \n \nI am always looking for more opportunities for leadership roles with greater scope, and I can offer the unique skills of a project manager with technical expertise. My interests include high-level concept design as well as strategic planning, resource management and allocation, and operations consulting. In addition to my technical degree, I have studied user-centered design, industrial design, human computer interaction and organizational behavior. I continue to educate myself in these and other business areas through online courses. \n \nPersonal Skills: \n- Leadership \n- Organization \n- Detail orientation \n- Time management \n- Communication \n- Planning and scheduling \n \nExtra-curricular: \n- President of the Northwestern University Alumni Club of Portland \n- Intel Education Service Corps \n- Volunteer Career Mentor at Dress for Success, Oregon  \n- Volunteer Lacrosse Coach, Sunset Girls 5/6 \n \nIn my free time I enjoy community service, traveling, photography and outdoor activities. I am SCUBA certified, work as an interior design consultant for friends, and am writing a young-adult adventure novel. Currently working as a technical project manager and engineer on a team responsible for platform power and performance optimization for mobile products. Manages three projects for the team with responsibilities including regular collaboration meetings, status reports, interfacing with clients, and integrating with driver and firmware teams. Also the lead engineer for WiGig and WiDi power optimization on all projects. \n \nI am always looking for more opportunities for leadership roles with greater scope, and I can offer the unique skills of a project manager with technical expertise. My interests include high-level concept design as well as strategic planning, resource management and allocation, and operations consulting. In addition to my technical degree, I have studied user-centered design, industrial design, human computer interaction and organizational behavior. I continue to educate myself in these and other business areas through online courses. \n \nPersonal Skills: \n- Leadership \n- Organization \n- Detail orientation \n- Time management \n- Communication \n- Planning and scheduling \n \nExtra-curricular: \n- President of the Northwestern University Alumni Club of Portland \n- Intel Education Service Corps \n- Volunteer Career Mentor at Dress for Success, Oregon  \n- Volunteer Lacrosse Coach, Sunset Girls 5/6 \n \nIn my free time I enjoy community service, traveling, photography and outdoor activities. I am SCUBA certified, work as an interior design consultant for friends, and am writing a young-adult adventure novel. Experience Technical Project Manager Intel Corporation January 2015  – Present (8 months) Portland, Oregon Area - Works as the technical project manager for 3 SOC projects.  \n- Responsibilities include interfacing with clients to define project scope and commitments, analyzing new user experience features and designing performance indicators to test those features, presenting and participating in weekly sync meetings, and publishing regular status reports to business unit managers and vice presidents \n- Interfaces with project execution teams to define project schedules and dependencies. \n- Continues to perform engineering work as outlined below. Platform Power Engineer Intel Corporation July 2014  – Present (1 year 2 months) Portland, Oregon Area - Optimizes power consumption for wireless user experience scenarios including WiDi/Screen-Casting and WiGig/Wireless Docking.  \n- Defines user experience performance indicators and collaborates with App, OS, Driver and Firmware teams to converge power to targets.  \n- Works with platform architecture teams to project power for current platforms and drive architectural optimizations for future SOCs. Design Engineer Intel Corporation February 2013  –  June 2014  (1 year 5 months) Portland, Oregon Area - Uses Synopsys tools with supplemental manual design to implement soc products for the mobile market. \n- Owns circuitry for analog blocks from RTL to tape-in ready schematics and layouts. \n- Organizes regular activities and events to improve the work culture in a high-performing technical design group as part of the company-wide Great Place to Work program. Graduate Design Intern Intel Corporation June 2012  –  September 2012  (4 months) Hillsboro, Oregon Used automated design flows and manual layout and routing tools to implement several blocks of circuitry for the Haswell family of processors. Was an active leader in the intern community. Hardware Wireless Designer - Student Research In Motion June 2011  –  September 2011  (4 months) Rolling Meadows, IL - Researched and designed the circuitry for an upcoming Blackberry® accessory. \n- Performed and analyzed 400+ tests on audio systems for the Blackberry® Curve 9370. \n- Participated in daily design meetings and collaborated with local team members and multi-national platform team to make critical design decisions. Hardware Wireless Designer - Student Research In Motion September 2010  –  December 2010  (4 months) Sunrise, Florida - Designed a block diagram that mapped system power requirements for a PMIC with 26 regulators and 7 switch supplies and calculated trace widths for PCB revisions. \n- Designed testing procedures for new system hardware. \n- Performed and analyzed 70+ tests on power systems for the Blackberry® Torch 9810 (line/load transient and regulation tests, thermal protection, battery life, backlight efficiency, fuel gauge calibration and more). \n- Reported and presented data at weekly design meetings and in comprehensive project documentation. Assistant Project Manager - Intern Poole & Kent June 2008  –  September 2008  (4 months) Baltimore, Maryland Johns Hopkins Hospital Cardiovascular and Critical Care Tower/Children’s Tower \n- Posted revisions to official project blueprints for a 1.47 million square foot state-of-the-art hospital addition. \n- Made daily site inspections to enforce coordination and represented mechanical contractor in coordination meetings \n- Read and analyzed blueprints for structural, electrical, plumbing and HVAC systems.. Technical Project Manager Intel Corporation January 2015  – Present (8 months) Portland, Oregon Area - Works as the technical project manager for 3 SOC projects.  \n- Responsibilities include interfacing with clients to define project scope and commitments, analyzing new user experience features and designing performance indicators to test those features, presenting and participating in weekly sync meetings, and publishing regular status reports to business unit managers and vice presidents \n- Interfaces with project execution teams to define project schedules and dependencies. \n- Continues to perform engineering work as outlined below. Technical Project Manager Intel Corporation January 2015  – Present (8 months) Portland, Oregon Area - Works as the technical project manager for 3 SOC projects.  \n- Responsibilities include interfacing with clients to define project scope and commitments, analyzing new user experience features and designing performance indicators to test those features, presenting and participating in weekly sync meetings, and publishing regular status reports to business unit managers and vice presidents \n- Interfaces with project execution teams to define project schedules and dependencies. \n- Continues to perform engineering work as outlined below. Platform Power Engineer Intel Corporation July 2014  – Present (1 year 2 months) Portland, Oregon Area - Optimizes power consumption for wireless user experience scenarios including WiDi/Screen-Casting and WiGig/Wireless Docking.  \n- Defines user experience performance indicators and collaborates with App, OS, Driver and Firmware teams to converge power to targets.  \n- Works with platform architecture teams to project power for current platforms and drive architectural optimizations for future SOCs. Platform Power Engineer Intel Corporation July 2014  – Present (1 year 2 months) Portland, Oregon Area - Optimizes power consumption for wireless user experience scenarios including WiDi/Screen-Casting and WiGig/Wireless Docking.  \n- Defines user experience performance indicators and collaborates with App, OS, Driver and Firmware teams to converge power to targets.  \n- Works with platform architecture teams to project power for current platforms and drive architectural optimizations for future SOCs. Design Engineer Intel Corporation February 2013  –  June 2014  (1 year 5 months) Portland, Oregon Area - Uses Synopsys tools with supplemental manual design to implement soc products for the mobile market. \n- Owns circuitry for analog blocks from RTL to tape-in ready schematics and layouts. \n- Organizes regular activities and events to improve the work culture in a high-performing technical design group as part of the company-wide Great Place to Work program. Design Engineer Intel Corporation February 2013  –  June 2014  (1 year 5 months) Portland, Oregon Area - Uses Synopsys tools with supplemental manual design to implement soc products for the mobile market. \n- Owns circuitry for analog blocks from RTL to tape-in ready schematics and layouts. \n- Organizes regular activities and events to improve the work culture in a high-performing technical design group as part of the company-wide Great Place to Work program. Graduate Design Intern Intel Corporation June 2012  –  September 2012  (4 months) Hillsboro, Oregon Used automated design flows and manual layout and routing tools to implement several blocks of circuitry for the Haswell family of processors. Was an active leader in the intern community. Graduate Design Intern Intel Corporation June 2012  –  September 2012  (4 months) Hillsboro, Oregon Used automated design flows and manual layout and routing tools to implement several blocks of circuitry for the Haswell family of processors. Was an active leader in the intern community. Hardware Wireless Designer - Student Research In Motion June 2011  –  September 2011  (4 months) Rolling Meadows, IL - Researched and designed the circuitry for an upcoming Blackberry® accessory. \n- Performed and analyzed 400+ tests on audio systems for the Blackberry® Curve 9370. \n- Participated in daily design meetings and collaborated with local team members and multi-national platform team to make critical design decisions. Hardware Wireless Designer - Student Research In Motion June 2011  –  September 2011  (4 months) Rolling Meadows, IL - Researched and designed the circuitry for an upcoming Blackberry® accessory. \n- Performed and analyzed 400+ tests on audio systems for the Blackberry® Curve 9370. \n- Participated in daily design meetings and collaborated with local team members and multi-national platform team to make critical design decisions. Hardware Wireless Designer - Student Research In Motion September 2010  –  December 2010  (4 months) Sunrise, Florida - Designed a block diagram that mapped system power requirements for a PMIC with 26 regulators and 7 switch supplies and calculated trace widths for PCB revisions. \n- Designed testing procedures for new system hardware. \n- Performed and analyzed 70+ tests on power systems for the Blackberry® Torch 9810 (line/load transient and regulation tests, thermal protection, battery life, backlight efficiency, fuel gauge calibration and more). \n- Reported and presented data at weekly design meetings and in comprehensive project documentation. Hardware Wireless Designer - Student Research In Motion September 2010  –  December 2010  (4 months) Sunrise, Florida - Designed a block diagram that mapped system power requirements for a PMIC with 26 regulators and 7 switch supplies and calculated trace widths for PCB revisions. \n- Designed testing procedures for new system hardware. \n- Performed and analyzed 70+ tests on power systems for the Blackberry® Torch 9810 (line/load transient and regulation tests, thermal protection, battery life, backlight efficiency, fuel gauge calibration and more). \n- Reported and presented data at weekly design meetings and in comprehensive project documentation. Assistant Project Manager - Intern Poole & Kent June 2008  –  September 2008  (4 months) Baltimore, Maryland Johns Hopkins Hospital Cardiovascular and Critical Care Tower/Children’s Tower \n- Posted revisions to official project blueprints for a 1.47 million square foot state-of-the-art hospital addition. \n- Made daily site inspections to enforce coordination and represented mechanical contractor in coordination meetings \n- Read and analyzed blueprints for structural, electrical, plumbing and HVAC systems.. Assistant Project Manager - Intern Poole & Kent June 2008  –  September 2008  (4 months) Baltimore, Maryland Johns Hopkins Hospital Cardiovascular and Critical Care Tower/Children’s Tower \n- Posted revisions to official project blueprints for a 1.47 million square foot state-of-the-art hospital addition. \n- Made daily site inspections to enforce coordination and represented mechanical contractor in coordination meetings \n- Read and analyzed blueprints for structural, electrical, plumbing and HVAC systems.. Languages   Skills Technical Project... Operations Management VLSI PCB design Windows Hardware Architecture Testing Soldering C C++ Python Matlab Microsoft Office Mac OS User-centered Design Verilog Circuit Design Synopsys tools Hardware Design Project Management Organizational... Organizational Behavior Event Planning Event Management Product Design VHDL Human-computer... Mentor Graphics Cadence Industrial Design Digital Logic Embedded Systems x86 Assembly HTML5 CSS Volunteer Management Django JavaScript Scuba Diving Java PowerPoint Leadership Programming Mobile Devices SoC PCB Design See 31+     See less Skills  Technical Project... Operations Management VLSI PCB design Windows Hardware Architecture Testing Soldering C C++ Python Matlab Microsoft Office Mac OS User-centered Design Verilog Circuit Design Synopsys tools Hardware Design Project Management Organizational... Organizational Behavior Event Planning Event Management Product Design VHDL Human-computer... Mentor Graphics Cadence Industrial Design Digital Logic Embedded Systems x86 Assembly HTML5 CSS Volunteer Management Django JavaScript Scuba Diving Java PowerPoint Leadership Programming Mobile Devices SoC PCB Design See 31+     See less Technical Project... Operations Management VLSI PCB design Windows Hardware Architecture Testing Soldering C C++ Python Matlab Microsoft Office Mac OS User-centered Design Verilog Circuit Design Synopsys tools Hardware Design Project Management Organizational... Organizational Behavior Event Planning Event Management Product Design VHDL Human-computer... Mentor Graphics Cadence Industrial Design Digital Logic Embedded Systems x86 Assembly HTML5 CSS Volunteer Management Django JavaScript Scuba Diving Java PowerPoint Leadership Programming Mobile Devices SoC PCB Design See 31+     See less Technical Project... Operations Management VLSI PCB design Windows Hardware Architecture Testing Soldering C C++ Python Matlab Microsoft Office Mac OS User-centered Design Verilog Circuit Design Synopsys tools Hardware Design Project Management Organizational... Organizational Behavior Event Planning Event Management Product Design VHDL Human-computer... Mentor Graphics Cadence Industrial Design Digital Logic Embedded Systems x86 Assembly HTML5 CSS Volunteer Management Django JavaScript Scuba Diving Java PowerPoint Leadership Programming Mobile Devices SoC PCB Design See 31+     See less Education Northwestern University Master of Science (M.S.),  Electrical Computer Engineering 2011  – 2012 Concentration in VLSI design and computer architecture. Northwestern University BS,  Electrical Engineering 2007  – 2011 Activities and Societies:  Study Abroad/Exchange ,  Co-op ,  Intermural Sports (Captain) ,  Marching Band ,  Pit Orchestra ,  Jazz Band University of Melbourne Study Abroad,  Electrical Engineering 2009  – 2010 Activities and Societies:  International House Student Advisory Board ,  Melbourne University Softball Club ,  Melbourne University Lacrosse Club (Assistant Coach) ,  Intercollegiate Ultimate Frisbee Club ,  Arcadia University Study Abroad Student Group Notre Dame Preparatory School High School Diploma 2003  – 2007 Activities and Societies:  Cum Laude Society ,  Varsity Badminton (Captain) ,  Robotics Club ,  Student Technology Advisers (President) ,  Tri-M Music Honor Society (President) ,  Concert Band ,  Jazz Band ,  Pit Orchestra Northwestern University Master of Science (M.S.),  Electrical Computer Engineering 2011  – 2012 Concentration in VLSI design and computer architecture. Northwestern University Master of Science (M.S.),  Electrical Computer Engineering 2011  – 2012 Concentration in VLSI design and computer architecture. Northwestern University Master of Science (M.S.),  Electrical Computer Engineering 2011  – 2012 Concentration in VLSI design and computer architecture. Northwestern University BS,  Electrical Engineering 2007  – 2011 Activities and Societies:  Study Abroad/Exchange ,  Co-op ,  Intermural Sports (Captain) ,  Marching Band ,  Pit Orchestra ,  Jazz Band Northwestern University BS,  Electrical Engineering 2007  – 2011 Activities and Societies:  Study Abroad/Exchange ,  Co-op ,  Intermural Sports (Captain) ,  Marching Band ,  Pit Orchestra ,  Jazz Band Northwestern University BS,  Electrical Engineering 2007  – 2011 Activities and Societies:  Study Abroad/Exchange ,  Co-op ,  Intermural Sports (Captain) ,  Marching Band ,  Pit Orchestra ,  Jazz Band University of Melbourne Study Abroad,  Electrical Engineering 2009  – 2010 Activities and Societies:  International House Student Advisory Board ,  Melbourne University Softball Club ,  Melbourne University Lacrosse Club (Assistant Coach) ,  Intercollegiate Ultimate Frisbee Club ,  Arcadia University Study Abroad Student Group University of Melbourne Study Abroad,  Electrical Engineering 2009  – 2010 Activities and Societies:  International House Student Advisory Board ,  Melbourne University Softball Club ,  Melbourne University Lacrosse Club (Assistant Coach) ,  Intercollegiate Ultimate Frisbee Club ,  Arcadia University Study Abroad Student Group University of Melbourne Study Abroad,  Electrical Engineering 2009  – 2010 Activities and Societies:  International House Student Advisory Board ,  Melbourne University Softball Club ,  Melbourne University Lacrosse Club (Assistant Coach) ,  Intercollegiate Ultimate Frisbee Club ,  Arcadia University Study Abroad Student Group Notre Dame Preparatory School High School Diploma 2003  – 2007 Activities and Societies:  Cum Laude Society ,  Varsity Badminton (Captain) ,  Robotics Club ,  Student Technology Advisers (President) ,  Tri-M Music Honor Society (President) ,  Concert Band ,  Jazz Band ,  Pit Orchestra Notre Dame Preparatory School High School Diploma 2003  – 2007 Activities and Societies:  Cum Laude Society ,  Varsity Badminton (Captain) ,  Robotics Club ,  Student Technology Advisers (President) ,  Tri-M Music Honor Society (President) ,  Concert Band ,  Jazz Band ,  Pit Orchestra Notre Dame Preparatory School High School Diploma 2003  – 2007 Activities and Societies:  Cum Laude Society ,  Varsity Badminton (Captain) ,  Robotics Club ,  Student Technology Advisers (President) ,  Tri-M Music Honor Society (President) ,  Concert Band ,  Jazz Band ,  Pit Orchestra Honors & Awards Additional Honors & Awards 2011 Semi-Finalist - Imaginations Design Competition, Walt Disney Imagineering Additional Honors & Awards 2011 Semi-Finalist - Imaginations Design Competition, Walt Disney Imagineering Additional Honors & Awards 2011 Semi-Finalist - Imaginations Design Competition, Walt Disney Imagineering Additional Honors & Awards 2011 Semi-Finalist - Imaginations Design Competition, Walt Disney Imagineering ", "Experience Senior Technical Project / Program Manager Intel Corporation March 2008  – Present (7 years 6 months) Software Engineering Manager Intel Corporation 2000  –  2008  (8 years) Senior Software Development Engineer Intel Corporation 1994  –  2000  (6 years) Senior Software Engineer BancTec 1993  –  1994  (1 year) Lead Programmer Siemens 1992  –  1993  (1 year) Senior Software Developer National Semiconductor 1989  –  1992  (3 years) Senior Technical Project / Program Manager Intel Corporation March 2008  – Present (7 years 6 months) Senior Technical Project / Program Manager Intel Corporation March 2008  – Present (7 years 6 months) Software Engineering Manager Intel Corporation 2000  –  2008  (8 years) Software Engineering Manager Intel Corporation 2000  –  2008  (8 years) Senior Software Development Engineer Intel Corporation 1994  –  2000  (6 years) Senior Software Development Engineer Intel Corporation 1994  –  2000  (6 years) Senior Software Engineer BancTec 1993  –  1994  (1 year) Senior Software Engineer BancTec 1993  –  1994  (1 year) Lead Programmer Siemens 1992  –  1993  (1 year) Lead Programmer Siemens 1992  –  1993  (1 year) Senior Software Developer National Semiconductor 1989  –  1992  (3 years) Senior Software Developer National Semiconductor 1989  –  1992  (3 years) Languages German German German Skills IT Project & Program... Cross-functional Team... Software Project... Program Management People Management IT Management Software Engineering Semiconductors Testing Embedded Systems SDLC Software Design Debugging Skills  IT Project & Program... Cross-functional Team... Software Project... Program Management People Management IT Management Software Engineering Semiconductors Testing Embedded Systems SDLC Software Design Debugging IT Project & Program... Cross-functional Team... Software Project... Program Management People Management IT Management Software Engineering Semiconductors Testing Embedded Systems SDLC Software Design Debugging IT Project & Program... Cross-functional Team... Software Project... Program Management People Management IT Management Software Engineering Semiconductors Testing Embedded Systems SDLC Software Design Debugging Education The University of New Mexico - Robert O. Anderson School of Management Bachelor of Business Administration (B.B.A.),  Management Information Systems , General 1982  – 1986 The University of New Mexico - Robert O. Anderson School of Management Bachelor of Business Administration (B.B.A.),  Management Information Systems , General 1982  – 1986 The University of New Mexico - Robert O. Anderson School of Management Bachelor of Business Administration (B.B.A.),  Management Information Systems , General 1982  – 1986 The University of New Mexico - Robert O. Anderson School of Management Bachelor of Business Administration (B.B.A.),  Management Information Systems , General 1982  – 1986 ", "Experience Technical Project/Program Manager Intel Corporation April 2014  – Present (1 year 5 months) Bengaluru Area, India Engineering Intern Intel Corporation June 2012  –  March 2014  (1 year 10 months) Bengaluru Area, India Technical Project/Program Manager Intel Corporation April 2014  – Present (1 year 5 months) Bengaluru Area, India Technical Project/Program Manager Intel Corporation April 2014  – Present (1 year 5 months) Bengaluru Area, India Engineering Intern Intel Corporation June 2012  –  March 2014  (1 year 10 months) Bengaluru Area, India Engineering Intern Intel Corporation June 2012  –  March 2014  (1 year 10 months) Bengaluru Area, India Skills Project Management Program Management Vendor Management Operational Excellence CCNA Linux System... Perl Automation Bash Event Monitoring Major Incident... Customer Satisfaction Process Optimization Document Management Technical Presentations Impromptu Speaking Group Discussions Conference Speaking See 2+     See less Skills  Project Management Program Management Vendor Management Operational Excellence CCNA Linux System... Perl Automation Bash Event Monitoring Major Incident... Customer Satisfaction Process Optimization Document Management Technical Presentations Impromptu Speaking Group Discussions Conference Speaking See 2+     See less Project Management Program Management Vendor Management Operational Excellence CCNA Linux System... Perl Automation Bash Event Monitoring Major Incident... Customer Satisfaction Process Optimization Document Management Technical Presentations Impromptu Speaking Group Discussions Conference Speaking See 2+     See less Project Management Program Management Vendor Management Operational Excellence CCNA Linux System... Perl Automation Bash Event Monitoring Major Incident... Customer Satisfaction Process Optimization Document Management Technical Presentations Impromptu Speaking Group Discussions Conference Speaking See 2+     See less Education D.A.V Public School, Chandigarh, India D.A.V Public School, Chandigarh, India D.A.V Public School, Chandigarh, India D.A.V Public School, Chandigarh, India ", "Summary I currently lead all software products development and technology initiatives for Huron Consulting’s healthcare practice. I have been in this position since 2007 and during this time I built the product development organization from the ground up, creating a top-flight, scalable development organization that varies between 50 and 100 team members depending on current projects. Our successes included cutting development time significantly through agile development; launching a new suite of analytics products which will generate significant sales in their first year; and rebuilding aging flagship product from ground up.  \n \nMy previous roles included serving as a Technical Project/Program Manager for Intel where I managed multiple large and complex projects leading teams of up to 40 and managing project budgets of up to $6M.  \n \nI thrive on the strategic aspects of my work because, for me, technology should always drive business success. The common thread that runs through my entire career is the ability to keep complex initiatives on track no matter how many challenges arise. My colleagues know me as a consummate problem-solver and I thoroughly enjoy working under pressure or facing challenges that have beaten others.  \n \nI have a documented history of delivering complex software projects on time and within budget and am known for my ability to turn around stalled projects. My manager has commented that the healthcare practice “could not operate without Rajesh's deep experience and understanding of technology” and complimented my “always calm, measured, and professional” approach to problem-solving.  \n \nThis last compliment is especially meaningful to me because I take care to always respond calmly when problems arise, so that my team is able to function at their best.  \n \nI hold a Bachelor’s degree in Engineering and a Masters degree in Management Studies. I am keen to reconnect with former colleagues or make new connections so please feel free to contact me via this page. Summary I currently lead all software products development and technology initiatives for Huron Consulting’s healthcare practice. I have been in this position since 2007 and during this time I built the product development organization from the ground up, creating a top-flight, scalable development organization that varies between 50 and 100 team members depending on current projects. Our successes included cutting development time significantly through agile development; launching a new suite of analytics products which will generate significant sales in their first year; and rebuilding aging flagship product from ground up.  \n \nMy previous roles included serving as a Technical Project/Program Manager for Intel where I managed multiple large and complex projects leading teams of up to 40 and managing project budgets of up to $6M.  \n \nI thrive on the strategic aspects of my work because, for me, technology should always drive business success. The common thread that runs through my entire career is the ability to keep complex initiatives on track no matter how many challenges arise. My colleagues know me as a consummate problem-solver and I thoroughly enjoy working under pressure or facing challenges that have beaten others.  \n \nI have a documented history of delivering complex software projects on time and within budget and am known for my ability to turn around stalled projects. My manager has commented that the healthcare practice “could not operate without Rajesh's deep experience and understanding of technology” and complimented my “always calm, measured, and professional” approach to problem-solving.  \n \nThis last compliment is especially meaningful to me because I take care to always respond calmly when problems arise, so that my team is able to function at their best.  \n \nI hold a Bachelor’s degree in Engineering and a Masters degree in Management Studies. I am keen to reconnect with former colleagues or make new connections so please feel free to contact me via this page. I currently lead all software products development and technology initiatives for Huron Consulting’s healthcare practice. I have been in this position since 2007 and during this time I built the product development organization from the ground up, creating a top-flight, scalable development organization that varies between 50 and 100 team members depending on current projects. Our successes included cutting development time significantly through agile development; launching a new suite of analytics products which will generate significant sales in their first year; and rebuilding aging flagship product from ground up.  \n \nMy previous roles included serving as a Technical Project/Program Manager for Intel where I managed multiple large and complex projects leading teams of up to 40 and managing project budgets of up to $6M.  \n \nI thrive on the strategic aspects of my work because, for me, technology should always drive business success. The common thread that runs through my entire career is the ability to keep complex initiatives on track no matter how many challenges arise. My colleagues know me as a consummate problem-solver and I thoroughly enjoy working under pressure or facing challenges that have beaten others.  \n \nI have a documented history of delivering complex software projects on time and within budget and am known for my ability to turn around stalled projects. My manager has commented that the healthcare practice “could not operate without Rajesh's deep experience and understanding of technology” and complimented my “always calm, measured, and professional” approach to problem-solving.  \n \nThis last compliment is especially meaningful to me because I take care to always respond calmly when problems arise, so that my team is able to function at their best.  \n \nI hold a Bachelor’s degree in Engineering and a Masters degree in Management Studies. I am keen to reconnect with former colleagues or make new connections so please feel free to contact me via this page. I currently lead all software products development and technology initiatives for Huron Consulting’s healthcare practice. I have been in this position since 2007 and during this time I built the product development organization from the ground up, creating a top-flight, scalable development organization that varies between 50 and 100 team members depending on current projects. Our successes included cutting development time significantly through agile development; launching a new suite of analytics products which will generate significant sales in their first year; and rebuilding aging flagship product from ground up.  \n \nMy previous roles included serving as a Technical Project/Program Manager for Intel where I managed multiple large and complex projects leading teams of up to 40 and managing project budgets of up to $6M.  \n \nI thrive on the strategic aspects of my work because, for me, technology should always drive business success. The common thread that runs through my entire career is the ability to keep complex initiatives on track no matter how many challenges arise. My colleagues know me as a consummate problem-solver and I thoroughly enjoy working under pressure or facing challenges that have beaten others.  \n \nI have a documented history of delivering complex software projects on time and within budget and am known for my ability to turn around stalled projects. My manager has commented that the healthcare practice “could not operate without Rajesh's deep experience and understanding of technology” and complimented my “always calm, measured, and professional” approach to problem-solving.  \n \nThis last compliment is especially meaningful to me because I take care to always respond calmly when problems arise, so that my team is able to function at their best.  \n \nI hold a Bachelor’s degree in Engineering and a Masters degree in Management Studies. I am keen to reconnect with former colleagues or make new connections so please feel free to contact me via this page. Experience Director of Engineering Huron Consulting Group February 2007  – Present (8 years 7 months) Lake Oswego, Oregon I was recruited by Huron to build and lead the product development organization. I’m accountable for project management, engineering management, QA, architecture and development infrastructure supporting the company’s healthcare consulting practice. I develop the technology strategy and manage the full development lifecycle from conception to final delivery, working closely with business leaders.  \n \nWhen I was first hired, I faced the need to upgrade the technology infrastructure, rebuild a depleted team and implement a development methodology from scratch. \nSince that time, I have built top-performing, highly skilled and scalable technology organization whose size has ranged from 50 to 100 in recent years, implemented agile development methodology cutting development time and improving predictability, and significantly upgraded the technology infrastructure.  \n \nI have also grown revenues by enabling the launch of 5 new analytics products, which are expected to generate multimillion-dollar revenues. Project Manager (Consultant) Comotiv Systems 2006  –  2006  (less than a year) Portland, Oregon This company developed online collaboration tools and hired me on a consulting basis to turn around a stalled product development project. My challenge was to identify and resolve the issues, and deliver the product to market.  \n \nHaving conducted a full analysis of the situation, I removed multiple roadblocks, improved communication, developed a new project plan, and gained buy-in from all stakeholders. \nAs a result of this work, the company delivered a high-quality product on time and within budget. InfoTech Manager Intel Corporation 2005  –  2006  (1 year) Portland, Oregon As Infotech manager, I led the development of custom software products using Microsoft Technologies such as .NET, SQL Server, etc.  \n \nInitially I inherited an under-performing .NET development team suffering from low moral and high attrition rates, but through improved training and communication, the team were transformed. They became a cohesive, high-performing group that hit 100% of their release dates. Technical Project/Program Manager Intel Corporation 2000  –  2005  (5 years) Portland, Oregon In this role, I led project teams of up to 40 with budgets of up to $6M, frequently salvaging troubled projects or leading complex, multi-faceted initiatives.  \n \nSuccesses included planning/managing development of a new content management system, following the failure of two previous attempts; leading the development of a sales force productivity portal, and playing a key role in transitioning several large development programs (cumulative budgets of up to $100M) to India. I developed offshore working models and performance metrics, led pilot projects and helped to grow the Intel Indian group to over 1,000 employees with very strong performance. Software Engineer/Consultant Northwest Software 1998  –  2000  (2 years) Portland, Oregon In this position, I worked as a consultant for Intel Corporation, successfully delivering several software development projects. As a result, Intel offered me a fulltime position to lead their first offshore software development project. Development Officer SICOM Ltd. 1995  –  1998  (3 years) Mumbai, India I led software development for this industrial development, project finance and venture capital company with approximately 300 employees and $100M in revenue. Director of Engineering Huron Consulting Group February 2007  – Present (8 years 7 months) Lake Oswego, Oregon I was recruited by Huron to build and lead the product development organization. I’m accountable for project management, engineering management, QA, architecture and development infrastructure supporting the company’s healthcare consulting practice. I develop the technology strategy and manage the full development lifecycle from conception to final delivery, working closely with business leaders.  \n \nWhen I was first hired, I faced the need to upgrade the technology infrastructure, rebuild a depleted team and implement a development methodology from scratch. \nSince that time, I have built top-performing, highly skilled and scalable technology organization whose size has ranged from 50 to 100 in recent years, implemented agile development methodology cutting development time and improving predictability, and significantly upgraded the technology infrastructure.  \n \nI have also grown revenues by enabling the launch of 5 new analytics products, which are expected to generate multimillion-dollar revenues. Director of Engineering Huron Consulting Group February 2007  – Present (8 years 7 months) Lake Oswego, Oregon I was recruited by Huron to build and lead the product development organization. I’m accountable for project management, engineering management, QA, architecture and development infrastructure supporting the company’s healthcare consulting practice. I develop the technology strategy and manage the full development lifecycle from conception to final delivery, working closely with business leaders.  \n \nWhen I was first hired, I faced the need to upgrade the technology infrastructure, rebuild a depleted team and implement a development methodology from scratch. \nSince that time, I have built top-performing, highly skilled and scalable technology organization whose size has ranged from 50 to 100 in recent years, implemented agile development methodology cutting development time and improving predictability, and significantly upgraded the technology infrastructure.  \n \nI have also grown revenues by enabling the launch of 5 new analytics products, which are expected to generate multimillion-dollar revenues. Project Manager (Consultant) Comotiv Systems 2006  –  2006  (less than a year) Portland, Oregon This company developed online collaboration tools and hired me on a consulting basis to turn around a stalled product development project. My challenge was to identify and resolve the issues, and deliver the product to market.  \n \nHaving conducted a full analysis of the situation, I removed multiple roadblocks, improved communication, developed a new project plan, and gained buy-in from all stakeholders. \nAs a result of this work, the company delivered a high-quality product on time and within budget. Project Manager (Consultant) Comotiv Systems 2006  –  2006  (less than a year) Portland, Oregon This company developed online collaboration tools and hired me on a consulting basis to turn around a stalled product development project. My challenge was to identify and resolve the issues, and deliver the product to market.  \n \nHaving conducted a full analysis of the situation, I removed multiple roadblocks, improved communication, developed a new project plan, and gained buy-in from all stakeholders. \nAs a result of this work, the company delivered a high-quality product on time and within budget. InfoTech Manager Intel Corporation 2005  –  2006  (1 year) Portland, Oregon As Infotech manager, I led the development of custom software products using Microsoft Technologies such as .NET, SQL Server, etc.  \n \nInitially I inherited an under-performing .NET development team suffering from low moral and high attrition rates, but through improved training and communication, the team were transformed. They became a cohesive, high-performing group that hit 100% of their release dates. InfoTech Manager Intel Corporation 2005  –  2006  (1 year) Portland, Oregon As Infotech manager, I led the development of custom software products using Microsoft Technologies such as .NET, SQL Server, etc.  \n \nInitially I inherited an under-performing .NET development team suffering from low moral and high attrition rates, but through improved training and communication, the team were transformed. They became a cohesive, high-performing group that hit 100% of their release dates. Technical Project/Program Manager Intel Corporation 2000  –  2005  (5 years) Portland, Oregon In this role, I led project teams of up to 40 with budgets of up to $6M, frequently salvaging troubled projects or leading complex, multi-faceted initiatives.  \n \nSuccesses included planning/managing development of a new content management system, following the failure of two previous attempts; leading the development of a sales force productivity portal, and playing a key role in transitioning several large development programs (cumulative budgets of up to $100M) to India. I developed offshore working models and performance metrics, led pilot projects and helped to grow the Intel Indian group to over 1,000 employees with very strong performance. Technical Project/Program Manager Intel Corporation 2000  –  2005  (5 years) Portland, Oregon In this role, I led project teams of up to 40 with budgets of up to $6M, frequently salvaging troubled projects or leading complex, multi-faceted initiatives.  \n \nSuccesses included planning/managing development of a new content management system, following the failure of two previous attempts; leading the development of a sales force productivity portal, and playing a key role in transitioning several large development programs (cumulative budgets of up to $100M) to India. I developed offshore working models and performance metrics, led pilot projects and helped to grow the Intel Indian group to over 1,000 employees with very strong performance. Software Engineer/Consultant Northwest Software 1998  –  2000  (2 years) Portland, Oregon In this position, I worked as a consultant for Intel Corporation, successfully delivering several software development projects. As a result, Intel offered me a fulltime position to lead their first offshore software development project. Software Engineer/Consultant Northwest Software 1998  –  2000  (2 years) Portland, Oregon In this position, I worked as a consultant for Intel Corporation, successfully delivering several software development projects. As a result, Intel offered me a fulltime position to lead their first offshore software development project. Development Officer SICOM Ltd. 1995  –  1998  (3 years) Mumbai, India I led software development for this industrial development, project finance and venture capital company with approximately 300 employees and $100M in revenue. Development Officer SICOM Ltd. 1995  –  1998  (3 years) Mumbai, India I led software development for this industrial development, project finance and venture capital company with approximately 300 employees and $100M in revenue. Languages English Full professional proficiency Marathi Native or bilingual proficiency Hindi Native or bilingual proficiency English Full professional proficiency Marathi Native or bilingual proficiency Hindi Native or bilingual proficiency English Full professional proficiency Marathi Native or bilingual proficiency Hindi Native or bilingual proficiency Full professional proficiency Native or bilingual proficiency Native or bilingual proficiency Skills Software Development Agile Methodologies Software Project... Scrum SDLC Product Management Agile Project Management Cross-functional Team... Program Management Management Business Intelligence Requirements Analysis Enterprise Architecture Enterprise Software Software Design Software Engineering Integration SaaS Microsoft SQL Server Process Improvement .NET Software Quality... Cloud Computing Web Applications Testing SQL C# Leading Change Product Development Databases Data Warehousing Leading Remote Teams Large Projects Agile/SCRUM Development Technology Strategy Project Management Offshore Development Deal Negotiations Cloud/SaaS/Hosting M&A Evaluations HIPPA IT Security Budget Management Process Improvements Team Building Product Lifecycle... Change Management Staff Development Project Turnarounds See 34+     See less Skills  Software Development Agile Methodologies Software Project... Scrum SDLC Product Management Agile Project Management Cross-functional Team... Program Management Management Business Intelligence Requirements Analysis Enterprise Architecture Enterprise Software Software Design Software Engineering Integration SaaS Microsoft SQL Server Process Improvement .NET Software Quality... Cloud Computing Web Applications Testing SQL C# Leading Change Product Development Databases Data Warehousing Leading Remote Teams Large Projects Agile/SCRUM Development Technology Strategy Project Management Offshore Development Deal Negotiations Cloud/SaaS/Hosting M&A Evaluations HIPPA IT Security Budget Management Process Improvements Team Building Product Lifecycle... Change Management Staff Development Project Turnarounds See 34+     See less Software Development Agile Methodologies Software Project... Scrum SDLC Product Management Agile Project Management Cross-functional Team... Program Management Management Business Intelligence Requirements Analysis Enterprise Architecture Enterprise Software Software Design Software Engineering Integration SaaS Microsoft SQL Server Process Improvement .NET Software Quality... Cloud Computing Web Applications Testing SQL C# Leading Change Product Development Databases Data Warehousing Leading Remote Teams Large Projects Agile/SCRUM Development Technology Strategy Project Management Offshore Development Deal Negotiations Cloud/SaaS/Hosting M&A Evaluations HIPPA IT Security Budget Management Process Improvements Team Building Product Lifecycle... Change Management Staff Development Project Turnarounds See 34+     See less Software Development Agile Methodologies Software Project... Scrum SDLC Product Management Agile Project Management Cross-functional Team... Program Management Management Business Intelligence Requirements Analysis Enterprise Architecture Enterprise Software Software Design Software Engineering Integration SaaS Microsoft SQL Server Process Improvement .NET Software Quality... Cloud Computing Web Applications Testing SQL C# Leading Change Product Development Databases Data Warehousing Leading Remote Teams Large Projects Agile/SCRUM Development Technology Strategy Project Management Offshore Development Deal Negotiations Cloud/SaaS/Hosting M&A Evaluations HIPPA IT Security Budget Management Process Improvements Team Building Product Lifecycle... Change Management Staff Development Project Turnarounds See 34+     See less Education Welingkar Institute of Management, University of Mumbai Master of Management Studies (Finance),  Similar to MBA Finance in USA 1993  – 1995 V.J.T.I., University of Mumbai Bachelor of Engineering (Computer Engineering),  Similar to BS Computer Science in USA 1989  – 1992 Massachusetts Institute of Technology - Sloan School of Management Welingkar Institute of Management, University of Mumbai Master of Management Studies (Finance),  Similar to MBA Finance in USA 1993  – 1995 Welingkar Institute of Management, University of Mumbai Master of Management Studies (Finance),  Similar to MBA Finance in USA 1993  – 1995 Welingkar Institute of Management, University of Mumbai Master of Management Studies (Finance),  Similar to MBA Finance in USA 1993  – 1995 V.J.T.I., University of Mumbai Bachelor of Engineering (Computer Engineering),  Similar to BS Computer Science in USA 1989  – 1992 V.J.T.I., University of Mumbai Bachelor of Engineering (Computer Engineering),  Similar to BS Computer Science in USA 1989  – 1992 V.J.T.I., University of Mumbai Bachelor of Engineering (Computer Engineering),  Similar to BS Computer Science in USA 1989  – 1992 Massachusetts Institute of Technology - Sloan School of Management Massachusetts Institute of Technology - Sloan School of Management Massachusetts Institute of Technology - Sloan School of Management Honors & Awards "]}