{"position": "Technical Delivery Manager", "company": "IBM", "profiles": ["Experience Technical Delivery Manager IBM June 2014  – Present (1 year 3 months) Boulder, CO Senior System Administrator Raytheon May 2009  –  May 2014  (5 years 1 month) Aurora, Colorado Technical Delivery Manager IBM June 2014  – Present (1 year 3 months) Boulder, CO Technical Delivery Manager IBM June 2014  – Present (1 year 3 months) Boulder, CO Senior System Administrator Raytheon May 2009  –  May 2014  (5 years 1 month) Aurora, Colorado Senior System Administrator Raytheon May 2009  –  May 2014  (5 years 1 month) Aurora, Colorado Skills Disaster Recovery Linux ITIL System Administration Unix VMware Virtualization Information Assurance TCP/IP Skills  Disaster Recovery Linux ITIL System Administration Unix VMware Virtualization Information Assurance TCP/IP Disaster Recovery Linux ITIL System Administration Unix VMware Virtualization Information Assurance TCP/IP Disaster Recovery Linux ITIL System Administration Unix VMware Virtualization Information Assurance TCP/IP ", "Summary * 14+ years of experience in complete Project Management with experience in managing projects in Service Assurance, Construction and Engineering domain for various Telecom majors in India, USA, Europe and Japan.  \n* Specialist in managing application development with full SDLC using agile and waterfall environments.  \n* Strong experience in delivering Telecom Enterprise Mobile application solutions  \n* Specialist in handling new line of business and posses decisive , effective conflict management skills with proven ability for managing and building high performance teams  \n* Very conversant in handling matrix teams sitting across geographies (handling virtual / remote teams). \n* Currently working IBM Global Services India Private Ltd as Technical Delivery Manager. \n* Possess ability to leverage techno-managerial skills for delivering the best-fit solutions to customers internationally across industry verticals, cutting across geographies. Summary * 14+ years of experience in complete Project Management with experience in managing projects in Service Assurance, Construction and Engineering domain for various Telecom majors in India, USA, Europe and Japan.  \n* Specialist in managing application development with full SDLC using agile and waterfall environments.  \n* Strong experience in delivering Telecom Enterprise Mobile application solutions  \n* Specialist in handling new line of business and posses decisive , effective conflict management skills with proven ability for managing and building high performance teams  \n* Very conversant in handling matrix teams sitting across geographies (handling virtual / remote teams). \n* Currently working IBM Global Services India Private Ltd as Technical Delivery Manager. \n* Possess ability to leverage techno-managerial skills for delivering the best-fit solutions to customers internationally across industry verticals, cutting across geographies. * 14+ years of experience in complete Project Management with experience in managing projects in Service Assurance, Construction and Engineering domain for various Telecom majors in India, USA, Europe and Japan.  \n* Specialist in managing application development with full SDLC using agile and waterfall environments.  \n* Strong experience in delivering Telecom Enterprise Mobile application solutions  \n* Specialist in handling new line of business and posses decisive , effective conflict management skills with proven ability for managing and building high performance teams  \n* Very conversant in handling matrix teams sitting across geographies (handling virtual / remote teams). \n* Currently working IBM Global Services India Private Ltd as Technical Delivery Manager. \n* Possess ability to leverage techno-managerial skills for delivering the best-fit solutions to customers internationally across industry verticals, cutting across geographies. * 14+ years of experience in complete Project Management with experience in managing projects in Service Assurance, Construction and Engineering domain for various Telecom majors in India, USA, Europe and Japan.  \n* Specialist in managing application development with full SDLC using agile and waterfall environments.  \n* Strong experience in delivering Telecom Enterprise Mobile application solutions  \n* Specialist in handling new line of business and posses decisive , effective conflict management skills with proven ability for managing and building high performance teams  \n* Very conversant in handling matrix teams sitting across geographies (handling virtual / remote teams). \n* Currently working IBM Global Services India Private Ltd as Technical Delivery Manager. \n* Possess ability to leverage techno-managerial skills for delivering the best-fit solutions to customers internationally across industry verticals, cutting across geographies. Experience Technical Delivery Manager for GIS (arcGIS) and Mobile applications IBM India Private Limited October 2010  – Present (4 years 11 months) Chennai Area, India * Responsible of delivering applications in Construction and Engineering domain that was built on arcGIS enterprise suite of products  \n* Responsible for end to end delivery of migrating application suite similar to Integraph Mobile Viewer from Native Windows to Mobile platform \n Consultant Wipro Technologies October 2008  –  November 2010  (2 years 2 months) Project Manager & Architect Service provider in Australia April 2008  –  October 2008  (7 months) Project Manager & Architect Service Provider in Japan April 2007  –  April 2008  (1 year 1 month) Domain Consultant Managed Service Provider in USA April 2005  –  December 2005  (9 months) Technical Delivery Manager for GIS (arcGIS) and Mobile applications IBM India Private Limited October 2010  – Present (4 years 11 months) Chennai Area, India * Responsible of delivering applications in Construction and Engineering domain that was built on arcGIS enterprise suite of products  \n* Responsible for end to end delivery of migrating application suite similar to Integraph Mobile Viewer from Native Windows to Mobile platform \n Technical Delivery Manager for GIS (arcGIS) and Mobile applications IBM India Private Limited October 2010  – Present (4 years 11 months) Chennai Area, India * Responsible of delivering applications in Construction and Engineering domain that was built on arcGIS enterprise suite of products  \n* Responsible for end to end delivery of migrating application suite similar to Integraph Mobile Viewer from Native Windows to Mobile platform \n Consultant Wipro Technologies October 2008  –  November 2010  (2 years 2 months) Consultant Wipro Technologies October 2008  –  November 2010  (2 years 2 months) Project Manager & Architect Service provider in Australia April 2008  –  October 2008  (7 months) Project Manager & Architect Service provider in Australia April 2008  –  October 2008  (7 months) Project Manager & Architect Service Provider in Japan April 2007  –  April 2008  (1 year 1 month) Project Manager & Architect Service Provider in Japan April 2007  –  April 2008  (1 year 1 month) Domain Consultant Managed Service Provider in USA April 2005  –  December 2005  (9 months) Domain Consultant Managed Service Provider in USA April 2005  –  December 2005  (9 months) Languages English Tamil Telugu English Tamil Telugu English Tamil Telugu Skills Integration Solution Architecture Requirements Analysis Software Project... Strategy Pre-sales Agile Methodologies ITIL Project Management Telecommunications SDLC Service Management Team Management Business Analysis Skills  Integration Solution Architecture Requirements Analysis Software Project... Strategy Pre-sales Agile Methodologies ITIL Project Management Telecommunications SDLC Service Management Team Management Business Analysis Integration Solution Architecture Requirements Analysis Software Project... Strategy Pre-sales Agile Methodologies ITIL Project Management Telecommunications SDLC Service Management Team Management Business Analysis Integration Solution Architecture Requirements Analysis Software Project... Strategy Pre-sales Agile Methodologies ITIL Project Management Telecommunications SDLC Service Management Team Management Business Analysis ", "Summary Skill set includes 20 years of server administration; dealing directly with customers; VMware vCenter, VMware vSphere, Microsoft Certified, troubleshooting. Physical servers include IBM, Dell, HP. Virtual machines include Windows Server 2003, Windows Server 2008, now learning Windows Server 2012. Security tools include Tripwire, Kiwi Syslog, Sonicwall firewalls, SOHO firewalls, Checkpoint firewalls, McAfee ePO Anti-virus, Symantec Corporate Anti-Virus, VPN, DISA STIG hardening, and auditing. Summary Skill set includes 20 years of server administration; dealing directly with customers; VMware vCenter, VMware vSphere, Microsoft Certified, troubleshooting. Physical servers include IBM, Dell, HP. Virtual machines include Windows Server 2003, Windows Server 2008, now learning Windows Server 2012. Security tools include Tripwire, Kiwi Syslog, Sonicwall firewalls, SOHO firewalls, Checkpoint firewalls, McAfee ePO Anti-virus, Symantec Corporate Anti-Virus, VPN, DISA STIG hardening, and auditing. Skill set includes 20 years of server administration; dealing directly with customers; VMware vCenter, VMware vSphere, Microsoft Certified, troubleshooting. Physical servers include IBM, Dell, HP. Virtual machines include Windows Server 2003, Windows Server 2008, now learning Windows Server 2012. Security tools include Tripwire, Kiwi Syslog, Sonicwall firewalls, SOHO firewalls, Checkpoint firewalls, McAfee ePO Anti-virus, Symantec Corporate Anti-Virus, VPN, DISA STIG hardening, and auditing. Skill set includes 20 years of server administration; dealing directly with customers; VMware vCenter, VMware vSphere, Microsoft Certified, troubleshooting. Physical servers include IBM, Dell, HP. Virtual machines include Windows Server 2003, Windows Server 2008, now learning Windows Server 2012. Security tools include Tripwire, Kiwi Syslog, Sonicwall firewalls, SOHO firewalls, Checkpoint firewalls, McAfee ePO Anti-virus, Symantec Corporate Anti-Virus, VPN, DISA STIG hardening, and auditing. Experience Technical Delivery Manager IBM September 2013  – Present (2 years) Manage a team of 10 Windows system administrators, 6 Linux system administrators, and 3 VMware system administrators, an automation engineer, and a Database administrator. Virtualization Consultant Computer Technologies of Northern Colorado (CTONC) 2003  – Present (12 years) Greater Denver Area Independent IT Consultant working with VMware vSphere, ESXi, vCenter, Windows Server 2008, Exchange 2007, 2010. \n \n•\tEngineered & Installed VMware vSphere (ESXi) & vCenter clusters on Dell R810 hardware. \n•\tSecurity hardening to DISA STIG standards, audits, Tripwire. \n• Worked closely with ISSO's for accreditation and documentation for SSP's. \n Sr. Systems Administrator BAE Systems 2006  –  2011  (5 years) Systems Administration for Windows 2000, 2003, 2008, Compellent SAN, Exchange 2007, VMware. \n• Installed and Maintained 140 TB Complellent SAN. \n• Maintained error free operation for 2 years, zero customer data lost. \n• Checkpoint firewall & VPN setup. Manager, Windows IT / ISSO DigitalGlobe, Inc. 2003  –  2006  (3 years) Managed team of 7 system administrators. ISSO responsibility included writing SSP's and keeping documentation current for accreditation. Kiwi syslog setup across Windows and Linux machines. Senior Technology Consultant Velocity Services LLC 2000  –  2003  (3 years) Small business consulting. Setting up firewalls, routers, computers, servers. Technical Delivery Manager IBM September 2013  – Present (2 years) Manage a team of 10 Windows system administrators, 6 Linux system administrators, and 3 VMware system administrators, an automation engineer, and a Database administrator. Technical Delivery Manager IBM September 2013  – Present (2 years) Manage a team of 10 Windows system administrators, 6 Linux system administrators, and 3 VMware system administrators, an automation engineer, and a Database administrator. Virtualization Consultant Computer Technologies of Northern Colorado (CTONC) 2003  – Present (12 years) Greater Denver Area Independent IT Consultant working with VMware vSphere, ESXi, vCenter, Windows Server 2008, Exchange 2007, 2010. \n \n•\tEngineered & Installed VMware vSphere (ESXi) & vCenter clusters on Dell R810 hardware. \n•\tSecurity hardening to DISA STIG standards, audits, Tripwire. \n• Worked closely with ISSO's for accreditation and documentation for SSP's. \n Virtualization Consultant Computer Technologies of Northern Colorado (CTONC) 2003  – Present (12 years) Greater Denver Area Independent IT Consultant working with VMware vSphere, ESXi, vCenter, Windows Server 2008, Exchange 2007, 2010. \n \n•\tEngineered & Installed VMware vSphere (ESXi) & vCenter clusters on Dell R810 hardware. \n•\tSecurity hardening to DISA STIG standards, audits, Tripwire. \n• Worked closely with ISSO's for accreditation and documentation for SSP's. \n Sr. Systems Administrator BAE Systems 2006  –  2011  (5 years) Systems Administration for Windows 2000, 2003, 2008, Compellent SAN, Exchange 2007, VMware. \n• Installed and Maintained 140 TB Complellent SAN. \n• Maintained error free operation for 2 years, zero customer data lost. \n• Checkpoint firewall & VPN setup. Sr. Systems Administrator BAE Systems 2006  –  2011  (5 years) Systems Administration for Windows 2000, 2003, 2008, Compellent SAN, Exchange 2007, VMware. \n• Installed and Maintained 140 TB Complellent SAN. \n• Maintained error free operation for 2 years, zero customer data lost. \n• Checkpoint firewall & VPN setup. Manager, Windows IT / ISSO DigitalGlobe, Inc. 2003  –  2006  (3 years) Managed team of 7 system administrators. ISSO responsibility included writing SSP's and keeping documentation current for accreditation. Kiwi syslog setup across Windows and Linux machines. Manager, Windows IT / ISSO DigitalGlobe, Inc. 2003  –  2006  (3 years) Managed team of 7 system administrators. ISSO responsibility included writing SSP's and keeping documentation current for accreditation. Kiwi syslog setup across Windows and Linux machines. Senior Technology Consultant Velocity Services LLC 2000  –  2003  (3 years) Small business consulting. Setting up firewalls, routers, computers, servers. Senior Technology Consultant Velocity Services LLC 2000  –  2003  (3 years) Small business consulting. Setting up firewalls, routers, computers, servers. Skills VMware Infrastructure vCenter VMware ESXi Windows Server 2008 Microsoft Technologies Exchange Server 2010 Microsoft Exchange VMware ESX Virtualization Security Clearance Cloud Computing vSphere VMware Computers Windows Server VDI VMware View vCenter Server Win2008 System Administration Windows Troubleshooting Security Microsoft Certified... Linux SAN Server Administration Active Directory Storage Area Networks Network Security Servers Firewalls Data Center Disaster Recovery VMware vSphere See 20+     See less Skills  VMware Infrastructure vCenter VMware ESXi Windows Server 2008 Microsoft Technologies Exchange Server 2010 Microsoft Exchange VMware ESX Virtualization Security Clearance Cloud Computing vSphere VMware Computers Windows Server VDI VMware View vCenter Server Win2008 System Administration Windows Troubleshooting Security Microsoft Certified... Linux SAN Server Administration Active Directory Storage Area Networks Network Security Servers Firewalls Data Center Disaster Recovery VMware vSphere See 20+     See less VMware Infrastructure vCenter VMware ESXi Windows Server 2008 Microsoft Technologies Exchange Server 2010 Microsoft Exchange VMware ESX Virtualization Security Clearance Cloud Computing vSphere VMware Computers Windows Server VDI VMware View vCenter Server Win2008 System Administration Windows Troubleshooting Security Microsoft Certified... Linux SAN Server Administration Active Directory Storage Area Networks Network Security Servers Firewalls Data Center Disaster Recovery VMware vSphere See 20+     See less VMware Infrastructure vCenter VMware ESXi Windows Server 2008 Microsoft Technologies Exchange Server 2010 Microsoft Exchange VMware ESX Virtualization Security Clearance Cloud Computing vSphere VMware Computers Windows Server VDI VMware View vCenter Server Win2008 System Administration Windows Troubleshooting Security Microsoft Certified... Linux SAN Server Administration Active Directory Storage Area Networks Network Security Servers Firewalls Data Center Disaster Recovery VMware vSphere See 20+     See less Education VMware VMware Certified Associate 2013  – 2013 Microsoft Microsoft Certified Professional 1995  – 2012 Colorado Technical University Bachelor of Science in Business Administration,  IT 2004  – 2006 VMware VMware Certified Associate 2013  – 2013 VMware VMware Certified Associate 2013  – 2013 VMware VMware Certified Associate 2013  – 2013 Microsoft Microsoft Certified Professional 1995  – 2012 Microsoft Microsoft Certified Professional 1995  – 2012 Microsoft Microsoft Certified Professional 1995  – 2012 Colorado Technical University Bachelor of Science in Business Administration,  IT 2004  – 2006 Colorado Technical University Bachelor of Science in Business Administration,  IT 2004  – 2006 Colorado Technical University Bachelor of Science in Business Administration,  IT 2004  – 2006 ", "Experience Technical Delivery Manager IBM Global Process Services November 2007  – Present (7 years 10 months) Technical Delivery Manager IBM Global Process Services November 2007  – Present (7 years 10 months) Technical Delivery Manager IBM Global Process Services November 2007  – Present (7 years 10 months) Education Little flower high school Bachelor of com Little flower high school Bachelor of com Little flower high school Bachelor of com Little flower high school Bachelor of com ", "Experience Technical Delivery Manager IBM July 2014  – Present (1 year 2 months) Newark NJ Manager of systems and development (ISG/DBG) AIG 2007  – Present (8 years) Technical Delivery Manager IBM July 2014  – Present (1 year 2 months) Newark NJ Technical Delivery Manager IBM July 2014  – Present (1 year 2 months) Newark NJ Manager of systems and development (ISG/DBG) AIG 2007  – Present (8 years) Manager of systems and development (ISG/DBG) AIG 2007  – Present (8 years) Skills IT Strategy Vendor Management Business Strategy Process Improvement Cost Containment Re-engineering Project Management Cost Accounting Information Technology Strategy IT Management Business Process... ITIL Business Analysis SDLC Integration Disaster Recovery Management Enterprise Architecture Data Center See 5+     See less Skills  IT Strategy Vendor Management Business Strategy Process Improvement Cost Containment Re-engineering Project Management Cost Accounting Information Technology Strategy IT Management Business Process... ITIL Business Analysis SDLC Integration Disaster Recovery Management Enterprise Architecture Data Center See 5+     See less IT Strategy Vendor Management Business Strategy Process Improvement Cost Containment Re-engineering Project Management Cost Accounting Information Technology Strategy IT Management Business Process... ITIL Business Analysis SDLC Integration Disaster Recovery Management Enterprise Architecture Data Center See 5+     See less IT Strategy Vendor Management Business Strategy Process Improvement Cost Containment Re-engineering Project Management Cost Accounting Information Technology Strategy IT Management Business Process... ITIL Business Analysis SDLC Integration Disaster Recovery Management Enterprise Architecture Data Center See 5+     See less ", "Summary 15+ years of qualitative experience in the Global IT Environment across software development, Project Management, Transformation and Team Management. \n- Worked with IBM for 10 years and now with Capgemini since last 2 years. \n- Adept at managing teams at Onshore, Offshore & Distributed locations. \n \nBalanced mix of management, delivery, consulting and operations exposure \n- Took on changes and new challenges. \n- Trouble shooting and problem solving skills. \n \nHands on experience in handling Transition & Transformation, Method Exponent (Process Gap Analysis and Design), CMMI v1.2, ITIL Model based Organization Performance Improvements, Process Optimization (LEAN), Change Management (Process and Cultural Change Management). Specialties:Troubleshooting and Client Management for IT projects. \n \nChange Management, CMMI, ISO 9001, ITIL, Lean, Automation, Tool implementation, etc... basically implement what makes sense for the situation Summary 15+ years of qualitative experience in the Global IT Environment across software development, Project Management, Transformation and Team Management. \n- Worked with IBM for 10 years and now with Capgemini since last 2 years. \n- Adept at managing teams at Onshore, Offshore & Distributed locations. \n \nBalanced mix of management, delivery, consulting and operations exposure \n- Took on changes and new challenges. \n- Trouble shooting and problem solving skills. \n \nHands on experience in handling Transition & Transformation, Method Exponent (Process Gap Analysis and Design), CMMI v1.2, ITIL Model based Organization Performance Improvements, Process Optimization (LEAN), Change Management (Process and Cultural Change Management). Specialties:Troubleshooting and Client Management for IT projects. \n \nChange Management, CMMI, ISO 9001, ITIL, Lean, Automation, Tool implementation, etc... basically implement what makes sense for the situation 15+ years of qualitative experience in the Global IT Environment across software development, Project Management, Transformation and Team Management. \n- Worked with IBM for 10 years and now with Capgemini since last 2 years. \n- Adept at managing teams at Onshore, Offshore & Distributed locations. \n \nBalanced mix of management, delivery, consulting and operations exposure \n- Took on changes and new challenges. \n- Trouble shooting and problem solving skills. \n \nHands on experience in handling Transition & Transformation, Method Exponent (Process Gap Analysis and Design), CMMI v1.2, ITIL Model based Organization Performance Improvements, Process Optimization (LEAN), Change Management (Process and Cultural Change Management). Specialties:Troubleshooting and Client Management for IT projects. \n \nChange Management, CMMI, ISO 9001, ITIL, Lean, Automation, Tool implementation, etc... basically implement what makes sense for the situation 15+ years of qualitative experience in the Global IT Environment across software development, Project Management, Transformation and Team Management. \n- Worked with IBM for 10 years and now with Capgemini since last 2 years. \n- Adept at managing teams at Onshore, Offshore & Distributed locations. \n \nBalanced mix of management, delivery, consulting and operations exposure \n- Took on changes and new challenges. \n- Trouble shooting and problem solving skills. \n \nHands on experience in handling Transition & Transformation, Method Exponent (Process Gap Analysis and Design), CMMI v1.2, ITIL Model based Organization Performance Improvements, Process Optimization (LEAN), Change Management (Process and Cultural Change Management). Specialties:Troubleshooting and Client Management for IT projects. \n \nChange Management, CMMI, ISO 9001, ITIL, Lean, Automation, Tool implementation, etc... basically implement what makes sense for the situation Experience Development Manager Allscripts August 2013  – Present (2 years 1 month) Bengaluru Area, India Engagement Manager Capgemini November 2012  –  July 2013  (9 months) Bangalore Delivery and Operations Head Capgemini October 2010  –  March 2012  (1 year 6 months) Bangalore Transformation Program Manager IBM India Pvt. Ltd. January 2009  –  October 2010  (1 year 10 months) Gurgaon, India Senior Manager - Quality IBM India Pvt Ltd August 2005  –  December 2008  (3 years 5 months) Gurgaon, India Technical Delivery Manager IBM June 2004  –  August 2005  (1 year 3 months) Melbourne Area, Australia Technical Delivery Manager IBM May 2000  –  June 2004  (4 years 2 months) Bangalore Senior Software Engineer eFunds (HCL Deluxe or iDLX) February 1999  –  May 2000  (1 year 4 months) Chennai Area, India Development Manager Allscripts August 2013  – Present (2 years 1 month) Bengaluru Area, India Development Manager Allscripts August 2013  – Present (2 years 1 month) Bengaluru Area, India Engagement Manager Capgemini November 2012  –  July 2013  (9 months) Bangalore Engagement Manager Capgemini November 2012  –  July 2013  (9 months) Bangalore Delivery and Operations Head Capgemini October 2010  –  March 2012  (1 year 6 months) Bangalore Delivery and Operations Head Capgemini October 2010  –  March 2012  (1 year 6 months) Bangalore Transformation Program Manager IBM India Pvt. Ltd. January 2009  –  October 2010  (1 year 10 months) Gurgaon, India Transformation Program Manager IBM India Pvt. Ltd. January 2009  –  October 2010  (1 year 10 months) Gurgaon, India Senior Manager - Quality IBM India Pvt Ltd August 2005  –  December 2008  (3 years 5 months) Gurgaon, India Senior Manager - Quality IBM India Pvt Ltd August 2005  –  December 2008  (3 years 5 months) Gurgaon, India Technical Delivery Manager IBM June 2004  –  August 2005  (1 year 3 months) Melbourne Area, Australia Technical Delivery Manager IBM June 2004  –  August 2005  (1 year 3 months) Melbourne Area, Australia Technical Delivery Manager IBM May 2000  –  June 2004  (4 years 2 months) Bangalore Technical Delivery Manager IBM May 2000  –  June 2004  (4 years 2 months) Bangalore Senior Software Engineer eFunds (HCL Deluxe or iDLX) February 1999  –  May 2000  (1 year 4 months) Chennai Area, India Senior Software Engineer eFunds (HCL Deluxe or iDLX) February 1999  –  May 2000  (1 year 4 months) Chennai Area, India Skills Software Project... Service Delivery Run the IT Business... Improve the IT Business... Reform the IT Business... Program Management Consultancy ITIL CMMI Lean IT Six Sigma ITIL v3 Foundations... CSQA PMO PMP Project Manager... DB2 Global Delivery Resource Management Software Quality... Strategy CRM Change Management Team Management Outsourcing Process Improvement Management Project Management Requirements Analysis SDLC IT Strategy Vendor Management See 17+     See less Skills  Software Project... Service Delivery Run the IT Business... Improve the IT Business... Reform the IT Business... Program Management Consultancy ITIL CMMI Lean IT Six Sigma ITIL v3 Foundations... CSQA PMO PMP Project Manager... DB2 Global Delivery Resource Management Software Quality... Strategy CRM Change Management Team Management Outsourcing Process Improvement Management Project Management Requirements Analysis SDLC IT Strategy Vendor Management See 17+     See less Software Project... Service Delivery Run the IT Business... Improve the IT Business... Reform the IT Business... Program Management Consultancy ITIL CMMI Lean IT Six Sigma ITIL v3 Foundations... CSQA PMO PMP Project Manager... DB2 Global Delivery Resource Management Software Quality... Strategy CRM Change Management Team Management Outsourcing Process Improvement Management Project Management Requirements Analysis SDLC IT Strategy Vendor Management See 17+     See less Software Project... Service Delivery Run the IT Business... Improve the IT Business... Reform the IT Business... Program Management Consultancy ITIL CMMI Lean IT Six Sigma ITIL v3 Foundations... CSQA PMO PMP Project Manager... DB2 Global Delivery Resource Management Software Quality... Strategy CRM Change Management Team Management Outsourcing Process Improvement Management Project Management Requirements Analysis SDLC IT Strategy Vendor Management See 17+     See less Education Nagpur University Bachelors of Engineering 1992  – 1996 Model School Nagpur University Bachelors of Engineering 1992  – 1996 Nagpur University Bachelors of Engineering 1992  – 1996 Nagpur University Bachelors of Engineering 1992  – 1996 Model School Model School Model School Honors & Awards Additional Honors & Awards ITIL V3 Foundation Certified \nISO 9000 Series Lead Auditor from BVQI \nSEI CMMi v1.2 ATM \nSEI CSQA Certified \nDB2 User Certified Additional Honors & Awards ITIL V3 Foundation Certified \nISO 9000 Series Lead Auditor from BVQI \nSEI CMMi v1.2 ATM \nSEI CSQA Certified \nDB2 User Certified Additional Honors & Awards ITIL V3 Foundation Certified \nISO 9000 Series Lead Auditor from BVQI \nSEI CMMi v1.2 ATM \nSEI CSQA Certified \nDB2 User Certified Additional Honors & Awards ITIL V3 Foundation Certified \nISO 9000 Series Lead Auditor from BVQI \nSEI CMMi v1.2 ATM \nSEI CSQA Certified \nDB2 User Certified ", "Skills Unix Operating Systems Unix Security Team Leadership AIX Administration Project Delivery Disaster Recovery AIX Service Delivery Solution Architecture IT Service Management ITIL LPAR Cloud Computing Enterprise Architecture Data Center IT Strategy Virtualization Security Unix IBM AIX Integration See 6+     See less Skills  Unix Operating Systems Unix Security Team Leadership AIX Administration Project Delivery Disaster Recovery AIX Service Delivery Solution Architecture IT Service Management ITIL LPAR Cloud Computing Enterprise Architecture Data Center IT Strategy Virtualization Security Unix IBM AIX Integration See 6+     See less Unix Operating Systems Unix Security Team Leadership AIX Administration Project Delivery Disaster Recovery AIX Service Delivery Solution Architecture IT Service Management ITIL LPAR Cloud Computing Enterprise Architecture Data Center IT Strategy Virtualization Security Unix IBM AIX Integration See 6+     See less Unix Operating Systems Unix Security Team Leadership AIX Administration Project Delivery Disaster Recovery AIX Service Delivery Solution Architecture IT Service Management ITIL LPAR Cloud Computing Enterprise Architecture Data Center IT Strategy Virtualization Security Unix IBM AIX Integration See 6+     See less ", "Summary ServiceNow| One of the fastest-growing cloud companies where employees are empowered to solve real problems \n \nServiceNow is the Enterprise Cloud Company. We focus on transforming the delivery & management of services to help the modern enterprise operate faster and be more scalable than ever before. More than 25% of the world’s largest companies rely on us every day. \n \nWe are aggressively hiring in all areas of the business in nearly every state, province and country around the globe.  \n \nThe opportunity is NOW. Connect with me to learn more or check out www.servicenow.com Summary ServiceNow| One of the fastest-growing cloud companies where employees are empowered to solve real problems \n \nServiceNow is the Enterprise Cloud Company. We focus on transforming the delivery & management of services to help the modern enterprise operate faster and be more scalable than ever before. More than 25% of the world’s largest companies rely on us every day. \n \nWe are aggressively hiring in all areas of the business in nearly every state, province and country around the globe.  \n \nThe opportunity is NOW. Connect with me to learn more or check out www.servicenow.com ServiceNow| One of the fastest-growing cloud companies where employees are empowered to solve real problems \n \nServiceNow is the Enterprise Cloud Company. We focus on transforming the delivery & management of services to help the modern enterprise operate faster and be more scalable than ever before. More than 25% of the world’s largest companies rely on us every day. \n \nWe are aggressively hiring in all areas of the business in nearly every state, province and country around the globe.  \n \nThe opportunity is NOW. Connect with me to learn more or check out www.servicenow.com ServiceNow| One of the fastest-growing cloud companies where employees are empowered to solve real problems \n \nServiceNow is the Enterprise Cloud Company. We focus on transforming the delivery & management of services to help the modern enterprise operate faster and be more scalable than ever before. More than 25% of the world’s largest companies rely on us every day. \n \nWe are aggressively hiring in all areas of the business in nearly every state, province and country around the globe.  \n \nThe opportunity is NOW. Connect with me to learn more or check out www.servicenow.com Experience Senior Solution Consultant ServiceNow - The Enterprise Cloud Company October 2014  – Present (11 months) New York Senior Solution Consultant ServiceNow - The Enterprise Cloud Company October 2014  – Present (11 months) New York Senior Solution Consultant ServiceNow - The Enterprise Cloud Company October 2014  – Present (11 months) New York Languages   Skills Cloud Computing IT Strategy Enterprise Architecture ITIL IT Service Management Integration Enterprise Software Requirements Analysis Service Management Management Incident Management Service Catalog Agile & Waterfall... Application Lifecycle... Change Management Service Delivery Project Delivery Disaster Recovery See 3+     See less Skills  Cloud Computing IT Strategy Enterprise Architecture ITIL IT Service Management Integration Enterprise Software Requirements Analysis Service Management Management Incident Management Service Catalog Agile & Waterfall... Application Lifecycle... Change Management Service Delivery Project Delivery Disaster Recovery See 3+     See less Cloud Computing IT Strategy Enterprise Architecture ITIL IT Service Management Integration Enterprise Software Requirements Analysis Service Management Management Incident Management Service Catalog Agile & Waterfall... Application Lifecycle... Change Management Service Delivery Project Delivery Disaster Recovery See 3+     See less Cloud Computing IT Strategy Enterprise Architecture ITIL IT Service Management Integration Enterprise Software Requirements Analysis Service Management Management Incident Management Service Catalog Agile & Waterfall... Application Lifecycle... Change Management Service Delivery Project Delivery Disaster Recovery See 3+     See less Education Queen Mary, U. of London Bachelor's Degree,  Computer Science 1993  – 1996 BSc. Computer Science Activities and Societies:  Vice President ,  Panjabi Society Queen Mary, U. of London BSc. Computer Science,  Computer Science 1993  – 1996 BSc. (Hons) Computer Science Activities and Societies:  Vice President ,  Punjabi Society Queen Mary, U. of London Bachelor's Degree,  Computer Science 1993  – 1996 BSc. Computer Science Activities and Societies:  Vice President ,  Panjabi Society Queen Mary, U. of London Bachelor's Degree,  Computer Science 1993  – 1996 BSc. Computer Science Activities and Societies:  Vice President ,  Panjabi Society Queen Mary, U. of London Bachelor's Degree,  Computer Science 1993  – 1996 BSc. Computer Science Activities and Societies:  Vice President ,  Panjabi Society Queen Mary, U. of London BSc. Computer Science,  Computer Science 1993  – 1996 BSc. (Hons) Computer Science Activities and Societies:  Vice President ,  Punjabi Society Queen Mary, U. of London BSc. Computer Science,  Computer Science 1993  – 1996 BSc. (Hons) Computer Science Activities and Societies:  Vice President ,  Punjabi Society Queen Mary, U. of London BSc. Computer Science,  Computer Science 1993  – 1996 BSc. (Hons) Computer Science Activities and Societies:  Vice President ,  Punjabi Society ", "Experience Tech-lead & Technical Delivery Manager IBM Danmark March 2015  – Present (6 months) Aarhus Working as IT-Specialist, Tech Lead and TDM for the MWPM team. \nApplication/Package create and test, SCCM 2007 & 2012 \nHardware certification, SCCM 2007 & 2012 \nSCCM 2012 certified. 1E Nomad knowledge \nResponsible for WSUS, Symantec to workstations. \nOutsourcing and reporting is also in my scope. \n \nPlan projects and work schedule for the team. Team work with other teams across country's. \nResponsible for transition (lift/shift) work to delivery centers Account Focal Point IBM Global Services June 2011  – Present (4 years 3 months) Århus Area, Denmark Working as IT-Specialist and Account Focal Point/Tech Lead for the SPMS team. \nPackage create and test, SCCM 2007 & 2012 and Tivoli systems \nApplication deployment, SCCM 2007 & 2012 and Tivoli systems \nHardware certification, SCCM 2007 & 2012 and Tivoli systems \nResponsible for WSUS, Symantec to workstations. \nOutsourcing and reporting is also in my scope. \n \nPlan projects and work schedule for the team. Team work with other teams across country's. \n \nAlso Focal Point and Tech Lead for SPMS team and responsible for transition (lift/shift) work to delivery centers IT-Specialist IBM Global Services August 2008  –  June 2011  (2 years 11 months) Århus Area, Denmark SPMS - Software Platform Management Services. \nCreating, testing and deployment of SMS/SCCM and Tivoli application packages. \nPlan and execute project for global application update +5000 workstations. \nWSUS update. \nResponsible for Symantec updates/maintenance to workstations. Helpdesk - IT-Specialist IBM Global Services September 2004  –  August 2008  (4 years) Århus Area, Denmark Worked at helpdesk and user administration. Supporting a range of different systems, SAP, Notes, Microsoft Office, Windows and much more. Helpdesk & Onsite IT support Cheminova A/S July 2001  –  August 2004  (3 years 2 months) Denmark Worked in IT department, as part of a helpdesk, dispatch and Onsite support team. Performing daily task and adhoc task. Software and hardware. Installing and testing. Tech-lead & Technical Delivery Manager IBM Danmark March 2015  – Present (6 months) Aarhus Working as IT-Specialist, Tech Lead and TDM for the MWPM team. \nApplication/Package create and test, SCCM 2007 & 2012 \nHardware certification, SCCM 2007 & 2012 \nSCCM 2012 certified. 1E Nomad knowledge \nResponsible for WSUS, Symantec to workstations. \nOutsourcing and reporting is also in my scope. \n \nPlan projects and work schedule for the team. Team work with other teams across country's. \nResponsible for transition (lift/shift) work to delivery centers Tech-lead & Technical Delivery Manager IBM Danmark March 2015  – Present (6 months) Aarhus Working as IT-Specialist, Tech Lead and TDM for the MWPM team. \nApplication/Package create and test, SCCM 2007 & 2012 \nHardware certification, SCCM 2007 & 2012 \nSCCM 2012 certified. 1E Nomad knowledge \nResponsible for WSUS, Symantec to workstations. \nOutsourcing and reporting is also in my scope. \n \nPlan projects and work schedule for the team. Team work with other teams across country's. \nResponsible for transition (lift/shift) work to delivery centers Account Focal Point IBM Global Services June 2011  – Present (4 years 3 months) Århus Area, Denmark Working as IT-Specialist and Account Focal Point/Tech Lead for the SPMS team. \nPackage create and test, SCCM 2007 & 2012 and Tivoli systems \nApplication deployment, SCCM 2007 & 2012 and Tivoli systems \nHardware certification, SCCM 2007 & 2012 and Tivoli systems \nResponsible for WSUS, Symantec to workstations. \nOutsourcing and reporting is also in my scope. \n \nPlan projects and work schedule for the team. Team work with other teams across country's. \n \nAlso Focal Point and Tech Lead for SPMS team and responsible for transition (lift/shift) work to delivery centers Account Focal Point IBM Global Services June 2011  – Present (4 years 3 months) Århus Area, Denmark Working as IT-Specialist and Account Focal Point/Tech Lead for the SPMS team. \nPackage create and test, SCCM 2007 & 2012 and Tivoli systems \nApplication deployment, SCCM 2007 & 2012 and Tivoli systems \nHardware certification, SCCM 2007 & 2012 and Tivoli systems \nResponsible for WSUS, Symantec to workstations. \nOutsourcing and reporting is also in my scope. \n \nPlan projects and work schedule for the team. Team work with other teams across country's. \n \nAlso Focal Point and Tech Lead for SPMS team and responsible for transition (lift/shift) work to delivery centers IT-Specialist IBM Global Services August 2008  –  June 2011  (2 years 11 months) Århus Area, Denmark SPMS - Software Platform Management Services. \nCreating, testing and deployment of SMS/SCCM and Tivoli application packages. \nPlan and execute project for global application update +5000 workstations. \nWSUS update. \nResponsible for Symantec updates/maintenance to workstations. IT-Specialist IBM Global Services August 2008  –  June 2011  (2 years 11 months) Århus Area, Denmark SPMS - Software Platform Management Services. \nCreating, testing and deployment of SMS/SCCM and Tivoli application packages. \nPlan and execute project for global application update +5000 workstations. \nWSUS update. \nResponsible for Symantec updates/maintenance to workstations. Helpdesk - IT-Specialist IBM Global Services September 2004  –  August 2008  (4 years) Århus Area, Denmark Worked at helpdesk and user administration. Supporting a range of different systems, SAP, Notes, Microsoft Office, Windows and much more. Helpdesk - IT-Specialist IBM Global Services September 2004  –  August 2008  (4 years) Århus Area, Denmark Worked at helpdesk and user administration. Supporting a range of different systems, SAP, Notes, Microsoft Office, Windows and much more. Helpdesk & Onsite IT support Cheminova A/S July 2001  –  August 2004  (3 years 2 months) Denmark Worked in IT department, as part of a helpdesk, dispatch and Onsite support team. Performing daily task and adhoc task. Software and hardware. Installing and testing. Helpdesk & Onsite IT support Cheminova A/S July 2001  –  August 2004  (3 years 2 months) Denmark Worked in IT department, as part of a helpdesk, dispatch and Onsite support team. Performing daily task and adhoc task. Software and hardware. Installing and testing. Skills Incident Management System Deployment Technical Support SCCM IBM Tivoli WSUS Windows Transition Management Help Desk Support Computer Hardware Project Planning IT Security Best... Patch Management Symantec Endpoint... Lotus Notes IT Service Management ITIL IT Operations IT Management Service Desk See 5+     See less Skills  Incident Management System Deployment Technical Support SCCM IBM Tivoli WSUS Windows Transition Management Help Desk Support Computer Hardware Project Planning IT Security Best... Patch Management Symantec Endpoint... Lotus Notes IT Service Management ITIL IT Operations IT Management Service Desk See 5+     See less Incident Management System Deployment Technical Support SCCM IBM Tivoli WSUS Windows Transition Management Help Desk Support Computer Hardware Project Planning IT Security Best... Patch Management Symantec Endpoint... Lotus Notes IT Service Management ITIL IT Operations IT Management Service Desk See 5+     See less Incident Management System Deployment Technical Support SCCM IBM Tivoli WSUS Windows Transition Management Help Desk Support Computer Hardware Project Planning IT Security Best... Patch Management Symantec Endpoint... Lotus Notes IT Service Management ITIL IT Operations IT Management Service Desk See 5+     See less Education Ikast Handelsskole Webdesign. RIS installation. IT Support 2002  – 2004 Activities and Societies:  Part fulltime job at Cheminova A/S ,  part school at Ikast Handelsskole. Lemvig Handelsskole HH 1999  – 2001 Ikast Handelsskole Webdesign. RIS installation. IT Support 2002  – 2004 Activities and Societies:  Part fulltime job at Cheminova A/S ,  part school at Ikast Handelsskole. Ikast Handelsskole Webdesign. RIS installation. IT Support 2002  – 2004 Activities and Societies:  Part fulltime job at Cheminova A/S ,  part school at Ikast Handelsskole. Ikast Handelsskole Webdesign. RIS installation. IT Support 2002  – 2004 Activities and Societies:  Part fulltime job at Cheminova A/S ,  part school at Ikast Handelsskole. Lemvig Handelsskole HH 1999  – 2001 Lemvig Handelsskole HH 1999  – 2001 Lemvig Handelsskole HH 1999  – 2001 ", "Experience Technical Delivery Manager IBM April 2014  – Present (1 year 5 months) Boulder, CO Senior SAN Engineer Raytheon February 2011  –  April 2014  (3 years 3 months) Daily O&M of 8 Fibre Channel fabrics connecting >300 physical and virtual servers to 1.5 PB of storage and 2 SL8500s. Manage daily tasks associated with all NAS storage. \n \nDesign, implement and test a wholesale switch for switch replacement of 2 Brocade fabrics (integrating DCX) while maintaining zero downtime.  \n \nManage the migration of data from older EMC CX700 and EMC CX3-80 arrays to EMC VNX Unified array.  \n \nProvision LUNS and file systems from arrays (EMC CX700, CX3-80, CX4-xx, VNX Block and Unified) for use on various OS platforms including (Windows/VM, Solaris and RHEL). Make appropriate zoning changes to fabrics (Cisco MDS / Brocade) to ensure redundant paths and highly available access to LUNs. \n \nDesign, implement and test new technologies such as EMC Avamar, Oracle NAS. \n \nAct as Storage/SAN SME for all engineering projects for multiple sites. Senior Storage Engineer Harris Corporation 2005  –  2011  (6 years) Manage daily operation of 4 large-scale Fibre Channel fabrics connecting >500 servers to 2.5 PB of storage and 4 tape libraries (L700, SL3000, SL8500). \n \nProvision LUNs from arrays (Hitachi 9980, 3Par S & T series, Sun/STK 35xx, 61xx, 7410) for use on various OS platforms including (Windows/VM, Solaris and RHEL). Make appropriate zoning changes to fabrics (Cisco MDS / Brocade) to ensure redundant paths and highly available access to LUNs. Bring LUNs into the OS and build volumes (Veritas VM, LVM, ZFS) and file systems (VxFS, ZFS, GFS) as appropriate. \n \nProvide total lifecycle maintenance of all equipment from install and initial configuration, break / fix, patching / upgrades to migration and replacement. \n \nDesign, implement and test procedures to ensure DR / BC at remote sites.  \n \nCreate backup and archiving policies (Veritas Netbackup), off-site rotation and storage. \n \nDesign procedures and perform remote site replication of critical datasets (synchronous and asynchronous). \n \nBrief customer on weekly status. Compile reports and brief monthly uptime results, storage allocation levels, project status and outstanding issues. \n \nAttend vendor demonstrations / conferences on new / emerging technologies. Make formal recommendations on future purchases of hardware and software to the customer. \n \nManage a training plan for the team to ensure all team members get any formal training needed while maintaining necessary levels of support for ongoing operations. Work with training vendors to coordinate custom training, many times combining several classes into a single class that suits our needs specifically. Senior Systems Engineer Impact Innovations 2002  –  2004  (2 years) Technical Delivery Manager IBM April 2014  – Present (1 year 5 months) Boulder, CO Technical Delivery Manager IBM April 2014  – Present (1 year 5 months) Boulder, CO Senior SAN Engineer Raytheon February 2011  –  April 2014  (3 years 3 months) Daily O&M of 8 Fibre Channel fabrics connecting >300 physical and virtual servers to 1.5 PB of storage and 2 SL8500s. Manage daily tasks associated with all NAS storage. \n \nDesign, implement and test a wholesale switch for switch replacement of 2 Brocade fabrics (integrating DCX) while maintaining zero downtime.  \n \nManage the migration of data from older EMC CX700 and EMC CX3-80 arrays to EMC VNX Unified array.  \n \nProvision LUNS and file systems from arrays (EMC CX700, CX3-80, CX4-xx, VNX Block and Unified) for use on various OS platforms including (Windows/VM, Solaris and RHEL). Make appropriate zoning changes to fabrics (Cisco MDS / Brocade) to ensure redundant paths and highly available access to LUNs. \n \nDesign, implement and test new technologies such as EMC Avamar, Oracle NAS. \n \nAct as Storage/SAN SME for all engineering projects for multiple sites. Senior SAN Engineer Raytheon February 2011  –  April 2014  (3 years 3 months) Daily O&M of 8 Fibre Channel fabrics connecting >300 physical and virtual servers to 1.5 PB of storage and 2 SL8500s. Manage daily tasks associated with all NAS storage. \n \nDesign, implement and test a wholesale switch for switch replacement of 2 Brocade fabrics (integrating DCX) while maintaining zero downtime.  \n \nManage the migration of data from older EMC CX700 and EMC CX3-80 arrays to EMC VNX Unified array.  \n \nProvision LUNS and file systems from arrays (EMC CX700, CX3-80, CX4-xx, VNX Block and Unified) for use on various OS platforms including (Windows/VM, Solaris and RHEL). Make appropriate zoning changes to fabrics (Cisco MDS / Brocade) to ensure redundant paths and highly available access to LUNs. \n \nDesign, implement and test new technologies such as EMC Avamar, Oracle NAS. \n \nAct as Storage/SAN SME for all engineering projects for multiple sites. Senior Storage Engineer Harris Corporation 2005  –  2011  (6 years) Manage daily operation of 4 large-scale Fibre Channel fabrics connecting >500 servers to 2.5 PB of storage and 4 tape libraries (L700, SL3000, SL8500). \n \nProvision LUNs from arrays (Hitachi 9980, 3Par S & T series, Sun/STK 35xx, 61xx, 7410) for use on various OS platforms including (Windows/VM, Solaris and RHEL). Make appropriate zoning changes to fabrics (Cisco MDS / Brocade) to ensure redundant paths and highly available access to LUNs. Bring LUNs into the OS and build volumes (Veritas VM, LVM, ZFS) and file systems (VxFS, ZFS, GFS) as appropriate. \n \nProvide total lifecycle maintenance of all equipment from install and initial configuration, break / fix, patching / upgrades to migration and replacement. \n \nDesign, implement and test procedures to ensure DR / BC at remote sites.  \n \nCreate backup and archiving policies (Veritas Netbackup), off-site rotation and storage. \n \nDesign procedures and perform remote site replication of critical datasets (synchronous and asynchronous). \n \nBrief customer on weekly status. Compile reports and brief monthly uptime results, storage allocation levels, project status and outstanding issues. \n \nAttend vendor demonstrations / conferences on new / emerging technologies. Make formal recommendations on future purchases of hardware and software to the customer. \n \nManage a training plan for the team to ensure all team members get any formal training needed while maintaining necessary levels of support for ongoing operations. Work with training vendors to coordinate custom training, many times combining several classes into a single class that suits our needs specifically. Senior Storage Engineer Harris Corporation 2005  –  2011  (6 years) Manage daily operation of 4 large-scale Fibre Channel fabrics connecting >500 servers to 2.5 PB of storage and 4 tape libraries (L700, SL3000, SL8500). \n \nProvision LUNs from arrays (Hitachi 9980, 3Par S & T series, Sun/STK 35xx, 61xx, 7410) for use on various OS platforms including (Windows/VM, Solaris and RHEL). Make appropriate zoning changes to fabrics (Cisco MDS / Brocade) to ensure redundant paths and highly available access to LUNs. Bring LUNs into the OS and build volumes (Veritas VM, LVM, ZFS) and file systems (VxFS, ZFS, GFS) as appropriate. \n \nProvide total lifecycle maintenance of all equipment from install and initial configuration, break / fix, patching / upgrades to migration and replacement. \n \nDesign, implement and test procedures to ensure DR / BC at remote sites.  \n \nCreate backup and archiving policies (Veritas Netbackup), off-site rotation and storage. \n \nDesign procedures and perform remote site replication of critical datasets (synchronous and asynchronous). \n \nBrief customer on weekly status. Compile reports and brief monthly uptime results, storage allocation levels, project status and outstanding issues. \n \nAttend vendor demonstrations / conferences on new / emerging technologies. Make formal recommendations on future purchases of hardware and software to the customer. \n \nManage a training plan for the team to ensure all team members get any formal training needed while maintaining necessary levels of support for ongoing operations. Work with training vendors to coordinate custom training, many times combining several classes into a single class that suits our needs specifically. Senior Systems Engineer Impact Innovations 2002  –  2004  (2 years) Senior Systems Engineer Impact Innovations 2002  –  2004  (2 years) Skills Solaris Unix Security Clearance Linux VMware Integration Disaster Recovery Enterprise Architecture SAN Virtualization Cisco Technologies NAS High Availability Skills  Solaris Unix Security Clearance Linux VMware Integration Disaster Recovery Enterprise Architecture SAN Virtualization Cisco Technologies NAS High Availability Solaris Unix Security Clearance Linux VMware Integration Disaster Recovery Enterprise Architecture SAN Virtualization Cisco Technologies NAS High Availability Solaris Unix Security Clearance Linux VMware Integration Disaster Recovery Enterprise Architecture SAN Virtualization Cisco Technologies NAS High Availability ", "Skills SDLC Solution Architecture Enterprise Architecture IT Strategy Requirements Analysis ITIL IT Service Management Service Delivery Software Project... Integration Requirements Gathering IT Management Data Migration PMO Business Process Project Delivery Global Delivery Business Process Design Project Portfolio... Oracle Enterprise Software Business Analysis Software Development ERP EAI Business Process... Governance ETL Architecture Visio User Acceptance Testing Incident Management Business Process... Systems Analysis SOA Pre-sales Data Warehousing See 22+     See less Skills  SDLC Solution Architecture Enterprise Architecture IT Strategy Requirements Analysis ITIL IT Service Management Service Delivery Software Project... Integration Requirements Gathering IT Management Data Migration PMO Business Process Project Delivery Global Delivery Business Process Design Project Portfolio... Oracle Enterprise Software Business Analysis Software Development ERP EAI Business Process... Governance ETL Architecture Visio User Acceptance Testing Incident Management Business Process... Systems Analysis SOA Pre-sales Data Warehousing See 22+     See less SDLC Solution Architecture Enterprise Architecture IT Strategy Requirements Analysis ITIL IT Service Management Service Delivery Software Project... Integration Requirements Gathering IT Management Data Migration PMO Business Process Project Delivery Global Delivery Business Process Design Project Portfolio... Oracle Enterprise Software Business Analysis Software Development ERP EAI Business Process... Governance ETL Architecture Visio User Acceptance Testing Incident Management Business Process... Systems Analysis SOA Pre-sales Data Warehousing See 22+     See less SDLC Solution Architecture Enterprise Architecture IT Strategy Requirements Analysis ITIL IT Service Management Service Delivery Software Project... Integration Requirements Gathering IT Management Data Migration PMO Business Process Project Delivery Global Delivery Business Process Design Project Portfolio... Oracle Enterprise Software Business Analysis Software Development ERP EAI Business Process... Governance ETL Architecture Visio User Acceptance Testing Incident Management Business Process... Systems Analysis SOA Pre-sales Data Warehousing See 22+     See less ", "Summary - Having around 15 years of total extensive experience in software applications involving SAP Security / BASIS, SAP GRC, system analysis, design, development in JAVA, Oracle for the industries like CPG, Pherma, Retrail, Telecom, Banking. \n- Currently working on SAP Security / GRC for last 8+ years.  \n- Experienced in handling multiple roles -  \n* Project Management responsibilities of a SAP BASIS project for a renowned pharmaceutical organization \n* Service Lead of SAP Security and BASIS pool for a famous Consumer Products company. \n* Played the Technical Delivery Manager role for one of the IBM cluster containing 45+ members.  \n* IBM Subject Matter Expert and mentor in the area of SAP Security and SAP GRC \n* BASIS & Security leadership role in IBM BASIS & Security practice area. \n* As a senior SAP Security architect and team member \n- Experienced on Design, Build, approaches, and methodology along with conducting workshop, gathering requirements, designing Business Blue Print. \n- Has profound knowledge in ERP Implementation/Support Process, Methodology, and Tools that are widely used for Global AMS project for the industries like Retail, Consumer Products, and Pharmaceutical. \n- Expertise on SAP User & Authorization on SAP HR and also for other modules starting from 4.6B till ECC 6. \n- Proficient in implementing and support of the SAP GRC components like RAR / CC, SPM / FF, SPM / AE. \n- Previously worked extensively on SAP BASIS Activities until SAP 4.6C SR2  \n- Around 6 years experience in development on Oracle platform and in Java and related technologies. Specialties:Currently working on SAP Security and GRC AC for last 8+ years in the following areas: \n•\tEnd to end SAP Security-authorization implementation on SAP HR including other SAP modules \n•\tImplementation and support of the SAP GRC AC 5.x and 10.0 (components like RAR, CUP, SPM). \n•\tAs subject matter expert and mentor, provide solutions in the area of SAP Security and SAP GRC. \n•\tAs Senior Lead or Technical Delivery Managers handling a large no of resources for different industries Summary - Having around 15 years of total extensive experience in software applications involving SAP Security / BASIS, SAP GRC, system analysis, design, development in JAVA, Oracle for the industries like CPG, Pherma, Retrail, Telecom, Banking. \n- Currently working on SAP Security / GRC for last 8+ years.  \n- Experienced in handling multiple roles -  \n* Project Management responsibilities of a SAP BASIS project for a renowned pharmaceutical organization \n* Service Lead of SAP Security and BASIS pool for a famous Consumer Products company. \n* Played the Technical Delivery Manager role for one of the IBM cluster containing 45+ members.  \n* IBM Subject Matter Expert and mentor in the area of SAP Security and SAP GRC \n* BASIS & Security leadership role in IBM BASIS & Security practice area. \n* As a senior SAP Security architect and team member \n- Experienced on Design, Build, approaches, and methodology along with conducting workshop, gathering requirements, designing Business Blue Print. \n- Has profound knowledge in ERP Implementation/Support Process, Methodology, and Tools that are widely used for Global AMS project for the industries like Retail, Consumer Products, and Pharmaceutical. \n- Expertise on SAP User & Authorization on SAP HR and also for other modules starting from 4.6B till ECC 6. \n- Proficient in implementing and support of the SAP GRC components like RAR / CC, SPM / FF, SPM / AE. \n- Previously worked extensively on SAP BASIS Activities until SAP 4.6C SR2  \n- Around 6 years experience in development on Oracle platform and in Java and related technologies. Specialties:Currently working on SAP Security and GRC AC for last 8+ years in the following areas: \n•\tEnd to end SAP Security-authorization implementation on SAP HR including other SAP modules \n•\tImplementation and support of the SAP GRC AC 5.x and 10.0 (components like RAR, CUP, SPM). \n•\tAs subject matter expert and mentor, provide solutions in the area of SAP Security and SAP GRC. \n•\tAs Senior Lead or Technical Delivery Managers handling a large no of resources for different industries - Having around 15 years of total extensive experience in software applications involving SAP Security / BASIS, SAP GRC, system analysis, design, development in JAVA, Oracle for the industries like CPG, Pherma, Retrail, Telecom, Banking. \n- Currently working on SAP Security / GRC for last 8+ years.  \n- Experienced in handling multiple roles -  \n* Project Management responsibilities of a SAP BASIS project for a renowned pharmaceutical organization \n* Service Lead of SAP Security and BASIS pool for a famous Consumer Products company. \n* Played the Technical Delivery Manager role for one of the IBM cluster containing 45+ members.  \n* IBM Subject Matter Expert and mentor in the area of SAP Security and SAP GRC \n* BASIS & Security leadership role in IBM BASIS & Security practice area. \n* As a senior SAP Security architect and team member \n- Experienced on Design, Build, approaches, and methodology along with conducting workshop, gathering requirements, designing Business Blue Print. \n- Has profound knowledge in ERP Implementation/Support Process, Methodology, and Tools that are widely used for Global AMS project for the industries like Retail, Consumer Products, and Pharmaceutical. \n- Expertise on SAP User & Authorization on SAP HR and also for other modules starting from 4.6B till ECC 6. \n- Proficient in implementing and support of the SAP GRC components like RAR / CC, SPM / FF, SPM / AE. \n- Previously worked extensively on SAP BASIS Activities until SAP 4.6C SR2  \n- Around 6 years experience in development on Oracle platform and in Java and related technologies. Specialties:Currently working on SAP Security and GRC AC for last 8+ years in the following areas: \n•\tEnd to end SAP Security-authorization implementation on SAP HR including other SAP modules \n•\tImplementation and support of the SAP GRC AC 5.x and 10.0 (components like RAR, CUP, SPM). \n•\tAs subject matter expert and mentor, provide solutions in the area of SAP Security and SAP GRC. \n•\tAs Senior Lead or Technical Delivery Managers handling a large no of resources for different industries - Having around 15 years of total extensive experience in software applications involving SAP Security / BASIS, SAP GRC, system analysis, design, development in JAVA, Oracle for the industries like CPG, Pherma, Retrail, Telecom, Banking. \n- Currently working on SAP Security / GRC for last 8+ years.  \n- Experienced in handling multiple roles -  \n* Project Management responsibilities of a SAP BASIS project for a renowned pharmaceutical organization \n* Service Lead of SAP Security and BASIS pool for a famous Consumer Products company. \n* Played the Technical Delivery Manager role for one of the IBM cluster containing 45+ members.  \n* IBM Subject Matter Expert and mentor in the area of SAP Security and SAP GRC \n* BASIS & Security leadership role in IBM BASIS & Security practice area. \n* As a senior SAP Security architect and team member \n- Experienced on Design, Build, approaches, and methodology along with conducting workshop, gathering requirements, designing Business Blue Print. \n- Has profound knowledge in ERP Implementation/Support Process, Methodology, and Tools that are widely used for Global AMS project for the industries like Retail, Consumer Products, and Pharmaceutical. \n- Expertise on SAP User & Authorization on SAP HR and also for other modules starting from 4.6B till ECC 6. \n- Proficient in implementing and support of the SAP GRC components like RAR / CC, SPM / FF, SPM / AE. \n- Previously worked extensively on SAP BASIS Activities until SAP 4.6C SR2  \n- Around 6 years experience in development on Oracle platform and in Java and related technologies. Specialties:Currently working on SAP Security and GRC AC for last 8+ years in the following areas: \n•\tEnd to end SAP Security-authorization implementation on SAP HR including other SAP modules \n•\tImplementation and support of the SAP GRC AC 5.x and 10.0 (components like RAR, CUP, SPM). \n•\tAs subject matter expert and mentor, provide solutions in the area of SAP Security and SAP GRC. \n•\tAs Senior Lead or Technical Delivery Managers handling a large no of resources for different industries Experience SAP Security-HR Security-GRC Architect, Lead & Technical Delivery Manager IBM Global Services October 2003  – Present (11 years 11 months) London, United Kingdom Experienced in handling multiple roles -  \n- Project Management responsibilities of a SAP BASIS project for a renowned pharmaceutical organization \n- Service Lead of SAP Security & BASIS pool and senior Team Lead for no of different industries. \n- Played the Technical Delivery Manager role for one of the IBM cluster containing 45+ members.  \n- IBM Subject Matter Expert and mentor in the area of SAP Security and SAP GRC \n- BASIS & Security leadership role in IBM BASIS & Security practice area. \n- As a senior SAP Security architect and team member SAP BASIS consultant, Oracle & JAVA Senior Developer/Team Lead HCL Technologies Ltd February 1998  –  September 2003  (5 years 8 months) Kolkata and Noida, India - Worked extensively on SAP BASIS Activities until SAP 4.6C SR2  \n- Around 4 years experience in development on Oracle platform and in Java and related technologies. Oracle, Powerbuilder Developer A J Entriprises Ltd August 1996  –  January 1998  (1 year 6 months) Kolkata, India SAP Security-HR Security-GRC Architect, Lead & Technical Delivery Manager IBM Global Services October 2003  – Present (11 years 11 months) London, United Kingdom Experienced in handling multiple roles -  \n- Project Management responsibilities of a SAP BASIS project for a renowned pharmaceutical organization \n- Service Lead of SAP Security & BASIS pool and senior Team Lead for no of different industries. \n- Played the Technical Delivery Manager role for one of the IBM cluster containing 45+ members.  \n- IBM Subject Matter Expert and mentor in the area of SAP Security and SAP GRC \n- BASIS & Security leadership role in IBM BASIS & Security practice area. \n- As a senior SAP Security architect and team member SAP Security-HR Security-GRC Architect, Lead & Technical Delivery Manager IBM Global Services October 2003  – Present (11 years 11 months) London, United Kingdom Experienced in handling multiple roles -  \n- Project Management responsibilities of a SAP BASIS project for a renowned pharmaceutical organization \n- Service Lead of SAP Security & BASIS pool and senior Team Lead for no of different industries. \n- Played the Technical Delivery Manager role for one of the IBM cluster containing 45+ members.  \n- IBM Subject Matter Expert and mentor in the area of SAP Security and SAP GRC \n- BASIS & Security leadership role in IBM BASIS & Security practice area. \n- As a senior SAP Security architect and team member SAP BASIS consultant, Oracle & JAVA Senior Developer/Team Lead HCL Technologies Ltd February 1998  –  September 2003  (5 years 8 months) Kolkata and Noida, India - Worked extensively on SAP BASIS Activities until SAP 4.6C SR2  \n- Around 4 years experience in development on Oracle platform and in Java and related technologies. SAP BASIS consultant, Oracle & JAVA Senior Developer/Team Lead HCL Technologies Ltd February 1998  –  September 2003  (5 years 8 months) Kolkata and Noida, India - Worked extensively on SAP BASIS Activities until SAP 4.6C SR2  \n- Around 4 years experience in development on Oracle platform and in Java and related technologies. Oracle, Powerbuilder Developer A J Entriprises Ltd August 1996  –  January 1998  (1 year 6 months) Kolkata, India Oracle, Powerbuilder Developer A J Entriprises Ltd August 1996  –  January 1998  (1 year 6 months) Kolkata, India Skills SAP Security SAP GRC AC SAP HR Security Skills  SAP Security SAP GRC AC SAP HR Security SAP Security SAP GRC AC SAP HR Security SAP Security SAP GRC AC SAP HR Security Education University of Calcutta BSc,  Phy , Chem, Maths, Eng 1989  – 1991 Uttarpara Amarendra Vidyapith Higher Secondary,  Phy , Chem, Maths, Eng 1987  – 1989 University of Calcutta BSc,  Phy , Chem, Maths, Eng 1989  – 1991 University of Calcutta BSc,  Phy , Chem, Maths, Eng 1989  – 1991 University of Calcutta BSc,  Phy , Chem, Maths, Eng 1989  – 1991 Uttarpara Amarendra Vidyapith Higher Secondary,  Phy , Chem, Maths, Eng 1987  – 1989 Uttarpara Amarendra Vidyapith Higher Secondary,  Phy , Chem, Maths, Eng 1987  – 1989 Uttarpara Amarendra Vidyapith Higher Secondary,  Phy , Chem, Maths, Eng 1987  – 1989 Honors & Awards IBM Retention award IBM August 2007 Bravo award IBM September 2006 IBM Retention award IBM August 2007 IBM Retention award IBM August 2007 IBM Retention award IBM August 2007 Bravo award IBM September 2006 Bravo award IBM September 2006 Bravo award IBM September 2006 ", "Summary IT Infrastructure Consultant - VCP, CCNA, MCP, MCTS, MCITP, OCA, CCE, CCA, ITIL,VCA, VCP Cloud. Summary IT Infrastructure Consultant - VCP, CCNA, MCP, MCTS, MCITP, OCA, CCE, CCA, ITIL,VCA, VCP Cloud. IT Infrastructure Consultant - VCP, CCNA, MCP, MCTS, MCITP, OCA, CCE, CCA, ITIL,VCA, VCP Cloud. IT Infrastructure Consultant - VCP, CCNA, MCP, MCTS, MCITP, OCA, CCE, CCA, ITIL,VCA, VCP Cloud. Experience Technical Delivery Manager IBM April 2014  – Present (1 year 5 months) Chennai Technical Delivery Manager \nManaging overall Intel & VMware delivery IT-Consultant (Virtualization) Hewlett-Packard February 2012  –  April 2014  (2 years 3 months) Chennai Leading the service delivery in virtualization domain.for the World's largest shipping and logistics company Senior Executive - IT Maersk Line April 2011  –  February 2012  (11 months) Chennai Lead the Virtualization team (VMware) Assistant Manager - IT Cholayil Private Limited April 2007  –  May 2011  (4 years 2 months) Chennai Managed the entire IT Infrastructure for the Cholayil Group in both software and hardware perspective. Senior Customer Support Engineer Zenith Computers August 2003  –  May 2007  (3 years 10 months) Chennai Worked for Wintel server support & VMware deployments. Support Engineer Prism systems & solutions September 2000  –  February 2003  (2 years 6 months) Chennai Desktop & Laptop support engineer Technical Delivery Manager IBM April 2014  – Present (1 year 5 months) Chennai Technical Delivery Manager \nManaging overall Intel & VMware delivery Technical Delivery Manager IBM April 2014  – Present (1 year 5 months) Chennai Technical Delivery Manager \nManaging overall Intel & VMware delivery IT-Consultant (Virtualization) Hewlett-Packard February 2012  –  April 2014  (2 years 3 months) Chennai Leading the service delivery in virtualization domain.for the World's largest shipping and logistics company IT-Consultant (Virtualization) Hewlett-Packard February 2012  –  April 2014  (2 years 3 months) Chennai Leading the service delivery in virtualization domain.for the World's largest shipping and logistics company Senior Executive - IT Maersk Line April 2011  –  February 2012  (11 months) Chennai Lead the Virtualization team (VMware) Senior Executive - IT Maersk Line April 2011  –  February 2012  (11 months) Chennai Lead the Virtualization team (VMware) Assistant Manager - IT Cholayil Private Limited April 2007  –  May 2011  (4 years 2 months) Chennai Managed the entire IT Infrastructure for the Cholayil Group in both software and hardware perspective. Assistant Manager - IT Cholayil Private Limited April 2007  –  May 2011  (4 years 2 months) Chennai Managed the entire IT Infrastructure for the Cholayil Group in both software and hardware perspective. Senior Customer Support Engineer Zenith Computers August 2003  –  May 2007  (3 years 10 months) Chennai Worked for Wintel server support & VMware deployments. Senior Customer Support Engineer Zenith Computers August 2003  –  May 2007  (3 years 10 months) Chennai Worked for Wintel server support & VMware deployments. Support Engineer Prism systems & solutions September 2000  –  February 2003  (2 years 6 months) Chennai Desktop & Laptop support engineer Support Engineer Prism systems & solutions September 2000  –  February 2003  (2 years 6 months) Chennai Desktop & Laptop support engineer ", "Experience Lead Business IT Consultant Canon Europe Ltd. December 2013  – Present (1 year 9 months) Lead BIC CRM. Design office Lead Service Experience for Canon Europe. Global Projectmanager Business Deployments Shell Global Solutions June 2013  –  November 2013  (6 months) The Hague Area, Netherlands Managing CIMS global business deployments for Shell Global in Malaysia, Philippines and Australia. Managing consultant IBM April 2013  –  May 2013  (2 months) Oracle ATG web commerce training \nOracle Fusion CRM training \nBusiness development activities for IBM Oracle Service Line Projectmanager 3rd party interfaces - KPN Arrow IBM January 2013  –  March 2013  (3 months) Den Haag Projectmanagement for 3rd party interfaces to KPNs Next Gen Customer Care and Billing system NGBSS. \nResponsible for managing interfaces with domains eChannels (shop, selfcare,apps), Logistics and Order Delivery Management. IBM B&P IBM September 2012  –  November 2012  (3 months) Amsterdam Area, Netherlands Various Bids & Proposal for IBM Netherlands Traveller IBM March 2012  –  June 2012  (4 months) California & SW USA Travelling South West USA with wife and kids Project Manager Rabobank savings products IBM May 2011  –  March 2012  (11 months) Project manager for end to end realization and implementation of a multi channel STP savings solution. \nAgile project for Java, Siebel and Oracle BPel. Project Manager Rabobank payment products IBM January 2008  –  May 2011  (3 years 5 months) Project manager for three large specification and implementation projects for multi channel payment applications. Delivery Manager KPN MDM (Siebel UCM) implementation IBM August 2007  –  January 2008  (6 months) Technical delivery manager for the IBM Siebel team implementing UCM. Traveller IBM August 2006  –  July 2007  (1 year) Enjoying South East Asia, Australia and New Zealand with my newly wed wife. Senior Build Lead Rabobank CRM 2005+ IBM January 2005  –  July 2006  (1 year 7 months) Build lead for several Siebel CRM implementations. \nCRM Integration (EAI) and Customer Order Management (COM). Senior CRM Consultant Innoveer Solutions July 2002  –  December 2004  (2 years 6 months) Team lead and build lead roles in small to medium sized CRM Siebel projects at various customers. \nFunctional & technical Siebel CRM consultant at various customers like Nefit, Intergas, Akzo Nobel in various industries. CRM Consultant Headstrong January 2002  –  June 2002  (6 months) Technical Siebel CRM consultant for Philips Customer Care Centre. IT Specialist IBM October 1998  –  December 2001  (3 years 3 months) Package implementation consultant for IBM CRM (Certified Siebel Core Consultancy Consultant) \nTraineeship and various roles in various divisions of IBM Netherlands. Lead Business IT Consultant Canon Europe Ltd. December 2013  – Present (1 year 9 months) Lead BIC CRM. Design office Lead Service Experience for Canon Europe. Lead Business IT Consultant Canon Europe Ltd. December 2013  – Present (1 year 9 months) Lead BIC CRM. Design office Lead Service Experience for Canon Europe. Global Projectmanager Business Deployments Shell Global Solutions June 2013  –  November 2013  (6 months) The Hague Area, Netherlands Managing CIMS global business deployments for Shell Global in Malaysia, Philippines and Australia. Global Projectmanager Business Deployments Shell Global Solutions June 2013  –  November 2013  (6 months) The Hague Area, Netherlands Managing CIMS global business deployments for Shell Global in Malaysia, Philippines and Australia. Managing consultant IBM April 2013  –  May 2013  (2 months) Oracle ATG web commerce training \nOracle Fusion CRM training \nBusiness development activities for IBM Oracle Service Line Managing consultant IBM April 2013  –  May 2013  (2 months) Oracle ATG web commerce training \nOracle Fusion CRM training \nBusiness development activities for IBM Oracle Service Line Projectmanager 3rd party interfaces - KPN Arrow IBM January 2013  –  March 2013  (3 months) Den Haag Projectmanagement for 3rd party interfaces to KPNs Next Gen Customer Care and Billing system NGBSS. \nResponsible for managing interfaces with domains eChannels (shop, selfcare,apps), Logistics and Order Delivery Management. Projectmanager 3rd party interfaces - KPN Arrow IBM January 2013  –  March 2013  (3 months) Den Haag Projectmanagement for 3rd party interfaces to KPNs Next Gen Customer Care and Billing system NGBSS. \nResponsible for managing interfaces with domains eChannels (shop, selfcare,apps), Logistics and Order Delivery Management. IBM B&P IBM September 2012  –  November 2012  (3 months) Amsterdam Area, Netherlands Various Bids & Proposal for IBM Netherlands IBM B&P IBM September 2012  –  November 2012  (3 months) Amsterdam Area, Netherlands Various Bids & Proposal for IBM Netherlands Traveller IBM March 2012  –  June 2012  (4 months) California & SW USA Travelling South West USA with wife and kids Traveller IBM March 2012  –  June 2012  (4 months) California & SW USA Travelling South West USA with wife and kids Project Manager Rabobank savings products IBM May 2011  –  March 2012  (11 months) Project manager for end to end realization and implementation of a multi channel STP savings solution. \nAgile project for Java, Siebel and Oracle BPel. Project Manager Rabobank savings products IBM May 2011  –  March 2012  (11 months) Project manager for end to end realization and implementation of a multi channel STP savings solution. \nAgile project for Java, Siebel and Oracle BPel. Project Manager Rabobank payment products IBM January 2008  –  May 2011  (3 years 5 months) Project manager for three large specification and implementation projects for multi channel payment applications. Project Manager Rabobank payment products IBM January 2008  –  May 2011  (3 years 5 months) Project manager for three large specification and implementation projects for multi channel payment applications. Delivery Manager KPN MDM (Siebel UCM) implementation IBM August 2007  –  January 2008  (6 months) Technical delivery manager for the IBM Siebel team implementing UCM. Delivery Manager KPN MDM (Siebel UCM) implementation IBM August 2007  –  January 2008  (6 months) Technical delivery manager for the IBM Siebel team implementing UCM. Traveller IBM August 2006  –  July 2007  (1 year) Enjoying South East Asia, Australia and New Zealand with my newly wed wife. Traveller IBM August 2006  –  July 2007  (1 year) Enjoying South East Asia, Australia and New Zealand with my newly wed wife. Senior Build Lead Rabobank CRM 2005+ IBM January 2005  –  July 2006  (1 year 7 months) Build lead for several Siebel CRM implementations. \nCRM Integration (EAI) and Customer Order Management (COM). Senior Build Lead Rabobank CRM 2005+ IBM January 2005  –  July 2006  (1 year 7 months) Build lead for several Siebel CRM implementations. \nCRM Integration (EAI) and Customer Order Management (COM). Senior CRM Consultant Innoveer Solutions July 2002  –  December 2004  (2 years 6 months) Team lead and build lead roles in small to medium sized CRM Siebel projects at various customers. \nFunctional & technical Siebel CRM consultant at various customers like Nefit, Intergas, Akzo Nobel in various industries. Senior CRM Consultant Innoveer Solutions July 2002  –  December 2004  (2 years 6 months) Team lead and build lead roles in small to medium sized CRM Siebel projects at various customers. \nFunctional & technical Siebel CRM consultant at various customers like Nefit, Intergas, Akzo Nobel in various industries. CRM Consultant Headstrong January 2002  –  June 2002  (6 months) Technical Siebel CRM consultant for Philips Customer Care Centre. CRM Consultant Headstrong January 2002  –  June 2002  (6 months) Technical Siebel CRM consultant for Philips Customer Care Centre. IT Specialist IBM October 1998  –  December 2001  (3 years 3 months) Package implementation consultant for IBM CRM (Certified Siebel Core Consultancy Consultant) \nTraineeship and various roles in various divisions of IBM Netherlands. IT Specialist IBM October 1998  –  December 2001  (3 years 3 months) Package implementation consultant for IBM CRM (Certified Siebel Core Consultancy Consultant) \nTraineeship and various roles in various divisions of IBM Netherlands. Skills Agile Project Management Project Management Delivery Management Team Building Leadership Offshore Project... CRM Master Data Management Integration Logistics Project Governance EAI Agile Methodologies Business Analysis Change Management Scrum Oracle Consulting Business Process See 4+     See less Skills  Agile Project Management Project Management Delivery Management Team Building Leadership Offshore Project... CRM Master Data Management Integration Logistics Project Governance EAI Agile Methodologies Business Analysis Change Management Scrum Oracle Consulting Business Process See 4+     See less Agile Project Management Project Management Delivery Management Team Building Leadership Offshore Project... CRM Master Data Management Integration Logistics Project Governance EAI Agile Methodologies Business Analysis Change Management Scrum Oracle Consulting Business Process See 4+     See less Agile Project Management Project Management Delivery Management Team Building Leadership Offshore Project... CRM Master Data Management Integration Logistics Project Governance EAI Agile Methodologies Business Analysis Change Management Scrum Oracle Consulting Business Process See 4+     See less ", "Skills ITIL IT Service Management AIX Disaster Recovery IT Management IT Operations IT Outsourcing IT Strategy Incident Management Mainframe Outsourcing Service Delivery Service Management Storage Storage Area Networks Technical Support See 1+     See less Skills  ITIL IT Service Management AIX Disaster Recovery IT Management IT Operations IT Outsourcing IT Strategy Incident Management Mainframe Outsourcing Service Delivery Service Management Storage Storage Area Networks Technical Support See 1+     See less ITIL IT Service Management AIX Disaster Recovery IT Management IT Operations IT Outsourcing IT Strategy Incident Management Mainframe Outsourcing Service Delivery Service Management Storage Storage Area Networks Technical Support See 1+     See less ITIL IT Service Management AIX Disaster Recovery IT Management IT Operations IT Outsourcing IT Strategy Incident Management Mainframe Outsourcing Service Delivery Service Management Storage Storage Area Networks Technical Support See 1+     See less ", "Summary Niels has a passion for technology and what can be achieved through innovation. Niels strives on challenges, and is an advocate for high quality solutions that not only meet but also exceed all customer expectations. \n \nNiels’ background comes from a variety of roles in various environments including Corporate, Banking, Insurance, and Government. In his current role as Infrastructure Architect – Virtualisation and Cloud for IBM, Niels architects Virtualisation and Cloud solutions for some of IBMs largest customers including a considerable percentage of his time spent working with a large customer in the banking sector and prior to that a global airline.  \n \nEarlier on in his time with IBM, Niels performed the role of Technical Delivery Manager for IBM at Qantas where he lead technical teams to drive successful delivery of technical services to his customer. Prior to joining IBM Niels was a Technical Solutions Designer for ViFX NZ, where he specialised in all aspects of the life cycle of complex Virtualisation and Storage infrastructure solutions. This role spanned consulting, solution architecture and delivery driving technical solutions to meet customer business requirements whilst leveraging all applicable technologies. \n \nPrior to his time at ViFX was a role as Lead Systems Engineer for Suncorp Australia, where he lead the integration of a large New Zealand insurer’s server and storage infrastructure with Suncorp’s infrastructure during a merger. Previous to this role Niels was a Technical Specialist for Promina NZ where he completed many successful infrastructure projects. Prior to these recent roles, Niels spent years building his technical expertise across a number of technical delivery roles. \n Summary Niels has a passion for technology and what can be achieved through innovation. Niels strives on challenges, and is an advocate for high quality solutions that not only meet but also exceed all customer expectations. \n \nNiels’ background comes from a variety of roles in various environments including Corporate, Banking, Insurance, and Government. In his current role as Infrastructure Architect – Virtualisation and Cloud for IBM, Niels architects Virtualisation and Cloud solutions for some of IBMs largest customers including a considerable percentage of his time spent working with a large customer in the banking sector and prior to that a global airline.  \n \nEarlier on in his time with IBM, Niels performed the role of Technical Delivery Manager for IBM at Qantas where he lead technical teams to drive successful delivery of technical services to his customer. Prior to joining IBM Niels was a Technical Solutions Designer for ViFX NZ, where he specialised in all aspects of the life cycle of complex Virtualisation and Storage infrastructure solutions. This role spanned consulting, solution architecture and delivery driving technical solutions to meet customer business requirements whilst leveraging all applicable technologies. \n \nPrior to his time at ViFX was a role as Lead Systems Engineer for Suncorp Australia, where he lead the integration of a large New Zealand insurer’s server and storage infrastructure with Suncorp’s infrastructure during a merger. Previous to this role Niels was a Technical Specialist for Promina NZ where he completed many successful infrastructure projects. Prior to these recent roles, Niels spent years building his technical expertise across a number of technical delivery roles. \n Niels has a passion for technology and what can be achieved through innovation. Niels strives on challenges, and is an advocate for high quality solutions that not only meet but also exceed all customer expectations. \n \nNiels’ background comes from a variety of roles in various environments including Corporate, Banking, Insurance, and Government. In his current role as Infrastructure Architect – Virtualisation and Cloud for IBM, Niels architects Virtualisation and Cloud solutions for some of IBMs largest customers including a considerable percentage of his time spent working with a large customer in the banking sector and prior to that a global airline.  \n \nEarlier on in his time with IBM, Niels performed the role of Technical Delivery Manager for IBM at Qantas where he lead technical teams to drive successful delivery of technical services to his customer. Prior to joining IBM Niels was a Technical Solutions Designer for ViFX NZ, where he specialised in all aspects of the life cycle of complex Virtualisation and Storage infrastructure solutions. This role spanned consulting, solution architecture and delivery driving technical solutions to meet customer business requirements whilst leveraging all applicable technologies. \n \nPrior to his time at ViFX was a role as Lead Systems Engineer for Suncorp Australia, where he lead the integration of a large New Zealand insurer’s server and storage infrastructure with Suncorp’s infrastructure during a merger. Previous to this role Niels was a Technical Specialist for Promina NZ where he completed many successful infrastructure projects. Prior to these recent roles, Niels spent years building his technical expertise across a number of technical delivery roles. \n Niels has a passion for technology and what can be achieved through innovation. Niels strives on challenges, and is an advocate for high quality solutions that not only meet but also exceed all customer expectations. \n \nNiels’ background comes from a variety of roles in various environments including Corporate, Banking, Insurance, and Government. In his current role as Infrastructure Architect – Virtualisation and Cloud for IBM, Niels architects Virtualisation and Cloud solutions for some of IBMs largest customers including a considerable percentage of his time spent working with a large customer in the banking sector and prior to that a global airline.  \n \nEarlier on in his time with IBM, Niels performed the role of Technical Delivery Manager for IBM at Qantas where he lead technical teams to drive successful delivery of technical services to his customer. Prior to joining IBM Niels was a Technical Solutions Designer for ViFX NZ, where he specialised in all aspects of the life cycle of complex Virtualisation and Storage infrastructure solutions. This role spanned consulting, solution architecture and delivery driving technical solutions to meet customer business requirements whilst leveraging all applicable technologies. \n \nPrior to his time at ViFX was a role as Lead Systems Engineer for Suncorp Australia, where he lead the integration of a large New Zealand insurer’s server and storage infrastructure with Suncorp’s infrastructure during a merger. Previous to this role Niels was a Technical Specialist for Promina NZ where he completed many successful infrastructure projects. Prior to these recent roles, Niels spent years building his technical expertise across a number of technical delivery roles. \n Experience Infrastructure Architect - Virtualisation and Cloud IBM August 2014  – Present (1 year 1 month) Sydney Area, Australia As Infrastructure Architect - Virtualisation and Cloud – WIA for IBM Australia, Niels architects Infrastructure solutions for IBM’s Westpac Integrated Account. His area of specialization in the Infrastructure Architecture team is to architect and design Virtualisation and Cloud based solutions.  \n \nNiels draws on his background across various infrastructure technologies to produce solutions that integrate well, meet all customer requirements, and exceed customer expectations wherever possible. Achievements during his time in this role thus far include various successful VMware Infrastructure based solutions, Unified Computing System based solutions, and a notable IBM Cloud Orchestrator solution.  \n \nOutside of his role architecting and designing Virtualisation and Cloud based solutions, Niels has performed various demos and presentations for high profile audiences, and added value to the IBM account team by providing hands on technical assistance and leadership to project SMEs.  \n \nAt this stage in his career Niels intends to expand on his architecture experience and work towards gaining Architect certification. Outside of Architecture, whilst involved in Virtualisation and Cloud solutions, he plans to expand on his virtualisation and cloud knowledge and experience across new technologies and capabilities, whilst leverging his leadership and customer service skills to be a well rounded asset to any Virtualisation and Cloud centric business \n Virtualisation Architect IBM July 2012  –  July 2014  (2 years 1 month) Sydney Area, Australia As Virtualisation Architect for IBM Australia, Niels architects Intel based Virtualisation solutions for some of IBMs largest customers, including a considerable percentage of his time spent working with a large customer in the banking sector and a global airline.  \n \nAchievements during his time in this role thus far include various successful VMware Infrastructure based solutions, a large scale Citrix XenServer solution design as part of a large VDI solution, and a notable large scale VMware vSphere and UCS design to host a XenDesktop based VDI solution capable of catering for up to 35,000+ users. \n \nIn this role Niels not only architects Intel based virtualisation solutions and produces detailed designs, but he also guides implementation teams through the successful implementation of those solutions. Niels also likes to keep in touch with the technology he designs solutions with, by getting hands on wherever possible, as well as supporting his colleagues during implementations. \n Technical Delivery Manager IBM Global Services April 2011  –  July 2012  (1 year 4 months) Niels was a Technical Delivery Manager for IBM at Qantas. In this role he worked alongside the service delivery managers as the technical arm of the team, leveraging his technical architecture and subject matter expertise to provide leadership to the delivery and operations teams across all areas of customer infrastructure. \n \nHis focus was leveraging his extensive technical background to provide direction and strategy to delivery teams when tackling the most complex of technical issues. Further to this Niels had a large focus on identifying shortfalls and inefficiencies of existing solutions and implementations where architectural improvement could be made through driving innovation and architectural strategy. \n \nNiels was a key member of the IBM Account team at Qantas leading IBM delivery teams to ensure techical delivery requirements were being met whilst always maintaining a high level of customer satisfaction. Niels not only worked with the operations teams, but spent a large amount of his time working with the Architecture team where he took his learnings from operations and leveraged that knowledge to architect solutions which improve solution capability and efficiency.  \n \nNiels is a personable good communicator and naturally builds good relationships with both his collegues and customers. Niels has leveraged these skills to build good relationships, earn a high level of trust and become well respected within both IBM and Qantas. \n Technical Delivery Manager Qantas Airways Ltd April 2011  –  July 2012  (1 year 4 months) Sydney Area, Australia Technical Solutions Designer ViFX July 2008  –  March 2011  (2 years 9 months) Experts in Virtualisation & Storage Technologies \n \nIn this role Niels specialised in all aspects of the life cycle of complex Virtualisation and Storage infrastructure solutions, including consultation, design, implementation and support. His projects encompassed less complex straightforward implementations, through to more complex and innovative integration of virtualisation and storage technologies to deliver specific, customised outcomes and solutions. \n \nIn this role Niels completed numerous successful projects for ViFX. These projects included virtualisation consultation, design and implementation of small through to large complex VMware 3.x, vSphere 4 and vSphere 4.1 solutions. \n \nAlong with his skills and experience in virtualisation, Niels also successfully architected and delivered storage solutions for various SME through to Large New Zealand businesses along with the design and implementation of their storage area networks (SANs). Lead Systems Engineer Suncorp July 2006  –  July 2008  (2 years 1 month) Niels worked for Promina Group who later in his tenure merged with Suncorp Australia, for over two years. He held two roles in this time, from his initial role as Technical Specialist through to his Lead Systems Engineer role. \n \nDuring his time with Promina Niels’ initial role was as a member the Intel Server Team who delivered infrastructure solutions for the various insurers who hosted their entire server and storage infrastructure within the Promina datacentre. These solutions comprised of Wintel, VMware, Citrix Presentation Server, and EMC storage solutions. Later in his time with Promina Niels was heavily involved in the merger of the NZ infrastructure with Suncorp Australia and was appointed a Lead Systems Engineer role. Systems Engineer CodeBlue July 2004  –  July 2006  (2 years 1 month) Niels was a Senior Systems Engineer for CodeBlue. Niels’ role comprised a combination of field engineering and account management duties. In his role he was allocated a subset of CodeBlue customers who were predominantly SME’s, to consult with regarding various projects which he would then deliver and support. As his customers were mostly SME’s Niels delivered solutions which catered for all areas of his customers IT requirements. These solutions comprised Wintel solutions, Networking, Firewalls, Directory services, Mail server solutions, Databases, Backup solutions, migration projects from Novell to Microsoft Windows Server and Disaster Recovery solutions. Systems Engineer Eagle Technology June 2001  –  June 2004  (3 years 1 month) During his tenure at Eagle Technology Niels moved from Customer Services Engineer through to Systems Engineer. He worked at Eagle Technology for over three and a half years. His duties through this time included the following: \n \n•\tActive Directory Services \n•\tCitrix Server Farm Administration \n•\tNetworking – Software / Hardware \n•\tMS Exchange Administration \n•\tServer / Desktop Support \n•\tMS Access Database Administration \n•\tPC Hardware and Software installation \n•\tDiagnosis and Resolution \n•\tTeam Leader (As required) IT Technician Manukau Institute of Technology 2000  –  2001  (1 year) Niels held the role of Technician for Manukau Institute of Technology. His duties carried out for this role included: \n \n•\tPC Hardware and Software installation \n•\tDiagnoses and resolution  \n•\tBasic Networking \n•\tTrouble shooting Infrastructure Architect - Virtualisation and Cloud IBM August 2014  – Present (1 year 1 month) Sydney Area, Australia As Infrastructure Architect - Virtualisation and Cloud – WIA for IBM Australia, Niels architects Infrastructure solutions for IBM’s Westpac Integrated Account. His area of specialization in the Infrastructure Architecture team is to architect and design Virtualisation and Cloud based solutions.  \n \nNiels draws on his background across various infrastructure technologies to produce solutions that integrate well, meet all customer requirements, and exceed customer expectations wherever possible. Achievements during his time in this role thus far include various successful VMware Infrastructure based solutions, Unified Computing System based solutions, and a notable IBM Cloud Orchestrator solution.  \n \nOutside of his role architecting and designing Virtualisation and Cloud based solutions, Niels has performed various demos and presentations for high profile audiences, and added value to the IBM account team by providing hands on technical assistance and leadership to project SMEs.  \n \nAt this stage in his career Niels intends to expand on his architecture experience and work towards gaining Architect certification. Outside of Architecture, whilst involved in Virtualisation and Cloud solutions, he plans to expand on his virtualisation and cloud knowledge and experience across new technologies and capabilities, whilst leverging his leadership and customer service skills to be a well rounded asset to any Virtualisation and Cloud centric business \n Infrastructure Architect - Virtualisation and Cloud IBM August 2014  – Present (1 year 1 month) Sydney Area, Australia As Infrastructure Architect - Virtualisation and Cloud – WIA for IBM Australia, Niels architects Infrastructure solutions for IBM’s Westpac Integrated Account. His area of specialization in the Infrastructure Architecture team is to architect and design Virtualisation and Cloud based solutions.  \n \nNiels draws on his background across various infrastructure technologies to produce solutions that integrate well, meet all customer requirements, and exceed customer expectations wherever possible. Achievements during his time in this role thus far include various successful VMware Infrastructure based solutions, Unified Computing System based solutions, and a notable IBM Cloud Orchestrator solution.  \n \nOutside of his role architecting and designing Virtualisation and Cloud based solutions, Niels has performed various demos and presentations for high profile audiences, and added value to the IBM account team by providing hands on technical assistance and leadership to project SMEs.  \n \nAt this stage in his career Niels intends to expand on his architecture experience and work towards gaining Architect certification. Outside of Architecture, whilst involved in Virtualisation and Cloud solutions, he plans to expand on his virtualisation and cloud knowledge and experience across new technologies and capabilities, whilst leverging his leadership and customer service skills to be a well rounded asset to any Virtualisation and Cloud centric business \n Virtualisation Architect IBM July 2012  –  July 2014  (2 years 1 month) Sydney Area, Australia As Virtualisation Architect for IBM Australia, Niels architects Intel based Virtualisation solutions for some of IBMs largest customers, including a considerable percentage of his time spent working with a large customer in the banking sector and a global airline.  \n \nAchievements during his time in this role thus far include various successful VMware Infrastructure based solutions, a large scale Citrix XenServer solution design as part of a large VDI solution, and a notable large scale VMware vSphere and UCS design to host a XenDesktop based VDI solution capable of catering for up to 35,000+ users. \n \nIn this role Niels not only architects Intel based virtualisation solutions and produces detailed designs, but he also guides implementation teams through the successful implementation of those solutions. Niels also likes to keep in touch with the technology he designs solutions with, by getting hands on wherever possible, as well as supporting his colleagues during implementations. \n Virtualisation Architect IBM July 2012  –  July 2014  (2 years 1 month) Sydney Area, Australia As Virtualisation Architect for IBM Australia, Niels architects Intel based Virtualisation solutions for some of IBMs largest customers, including a considerable percentage of his time spent working with a large customer in the banking sector and a global airline.  \n \nAchievements during his time in this role thus far include various successful VMware Infrastructure based solutions, a large scale Citrix XenServer solution design as part of a large VDI solution, and a notable large scale VMware vSphere and UCS design to host a XenDesktop based VDI solution capable of catering for up to 35,000+ users. \n \nIn this role Niels not only architects Intel based virtualisation solutions and produces detailed designs, but he also guides implementation teams through the successful implementation of those solutions. Niels also likes to keep in touch with the technology he designs solutions with, by getting hands on wherever possible, as well as supporting his colleagues during implementations. \n Technical Delivery Manager IBM Global Services April 2011  –  July 2012  (1 year 4 months) Niels was a Technical Delivery Manager for IBM at Qantas. In this role he worked alongside the service delivery managers as the technical arm of the team, leveraging his technical architecture and subject matter expertise to provide leadership to the delivery and operations teams across all areas of customer infrastructure. \n \nHis focus was leveraging his extensive technical background to provide direction and strategy to delivery teams when tackling the most complex of technical issues. Further to this Niels had a large focus on identifying shortfalls and inefficiencies of existing solutions and implementations where architectural improvement could be made through driving innovation and architectural strategy. \n \nNiels was a key member of the IBM Account team at Qantas leading IBM delivery teams to ensure techical delivery requirements were being met whilst always maintaining a high level of customer satisfaction. Niels not only worked with the operations teams, but spent a large amount of his time working with the Architecture team where he took his learnings from operations and leveraged that knowledge to architect solutions which improve solution capability and efficiency.  \n \nNiels is a personable good communicator and naturally builds good relationships with both his collegues and customers. Niels has leveraged these skills to build good relationships, earn a high level of trust and become well respected within both IBM and Qantas. \n Technical Delivery Manager IBM Global Services April 2011  –  July 2012  (1 year 4 months) Niels was a Technical Delivery Manager for IBM at Qantas. In this role he worked alongside the service delivery managers as the technical arm of the team, leveraging his technical architecture and subject matter expertise to provide leadership to the delivery and operations teams across all areas of customer infrastructure. \n \nHis focus was leveraging his extensive technical background to provide direction and strategy to delivery teams when tackling the most complex of technical issues. Further to this Niels had a large focus on identifying shortfalls and inefficiencies of existing solutions and implementations where architectural improvement could be made through driving innovation and architectural strategy. \n \nNiels was a key member of the IBM Account team at Qantas leading IBM delivery teams to ensure techical delivery requirements were being met whilst always maintaining a high level of customer satisfaction. Niels not only worked with the operations teams, but spent a large amount of his time working with the Architecture team where he took his learnings from operations and leveraged that knowledge to architect solutions which improve solution capability and efficiency.  \n \nNiels is a personable good communicator and naturally builds good relationships with both his collegues and customers. Niels has leveraged these skills to build good relationships, earn a high level of trust and become well respected within both IBM and Qantas. \n Technical Delivery Manager Qantas Airways Ltd April 2011  –  July 2012  (1 year 4 months) Sydney Area, Australia Technical Delivery Manager Qantas Airways Ltd April 2011  –  July 2012  (1 year 4 months) Sydney Area, Australia Technical Solutions Designer ViFX July 2008  –  March 2011  (2 years 9 months) Experts in Virtualisation & Storage Technologies \n \nIn this role Niels specialised in all aspects of the life cycle of complex Virtualisation and Storage infrastructure solutions, including consultation, design, implementation and support. His projects encompassed less complex straightforward implementations, through to more complex and innovative integration of virtualisation and storage technologies to deliver specific, customised outcomes and solutions. \n \nIn this role Niels completed numerous successful projects for ViFX. These projects included virtualisation consultation, design and implementation of small through to large complex VMware 3.x, vSphere 4 and vSphere 4.1 solutions. \n \nAlong with his skills and experience in virtualisation, Niels also successfully architected and delivered storage solutions for various SME through to Large New Zealand businesses along with the design and implementation of their storage area networks (SANs). Technical Solutions Designer ViFX July 2008  –  March 2011  (2 years 9 months) Experts in Virtualisation & Storage Technologies \n \nIn this role Niels specialised in all aspects of the life cycle of complex Virtualisation and Storage infrastructure solutions, including consultation, design, implementation and support. His projects encompassed less complex straightforward implementations, through to more complex and innovative integration of virtualisation and storage technologies to deliver specific, customised outcomes and solutions. \n \nIn this role Niels completed numerous successful projects for ViFX. These projects included virtualisation consultation, design and implementation of small through to large complex VMware 3.x, vSphere 4 and vSphere 4.1 solutions. \n \nAlong with his skills and experience in virtualisation, Niels also successfully architected and delivered storage solutions for various SME through to Large New Zealand businesses along with the design and implementation of their storage area networks (SANs). Lead Systems Engineer Suncorp July 2006  –  July 2008  (2 years 1 month) Niels worked for Promina Group who later in his tenure merged with Suncorp Australia, for over two years. He held two roles in this time, from his initial role as Technical Specialist through to his Lead Systems Engineer role. \n \nDuring his time with Promina Niels’ initial role was as a member the Intel Server Team who delivered infrastructure solutions for the various insurers who hosted their entire server and storage infrastructure within the Promina datacentre. These solutions comprised of Wintel, VMware, Citrix Presentation Server, and EMC storage solutions. Later in his time with Promina Niels was heavily involved in the merger of the NZ infrastructure with Suncorp Australia and was appointed a Lead Systems Engineer role. Lead Systems Engineer Suncorp July 2006  –  July 2008  (2 years 1 month) Niels worked for Promina Group who later in his tenure merged with Suncorp Australia, for over two years. He held two roles in this time, from his initial role as Technical Specialist through to his Lead Systems Engineer role. \n \nDuring his time with Promina Niels’ initial role was as a member the Intel Server Team who delivered infrastructure solutions for the various insurers who hosted their entire server and storage infrastructure within the Promina datacentre. These solutions comprised of Wintel, VMware, Citrix Presentation Server, and EMC storage solutions. Later in his time with Promina Niels was heavily involved in the merger of the NZ infrastructure with Suncorp Australia and was appointed a Lead Systems Engineer role. Systems Engineer CodeBlue July 2004  –  July 2006  (2 years 1 month) Niels was a Senior Systems Engineer for CodeBlue. Niels’ role comprised a combination of field engineering and account management duties. In his role he was allocated a subset of CodeBlue customers who were predominantly SME’s, to consult with regarding various projects which he would then deliver and support. As his customers were mostly SME’s Niels delivered solutions which catered for all areas of his customers IT requirements. These solutions comprised Wintel solutions, Networking, Firewalls, Directory services, Mail server solutions, Databases, Backup solutions, migration projects from Novell to Microsoft Windows Server and Disaster Recovery solutions. Systems Engineer CodeBlue July 2004  –  July 2006  (2 years 1 month) Niels was a Senior Systems Engineer for CodeBlue. Niels’ role comprised a combination of field engineering and account management duties. In his role he was allocated a subset of CodeBlue customers who were predominantly SME’s, to consult with regarding various projects which he would then deliver and support. As his customers were mostly SME’s Niels delivered solutions which catered for all areas of his customers IT requirements. These solutions comprised Wintel solutions, Networking, Firewalls, Directory services, Mail server solutions, Databases, Backup solutions, migration projects from Novell to Microsoft Windows Server and Disaster Recovery solutions. Systems Engineer Eagle Technology June 2001  –  June 2004  (3 years 1 month) During his tenure at Eagle Technology Niels moved from Customer Services Engineer through to Systems Engineer. He worked at Eagle Technology for over three and a half years. His duties through this time included the following: \n \n•\tActive Directory Services \n•\tCitrix Server Farm Administration \n•\tNetworking – Software / Hardware \n•\tMS Exchange Administration \n•\tServer / Desktop Support \n•\tMS Access Database Administration \n•\tPC Hardware and Software installation \n•\tDiagnosis and Resolution \n•\tTeam Leader (As required) Systems Engineer Eagle Technology June 2001  –  June 2004  (3 years 1 month) During his tenure at Eagle Technology Niels moved from Customer Services Engineer through to Systems Engineer. He worked at Eagle Technology for over three and a half years. His duties through this time included the following: \n \n•\tActive Directory Services \n•\tCitrix Server Farm Administration \n•\tNetworking – Software / Hardware \n•\tMS Exchange Administration \n•\tServer / Desktop Support \n•\tMS Access Database Administration \n•\tPC Hardware and Software installation \n•\tDiagnosis and Resolution \n•\tTeam Leader (As required) IT Technician Manukau Institute of Technology 2000  –  2001  (1 year) Niels held the role of Technician for Manukau Institute of Technology. His duties carried out for this role included: \n \n•\tPC Hardware and Software installation \n•\tDiagnoses and resolution  \n•\tBasic Networking \n•\tTrouble shooting IT Technician Manukau Institute of Technology 2000  –  2001  (1 year) Niels held the role of Technician for Manukau Institute of Technology. His duties carried out for this role included: \n \n•\tPC Hardware and Software installation \n•\tDiagnoses and resolution  \n•\tBasic Networking \n•\tTrouble shooting Languages English Native or bilingual proficiency Dutch Native or bilingual proficiency English Native or bilingual proficiency Dutch Native or bilingual proficiency English Native or bilingual proficiency Dutch Native or bilingual proficiency Native or bilingual proficiency Native or bilingual proficiency Skills Architecture Virtualization Solution Architecture VMware Disaster Recovery IT Service Management ITIL Storage Cloud Computing VMware ESX Servers Enterprise Architecture Active Directory Data Center IT Operations Service Management Service Delivery Infrastructure IT Strategy VMware Infrastructure Incident Management SAN NetApp IT Management Integration Microsoft Exchange Cisco Technologies vSphere Citrix VDI Storage Area Networks Firewalls Citrix Metaframe Technical Support Networking See 20+     See less Skills  Architecture Virtualization Solution Architecture VMware Disaster Recovery IT Service Management ITIL Storage Cloud Computing VMware ESX Servers Enterprise Architecture Active Directory Data Center IT Operations Service Management Service Delivery Infrastructure IT Strategy VMware Infrastructure Incident Management SAN NetApp IT Management Integration Microsoft Exchange Cisco Technologies vSphere Citrix VDI Storage Area Networks Firewalls Citrix Metaframe Technical Support Networking See 20+     See less Architecture Virtualization Solution Architecture VMware Disaster Recovery IT Service Management ITIL Storage Cloud Computing VMware ESX Servers Enterprise Architecture Active Directory Data Center IT Operations Service Management Service Delivery Infrastructure IT Strategy VMware Infrastructure Incident Management SAN NetApp IT Management Integration Microsoft Exchange Cisco Technologies vSphere Citrix VDI Storage Area Networks Firewalls Citrix Metaframe Technical Support Networking See 20+     See less Architecture Virtualization Solution Architecture VMware Disaster Recovery IT Service Management ITIL Storage Cloud Computing VMware ESX Servers Enterprise Architecture Active Directory Data Center IT Operations Service Management Service Delivery Infrastructure IT Strategy VMware Infrastructure Incident Management SAN NetApp IT Management Integration Microsoft Exchange Cisco Technologies vSphere Citrix VDI Storage Area Networks Firewalls Citrix Metaframe Technical Support Networking See 20+     See less Education Manukau Institute of Technology 1999  – 2001 Sacred Heart College Manukau Institute of Technology 1999  – 2001 Manukau Institute of Technology 1999  – 2001 Manukau Institute of Technology 1999  – 2001 Sacred Heart College Sacred Heart College Sacred Heart College Honors & Awards IBM key contributor award – Qantas account IBM 2011 Qantas IT Thank You award Qantas 2012 Qantas IT eXcel award Qantas 2012 IBM Manager’s Choice Award for demonstrating the practice “Put the Client First” IBM 2014 IBM were announced winners of the 2014 Citrix Innovation Award for Partners in the Enterprise category Citrix 2014 This was a massive achievement for IBM and recognized globally. My contribution to this award was the full Citrix XenServer design from scratch with no previous IBM XenServer architecture or design assets whatsoever. IBM Manager’s Choice Award for demonstrating the practice “Listen for Need, Envision the Future” IBM 2015 IBM Client Value Outstanding Technical Achievement Award IBM 2015 IBM Cloud Solution IBM key contributor award – Qantas account IBM 2011 IBM key contributor award – Qantas account IBM 2011 IBM key contributor award – Qantas account IBM 2011 Qantas IT Thank You award Qantas 2012 Qantas IT Thank You award Qantas 2012 Qantas IT Thank You award Qantas 2012 Qantas IT eXcel award Qantas 2012 Qantas IT eXcel award Qantas 2012 Qantas IT eXcel award Qantas 2012 IBM Manager’s Choice Award for demonstrating the practice “Put the Client First” IBM 2014 IBM Manager’s Choice Award for demonstrating the practice “Put the Client First” IBM 2014 IBM Manager’s Choice Award for demonstrating the practice “Put the Client First” IBM 2014 IBM were announced winners of the 2014 Citrix Innovation Award for Partners in the Enterprise category Citrix 2014 This was a massive achievement for IBM and recognized globally. My contribution to this award was the full Citrix XenServer design from scratch with no previous IBM XenServer architecture or design assets whatsoever. IBM were announced winners of the 2014 Citrix Innovation Award for Partners in the Enterprise category Citrix 2014 This was a massive achievement for IBM and recognized globally. My contribution to this award was the full Citrix XenServer design from scratch with no previous IBM XenServer architecture or design assets whatsoever. IBM were announced winners of the 2014 Citrix Innovation Award for Partners in the Enterprise category Citrix 2014 This was a massive achievement for IBM and recognized globally. My contribution to this award was the full Citrix XenServer design from scratch with no previous IBM XenServer architecture or design assets whatsoever. IBM Manager’s Choice Award for demonstrating the practice “Listen for Need, Envision the Future” IBM 2015 IBM Manager’s Choice Award for demonstrating the practice “Listen for Need, Envision the Future” IBM 2015 IBM Manager’s Choice Award for demonstrating the practice “Listen for Need, Envision the Future” IBM 2015 IBM Client Value Outstanding Technical Achievement Award IBM 2015 IBM Cloud Solution IBM Client Value Outstanding Technical Achievement Award IBM 2015 IBM Cloud Solution IBM Client Value Outstanding Technical Achievement Award IBM 2015 IBM Cloud Solution ", "Experience Solution Architect IBM Technical Delivery Manager IBM May 2010  – Present (5 years 4 months) IT Specialist IBM 2005  – Present (10 years) Tester Convergys 1999  –  2005  (6 years) Solution Architect IBM Solution Architect IBM Technical Delivery Manager IBM May 2010  – Present (5 years 4 months) Technical Delivery Manager IBM May 2010  – Present (5 years 4 months) IT Specialist IBM 2005  – Present (10 years) IT Specialist IBM 2005  – Present (10 years) Tester Convergys 1999  –  2005  (6 years) Tester Convergys 1999  –  2005  (6 years) Languages English Native or bilingual proficiency Spanish Professional working proficiency Italian Professional working proficiency English Native or bilingual proficiency Spanish Professional working proficiency Italian Professional working proficiency English Native or bilingual proficiency Spanish Professional working proficiency Italian Professional working proficiency Native or bilingual proficiency Professional working proficiency Professional working proficiency Skills Project Portfolio... SDLC Requirements Gathering Service Delivery Solution Architecture Program Management Requirements Analysis Integration Testing SharePoint Management Software Project... Enterprise Architecture Enterprise Software Leadership PMO Visio Cloud Computing Resource Management Data Center IT Service Management ITIL MS Project Analysis Unix IT Management PMP DB2 Scrum IT Strategy Databases See 16+     See less Skills  Project Portfolio... SDLC Requirements Gathering Service Delivery Solution Architecture Program Management Requirements Analysis Integration Testing SharePoint Management Software Project... Enterprise Architecture Enterprise Software Leadership PMO Visio Cloud Computing Resource Management Data Center IT Service Management ITIL MS Project Analysis Unix IT Management PMP DB2 Scrum IT Strategy Databases See 16+     See less Project Portfolio... SDLC Requirements Gathering Service Delivery Solution Architecture Program Management Requirements Analysis Integration Testing SharePoint Management Software Project... Enterprise Architecture Enterprise Software Leadership PMO Visio Cloud Computing Resource Management Data Center IT Service Management ITIL MS Project Analysis Unix IT Management PMP DB2 Scrum IT Strategy Databases See 16+     See less Project Portfolio... SDLC Requirements Gathering Service Delivery Solution Architecture Program Management Requirements Analysis Integration Testing SharePoint Management Software Project... Enterprise Architecture Enterprise Software Leadership PMO Visio Cloud Computing Resource Management Data Center IT Service Management ITIL MS Project Analysis Unix IT Management PMP DB2 Scrum IT Strategy Databases See 16+     See less Education American Intercontinental Unviversity Master of Information Technology,  Information Technology , 3.9 GPA 2000  – 2001 Florida International University Bachelor of Science (B.S.) 1992  – 1994 Florida International University 1991  – 1994 American Intercontinental Unviversity Master of Information Technology,  Information Technology , 3.9 GPA 2000  – 2001 American Intercontinental Unviversity Master of Information Technology,  Information Technology , 3.9 GPA 2000  – 2001 American Intercontinental Unviversity Master of Information Technology,  Information Technology , 3.9 GPA 2000  – 2001 Florida International University Bachelor of Science (B.S.) 1992  – 1994 Florida International University Bachelor of Science (B.S.) 1992  – 1994 Florida International University Bachelor of Science (B.S.) 1992  – 1994 Florida International University 1991  – 1994 Florida International University 1991  – 1994 Florida International University 1991  – 1994 ", "Experience Technical Delivery Manager IBM Technical Delivery Manager IBM Technical Delivery Manager IBM ", "Skills Messaging z/OS MVS Mainframe SOA Application Development Solution Architecture CICS DB2 WebSphere Message Broker JCL TSO Technical Architecture COBOL REXX Architecture IBM Mainframe ITIL Solution Design Middleware Configuration Management Software Development WebSphere MQ IT Strategy IT Outsourcing Disaster Recovery WebSphere Application... Websphere Incident Management Enterprise Architecture IT Operations IT Service Management High Availability AIX See 19+     See less Skills  Messaging z/OS MVS Mainframe SOA Application Development Solution Architecture CICS DB2 WebSphere Message Broker JCL TSO Technical Architecture COBOL REXX Architecture IBM Mainframe ITIL Solution Design Middleware Configuration Management Software Development WebSphere MQ IT Strategy IT Outsourcing Disaster Recovery WebSphere Application... Websphere Incident Management Enterprise Architecture IT Operations IT Service Management High Availability AIX See 19+     See less Messaging z/OS MVS Mainframe SOA Application Development Solution Architecture CICS DB2 WebSphere Message Broker JCL TSO Technical Architecture COBOL REXX Architecture IBM Mainframe ITIL Solution Design Middleware Configuration Management Software Development WebSphere MQ IT Strategy IT Outsourcing Disaster Recovery WebSphere Application... Websphere Incident Management Enterprise Architecture IT Operations IT Service Management High Availability AIX See 19+     See less Messaging z/OS MVS Mainframe SOA Application Development Solution Architecture CICS DB2 WebSphere Message Broker JCL TSO Technical Architecture COBOL REXX Architecture IBM Mainframe ITIL Solution Design Middleware Configuration Management Software Development WebSphere MQ IT Strategy IT Outsourcing Disaster Recovery WebSphere Application... Websphere Incident Management Enterprise Architecture IT Operations IT Service Management High Availability AIX See 19+     See less ", "Summary I have more than 15 years working IT experience, moving from developer over systems programmer and IT specialist to customer facing enterprise and technical solution architect for a large financial account for several years. I have worked as Team Leader and Technical Delivery Manager for application server middleware teams developing solutions, managing the implementation and the continuous operation. I have led teams of 30+ people, delivering middleware services to most larger domestic accounts. As a team lead, I have led the transition of work to global delivery centers for my teams. \nI am currently Service Delivery Manager, responsible for the daily operation of the customers systems, incident, change, and problem management, coordination of new solutions, cost control and leading multiple, geographical dispersed teams. \nAs a person I am curious, flexible, focused on quality and dedicated to my work. Summary I have more than 15 years working IT experience, moving from developer over systems programmer and IT specialist to customer facing enterprise and technical solution architect for a large financial account for several years. I have worked as Team Leader and Technical Delivery Manager for application server middleware teams developing solutions, managing the implementation and the continuous operation. I have led teams of 30+ people, delivering middleware services to most larger domestic accounts. As a team lead, I have led the transition of work to global delivery centers for my teams. \nI am currently Service Delivery Manager, responsible for the daily operation of the customers systems, incident, change, and problem management, coordination of new solutions, cost control and leading multiple, geographical dispersed teams. \nAs a person I am curious, flexible, focused on quality and dedicated to my work. I have more than 15 years working IT experience, moving from developer over systems programmer and IT specialist to customer facing enterprise and technical solution architect for a large financial account for several years. I have worked as Team Leader and Technical Delivery Manager for application server middleware teams developing solutions, managing the implementation and the continuous operation. I have led teams of 30+ people, delivering middleware services to most larger domestic accounts. As a team lead, I have led the transition of work to global delivery centers for my teams. \nI am currently Service Delivery Manager, responsible for the daily operation of the customers systems, incident, change, and problem management, coordination of new solutions, cost control and leading multiple, geographical dispersed teams. \nAs a person I am curious, flexible, focused on quality and dedicated to my work. I have more than 15 years working IT experience, moving from developer over systems programmer and IT specialist to customer facing enterprise and technical solution architect for a large financial account for several years. I have worked as Team Leader and Technical Delivery Manager for application server middleware teams developing solutions, managing the implementation and the continuous operation. I have led teams of 30+ people, delivering middleware services to most larger domestic accounts. As a team lead, I have led the transition of work to global delivery centers for my teams. \nI am currently Service Delivery Manager, responsible for the daily operation of the customers systems, incident, change, and problem management, coordination of new solutions, cost control and leading multiple, geographical dispersed teams. \nAs a person I am curious, flexible, focused on quality and dedicated to my work. Experience Service Delivery Manager NNIT 2014  – Present (1 year) Service Delivery Manager, Strategic Outsourcing Delivery IBM Danmark ApS April 2012  –  March 2014  (2 years) Århus Area, Denmark Service Delivery Manager for several customers with responsibility for providing services worldwide delivered by local & global teams and 3rd party vendors. The customers’ environments include both Windows, Unix and mainframes. \nResponsibility includes incident & problem handling, project coordination, service level agreement and financial baseline reporting, business compliance, vendor management etc. Team Leader IBM March 2010  –  March 2012  (2 years 1 month) Team leader for three teams, 30+ persons, handling Mainframe & Distributed Middleware implementing and operating WebSphere Application Server( including Process Server, Portal Server), MQ, WBI-FN on windows, unix and zOS IT Architect & Technical Delivery Manager IBM December 2004  –  August 2010  (5 years 9 months) Account architect for a large financial account responsible for the middleware products on multiple platforms but mainly zOS.  \nTechnical solution architect defining solutions cross platforms, driving implementation and ensuring continuous operation of the solutions on both windows, unix and zOS platforms IT Specialist Danske Bank June 1996  –  November 2004  (8 years 6 months) Responsible for the WebSphere Application Server family infrastructure and usage across platforms \nDeveloper in the Forex department Service Delivery Manager NNIT 2014  – Present (1 year) Service Delivery Manager NNIT 2014  – Present (1 year) Service Delivery Manager, Strategic Outsourcing Delivery IBM Danmark ApS April 2012  –  March 2014  (2 years) Århus Area, Denmark Service Delivery Manager for several customers with responsibility for providing services worldwide delivered by local & global teams and 3rd party vendors. The customers’ environments include both Windows, Unix and mainframes. \nResponsibility includes incident & problem handling, project coordination, service level agreement and financial baseline reporting, business compliance, vendor management etc. Service Delivery Manager, Strategic Outsourcing Delivery IBM Danmark ApS April 2012  –  March 2014  (2 years) Århus Area, Denmark Service Delivery Manager for several customers with responsibility for providing services worldwide delivered by local & global teams and 3rd party vendors. The customers’ environments include both Windows, Unix and mainframes. \nResponsibility includes incident & problem handling, project coordination, service level agreement and financial baseline reporting, business compliance, vendor management etc. Team Leader IBM March 2010  –  March 2012  (2 years 1 month) Team leader for three teams, 30+ persons, handling Mainframe & Distributed Middleware implementing and operating WebSphere Application Server( including Process Server, Portal Server), MQ, WBI-FN on windows, unix and zOS Team Leader IBM March 2010  –  March 2012  (2 years 1 month) Team leader for three teams, 30+ persons, handling Mainframe & Distributed Middleware implementing and operating WebSphere Application Server( including Process Server, Portal Server), MQ, WBI-FN on windows, unix and zOS IT Architect & Technical Delivery Manager IBM December 2004  –  August 2010  (5 years 9 months) Account architect for a large financial account responsible for the middleware products on multiple platforms but mainly zOS.  \nTechnical solution architect defining solutions cross platforms, driving implementation and ensuring continuous operation of the solutions on both windows, unix and zOS platforms IT Architect & Technical Delivery Manager IBM December 2004  –  August 2010  (5 years 9 months) Account architect for a large financial account responsible for the middleware products on multiple platforms but mainly zOS.  \nTechnical solution architect defining solutions cross platforms, driving implementation and ensuring continuous operation of the solutions on both windows, unix and zOS platforms IT Specialist Danske Bank June 1996  –  November 2004  (8 years 6 months) Responsible for the WebSphere Application Server family infrastructure and usage across platforms \nDeveloper in the Forex department IT Specialist Danske Bank June 1996  –  November 2004  (8 years 6 months) Responsible for the WebSphere Application Server family infrastructure and usage across platforms \nDeveloper in the Forex department Languages English Native or bilingual proficiency Danish Native or bilingual proficiency Swedish Professional working proficiency English Native or bilingual proficiency Danish Native or bilingual proficiency Swedish Professional working proficiency English Native or bilingual proficiency Danish Native or bilingual proficiency Swedish Professional working proficiency Native or bilingual proficiency Native or bilingual proficiency Professional working proficiency Skills Mainframe Middleware z/OS IBM Mainframe Websphere Solution Architecture ITIL IT Service Management DB2 Enterprise Architecture WebSphere Application... Incident Management Systems Management IT Strategy IT Operations Integration CICS IT Outsourcing WebSphere MQ Service Management Global Delivery Architecture Sla Service Delivery IT Management Technical Architecture Outsourcing Operating Systems Java Enterprise Edition Problem Management Release Management ITIL Certified Service Desk Infrastructure Project Delivery Security High Availability Unix See 23+     See less Skills  Mainframe Middleware z/OS IBM Mainframe Websphere Solution Architecture ITIL IT Service Management DB2 Enterprise Architecture WebSphere Application... Incident Management Systems Management IT Strategy IT Operations Integration CICS IT Outsourcing WebSphere MQ Service Management Global Delivery Architecture Sla Service Delivery IT Management Technical Architecture Outsourcing Operating Systems Java Enterprise Edition Problem Management Release Management ITIL Certified Service Desk Infrastructure Project Delivery Security High Availability Unix See 23+     See less Mainframe Middleware z/OS IBM Mainframe Websphere Solution Architecture ITIL IT Service Management DB2 Enterprise Architecture WebSphere Application... Incident Management Systems Management IT Strategy IT Operations Integration CICS IT Outsourcing WebSphere MQ Service Management Global Delivery Architecture Sla Service Delivery IT Management Technical Architecture Outsourcing Operating Systems Java Enterprise Edition Problem Management Release Management ITIL Certified Service Desk Infrastructure Project Delivery Security High Availability Unix See 23+     See less Mainframe Middleware z/OS IBM Mainframe Websphere Solution Architecture ITIL IT Service Management DB2 Enterprise Architecture WebSphere Application... Incident Management Systems Management IT Strategy IT Operations Integration CICS IT Outsourcing WebSphere MQ Service Management Global Delivery Architecture Sla Service Delivery IT Management Technical Architecture Outsourcing Operating Systems Java Enterprise Edition Problem Management Release Management ITIL Certified Service Desk Infrastructure Project Delivery Security High Availability Unix See 23+     See less Education Aalborg Universitet Master of Science,  Electrical Engineering 1991  – 1996 Aalborg Universitet Master of Science,  Electrical Engineering 1991  – 1996 Aalborg Universitet Master of Science,  Electrical Engineering 1991  – 1996 Aalborg Universitet Master of Science,  Electrical Engineering 1991  – 1996 ", "Summary •\tMore than 12 years of professional experience in IT industry, currently managing a technical team of 30 as Technical Delivery Manager  \n•\tExperience in multiple leadership roles as Project Lead and Remote Development Center Lead, managing technical teams for last 8 years.  \n•\tWell experienced in partnering and engaging client leadership teams in project strategy and execution. \n•\tProficiency in all aspects of project management including Client interaction, Requirement collection, Scheduling, Estimating, Tracking deliverables, Staffing, Configuration management , Risk Management and Architectural decision making.  \n•\tExtensive knowledge in project management process groups such as initiating, planning, executing, monitoring and controlling, and closing. \n•\tExecuted Software projects for Healthcare, Healthcare Insurance, Mobility and Telecom domain, experienced in international projects and onsite site assignments.  \n•\tExpertise in analysis, design, development, customization and implementation of Java, J2EE and Oracle based software applications. \n•\tPossess excellent logical analysis and problem solving skills, interpersonal skills. Quick learner and team player. Summary •\tMore than 12 years of professional experience in IT industry, currently managing a technical team of 30 as Technical Delivery Manager  \n•\tExperience in multiple leadership roles as Project Lead and Remote Development Center Lead, managing technical teams for last 8 years.  \n•\tWell experienced in partnering and engaging client leadership teams in project strategy and execution. \n•\tProficiency in all aspects of project management including Client interaction, Requirement collection, Scheduling, Estimating, Tracking deliverables, Staffing, Configuration management , Risk Management and Architectural decision making.  \n•\tExtensive knowledge in project management process groups such as initiating, planning, executing, monitoring and controlling, and closing. \n•\tExecuted Software projects for Healthcare, Healthcare Insurance, Mobility and Telecom domain, experienced in international projects and onsite site assignments.  \n•\tExpertise in analysis, design, development, customization and implementation of Java, J2EE and Oracle based software applications. \n•\tPossess excellent logical analysis and problem solving skills, interpersonal skills. Quick learner and team player. •\tMore than 12 years of professional experience in IT industry, currently managing a technical team of 30 as Technical Delivery Manager  \n•\tExperience in multiple leadership roles as Project Lead and Remote Development Center Lead, managing technical teams for last 8 years.  \n•\tWell experienced in partnering and engaging client leadership teams in project strategy and execution. \n•\tProficiency in all aspects of project management including Client interaction, Requirement collection, Scheduling, Estimating, Tracking deliverables, Staffing, Configuration management , Risk Management and Architectural decision making.  \n•\tExtensive knowledge in project management process groups such as initiating, planning, executing, monitoring and controlling, and closing. \n•\tExecuted Software projects for Healthcare, Healthcare Insurance, Mobility and Telecom domain, experienced in international projects and onsite site assignments.  \n•\tExpertise in analysis, design, development, customization and implementation of Java, J2EE and Oracle based software applications. \n•\tPossess excellent logical analysis and problem solving skills, interpersonal skills. Quick learner and team player. •\tMore than 12 years of professional experience in IT industry, currently managing a technical team of 30 as Technical Delivery Manager  \n•\tExperience in multiple leadership roles as Project Lead and Remote Development Center Lead, managing technical teams for last 8 years.  \n•\tWell experienced in partnering and engaging client leadership teams in project strategy and execution. \n•\tProficiency in all aspects of project management including Client interaction, Requirement collection, Scheduling, Estimating, Tracking deliverables, Staffing, Configuration management , Risk Management and Architectural decision making.  \n•\tExtensive knowledge in project management process groups such as initiating, planning, executing, monitoring and controlling, and closing. \n•\tExecuted Software projects for Healthcare, Healthcare Insurance, Mobility and Telecom domain, experienced in international projects and onsite site assignments.  \n•\tExpertise in analysis, design, development, customization and implementation of Java, J2EE and Oracle based software applications. \n•\tPossess excellent logical analysis and problem solving skills, interpersonal skills. Quick learner and team player. Experience Technical Delivery Manager IBM India Private Limited November 2009  – Present (5 years 10 months) Bangalore Delivery Manager & People manager for Mobility cluster of telecom applications for one of the world's largest telecom service providers based at the US. Managing seven applications in client's Service Assurance and Service Delivery Domains. Was instrumental in the successful transition of the mobility applications from the existing vendors of the client to IBM. Project Lead IBM India Private Limited November 2005  –  October 2009  (4 years) Banagalore Lead different projects with multiple clients in telecom domain (Service Delivery and Service Assurance) Senior Developer IBM India Private Ltd August 2004  –  October 2005  (1 year 3 months) Bangalore Developer HCL Perot Systems September 2000  –  July 2004  (3 years 11 months) Bangalore Technical Delivery Manager IBM India Private Limited November 2009  – Present (5 years 10 months) Bangalore Delivery Manager & People manager for Mobility cluster of telecom applications for one of the world's largest telecom service providers based at the US. Managing seven applications in client's Service Assurance and Service Delivery Domains. Was instrumental in the successful transition of the mobility applications from the existing vendors of the client to IBM. Technical Delivery Manager IBM India Private Limited November 2009  – Present (5 years 10 months) Bangalore Delivery Manager & People manager for Mobility cluster of telecom applications for one of the world's largest telecom service providers based at the US. Managing seven applications in client's Service Assurance and Service Delivery Domains. Was instrumental in the successful transition of the mobility applications from the existing vendors of the client to IBM. Project Lead IBM India Private Limited November 2005  –  October 2009  (4 years) Banagalore Lead different projects with multiple clients in telecom domain (Service Delivery and Service Assurance) Project Lead IBM India Private Limited November 2005  –  October 2009  (4 years) Banagalore Lead different projects with multiple clients in telecom domain (Service Delivery and Service Assurance) Senior Developer IBM India Private Ltd August 2004  –  October 2005  (1 year 3 months) Bangalore Senior Developer IBM India Private Ltd August 2004  –  October 2005  (1 year 3 months) Bangalore Developer HCL Perot Systems September 2000  –  July 2004  (3 years 11 months) Bangalore Developer HCL Perot Systems September 2000  –  July 2004  (3 years 11 months) Bangalore Skills Project Management Technical Project... Team Leadership Skills  Project Management Technical Project... Team Leadership Project Management Technical Project... Team Leadership Project Management Technical Project... Team Leadership Education University of Madras MCA 1996  – 1999 University of Madras MCA 1996  – 1999 University of Madras MCA 1996  – 1999 University of Madras MCA 1996  – 1999 "]}