{"position": "Technologist", "company": "Intel Corporation", "profiles": ["Skills Embedded Systems Integration IPTV Firmware SoC Pre-sales Product Management Embedded Software System Architecture Debugging TCP/IP Linux Device Drivers C# Software Engineering RTOS Testing Software Development Wireless Multithreading Software Design See 6+     See less Skills  Embedded Systems Integration IPTV Firmware SoC Pre-sales Product Management Embedded Software System Architecture Debugging TCP/IP Linux Device Drivers C# Software Engineering RTOS Testing Software Development Wireless Multithreading Software Design See 6+     See less Embedded Systems Integration IPTV Firmware SoC Pre-sales Product Management Embedded Software System Architecture Debugging TCP/IP Linux Device Drivers C# Software Engineering RTOS Testing Software Development Wireless Multithreading Software Design See 6+     See less Embedded Systems Integration IPTV Firmware SoC Pre-sales Product Management Embedded Software System Architecture Debugging TCP/IP Linux Device Drivers C# Software Engineering RTOS Testing Software Development Wireless Multithreading Software Design See 6+     See less ", "Experience Strategy Program Manager and Intel Technologist Intel Corporation October 2010  – Present (4 years 11 months) Manage external engagements and supply chain benchmarking program for Intel's Customer Fulfillment, Planning, and Logistics (CPLG) division. Develops strategic supply chain and benchmarking roadmaps. Lecturer in Supply Chain Management Stanford University March 2001  – Present (14 years 6 months) Stanford, CA Guest lecturer in graduate level courses in Supply Chain Management. Co-taught Production and Operations Management course. Strategy Program Manager and Intel Technologist Intel Corporation October 2010  – Present (4 years 11 months) Manage external engagements and supply chain benchmarking program for Intel's Customer Fulfillment, Planning, and Logistics (CPLG) division. Develops strategic supply chain and benchmarking roadmaps. Strategy Program Manager and Intel Technologist Intel Corporation October 2010  – Present (4 years 11 months) Manage external engagements and supply chain benchmarking program for Intel's Customer Fulfillment, Planning, and Logistics (CPLG) division. Develops strategic supply chain and benchmarking roadmaps. Lecturer in Supply Chain Management Stanford University March 2001  – Present (14 years 6 months) Stanford, CA Guest lecturer in graduate level courses in Supply Chain Management. Co-taught Production and Operations Management course. Lecturer in Supply Chain Management Stanford University March 2001  – Present (14 years 6 months) Stanford, CA Guest lecturer in graduate level courses in Supply Chain Management. Co-taught Production and Operations Management course. Skills Skills     Education Stanford University PhD 1999  – 2004 Stanford University MS 1999  – 2000 Arizona State University BSE North Carolina State University MIE Stanford University PhD 1999  – 2004 Stanford University PhD 1999  – 2004 Stanford University PhD 1999  – 2004 Stanford University MS 1999  – 2000 Stanford University MS 1999  – 2000 Stanford University MS 1999  – 2000 Arizona State University BSE Arizona State University BSE Arizona State University BSE North Carolina State University MIE North Carolina State University MIE North Carolina State University MIE ", "Skills Processors Strategy PCIe Power Management Low-power Design Product Marketing Mobile Devices Start-ups Silicon Cadence SoC Integration ASIC Semiconductors IC Intel Logic Synthesis Verilog EDA Computer Architecture Display Technology See 6+     See less Skills  Processors Strategy PCIe Power Management Low-power Design Product Marketing Mobile Devices Start-ups Silicon Cadence SoC Integration ASIC Semiconductors IC Intel Logic Synthesis Verilog EDA Computer Architecture Display Technology See 6+     See less Processors Strategy PCIe Power Management Low-power Design Product Marketing Mobile Devices Start-ups Silicon Cadence SoC Integration ASIC Semiconductors IC Intel Logic Synthesis Verilog EDA Computer Architecture Display Technology See 6+     See less Processors Strategy PCIe Power Management Low-power Design Product Marketing Mobile Devices Start-ups Silicon Cadence SoC Integration ASIC Semiconductors IC Intel Logic Synthesis Verilog EDA Computer Architecture Display Technology See 6+     See less ", "Experience Supply Chain Software Technologist Intel Corporation March 2005  – Present (10 years 6 months) Chandler, AZ Software Test Engineer The Boeing Company March 2003  –  March 2005  (2 years 1 month) Founder / Manager Tetra Systems January 2002  –  December 2004  (3 years) Software Engineering Manager SpeedFam-IPEC (now Novellus) September 1997  –  November 2001  (4 years 3 months) Electronics Engineer US Air Force August 1993  –  September 1997  (4 years 2 months) Supply Chain Software Technologist Intel Corporation March 2005  – Present (10 years 6 months) Chandler, AZ Supply Chain Software Technologist Intel Corporation March 2005  – Present (10 years 6 months) Chandler, AZ Software Test Engineer The Boeing Company March 2003  –  March 2005  (2 years 1 month) Software Test Engineer The Boeing Company March 2003  –  March 2005  (2 years 1 month) Founder / Manager Tetra Systems January 2002  –  December 2004  (3 years) Founder / Manager Tetra Systems January 2002  –  December 2004  (3 years) Software Engineering Manager SpeedFam-IPEC (now Novellus) September 1997  –  November 2001  (4 years 3 months) Software Engineering Manager SpeedFam-IPEC (now Novellus) September 1997  –  November 2001  (4 years 3 months) Electronics Engineer US Air Force August 1993  –  September 1997  (4 years 2 months) Electronics Engineer US Air Force August 1993  –  September 1997  (4 years 2 months) Skills Process Development Testing Automation Skills  Process Development Testing Automation Process Development Testing Automation Process Development Testing Automation Education The University of New Mexico Master of Science 1994  – 1995 Texas A&M University 1992  – 1993 Arizona State University Bachelor of Science in Engineering 1987  – 1992 The University of New Mexico Master of Science 1994  – 1995 The University of New Mexico Master of Science 1994  – 1995 The University of New Mexico Master of Science 1994  – 1995 Texas A&M University 1992  – 1993 Texas A&M University 1992  – 1993 Texas A&M University 1992  – 1993 Arizona State University Bachelor of Science in Engineering 1987  – 1992 Arizona State University Bachelor of Science in Engineering 1987  – 1992 Arizona State University Bachelor of Science in Engineering 1987  – 1992 ", "Experience System Technologist Intel Corporation September 2005  – Present (10 years) I'm currently working on Hardware/Software Enablement for Cloud Datacenters. Software Engineer/Architect RLX Technologies 2001  –  2005  (4 years) CTO Trip.net 1998  –  2001  (3 years) President InterGate 1994  –  1998  (4 years) Founder of InterGate full service Internet provider.  \nStarted with the following: \n* $10,000 in the bank \n* A single Linux server (Slackware with 0.84 kernel) \n* 14.4kbps modems \n* my first customers were using Windows 3.1 and Trumpet software \n* Netscape 0.5 browser (Internet Explorer didn't even exist) \n \nEventually sold to Trip.net and grew network to multiple T3's, OC-3s, and added DSL/Frame and ATM services. Software Engineer MW Kellogg June 1993  –  July 1994  (1 year 2 months) Software Engineer Software Engineer Shell Oil Company June 1991  –  June 1993  (2 years 1 month) Software Engineer for Supply and Trading Division. Designed and Coded Spot Hydrocarbon Evaluation Reporting system System Technologist Intel Corporation September 2005  – Present (10 years) I'm currently working on Hardware/Software Enablement for Cloud Datacenters. System Technologist Intel Corporation September 2005  – Present (10 years) I'm currently working on Hardware/Software Enablement for Cloud Datacenters. Software Engineer/Architect RLX Technologies 2001  –  2005  (4 years) Software Engineer/Architect RLX Technologies 2001  –  2005  (4 years) CTO Trip.net 1998  –  2001  (3 years) CTO Trip.net 1998  –  2001  (3 years) President InterGate 1994  –  1998  (4 years) Founder of InterGate full service Internet provider.  \nStarted with the following: \n* $10,000 in the bank \n* A single Linux server (Slackware with 0.84 kernel) \n* 14.4kbps modems \n* my first customers were using Windows 3.1 and Trumpet software \n* Netscape 0.5 browser (Internet Explorer didn't even exist) \n \nEventually sold to Trip.net and grew network to multiple T3's, OC-3s, and added DSL/Frame and ATM services. President InterGate 1994  –  1998  (4 years) Founder of InterGate full service Internet provider.  \nStarted with the following: \n* $10,000 in the bank \n* A single Linux server (Slackware with 0.84 kernel) \n* 14.4kbps modems \n* my first customers were using Windows 3.1 and Trumpet software \n* Netscape 0.5 browser (Internet Explorer didn't even exist) \n \nEventually sold to Trip.net and grew network to multiple T3's, OC-3s, and added DSL/Frame and ATM services. Software Engineer MW Kellogg June 1993  –  July 1994  (1 year 2 months) Software Engineer Software Engineer MW Kellogg June 1993  –  July 1994  (1 year 2 months) Software Engineer Software Engineer Shell Oil Company June 1991  –  June 1993  (2 years 1 month) Software Engineer for Supply and Trading Division. Designed and Coded Spot Hydrocarbon Evaluation Reporting system Software Engineer Shell Oil Company June 1991  –  June 1993  (2 years 1 month) Software Engineer for Supply and Trading Division. Designed and Coded Spot Hydrocarbon Evaluation Reporting system Skills Embedded Systems Linux Kernel Software Development Perl Troubleshooting Linux Debugging Networking Architectures System Architecture Software Design Cloud Computing Skills  Embedded Systems Linux Kernel Software Development Perl Troubleshooting Linux Debugging Networking Architectures System Architecture Software Design Cloud Computing Embedded Systems Linux Kernel Software Development Perl Troubleshooting Linux Debugging Networking Architectures System Architecture Software Design Cloud Computing Embedded Systems Linux Kernel Software Development Perl Troubleshooting Linux Debugging Networking Architectures System Architecture Software Design Cloud Computing Education University of Houston-Downtown Computer Science 1990  – 2001 University of Houston-Downtown Computer Science 1990  – 2001 University of Houston-Downtown Computer Science 1990  – 2001 University of Houston-Downtown Computer Science 1990  – 2001 ", "Skills Virtualization Linux VMware VDI Cloud Computing Security Windows Networking Product Management Storage HTML Team Leadership XML Skills  Virtualization Linux VMware VDI Cloud Computing Security Windows Networking Product Management Storage HTML Team Leadership XML Virtualization Linux VMware VDI Cloud Computing Security Windows Networking Product Management Storage HTML Team Leadership XML Virtualization Linux VMware VDI Cloud Computing Security Windows Networking Product Management Storage HTML Team Leadership XML Honors & Awards ", "Summary •\tA Six Sigma Black Belt certified candidate with more than 7 year experience in data mining, applied statistics, building predictive and machine learning models, project management, industrial engineering and Lean manufacturing \n•\tAn excellent team player with strong people management, presentation and communication skills \n•\tDiverse and practiced software skills: \no\tStatistics: JMP, Tableau, R, MATLAB, SAS, Tableau \no\tProgramming languages: VB, JSL (JMP scripting language), SQL, Python Summary •\tA Six Sigma Black Belt certified candidate with more than 7 year experience in data mining, applied statistics, building predictive and machine learning models, project management, industrial engineering and Lean manufacturing \n•\tAn excellent team player with strong people management, presentation and communication skills \n•\tDiverse and practiced software skills: \no\tStatistics: JMP, Tableau, R, MATLAB, SAS, Tableau \no\tProgramming languages: VB, JSL (JMP scripting language), SQL, Python •\tA Six Sigma Black Belt certified candidate with more than 7 year experience in data mining, applied statistics, building predictive and machine learning models, project management, industrial engineering and Lean manufacturing \n•\tAn excellent team player with strong people management, presentation and communication skills \n•\tDiverse and practiced software skills: \no\tStatistics: JMP, Tableau, R, MATLAB, SAS, Tableau \no\tProgramming languages: VB, JSL (JMP scripting language), SQL, Python •\tA Six Sigma Black Belt certified candidate with more than 7 year experience in data mining, applied statistics, building predictive and machine learning models, project management, industrial engineering and Lean manufacturing \n•\tAn excellent team player with strong people management, presentation and communication skills \n•\tDiverse and practiced software skills: \no\tStatistics: JMP, Tableau, R, MATLAB, SAS, Tableau \no\tProgramming languages: VB, JSL (JMP scripting language), SQL, Python Experience Supply Chain Technologist Intel Corporation April 2013  – Present (2 years 5 months) chandler, Arizona This role works as an internal analytics consultant. It involves building machine learning and operations research models to solve key issues facing Intel and the role has enabled me to build excellent project management skills. Here’s a summary of few projects: \n \n•\tCollaborating with analytics lead to build inventory control towers– a system that provides status of finished goods at various stages of the supply chain, compares statuses with planned inventory and builds 5 successive random forests using R randomForest package to highlight stages where finished goods are less than planned inventory.  \no\tReturn on Investment (ROI): The project provides a great tool to recognize problem areas and it will be used by management and factory managers on a daily basis. \n \n•\tManaged a project that involved building a supply chain network to reduce Carbon Dioxide footprint. The team had 2 analysts and it involved building the transportation network using SQL server management studio, cleaning the network using Python Digraph library and then optimizing network using IBM ILOG CPLEX studio.  \nThe final network analyzed 4 key products and consisted of ~1 million decision variable, >3 million constraints and it was an integer linear programming problem.  \no\tROI: >1 million USD.  \n \n•\tPartnering with marketing department to analyze a monthly survey that Intel conducts in US and China to understand PC and tablet buying behavior.  \nConstructed market basket/association rules using R arules package to understand which consumer characteristics’ trigger a purchase \nBuilt decision trees and a random forest to forecast a buying behavior. \n \n•\tBuilt a Neural Network and a Logistic Regression model for Chandler factory to predict product yield during the end stages of manufacturing. The goal was to facilitate better capacity planning and material utilization. R caret package was used to build models and Tableau was used to present the data. \no\tROI: 100,000 USD/quarter Senior Industrial Engineer Intel Corporation August 2010  –  April 2013  (2 years 9 months) Chandler, Arizona •\tLed a team of seven Industrial engineers from Intel’s local and foreign sites. The team analyzed manufacturing data and then developed reports to measures performance of metrology tools. Reports were developed using Structured Query Language (SQL), Excel macro and JSL and by performing statistical analysis of outliers’ distribution - data was analyzed for underlying distribution and outliers were removed using non-parametric extremity. \n \nReturn on Investment (ROI): 60000 USD/year and problem recognition and root cause analysis time has been reduced from 3 days to 1.5 days \n \n•\tRepresented IE department in a cross-departmental team which was working towards product development - defining, and developing manufacturing capability for two new microprocessors and then transferring manufacturing capability to mass production factories at worldwide locations.  \n \nThese microprocessors represented almost 40% of Intel’s manufacturing volume in 2013 and 2014 and IE presentation was required to assess decisions and to keep manufacturing cost in control Manufacturing Engineer Intel Corporation June 2007  –  August 2010  (3 years 3 months) Chandler, Arizona •\tPartnered with manufacturing and designed 3 process flows to incorporate a new manufacturing step, analyzed queue times and process times and then simulated those flows using simulation language SLAM II and advised the best flow for the final implementation \nROI: 85000 USD/year \n \n•\tAnalyzed 6 months work in progress (WIP) history of test operations, performed statistical analysis to predict conditional probability of a lot having particular characteristics and then formed and guided a team to finish a white paper to eliminate non value added testing. \nROI: 120000 USD/year and throughput time has been reduced by 20%. \n \n•\tDesigned, Developed and Supported MS Excel macro - “TAT(Tester Association Tool)”. Purpose of TAT was to assign a lot to a tool, where that lot could be processed and to give high level picture of work in progress (WIP).  \nROI: 8% of supervisors’ time/day Supply Chain Intern Motorola Solutions May 2006  –  August 2006  (4 months) Chicago, USA •\tAnalyzed and compared delivery performance to two regions from a distribution center. \n•\tRegression analysis of CRSD(customer requested ship date)-book date as a predictor of CRSD-ship date Manufacturing Manager Tata Motors July 2004  –  July 2005  (1 year 1 month) Pune, India Responsibilities:  \n \nFollow the rotation training program across the various divisions of the company  \n \nPartner with manufacturing to re-engineer processes  \n \nManage long term facility and building projects  \n \n \nAchievements: \n \nCollaborated with the corporate finance department and vendors to implement an improved logistics system which reduced material movement and manual labor by around 20% . \n \nProposed a new eco-friendly design for material storage and partnered with the welding department to implemented this design, which helped company to achieve an environmental certification and saves 100000 INR every year. \n \nConducted factory inspection study to ensure compliance with India’s safety standards. Supply Chain Technologist Intel Corporation April 2013  – Present (2 years 5 months) chandler, Arizona This role works as an internal analytics consultant. It involves building machine learning and operations research models to solve key issues facing Intel and the role has enabled me to build excellent project management skills. Here’s a summary of few projects: \n \n•\tCollaborating with analytics lead to build inventory control towers– a system that provides status of finished goods at various stages of the supply chain, compares statuses with planned inventory and builds 5 successive random forests using R randomForest package to highlight stages where finished goods are less than planned inventory.  \no\tReturn on Investment (ROI): The project provides a great tool to recognize problem areas and it will be used by management and factory managers on a daily basis. \n \n•\tManaged a project that involved building a supply chain network to reduce Carbon Dioxide footprint. The team had 2 analysts and it involved building the transportation network using SQL server management studio, cleaning the network using Python Digraph library and then optimizing network using IBM ILOG CPLEX studio.  \nThe final network analyzed 4 key products and consisted of ~1 million decision variable, >3 million constraints and it was an integer linear programming problem.  \no\tROI: >1 million USD.  \n \n•\tPartnering with marketing department to analyze a monthly survey that Intel conducts in US and China to understand PC and tablet buying behavior.  \nConstructed market basket/association rules using R arules package to understand which consumer characteristics’ trigger a purchase \nBuilt decision trees and a random forest to forecast a buying behavior. \n \n•\tBuilt a Neural Network and a Logistic Regression model for Chandler factory to predict product yield during the end stages of manufacturing. The goal was to facilitate better capacity planning and material utilization. R caret package was used to build models and Tableau was used to present the data. \no\tROI: 100,000 USD/quarter Supply Chain Technologist Intel Corporation April 2013  – Present (2 years 5 months) chandler, Arizona This role works as an internal analytics consultant. It involves building machine learning and operations research models to solve key issues facing Intel and the role has enabled me to build excellent project management skills. Here’s a summary of few projects: \n \n•\tCollaborating with analytics lead to build inventory control towers– a system that provides status of finished goods at various stages of the supply chain, compares statuses with planned inventory and builds 5 successive random forests using R randomForest package to highlight stages where finished goods are less than planned inventory.  \no\tReturn on Investment (ROI): The project provides a great tool to recognize problem areas and it will be used by management and factory managers on a daily basis. \n \n•\tManaged a project that involved building a supply chain network to reduce Carbon Dioxide footprint. The team had 2 analysts and it involved building the transportation network using SQL server management studio, cleaning the network using Python Digraph library and then optimizing network using IBM ILOG CPLEX studio.  \nThe final network analyzed 4 key products and consisted of ~1 million decision variable, >3 million constraints and it was an integer linear programming problem.  \no\tROI: >1 million USD.  \n \n•\tPartnering with marketing department to analyze a monthly survey that Intel conducts in US and China to understand PC and tablet buying behavior.  \nConstructed market basket/association rules using R arules package to understand which consumer characteristics’ trigger a purchase \nBuilt decision trees and a random forest to forecast a buying behavior. \n \n•\tBuilt a Neural Network and a Logistic Regression model for Chandler factory to predict product yield during the end stages of manufacturing. The goal was to facilitate better capacity planning and material utilization. R caret package was used to build models and Tableau was used to present the data. \no\tROI: 100,000 USD/quarter Senior Industrial Engineer Intel Corporation August 2010  –  April 2013  (2 years 9 months) Chandler, Arizona •\tLed a team of seven Industrial engineers from Intel’s local and foreign sites. The team analyzed manufacturing data and then developed reports to measures performance of metrology tools. Reports were developed using Structured Query Language (SQL), Excel macro and JSL and by performing statistical analysis of outliers’ distribution - data was analyzed for underlying distribution and outliers were removed using non-parametric extremity. \n \nReturn on Investment (ROI): 60000 USD/year and problem recognition and root cause analysis time has been reduced from 3 days to 1.5 days \n \n•\tRepresented IE department in a cross-departmental team which was working towards product development - defining, and developing manufacturing capability for two new microprocessors and then transferring manufacturing capability to mass production factories at worldwide locations.  \n \nThese microprocessors represented almost 40% of Intel’s manufacturing volume in 2013 and 2014 and IE presentation was required to assess decisions and to keep manufacturing cost in control Senior Industrial Engineer Intel Corporation August 2010  –  April 2013  (2 years 9 months) Chandler, Arizona •\tLed a team of seven Industrial engineers from Intel’s local and foreign sites. The team analyzed manufacturing data and then developed reports to measures performance of metrology tools. Reports were developed using Structured Query Language (SQL), Excel macro and JSL and by performing statistical analysis of outliers’ distribution - data was analyzed for underlying distribution and outliers were removed using non-parametric extremity. \n \nReturn on Investment (ROI): 60000 USD/year and problem recognition and root cause analysis time has been reduced from 3 days to 1.5 days \n \n•\tRepresented IE department in a cross-departmental team which was working towards product development - defining, and developing manufacturing capability for two new microprocessors and then transferring manufacturing capability to mass production factories at worldwide locations.  \n \nThese microprocessors represented almost 40% of Intel’s manufacturing volume in 2013 and 2014 and IE presentation was required to assess decisions and to keep manufacturing cost in control Manufacturing Engineer Intel Corporation June 2007  –  August 2010  (3 years 3 months) Chandler, Arizona •\tPartnered with manufacturing and designed 3 process flows to incorporate a new manufacturing step, analyzed queue times and process times and then simulated those flows using simulation language SLAM II and advised the best flow for the final implementation \nROI: 85000 USD/year \n \n•\tAnalyzed 6 months work in progress (WIP) history of test operations, performed statistical analysis to predict conditional probability of a lot having particular characteristics and then formed and guided a team to finish a white paper to eliminate non value added testing. \nROI: 120000 USD/year and throughput time has been reduced by 20%. \n \n•\tDesigned, Developed and Supported MS Excel macro - “TAT(Tester Association Tool)”. Purpose of TAT was to assign a lot to a tool, where that lot could be processed and to give high level picture of work in progress (WIP).  \nROI: 8% of supervisors’ time/day Manufacturing Engineer Intel Corporation June 2007  –  August 2010  (3 years 3 months) Chandler, Arizona •\tPartnered with manufacturing and designed 3 process flows to incorporate a new manufacturing step, analyzed queue times and process times and then simulated those flows using simulation language SLAM II and advised the best flow for the final implementation \nROI: 85000 USD/year \n \n•\tAnalyzed 6 months work in progress (WIP) history of test operations, performed statistical analysis to predict conditional probability of a lot having particular characteristics and then formed and guided a team to finish a white paper to eliminate non value added testing. \nROI: 120000 USD/year and throughput time has been reduced by 20%. \n \n•\tDesigned, Developed and Supported MS Excel macro - “TAT(Tester Association Tool)”. Purpose of TAT was to assign a lot to a tool, where that lot could be processed and to give high level picture of work in progress (WIP).  \nROI: 8% of supervisors’ time/day Supply Chain Intern Motorola Solutions May 2006  –  August 2006  (4 months) Chicago, USA •\tAnalyzed and compared delivery performance to two regions from a distribution center. \n•\tRegression analysis of CRSD(customer requested ship date)-book date as a predictor of CRSD-ship date Supply Chain Intern Motorola Solutions May 2006  –  August 2006  (4 months) Chicago, USA •\tAnalyzed and compared delivery performance to two regions from a distribution center. \n•\tRegression analysis of CRSD(customer requested ship date)-book date as a predictor of CRSD-ship date Manufacturing Manager Tata Motors July 2004  –  July 2005  (1 year 1 month) Pune, India Responsibilities:  \n \nFollow the rotation training program across the various divisions of the company  \n \nPartner with manufacturing to re-engineer processes  \n \nManage long term facility and building projects  \n \n \nAchievements: \n \nCollaborated with the corporate finance department and vendors to implement an improved logistics system which reduced material movement and manual labor by around 20% . \n \nProposed a new eco-friendly design for material storage and partnered with the welding department to implemented this design, which helped company to achieve an environmental certification and saves 100000 INR every year. \n \nConducted factory inspection study to ensure compliance with India’s safety standards. Manufacturing Manager Tata Motors July 2004  –  July 2005  (1 year 1 month) Pune, India Responsibilities:  \n \nFollow the rotation training program across the various divisions of the company  \n \nPartner with manufacturing to re-engineer processes  \n \nManage long term facility and building projects  \n \n \nAchievements: \n \nCollaborated with the corporate finance department and vendors to implement an improved logistics system which reduced material movement and manual labor by around 20% . \n \nProposed a new eco-friendly design for material storage and partnered with the welding department to implemented this design, which helped company to achieve an environmental certification and saves 100000 INR every year. \n \nConducted factory inspection study to ensure compliance with India’s safety standards. Skills Six Sigma Statistics JMP MS Office Suite VBA SQL Testing Lean Manufacturing Skills  Six Sigma Statistics JMP MS Office Suite VBA SQL Testing Lean Manufacturing Six Sigma Statistics JMP MS Office Suite VBA SQL Testing Lean Manufacturing Six Sigma Statistics JMP MS Office Suite VBA SQL Testing Lean Manufacturing Education Arizona State University Masters,  Industrial Engineering (Applied Statistics) , 3.9 2005  – 2007 Received Departmental Academic Commendation for Fall 05, Spring 06 and Fall 06 \n \n \nCOURSEWORK \n \n•\tStatistical learning for Data mining \n•\tDesign and Analysis of Experiments \n•\tCategorical data analysis \n•\tMultivariate data analysis \n•\tRegression Analysis \n•\tObject Oriented Information systems University of Pune Bachelor of Engineering (B.E.),  PRODUCTION ENGINEERING 2001  – 2004 Arizona State University Masters,  Industrial Engineering (Applied Statistics) , 3.9 2005  – 2007 Received Departmental Academic Commendation for Fall 05, Spring 06 and Fall 06 \n \n \nCOURSEWORK \n \n•\tStatistical learning for Data mining \n•\tDesign and Analysis of Experiments \n•\tCategorical data analysis \n•\tMultivariate data analysis \n•\tRegression Analysis \n•\tObject Oriented Information systems Arizona State University Masters,  Industrial Engineering (Applied Statistics) , 3.9 2005  – 2007 Received Departmental Academic Commendation for Fall 05, Spring 06 and Fall 06 \n \n \nCOURSEWORK \n \n•\tStatistical learning for Data mining \n•\tDesign and Analysis of Experiments \n•\tCategorical data analysis \n•\tMultivariate data analysis \n•\tRegression Analysis \n•\tObject Oriented Information systems Arizona State University Masters,  Industrial Engineering (Applied Statistics) , 3.9 2005  – 2007 Received Departmental Academic Commendation for Fall 05, Spring 06 and Fall 06 \n \n \nCOURSEWORK \n \n•\tStatistical learning for Data mining \n•\tDesign and Analysis of Experiments \n•\tCategorical data analysis \n•\tMultivariate data analysis \n•\tRegression Analysis \n•\tObject Oriented Information systems University of Pune Bachelor of Engineering (B.E.),  PRODUCTION ENGINEERING 2001  – 2004 University of Pune Bachelor of Engineering (B.E.),  PRODUCTION ENGINEERING 2001  – 2004 University of Pune Bachelor of Engineering (B.E.),  PRODUCTION ENGINEERING 2001  – 2004 ", "Languages English Native or bilingual proficiency Mandarin Native or bilingual proficiency Spanish Professional working proficiency English Native or bilingual proficiency Mandarin Native or bilingual proficiency Spanish Professional working proficiency English Native or bilingual proficiency Mandarin Native or bilingual proficiency Spanish Professional working proficiency Native or bilingual proficiency Native or bilingual proficiency Professional working proficiency Skills Semiconductors Design of Experiments JMP Finite Element Analysis Analog Circuit Design Solidworks Monte Carlo Simulation Mechanical Product... Thermal Analysis Tolerance Analysis ANSYS CFD Electronics Cooling Shock & Vibration... ProE ABAQUS Fluent See 2+     See less Skills  Semiconductors Design of Experiments JMP Finite Element Analysis Analog Circuit Design Solidworks Monte Carlo Simulation Mechanical Product... Thermal Analysis Tolerance Analysis ANSYS CFD Electronics Cooling Shock & Vibration... ProE ABAQUS Fluent See 2+     See less Semiconductors Design of Experiments JMP Finite Element Analysis Analog Circuit Design Solidworks Monte Carlo Simulation Mechanical Product... Thermal Analysis Tolerance Analysis ANSYS CFD Electronics Cooling Shock & Vibration... ProE ABAQUS Fluent See 2+     See less Semiconductors Design of Experiments JMP Finite Element Analysis Analog Circuit Design Solidworks Monte Carlo Simulation Mechanical Product... Thermal Analysis Tolerance Analysis ANSYS CFD Electronics Cooling Shock & Vibration... ProE ABAQUS Fluent See 2+     See less ", "Skills Enterprise Software Architecture Business Intelligence Security Strategy Intel Business Process Software Development Integration Semiconductors Agile Methodologies Embedded Systems Linux Cloud Computing Program Management Skills  Enterprise Software Architecture Business Intelligence Security Strategy Intel Business Process Software Development Integration Semiconductors Agile Methodologies Embedded Systems Linux Cloud Computing Program Management Enterprise Software Architecture Business Intelligence Security Strategy Intel Business Process Software Development Integration Semiconductors Agile Methodologies Embedded Systems Linux Cloud Computing Program Management Enterprise Software Architecture Business Intelligence Security Strategy Intel Business Process Software Development Integration Semiconductors Agile Methodologies Embedded Systems Linux Cloud Computing Program Management ", "Summary Geoff Walker is a touch-technology expert with 20+ years of experience in touch. Geoff is currently a Senior Touch Technologist at Intel Corporation in Santa Clara, California, where he works closely with Intel business groups, engineering teams, and Intel Capital to formulate and drive cross-Intel strategy on touch-related technology and product development. Previously Geoff served as Owner and Principal Consultant at Walker Mobile, Marketing Evangelist & Touch-Industry Guru at NextWindow, Global Director of Product Management and Business Development at Elo Touch Solutions, Director of Engineering Program Management at Handspring, and Product Architect & Vice President of Marketing at Fujitsu Personal Systems. Geoff also worked in a variety of technical and marketing roles at GRiD Systems and Hewlett-Packard. Geoff is a prolific writer and speaker, having authored more than 65 articles on touch, displays, and mobile computing, and made more than 40 presentations at display, touch, and emerging-technology conferences in the US, Taiwan, China, Japan, and Korea since touch exploded in 2007 with the launch of the iPhone. Most of the source material is available on the Walker Mobile website (see below). Geoff is a very active member of SID, speaking at multiple SID conferences, chairing the Bay-Area Chapter of SID during 2010-2013, serving on the SID Symposium Touch-Paper Selection Subcommittee, and serving as the Guest Editor for Touch and Interactivity on SID's \"Information Display\" magazine during 2007-2013. Geoff is also a member of IEEE and ACM. Geoff holds BS-Electrical Engineering and BS-English degrees from the Polytechnic Institute of New York University, and has completed all the coursework for an MBA in Marketing from the Leonard N. Stern School of Business at New York University.  \n \nSpecialties: Current & emerging touch-screen technologies; active digitizers & styli; enhancements to touch-screens and flat-panel displays; tablet PCs. Summary Geoff Walker is a touch-technology expert with 20+ years of experience in touch. Geoff is currently a Senior Touch Technologist at Intel Corporation in Santa Clara, California, where he works closely with Intel business groups, engineering teams, and Intel Capital to formulate and drive cross-Intel strategy on touch-related technology and product development. Previously Geoff served as Owner and Principal Consultant at Walker Mobile, Marketing Evangelist & Touch-Industry Guru at NextWindow, Global Director of Product Management and Business Development at Elo Touch Solutions, Director of Engineering Program Management at Handspring, and Product Architect & Vice President of Marketing at Fujitsu Personal Systems. Geoff also worked in a variety of technical and marketing roles at GRiD Systems and Hewlett-Packard. Geoff is a prolific writer and speaker, having authored more than 65 articles on touch, displays, and mobile computing, and made more than 40 presentations at display, touch, and emerging-technology conferences in the US, Taiwan, China, Japan, and Korea since touch exploded in 2007 with the launch of the iPhone. Most of the source material is available on the Walker Mobile website (see below). Geoff is a very active member of SID, speaking at multiple SID conferences, chairing the Bay-Area Chapter of SID during 2010-2013, serving on the SID Symposium Touch-Paper Selection Subcommittee, and serving as the Guest Editor for Touch and Interactivity on SID's \"Information Display\" magazine during 2007-2013. Geoff is also a member of IEEE and ACM. Geoff holds BS-Electrical Engineering and BS-English degrees from the Polytechnic Institute of New York University, and has completed all the coursework for an MBA in Marketing from the Leonard N. Stern School of Business at New York University.  \n \nSpecialties: Current & emerging touch-screen technologies; active digitizers & styli; enhancements to touch-screens and flat-panel displays; tablet PCs. Geoff Walker is a touch-technology expert with 20+ years of experience in touch. Geoff is currently a Senior Touch Technologist at Intel Corporation in Santa Clara, California, where he works closely with Intel business groups, engineering teams, and Intel Capital to formulate and drive cross-Intel strategy on touch-related technology and product development. Previously Geoff served as Owner and Principal Consultant at Walker Mobile, Marketing Evangelist & Touch-Industry Guru at NextWindow, Global Director of Product Management and Business Development at Elo Touch Solutions, Director of Engineering Program Management at Handspring, and Product Architect & Vice President of Marketing at Fujitsu Personal Systems. Geoff also worked in a variety of technical and marketing roles at GRiD Systems and Hewlett-Packard. Geoff is a prolific writer and speaker, having authored more than 65 articles on touch, displays, and mobile computing, and made more than 40 presentations at display, touch, and emerging-technology conferences in the US, Taiwan, China, Japan, and Korea since touch exploded in 2007 with the launch of the iPhone. Most of the source material is available on the Walker Mobile website (see below). Geoff is a very active member of SID, speaking at multiple SID conferences, chairing the Bay-Area Chapter of SID during 2010-2013, serving on the SID Symposium Touch-Paper Selection Subcommittee, and serving as the Guest Editor for Touch and Interactivity on SID's \"Information Display\" magazine during 2007-2013. Geoff is also a member of IEEE and ACM. Geoff holds BS-Electrical Engineering and BS-English degrees from the Polytechnic Institute of New York University, and has completed all the coursework for an MBA in Marketing from the Leonard N. Stern School of Business at New York University.  \n \nSpecialties: Current & emerging touch-screen technologies; active digitizers & styli; enhancements to touch-screens and flat-panel displays; tablet PCs. Geoff Walker is a touch-technology expert with 20+ years of experience in touch. Geoff is currently a Senior Touch Technologist at Intel Corporation in Santa Clara, California, where he works closely with Intel business groups, engineering teams, and Intel Capital to formulate and drive cross-Intel strategy on touch-related technology and product development. Previously Geoff served as Owner and Principal Consultant at Walker Mobile, Marketing Evangelist & Touch-Industry Guru at NextWindow, Global Director of Product Management and Business Development at Elo Touch Solutions, Director of Engineering Program Management at Handspring, and Product Architect & Vice President of Marketing at Fujitsu Personal Systems. Geoff also worked in a variety of technical and marketing roles at GRiD Systems and Hewlett-Packard. Geoff is a prolific writer and speaker, having authored more than 65 articles on touch, displays, and mobile computing, and made more than 40 presentations at display, touch, and emerging-technology conferences in the US, Taiwan, China, Japan, and Korea since touch exploded in 2007 with the launch of the iPhone. Most of the source material is available on the Walker Mobile website (see below). Geoff is a very active member of SID, speaking at multiple SID conferences, chairing the Bay-Area Chapter of SID during 2010-2013, serving on the SID Symposium Touch-Paper Selection Subcommittee, and serving as the Guest Editor for Touch and Interactivity on SID's \"Information Display\" magazine during 2007-2013. Geoff is also a member of IEEE and ACM. Geoff holds BS-Electrical Engineering and BS-English degrees from the Polytechnic Institute of New York University, and has completed all the coursework for an MBA in Marketing from the Leonard N. Stern School of Business at New York University.  \n \nSpecialties: Current & emerging touch-screen technologies; active digitizers & styli; enhancements to touch-screens and flat-panel displays; tablet PCs. Experience Senior Touch Technologist Intel Corporation July 2012  – Present (3 years 2 months) Leading touch technology, products, ecosystem development, and enabling strategy to deliver compelling user experiences on Intel-based computing and communications platforms. Working closely with multiple business groups, technology & engineering teams, and Intel Capital to formulate and drive cross-Intel strategy on touch-related technology, product development, and industry enabling. Owner & Principal Consultant Walker Mobile, LLC January 2001  –  July 2012  (11 years 7 months) Founded Walker Mobile, LLC in January 2001 in order to leverage 20 years of experience in the mobile computing industry. Through the end of 2007, Walker Mobile provided consulting full-time on strategic & tactical technical-marketing topics related to touch-screens & active digitizers, flat-panel displays & enhancements, and mobile computers. During 2008-2011, Geoff provided consulting on a part-time basis while working full-time at Elo TouchSystems and then NextWindow. Upon leaving NextWindow in 2011, Geoff returned to providing consulting full-time. Walker Mobile clients have included more than 80 high-technology firms located in the US, Canada, UK, Germany, Israel, Taiwan, Korea, Japan, Australia and New Zealand. Client company size has ranged from two-person startups to $50B corporations; client products have included touch sensors, touch controllers, digitizers, displays, computers & peripherals, software, materials, manufacturing equipment, IP portfolio analysis & sales, litigation support, and market research.  \n \nPublished more than 65 articles on touch screens, active digitizers, displays, display enhancements and mobile computers (2001-present). Served as the Guest Editor for Touch on SID's \"Information Display\" magazine (2007-present). Served as the Associate Editor for Veritas et Visus, a series of five display-industry specialty newsletters covering touch screens, high-resolution displays, 3D displays, flexible displays and display standards (2005-2007). Served as the Technology Editor for Pen Computing, a magazine and website covering mobile computing hardware, including Tablet PCs, PDAs, commercial & rugged notebooks, and industrial handheld computers (2001-2007). Made more than 40 presentations at display, touch, and emerging-technology conferences in the US, Taiwan, China, Japan, and Korea (2007-present). Marketing Evangelist & Touch-Industry Guru NextWindow February 2010  –  April 2011  (1 year 3 months) Gathered global touch-market and touch-industry intelligence from a wide variety of sources to help guide NextWindow’s product positioning and strategy; shared the information with SMART Technologies, NextWindow’s parent; analyzed current and potential touch competitors and technologies; analyzed external touch market research from multiple sources and published summaries. Met with touch startups and entrepreneurs to evaluate their value to NextWindow; attended 18 industry conferences & shows and spoke at 10 of them; conducted interviews with 30+ editors & analysts; published six articles on touch in the trade press; participated in SID conferences, committees, publications and west-coast chapters. Product Marketing Manager NextWindow May 2009  –  April 2011  (2 years) Implemented NextWindow’s first quarterly product-roadmap review cycle and led the review for three quarters; helped drive product architecture decisions; participated in meetings with Microsoft on touch in Windows 8; participated as a member of the IP Committee. Supported the sales force in OEM/ODM opportunities; developed and presented training for the sales force on the touch market; worked with Marcom on company presentations, trade-show strategy, press releases, product datasheets and website content. Led the 2009 company strategy meeting, including developing the agenda, working with the facilitator, presenting at the meeting and publishing summary notes; taught a half-day touch technology tutorial to 70+ NextWindow employees in New Zealand; helped recruit NextWindow’s first New Zealand-based product manager. Global Director of Business Development Elo TouchSystems (Tyco Electronics) December 2008  –  April 2009  (5 months) Led Elo’s five-year strategic planning effort while meeting Tyco Electronics' Group & Corporate requirements; gathered global touch market & competitor information and published a periodic business intelligence report for Corporate; developed diagnostic data on Elo’s sales and markets, including market segment size and growth rate, sales by market segment, etc.; acted as the focal point for information on Elo’s potential acquisitions; contributed to Group quarterly operations, strategy and business reviews. Supported the Elo sales force in exploring significant new OEM business opportunities outside of Elo’s traditional core markets, especially those in the consumer electronics market; this included responding to RFPs, making presentations to prospects and generating quotes. Reported to the President of Elo (VP-level position). Global Director of Product Management Elo TouchSystems (Tyco Electronics) December 2007  –  November 2008  (1 year) Led Elo TouchSystems' global product management group consisting of seven direct-report product managers in headquarters and two dotted-line-report managers leading regional product-management teams in Belgium and Japan. The group was responsible for all Elo products worldwide, including managing product pricing, special quotes and margins; developing product training for the sales force; reviewing the sales forecast; launching new products; and working with R&D to define new products. Replaced three product managers who weren't able to grow to meet the rapidly changing market conditions. Helped form the New Product Introduction (NPI) Council, an internal cross-functional team focused on defining and resolving problems that were causing late products. Also responsible for the North American Customer Service team consisting of 11 people and a manager. Reported to the President of Elo (VP-level position). At the end of 2008 the Director of Business Development and I decided to swap jobs; I wanted to have more influence on Elo’s product strategy, and he wanted to get more experience in people-management. Director of Engineering Program Management Handspring 1999  –  2001  (2 years) Joined startup Handspring as employee #30 and managed the development of Handspring’s first color PDA (the Visor Prism); recruited and hired three engineering program managers who led all of Handspring’s other hardware and software product development projects. Worked directly with Sharp to develop a semi-custom LCD, saving $600K in NRE over a fully custom LCD. Worked directly with Option International in Belgium (going on-site one week per month for six months) to help them successfully complete the GSM radio used in Handspring’s first cellphone (the VisorPhone, predecessor of the Treo smartphone). Functioned as Handspring's display & touchscreen engineer during the first year, leveraging technical expertise developed at GRiD and Fujitsu.  \n \nCreated, developed and successfully implemented a cross-functional product-development life-cycle phase review process which formalized the progression of all engineering projects through eight defined life-cycle phases. The process was based on (a) a core three-person team from engineering, marketing and manufacturing assigned to every major product, (b) detailed departmental checklists for each phase transition, and (c) exception-focused executive-management sign-off meetings for each phase transition. VP of Marketing (last position of two) Fujitsu Personal Systems 1993  –  1999  (6 years) Joined Fujitsu Personal Systems, Inc. (FPSI) as an early employee of a new division created from the assets of a failed handheld-computer startup. Served as FPSI’s product architect, leading the development of seven generations of Windows pen tablets (the Stylistic®, Point® and PenCentra® series) that helped drive FPSI’s revenue from $4M in 1993 to $100M in 1999 while maintaining profitability. Worked directly with Development at FPSI (for peripherals) and at Fujitsu Japan (for core products). Personally conducted hundreds of customer & prospect interviews to determine needs and requirements; developed & maintained FPSI's product roadmap; created value propositions, business cases and go-to-market strategies. Initiated a program management process focused on developing quality products, delivering them on-time, meeting customer expectations and providing feedback to management. \n \nRecruited, hired and led a 10-person marketing team that implemented effective cradle-to-grave product management, product marketing, channel, PR, trade show, sales collateral, advertising, website and inbound telemarketing programs for FPSI’s products. Led the development and presented key portions of all product training for FPSI's direct field-sales organization. \n \nPersonally researched the healthcare market and used the results to create FPSI’s first market-specific products (the Point 510, followed by the Point 1600), which became the dominant Windows pen tablets used in point-of-care healthcare applications in the late 1990s. Established effective, on-going working relationships with all of the analysts and many of the trade press editors covering enterprise mobile computing, through 150+ face-to-face meetings and telephone interviews. Became a published & recognized pen-computer champion. Director of OEM Products (last position of five) GRiD Systems 1982  –  1992  (10 years) As Director of OEM Products, managed all of GRiD's OEM mobile computer products, including notebooks and pen tablets that in total produced over $80M revenue in 1992. Personally worked with Japanese and Korean OEMs throughout the product development cycle on all OEM products. Worked on the world's first pen-tablet computer (the GRiDPad) in 1989. \n \nJoined startup GRiD Systems as employee #49 and worked in Product Marketing at headquarters in California on the launch of the world’s first laptop computer (April, 1982). Returned to New York to start up GRiD’s Eastern Region Systems Engineering organization. Moved to California in 1984 at GRiD’s request to manage the rollout of GRiD’s first file-server/wide-area network product. As Specials Group Manager, created and managed a five-person group responsible for developing custom laptop software products written to meet specific customer requirements. As Vertical Marketing Manager, developed a marketing program that focused the GRiD direct sales force on laptop opportunities in the field-service and field-engineering markets. New York Area Systems Engineering Manager (last position of eight) Hewlett-Packard 1969  –  1981  (12 years) As the New York Area Systems Engineering Manager (1979-1981), built the Hewlett-Packard New York Area Systems Engineering organization from 25 people to 60 people, while increasing revenue from $1.5M to $3.7M, meeting targeted profit/expense/capital-asset levels and maintaining customer satisfaction with services on the HP-1000 and HP-3000 minicomputers.  \n \nPrior positions at HP included New Jersey District Systems Engineering Manager, Field Systems Engineer, IT Programmer/Analyst, Order Administration Manager, Sales Development Engineer, Marcom Manager and Technical Writer. Senior Touch Technologist Intel Corporation July 2012  – Present (3 years 2 months) Leading touch technology, products, ecosystem development, and enabling strategy to deliver compelling user experiences on Intel-based computing and communications platforms. Working closely with multiple business groups, technology & engineering teams, and Intel Capital to formulate and drive cross-Intel strategy on touch-related technology, product development, and industry enabling. Senior Touch Technologist Intel Corporation July 2012  – Present (3 years 2 months) Leading touch technology, products, ecosystem development, and enabling strategy to deliver compelling user experiences on Intel-based computing and communications platforms. Working closely with multiple business groups, technology & engineering teams, and Intel Capital to formulate and drive cross-Intel strategy on touch-related technology, product development, and industry enabling. Owner & Principal Consultant Walker Mobile, LLC January 2001  –  July 2012  (11 years 7 months) Founded Walker Mobile, LLC in January 2001 in order to leverage 20 years of experience in the mobile computing industry. Through the end of 2007, Walker Mobile provided consulting full-time on strategic & tactical technical-marketing topics related to touch-screens & active digitizers, flat-panel displays & enhancements, and mobile computers. During 2008-2011, Geoff provided consulting on a part-time basis while working full-time at Elo TouchSystems and then NextWindow. Upon leaving NextWindow in 2011, Geoff returned to providing consulting full-time. Walker Mobile clients have included more than 80 high-technology firms located in the US, Canada, UK, Germany, Israel, Taiwan, Korea, Japan, Australia and New Zealand. Client company size has ranged from two-person startups to $50B corporations; client products have included touch sensors, touch controllers, digitizers, displays, computers & peripherals, software, materials, manufacturing equipment, IP portfolio analysis & sales, litigation support, and market research.  \n \nPublished more than 65 articles on touch screens, active digitizers, displays, display enhancements and mobile computers (2001-present). Served as the Guest Editor for Touch on SID's \"Information Display\" magazine (2007-present). Served as the Associate Editor for Veritas et Visus, a series of five display-industry specialty newsletters covering touch screens, high-resolution displays, 3D displays, flexible displays and display standards (2005-2007). Served as the Technology Editor for Pen Computing, a magazine and website covering mobile computing hardware, including Tablet PCs, PDAs, commercial & rugged notebooks, and industrial handheld computers (2001-2007). Made more than 40 presentations at display, touch, and emerging-technology conferences in the US, Taiwan, China, Japan, and Korea (2007-present). Owner & Principal Consultant Walker Mobile, LLC January 2001  –  July 2012  (11 years 7 months) Founded Walker Mobile, LLC in January 2001 in order to leverage 20 years of experience in the mobile computing industry. Through the end of 2007, Walker Mobile provided consulting full-time on strategic & tactical technical-marketing topics related to touch-screens & active digitizers, flat-panel displays & enhancements, and mobile computers. During 2008-2011, Geoff provided consulting on a part-time basis while working full-time at Elo TouchSystems and then NextWindow. Upon leaving NextWindow in 2011, Geoff returned to providing consulting full-time. Walker Mobile clients have included more than 80 high-technology firms located in the US, Canada, UK, Germany, Israel, Taiwan, Korea, Japan, Australia and New Zealand. Client company size has ranged from two-person startups to $50B corporations; client products have included touch sensors, touch controllers, digitizers, displays, computers & peripherals, software, materials, manufacturing equipment, IP portfolio analysis & sales, litigation support, and market research.  \n \nPublished more than 65 articles on touch screens, active digitizers, displays, display enhancements and mobile computers (2001-present). Served as the Guest Editor for Touch on SID's \"Information Display\" magazine (2007-present). Served as the Associate Editor for Veritas et Visus, a series of five display-industry specialty newsletters covering touch screens, high-resolution displays, 3D displays, flexible displays and display standards (2005-2007). Served as the Technology Editor for Pen Computing, a magazine and website covering mobile computing hardware, including Tablet PCs, PDAs, commercial & rugged notebooks, and industrial handheld computers (2001-2007). Made more than 40 presentations at display, touch, and emerging-technology conferences in the US, Taiwan, China, Japan, and Korea (2007-present). Marketing Evangelist & Touch-Industry Guru NextWindow February 2010  –  April 2011  (1 year 3 months) Gathered global touch-market and touch-industry intelligence from a wide variety of sources to help guide NextWindow’s product positioning and strategy; shared the information with SMART Technologies, NextWindow’s parent; analyzed current and potential touch competitors and technologies; analyzed external touch market research from multiple sources and published summaries. Met with touch startups and entrepreneurs to evaluate their value to NextWindow; attended 18 industry conferences & shows and spoke at 10 of them; conducted interviews with 30+ editors & analysts; published six articles on touch in the trade press; participated in SID conferences, committees, publications and west-coast chapters. Marketing Evangelist & Touch-Industry Guru NextWindow February 2010  –  April 2011  (1 year 3 months) Gathered global touch-market and touch-industry intelligence from a wide variety of sources to help guide NextWindow’s product positioning and strategy; shared the information with SMART Technologies, NextWindow’s parent; analyzed current and potential touch competitors and technologies; analyzed external touch market research from multiple sources and published summaries. Met with touch startups and entrepreneurs to evaluate their value to NextWindow; attended 18 industry conferences & shows and spoke at 10 of them; conducted interviews with 30+ editors & analysts; published six articles on touch in the trade press; participated in SID conferences, committees, publications and west-coast chapters. Product Marketing Manager NextWindow May 2009  –  April 2011  (2 years) Implemented NextWindow’s first quarterly product-roadmap review cycle and led the review for three quarters; helped drive product architecture decisions; participated in meetings with Microsoft on touch in Windows 8; participated as a member of the IP Committee. Supported the sales force in OEM/ODM opportunities; developed and presented training for the sales force on the touch market; worked with Marcom on company presentations, trade-show strategy, press releases, product datasheets and website content. Led the 2009 company strategy meeting, including developing the agenda, working with the facilitator, presenting at the meeting and publishing summary notes; taught a half-day touch technology tutorial to 70+ NextWindow employees in New Zealand; helped recruit NextWindow’s first New Zealand-based product manager. Product Marketing Manager NextWindow May 2009  –  April 2011  (2 years) Implemented NextWindow’s first quarterly product-roadmap review cycle and led the review for three quarters; helped drive product architecture decisions; participated in meetings with Microsoft on touch in Windows 8; participated as a member of the IP Committee. Supported the sales force in OEM/ODM opportunities; developed and presented training for the sales force on the touch market; worked with Marcom on company presentations, trade-show strategy, press releases, product datasheets and website content. Led the 2009 company strategy meeting, including developing the agenda, working with the facilitator, presenting at the meeting and publishing summary notes; taught a half-day touch technology tutorial to 70+ NextWindow employees in New Zealand; helped recruit NextWindow’s first New Zealand-based product manager. Global Director of Business Development Elo TouchSystems (Tyco Electronics) December 2008  –  April 2009  (5 months) Led Elo’s five-year strategic planning effort while meeting Tyco Electronics' Group & Corporate requirements; gathered global touch market & competitor information and published a periodic business intelligence report for Corporate; developed diagnostic data on Elo’s sales and markets, including market segment size and growth rate, sales by market segment, etc.; acted as the focal point for information on Elo’s potential acquisitions; contributed to Group quarterly operations, strategy and business reviews. Supported the Elo sales force in exploring significant new OEM business opportunities outside of Elo’s traditional core markets, especially those in the consumer electronics market; this included responding to RFPs, making presentations to prospects and generating quotes. Reported to the President of Elo (VP-level position). Global Director of Business Development Elo TouchSystems (Tyco Electronics) December 2008  –  April 2009  (5 months) Led Elo’s five-year strategic planning effort while meeting Tyco Electronics' Group & Corporate requirements; gathered global touch market & competitor information and published a periodic business intelligence report for Corporate; developed diagnostic data on Elo’s sales and markets, including market segment size and growth rate, sales by market segment, etc.; acted as the focal point for information on Elo’s potential acquisitions; contributed to Group quarterly operations, strategy and business reviews. Supported the Elo sales force in exploring significant new OEM business opportunities outside of Elo’s traditional core markets, especially those in the consumer electronics market; this included responding to RFPs, making presentations to prospects and generating quotes. Reported to the President of Elo (VP-level position). Global Director of Product Management Elo TouchSystems (Tyco Electronics) December 2007  –  November 2008  (1 year) Led Elo TouchSystems' global product management group consisting of seven direct-report product managers in headquarters and two dotted-line-report managers leading regional product-management teams in Belgium and Japan. The group was responsible for all Elo products worldwide, including managing product pricing, special quotes and margins; developing product training for the sales force; reviewing the sales forecast; launching new products; and working with R&D to define new products. Replaced three product managers who weren't able to grow to meet the rapidly changing market conditions. Helped form the New Product Introduction (NPI) Council, an internal cross-functional team focused on defining and resolving problems that were causing late products. Also responsible for the North American Customer Service team consisting of 11 people and a manager. Reported to the President of Elo (VP-level position). At the end of 2008 the Director of Business Development and I decided to swap jobs; I wanted to have more influence on Elo’s product strategy, and he wanted to get more experience in people-management. Global Director of Product Management Elo TouchSystems (Tyco Electronics) December 2007  –  November 2008  (1 year) Led Elo TouchSystems' global product management group consisting of seven direct-report product managers in headquarters and two dotted-line-report managers leading regional product-management teams in Belgium and Japan. The group was responsible for all Elo products worldwide, including managing product pricing, special quotes and margins; developing product training for the sales force; reviewing the sales forecast; launching new products; and working with R&D to define new products. Replaced three product managers who weren't able to grow to meet the rapidly changing market conditions. Helped form the New Product Introduction (NPI) Council, an internal cross-functional team focused on defining and resolving problems that were causing late products. Also responsible for the North American Customer Service team consisting of 11 people and a manager. Reported to the President of Elo (VP-level position). At the end of 2008 the Director of Business Development and I decided to swap jobs; I wanted to have more influence on Elo’s product strategy, and he wanted to get more experience in people-management. Director of Engineering Program Management Handspring 1999  –  2001  (2 years) Joined startup Handspring as employee #30 and managed the development of Handspring’s first color PDA (the Visor Prism); recruited and hired three engineering program managers who led all of Handspring’s other hardware and software product development projects. Worked directly with Sharp to develop a semi-custom LCD, saving $600K in NRE over a fully custom LCD. Worked directly with Option International in Belgium (going on-site one week per month for six months) to help them successfully complete the GSM radio used in Handspring’s first cellphone (the VisorPhone, predecessor of the Treo smartphone). Functioned as Handspring's display & touchscreen engineer during the first year, leveraging technical expertise developed at GRiD and Fujitsu.  \n \nCreated, developed and successfully implemented a cross-functional product-development life-cycle phase review process which formalized the progression of all engineering projects through eight defined life-cycle phases. The process was based on (a) a core three-person team from engineering, marketing and manufacturing assigned to every major product, (b) detailed departmental checklists for each phase transition, and (c) exception-focused executive-management sign-off meetings for each phase transition. Director of Engineering Program Management Handspring 1999  –  2001  (2 years) Joined startup Handspring as employee #30 and managed the development of Handspring’s first color PDA (the Visor Prism); recruited and hired three engineering program managers who led all of Handspring’s other hardware and software product development projects. Worked directly with Sharp to develop a semi-custom LCD, saving $600K in NRE over a fully custom LCD. Worked directly with Option International in Belgium (going on-site one week per month for six months) to help them successfully complete the GSM radio used in Handspring’s first cellphone (the VisorPhone, predecessor of the Treo smartphone). Functioned as Handspring's display & touchscreen engineer during the first year, leveraging technical expertise developed at GRiD and Fujitsu.  \n \nCreated, developed and successfully implemented a cross-functional product-development life-cycle phase review process which formalized the progression of all engineering projects through eight defined life-cycle phases. The process was based on (a) a core three-person team from engineering, marketing and manufacturing assigned to every major product, (b) detailed departmental checklists for each phase transition, and (c) exception-focused executive-management sign-off meetings for each phase transition. VP of Marketing (last position of two) Fujitsu Personal Systems 1993  –  1999  (6 years) Joined Fujitsu Personal Systems, Inc. (FPSI) as an early employee of a new division created from the assets of a failed handheld-computer startup. Served as FPSI’s product architect, leading the development of seven generations of Windows pen tablets (the Stylistic®, Point® and PenCentra® series) that helped drive FPSI’s revenue from $4M in 1993 to $100M in 1999 while maintaining profitability. Worked directly with Development at FPSI (for peripherals) and at Fujitsu Japan (for core products). Personally conducted hundreds of customer & prospect interviews to determine needs and requirements; developed & maintained FPSI's product roadmap; created value propositions, business cases and go-to-market strategies. Initiated a program management process focused on developing quality products, delivering them on-time, meeting customer expectations and providing feedback to management. \n \nRecruited, hired and led a 10-person marketing team that implemented effective cradle-to-grave product management, product marketing, channel, PR, trade show, sales collateral, advertising, website and inbound telemarketing programs for FPSI’s products. Led the development and presented key portions of all product training for FPSI's direct field-sales organization. \n \nPersonally researched the healthcare market and used the results to create FPSI’s first market-specific products (the Point 510, followed by the Point 1600), which became the dominant Windows pen tablets used in point-of-care healthcare applications in the late 1990s. Established effective, on-going working relationships with all of the analysts and many of the trade press editors covering enterprise mobile computing, through 150+ face-to-face meetings and telephone interviews. Became a published & recognized pen-computer champion. VP of Marketing (last position of two) Fujitsu Personal Systems 1993  –  1999  (6 years) Joined Fujitsu Personal Systems, Inc. (FPSI) as an early employee of a new division created from the assets of a failed handheld-computer startup. Served as FPSI’s product architect, leading the development of seven generations of Windows pen tablets (the Stylistic®, Point® and PenCentra® series) that helped drive FPSI’s revenue from $4M in 1993 to $100M in 1999 while maintaining profitability. Worked directly with Development at FPSI (for peripherals) and at Fujitsu Japan (for core products). Personally conducted hundreds of customer & prospect interviews to determine needs and requirements; developed & maintained FPSI's product roadmap; created value propositions, business cases and go-to-market strategies. Initiated a program management process focused on developing quality products, delivering them on-time, meeting customer expectations and providing feedback to management. \n \nRecruited, hired and led a 10-person marketing team that implemented effective cradle-to-grave product management, product marketing, channel, PR, trade show, sales collateral, advertising, website and inbound telemarketing programs for FPSI’s products. Led the development and presented key portions of all product training for FPSI's direct field-sales organization. \n \nPersonally researched the healthcare market and used the results to create FPSI’s first market-specific products (the Point 510, followed by the Point 1600), which became the dominant Windows pen tablets used in point-of-care healthcare applications in the late 1990s. Established effective, on-going working relationships with all of the analysts and many of the trade press editors covering enterprise mobile computing, through 150+ face-to-face meetings and telephone interviews. Became a published & recognized pen-computer champion. Director of OEM Products (last position of five) GRiD Systems 1982  –  1992  (10 years) As Director of OEM Products, managed all of GRiD's OEM mobile computer products, including notebooks and pen tablets that in total produced over $80M revenue in 1992. Personally worked with Japanese and Korean OEMs throughout the product development cycle on all OEM products. Worked on the world's first pen-tablet computer (the GRiDPad) in 1989. \n \nJoined startup GRiD Systems as employee #49 and worked in Product Marketing at headquarters in California on the launch of the world’s first laptop computer (April, 1982). Returned to New York to start up GRiD’s Eastern Region Systems Engineering organization. Moved to California in 1984 at GRiD’s request to manage the rollout of GRiD’s first file-server/wide-area network product. As Specials Group Manager, created and managed a five-person group responsible for developing custom laptop software products written to meet specific customer requirements. As Vertical Marketing Manager, developed a marketing program that focused the GRiD direct sales force on laptop opportunities in the field-service and field-engineering markets. Director of OEM Products (last position of five) GRiD Systems 1982  –  1992  (10 years) As Director of OEM Products, managed all of GRiD's OEM mobile computer products, including notebooks and pen tablets that in total produced over $80M revenue in 1992. Personally worked with Japanese and Korean OEMs throughout the product development cycle on all OEM products. Worked on the world's first pen-tablet computer (the GRiDPad) in 1989. \n \nJoined startup GRiD Systems as employee #49 and worked in Product Marketing at headquarters in California on the launch of the world’s first laptop computer (April, 1982). Returned to New York to start up GRiD’s Eastern Region Systems Engineering organization. Moved to California in 1984 at GRiD’s request to manage the rollout of GRiD’s first file-server/wide-area network product. As Specials Group Manager, created and managed a five-person group responsible for developing custom laptop software products written to meet specific customer requirements. As Vertical Marketing Manager, developed a marketing program that focused the GRiD direct sales force on laptop opportunities in the field-service and field-engineering markets. New York Area Systems Engineering Manager (last position of eight) Hewlett-Packard 1969  –  1981  (12 years) As the New York Area Systems Engineering Manager (1979-1981), built the Hewlett-Packard New York Area Systems Engineering organization from 25 people to 60 people, while increasing revenue from $1.5M to $3.7M, meeting targeted profit/expense/capital-asset levels and maintaining customer satisfaction with services on the HP-1000 and HP-3000 minicomputers.  \n \nPrior positions at HP included New Jersey District Systems Engineering Manager, Field Systems Engineer, IT Programmer/Analyst, Order Administration Manager, Sales Development Engineer, Marcom Manager and Technical Writer. New York Area Systems Engineering Manager (last position of eight) Hewlett-Packard 1969  –  1981  (12 years) As the New York Area Systems Engineering Manager (1979-1981), built the Hewlett-Packard New York Area Systems Engineering organization from 25 people to 60 people, while increasing revenue from $1.5M to $3.7M, meeting targeted profit/expense/capital-asset levels and maintaining customer satisfaction with services on the HP-1000 and HP-3000 minicomputers.  \n \nPrior positions at HP included New Jersey District Systems Engineering Manager, Field Systems Engineer, IT Programmer/Analyst, Order Administration Manager, Sales Development Engineer, Marcom Manager and Technical Writer. Skills Strategic Consulting Touch Screens Touch Interfaces Active Digitizers Consumer Electronics Tablet PC Mobile Devices Mobile Technology Market Analysis Competitive Analysis Marketing Strategy Product Marketing Product Management Market Research Start-ups Sales Product Launch Marketing Communications Cross-functional Team... Strategic Partnerships Sales Management Display Technology Channel Partners Strategic Planning Go-to-market Strategy Manufacturing User Experience Strategy Product Lifecycle... Marketing Leadership International Sales Management Wireless Entrepreneurship Software Development See 21+     See less Skills  Strategic Consulting Touch Screens Touch Interfaces Active Digitizers Consumer Electronics Tablet PC Mobile Devices Mobile Technology Market Analysis Competitive Analysis Marketing Strategy Product Marketing Product Management Market Research Start-ups Sales Product Launch Marketing Communications Cross-functional Team... Strategic Partnerships Sales Management Display Technology Channel Partners Strategic Planning Go-to-market Strategy Manufacturing User Experience Strategy Product Lifecycle... Marketing Leadership International Sales Management Wireless Entrepreneurship Software Development See 21+     See less Strategic Consulting Touch Screens Touch Interfaces Active Digitizers Consumer Electronics Tablet PC Mobile Devices Mobile Technology Market Analysis Competitive Analysis Marketing Strategy Product Marketing Product Management Market Research Start-ups Sales Product Launch Marketing Communications Cross-functional Team... Strategic Partnerships Sales Management Display Technology Channel Partners Strategic Planning Go-to-market Strategy Manufacturing User Experience Strategy Product Lifecycle... Marketing Leadership International Sales Management Wireless Entrepreneurship Software Development See 21+     See less Strategic Consulting Touch Screens Touch Interfaces Active Digitizers Consumer Electronics Tablet PC Mobile Devices Mobile Technology Market Analysis Competitive Analysis Marketing Strategy Product Marketing Product Management Market Research Start-ups Sales Product Launch Marketing Communications Cross-functional Team... Strategic Partnerships Sales Management Display Technology Channel Partners Strategic Planning Go-to-market Strategy Manufacturing User Experience Strategy Product Lifecycle... Marketing Leadership International Sales Management Wireless Entrepreneurship Software Development See 21+     See less Education New York University - Leonard N. Stern School of Business All Coursework for MBA in Marketing 1971  – 1975 Polytechnic Institute of New York University BS,  Electrical Engineering 1963  – 1971 Polytechnic Institute of New York University BS,  Humanities (English) 1963  – 1969 Activities and Societies:  Editor-in-Chief of Polywog Yearbook 1969 ,  writer/photographer on university newspaper and engineering magazine ,  Focus (photography club) ,  IEEE. New York University - Leonard N. Stern School of Business All Coursework for MBA in Marketing 1971  – 1975 New York University - Leonard N. Stern School of Business All Coursework for MBA in Marketing 1971  – 1975 New York University - Leonard N. Stern School of Business All Coursework for MBA in Marketing 1971  – 1975 Polytechnic Institute of New York University BS,  Electrical Engineering 1963  – 1971 Polytechnic Institute of New York University BS,  Electrical Engineering 1963  – 1971 Polytechnic Institute of New York University BS,  Electrical Engineering 1963  – 1971 Polytechnic Institute of New York University BS,  Humanities (English) 1963  – 1969 Activities and Societies:  Editor-in-Chief of Polywog Yearbook 1969 ,  writer/photographer on university newspaper and engineering magazine ,  Focus (photography club) ,  IEEE. Polytechnic Institute of New York University BS,  Humanities (English) 1963  – 1969 Activities and Societies:  Editor-in-Chief of Polywog Yearbook 1969 ,  writer/photographer on university newspaper and engineering magazine ,  Focus (photography club) ,  IEEE. Polytechnic Institute of New York University BS,  Humanities (English) 1963  – 1969 Activities and Societies:  Editor-in-Chief of Polywog Yearbook 1969 ,  writer/photographer on university newspaper and engineering magazine ,  Focus (photography club) ,  IEEE. Honors & Awards Additional Honors & Awards For a complete list of and access to Geoff Walker's 120+ articles, conference presentations, tutorials, white papers and other publications, see http://www.walkermobile.com/PublishedMaterial.htm. Additional Honors & Awards For a complete list of and access to Geoff Walker's 120+ articles, conference presentations, tutorials, white papers and other publications, see http://www.walkermobile.com/PublishedMaterial.htm. Additional Honors & Awards For a complete list of and access to Geoff Walker's 120+ articles, conference presentations, tutorials, white papers and other publications, see http://www.walkermobile.com/PublishedMaterial.htm. Additional Honors & Awards For a complete list of and access to Geoff Walker's 120+ articles, conference presentations, tutorials, white papers and other publications, see http://www.walkermobile.com/PublishedMaterial.htm. ", "Skills Embedded Systems Linux TCP/IP Firewalls Perl Network Security Unix Debugging Device Drivers SNMP IPSec C Architecture Networking Distributed Systems Enterprise Software Processors Product Management Multicore Programming Network Security... Architecture of complex... Architectures Multi-core Virtualization (NFV &... Software Defined... Acceleration... See 11+     See less Skills  Embedded Systems Linux TCP/IP Firewalls Perl Network Security Unix Debugging Device Drivers SNMP IPSec C Architecture Networking Distributed Systems Enterprise Software Processors Product Management Multicore Programming Network Security... Architecture of complex... Architectures Multi-core Virtualization (NFV &... Software Defined... Acceleration... See 11+     See less Embedded Systems Linux TCP/IP Firewalls Perl Network Security Unix Debugging Device Drivers SNMP IPSec C Architecture Networking Distributed Systems Enterprise Software Processors Product Management Multicore Programming Network Security... Architecture of complex... Architectures Multi-core Virtualization (NFV &... Software Defined... Acceleration... See 11+     See less Embedded Systems Linux TCP/IP Firewalls Perl Network Security Unix Debugging Device Drivers SNMP IPSec C Architecture Networking Distributed Systems Enterprise Software Processors Product Management Multicore Programming Network Security... Architecture of complex... Architectures Multi-core Virtualization (NFV &... Software Defined... Acceleration... See 11+     See less ", "Summary Cost reduction, problem solving, defining manufacturing process flows and the equipment set needed to manufacture high volume products. Define and prototype new electronic package assembly and test technologies and manage a new suppliers to deliver with quality and reliability over a product life cycle. Research, development and world wide deployment of the new concepts and measure success with high yield and outstanding cost and other performance metrics. My goal is to continue devising breakthrough methods and assist other companies with their assembly/test production process by offering new tools to solve individual problems in the manufacturing environment. Specialties:Conceive and develop new process, equipment and lean manufacturing solutions. Provide the needed ammunition to migrate to new methods and drive to high volume production to maximize ROI. Motivate others to embrace and rally behind the goodness of the new vision and link the technology road map to meaningful, measurable success indicators. Ability to sort out risk areas and problem solve and implement highly usable complete manufacturing systems. Summary Cost reduction, problem solving, defining manufacturing process flows and the equipment set needed to manufacture high volume products. Define and prototype new electronic package assembly and test technologies and manage a new suppliers to deliver with quality and reliability over a product life cycle. Research, development and world wide deployment of the new concepts and measure success with high yield and outstanding cost and other performance metrics. My goal is to continue devising breakthrough methods and assist other companies with their assembly/test production process by offering new tools to solve individual problems in the manufacturing environment. Specialties:Conceive and develop new process, equipment and lean manufacturing solutions. Provide the needed ammunition to migrate to new methods and drive to high volume production to maximize ROI. Motivate others to embrace and rally behind the goodness of the new vision and link the technology road map to meaningful, measurable success indicators. Ability to sort out risk areas and problem solve and implement highly usable complete manufacturing systems. Cost reduction, problem solving, defining manufacturing process flows and the equipment set needed to manufacture high volume products. Define and prototype new electronic package assembly and test technologies and manage a new suppliers to deliver with quality and reliability over a product life cycle. Research, development and world wide deployment of the new concepts and measure success with high yield and outstanding cost and other performance metrics. My goal is to continue devising breakthrough methods and assist other companies with their assembly/test production process by offering new tools to solve individual problems in the manufacturing environment. Specialties:Conceive and develop new process, equipment and lean manufacturing solutions. Provide the needed ammunition to migrate to new methods and drive to high volume production to maximize ROI. Motivate others to embrace and rally behind the goodness of the new vision and link the technology road map to meaningful, measurable success indicators. Ability to sort out risk areas and problem solve and implement highly usable complete manufacturing systems. Cost reduction, problem solving, defining manufacturing process flows and the equipment set needed to manufacture high volume products. Define and prototype new electronic package assembly and test technologies and manage a new suppliers to deliver with quality and reliability over a product life cycle. Research, development and world wide deployment of the new concepts and measure success with high yield and outstanding cost and other performance metrics. My goal is to continue devising breakthrough methods and assist other companies with their assembly/test production process by offering new tools to solve individual problems in the manufacturing environment. Specialties:Conceive and develop new process, equipment and lean manufacturing solutions. Provide the needed ammunition to migrate to new methods and drive to high volume production to maximize ROI. Motivate others to embrace and rally behind the goodness of the new vision and link the technology road map to meaningful, measurable success indicators. Ability to sort out risk areas and problem solve and implement highly usable complete manufacturing systems. Experience Sr. Materials Technologist Intel Corporation May 2013  – Present (2 years 4 months) Semiconductor packaging material direct/indirect path finding and development. New methods to enable supply chain health and improve equipment integrated systems to bring new products to market quickly. Drive Cost reduction opportunities and achieve world class yield/quality and all other HVM metrics. Sr. Manager - TSV Test Development Amkor Technology October 2011  –  March 2013  (1 year 6 months) chandler, arizona 2.5D/3D Through Silicon Via package Test Manager driving Design for Test and implementing incremental test insertions points thorough assembly. Manufacturing flow and test resource definition through Final Test, reliability socketings and feedback with Failure Analysis necessary to drive package/product learning cycles and high yield with qualified high volumes to satisfy a wide product portfolio. Drive Test solutions for advanced packaging by close collaboration with customers and suppliers to enable and implement stacked die and interposer test methods. CTO, Owner Utecnic, LLC January 2011  –  October 2011  (10 months) Chandler, Arizona Custom small automation tool research, prototyping and generation of intellectual property for strategic packaged solutions. Sr. Technologist Intel Corporation March 1984  –  December 2010  (26 years 10 months) Chandler, Arizona Research, prototype, advanced packaging, manufacturing flow definition, dynamic simulation modeling, equipment modeling, supply chain development, package and tool design for high volume.. Resource definition, team builder, problem solver, innovator, material handling and lean manufacturing expertise. Integration of all assembly and test process steps, defect reduction, process control, metrology development and complete process development for multiple operations. Wafer saw and all associated equipment, laser mark, die coat, surface finish, electro plating, mulitp test handler development, burn in equipment, ink mark, traceability and vision system development. Customer interface, test and all finish operations. Material handling system, robot systems definition and design, Known Good Die equipment design. Involvement in all levels of certification and world wide factory transfer. New breakthrough systems and factory business process optimization. Significant cost reduction and bottom line contribution. Sr.Process Engineer Fairchild Semiconductor 1982  –  1984  (2 years) Semiconductor process and equipment development for motor controller PDIP assembly operations. Rotated ownership through process steps at Saw, Die Prep, Die Attach, Wire Bond, Injection Mold, Surface Treament, Wave Solder Trim and Form, Inspection and Shipping. Sr. Materials Technologist Intel Corporation May 2013  – Present (2 years 4 months) Semiconductor packaging material direct/indirect path finding and development. New methods to enable supply chain health and improve equipment integrated systems to bring new products to market quickly. Drive Cost reduction opportunities and achieve world class yield/quality and all other HVM metrics. Sr. Materials Technologist Intel Corporation May 2013  – Present (2 years 4 months) Semiconductor packaging material direct/indirect path finding and development. New methods to enable supply chain health and improve equipment integrated systems to bring new products to market quickly. Drive Cost reduction opportunities and achieve world class yield/quality and all other HVM metrics. Sr. Manager - TSV Test Development Amkor Technology October 2011  –  March 2013  (1 year 6 months) chandler, arizona 2.5D/3D Through Silicon Via package Test Manager driving Design for Test and implementing incremental test insertions points thorough assembly. Manufacturing flow and test resource definition through Final Test, reliability socketings and feedback with Failure Analysis necessary to drive package/product learning cycles and high yield with qualified high volumes to satisfy a wide product portfolio. Drive Test solutions for advanced packaging by close collaboration with customers and suppliers to enable and implement stacked die and interposer test methods. Sr. Manager - TSV Test Development Amkor Technology October 2011  –  March 2013  (1 year 6 months) chandler, arizona 2.5D/3D Through Silicon Via package Test Manager driving Design for Test and implementing incremental test insertions points thorough assembly. Manufacturing flow and test resource definition through Final Test, reliability socketings and feedback with Failure Analysis necessary to drive package/product learning cycles and high yield with qualified high volumes to satisfy a wide product portfolio. Drive Test solutions for advanced packaging by close collaboration with customers and suppliers to enable and implement stacked die and interposer test methods. CTO, Owner Utecnic, LLC January 2011  –  October 2011  (10 months) Chandler, Arizona Custom small automation tool research, prototyping and generation of intellectual property for strategic packaged solutions. CTO, Owner Utecnic, LLC January 2011  –  October 2011  (10 months) Chandler, Arizona Custom small automation tool research, prototyping and generation of intellectual property for strategic packaged solutions. Sr. Technologist Intel Corporation March 1984  –  December 2010  (26 years 10 months) Chandler, Arizona Research, prototype, advanced packaging, manufacturing flow definition, dynamic simulation modeling, equipment modeling, supply chain development, package and tool design for high volume.. Resource definition, team builder, problem solver, innovator, material handling and lean manufacturing expertise. Integration of all assembly and test process steps, defect reduction, process control, metrology development and complete process development for multiple operations. Wafer saw and all associated equipment, laser mark, die coat, surface finish, electro plating, mulitp test handler development, burn in equipment, ink mark, traceability and vision system development. Customer interface, test and all finish operations. Material handling system, robot systems definition and design, Known Good Die equipment design. Involvement in all levels of certification and world wide factory transfer. New breakthrough systems and factory business process optimization. Significant cost reduction and bottom line contribution. Sr. Technologist Intel Corporation March 1984  –  December 2010  (26 years 10 months) Chandler, Arizona Research, prototype, advanced packaging, manufacturing flow definition, dynamic simulation modeling, equipment modeling, supply chain development, package and tool design for high volume.. Resource definition, team builder, problem solver, innovator, material handling and lean manufacturing expertise. Integration of all assembly and test process steps, defect reduction, process control, metrology development and complete process development for multiple operations. Wafer saw and all associated equipment, laser mark, die coat, surface finish, electro plating, mulitp test handler development, burn in equipment, ink mark, traceability and vision system development. Customer interface, test and all finish operations. Material handling system, robot systems definition and design, Known Good Die equipment design. Involvement in all levels of certification and world wide factory transfer. New breakthrough systems and factory business process optimization. Significant cost reduction and bottom line contribution. Sr.Process Engineer Fairchild Semiconductor 1982  –  1984  (2 years) Semiconductor process and equipment development for motor controller PDIP assembly operations. Rotated ownership through process steps at Saw, Die Prep, Die Attach, Wire Bond, Injection Mold, Surface Treament, Wave Solder Trim and Form, Inspection and Shipping. Sr.Process Engineer Fairchild Semiconductor 1982  –  1984  (2 years) Semiconductor process and equipment development for motor controller PDIP assembly operations. Rotated ownership through process steps at Saw, Die Prep, Die Attach, Wire Bond, Injection Mold, Surface Treament, Wave Solder Trim and Form, Inspection and Shipping. Skills Engineering Metrology System Architecture Testing Engineering Management Lean Manufacturing Strategy Semiconductors Semiconductor Industry Supply Chain Management Automation Electronics Embedded Systems Failure Analysis Integration Manufacturing Process Simulation See 2+     See less Skills  Engineering Metrology System Architecture Testing Engineering Management Lean Manufacturing Strategy Semiconductors Semiconductor Industry Supply Chain Management Automation Electronics Embedded Systems Failure Analysis Integration Manufacturing Process Simulation See 2+     See less Engineering Metrology System Architecture Testing Engineering Management Lean Manufacturing Strategy Semiconductors Semiconductor Industry Supply Chain Management Automation Electronics Embedded Systems Failure Analysis Integration Manufacturing Process Simulation See 2+     See less Engineering Metrology System Architecture Testing Engineering Management Lean Manufacturing Strategy Semiconductors Semiconductor Industry Supply Chain Management Automation Electronics Embedded Systems Failure Analysis Integration Manufacturing Process Simulation See 2+     See less Education State University of New York College at Buffalo B.S.,  Electrical Technology 1978  – 1981 Activities and Societies:  IEEE State University of New York - Morrisville State College A.A.S.,  Electronics 1977  – 1979 State University of New York College at Buffalo B.S.,  Electrical Technology 1978  – 1981 Activities and Societies:  IEEE State University of New York College at Buffalo B.S.,  Electrical Technology 1978  – 1981 Activities and Societies:  IEEE State University of New York College at Buffalo B.S.,  Electrical Technology 1978  – 1981 Activities and Societies:  IEEE State University of New York - Morrisville State College A.A.S.,  Electronics 1977  – 1979 State University of New York - Morrisville State College A.A.S.,  Electronics 1977  – 1979 State University of New York - Morrisville State College A.A.S.,  Electronics 1977  – 1979 Honors & Awards Additional Honors & Awards Eagle Scout Additional Honors & Awards Eagle Scout Additional Honors & Awards Eagle Scout Additional Honors & Awards Eagle Scout ", "Experience Design Technologist Intel Corporation March 2015  – Present (6 months) Hillsboro, Oregon Rotation Engineer Intel Corporation September 2013  – Present (2 years) Hillsboro, Oregon Graduate Research Assistant Clemson University August 2009  –  2013  (4 years) Clemson, SC Design Technologist Intel Corporation March 2015  – Present (6 months) Hillsboro, Oregon Design Technologist Intel Corporation March 2015  – Present (6 months) Hillsboro, Oregon Rotation Engineer Intel Corporation September 2013  – Present (2 years) Hillsboro, Oregon Rotation Engineer Intel Corporation September 2013  – Present (2 years) Hillsboro, Oregon Graduate Research Assistant Clemson University August 2009  –  2013  (4 years) Clemson, SC Graduate Research Assistant Clemson University August 2009  –  2013  (4 years) Clemson, SC Skills Industrial Design Human Computer... Automotive Infotainment User Interface Design Unix C++ Woodworking Rapid Prototyping Python Web Development Web Design HTML 5 Sketching Human Factors Solidworks HTML See 1+     See less Skills  Industrial Design Human Computer... Automotive Infotainment User Interface Design Unix C++ Woodworking Rapid Prototyping Python Web Development Web Design HTML 5 Sketching Human Factors Solidworks HTML See 1+     See less Industrial Design Human Computer... Automotive Infotainment User Interface Design Unix C++ Woodworking Rapid Prototyping Python Web Development Web Design HTML 5 Sketching Human Factors Solidworks HTML See 1+     See less Industrial Design Human Computer... Automotive Infotainment User Interface Design Unix C++ Woodworking Rapid Prototyping Python Web Development Web Design HTML 5 Sketching Human Factors Solidworks HTML See 1+     See less Education Clemson University Doctorate of Human-Centered Computing 2009  – 2014 Focused on the design and development of multi-modal automotive user interfaces Auburn University Master of Industrial Design,  Culturally Relevant Product Design 2007  – 2009 Focused on developing an approach for designing culturally relevant products Auburn University Bachelor of Industrial Design,  Industrial and Product Design 2004  – 2007 Clemson University Doctorate of Human-Centered Computing 2009  – 2014 Focused on the design and development of multi-modal automotive user interfaces Clemson University Doctorate of Human-Centered Computing 2009  – 2014 Focused on the design and development of multi-modal automotive user interfaces Clemson University Doctorate of Human-Centered Computing 2009  – 2014 Focused on the design and development of multi-modal automotive user interfaces Auburn University Master of Industrial Design,  Culturally Relevant Product Design 2007  – 2009 Focused on developing an approach for designing culturally relevant products Auburn University Master of Industrial Design,  Culturally Relevant Product Design 2007  – 2009 Focused on developing an approach for designing culturally relevant products Auburn University Master of Industrial Design,  Culturally Relevant Product Design 2007  – 2009 Focused on developing an approach for designing culturally relevant products Auburn University Bachelor of Industrial Design,  Industrial and Product Design 2004  – 2007 Auburn University Bachelor of Industrial Design,  Industrial and Product Design 2004  – 2007 Auburn University Bachelor of Industrial Design,  Industrial and Product Design 2004  – 2007 ", "Skills High Performance... Storage Cloud Computing Distributed Systems Software Engineering Business Alliances Enterprise Software Integration Product Management Bash Solaris Data Center Server Architecture Storage Solutions Scalability Unix Go-to-market Strategy System Architecture SaaS File Systems Business Development Storage Area Networks Big Data Perl Operating Systems Device Drivers Infiniband Engineering Management Linux Hadoop Architecture Software Development Cluster Shell Scripting Virtualization Strategic Alliances NAS Systems Engineering High Availability Storage Virtualization See 25+     See less Skills  High Performance... Storage Cloud Computing Distributed Systems Software Engineering Business Alliances Enterprise Software Integration Product Management Bash Solaris Data Center Server Architecture Storage Solutions Scalability Unix Go-to-market Strategy System Architecture SaaS File Systems Business Development Storage Area Networks Big Data Perl Operating Systems Device Drivers Infiniband Engineering Management Linux Hadoop Architecture Software Development Cluster Shell Scripting Virtualization Strategic Alliances NAS Systems Engineering High Availability Storage Virtualization See 25+     See less High Performance... Storage Cloud Computing Distributed Systems Software Engineering Business Alliances Enterprise Software Integration Product Management Bash Solaris Data Center Server Architecture Storage Solutions Scalability Unix Go-to-market Strategy System Architecture SaaS File Systems Business Development Storage Area Networks Big Data Perl Operating Systems Device Drivers Infiniband Engineering Management Linux Hadoop Architecture Software Development Cluster Shell Scripting Virtualization Strategic Alliances NAS Systems Engineering High Availability Storage Virtualization See 25+     See less High Performance... Storage Cloud Computing Distributed Systems Software Engineering Business Alliances Enterprise Software Integration Product Management Bash Solaris Data Center Server Architecture Storage Solutions Scalability Unix Go-to-market Strategy System Architecture SaaS File Systems Business Development Storage Area Networks Big Data Perl Operating Systems Device Drivers Infiniband Engineering Management Linux Hadoop Architecture Software Development Cluster Shell Scripting Virtualization Strategic Alliances NAS Systems Engineering High Availability Storage Virtualization See 25+     See less ", "Skills Semiconductors Six Sigma Lean Manufacturing Design of Experiments Project Management Leadership Management Product Engineering Program Management Manufacturing Business Development SPC Process Engineering Testing Cross-functional Team... Engineering Management Engineering Process Improvement Continuous Improvement FMEA Product Development Semiconductor Industry Electronics Failure Analysis Lean Six Sigma See 10+     See less Skills  Semiconductors Six Sigma Lean Manufacturing Design of Experiments Project Management Leadership Management Product Engineering Program Management Manufacturing Business Development SPC Process Engineering Testing Cross-functional Team... Engineering Management Engineering Process Improvement Continuous Improvement FMEA Product Development Semiconductor Industry Electronics Failure Analysis Lean Six Sigma See 10+     See less Semiconductors Six Sigma Lean Manufacturing Design of Experiments Project Management Leadership Management Product Engineering Program Management Manufacturing Business Development SPC Process Engineering Testing Cross-functional Team... Engineering Management Engineering Process Improvement Continuous Improvement FMEA Product Development Semiconductor Industry Electronics Failure Analysis Lean Six Sigma See 10+     See less Semiconductors Six Sigma Lean Manufacturing Design of Experiments Project Management Leadership Management Product Engineering Program Management Manufacturing Business Development SPC Process Engineering Testing Cross-functional Team... Engineering Management Engineering Process Improvement Continuous Improvement FMEA Product Development Semiconductor Industry Electronics Failure Analysis Lean Six Sigma See 10+     See less ", "Summary Broad experience in chemical/gas process system management, project management, technology and process transfer, manufacturing process startup and improvement, product development, and process troubleshooting. Special expertise in: \n•\tProject management of global technical programs  \n•\tSupply chain analyses and Supplier Management \n•\tMaterial savings/Value Engineering for bulk chems & gases \n•\tQuality Control/Management of Chemical and Gas \n•\tChemical and Gas Process management \n•\tProcess startup, improvement, and optimization Summary Broad experience in chemical/gas process system management, project management, technology and process transfer, manufacturing process startup and improvement, product development, and process troubleshooting. Special expertise in: \n•\tProject management of global technical programs  \n•\tSupply chain analyses and Supplier Management \n•\tMaterial savings/Value Engineering for bulk chems & gases \n•\tQuality Control/Management of Chemical and Gas \n•\tChemical and Gas Process management \n•\tProcess startup, improvement, and optimization Broad experience in chemical/gas process system management, project management, technology and process transfer, manufacturing process startup and improvement, product development, and process troubleshooting. Special expertise in: \n•\tProject management of global technical programs  \n•\tSupply chain analyses and Supplier Management \n•\tMaterial savings/Value Engineering for bulk chems & gases \n•\tQuality Control/Management of Chemical and Gas \n•\tChemical and Gas Process management \n•\tProcess startup, improvement, and optimization Broad experience in chemical/gas process system management, project management, technology and process transfer, manufacturing process startup and improvement, product development, and process troubleshooting. Special expertise in: \n•\tProject management of global technical programs  \n•\tSupply chain analyses and Supplier Management \n•\tMaterial savings/Value Engineering for bulk chems & gases \n•\tQuality Control/Management of Chemical and Gas \n•\tChemical and Gas Process management \n•\tProcess startup, improvement, and optimization Experience Wet Etch SST Process Engineering Intel Corporation January 2014  – Present (1 year 8 months) Staff Technologist Intel Corporation January 2013  –  January 2014  (1 year 1 month) rio rancho, nm, usa Drive Cost and Productivity projects. Chemical & Gas Staff Technologist Intel Corporation August 2007  –  January 2013  (5 years 6 months) Dalian, Liaoning, China Technical owner for all chemicals and gas for Fab 68 (Dalian, China). This includes establishment of a Fab 68 POR list, identification of issues and resolving, and full ownership of the chemical and gas cost reduction road map. 4 years in Dalian China. :) Process Engineering Group Leader Intel Corporation October 2000  –  August 2007  (6 years 11 months) Process Engineering Group Leader responsible for area safety, sustaining, continuous improvement of quality/output/cost, process transfer, and synergy with the virtual factory. Production Manager Continental Carbon Company November 1999  –  October 2000  (1 year) Production Manager for Carbon Black plant. Responsible for all Operations activities, Capital Planning, process optimization. Global Implementation Engineer Cabot Corporation December 1991  –  August 1999  (7 years 9 months) Responsible for developing new carbon black manufacturing technologies and transferring them to new facilities, partnering with marketing to develop new grades of carbon black for specific applications, process optimization, implementation of SPC, reductions in variation, continuous process improvement, process troubleshooting, identifying and implementing Capital Projects. Senior Maintainability Engineer Martin Marietta Astronautics Group August 1985  –  December 1991  (6 years 5 months) Maintainability and Logistics specialist. Projects included Peacekeeper program, Titan II/Titan III/Titan IV programs, and Titan IV Launch Complex 40 Project. Concentration was maining on mechanical components on projects and programs. Wet Etch SST Process Engineering Intel Corporation January 2014  – Present (1 year 8 months) Wet Etch SST Process Engineering Intel Corporation January 2014  – Present (1 year 8 months) Staff Technologist Intel Corporation January 2013  –  January 2014  (1 year 1 month) rio rancho, nm, usa Drive Cost and Productivity projects. Staff Technologist Intel Corporation January 2013  –  January 2014  (1 year 1 month) rio rancho, nm, usa Drive Cost and Productivity projects. Chemical & Gas Staff Technologist Intel Corporation August 2007  –  January 2013  (5 years 6 months) Dalian, Liaoning, China Technical owner for all chemicals and gas for Fab 68 (Dalian, China). This includes establishment of a Fab 68 POR list, identification of issues and resolving, and full ownership of the chemical and gas cost reduction road map. 4 years in Dalian China. :) Chemical & Gas Staff Technologist Intel Corporation August 2007  –  January 2013  (5 years 6 months) Dalian, Liaoning, China Technical owner for all chemicals and gas for Fab 68 (Dalian, China). This includes establishment of a Fab 68 POR list, identification of issues and resolving, and full ownership of the chemical and gas cost reduction road map. 4 years in Dalian China. :) Process Engineering Group Leader Intel Corporation October 2000  –  August 2007  (6 years 11 months) Process Engineering Group Leader responsible for area safety, sustaining, continuous improvement of quality/output/cost, process transfer, and synergy with the virtual factory. Process Engineering Group Leader Intel Corporation October 2000  –  August 2007  (6 years 11 months) Process Engineering Group Leader responsible for area safety, sustaining, continuous improvement of quality/output/cost, process transfer, and synergy with the virtual factory. Production Manager Continental Carbon Company November 1999  –  October 2000  (1 year) Production Manager for Carbon Black plant. Responsible for all Operations activities, Capital Planning, process optimization. Production Manager Continental Carbon Company November 1999  –  October 2000  (1 year) Production Manager for Carbon Black plant. Responsible for all Operations activities, Capital Planning, process optimization. Global Implementation Engineer Cabot Corporation December 1991  –  August 1999  (7 years 9 months) Responsible for developing new carbon black manufacturing technologies and transferring them to new facilities, partnering with marketing to develop new grades of carbon black for specific applications, process optimization, implementation of SPC, reductions in variation, continuous process improvement, process troubleshooting, identifying and implementing Capital Projects. Global Implementation Engineer Cabot Corporation December 1991  –  August 1999  (7 years 9 months) Responsible for developing new carbon black manufacturing technologies and transferring them to new facilities, partnering with marketing to develop new grades of carbon black for specific applications, process optimization, implementation of SPC, reductions in variation, continuous process improvement, process troubleshooting, identifying and implementing Capital Projects. Senior Maintainability Engineer Martin Marietta Astronautics Group August 1985  –  December 1991  (6 years 5 months) Maintainability and Logistics specialist. Projects included Peacekeeper program, Titan II/Titan III/Titan IV programs, and Titan IV Launch Complex 40 Project. Concentration was maining on mechanical components on projects and programs. Senior Maintainability Engineer Martin Marietta Astronautics Group August 1985  –  December 1991  (6 years 5 months) Maintainability and Logistics specialist. Projects included Peacekeeper program, Titan II/Titan III/Titan IV programs, and Titan IV Launch Complex 40 Project. Concentration was maining on mechanical components on projects and programs. Languages Chinese (limited Mandarin) Chinese (limited Mandarin) Chinese (limited Mandarin) Skills Semiconductors Design of Experiments JMP SPC Process Engineering Thin Films Characterization Chemical Engineering Process Simulation Engineering Management CVD Metrology Materials Science Process Integration Manufacturing Engineering Failure Analysis PVD Semiconductor Industry Lean Manufacturing Cross-functional Team... Six Sigma Program Management Troubleshooting Materials Continuous Improvement R&D Product Development Intel Yield Etching Photolithography Plasma Etch Lithography PECVD IC Process Optimization Process Control Simulations Product Engineering Electronics Semiconductor Process Polymers Photovoltaics Factory See 30+     See less Skills  Semiconductors Design of Experiments JMP SPC Process Engineering Thin Films Characterization Chemical Engineering Process Simulation Engineering Management CVD Metrology Materials Science Process Integration Manufacturing Engineering Failure Analysis PVD Semiconductor Industry Lean Manufacturing Cross-functional Team... Six Sigma Program Management Troubleshooting Materials Continuous Improvement R&D Product Development Intel Yield Etching Photolithography Plasma Etch Lithography PECVD IC Process Optimization Process Control Simulations Product Engineering Electronics Semiconductor Process Polymers Photovoltaics Factory See 30+     See less Semiconductors Design of Experiments JMP SPC Process Engineering Thin Films Characterization Chemical Engineering Process Simulation Engineering Management CVD Metrology Materials Science Process Integration Manufacturing Engineering Failure Analysis PVD Semiconductor Industry Lean Manufacturing Cross-functional Team... Six Sigma Program Management Troubleshooting Materials Continuous Improvement R&D Product Development Intel Yield Etching Photolithography Plasma Etch Lithography PECVD IC Process Optimization Process Control Simulations Product Engineering Electronics Semiconductor Process Polymers Photovoltaics Factory See 30+     See less Semiconductors Design of Experiments JMP SPC Process Engineering Thin Films Characterization Chemical Engineering Process Simulation Engineering Management CVD Metrology Materials Science Process Integration Manufacturing Engineering Failure Analysis PVD Semiconductor Industry Lean Manufacturing Cross-functional Team... Six Sigma Program Management Troubleshooting Materials Continuous Improvement R&D Product Development Intel Yield Etching Photolithography Plasma Etch Lithography PECVD IC Process Optimization Process Control Simulations Product Engineering Electronics Semiconductor Process Polymers Photovoltaics Factory See 30+     See less Education Colorado School of Mines BSChE,  Chemical Engineering 1980  – 1985 Activities and Societies:  AIChE ,  Sigma Phi Epsilon Fraternity Colorado School of Mines BSChE,  Chemical Engineering 1980  – 1985 Activities and Societies:  AIChE ,  Sigma Phi Epsilon Fraternity Colorado School of Mines BSChE,  Chemical Engineering 1980  – 1985 Activities and Societies:  AIChE ,  Sigma Phi Epsilon Fraternity Colorado School of Mines BSChE,  Chemical Engineering 1980  – 1985 Activities and Societies:  AIChE ,  Sigma Phi Epsilon Fraternity ", "Summary Detailed oriented Analog and RF Circuit/System Design Engineer, worked up to 60GHz, i.e. V band, with over 20 years professional experience in design and engineering management. Strong design experience in mixed (analog and digital) signals, RF (passive and active) circuits, Optical devices and circuit/system level design with RF/High Speed packaging, signal integrity and antenna design. Experienced in testing, analyzing, researching, device modeling and simulations also good working knowledge in Verilog and DFT. Summary Detailed oriented Analog and RF Circuit/System Design Engineer, worked up to 60GHz, i.e. V band, with over 20 years professional experience in design and engineering management. Strong design experience in mixed (analog and digital) signals, RF (passive and active) circuits, Optical devices and circuit/system level design with RF/High Speed packaging, signal integrity and antenna design. Experienced in testing, analyzing, researching, device modeling and simulations also good working knowledge in Verilog and DFT. Detailed oriented Analog and RF Circuit/System Design Engineer, worked up to 60GHz, i.e. V band, with over 20 years professional experience in design and engineering management. Strong design experience in mixed (analog and digital) signals, RF (passive and active) circuits, Optical devices and circuit/system level design with RF/High Speed packaging, signal integrity and antenna design. Experienced in testing, analyzing, researching, device modeling and simulations also good working knowledge in Verilog and DFT. Detailed oriented Analog and RF Circuit/System Design Engineer, worked up to 60GHz, i.e. V band, with over 20 years professional experience in design and engineering management. Strong design experience in mixed (analog and digital) signals, RF (passive and active) circuits, Optical devices and circuit/system level design with RF/High Speed packaging, signal integrity and antenna design. Experienced in testing, analyzing, researching, device modeling and simulations also good working knowledge in Verilog and DFT. Experience Sr. Staff RF Engineer/Technologist Intel Corporation 2003  – Present (12 years) Folsom Sr. Staff RF Engineer/Technologist Intel Corporation 2003  – Present (12 years) Folsom Sr. Staff RF Engineer/Technologist Intel Corporation 2003  – Present (12 years) Folsom Skills RF Engineering Antennas Signal Integrity System Architecture Hardware Architecture Optical Communications Technology Integration Technological Innovation RF WiFi IC Microwave Analog Wireless Semiconductors Engineering Management Testing Electronics Agilent ADS RF design HFSS Network Analyzer Spectrum Analyzer BERT High Speed Interfaces Microcontrollers Sensors PLL Analog Circuit Design Circuit Design RF Design See 16+     See less Skills  RF Engineering Antennas Signal Integrity System Architecture Hardware Architecture Optical Communications Technology Integration Technological Innovation RF WiFi IC Microwave Analog Wireless Semiconductors Engineering Management Testing Electronics Agilent ADS RF design HFSS Network Analyzer Spectrum Analyzer BERT High Speed Interfaces Microcontrollers Sensors PLL Analog Circuit Design Circuit Design RF Design See 16+     See less RF Engineering Antennas Signal Integrity System Architecture Hardware Architecture Optical Communications Technology Integration Technological Innovation RF WiFi IC Microwave Analog Wireless Semiconductors Engineering Management Testing Electronics Agilent ADS RF design HFSS Network Analyzer Spectrum Analyzer BERT High Speed Interfaces Microcontrollers Sensors PLL Analog Circuit Design Circuit Design RF Design See 16+     See less RF Engineering Antennas Signal Integrity System Architecture Hardware Architecture Optical Communications Technology Integration Technological Innovation RF WiFi IC Microwave Analog Wireless Semiconductors Engineering Management Testing Electronics Agilent ADS RF design HFSS Network Analyzer Spectrum Analyzer BERT High Speed Interfaces Microcontrollers Sensors PLL Analog Circuit Design Circuit Design RF Design See 16+     See less ", "Experience Staff Materials Engineer/Materials Technologist Intel Corporation 2007  – Present (8 years) Chandler, AZ Responsible for overseeing organization’s pathfinding programs in the areas of chip attach, ball attach, encapsulants, die prep, and thermal materials along with external research programs. Developed low temperature solder paste for top side ball attach and bottom side ball attach. Led collaborative effort to development low temperature solders for first level interconnect. Facilitated the initiation of 10 new research programs that have since been aligned to current developmental platforms. Oversaw groups’ university research programs by identifying gaps in current materials roadmap and isolating professors skilled in those areas for collaborative research programs. \n Materials Group Leader Intel 2003  –  2007  (4 years) Chandler, AZ Managed the activities of four engineers that oversaw the supplier development and certification for all thermal interface materials (TIMs) and heat spreader attach fluxes at Intel. Ramped supplier base (TIM and flux) for first solder thermal interface material in an Intel package. Member of Intel’s Thermal-Mechanical intellectual property committee (20 members total) that determined which ideas should be patented by Intel. Senior Materials Engineer Intel 2000  –  2003  (3 years) Chandler, AZ Led multidisciplinary team that developed indium solder thermal interface material technology (solder, flux, BSM and lid metallization). Received Intel Achievement Award for reducing Heat Spreader Cost (30 million dollar cost savings) and driving IP protection. Research Scientist Olin Corporation 1996  –  2000  (4 years) New Haven, CT Developed two commercially available copper alloys (C663 - low cost Phosphor Bronze Replacement Alloy, C662 – A Stress Relaxation Resistant Brass Alloy). Assisted in the transition of alloy C663 from research alloy to commercial product. Oversaw Copper Alloy Mechanical Test Facility for Olin Metals Research Lab Graduate Research Assistant Univerisity of Illinois 1990  –  1996  (6 years) Directed collaborative project to produce and evaluate a new family of flake reinforced cast aluminum alloy matrix composites Co-op Engineer General Electric 1987  –  1990  (3 years) Staff Materials Engineer/Materials Technologist Intel Corporation 2007  – Present (8 years) Chandler, AZ Responsible for overseeing organization’s pathfinding programs in the areas of chip attach, ball attach, encapsulants, die prep, and thermal materials along with external research programs. Developed low temperature solder paste for top side ball attach and bottom side ball attach. Led collaborative effort to development low temperature solders for first level interconnect. Facilitated the initiation of 10 new research programs that have since been aligned to current developmental platforms. Oversaw groups’ university research programs by identifying gaps in current materials roadmap and isolating professors skilled in those areas for collaborative research programs. \n Staff Materials Engineer/Materials Technologist Intel Corporation 2007  – Present (8 years) Chandler, AZ Responsible for overseeing organization’s pathfinding programs in the areas of chip attach, ball attach, encapsulants, die prep, and thermal materials along with external research programs. Developed low temperature solder paste for top side ball attach and bottom side ball attach. Led collaborative effort to development low temperature solders for first level interconnect. Facilitated the initiation of 10 new research programs that have since been aligned to current developmental platforms. Oversaw groups’ university research programs by identifying gaps in current materials roadmap and isolating professors skilled in those areas for collaborative research programs. \n Materials Group Leader Intel 2003  –  2007  (4 years) Chandler, AZ Managed the activities of four engineers that oversaw the supplier development and certification for all thermal interface materials (TIMs) and heat spreader attach fluxes at Intel. Ramped supplier base (TIM and flux) for first solder thermal interface material in an Intel package. Member of Intel’s Thermal-Mechanical intellectual property committee (20 members total) that determined which ideas should be patented by Intel. Materials Group Leader Intel 2003  –  2007  (4 years) Chandler, AZ Managed the activities of four engineers that oversaw the supplier development and certification for all thermal interface materials (TIMs) and heat spreader attach fluxes at Intel. Ramped supplier base (TIM and flux) for first solder thermal interface material in an Intel package. Member of Intel’s Thermal-Mechanical intellectual property committee (20 members total) that determined which ideas should be patented by Intel. Senior Materials Engineer Intel 2000  –  2003  (3 years) Chandler, AZ Led multidisciplinary team that developed indium solder thermal interface material technology (solder, flux, BSM and lid metallization). Received Intel Achievement Award for reducing Heat Spreader Cost (30 million dollar cost savings) and driving IP protection. Senior Materials Engineer Intel 2000  –  2003  (3 years) Chandler, AZ Led multidisciplinary team that developed indium solder thermal interface material technology (solder, flux, BSM and lid metallization). Received Intel Achievement Award for reducing Heat Spreader Cost (30 million dollar cost savings) and driving IP protection. Research Scientist Olin Corporation 1996  –  2000  (4 years) New Haven, CT Developed two commercially available copper alloys (C663 - low cost Phosphor Bronze Replacement Alloy, C662 – A Stress Relaxation Resistant Brass Alloy). Assisted in the transition of alloy C663 from research alloy to commercial product. Oversaw Copper Alloy Mechanical Test Facility for Olin Metals Research Lab Research Scientist Olin Corporation 1996  –  2000  (4 years) New Haven, CT Developed two commercially available copper alloys (C663 - low cost Phosphor Bronze Replacement Alloy, C662 – A Stress Relaxation Resistant Brass Alloy). Assisted in the transition of alloy C663 from research alloy to commercial product. Oversaw Copper Alloy Mechanical Test Facility for Olin Metals Research Lab Graduate Research Assistant Univerisity of Illinois 1990  –  1996  (6 years) Directed collaborative project to produce and evaluate a new family of flake reinforced cast aluminum alloy matrix composites Graduate Research Assistant Univerisity of Illinois 1990  –  1996  (6 years) Directed collaborative project to produce and evaluate a new family of flake reinforced cast aluminum alloy matrix composites Co-op Engineer General Electric 1987  –  1990  (3 years) Co-op Engineer General Electric 1987  –  1990  (3 years) Skills Failure Analysis Design of Experiments Characterization Materials Science Nanomaterials Semiconductor... JMP Technology Development FMEA Electronics Packaging Metallurgy Metals Thermal Interface Metal Fabrication Semiconductors Optics Engineering Management Process Simulation Thin Films CVD Silicon Composites Root Cause Analysis Manufacturing Lean Manufacturing Process Engineering Finite Element Analysis Testing Engineering Nanotechnology TEM Thermal Sputtering Photolithography Materials Metrology Scanning Electron... PVD Spectroscopy EDX Thermal Analysis Reliability Simulations Product Engineering Process Integration Powder X-ray Diffraction R&D Electronics MEMS Alloys See 35+     See less Skills  Failure Analysis Design of Experiments Characterization Materials Science Nanomaterials Semiconductor... JMP Technology Development FMEA Electronics Packaging Metallurgy Metals Thermal Interface Metal Fabrication Semiconductors Optics Engineering Management Process Simulation Thin Films CVD Silicon Composites Root Cause Analysis Manufacturing Lean Manufacturing Process Engineering Finite Element Analysis Testing Engineering Nanotechnology TEM Thermal Sputtering Photolithography Materials Metrology Scanning Electron... PVD Spectroscopy EDX Thermal Analysis Reliability Simulations Product Engineering Process Integration Powder X-ray Diffraction R&D Electronics MEMS Alloys See 35+     See less Failure Analysis Design of Experiments Characterization Materials Science Nanomaterials Semiconductor... JMP Technology Development FMEA Electronics Packaging Metallurgy Metals Thermal Interface Metal Fabrication Semiconductors Optics Engineering Management Process Simulation Thin Films CVD Silicon Composites Root Cause Analysis Manufacturing Lean Manufacturing Process Engineering Finite Element Analysis Testing Engineering Nanotechnology TEM Thermal Sputtering Photolithography Materials Metrology Scanning Electron... PVD Spectroscopy EDX Thermal Analysis Reliability Simulations Product Engineering Process Integration Powder X-ray Diffraction R&D Electronics MEMS Alloys See 35+     See less Failure Analysis Design of Experiments Characterization Materials Science Nanomaterials Semiconductor... JMP Technology Development FMEA Electronics Packaging Metallurgy Metals Thermal Interface Metal Fabrication Semiconductors Optics Engineering Management Process Simulation Thin Films CVD Silicon Composites Root Cause Analysis Manufacturing Lean Manufacturing Process Engineering Finite Element Analysis Testing Engineering Nanotechnology TEM Thermal Sputtering Photolithography Materials Metrology Scanning Electron... PVD Spectroscopy EDX Thermal Analysis Reliability Simulations Product Engineering Process Integration Powder X-ray Diffraction R&D Electronics MEMS Alloys See 35+     See less Education University of Illinois at Urbana-Champaign Ph.D.,  Materials Science and Engineering 1990  – 1996 University of Cincinnati B.S.,  Metallurgical Engineering 1985  – 1990 University of Illinois at Urbana-Champaign Ph.D.,  Materials Science and Engineering 1990  – 1996 University of Illinois at Urbana-Champaign Ph.D.,  Materials Science and Engineering 1990  – 1996 University of Illinois at Urbana-Champaign Ph.D.,  Materials Science and Engineering 1990  – 1996 University of Cincinnati B.S.,  Metallurgical Engineering 1985  – 1990 University of Cincinnati B.S.,  Metallurgical Engineering 1985  – 1990 University of Cincinnati B.S.,  Metallurgical Engineering 1985  – 1990 Honors & Awards Additional Honors & Awards Intel Achievement Award - 2002, TMG Excellence Award (2003, 2009, 2011) Additional Honors & Awards Intel Achievement Award - 2002, TMG Excellence Award (2003, 2009, 2011) Additional Honors & Awards Intel Achievement Award - 2002, TMG Excellence Award (2003, 2009, 2011) Additional Honors & Awards Intel Achievement Award - 2002, TMG Excellence Award (2003, 2009, 2011) ", "Languages English Full professional proficiency Marathi Full professional proficiency Hindi Full professional proficiency English Full professional proficiency Marathi Full professional proficiency Hindi Full professional proficiency English Full professional proficiency Marathi Full professional proficiency Hindi Full professional proficiency Full professional proficiency Full professional proficiency Full professional proficiency Skills Skills     Education Rensselaer Polytechnic Institute PhD,  Materials Science 1999  – 2004 Research on carbon nanotubes, nanocomposites, composite architectures University of Central Florida MS,  Materials Science 1998  – 2000 Research at the Florida Solar Energy Center, Cocoa, FL, on photovoltaic reliability College of Engineering Pune BE,  Materials Science 1992  – 1997 Research project at the National Chemical Laboratories, Pune, India, on magnetic ceramic synthesis, characterization Rensselaer Polytechnic Institute PhD,  Materials Science 1999  – 2004 Research on carbon nanotubes, nanocomposites, composite architectures Rensselaer Polytechnic Institute PhD,  Materials Science 1999  – 2004 Research on carbon nanotubes, nanocomposites, composite architectures Rensselaer Polytechnic Institute PhD,  Materials Science 1999  – 2004 Research on carbon nanotubes, nanocomposites, composite architectures University of Central Florida MS,  Materials Science 1998  – 2000 Research at the Florida Solar Energy Center, Cocoa, FL, on photovoltaic reliability University of Central Florida MS,  Materials Science 1998  – 2000 Research at the Florida Solar Energy Center, Cocoa, FL, on photovoltaic reliability University of Central Florida MS,  Materials Science 1998  – 2000 Research at the Florida Solar Energy Center, Cocoa, FL, on photovoltaic reliability College of Engineering Pune BE,  Materials Science 1992  – 1997 Research project at the National Chemical Laboratories, Pune, India, on magnetic ceramic synthesis, characterization College of Engineering Pune BE,  Materials Science 1992  – 1997 Research project at the National Chemical Laboratories, Pune, India, on magnetic ceramic synthesis, characterization College of Engineering Pune BE,  Materials Science 1992  – 1997 Research project at the National Chemical Laboratories, Pune, India, on magnetic ceramic synthesis, characterization ", "Skills Cross-functional Team... Testing Program Management Product Management Manufacturing Mobile Devices Telecommunications Process Improvement Engineering Project Management Quality Management Product Lifecycle... Reliability Test SPC Supplier Quality CM/JDM/ODM Quality DFX, FMEA Electronics Integration Engineering Management See 5+     See less Skills  Cross-functional Team... Testing Program Management Product Management Manufacturing Mobile Devices Telecommunications Process Improvement Engineering Project Management Quality Management Product Lifecycle... Reliability Test SPC Supplier Quality CM/JDM/ODM Quality DFX, FMEA Electronics Integration Engineering Management See 5+     See less Cross-functional Team... Testing Program Management Product Management Manufacturing Mobile Devices Telecommunications Process Improvement Engineering Project Management Quality Management Product Lifecycle... Reliability Test SPC Supplier Quality CM/JDM/ODM Quality DFX, FMEA Electronics Integration Engineering Management See 5+     See less Cross-functional Team... Testing Program Management Product Management Manufacturing Mobile Devices Telecommunications Process Improvement Engineering Project Management Quality Management Product Lifecycle... Reliability Test SPC Supplier Quality CM/JDM/ODM Quality DFX, FMEA Electronics Integration Engineering Management See 5+     See less ", "Summary 14nm Frond End Integration \nHigh k Metal Gate integration \nPoly, MOS, and Contact integration \nElectrical Characterizations \nCMOS \nFlash Memory \nDiffusion Furnace \nRTA \n \nSpecialties: Semiconductor processing Summary 14nm Frond End Integration \nHigh k Metal Gate integration \nPoly, MOS, and Contact integration \nElectrical Characterizations \nCMOS \nFlash Memory \nDiffusion Furnace \nRTA \n \nSpecialties: Semiconductor processing 14nm Frond End Integration \nHigh k Metal Gate integration \nPoly, MOS, and Contact integration \nElectrical Characterizations \nCMOS \nFlash Memory \nDiffusion Furnace \nRTA \n \nSpecialties: Semiconductor processing 14nm Frond End Integration \nHigh k Metal Gate integration \nPoly, MOS, and Contact integration \nElectrical Characterizations \nCMOS \nFlash Memory \nDiffusion Furnace \nRTA \n \nSpecialties: Semiconductor processing Experience Process Integration Sr. Staff Technologist Intel January 2015  – Present (8 months) Hillsboro, Oregon, USA Sr. Staff Integration Technologist Integration Engineering Manager Intel China, Fab68 September 2012  –  December 2014  (2 years 4 months) Dalian, Liaoning, China Integration Solution Manager at Technology and Strategy Office Integration Staff Technologist Intel Corporation, Fab11X June 2011  –  August 2012  (1 year 3 months) New Maxico, USA Integration Staff Technologist Integration Staff Technologist Intel Corporation, Fab68 February 2010  –  May 2011  (1 year 4 months) Dalian, Liaoning, China Integration Staff Technologist Integration Staff Technologist Intel Corporation, Fab12 April 2008  –  January 2010  (1 year 10 months) Chandler, Arizona, USA Integration Staff Technologist Senior Process Engineer Intel Corporation, CTM D2 September 2004  –  March 2008  (3 years 7 months) Santa Clara, California, USA Thermal process optimization  \nRapid thermal process \nFurnace  \n45nm Flash development \n65nm Flash development Process Integration Sr. Staff Technologist Intel January 2015  – Present (8 months) Hillsboro, Oregon, USA Sr. Staff Integration Technologist Process Integration Sr. Staff Technologist Intel January 2015  – Present (8 months) Hillsboro, Oregon, USA Sr. Staff Integration Technologist Integration Engineering Manager Intel China, Fab68 September 2012  –  December 2014  (2 years 4 months) Dalian, Liaoning, China Integration Solution Manager at Technology and Strategy Office Integration Engineering Manager Intel China, Fab68 September 2012  –  December 2014  (2 years 4 months) Dalian, Liaoning, China Integration Solution Manager at Technology and Strategy Office Integration Staff Technologist Intel Corporation, Fab11X June 2011  –  August 2012  (1 year 3 months) New Maxico, USA Integration Staff Technologist Integration Staff Technologist Intel Corporation, Fab11X June 2011  –  August 2012  (1 year 3 months) New Maxico, USA Integration Staff Technologist Integration Staff Technologist Intel Corporation, Fab68 February 2010  –  May 2011  (1 year 4 months) Dalian, Liaoning, China Integration Staff Technologist Integration Staff Technologist Intel Corporation, Fab68 February 2010  –  May 2011  (1 year 4 months) Dalian, Liaoning, China Integration Staff Technologist Integration Staff Technologist Intel Corporation, Fab12 April 2008  –  January 2010  (1 year 10 months) Chandler, Arizona, USA Integration Staff Technologist Integration Staff Technologist Intel Corporation, Fab12 April 2008  –  January 2010  (1 year 10 months) Chandler, Arizona, USA Integration Staff Technologist Senior Process Engineer Intel Corporation, CTM D2 September 2004  –  March 2008  (3 years 7 months) Santa Clara, California, USA Thermal process optimization  \nRapid thermal process \nFurnace  \n45nm Flash development \n65nm Flash development Senior Process Engineer Intel Corporation, CTM D2 September 2004  –  March 2008  (3 years 7 months) Santa Clara, California, USA Thermal process optimization  \nRapid thermal process \nFurnace  \n45nm Flash development \n65nm Flash development Languages English Mandarin English Mandarin English Mandarin Skills Semiconductors Process Integration Silicon JMP CMOS Thin Films Metrology Semiconductor Industry Design of Experiments SPC Intel IC Characterization Failure Analysis Process Simulation CVD PVD Simulations Reliability Product Engineering See 5+     See less Skills  Semiconductors Process Integration Silicon JMP CMOS Thin Films Metrology Semiconductor Industry Design of Experiments SPC Intel IC Characterization Failure Analysis Process Simulation CVD PVD Simulations Reliability Product Engineering See 5+     See less Semiconductors Process Integration Silicon JMP CMOS Thin Films Metrology Semiconductor Industry Design of Experiments SPC Intel IC Characterization Failure Analysis Process Simulation CVD PVD Simulations Reliability Product Engineering See 5+     See less Semiconductors Process Integration Silicon JMP CMOS Thin Films Metrology Semiconductor Industry Design of Experiments SPC Intel IC Characterization Failure Analysis Process Simulation CVD PVD Simulations Reliability Product Engineering See 5+     See less Education Texas A&M University Ph.D.,  Chemical Engineering 1999  – 2004 Columbia University in the City of New York M.S.,  Chemical Engineering 1997  – 1998 National Taiwan University B.S.,  Chemical Engineering 1990  – 1997 Texas A&M University Ph.D.,  Chemical Engineering 1999  – 2004 Texas A&M University Ph.D.,  Chemical Engineering 1999  – 2004 Texas A&M University Ph.D.,  Chemical Engineering 1999  – 2004 Columbia University in the City of New York M.S.,  Chemical Engineering 1997  – 1998 Columbia University in the City of New York M.S.,  Chemical Engineering 1997  – 1998 Columbia University in the City of New York M.S.,  Chemical Engineering 1997  – 1998 National Taiwan University B.S.,  Chemical Engineering 1990  – 1997 National Taiwan University B.S.,  Chemical Engineering 1990  – 1997 National Taiwan University B.S.,  Chemical Engineering 1990  – 1997 ", "Languages English Native or bilingual proficiency Hebrew Full professional proficiency English Native or bilingual proficiency Hebrew Full professional proficiency English Native or bilingual proficiency Hebrew Full professional proficiency Native or bilingual proficiency Full professional proficiency Skills C++ Software Design Software Development Software Engineering Enterprise Software Programming Operating Systems Distributed Systems Object Oriented Design Management Architecture Product Development Algorithms C Agile Methodologies Product Marketing Leadership Multithreading Architectures See 4+     See less Skills  C++ Software Design Software Development Software Engineering Enterprise Software Programming Operating Systems Distributed Systems Object Oriented Design Management Architecture Product Development Algorithms C Agile Methodologies Product Marketing Leadership Multithreading Architectures See 4+     See less C++ Software Design Software Development Software Engineering Enterprise Software Programming Operating Systems Distributed Systems Object Oriented Design Management Architecture Product Development Algorithms C Agile Methodologies Product Marketing Leadership Multithreading Architectures See 4+     See less C++ Software Design Software Development Software Engineering Enterprise Software Programming Operating Systems Distributed Systems Object Oriented Design Management Architecture Product Development Algorithms C Agile Methodologies Product Marketing Leadership Multithreading Architectures See 4+     See less ", "Summary Dr. Min specializes in intellectual property law, with a focus on patent preparation and prosecution in the fields of clean technology, electronics & semiconductors, and nanotechnology. Before attending law school, he worked as a process integration engineer, nanotechnologist, and advanced memory research technologist for Intel Corporation. Dr. Min was a key contributor in the development of the industry-leading 20 nm NAND flash technology by Intel Corp. and Micron Technology, for which the companies were awarded the prestigious Semiconductor of the Year Award in 2012 by UBM Techinsights. Dr. Min holds over fourteen patents and has authored nineteen journal publications. Specialties:1. Emerging nonvolatile memory technolgies, flash memory technology, semiconductor device & process technologies, nanotechnology,  \n2. IEEE Senior Member since 2010. \n3. Registered to practice before the United States Patent and Trademark Office (Reg. #67,249) Summary Dr. Min specializes in intellectual property law, with a focus on patent preparation and prosecution in the fields of clean technology, electronics & semiconductors, and nanotechnology. Before attending law school, he worked as a process integration engineer, nanotechnologist, and advanced memory research technologist for Intel Corporation. Dr. Min was a key contributor in the development of the industry-leading 20 nm NAND flash technology by Intel Corp. and Micron Technology, for which the companies were awarded the prestigious Semiconductor of the Year Award in 2012 by UBM Techinsights. Dr. Min holds over fourteen patents and has authored nineteen journal publications. Specialties:1. Emerging nonvolatile memory technolgies, flash memory technology, semiconductor device & process technologies, nanotechnology,  \n2. IEEE Senior Member since 2010. \n3. Registered to practice before the United States Patent and Trademark Office (Reg. #67,249) Dr. Min specializes in intellectual property law, with a focus on patent preparation and prosecution in the fields of clean technology, electronics & semiconductors, and nanotechnology. Before attending law school, he worked as a process integration engineer, nanotechnologist, and advanced memory research technologist for Intel Corporation. Dr. Min was a key contributor in the development of the industry-leading 20 nm NAND flash technology by Intel Corp. and Micron Technology, for which the companies were awarded the prestigious Semiconductor of the Year Award in 2012 by UBM Techinsights. Dr. Min holds over fourteen patents and has authored nineteen journal publications. Specialties:1. Emerging nonvolatile memory technolgies, flash memory technology, semiconductor device & process technologies, nanotechnology,  \n2. IEEE Senior Member since 2010. \n3. Registered to practice before the United States Patent and Trademark Office (Reg. #67,249) Dr. Min specializes in intellectual property law, with a focus on patent preparation and prosecution in the fields of clean technology, electronics & semiconductors, and nanotechnology. Before attending law school, he worked as a process integration engineer, nanotechnologist, and advanced memory research technologist for Intel Corporation. Dr. Min was a key contributor in the development of the industry-leading 20 nm NAND flash technology by Intel Corp. and Micron Technology, for which the companies were awarded the prestigious Semiconductor of the Year Award in 2012 by UBM Techinsights. Dr. Min holds over fourteen patents and has authored nineteen journal publications. Specialties:1. Emerging nonvolatile memory technolgies, flash memory technology, semiconductor device & process technologies, nanotechnology,  \n2. IEEE Senior Member since 2010. \n3. Registered to practice before the United States Patent and Trademark Office (Reg. #67,249) Experience Attorney at Law Knobbe Martens Olson & Bear LLP November 2012  – Present (2 years 10 months) San Francisco Bay Area Dr. Min specializes in intellectual property law, with a focus on patent preparation and prosecution in the fields of clean technology, electronics & semiconductors, and nanotechnology. Memory Research Technologist Intel Corporation August 2008  –  January 2013  (4 years 6 months) Responsible for research of disruptive technologies to replace volatile and nonvolatile memory for lithographic nodes beyond 10 nm. Responsibilities include technology evaluation of memory concepts based on resistance change (phase change memory, resistance change memory, etc) and directing company-funded state-of-the-art external memory research activities at universities and consortia. Nonvolatile Memory Pathfinding Technologist Intel Corporation January 2006  –  August 2008  (2 years 8 months) Boise, Idaho Area Responsible for development of disruptive flash memory technology for lithographic nodes beyond 20 nm. Technical responsibilities included memory cell design and process integration of advanced charge storage nodes including high K and metal gate integration. Attorney at Law Knobbe Martens Olson & Bear LLP November 2012  – Present (2 years 10 months) San Francisco Bay Area Dr. Min specializes in intellectual property law, with a focus on patent preparation and prosecution in the fields of clean technology, electronics & semiconductors, and nanotechnology. Attorney at Law Knobbe Martens Olson & Bear LLP November 2012  – Present (2 years 10 months) San Francisco Bay Area Dr. Min specializes in intellectual property law, with a focus on patent preparation and prosecution in the fields of clean technology, electronics & semiconductors, and nanotechnology. Memory Research Technologist Intel Corporation August 2008  –  January 2013  (4 years 6 months) Responsible for research of disruptive technologies to replace volatile and nonvolatile memory for lithographic nodes beyond 10 nm. Responsibilities include technology evaluation of memory concepts based on resistance change (phase change memory, resistance change memory, etc) and directing company-funded state-of-the-art external memory research activities at universities and consortia. Memory Research Technologist Intel Corporation August 2008  –  January 2013  (4 years 6 months) Responsible for research of disruptive technologies to replace volatile and nonvolatile memory for lithographic nodes beyond 10 nm. Responsibilities include technology evaluation of memory concepts based on resistance change (phase change memory, resistance change memory, etc) and directing company-funded state-of-the-art external memory research activities at universities and consortia. Nonvolatile Memory Pathfinding Technologist Intel Corporation January 2006  –  August 2008  (2 years 8 months) Boise, Idaho Area Responsible for development of disruptive flash memory technology for lithographic nodes beyond 20 nm. Technical responsibilities included memory cell design and process integration of advanced charge storage nodes including high K and metal gate integration. Nonvolatile Memory Pathfinding Technologist Intel Corporation January 2006  –  August 2008  (2 years 8 months) Boise, Idaho Area Responsible for development of disruptive flash memory technology for lithographic nodes beyond 20 nm. Technical responsibilities included memory cell design and process integration of advanced charge storage nodes including high K and metal gate integration. Languages korean korean korean Skills Nanotechnology Flash Memory Semiconductor... Patent Prosecution Patent Analysis Intellectual Property registered patent agent Semiconductor Equipment Nonvolatile Memory... Patent Drafting Semiconductors Registered Patent... Memory Patents Thin Films Biotechnology Silicon Process Integration See 3+     See less Skills  Nanotechnology Flash Memory Semiconductor... Patent Prosecution Patent Analysis Intellectual Property registered patent agent Semiconductor Equipment Nonvolatile Memory... Patent Drafting Semiconductors Registered Patent... Memory Patents Thin Films Biotechnology Silicon Process Integration See 3+     See less Nanotechnology Flash Memory Semiconductor... Patent Prosecution Patent Analysis Intellectual Property registered patent agent Semiconductor Equipment Nonvolatile Memory... Patent Drafting Semiconductors Registered Patent... Memory Patents Thin Films Biotechnology Silicon Process Integration See 3+     See less Nanotechnology Flash Memory Semiconductor... Patent Prosecution Patent Analysis Intellectual Property registered patent agent Semiconductor Equipment Nonvolatile Memory... Patent Drafting Semiconductors Registered Patent... Memory Patents Thin Films Biotechnology Silicon Process Integration See 3+     See less Education Santa Clara University School of Law Doctor of Law (J.D.),  Law 2008  – 2012 Activities and Societies:  Deans List California Institute of Technology Ph.D,  Materials Science / Applied Physics Recipient of Intel Graduate Fellowship Activities and Societies:  Thesis Research Topic: Si nanotechnology-based light emitting structures and devices University of California, Los Angeles B.S.,  Materials Engineering HONORS: \n \nRegents Scholarship (the most prestigious merit-based scholarship at University of California),  \n \nDepartment Honors Graduation Award,  \n \nUndergraduate Chemistry Research Award. Activities and Societies:  B.S. ,  cum laude ,  Materials Science and Eng. (Electronic Materials Program) ,  June 1994\nUndergraduate Research: Synthesis and characterization of C60 and related compounds. Santa Clara University School of Law Doctor of Law (J.D.),  Law 2008  – 2012 Activities and Societies:  Deans List Santa Clara University School of Law Doctor of Law (J.D.),  Law 2008  – 2012 Activities and Societies:  Deans List Santa Clara University School of Law Doctor of Law (J.D.),  Law 2008  – 2012 Activities and Societies:  Deans List California Institute of Technology Ph.D,  Materials Science / Applied Physics Recipient of Intel Graduate Fellowship Activities and Societies:  Thesis Research Topic: Si nanotechnology-based light emitting structures and devices California Institute of Technology Ph.D,  Materials Science / Applied Physics Recipient of Intel Graduate Fellowship Activities and Societies:  Thesis Research Topic: Si nanotechnology-based light emitting structures and devices California Institute of Technology Ph.D,  Materials Science / Applied Physics Recipient of Intel Graduate Fellowship Activities and Societies:  Thesis Research Topic: Si nanotechnology-based light emitting structures and devices University of California, Los Angeles B.S.,  Materials Engineering HONORS: \n \nRegents Scholarship (the most prestigious merit-based scholarship at University of California),  \n \nDepartment Honors Graduation Award,  \n \nUndergraduate Chemistry Research Award. Activities and Societies:  B.S. ,  cum laude ,  Materials Science and Eng. (Electronic Materials Program) ,  June 1994\nUndergraduate Research: Synthesis and characterization of C60 and related compounds. University of California, Los Angeles B.S.,  Materials Engineering HONORS: \n \nRegents Scholarship (the most prestigious merit-based scholarship at University of California),  \n \nDepartment Honors Graduation Award,  \n \nUndergraduate Chemistry Research Award. Activities and Societies:  B.S. ,  cum laude ,  Materials Science and Eng. (Electronic Materials Program) ,  June 1994\nUndergraduate Research: Synthesis and characterization of C60 and related compounds. University of California, Los Angeles B.S.,  Materials Engineering HONORS: \n \nRegents Scholarship (the most prestigious merit-based scholarship at University of California),  \n \nDepartment Honors Graduation Award,  \n \nUndergraduate Chemistry Research Award. Activities and Societies:  B.S. ,  cum laude ,  Materials Science and Eng. (Electronic Materials Program) ,  June 1994\nUndergraduate Research: Synthesis and characterization of C60 and related compounds. ", "Summary Great experience at semiconductor manufactouring process in Lithography. Demonstarted project management and team leadership, fully skilled at structrual problem solving and data mining. Self-motivated and motivate others to achieve team goal in terms of quality, cost and velocity. Summary Great experience at semiconductor manufactouring process in Lithography. Demonstarted project management and team leadership, fully skilled at structrual problem solving and data mining. Self-motivated and motivate others to achieve team goal in terms of quality, cost and velocity. Great experience at semiconductor manufactouring process in Lithography. Demonstarted project management and team leadership, fully skilled at structrual problem solving and data mining. Self-motivated and motivate others to achieve team goal in terms of quality, cost and velocity. Great experience at semiconductor manufactouring process in Lithography. Demonstarted project management and team leadership, fully skilled at structrual problem solving and data mining. Self-motivated and motivate others to achieve team goal in terms of quality, cost and velocity. Experience Process solution staff technologist Intel Corporation April 2014  – Present (1 year 5 months) Dalian, Liaoning, China New process solution and engineer capability program Staff Technologist Intel Corporation 2008  –  April 2014  (6 years) Lithography Modue team leader and Department rep of technical capability advancement Senior application engineer/supervisor ASML October 2000  –  October 2008  (8 years 1 month) Beijing City, China Process engineer, Group leader SG-NEC semiconductor co. ltd July 1995  –  December 1999  (4 years 6 months) Beijing City, China Litho process technology transfer, ramp up and sustaining excellence Process solution staff technologist Intel Corporation April 2014  – Present (1 year 5 months) Dalian, Liaoning, China New process solution and engineer capability program Process solution staff technologist Intel Corporation April 2014  – Present (1 year 5 months) Dalian, Liaoning, China New process solution and engineer capability program Staff Technologist Intel Corporation 2008  –  April 2014  (6 years) Lithography Modue team leader and Department rep of technical capability advancement Staff Technologist Intel Corporation 2008  –  April 2014  (6 years) Lithography Modue team leader and Department rep of technical capability advancement Senior application engineer/supervisor ASML October 2000  –  October 2008  (8 years 1 month) Beijing City, China Senior application engineer/supervisor ASML October 2000  –  October 2008  (8 years 1 month) Beijing City, China Process engineer, Group leader SG-NEC semiconductor co. ltd July 1995  –  December 1999  (4 years 6 months) Beijing City, China Litho process technology transfer, ramp up and sustaining excellence Process engineer, Group leader SG-NEC semiconductor co. ltd July 1995  –  December 1999  (4 years 6 months) Beijing City, China Litho process technology transfer, ramp up and sustaining excellence Languages English Professional working proficiency Mandarin Native or bilingual proficiency English Professional working proficiency Mandarin Native or bilingual proficiency English Professional working proficiency Mandarin Native or bilingual proficiency Professional working proficiency Native or bilingual proficiency Skills Lithography Project Management Team Leadership Structural problem... Semiconductor... ASML applications Metrology Semiconductors MEMS Failure Analysis Silicon Semiconductor Industry Thin Films IC Materials Science Sensors SPC Design of Experiments Process Integration CMOS Intel See 6+     See less Skills  Lithography Project Management Team Leadership Structural problem... Semiconductor... ASML applications Metrology Semiconductors MEMS Failure Analysis Silicon Semiconductor Industry Thin Films IC Materials Science Sensors SPC Design of Experiments Process Integration CMOS Intel See 6+     See less Lithography Project Management Team Leadership Structural problem... Semiconductor... ASML applications Metrology Semiconductors MEMS Failure Analysis Silicon Semiconductor Industry Thin Films IC Materials Science Sensors SPC Design of Experiments Process Integration CMOS Intel See 6+     See less Lithography Project Management Team Leadership Structural problem... Semiconductor... ASML applications Metrology Semiconductors MEMS Failure Analysis Silicon Semiconductor Industry Thin Films IC Materials Science Sensors SPC Design of Experiments Process Integration CMOS Intel See 6+     See less "]}