{"position": "Technical Support Engineer", "company": "Stanford University", "profiles": ["Skills Servers Hardware ITIL Active Directory TCP/IP DNS Windows Server Citrix VMware Virtualization System Administration Microsoft Exchange vSphere Infrastructure Data Center Operating Systems See 1+     See less Skills  Servers Hardware ITIL Active Directory TCP/IP DNS Windows Server Citrix VMware Virtualization System Administration Microsoft Exchange vSphere Infrastructure Data Center Operating Systems See 1+     See less Servers Hardware ITIL Active Directory TCP/IP DNS Windows Server Citrix VMware Virtualization System Administration Microsoft Exchange vSphere Infrastructure Data Center Operating Systems See 1+     See less Servers Hardware ITIL Active Directory TCP/IP DNS Windows Server Citrix VMware Virtualization System Administration Microsoft Exchange vSphere Infrastructure Data Center Operating Systems See 1+     See less ", "Summary •\tExpertise in Mac, PC, Internet and Intranet business and IT solutions \n•\t4 years experience administrative support on Linux Servers \n•\t12 years experience administrative support on Mac and PC Servers \n•\t12 years experience in implementation and creation of backup server strategies \n•\t14 years experience engineering and technical support on Mac and PC platforms Summary •\tExpertise in Mac, PC, Internet and Intranet business and IT solutions \n•\t4 years experience administrative support on Linux Servers \n•\t12 years experience administrative support on Mac and PC Servers \n•\t12 years experience in implementation and creation of backup server strategies \n•\t14 years experience engineering and technical support on Mac and PC platforms •\tExpertise in Mac, PC, Internet and Intranet business and IT solutions \n•\t4 years experience administrative support on Linux Servers \n•\t12 years experience administrative support on Mac and PC Servers \n•\t12 years experience in implementation and creation of backup server strategies \n•\t14 years experience engineering and technical support on Mac and PC platforms •\tExpertise in Mac, PC, Internet and Intranet business and IT solutions \n•\t4 years experience administrative support on Linux Servers \n•\t12 years experience administrative support on Mac and PC Servers \n•\t12 years experience in implementation and creation of backup server strategies \n•\t14 years experience engineering and technical support on Mac and PC platforms Experience Lead Application Systems Administrator (promotion) Synarc July 2013  – Present (2 years 2 months) Newark, CA *Lead Administrator responsible for Synarc's internally developed Java applications (StudyDirect and SynarcConnect) and 3rd party applications integrated into our software.  \n \n*Work closely with Engineering, sharing a joint task list, to maintain, upgrade, and perform root cause analysis on 40+ RHEL 6 servers running Jboss or Tomcat across four distinct environments: Development, test, staging, and production. \n \n*Work with the SQA team performing installation qualification automated testing after upgrades to staging and production systems and document the results in accordance with the FDA's CFR 21 Part 11. \n \n*Manage and plan projects of medium to large scope including cost, scheduling, potential impact to internal / external users, training, implementation, and documentation. \n \n*Provide mentoring to other IT personnel. \n \n*Assist in developing, modifying and operating in accordance with organizational Standard Operating Procedures (SOP). Technical Support Engineer Stanford University November 2005  –  July 2013  (7 years 9 months) Provide deskside and networking support to over 450 desktop and laptop systems in a mixed PC and Mac environment. Lead Mac support for 40 desktops and laptops in a design, magazine, and marketing environment. I configured and administer two Windows 2008 Servers providing file service and QAS (Quick Address Pro) service, two OSX Apache web servers, six Red Hat servers (two squirrelmail, one SAMBA, one Nginx web server, and two JIVE). I configured and maintain two Windows 2008 Retrospect Servers with iSCSI storage (via Dell Sumo NAS shared storage) and support Tivoli Storage Manager backups. I also perform conversions from physical to virtual servers in a VMware esxi 5.1 environment. Senior IT Level 3 NASA Ames Research Center July 2002  –  November 2005  (3 years 5 months) Provided deskside and networking support to over 250 end users in a mixed PC and Mac environment. Developed and implemented a custom backup strategy for end users and servers utilizing four Retrospect servers. IT Project Support NASA Ames Research Center, O.D.I.N. Project December 2001  –  July 2002  (8 months) Provided deskside support to approximately 1500 end users in a mixed PC and Mac environment. Configured end user backups and backup schedules utilizing Retrospect server and Tivoli Storage Manager. Systems Analyst Palm March 2001  –  November 2001  (9 months) Santa Clara, CA Managed over 20 NT/2000 and Apple servers. Configured and managed Cisco 4006 router for Appletalk zone broadcasting and IP forwarding across 3 subnets. Provided technical support (deskside and helpdesk) to approximately 300 end users. Developed new backup strategy for over 30 servers (Mac, PC, and Solaris) and 300 end users (Mac and PC). Lead Application Systems Administrator (promotion) Synarc July 2013  – Present (2 years 2 months) Newark, CA *Lead Administrator responsible for Synarc's internally developed Java applications (StudyDirect and SynarcConnect) and 3rd party applications integrated into our software.  \n \n*Work closely with Engineering, sharing a joint task list, to maintain, upgrade, and perform root cause analysis on 40+ RHEL 6 servers running Jboss or Tomcat across four distinct environments: Development, test, staging, and production. \n \n*Work with the SQA team performing installation qualification automated testing after upgrades to staging and production systems and document the results in accordance with the FDA's CFR 21 Part 11. \n \n*Manage and plan projects of medium to large scope including cost, scheduling, potential impact to internal / external users, training, implementation, and documentation. \n \n*Provide mentoring to other IT personnel. \n \n*Assist in developing, modifying and operating in accordance with organizational Standard Operating Procedures (SOP). Lead Application Systems Administrator (promotion) Synarc July 2013  – Present (2 years 2 months) Newark, CA *Lead Administrator responsible for Synarc's internally developed Java applications (StudyDirect and SynarcConnect) and 3rd party applications integrated into our software.  \n \n*Work closely with Engineering, sharing a joint task list, to maintain, upgrade, and perform root cause analysis on 40+ RHEL 6 servers running Jboss or Tomcat across four distinct environments: Development, test, staging, and production. \n \n*Work with the SQA team performing installation qualification automated testing after upgrades to staging and production systems and document the results in accordance with the FDA's CFR 21 Part 11. \n \n*Manage and plan projects of medium to large scope including cost, scheduling, potential impact to internal / external users, training, implementation, and documentation. \n \n*Provide mentoring to other IT personnel. \n \n*Assist in developing, modifying and operating in accordance with organizational Standard Operating Procedures (SOP). Technical Support Engineer Stanford University November 2005  –  July 2013  (7 years 9 months) Provide deskside and networking support to over 450 desktop and laptop systems in a mixed PC and Mac environment. Lead Mac support for 40 desktops and laptops in a design, magazine, and marketing environment. I configured and administer two Windows 2008 Servers providing file service and QAS (Quick Address Pro) service, two OSX Apache web servers, six Red Hat servers (two squirrelmail, one SAMBA, one Nginx web server, and two JIVE). I configured and maintain two Windows 2008 Retrospect Servers with iSCSI storage (via Dell Sumo NAS shared storage) and support Tivoli Storage Manager backups. I also perform conversions from physical to virtual servers in a VMware esxi 5.1 environment. Technical Support Engineer Stanford University November 2005  –  July 2013  (7 years 9 months) Provide deskside and networking support to over 450 desktop and laptop systems in a mixed PC and Mac environment. Lead Mac support for 40 desktops and laptops in a design, magazine, and marketing environment. I configured and administer two Windows 2008 Servers providing file service and QAS (Quick Address Pro) service, two OSX Apache web servers, six Red Hat servers (two squirrelmail, one SAMBA, one Nginx web server, and two JIVE). I configured and maintain two Windows 2008 Retrospect Servers with iSCSI storage (via Dell Sumo NAS shared storage) and support Tivoli Storage Manager backups. I also perform conversions from physical to virtual servers in a VMware esxi 5.1 environment. Senior IT Level 3 NASA Ames Research Center July 2002  –  November 2005  (3 years 5 months) Provided deskside and networking support to over 250 end users in a mixed PC and Mac environment. Developed and implemented a custom backup strategy for end users and servers utilizing four Retrospect servers. Senior IT Level 3 NASA Ames Research Center July 2002  –  November 2005  (3 years 5 months) Provided deskside and networking support to over 250 end users in a mixed PC and Mac environment. Developed and implemented a custom backup strategy for end users and servers utilizing four Retrospect servers. IT Project Support NASA Ames Research Center, O.D.I.N. Project December 2001  –  July 2002  (8 months) Provided deskside support to approximately 1500 end users in a mixed PC and Mac environment. Configured end user backups and backup schedules utilizing Retrospect server and Tivoli Storage Manager. IT Project Support NASA Ames Research Center, O.D.I.N. Project December 2001  –  July 2002  (8 months) Provided deskside support to approximately 1500 end users in a mixed PC and Mac environment. Configured end user backups and backup schedules utilizing Retrospect server and Tivoli Storage Manager. Systems Analyst Palm March 2001  –  November 2001  (9 months) Santa Clara, CA Managed over 20 NT/2000 and Apple servers. Configured and managed Cisco 4006 router for Appletalk zone broadcasting and IP forwarding across 3 subnets. Provided technical support (deskside and helpdesk) to approximately 300 end users. Developed new backup strategy for over 30 servers (Mac, PC, and Solaris) and 300 end users (Mac and PC). Systems Analyst Palm March 2001  –  November 2001  (9 months) Santa Clara, CA Managed over 20 NT/2000 and Apple servers. Configured and managed Cisco 4006 router for Appletalk zone broadcasting and IP forwarding across 3 subnets. Provided technical support (deskside and helpdesk) to approximately 300 end users. Developed new backup strategy for over 30 servers (Mac, PC, and Solaris) and 300 end users (Mac and PC). Skills Servers Red Hat Enterprise... Windows Server VMware ESX JBoss Application Server Apache Tomcat Alfresco Aspera Load Balancing Project Management Employee Training OS X XP Cisco Technologies Mac OS X Server Windows 7 iPhone iPad Acronis Security Windows Server 2008 Mac OS X Windows XP Professional Retrospect UIU (Universal Imaging... See 11+     See less Skills  Servers Red Hat Enterprise... Windows Server VMware ESX JBoss Application Server Apache Tomcat Alfresco Aspera Load Balancing Project Management Employee Training OS X XP Cisco Technologies Mac OS X Server Windows 7 iPhone iPad Acronis Security Windows Server 2008 Mac OS X Windows XP Professional Retrospect UIU (Universal Imaging... See 11+     See less Servers Red Hat Enterprise... Windows Server VMware ESX JBoss Application Server Apache Tomcat Alfresco Aspera Load Balancing Project Management Employee Training OS X XP Cisco Technologies Mac OS X Server Windows 7 iPhone iPad Acronis Security Windows Server 2008 Mac OS X Windows XP Professional Retrospect UIU (Universal Imaging... See 11+     See less Servers Red Hat Enterprise... Windows Server VMware ESX JBoss Application Server Apache Tomcat Alfresco Aspera Load Balancing Project Management Employee Training OS X XP Cisco Technologies Mac OS X Server Windows 7 iPhone iPad Acronis Security Windows Server 2008 Mac OS X Windows XP Professional Retrospect UIU (Universal Imaging... See 11+     See less Education Heald College AS,  Computer Technology 1996  – 1998 Heald College AS,  Computer Technology 1996  – 1998 Heald College AS,  Computer Technology 1996  – 1998 Heald College AS,  Computer Technology 1996  – 1998 "]}