{"position": "Threat Analyst", "company": "IBM", "profiles": ["Summary - I worked as a volunteer at FATEC Indaiatuba (Brazil) for two months and I worked with hadrware/software maintenance and network. \n \n- Level 1 Network Support at AT&T Global Network Services in Brazil. Provide network support to IBM, Nissan, BP and other companies. I worked for one year and ten months. \n \n- After that, I applied for Volunteer Programme at Redcliffe College (England) and stayed there for 1 year (January/2011 - January/2012). My job there was related with general services, for example kitchen, maintenace, creche, cleaning and others jobs. I could improve my English and learn more about a new culture. Summary - I worked as a volunteer at FATEC Indaiatuba (Brazil) for two months and I worked with hadrware/software maintenance and network. \n \n- Level 1 Network Support at AT&T Global Network Services in Brazil. Provide network support to IBM, Nissan, BP and other companies. I worked for one year and ten months. \n \n- After that, I applied for Volunteer Programme at Redcliffe College (England) and stayed there for 1 year (January/2011 - January/2012). My job there was related with general services, for example kitchen, maintenace, creche, cleaning and others jobs. I could improve my English and learn more about a new culture. - I worked as a volunteer at FATEC Indaiatuba (Brazil) for two months and I worked with hadrware/software maintenance and network. \n \n- Level 1 Network Support at AT&T Global Network Services in Brazil. Provide network support to IBM, Nissan, BP and other companies. I worked for one year and ten months. \n \n- After that, I applied for Volunteer Programme at Redcliffe College (England) and stayed there for 1 year (January/2011 - January/2012). My job there was related with general services, for example kitchen, maintenace, creche, cleaning and others jobs. I could improve my English and learn more about a new culture. - I worked as a volunteer at FATEC Indaiatuba (Brazil) for two months and I worked with hadrware/software maintenance and network. \n \n- Level 1 Network Support at AT&T Global Network Services in Brazil. Provide network support to IBM, Nissan, BP and other companies. I worked for one year and ten months. \n \n- After that, I applied for Volunteer Programme at Redcliffe College (England) and stayed there for 1 year (January/2011 - January/2012). My job there was related with general services, for example kitchen, maintenace, creche, cleaning and others jobs. I could improve my English and learn more about a new culture. Experience Global Security Threat Analyst IBM December 2014  – Present (9 months) Campinas Area, Brazil The responsibility of this position is analyze logs and events and provide recommendations to the customers in order to preserve the security of the customer's environment. Global IT Security Ops Desk Analyst IBM November 2012  –  December 2014  (2 years 2 months) IBM Hortolandia, Brazil In this position, it is provided to the customer Security Solutions for their requests as soon as it arrives in our environment. \nThe Ops Desk team is responsible to receive these requests and provide the first level of support and, depending on the case, the case is forwarded to the responsible team to help the customer in the best way. \n \nThis support is provided for National and International companies. Volunteer Worker Redcliffe College January 2011  –  January 2012  (1 year 1 month) At Redcliffe College I'm a volunteer worker, so I work in different areas: housekeeper, at the kitchen, gardening and other areas. Level 1 Network Support AT&T Global Services Brasil February 2009  –  December 2010  (1 year 11 months) At AT&T, my job was provide a network support to big companies like IBM, Nissan, British Petrol (BP), Schneider Electric and others. I also worked with SNA Networks and I provided level 1 network support. \n \nLevel 1 Network Support scope is investigate the problem and call to other support levels to resolve the problem. Trainee Union Desenvolvimento de Software LTDA July 2008  –  September 2008  (3 months) Indaiatuba, SP - Brazil I used to help the clients with the software, I used to contact the providers and I helped the employees around with IT issues and maintenance of equipments. Global Security Threat Analyst IBM December 2014  – Present (9 months) Campinas Area, Brazil The responsibility of this position is analyze logs and events and provide recommendations to the customers in order to preserve the security of the customer's environment. Global Security Threat Analyst IBM December 2014  – Present (9 months) Campinas Area, Brazil The responsibility of this position is analyze logs and events and provide recommendations to the customers in order to preserve the security of the customer's environment. Global IT Security Ops Desk Analyst IBM November 2012  –  December 2014  (2 years 2 months) IBM Hortolandia, Brazil In this position, it is provided to the customer Security Solutions for their requests as soon as it arrives in our environment. \nThe Ops Desk team is responsible to receive these requests and provide the first level of support and, depending on the case, the case is forwarded to the responsible team to help the customer in the best way. \n \nThis support is provided for National and International companies. Global IT Security Ops Desk Analyst IBM November 2012  –  December 2014  (2 years 2 months) IBM Hortolandia, Brazil In this position, it is provided to the customer Security Solutions for their requests as soon as it arrives in our environment. \nThe Ops Desk team is responsible to receive these requests and provide the first level of support and, depending on the case, the case is forwarded to the responsible team to help the customer in the best way. \n \nThis support is provided for National and International companies. Volunteer Worker Redcliffe College January 2011  –  January 2012  (1 year 1 month) At Redcliffe College I'm a volunteer worker, so I work in different areas: housekeeper, at the kitchen, gardening and other areas. Volunteer Worker Redcliffe College January 2011  –  January 2012  (1 year 1 month) At Redcliffe College I'm a volunteer worker, so I work in different areas: housekeeper, at the kitchen, gardening and other areas. Level 1 Network Support AT&T Global Services Brasil February 2009  –  December 2010  (1 year 11 months) At AT&T, my job was provide a network support to big companies like IBM, Nissan, British Petrol (BP), Schneider Electric and others. I also worked with SNA Networks and I provided level 1 network support. \n \nLevel 1 Network Support scope is investigate the problem and call to other support levels to resolve the problem. Level 1 Network Support AT&T Global Services Brasil February 2009  –  December 2010  (1 year 11 months) At AT&T, my job was provide a network support to big companies like IBM, Nissan, British Petrol (BP), Schneider Electric and others. I also worked with SNA Networks and I provided level 1 network support. \n \nLevel 1 Network Support scope is investigate the problem and call to other support levels to resolve the problem. Trainee Union Desenvolvimento de Software LTDA July 2008  –  September 2008  (3 months) Indaiatuba, SP - Brazil I used to help the clients with the software, I used to contact the providers and I helped the employees around with IT issues and maintenance of equipments. Trainee Union Desenvolvimento de Software LTDA July 2008  –  September 2008  (3 months) Indaiatuba, SP - Brazil I used to help the clients with the software, I used to contact the providers and I helped the employees around with IT issues and maintenance of equipments. Languages English Full professional proficiency Portuguese Native or bilingual proficiency Spanish Elementary proficiency English Full professional proficiency Portuguese Native or bilingual proficiency Spanish Elementary proficiency English Full professional proficiency Portuguese Native or bilingual proficiency Spanish Elementary proficiency Full professional proficiency Native or bilingual proficiency Elementary proficiency Skills Networking Network Administration Security CCNA Routers Network Security Troubleshooting Cisco Technologies Firewalls Switches Routing Operating Systems Teamwork WAN LAN-WAN TCP/IP Telecommunications English DHCP EIGRP Routing Protocols CCNA course at AT&T... Certificate of... Web Design DDoS Mitigation See 10+     See less Skills  Networking Network Administration Security CCNA Routers Network Security Troubleshooting Cisco Technologies Firewalls Switches Routing Operating Systems Teamwork WAN LAN-WAN TCP/IP Telecommunications English DHCP EIGRP Routing Protocols CCNA course at AT&T... Certificate of... Web Design DDoS Mitigation See 10+     See less Networking Network Administration Security CCNA Routers Network Security Troubleshooting Cisco Technologies Firewalls Switches Routing Operating Systems Teamwork WAN LAN-WAN TCP/IP Telecommunications English DHCP EIGRP Routing Protocols CCNA course at AT&T... Certificate of... Web Design DDoS Mitigation See 10+     See less Networking Network Administration Security CCNA Routers Network Security Troubleshooting Cisco Technologies Firewalls Switches Routing Operating Systems Teamwork WAN LAN-WAN TCP/IP Telecommunications English DHCP EIGRP Routing Protocols CCNA course at AT&T... Certificate of... Web Design DDoS Mitigation See 10+     See less Education Faculdade de Tecnologia de São Paulo Superior Completo,  Tecnologia da Informacao - Redes Computadores 2007  – 2010 Faculdade de Tecnologia de São Paulo Superior Completo,  Tecnologia da Informacao - Redes Computadores 2007  – 2010 Faculdade de Tecnologia de São Paulo Superior Completo,  Tecnologia da Informacao - Redes Computadores 2007  – 2010 Faculdade de Tecnologia de São Paulo Superior Completo,  Tecnologia da Informacao - Redes Computadores 2007  – 2010 ", "Experience Senior Threat and Intelligence Analyst IBM Internet Security Systems 2008  – Present (7 years) Senior Security and Threat Analyst IBM 2005  –  2008  (3 years) Engineer Logical CSI 2002  –  2004  (2 years) Consultant NetSystems Ltd November 1996  –  November 1999  (3 years 1 month) Network and systems support company based in Dunedin, New Zealand. Senior Threat and Intelligence Analyst IBM Internet Security Systems 2008  – Present (7 years) Senior Threat and Intelligence Analyst IBM Internet Security Systems 2008  – Present (7 years) Senior Security and Threat Analyst IBM 2005  –  2008  (3 years) Senior Security and Threat Analyst IBM 2005  –  2008  (3 years) Engineer Logical CSI 2002  –  2004  (2 years) Engineer Logical CSI 2002  –  2004  (2 years) Consultant NetSystems Ltd November 1996  –  November 1999  (3 years 1 month) Network and systems support company based in Dunedin, New Zealand. Consultant NetSystems Ltd November 1996  –  November 1999  (3 years 1 month) Network and systems support company based in Dunedin, New Zealand. Skills JavaScript Vulnerability Assessment Penetration Testing Information Security... Security Network Security Intrusion Detection Information Security IDS IPS Computer Security CISSP ISO 27001 PCI DSS Computer Forensics Firewalls Cisco Technologies Security Audits Security Policy Virtualization See 5+     See less Skills  JavaScript Vulnerability Assessment Penetration Testing Information Security... Security Network Security Intrusion Detection Information Security IDS IPS Computer Security CISSP ISO 27001 PCI DSS Computer Forensics Firewalls Cisco Technologies Security Audits Security Policy Virtualization See 5+     See less JavaScript Vulnerability Assessment Penetration Testing Information Security... Security Network Security Intrusion Detection Information Security IDS IPS Computer Security CISSP ISO 27001 PCI DSS Computer Forensics Firewalls Cisco Technologies Security Audits Security Policy Virtualization See 5+     See less JavaScript Vulnerability Assessment Penetration Testing Information Security... Security Network Security Intrusion Detection Information Security IDS IPS Computer Security CISSP ISO 27001 PCI DSS Computer Forensics Firewalls Cisco Technologies Security Audits Security Policy Virtualization See 5+     See less ", "Summary Threat Analyst for managed services monitoring and administering various intrusion detection and prevention systems for customers. Performance of threat analysis. Interested in penetration testing, analysis/trends, and the counteraction of threats. Specialties:UNIX/Linux, IDS/IPS, Threat Analysis Summary Threat Analyst for managed services monitoring and administering various intrusion detection and prevention systems for customers. Performance of threat analysis. Interested in penetration testing, analysis/trends, and the counteraction of threats. Specialties:UNIX/Linux, IDS/IPS, Threat Analysis Threat Analyst for managed services monitoring and administering various intrusion detection and prevention systems for customers. Performance of threat analysis. Interested in penetration testing, analysis/trends, and the counteraction of threats. Specialties:UNIX/Linux, IDS/IPS, Threat Analysis Threat Analyst for managed services monitoring and administering various intrusion detection and prevention systems for customers. Performance of threat analysis. Interested in penetration testing, analysis/trends, and the counteraction of threats. Specialties:UNIX/Linux, IDS/IPS, Threat Analysis Experience Escalation Engineer IBM Security Services October 2013  – Present (1 year 11 months) Escalation Engineer IBM Security Services October 2013  – Present (1 year 11 months) Escalation Engineer IBM Security Services October 2013  – Present (1 year 11 months) Skills Threat Analysis Penetration Testing IPS Intrusion Detection Vulnerability Assessment CISSP Network Security Information Assurance Malware Analysis Firewalls Security Information Security... Computer Security Information Security GCIH Vulnerability Management CEH IDS DNS Security Architecture... Application Security Checkpoint Web Application Security Vulnerability Scanning Security Audits PCI DSS Incident Response Security Awareness Juniper Snort Data Security Internet Security Bluecoat ISO 27001 SIEM McAfee VPN Computer Forensics Security Policy Network Architecture Managed Security... DLP Encryption Nessus Cryptography Antivirus DHCP Identity Management Backtrack ArcSight See 35+     See less Skills  Threat Analysis Penetration Testing IPS Intrusion Detection Vulnerability Assessment CISSP Network Security Information Assurance Malware Analysis Firewalls Security Information Security... Computer Security Information Security GCIH Vulnerability Management CEH IDS DNS Security Architecture... Application Security Checkpoint Web Application Security Vulnerability Scanning Security Audits PCI DSS Incident Response Security Awareness Juniper Snort Data Security Internet Security Bluecoat ISO 27001 SIEM McAfee VPN Computer Forensics Security Policy Network Architecture Managed Security... DLP Encryption Nessus Cryptography Antivirus DHCP Identity Management Backtrack ArcSight See 35+     See less Threat Analysis Penetration Testing IPS Intrusion Detection Vulnerability Assessment CISSP Network Security Information Assurance Malware Analysis Firewalls Security Information Security... Computer Security Information Security GCIH Vulnerability Management CEH IDS DNS Security Architecture... Application Security Checkpoint Web Application Security Vulnerability Scanning Security Audits PCI DSS Incident Response Security Awareness Juniper Snort Data Security Internet Security Bluecoat ISO 27001 SIEM McAfee VPN Computer Forensics Security Policy Network Architecture Managed Security... DLP Encryption Nessus Cryptography Antivirus DHCP Identity Management Backtrack ArcSight See 35+     See less Threat Analysis Penetration Testing IPS Intrusion Detection Vulnerability Assessment CISSP Network Security Information Assurance Malware Analysis Firewalls Security Information Security... Computer Security Information Security GCIH Vulnerability Management CEH IDS DNS Security Architecture... Application Security Checkpoint Web Application Security Vulnerability Scanning Security Audits PCI DSS Incident Response Security Awareness Juniper Snort Data Security Internet Security Bluecoat ISO 27001 SIEM McAfee VPN Computer Forensics Security Policy Network Architecture Managed Security... DLP Encryption Nessus Cryptography Antivirus DHCP Identity Management Backtrack ArcSight See 35+     See less Education Colorado Technical University MS 2005  – 2006 University of Phoenix BS 2003  – 2004 Community College of the Air Force AAS 1997  – 2003 Colorado Technical University MS 2005  – 2006 Colorado Technical University MS 2005  – 2006 Colorado Technical University MS 2005  – 2006 University of Phoenix BS 2003  – 2004 University of Phoenix BS 2003  – 2004 University of Phoenix BS 2003  – 2004 Community College of the Air Force AAS 1997  – 2003 Community College of the Air Force AAS 1997  – 2003 Community College of the Air Force AAS 1997  – 2003 ", "Summary Seasoned professional with more than 15 years experience in the IT and IT Security Industries. Have lead and managed multiple teams including product support and tools development. Lead developer and database administrator of multiple large database backend web based applications. Analyze and automate manual processes using scripts and web interfaces. Possess experience using Bash shell scripting, Perl, C, Python and SQL to automate manual processes and generate various tools. Also have experience using PHP, JavaScript and Python for web development. \n \nInvolved in Security Industry in multiple areas including Anti-Virus, Vulnerability Scanning, HIDS/NIDS, Security Patch, Security Audit and Compliance and Security analysis. \n \nExcellent written and oral communications skills, including authoring, presenting, and publishing clear, concise and thorough information to customers and peers. Summary Seasoned professional with more than 15 years experience in the IT and IT Security Industries. Have lead and managed multiple teams including product support and tools development. Lead developer and database administrator of multiple large database backend web based applications. Analyze and automate manual processes using scripts and web interfaces. Possess experience using Bash shell scripting, Perl, C, Python and SQL to automate manual processes and generate various tools. Also have experience using PHP, JavaScript and Python for web development. \n \nInvolved in Security Industry in multiple areas including Anti-Virus, Vulnerability Scanning, HIDS/NIDS, Security Patch, Security Audit and Compliance and Security analysis. \n \nExcellent written and oral communications skills, including authoring, presenting, and publishing clear, concise and thorough information to customers and peers. Seasoned professional with more than 15 years experience in the IT and IT Security Industries. Have lead and managed multiple teams including product support and tools development. Lead developer and database administrator of multiple large database backend web based applications. Analyze and automate manual processes using scripts and web interfaces. Possess experience using Bash shell scripting, Perl, C, Python and SQL to automate manual processes and generate various tools. Also have experience using PHP, JavaScript and Python for web development. \n \nInvolved in Security Industry in multiple areas including Anti-Virus, Vulnerability Scanning, HIDS/NIDS, Security Patch, Security Audit and Compliance and Security analysis. \n \nExcellent written and oral communications skills, including authoring, presenting, and publishing clear, concise and thorough information to customers and peers. Seasoned professional with more than 15 years experience in the IT and IT Security Industries. Have lead and managed multiple teams including product support and tools development. Lead developer and database administrator of multiple large database backend web based applications. Analyze and automate manual processes using scripts and web interfaces. Possess experience using Bash shell scripting, Perl, C, Python and SQL to automate manual processes and generate various tools. Also have experience using PHP, JavaScript and Python for web development. \n \nInvolved in Security Industry in multiple areas including Anti-Virus, Vulnerability Scanning, HIDS/NIDS, Security Patch, Security Audit and Compliance and Security analysis. \n \nExcellent written and oral communications skills, including authoring, presenting, and publishing clear, concise and thorough information to customers and peers. Experience Senior Cyber Security Architect IBM June 2015  – Present (3 months) Create, use, transform, consume, manage and visualize IT Security Information Manager Data Intelligence and Global Operations Automation IBM June 2012  –  June 2015  (3 years 1 month) Responsible for leading and managing two development teams - SIEM Correlation Rule management and Organizational tools \n \n•\tLead development of processes to increase efficiency of teams including defining repeatable end-to-end processes, establishing consistent interaction with other teams, project prioritization survey and metrics. \n•\tPerformed data collection and analysis across our customer base during multiple security incidents  \n•\tCreated multiple CLI and web based tools to assist team in data analysis and ETL using PHP, Perl and MySQL. Team Lead - Data Intelligence Team IBM March 2012  –  June 2012  (4 months) Responsible for representing team to engineering to ensure updates/features are created that are needed to drive the team forward:  \n●\tIncreased exposure of team by presenting team capabilities to stakeholders \n●\tCreated and led documentation projects to document correlation rule creation components \n Global Security Program Manager IBM March 2010  –  March 2012  (2 years 1 month) Responsible for overall customer information security posture. \n•\tParticipated and lead multiple security audits including SAS70 Type II audits, IBM corporate and SOX audits) \n•\tIdentify security exposures in environments then develop Risk Management programs \n•\tOffer executive-level presentations on security posture and/or current activities Information Security Advisor IBM January 2007  –  April 2010  (3 years 4 months) Serve as a focal for the IBM security services provided to the customer \n•\tProvided security patch management oversight  \n•\tLead research to closure of multiple security incidents stemming from Firewall log and IDS analysis. \n•\tDeveloped multiple tools development for process efficiency using Ruby, JavaScript and Excel Macros.  \n•\tCreated and Led MS Tuesday patch collaboration project to allow all ISAs to become SMEs in the MS Tuesday patches Threat Analyst IBM July 2005  –  December 2006  (1 year 6 months) Continuously monitor and evaluate multiple sources of information including nefarious web sites, IRC channels and mailing lists for emerging threats. \n•\tPerformed original research on ActiveX Fuzzing and found undisclosed vulnerabilities in multiple applications. This led to the creation of multiple Proof of Concept (POC) web pages using JavaScript to demonstrate each of the vulnerabilities. \n•\tEditor of monthly “Strategic Trends and Analysis” (STAT) report read both internally and by external customers to provide an overview of the threat landscape for the month. Web Report Generation IBM February 2004  –  July 2005  (1 year 6 months) Implement customer requirements and self-promoted web site enhancements using PHP to a backend DB2 database \n•\tImproved overall customer experience by adding meaningful graphs and standardizing web page design and layout and consolidating the code base. \n•\tWrote custom web “scraper” to pull data from internal application for offline use. Vulnerability Scanning System Automation and Development IBM October 2001  –  February 2004  (2 years 5 months) Team lead of process automation including writing tools to verify vulnerability scan results. \n•\tResponsible for scan results data transformation and loading (ETL) into database used for report generation and data mining. \n•\tAdministrator of MySQL server holding multiple external and internal customer confidential vulnerability scan results. \n•\tCreated automated, self-contained vulnerability scanning tool using PHP, Perl and MySQL that is still used as part of the IBM new system build process Developer Intrusion.com February 2001  –  September 2001  (8 months) Designed Web interface and backend server using Perl, JavaScript and SOAP to control solid state Linux device  \n•\tProduct interface was reviewed with positive results in many IT industry magazines: http://findarticles.com/p/articles/mi_m0EIN/is_2001_July_10/ai_76425219  \n•\tAssisted in editing of customer product documentation to ensure device was accessible and usable by the average user. Senior Cyber Security Architect IBM June 2015  – Present (3 months) Create, use, transform, consume, manage and visualize IT Security Information Senior Cyber Security Architect IBM June 2015  – Present (3 months) Create, use, transform, consume, manage and visualize IT Security Information Manager Data Intelligence and Global Operations Automation IBM June 2012  –  June 2015  (3 years 1 month) Responsible for leading and managing two development teams - SIEM Correlation Rule management and Organizational tools \n \n•\tLead development of processes to increase efficiency of teams including defining repeatable end-to-end processes, establishing consistent interaction with other teams, project prioritization survey and metrics. \n•\tPerformed data collection and analysis across our customer base during multiple security incidents  \n•\tCreated multiple CLI and web based tools to assist team in data analysis and ETL using PHP, Perl and MySQL. Manager Data Intelligence and Global Operations Automation IBM June 2012  –  June 2015  (3 years 1 month) Responsible for leading and managing two development teams - SIEM Correlation Rule management and Organizational tools \n \n•\tLead development of processes to increase efficiency of teams including defining repeatable end-to-end processes, establishing consistent interaction with other teams, project prioritization survey and metrics. \n•\tPerformed data collection and analysis across our customer base during multiple security incidents  \n•\tCreated multiple CLI and web based tools to assist team in data analysis and ETL using PHP, Perl and MySQL. Team Lead - Data Intelligence Team IBM March 2012  –  June 2012  (4 months) Responsible for representing team to engineering to ensure updates/features are created that are needed to drive the team forward:  \n●\tIncreased exposure of team by presenting team capabilities to stakeholders \n●\tCreated and led documentation projects to document correlation rule creation components \n Team Lead - Data Intelligence Team IBM March 2012  –  June 2012  (4 months) Responsible for representing team to engineering to ensure updates/features are created that are needed to drive the team forward:  \n●\tIncreased exposure of team by presenting team capabilities to stakeholders \n●\tCreated and led documentation projects to document correlation rule creation components \n Global Security Program Manager IBM March 2010  –  March 2012  (2 years 1 month) Responsible for overall customer information security posture. \n•\tParticipated and lead multiple security audits including SAS70 Type II audits, IBM corporate and SOX audits) \n•\tIdentify security exposures in environments then develop Risk Management programs \n•\tOffer executive-level presentations on security posture and/or current activities Global Security Program Manager IBM March 2010  –  March 2012  (2 years 1 month) Responsible for overall customer information security posture. \n•\tParticipated and lead multiple security audits including SAS70 Type II audits, IBM corporate and SOX audits) \n•\tIdentify security exposures in environments then develop Risk Management programs \n•\tOffer executive-level presentations on security posture and/or current activities Information Security Advisor IBM January 2007  –  April 2010  (3 years 4 months) Serve as a focal for the IBM security services provided to the customer \n•\tProvided security patch management oversight  \n•\tLead research to closure of multiple security incidents stemming from Firewall log and IDS analysis. \n•\tDeveloped multiple tools development for process efficiency using Ruby, JavaScript and Excel Macros.  \n•\tCreated and Led MS Tuesday patch collaboration project to allow all ISAs to become SMEs in the MS Tuesday patches Information Security Advisor IBM January 2007  –  April 2010  (3 years 4 months) Serve as a focal for the IBM security services provided to the customer \n•\tProvided security patch management oversight  \n•\tLead research to closure of multiple security incidents stemming from Firewall log and IDS analysis. \n•\tDeveloped multiple tools development for process efficiency using Ruby, JavaScript and Excel Macros.  \n•\tCreated and Led MS Tuesday patch collaboration project to allow all ISAs to become SMEs in the MS Tuesday patches Threat Analyst IBM July 2005  –  December 2006  (1 year 6 months) Continuously monitor and evaluate multiple sources of information including nefarious web sites, IRC channels and mailing lists for emerging threats. \n•\tPerformed original research on ActiveX Fuzzing and found undisclosed vulnerabilities in multiple applications. This led to the creation of multiple Proof of Concept (POC) web pages using JavaScript to demonstrate each of the vulnerabilities. \n•\tEditor of monthly “Strategic Trends and Analysis” (STAT) report read both internally and by external customers to provide an overview of the threat landscape for the month. Threat Analyst IBM July 2005  –  December 2006  (1 year 6 months) Continuously monitor and evaluate multiple sources of information including nefarious web sites, IRC channels and mailing lists for emerging threats. \n•\tPerformed original research on ActiveX Fuzzing and found undisclosed vulnerabilities in multiple applications. This led to the creation of multiple Proof of Concept (POC) web pages using JavaScript to demonstrate each of the vulnerabilities. \n•\tEditor of monthly “Strategic Trends and Analysis” (STAT) report read both internally and by external customers to provide an overview of the threat landscape for the month. Web Report Generation IBM February 2004  –  July 2005  (1 year 6 months) Implement customer requirements and self-promoted web site enhancements using PHP to a backend DB2 database \n•\tImproved overall customer experience by adding meaningful graphs and standardizing web page design and layout and consolidating the code base. \n•\tWrote custom web “scraper” to pull data from internal application for offline use. Web Report Generation IBM February 2004  –  July 2005  (1 year 6 months) Implement customer requirements and self-promoted web site enhancements using PHP to a backend DB2 database \n•\tImproved overall customer experience by adding meaningful graphs and standardizing web page design and layout and consolidating the code base. \n•\tWrote custom web “scraper” to pull data from internal application for offline use. Vulnerability Scanning System Automation and Development IBM October 2001  –  February 2004  (2 years 5 months) Team lead of process automation including writing tools to verify vulnerability scan results. \n•\tResponsible for scan results data transformation and loading (ETL) into database used for report generation and data mining. \n•\tAdministrator of MySQL server holding multiple external and internal customer confidential vulnerability scan results. \n•\tCreated automated, self-contained vulnerability scanning tool using PHP, Perl and MySQL that is still used as part of the IBM new system build process Vulnerability Scanning System Automation and Development IBM October 2001  –  February 2004  (2 years 5 months) Team lead of process automation including writing tools to verify vulnerability scan results. \n•\tResponsible for scan results data transformation and loading (ETL) into database used for report generation and data mining. \n•\tAdministrator of MySQL server holding multiple external and internal customer confidential vulnerability scan results. \n•\tCreated automated, self-contained vulnerability scanning tool using PHP, Perl and MySQL that is still used as part of the IBM new system build process Developer Intrusion.com February 2001  –  September 2001  (8 months) Designed Web interface and backend server using Perl, JavaScript and SOAP to control solid state Linux device  \n•\tProduct interface was reviewed with positive results in many IT industry magazines: http://findarticles.com/p/articles/mi_m0EIN/is_2001_July_10/ai_76425219  \n•\tAssisted in editing of customer product documentation to ensure device was accessible and usable by the average user. Developer Intrusion.com February 2001  –  September 2001  (8 months) Designed Web interface and backend server using Perl, JavaScript and SOAP to control solid state Linux device  \n•\tProduct interface was reviewed with positive results in many IT industry magazines: http://findarticles.com/p/articles/mi_m0EIN/is_2001_July_10/ai_76425219  \n•\tAssisted in editing of customer product documentation to ensure device was accessible and usable by the average user. Skills Security Network Security Information Security Firewalls Linux Information Security... CISSP IDS Perl Technical Leadership People Management Computer Security Vulnerability Management Project Management Team Management Security Audits Disaster Recovery Cloud Computing Security Architecture... Vulnerability Assessment Application Security Bash SQL Penetration Testing ISO 27001 Unix Data Security MySQL Vulnerability Scanning Virtualization Identity Management System Administration Python JavaScript Microsoft Excel Intrusion Detection Business Continuity Web Application Security PHP Windows Server Servers Enterprise Architecture Leadership Management TCP/IP Shell Scripting ANSI C See 32+     See less Skills  Security Network Security Information Security Firewalls Linux Information Security... CISSP IDS Perl Technical Leadership People Management Computer Security Vulnerability Management Project Management Team Management Security Audits Disaster Recovery Cloud Computing Security Architecture... Vulnerability Assessment Application Security Bash SQL Penetration Testing ISO 27001 Unix Data Security MySQL Vulnerability Scanning Virtualization Identity Management System Administration Python JavaScript Microsoft Excel Intrusion Detection Business Continuity Web Application Security PHP Windows Server Servers Enterprise Architecture Leadership Management TCP/IP Shell Scripting ANSI C See 32+     See less Security Network Security Information Security Firewalls Linux Information Security... CISSP IDS Perl Technical Leadership People Management Computer Security Vulnerability Management Project Management Team Management Security Audits Disaster Recovery Cloud Computing Security Architecture... Vulnerability Assessment Application Security Bash SQL Penetration Testing ISO 27001 Unix Data Security MySQL Vulnerability Scanning Virtualization Identity Management System Administration Python JavaScript Microsoft Excel Intrusion Detection Business Continuity Web Application Security PHP Windows Server Servers Enterprise Architecture Leadership Management TCP/IP Shell Scripting ANSI C See 32+     See less Security Network Security Information Security Firewalls Linux Information Security... CISSP IDS Perl Technical Leadership People Management Computer Security Vulnerability Management Project Management Team Management Security Audits Disaster Recovery Cloud Computing Security Architecture... Vulnerability Assessment Application Security Bash SQL Penetration Testing ISO 27001 Unix Data Security MySQL Vulnerability Scanning Virtualization Identity Management System Administration Python JavaScript Microsoft Excel Intrusion Detection Business Continuity Web Application Security PHP Windows Server Servers Enterprise Architecture Leadership Management TCP/IP Shell Scripting ANSI C See 32+     See less Education University of Phoenix MS CIS,  Computer Information Systems 1997  – 1999 University of North Texas BS,  Computer Science 1995  – 1999 Wichita State University Computer Science 1994  – 1994 University of Phoenix MS CIS,  Computer Information Systems 1997  – 1999 University of Phoenix MS CIS,  Computer Information Systems 1997  – 1999 University of Phoenix MS CIS,  Computer Information Systems 1997  – 1999 University of North Texas BS,  Computer Science 1995  – 1999 University of North Texas BS,  Computer Science 1995  – 1999 University of North Texas BS,  Computer Science 1995  – 1999 Wichita State University Computer Science 1994  – 1994 Wichita State University Computer Science 1994  – 1994 Wichita State University Computer Science 1994  – 1994 ", "Experience Security Correlation Engineer IBM January 2015  – Present (8 months) MSS - Threat Analyst IBM September 2013  –  January 2015  (1 year 5 months) IBM Costa Rica * Responsible for providing IT security services to clients within the IBM Security Services (ISS) Managed Security Services organization.  \n \n* Perform an analytical and technical role in implementation, integration, and delivery of technical IT security solutions. This includes the use of inter-operational processes and procedures.  \n \n* Deliver high quality technical and/or consulting solutions to clients in response to security requirements.  \n \n* Perform multiple assigned technical tasks including system administration, monitoring, research, and analysis of the security solutions \n \n* Using IT Security Industry experience, monitor client security systems and events to detect and investigate threats, and work regularly with client teams to enhance current solutions to improve client security posture. This often includes using tools and methods to analyze and customize client solutions.  \n \n* Have professional, operational, and inter-personal skills to function effectively in collaborative high stakes and high stress situations with clients. IT Specialist CompuCom February 2010  –  September 2013  (3 years 8 months) Intel CRU1, UltraPark, Heredia, Costa Rica Virtual Machines Provisioning: \n \n* Responsible for the End Of Life process of Virtual Machines stored in VMWare ESXi hosts in secured and non-secured environments. Removal of Windows Server monitoring records, Symantec Veritas backups, Intel Enforcement security notifications and Active Directory records. \n \n* Improved the End Of Life process, attacking the bureaucracy of the process, acquiring roles of other positions that provided assistance to complete it but slowed down the Service Level Agreement established previously. The result was a faster process with a better quality of service. \n \nOPS Analyst Batch Support (Production / Pre-Production): \n \n* Provided support and execution of Autosys / SAP / Teradata / AbInitio batch Jobs, ensuring that all jobs executed flawlessly within the distributed applications servers in order to meet and exceed customer's expectations. \n \n* Monitored jobs while production batch failures to support personnel in timely manner, report outages, provided failure resolutions based on document knowledge articles and participated in crisis and postmortem meetings. \n \n* Trainer for new hires of the Ops Analysts position. \n \nGSM Applications: \n \n* Support to global servers and worldwide applications infrastructure systems such SAP, TIBCO, WIINGS, SQL Server, McAfee Antivirus, Service for Revenue and Floor Manufacturing services through remote monitoring and incident management tools. \n \n* Assisted in the documentation, troubleshooting and resolution of incidents in physical and virtual servers such servers down, NIC failures, SAN and NAS Adaptors failures, applications and services failures, performance issues, storage issues and SQL related issues. \n \nOffice Service Desk: \n* Assistance on incidents and how-to guidance on Microsoft Windows, Microsoft Office and other end-user applications for Intel employees and contractors. Sony TS1 Sykes April 2008  –  February 2010  (1 year 11 months) 700 Parkway, Global Park La Aurora de Heredia, Costa Rica * Frontend 1st Level Agent of the Tech Support of the Sony Electronics division, specialized in the Sony VAIO computers line. \n \n* Provided support and how-to assistance to end users using Windows XP, Windows Vista, Windows 7, Microsoft Office 2003/2007, networking connectivity, Sony applications, printing and connectivity with other Sony products. \n \n* Assisted as backup supervisor for Sony managers in tasks such providing feedback to Sony agents, metrics, resolution for difficult cases and assistance for new hires. Software Developer GBSYS October 2007  –  February 2008  (5 months) 400 mts sur y 25 mts oeste de la Pop’s de Curridabat, San José, Costa Rica * Developed and debugged a proxy connection tool for Belen's town council website using JavaScript and C++, this tool assisted the website in order to connect and proceed with payments to other companies that provided services such AyA, ICE, Cabletica and others. \n \n* Debugged a database management application and added a module required created using Oracle PL/SQL for JASEC (Junta Administrativa de Servicios Eléctricos de Cartago), this application managed all records and expenses of JASEC. Security Correlation Engineer IBM January 2015  – Present (8 months) Security Correlation Engineer IBM January 2015  – Present (8 months) MSS - Threat Analyst IBM September 2013  –  January 2015  (1 year 5 months) IBM Costa Rica * Responsible for providing IT security services to clients within the IBM Security Services (ISS) Managed Security Services organization.  \n \n* Perform an analytical and technical role in implementation, integration, and delivery of technical IT security solutions. This includes the use of inter-operational processes and procedures.  \n \n* Deliver high quality technical and/or consulting solutions to clients in response to security requirements.  \n \n* Perform multiple assigned technical tasks including system administration, monitoring, research, and analysis of the security solutions \n \n* Using IT Security Industry experience, monitor client security systems and events to detect and investigate threats, and work regularly with client teams to enhance current solutions to improve client security posture. This often includes using tools and methods to analyze and customize client solutions.  \n \n* Have professional, operational, and inter-personal skills to function effectively in collaborative high stakes and high stress situations with clients. MSS - Threat Analyst IBM September 2013  –  January 2015  (1 year 5 months) IBM Costa Rica * Responsible for providing IT security services to clients within the IBM Security Services (ISS) Managed Security Services organization.  \n \n* Perform an analytical and technical role in implementation, integration, and delivery of technical IT security solutions. This includes the use of inter-operational processes and procedures.  \n \n* Deliver high quality technical and/or consulting solutions to clients in response to security requirements.  \n \n* Perform multiple assigned technical tasks including system administration, monitoring, research, and analysis of the security solutions \n \n* Using IT Security Industry experience, monitor client security systems and events to detect and investigate threats, and work regularly with client teams to enhance current solutions to improve client security posture. This often includes using tools and methods to analyze and customize client solutions.  \n \n* Have professional, operational, and inter-personal skills to function effectively in collaborative high stakes and high stress situations with clients. IT Specialist CompuCom February 2010  –  September 2013  (3 years 8 months) Intel CRU1, UltraPark, Heredia, Costa Rica Virtual Machines Provisioning: \n \n* Responsible for the End Of Life process of Virtual Machines stored in VMWare ESXi hosts in secured and non-secured environments. Removal of Windows Server monitoring records, Symantec Veritas backups, Intel Enforcement security notifications and Active Directory records. \n \n* Improved the End Of Life process, attacking the bureaucracy of the process, acquiring roles of other positions that provided assistance to complete it but slowed down the Service Level Agreement established previously. The result was a faster process with a better quality of service. \n \nOPS Analyst Batch Support (Production / Pre-Production): \n \n* Provided support and execution of Autosys / SAP / Teradata / AbInitio batch Jobs, ensuring that all jobs executed flawlessly within the distributed applications servers in order to meet and exceed customer's expectations. \n \n* Monitored jobs while production batch failures to support personnel in timely manner, report outages, provided failure resolutions based on document knowledge articles and participated in crisis and postmortem meetings. \n \n* Trainer for new hires of the Ops Analysts position. \n \nGSM Applications: \n \n* Support to global servers and worldwide applications infrastructure systems such SAP, TIBCO, WIINGS, SQL Server, McAfee Antivirus, Service for Revenue and Floor Manufacturing services through remote monitoring and incident management tools. \n \n* Assisted in the documentation, troubleshooting and resolution of incidents in physical and virtual servers such servers down, NIC failures, SAN and NAS Adaptors failures, applications and services failures, performance issues, storage issues and SQL related issues. \n \nOffice Service Desk: \n* Assistance on incidents and how-to guidance on Microsoft Windows, Microsoft Office and other end-user applications for Intel employees and contractors. IT Specialist CompuCom February 2010  –  September 2013  (3 years 8 months) Intel CRU1, UltraPark, Heredia, Costa Rica Virtual Machines Provisioning: \n \n* Responsible for the End Of Life process of Virtual Machines stored in VMWare ESXi hosts in secured and non-secured environments. Removal of Windows Server monitoring records, Symantec Veritas backups, Intel Enforcement security notifications and Active Directory records. \n \n* Improved the End Of Life process, attacking the bureaucracy of the process, acquiring roles of other positions that provided assistance to complete it but slowed down the Service Level Agreement established previously. The result was a faster process with a better quality of service. \n \nOPS Analyst Batch Support (Production / Pre-Production): \n \n* Provided support and execution of Autosys / SAP / Teradata / AbInitio batch Jobs, ensuring that all jobs executed flawlessly within the distributed applications servers in order to meet and exceed customer's expectations. \n \n* Monitored jobs while production batch failures to support personnel in timely manner, report outages, provided failure resolutions based on document knowledge articles and participated in crisis and postmortem meetings. \n \n* Trainer for new hires of the Ops Analysts position. \n \nGSM Applications: \n \n* Support to global servers and worldwide applications infrastructure systems such SAP, TIBCO, WIINGS, SQL Server, McAfee Antivirus, Service for Revenue and Floor Manufacturing services through remote monitoring and incident management tools. \n \n* Assisted in the documentation, troubleshooting and resolution of incidents in physical and virtual servers such servers down, NIC failures, SAN and NAS Adaptors failures, applications and services failures, performance issues, storage issues and SQL related issues. \n \nOffice Service Desk: \n* Assistance on incidents and how-to guidance on Microsoft Windows, Microsoft Office and other end-user applications for Intel employees and contractors. Sony TS1 Sykes April 2008  –  February 2010  (1 year 11 months) 700 Parkway, Global Park La Aurora de Heredia, Costa Rica * Frontend 1st Level Agent of the Tech Support of the Sony Electronics division, specialized in the Sony VAIO computers line. \n \n* Provided support and how-to assistance to end users using Windows XP, Windows Vista, Windows 7, Microsoft Office 2003/2007, networking connectivity, Sony applications, printing and connectivity with other Sony products. \n \n* Assisted as backup supervisor for Sony managers in tasks such providing feedback to Sony agents, metrics, resolution for difficult cases and assistance for new hires. Sony TS1 Sykes April 2008  –  February 2010  (1 year 11 months) 700 Parkway, Global Park La Aurora de Heredia, Costa Rica * Frontend 1st Level Agent of the Tech Support of the Sony Electronics division, specialized in the Sony VAIO computers line. \n \n* Provided support and how-to assistance to end users using Windows XP, Windows Vista, Windows 7, Microsoft Office 2003/2007, networking connectivity, Sony applications, printing and connectivity with other Sony products. \n \n* Assisted as backup supervisor for Sony managers in tasks such providing feedback to Sony agents, metrics, resolution for difficult cases and assistance for new hires. Software Developer GBSYS October 2007  –  February 2008  (5 months) 400 mts sur y 25 mts oeste de la Pop’s de Curridabat, San José, Costa Rica * Developed and debugged a proxy connection tool for Belen's town council website using JavaScript and C++, this tool assisted the website in order to connect and proceed with payments to other companies that provided services such AyA, ICE, Cabletica and others. \n \n* Debugged a database management application and added a module required created using Oracle PL/SQL for JASEC (Junta Administrativa de Servicios Eléctricos de Cartago), this application managed all records and expenses of JASEC. Software Developer GBSYS October 2007  –  February 2008  (5 months) 400 mts sur y 25 mts oeste de la Pop’s de Curridabat, San José, Costa Rica * Developed and debugged a proxy connection tool for Belen's town council website using JavaScript and C++, this tool assisted the website in order to connect and proceed with payments to other companies that provided services such AyA, ICE, Cabletica and others. \n \n* Debugged a database management application and added a module required created using Oracle PL/SQL for JASEC (Junta Administrativa de Servicios Eléctricos de Cartago), this application managed all records and expenses of JASEC. Languages Spanish Native or bilingual proficiency English Native or bilingual proficiency Spanish Native or bilingual proficiency English Native or bilingual proficiency Spanish Native or bilingual proficiency English Native or bilingual proficiency Native or bilingual proficiency Native or bilingual proficiency Skills Windows Server Servers Windows 7 Server Administration Customer Service Microsoft SQL Server Business Services Help Desk Support Ubuntu Google Apps Troubleshooting Teamwork Self-confidence Social Networking Open Source MongoDB Service Now IXP Autosys Guitarist Technical Support IDS IPS Network Security Information Security Data Analysis See 11+     See less Skills  Windows Server Servers Windows 7 Server Administration Customer Service Microsoft SQL Server Business Services Help Desk Support Ubuntu Google Apps Troubleshooting Teamwork Self-confidence Social Networking Open Source MongoDB Service Now IXP Autosys Guitarist Technical Support IDS IPS Network Security Information Security Data Analysis See 11+     See less Windows Server Servers Windows 7 Server Administration Customer Service Microsoft SQL Server Business Services Help Desk Support Ubuntu Google Apps Troubleshooting Teamwork Self-confidence Social Networking Open Source MongoDB Service Now IXP Autosys Guitarist Technical Support IDS IPS Network Security Information Security Data Analysis See 11+     See less Windows Server Servers Windows 7 Server Administration Customer Service Microsoft SQL Server Business Services Help Desk Support Ubuntu Google Apps Troubleshooting Teamwork Self-confidence Social Networking Open Source MongoDB Service Now IXP Autosys Guitarist Technical Support IDS IPS Network Security Information Security Data Analysis See 11+     See less Education Universidad Continental de las Ciencias y el Arte Bachelor's degree,  Music Teacher Education , On going 2013  – 2015 Universidad Latina de Costa Rica Bachelor of Engineering (B.E.),  Network and Communications , On hiatus 2010  – 2013 Colegio Técnico Profesional de Calle Blancos Technician,  Software Development , Completed 2005  – 2007 Universidad Continental de las Ciencias y el Arte Bachelor's degree,  Music Teacher Education , On going 2013  – 2015 Universidad Continental de las Ciencias y el Arte Bachelor's degree,  Music Teacher Education , On going 2013  – 2015 Universidad Continental de las Ciencias y el Arte Bachelor's degree,  Music Teacher Education , On going 2013  – 2015 Universidad Latina de Costa Rica Bachelor of Engineering (B.E.),  Network and Communications , On hiatus 2010  – 2013 Universidad Latina de Costa Rica Bachelor of Engineering (B.E.),  Network and Communications , On hiatus 2010  – 2013 Universidad Latina de Costa Rica Bachelor of Engineering (B.E.),  Network and Communications , On hiatus 2010  – 2013 Colegio Técnico Profesional de Calle Blancos Technician,  Software Development , Completed 2005  – 2007 Colegio Técnico Profesional de Calle Blancos Technician,  Software Development , Completed 2005  – 2007 Colegio Técnico Profesional de Calle Blancos Technician,  Software Development , Completed 2005  – 2007 ", "Summary I like to solve problems using technology. Specialties:large scale data analysis, web based applications, general nerdery, coffee drinker. Summary I like to solve problems using technology. Specialties:large scale data analysis, web based applications, general nerdery, coffee drinker. I like to solve problems using technology. Specialties:large scale data analysis, web based applications, general nerdery, coffee drinker. I like to solve problems using technology. Specialties:large scale data analysis, web based applications, general nerdery, coffee drinker. Experience Chief Data Scientist / Architect, HP Ent Sec Product Solutions Hewlett-Packard April 2013  –  September 2014  (1 year 6 months) I worked on doing interesting things with lots of data in real time to provide relevant answers to difficult questions of customers of the HP Enterprise Security Software group. labs hacker Indeed.com November 2012  –  March 2013  (5 months) Austin, TX A product research group interested in improving the already stellar tools available to help people find jobs. Board Member Snoball May 2011  –  2013  (2 years) Austin, TX I am a member of the Board of Directors for Snoball, Inc helping to set strategy for the greatest startup in the online donation space. ceo Snoball May 2011  –  October 2012  (1 year 6 months) Austin, TX I had the amazing privilege of leading the best team of passionate hackers on the planet. We're trying to change the world by changing the way people support non-profits and we have a lot of fun doing it. President and Co-Founder Collective Labs 2010  –  2012  (2 years) Collective Labs is a development group focused on making useful tools for the mobile workforce. Our first product launch is BlinkSend, which provides professional document sharing. PhD Student Texas A&M University July 2008  –  2011  (3 years) currently on hiatus from PhD studies. CEO Phodder July 2009  –  October 2010  (1 year 4 months) Phodder is a small startup creating unique mobile applications with an emphasis on social mobile media. I recently sold Phodder to another group of developers and I'm excited to see them take it further. Malware Analyst CERT 2008  –  2009  (1 year) Took apart bad things and helped our country. X-Force Threat Analyst IBM Internet Security Systems (ISS) 2007  –  July 2008  (1 year) Malware and threat analysis to large scale networks, individual systems and the internet at large. Senior Threat Analyst IBM Security Intelligence January 2003  –  July 2008  (5 years 7 months) We were tasked with the analysis of new vulnerabilities in any software package used by IBM or it's customers. Malware analysis was performed as needed, as well as consulting to the Security Operations Center when they needed help formulating a proper response to network attacks.  \n \nI am also tasked with the creation of new rules in ArcSight to detect new threats to the network infrastructure for IBM and it's customers. \n \nDescription of the Security Intelligence service: \nhttp://www-1.ibm.com/services/us/index.wss/offering/bcrs/a1008776 Security Intelligence Team Lead IBM January 2003  –  July 2008  (5 years 7 months) Led an amazing team of security hackers and professionals in assessing threats to IBM, our customers, and the internet at large and then communicating those threats in actionable ways. Technology Guy IMB 2000  –  2002  (2 years) Worked with a non-profit organization on all technology and computer security issues for field workers in Western Europe. Special Projects Coordinator Progress Rail Services 1997  –  2000  (3 years) I solved problems using existing and new technologies in the logistics and rail transportation business. Chief Data Scientist / Architect, HP Ent Sec Product Solutions Hewlett-Packard April 2013  –  September 2014  (1 year 6 months) I worked on doing interesting things with lots of data in real time to provide relevant answers to difficult questions of customers of the HP Enterprise Security Software group. Chief Data Scientist / Architect, HP Ent Sec Product Solutions Hewlett-Packard April 2013  –  September 2014  (1 year 6 months) I worked on doing interesting things with lots of data in real time to provide relevant answers to difficult questions of customers of the HP Enterprise Security Software group. labs hacker Indeed.com November 2012  –  March 2013  (5 months) Austin, TX A product research group interested in improving the already stellar tools available to help people find jobs. labs hacker Indeed.com November 2012  –  March 2013  (5 months) Austin, TX A product research group interested in improving the already stellar tools available to help people find jobs. Board Member Snoball May 2011  –  2013  (2 years) Austin, TX I am a member of the Board of Directors for Snoball, Inc helping to set strategy for the greatest startup in the online donation space. Board Member Snoball May 2011  –  2013  (2 years) Austin, TX I am a member of the Board of Directors for Snoball, Inc helping to set strategy for the greatest startup in the online donation space. ceo Snoball May 2011  –  October 2012  (1 year 6 months) Austin, TX I had the amazing privilege of leading the best team of passionate hackers on the planet. We're trying to change the world by changing the way people support non-profits and we have a lot of fun doing it. ceo Snoball May 2011  –  October 2012  (1 year 6 months) Austin, TX I had the amazing privilege of leading the best team of passionate hackers on the planet. We're trying to change the world by changing the way people support non-profits and we have a lot of fun doing it. President and Co-Founder Collective Labs 2010  –  2012  (2 years) Collective Labs is a development group focused on making useful tools for the mobile workforce. Our first product launch is BlinkSend, which provides professional document sharing. President and Co-Founder Collective Labs 2010  –  2012  (2 years) Collective Labs is a development group focused on making useful tools for the mobile workforce. Our first product launch is BlinkSend, which provides professional document sharing. PhD Student Texas A&M University July 2008  –  2011  (3 years) currently on hiatus from PhD studies. PhD Student Texas A&M University July 2008  –  2011  (3 years) currently on hiatus from PhD studies. CEO Phodder July 2009  –  October 2010  (1 year 4 months) Phodder is a small startup creating unique mobile applications with an emphasis on social mobile media. I recently sold Phodder to another group of developers and I'm excited to see them take it further. CEO Phodder July 2009  –  October 2010  (1 year 4 months) Phodder is a small startup creating unique mobile applications with an emphasis on social mobile media. I recently sold Phodder to another group of developers and I'm excited to see them take it further. Malware Analyst CERT 2008  –  2009  (1 year) Took apart bad things and helped our country. Malware Analyst CERT 2008  –  2009  (1 year) Took apart bad things and helped our country. X-Force Threat Analyst IBM Internet Security Systems (ISS) 2007  –  July 2008  (1 year) Malware and threat analysis to large scale networks, individual systems and the internet at large. X-Force Threat Analyst IBM Internet Security Systems (ISS) 2007  –  July 2008  (1 year) Malware and threat analysis to large scale networks, individual systems and the internet at large. Senior Threat Analyst IBM Security Intelligence January 2003  –  July 2008  (5 years 7 months) We were tasked with the analysis of new vulnerabilities in any software package used by IBM or it's customers. Malware analysis was performed as needed, as well as consulting to the Security Operations Center when they needed help formulating a proper response to network attacks.  \n \nI am also tasked with the creation of new rules in ArcSight to detect new threats to the network infrastructure for IBM and it's customers. \n \nDescription of the Security Intelligence service: \nhttp://www-1.ibm.com/services/us/index.wss/offering/bcrs/a1008776 Senior Threat Analyst IBM Security Intelligence January 2003  –  July 2008  (5 years 7 months) We were tasked with the analysis of new vulnerabilities in any software package used by IBM or it's customers. Malware analysis was performed as needed, as well as consulting to the Security Operations Center when they needed help formulating a proper response to network attacks.  \n \nI am also tasked with the creation of new rules in ArcSight to detect new threats to the network infrastructure for IBM and it's customers. \n \nDescription of the Security Intelligence service: \nhttp://www-1.ibm.com/services/us/index.wss/offering/bcrs/a1008776 Security Intelligence Team Lead IBM January 2003  –  July 2008  (5 years 7 months) Led an amazing team of security hackers and professionals in assessing threats to IBM, our customers, and the internet at large and then communicating those threats in actionable ways. Security Intelligence Team Lead IBM January 2003  –  July 2008  (5 years 7 months) Led an amazing team of security hackers and professionals in assessing threats to IBM, our customers, and the internet at large and then communicating those threats in actionable ways. Technology Guy IMB 2000  –  2002  (2 years) Worked with a non-profit organization on all technology and computer security issues for field workers in Western Europe. Technology Guy IMB 2000  –  2002  (2 years) Worked with a non-profit organization on all technology and computer security issues for field workers in Western Europe. Special Projects Coordinator Progress Rail Services 1997  –  2000  (3 years) I solved problems using existing and new technologies in the logistics and rail transportation business. Special Projects Coordinator Progress Rail Services 1997  –  2000  (3 years) I solved problems using existing and new technologies in the logistics and rail transportation business. Languages French French French Skills Data Analysis Linux JavaScript Computer Security Information Security Malware Analysis Security Start-ups SQL HTML PHP Apache Risk Assessment Python CSS Unix Penetration Testing Network Security Perl CISSP Computer Forensics Bash Shell Scripting Intrusion Detection Strategy Enterprise Software Vulnerability Assessment jQuery MongoDB Networking Firewalls General Awesomeness Mobile Applications Cascalog Hadoop Big Data MySQL Web Applications Amazon Web Services... Git Open Source Ruby Distributed Systems Django See 29+     See less Skills  Data Analysis Linux JavaScript Computer Security Information Security Malware Analysis Security Start-ups SQL HTML PHP Apache Risk Assessment Python CSS Unix Penetration Testing Network Security Perl CISSP Computer Forensics Bash Shell Scripting Intrusion Detection Strategy Enterprise Software Vulnerability Assessment jQuery MongoDB Networking Firewalls General Awesomeness Mobile Applications Cascalog Hadoop Big Data MySQL Web Applications Amazon Web Services... Git Open Source Ruby Distributed Systems Django See 29+     See less Data Analysis Linux JavaScript Computer Security Information Security Malware Analysis Security Start-ups SQL HTML PHP Apache Risk Assessment Python CSS Unix Penetration Testing Network Security Perl CISSP Computer Forensics Bash Shell Scripting Intrusion Detection Strategy Enterprise Software Vulnerability Assessment jQuery MongoDB Networking Firewalls General Awesomeness Mobile Applications Cascalog Hadoop Big Data MySQL Web Applications Amazon Web Services... Git Open Source Ruby Distributed Systems Django See 29+     See less Data Analysis Linux JavaScript Computer Security Information Security Malware Analysis Security Start-ups SQL HTML PHP Apache Risk Assessment Python CSS Unix Penetration Testing Network Security Perl CISSP Computer Forensics Bash Shell Scripting Intrusion Detection Strategy Enterprise Software Vulnerability Assessment jQuery MongoDB Networking Firewalls General Awesomeness Mobile Applications Cascalog Hadoop Big Data MySQL Web Applications Amazon Web Services... Git Open Source Ruby Distributed Systems Django See 29+     See less Education Texas A&M University Grad Student,  CS ,  specifically Information Retrieval 2008  – 2012 Texas State University-San Marcos B.S.,  C.S. 1999  – 2001 Texas A&M University Grad Student,  CS ,  specifically Information Retrieval 2008  – 2012 Texas A&M University Grad Student,  CS ,  specifically Information Retrieval 2008  – 2012 Texas A&M University Grad Student,  CS ,  specifically Information Retrieval 2008  – 2012 Texas State University-San Marcos B.S.,  C.S. 1999  – 2001 Texas State University-San Marcos B.S.,  C.S. 1999  – 2001 Texas State University-San Marcos B.S.,  C.S. 1999  – 2001 ", "Skills IPS Intrusion Detection Managed Security... Vulnerability Management Vulnerability Assessment Information Security IDS Checkpoint Information Security... Penetration Testing PCI DSS CISSP Application Security Computer Security Firewalls Program Management Project Management Deployment Strategies Security Systems... Account Management Threat Analysis Security Operations Threat Intelligence Security Consulting Transition Management Operations Management Team Leadership Cross-functional Team... Customer Service Long-term Customer... Disaster Recovery Data Security Security Architecture... Managed Services Identity Management See 20+     See less Skills  IPS Intrusion Detection Managed Security... Vulnerability Management Vulnerability Assessment Information Security IDS Checkpoint Information Security... Penetration Testing PCI DSS CISSP Application Security Computer Security Firewalls Program Management Project Management Deployment Strategies Security Systems... Account Management Threat Analysis Security Operations Threat Intelligence Security Consulting Transition Management Operations Management Team Leadership Cross-functional Team... Customer Service Long-term Customer... Disaster Recovery Data Security Security Architecture... Managed Services Identity Management See 20+     See less IPS Intrusion Detection Managed Security... Vulnerability Management Vulnerability Assessment Information Security IDS Checkpoint Information Security... Penetration Testing PCI DSS CISSP Application Security Computer Security Firewalls Program Management Project Management Deployment Strategies Security Systems... Account Management Threat Analysis Security Operations Threat Intelligence Security Consulting Transition Management Operations Management Team Leadership Cross-functional Team... Customer Service Long-term Customer... Disaster Recovery Data Security Security Architecture... Managed Services Identity Management See 20+     See less IPS Intrusion Detection Managed Security... Vulnerability Management Vulnerability Assessment Information Security IDS Checkpoint Information Security... Penetration Testing PCI DSS CISSP Application Security Computer Security Firewalls Program Management Project Management Deployment Strategies Security Systems... Account Management Threat Analysis Security Operations Threat Intelligence Security Consulting Transition Management Operations Management Team Leadership Cross-functional Team... Customer Service Long-term Customer... Disaster Recovery Data Security Security Architecture... Managed Services Identity Management See 20+     See less ", "Experience Threat Analyst IBM September 2014  – Present (1 year) Boulder, Colorado PC Support Technician SUNY Upstate Medical University November 2013  –  September 2014  (11 months) Game Master Fun Junction October 2008  –  September 2014  (6 years) Resident Assistant Founder's Hall January 2012  –  August 2013  (1 year 8 months) PC Support Intern SUNY Upstate Medical University July 2009  –  December 2010  (1 year 6 months) Threat Analyst IBM September 2014  – Present (1 year) Boulder, Colorado Threat Analyst IBM September 2014  – Present (1 year) Boulder, Colorado PC Support Technician SUNY Upstate Medical University November 2013  –  September 2014  (11 months) PC Support Technician SUNY Upstate Medical University November 2013  –  September 2014  (11 months) Game Master Fun Junction October 2008  –  September 2014  (6 years) Game Master Fun Junction October 2008  –  September 2014  (6 years) Resident Assistant Founder's Hall January 2012  –  August 2013  (1 year 8 months) Resident Assistant Founder's Hall January 2012  –  August 2013  (1 year 8 months) PC Support Intern SUNY Upstate Medical University July 2009  –  December 2010  (1 year 6 months) PC Support Intern SUNY Upstate Medical University July 2009  –  December 2010  (1 year 6 months) Skills Microsoft Exchange Microsoft Windows Active Directory DNS DHCP Windows System... Windows support Windows Registry Network Security OS X VMware ESX Network Administration Computer Hardware Linux Skills  Microsoft Exchange Microsoft Windows Active Directory DNS DHCP Windows System... Windows support Windows Registry Network Security OS X VMware ESX Network Administration Computer Hardware Linux Microsoft Exchange Microsoft Windows Active Directory DNS DHCP Windows System... Windows support Windows Registry Network Security OS X VMware ESX Network Administration Computer Hardware Linux Microsoft Exchange Microsoft Windows Active Directory DNS DHCP Windows System... Windows support Windows Registry Network Security OS X VMware ESX Network Administration Computer Hardware Linux Education University of Advancing Technology Bachelor of Science (BS),  Network Security 2011  – 2014 ITT Technical Institute-Liverpool Associate of Arts (AA),  Multimedia 2008  – 2010 University of Advancing Technology Bachelor of Science (BS),  Network Security 2011  – 2014 University of Advancing Technology Bachelor of Science (BS),  Network Security 2011  – 2014 University of Advancing Technology Bachelor of Science (BS),  Network Security 2011  – 2014 ITT Technical Institute-Liverpool Associate of Arts (AA),  Multimedia 2008  – 2010 ITT Technical Institute-Liverpool Associate of Arts (AA),  Multimedia 2008  – 2010 ITT Technical Institute-Liverpool Associate of Arts (AA),  Multimedia 2008  – 2010 ", "Summary I am a purpose driven security expert. My goal is to provide a secure environment for my group to thrive. Summary I am a purpose driven security expert. My goal is to provide a secure environment for my group to thrive. I am a purpose driven security expert. My goal is to provide a secure environment for my group to thrive. I am a purpose driven security expert. My goal is to provide a secure environment for my group to thrive. Experience Threat Analyst IBM November 2014  – Present (10 months) Boulder Colorado IT Field Service Manager VideoMining Corporation November 2013  –  July 2014  (9 months) State College, Pennsylvania Area Systems Administrator Pennsylvania State University August 2009  –  May 2013  (3 years 10 months) Researched, Developed, and Administered Virtual Hands on Labs for the IT classes. These labs covered: Packet analysis, Snort rules writing, Cryptography, Linux, Computer Forensics, protocol analysis with Wireshark, and Cisco Router configuration.  \n \nManaged Team of Interns to test and research new labs \n \nServed as administrator for the College's Cvent and Second Life efforts. SOC Engineer Wyle May 2007  –  August 2009  (2 years 4 months) Performed ArcSight IDS analysis, AirDefence analysis and incident management. NOC Analyst Wyle May 2005  –  May 2007  (2 years 1 month) Performed ArcSight IDS analysis, Argent Alert management, Server Maintenance, Incident handling and Backups Senior Systems Administrator XO Communications August 2000  –  May 2005  (4 years 10 months) Reston Va User Desktop Support, Desktop support Instruction, Data Recovery, Veritas backups, and Exchange administration Help Desk Associate Teligent 1998  –  2000  (2 years) User Desktop Support, Data Recovery, Veritas backups, and exchange administration. Help Desk Associate SAIC 1996  –  1998  (2 years) Phone IT support Threat Analyst IBM November 2014  – Present (10 months) Boulder Colorado Threat Analyst IBM November 2014  – Present (10 months) Boulder Colorado IT Field Service Manager VideoMining Corporation November 2013  –  July 2014  (9 months) State College, Pennsylvania Area IT Field Service Manager VideoMining Corporation November 2013  –  July 2014  (9 months) State College, Pennsylvania Area Systems Administrator Pennsylvania State University August 2009  –  May 2013  (3 years 10 months) Researched, Developed, and Administered Virtual Hands on Labs for the IT classes. These labs covered: Packet analysis, Snort rules writing, Cryptography, Linux, Computer Forensics, protocol analysis with Wireshark, and Cisco Router configuration.  \n \nManaged Team of Interns to test and research new labs \n \nServed as administrator for the College's Cvent and Second Life efforts. Systems Administrator Pennsylvania State University August 2009  –  May 2013  (3 years 10 months) Researched, Developed, and Administered Virtual Hands on Labs for the IT classes. These labs covered: Packet analysis, Snort rules writing, Cryptography, Linux, Computer Forensics, protocol analysis with Wireshark, and Cisco Router configuration.  \n \nManaged Team of Interns to test and research new labs \n \nServed as administrator for the College's Cvent and Second Life efforts. SOC Engineer Wyle May 2007  –  August 2009  (2 years 4 months) Performed ArcSight IDS analysis, AirDefence analysis and incident management. SOC Engineer Wyle May 2007  –  August 2009  (2 years 4 months) Performed ArcSight IDS analysis, AirDefence analysis and incident management. NOC Analyst Wyle May 2005  –  May 2007  (2 years 1 month) Performed ArcSight IDS analysis, Argent Alert management, Server Maintenance, Incident handling and Backups NOC Analyst Wyle May 2005  –  May 2007  (2 years 1 month) Performed ArcSight IDS analysis, Argent Alert management, Server Maintenance, Incident handling and Backups Senior Systems Administrator XO Communications August 2000  –  May 2005  (4 years 10 months) Reston Va User Desktop Support, Desktop support Instruction, Data Recovery, Veritas backups, and Exchange administration Senior Systems Administrator XO Communications August 2000  –  May 2005  (4 years 10 months) Reston Va User Desktop Support, Desktop support Instruction, Data Recovery, Veritas backups, and Exchange administration Help Desk Associate Teligent 1998  –  2000  (2 years) User Desktop Support, Data Recovery, Veritas backups, and exchange administration. Help Desk Associate Teligent 1998  –  2000  (2 years) User Desktop Support, Data Recovery, Veritas backups, and exchange administration. Help Desk Associate SAIC 1996  –  1998  (2 years) Phone IT support Help Desk Associate SAIC 1996  –  1998  (2 years) Phone IT support Skills Computer Security Wireshark Snort Computer Forensics Technical Support Linux VMware Cisco IOS Microsoft Exchange Help Desk Support Network Security Windows Ubuntu Network Forensics Public Speaking Education Citrix ArcSight Amazon Web Services... Amazon EC2 Amazon S3 Amazon RDS Amazon SQS Amazon CloudFront XenServer Security Servers IDS Firewalls System Administration Information Security Network Administration Group Policy Active Directory DNS Operating Systems VPN CISSP Virtualization TCP/IP Windows 7 OS X Information Assurance Cisco Routers Microsoft Office Incident Management Testing Networking Troubleshooting See 34+     See less Skills  Computer Security Wireshark Snort Computer Forensics Technical Support Linux VMware Cisco IOS Microsoft Exchange Help Desk Support Network Security Windows Ubuntu Network Forensics Public Speaking Education Citrix ArcSight Amazon Web Services... Amazon EC2 Amazon S3 Amazon RDS Amazon SQS Amazon CloudFront XenServer Security Servers IDS Firewalls System Administration Information Security Network Administration Group Policy Active Directory DNS Operating Systems VPN CISSP Virtualization TCP/IP Windows 7 OS X Information Assurance Cisco Routers Microsoft Office Incident Management Testing Networking Troubleshooting See 34+     See less Computer Security Wireshark Snort Computer Forensics Technical Support Linux VMware Cisco IOS Microsoft Exchange Help Desk Support Network Security Windows Ubuntu Network Forensics Public Speaking Education Citrix ArcSight Amazon Web Services... Amazon EC2 Amazon S3 Amazon RDS Amazon SQS Amazon CloudFront XenServer Security Servers IDS Firewalls System Administration Information Security Network Administration Group Policy Active Directory DNS Operating Systems VPN CISSP Virtualization TCP/IP Windows 7 OS X Information Assurance Cisco Routers Microsoft Office Incident Management Testing Networking Troubleshooting See 34+     See less Computer Security Wireshark Snort Computer Forensics Technical Support Linux VMware Cisco IOS Microsoft Exchange Help Desk Support Network Security Windows Ubuntu Network Forensics Public Speaking Education Citrix ArcSight Amazon Web Services... Amazon EC2 Amazon S3 Amazon RDS Amazon SQS Amazon CloudFront XenServer Security Servers IDS Firewalls System Administration Information Security Network Administration Group Policy Active Directory DNS Operating Systems VPN CISSP Virtualization TCP/IP Windows 7 OS X Information Assurance Cisco Routers Microsoft Office Incident Management Testing Networking Troubleshooting See 34+     See less Education Penn State University Bachelor of Arts (B.A.),  History , 3.53 2009  – 2014 Activities and Societies:  Phi Alpha Theta - History Honors Society Radford University Bachelor's degree,  Public Relations , Advertising, and Applied Communication 1991  – 2014 Penn State University Bachelor of Arts (B.A.),  History , 3.53 2009  – 2014 Activities and Societies:  Phi Alpha Theta - History Honors Society Penn State University Bachelor of Arts (B.A.),  History , 3.53 2009  – 2014 Activities and Societies:  Phi Alpha Theta - History Honors Society Penn State University Bachelor of Arts (B.A.),  History , 3.53 2009  – 2014 Activities and Societies:  Phi Alpha Theta - History Honors Society Radford University Bachelor's degree,  Public Relations , Advertising, and Applied Communication 1991  – 2014 Radford University Bachelor's degree,  Public Relations , Advertising, and Applied Communication 1991  – 2014 Radford University Bachelor's degree,  Public Relations , Advertising, and Applied Communication 1991  – 2014 ", "Experience Threat Analyst IBM July 2014  – Present (1 year 2 months) Campinas Area, Brazil Analista de Segurança da Informação IBM February 2013  –  July 2014  (1 year 6 months) Campinas Area, Brazil Técnico de Suporte a Sistemas IBM October 2010  –  September 2011  (1 year) Threat Analyst IBM July 2014  – Present (1 year 2 months) Campinas Area, Brazil Threat Analyst IBM July 2014  – Present (1 year 2 months) Campinas Area, Brazil Analista de Segurança da Informação IBM February 2013  –  July 2014  (1 year 6 months) Campinas Area, Brazil Analista de Segurança da Informação IBM February 2013  –  July 2014  (1 year 6 months) Campinas Area, Brazil Técnico de Suporte a Sistemas IBM October 2010  –  September 2011  (1 year) Técnico de Suporte a Sistemas IBM October 2010  –  September 2011  (1 year) Languages Português Native or bilingual proficiency Inglês Full professional proficiency Espanhol Full professional proficiency Francês Limited working proficiency Português Native or bilingual proficiency Inglês Full professional proficiency Espanhol Full professional proficiency Francês Limited working proficiency Português Native or bilingual proficiency Inglês Full professional proficiency Espanhol Full professional proficiency Francês Limited working proficiency Native or bilingual proficiency Full professional proficiency Full professional proficiency Limited working proficiency Skills English Spanish Information Security Computer Security Network Security Firewalls IDS IPS VPN TCP/IP Access Control Telecommunications Risk Management Security Operations Message Labs Spam Filtering DDoS Mitigation Web Application Firewall DLP French Segurança da informação Sistema de detecção Segurança de... Segurança de rede Gestão de segurança da... See 10+     See less Skills  English Spanish Information Security Computer Security Network Security Firewalls IDS IPS VPN TCP/IP Access Control Telecommunications Risk Management Security Operations Message Labs Spam Filtering DDoS Mitigation Web Application Firewall DLP French Segurança da informação Sistema de detecção Segurança de... Segurança de rede Gestão de segurança da... See 10+     See less English Spanish Information Security Computer Security Network Security Firewalls IDS IPS VPN TCP/IP Access Control Telecommunications Risk Management Security Operations Message Labs Spam Filtering DDoS Mitigation Web Application Firewall DLP French Segurança da informação Sistema de detecção Segurança de... Segurança de rede Gestão de segurança da... See 10+     See less English Spanish Information Security Computer Security Network Security Firewalls IDS IPS VPN TCP/IP Access Control Telecommunications Risk Management Security Operations Message Labs Spam Filtering DDoS Mitigation Web Application Firewall DLP French Segurança da informação Sistema de detecção Segurança de... Segurança de rede Gestão de segurança da... See 10+     See less Education Pontifícia Universidade Católica de Campinas Bacharelado em Sistemas de Informação 2013  – 2016 Pontifícia Universidade Católica de Campinas Bacharelado em Sistemas de Informação 2013  – 2016 Pontifícia Universidade Católica de Campinas Bacharelado em Sistemas de Informação 2013  – 2016 Pontifícia Universidade Católica de Campinas Bacharelado em Sistemas de Informação 2013  – 2016 ", "Summary OVERVIEW \n• Twenty years of Information Assurance and Computer/Digital Network Intelligence experience. \n• Ten years Cyber Security Management; knowledge in NSA and Naval automated databases; leveraged new technologies and designed new processes for cyber threat analysis and reporting. \n• Twenty years of military service with 16 years of military leadership experience. \n• Excellent management skills, adept at independently managing large projects, and communicating goals and requirements to business partners and stakeholders. \n• Active Top Secret/Sensitive Compartment Information (TS/SCI) with CI Polygraph. \n \nQUALIFICATIONS AND EDUCATION \n• M.S, Information Assurance, 2010, Capitol College, Laurel MD \n• Senior Enlisted Academy, Naval War College \n• Certified ECCouncil Certified Ethical Hacker (CEHV8), Comptia Security+, Network+, GIAC Penetration Tester (GPEN), MCSA Windows 7, MCSA Server 2008, Core Impact Certified Professional \n• Basic, Intermediate, and Advanced Digital Network Analysis Course  \n• Network Security and Vulnerabilities Technician Course \n• Information Systems Security Manager Course \n \nTECHNICAL SKILLS \n• Knowledgeable in deep packet analysis, malware analysis, vulnerability analysis, forensics, penetration testing, information system accreditation, offensive and defensive cyber operations, ethical hacking, VMware ESXi, Unix and Windows system administration and security, Cisco router configuration, and academic familiarity with C+, Perl, and Python. Summary OVERVIEW \n• Twenty years of Information Assurance and Computer/Digital Network Intelligence experience. \n• Ten years Cyber Security Management; knowledge in NSA and Naval automated databases; leveraged new technologies and designed new processes for cyber threat analysis and reporting. \n• Twenty years of military service with 16 years of military leadership experience. \n• Excellent management skills, adept at independently managing large projects, and communicating goals and requirements to business partners and stakeholders. \n• Active Top Secret/Sensitive Compartment Information (TS/SCI) with CI Polygraph. \n \nQUALIFICATIONS AND EDUCATION \n• M.S, Information Assurance, 2010, Capitol College, Laurel MD \n• Senior Enlisted Academy, Naval War College \n• Certified ECCouncil Certified Ethical Hacker (CEHV8), Comptia Security+, Network+, GIAC Penetration Tester (GPEN), MCSA Windows 7, MCSA Server 2008, Core Impact Certified Professional \n• Basic, Intermediate, and Advanced Digital Network Analysis Course  \n• Network Security and Vulnerabilities Technician Course \n• Information Systems Security Manager Course \n \nTECHNICAL SKILLS \n• Knowledgeable in deep packet analysis, malware analysis, vulnerability analysis, forensics, penetration testing, information system accreditation, offensive and defensive cyber operations, ethical hacking, VMware ESXi, Unix and Windows system administration and security, Cisco router configuration, and academic familiarity with C+, Perl, and Python. OVERVIEW \n• Twenty years of Information Assurance and Computer/Digital Network Intelligence experience. \n• Ten years Cyber Security Management; knowledge in NSA and Naval automated databases; leveraged new technologies and designed new processes for cyber threat analysis and reporting. \n• Twenty years of military service with 16 years of military leadership experience. \n• Excellent management skills, adept at independently managing large projects, and communicating goals and requirements to business partners and stakeholders. \n• Active Top Secret/Sensitive Compartment Information (TS/SCI) with CI Polygraph. \n \nQUALIFICATIONS AND EDUCATION \n• M.S, Information Assurance, 2010, Capitol College, Laurel MD \n• Senior Enlisted Academy, Naval War College \n• Certified ECCouncil Certified Ethical Hacker (CEHV8), Comptia Security+, Network+, GIAC Penetration Tester (GPEN), MCSA Windows 7, MCSA Server 2008, Core Impact Certified Professional \n• Basic, Intermediate, and Advanced Digital Network Analysis Course  \n• Network Security and Vulnerabilities Technician Course \n• Information Systems Security Manager Course \n \nTECHNICAL SKILLS \n• Knowledgeable in deep packet analysis, malware analysis, vulnerability analysis, forensics, penetration testing, information system accreditation, offensive and defensive cyber operations, ethical hacking, VMware ESXi, Unix and Windows system administration and security, Cisco router configuration, and academic familiarity with C+, Perl, and Python. OVERVIEW \n• Twenty years of Information Assurance and Computer/Digital Network Intelligence experience. \n• Ten years Cyber Security Management; knowledge in NSA and Naval automated databases; leveraged new technologies and designed new processes for cyber threat analysis and reporting. \n• Twenty years of military service with 16 years of military leadership experience. \n• Excellent management skills, adept at independently managing large projects, and communicating goals and requirements to business partners and stakeholders. \n• Active Top Secret/Sensitive Compartment Information (TS/SCI) with CI Polygraph. \n \nQUALIFICATIONS AND EDUCATION \n• M.S, Information Assurance, 2010, Capitol College, Laurel MD \n• Senior Enlisted Academy, Naval War College \n• Certified ECCouncil Certified Ethical Hacker (CEHV8), Comptia Security+, Network+, GIAC Penetration Tester (GPEN), MCSA Windows 7, MCSA Server 2008, Core Impact Certified Professional \n• Basic, Intermediate, and Advanced Digital Network Analysis Course  \n• Network Security and Vulnerabilities Technician Course \n• Information Systems Security Manager Course \n \nTECHNICAL SKILLS \n• Knowledgeable in deep packet analysis, malware analysis, vulnerability analysis, forensics, penetration testing, information system accreditation, offensive and defensive cyber operations, ethical hacking, VMware ESXi, Unix and Windows system administration and security, Cisco router configuration, and academic familiarity with C+, Perl, and Python. Experience Threat Analyst IBM June 2015  – Present (3 months) Austin, Texas Area Computer Network Analysis Instructor TeleCommunication Systems, Inc. November 2011  –  June 2015  (3 years 8 months) • Provide Computer Network Exploitation instruction for multi-service military students at the Joint Cyber Analysis Course (JCAC). \n• Teach advanced network analysis skills, vulnerability analysis, ethical hacking, and penetration testing. Technologies covered include multiple versions of Linux/Unix, Windows, NMAP, Wireshark, Metasploit, and deep packet analysis.  \n• Manage, configure and install multiple virtual networks and operating systems utilizing ESXi Servers, VMware Workstation, and Windows Server 2008/2012. Virtual machines include Linux/Unix/Windows and Dynamips virtual routers. Utilize vSphere Hypervisor and vCenter to manage and deploy highly available, redundant virtual networks to support classroom training infrastructure for an annual throughput of 1500 students. Adjunct Faculty University of West Florida January 2013  –  March 2015  (2 years 3 months) • Lead Professor providing Microsoft Windows 7 and Server 2008 MCSA training, Security+, and Network+ training. \n• Install and configure virtual classroom environment consisting of Windows Server 2008R2, HyperV, and multiple Active Directory domains. Cryptologic Technician Networks - JCAC Department Chief US Navy February 2011  –  November 2011  (10 months) • Managed all facets of the Joint Cyber Analysis Course, a six month in depth computer science, network analysis, and computer network exploitation course.  \n• Managed and supervised a staff of ten military instructors, 50 civilian contractors, and 660 students, to include performance evaluations, staffing decisions, and student retention and reassignment. \n• Responsible for coordinating facilities and information technology support for 16 classrooms, to include classified and unclassified computer networks encompassing 400 workstations and 350 laptop computers. Cryptologic Technician Networks - Senior Cyber Operations Manager US Navy September 2008  –  September 2010  (2 years 1 month) • Senior Cyber Analyst, responsible for all facets of the Digital Network Analysis mission to include tasking, analysis, and reporting. Managed and led a team of 122 network analysts that performed digital network mapping, social network analysis, and malware analysis.  \n• Performed NSA/CSS Threat Operations Center target coordination, prioritized operational requirements related to current cyber events, analyzed and reported on high priority anomalous network traffic.  \n• Administered the personnel training program to include creating engagement cost estimates, budgeting formal/vendor training, and defining success criteria and metrics. Cryptologic Technician Networks - Cyber Operations Analyst US Navy September 2007  –  September 2008  (1 year 1 month) • Lead a team of analysts that provided real world computer network attack and defense exercise planning and support to include exercise command and control as well as scenario development for national level Cyber/CNO exercises to include multi service, worldwide USSTRATCOM initiatives. Efforts analyzed various regional Network Operations Centers ability to recognize, identify, and respond to advanced cyber attacks. Produced after action plans that recommended remediation efforts, policy planning, and industry best practices to enhance threat detection and reporting ability. \n• Developed and implemented joint service standard operating procedures and tactics, techniques, and procedures for testing and training computer network defense analysts, improving their detection and reporting capabilities. Cryptologic Technician Networks - Computer Network Defense/Malware Analysis Chief US Navy November 2006  –  September 2008  (1 year 11 months) • Led a team of military and DoD civilian personnel responsible for conducting both remote and onsite computer network vulnerability assessments utilizing Retina and Internet Security Scanner. Provided vulnerability assessments and mitigation strategies for GiG level Wide Area Networks.  \n• Provided customers with in depth, easy to understand summaries of findings and the associated corrective actions to maintain compliance with applicable laws and directives. Provided follow on testing and analysis to ensure continued vulnerability remediation. Cryptologic Technician Maintenance - Course Manager/Instructor US Navy February 2004  –  October 2006  (2 years 9 months) • Course manager for Basic, Intermediate, and Advanced Network Analysis courses. Responsible for the day to day operations of three cyber operations courses of instruction. \n• Course manager for Information Technician “A” school. Led efforts to introduce an online integrated learning environment, reducing the overall cost of course relocation and delivery. Reviewed and approved proposed curricula and delivery mechanism, to include CBT’s and a virtual environment. \n• Led six instructors in delivering the Navy’s Network Security and Vulnerabilities Technician course of instruction, a senior network administrator course that covered vulnerability analysis, detection and mitigation, router security, and firewall configuration.  \n• Instructed the Journeyman Networking Core course of instruction, a journeyman level system administrator course that encompassed Cisco router configuration, Windows Server, Active Directory, and Microsoft Exchange Server administration. Cryptologic Technician Maintenance - ISSO/System Administrator US Navy March 2001  –  January 2004  (2 years 11 months) • Information Systems Security Officer for both classified and unclassified networks consisting of Communications Security Cryptologic material, Windows and Unix servers and work stations, firewalls, and Cisco routers. Responsible for the creation of System Security Authorization Agreements to obtain and maintain network accreditation.  \n• Network administrator for multiple networks including Windows and Unix servers, Exchange Servers, Cisco routers, and various firewall technologies. Responsible for all aspects of network operations to include the installation and upgrades of servers and hosts, mail server operations, back up strategies and user account maintenance. Threat Analyst IBM June 2015  – Present (3 months) Austin, Texas Area Threat Analyst IBM June 2015  – Present (3 months) Austin, Texas Area Computer Network Analysis Instructor TeleCommunication Systems, Inc. November 2011  –  June 2015  (3 years 8 months) • Provide Computer Network Exploitation instruction for multi-service military students at the Joint Cyber Analysis Course (JCAC). \n• Teach advanced network analysis skills, vulnerability analysis, ethical hacking, and penetration testing. Technologies covered include multiple versions of Linux/Unix, Windows, NMAP, Wireshark, Metasploit, and deep packet analysis.  \n• Manage, configure and install multiple virtual networks and operating systems utilizing ESXi Servers, VMware Workstation, and Windows Server 2008/2012. Virtual machines include Linux/Unix/Windows and Dynamips virtual routers. Utilize vSphere Hypervisor and vCenter to manage and deploy highly available, redundant virtual networks to support classroom training infrastructure for an annual throughput of 1500 students. Computer Network Analysis Instructor TeleCommunication Systems, Inc. November 2011  –  June 2015  (3 years 8 months) • Provide Computer Network Exploitation instruction for multi-service military students at the Joint Cyber Analysis Course (JCAC). \n• Teach advanced network analysis skills, vulnerability analysis, ethical hacking, and penetration testing. Technologies covered include multiple versions of Linux/Unix, Windows, NMAP, Wireshark, Metasploit, and deep packet analysis.  \n• Manage, configure and install multiple virtual networks and operating systems utilizing ESXi Servers, VMware Workstation, and Windows Server 2008/2012. Virtual machines include Linux/Unix/Windows and Dynamips virtual routers. Utilize vSphere Hypervisor and vCenter to manage and deploy highly available, redundant virtual networks to support classroom training infrastructure for an annual throughput of 1500 students. Adjunct Faculty University of West Florida January 2013  –  March 2015  (2 years 3 months) • Lead Professor providing Microsoft Windows 7 and Server 2008 MCSA training, Security+, and Network+ training. \n• Install and configure virtual classroom environment consisting of Windows Server 2008R2, HyperV, and multiple Active Directory domains. Adjunct Faculty University of West Florida January 2013  –  March 2015  (2 years 3 months) • Lead Professor providing Microsoft Windows 7 and Server 2008 MCSA training, Security+, and Network+ training. \n• Install and configure virtual classroom environment consisting of Windows Server 2008R2, HyperV, and multiple Active Directory domains. Cryptologic Technician Networks - JCAC Department Chief US Navy February 2011  –  November 2011  (10 months) • Managed all facets of the Joint Cyber Analysis Course, a six month in depth computer science, network analysis, and computer network exploitation course.  \n• Managed and supervised a staff of ten military instructors, 50 civilian contractors, and 660 students, to include performance evaluations, staffing decisions, and student retention and reassignment. \n• Responsible for coordinating facilities and information technology support for 16 classrooms, to include classified and unclassified computer networks encompassing 400 workstations and 350 laptop computers. Cryptologic Technician Networks - JCAC Department Chief US Navy February 2011  –  November 2011  (10 months) • Managed all facets of the Joint Cyber Analysis Course, a six month in depth computer science, network analysis, and computer network exploitation course.  \n• Managed and supervised a staff of ten military instructors, 50 civilian contractors, and 660 students, to include performance evaluations, staffing decisions, and student retention and reassignment. \n• Responsible for coordinating facilities and information technology support for 16 classrooms, to include classified and unclassified computer networks encompassing 400 workstations and 350 laptop computers. Cryptologic Technician Networks - Senior Cyber Operations Manager US Navy September 2008  –  September 2010  (2 years 1 month) • Senior Cyber Analyst, responsible for all facets of the Digital Network Analysis mission to include tasking, analysis, and reporting. Managed and led a team of 122 network analysts that performed digital network mapping, social network analysis, and malware analysis.  \n• Performed NSA/CSS Threat Operations Center target coordination, prioritized operational requirements related to current cyber events, analyzed and reported on high priority anomalous network traffic.  \n• Administered the personnel training program to include creating engagement cost estimates, budgeting formal/vendor training, and defining success criteria and metrics. Cryptologic Technician Networks - Senior Cyber Operations Manager US Navy September 2008  –  September 2010  (2 years 1 month) • Senior Cyber Analyst, responsible for all facets of the Digital Network Analysis mission to include tasking, analysis, and reporting. Managed and led a team of 122 network analysts that performed digital network mapping, social network analysis, and malware analysis.  \n• Performed NSA/CSS Threat Operations Center target coordination, prioritized operational requirements related to current cyber events, analyzed and reported on high priority anomalous network traffic.  \n• Administered the personnel training program to include creating engagement cost estimates, budgeting formal/vendor training, and defining success criteria and metrics. Cryptologic Technician Networks - Cyber Operations Analyst US Navy September 2007  –  September 2008  (1 year 1 month) • Lead a team of analysts that provided real world computer network attack and defense exercise planning and support to include exercise command and control as well as scenario development for national level Cyber/CNO exercises to include multi service, worldwide USSTRATCOM initiatives. Efforts analyzed various regional Network Operations Centers ability to recognize, identify, and respond to advanced cyber attacks. Produced after action plans that recommended remediation efforts, policy planning, and industry best practices to enhance threat detection and reporting ability. \n• Developed and implemented joint service standard operating procedures and tactics, techniques, and procedures for testing and training computer network defense analysts, improving their detection and reporting capabilities. Cryptologic Technician Networks - Cyber Operations Analyst US Navy September 2007  –  September 2008  (1 year 1 month) • Lead a team of analysts that provided real world computer network attack and defense exercise planning and support to include exercise command and control as well as scenario development for national level Cyber/CNO exercises to include multi service, worldwide USSTRATCOM initiatives. Efforts analyzed various regional Network Operations Centers ability to recognize, identify, and respond to advanced cyber attacks. Produced after action plans that recommended remediation efforts, policy planning, and industry best practices to enhance threat detection and reporting ability. \n• Developed and implemented joint service standard operating procedures and tactics, techniques, and procedures for testing and training computer network defense analysts, improving their detection and reporting capabilities. Cryptologic Technician Networks - Computer Network Defense/Malware Analysis Chief US Navy November 2006  –  September 2008  (1 year 11 months) • Led a team of military and DoD civilian personnel responsible for conducting both remote and onsite computer network vulnerability assessments utilizing Retina and Internet Security Scanner. Provided vulnerability assessments and mitigation strategies for GiG level Wide Area Networks.  \n• Provided customers with in depth, easy to understand summaries of findings and the associated corrective actions to maintain compliance with applicable laws and directives. Provided follow on testing and analysis to ensure continued vulnerability remediation. Cryptologic Technician Networks - Computer Network Defense/Malware Analysis Chief US Navy November 2006  –  September 2008  (1 year 11 months) • Led a team of military and DoD civilian personnel responsible for conducting both remote and onsite computer network vulnerability assessments utilizing Retina and Internet Security Scanner. Provided vulnerability assessments and mitigation strategies for GiG level Wide Area Networks.  \n• Provided customers with in depth, easy to understand summaries of findings and the associated corrective actions to maintain compliance with applicable laws and directives. Provided follow on testing and analysis to ensure continued vulnerability remediation. Cryptologic Technician Maintenance - Course Manager/Instructor US Navy February 2004  –  October 2006  (2 years 9 months) • Course manager for Basic, Intermediate, and Advanced Network Analysis courses. Responsible for the day to day operations of three cyber operations courses of instruction. \n• Course manager for Information Technician “A” school. Led efforts to introduce an online integrated learning environment, reducing the overall cost of course relocation and delivery. Reviewed and approved proposed curricula and delivery mechanism, to include CBT’s and a virtual environment. \n• Led six instructors in delivering the Navy’s Network Security and Vulnerabilities Technician course of instruction, a senior network administrator course that covered vulnerability analysis, detection and mitigation, router security, and firewall configuration.  \n• Instructed the Journeyman Networking Core course of instruction, a journeyman level system administrator course that encompassed Cisco router configuration, Windows Server, Active Directory, and Microsoft Exchange Server administration. Cryptologic Technician Maintenance - Course Manager/Instructor US Navy February 2004  –  October 2006  (2 years 9 months) • Course manager for Basic, Intermediate, and Advanced Network Analysis courses. Responsible for the day to day operations of three cyber operations courses of instruction. \n• Course manager for Information Technician “A” school. Led efforts to introduce an online integrated learning environment, reducing the overall cost of course relocation and delivery. Reviewed and approved proposed curricula and delivery mechanism, to include CBT’s and a virtual environment. \n• Led six instructors in delivering the Navy’s Network Security and Vulnerabilities Technician course of instruction, a senior network administrator course that covered vulnerability analysis, detection and mitigation, router security, and firewall configuration.  \n• Instructed the Journeyman Networking Core course of instruction, a journeyman level system administrator course that encompassed Cisco router configuration, Windows Server, Active Directory, and Microsoft Exchange Server administration. Cryptologic Technician Maintenance - ISSO/System Administrator US Navy March 2001  –  January 2004  (2 years 11 months) • Information Systems Security Officer for both classified and unclassified networks consisting of Communications Security Cryptologic material, Windows and Unix servers and work stations, firewalls, and Cisco routers. Responsible for the creation of System Security Authorization Agreements to obtain and maintain network accreditation.  \n• Network administrator for multiple networks including Windows and Unix servers, Exchange Servers, Cisco routers, and various firewall technologies. Responsible for all aspects of network operations to include the installation and upgrades of servers and hosts, mail server operations, back up strategies and user account maintenance. Cryptologic Technician Maintenance - ISSO/System Administrator US Navy March 2001  –  January 2004  (2 years 11 months) • Information Systems Security Officer for both classified and unclassified networks consisting of Communications Security Cryptologic material, Windows and Unix servers and work stations, firewalls, and Cisco routers. Responsible for the creation of System Security Authorization Agreements to obtain and maintain network accreditation.  \n• Network administrator for multiple networks including Windows and Unix servers, Exchange Servers, Cisco routers, and various firewall technologies. Responsible for all aspects of network operations to include the installation and upgrades of servers and hosts, mail server operations, back up strategies and user account maintenance. Skills Computer Networking Information Assurance MCSA VMware ESX VMware Workstation Penetration Testing Intelligence Analysis University Teaching Cisco Routers Unix Linux Project Management Program Management CompTIA Network+ CompTIA Security+ DoD Information Security Network Security Security Clearance See 4+     See less Skills  Computer Networking Information Assurance MCSA VMware ESX VMware Workstation Penetration Testing Intelligence Analysis University Teaching Cisco Routers Unix Linux Project Management Program Management CompTIA Network+ CompTIA Security+ DoD Information Security Network Security Security Clearance See 4+     See less Computer Networking Information Assurance MCSA VMware ESX VMware Workstation Penetration Testing Intelligence Analysis University Teaching Cisco Routers Unix Linux Project Management Program Management CompTIA Network+ CompTIA Security+ DoD Information Security Network Security Security Clearance See 4+     See less Computer Networking Information Assurance MCSA VMware ESX VMware Workstation Penetration Testing Intelligence Analysis University Teaching Cisco Routers Unix Linux Project Management Program Management CompTIA Network+ CompTIA Security+ DoD Information Security Network Security Security Clearance See 4+     See less Education Capitol College Master of Science (MS),  Computer and Information Systems Security/Information Assurance 2006  – 2008 Capitol College Master of Science (MS),  Computer and Information Systems Security/Information Assurance 2006  – 2008 Capitol College Master of Science (MS),  Computer and Information Systems Security/Information Assurance 2006  – 2008 Capitol College Master of Science (MS),  Computer and Information Systems Security/Information Assurance 2006  – 2008 ", "Summary Professional Profile  \n \nCurrently Matthew McIntosh is a Client Security Manager within the Atos Global Security Services group. He is responsible for gathering monthly KPI metric numbers which include: patch advisory’s, vulnerability management, IDS/IPS, Splunk SIEM, training statistics and Mcafee Anti-virus numbers. He also provides risk and compliance consultation to his client ACT in the areas of (SSAE16, and PCI 3.1) as it pertains to their business. Consulting on varies other IT security areas such as: Data Loss Prevention, Secure Configuration (server hardening), and providing policies, procedures, RACI and control measures are also part of his responsibilities. \n Summary Professional Profile  \n \nCurrently Matthew McIntosh is a Client Security Manager within the Atos Global Security Services group. He is responsible for gathering monthly KPI metric numbers which include: patch advisory’s, vulnerability management, IDS/IPS, Splunk SIEM, training statistics and Mcafee Anti-virus numbers. He also provides risk and compliance consultation to his client ACT in the areas of (SSAE16, and PCI 3.1) as it pertains to their business. Consulting on varies other IT security areas such as: Data Loss Prevention, Secure Configuration (server hardening), and providing policies, procedures, RACI and control measures are also part of his responsibilities. \n Professional Profile  \n \nCurrently Matthew McIntosh is a Client Security Manager within the Atos Global Security Services group. He is responsible for gathering monthly KPI metric numbers which include: patch advisory’s, vulnerability management, IDS/IPS, Splunk SIEM, training statistics and Mcafee Anti-virus numbers. He also provides risk and compliance consultation to his client ACT in the areas of (SSAE16, and PCI 3.1) as it pertains to their business. Consulting on varies other IT security areas such as: Data Loss Prevention, Secure Configuration (server hardening), and providing policies, procedures, RACI and control measures are also part of his responsibilities. \n Professional Profile  \n \nCurrently Matthew McIntosh is a Client Security Manager within the Atos Global Security Services group. He is responsible for gathering monthly KPI metric numbers which include: patch advisory’s, vulnerability management, IDS/IPS, Splunk SIEM, training statistics and Mcafee Anti-virus numbers. He also provides risk and compliance consultation to his client ACT in the areas of (SSAE16, and PCI 3.1) as it pertains to their business. Consulting on varies other IT security areas such as: Data Loss Prevention, Secure Configuration (server hardening), and providing policies, procedures, RACI and control measures are also part of his responsibilities. \n Experience Client Security Manager Atos March 2015  – Present (6 months) Cloud/SaaS Security Engineer IBM January 2014  –  February 2015  (1 year 2 months) Southfield, Michigan Formally: \n \nMatthew McIntosh was a SaaS Security Engineer within the IBM Software group. He provided: vulnerability scanning, health checks, patch advisory management, approving firewall requests, continued business need and employee access validations as well as daily security administrative tasks ensuring IBM ITCS104 security and compliance requirements are followed. Matthew has experience with remote troubleshooting, Intrusion Detection Systems, Intrusion Protection Systems, Host Intrusion Systems, and Cisco Intrusion Detection Systems. His industry exposure includes oil & gas, telecommunications, financial services, consumer services, utilities, & energy companies. \n \nIBM \nSecurity Engineer Software Group \nClients: Sterling Commerce, Algorithmics, Social Business Jan 2014 - Current \n \nTechnical \nProvide in depth analyst of security event logs, and security events and take appropriate actions \nWork with security ticketing queue and address tickets that relate to various security issues like: firewall access requests, on-demand vulnerability scanning, and health check requests \nManage device license renewals and follow up on multiple security appliances \nProvide server health checks using IBM TSCM software \nWeekly VMS scans using Nessus software \nPatch management reports to various teams Security Intelligence Analyst (SIA) IBM January 2012  –  December 2013  (2 years) Southfield, MI Work as a liaison between the IBM SO team and MSS on various issues for both external IBM clients as well as internal IBM divisions \nManage device license renewals  \nPolicy tuning on: IDS, IPS, HIDS, CIDS devices \nCreate detailed daily/weekly/monthly reports for security executives  \nLead weekly/monthly calls with clients to discuss various security projects \nParticipate in weekly X-force conference calls to discuss upcoming XPU releases \nFacilitate issues and coordinate troubleshooting between SOC personnel, server administrators, firewall teams, and others \nEnsure that all IDS, IPS, HIDS, and CIDS devices are running current event signatures \nAnalyze log, flow, vulnerability, user and asset data through a single solution architecture \nDetect vulnerabilities and high-priority incidents Threat Analyst IBM June 2000  –  December 2011  (11 years 7 months) Southfield, Michigan Technical  \nProvided detailed and extensive policy tuning for many different clients across various types of industries.  \nProvided assistance with security and maintenance concerns through client conference calls, emails and online chat sessions \nProvided customers with advice during security audit situations with: logs, IDS policy info, and best practices  \nAdapted security policy based on customer net architecture through collaboration with customers and security engineers \nPerformed forensic analysis and research of attack signatures and vulnerabilities \nInstalled X-Press updates and new attack signatures on Internet Security Systems IPS/IDS devices on server and network sensors \nProcessed automatically generated A.I. alerts \nRemote troubleshooting of Cisco IDS, SiteProtector and ISS Proventia devices \nImplemented policy changes on: Intrusion Detection Systems, Intrusion Protection Systems, and Cisco Intrusion Detection Systems.  \nPerformed firmware upgrades \nMaintained 15 minute Service Level Agreement (SLA) for attacks and outages \nManaged large amounts of data to create tickets, notify customers and to facilitate research \nResearched, advise, create policy’s in accordance to ISO 17799, NIST Orange Book, Microsoft Site Security handbook, PCI, HIPPA and the Sarbanes-Oxley Act of 2002 \n \nManagement  \nSupervised the midnight shift of Intrusion Detection and firewall professionals \nImproved team effectiveness by developing and implementing several standard operating procedures \nCollaborated with the Service Supervisor and Operating Director for evaluation and improvement of best practice initiatives \nOrganized a two tier training program within the Intrusion Detection team  \nServed as a mentor to new hires Customer Service Tech GM OnStar January 1998  –  November 1998  (11 months) Internet Specialist, Buick Customer Relations Center / OnStar \nEDS/Centerobe, Inc.\tNovember 1998 – September 1999 \n \nProvided clients onboard navigation, dealer demonstrations and vehicle lockout assistance \nCorresponded efficiently on E-mail involving dealer, product and incentive concerns \nProvided assistance training to new Buick Customer employees \nTechnical assistance for OnStar customer Cryptologic Technician US Navy August 1988  –  August 1992  (4 years 1 month) Provide telecommunication support to U.S. Navy fleet (air, surface, and shore) \nInformation processing using computer terminals using all applicable security measures \nControlling and operation communication systems and networks including satellite systems, network servers, patch panels, and modems Client Security Manager Atos March 2015  – Present (6 months) Client Security Manager Atos March 2015  – Present (6 months) Cloud/SaaS Security Engineer IBM January 2014  –  February 2015  (1 year 2 months) Southfield, Michigan Formally: \n \nMatthew McIntosh was a SaaS Security Engineer within the IBM Software group. He provided: vulnerability scanning, health checks, patch advisory management, approving firewall requests, continued business need and employee access validations as well as daily security administrative tasks ensuring IBM ITCS104 security and compliance requirements are followed. Matthew has experience with remote troubleshooting, Intrusion Detection Systems, Intrusion Protection Systems, Host Intrusion Systems, and Cisco Intrusion Detection Systems. His industry exposure includes oil & gas, telecommunications, financial services, consumer services, utilities, & energy companies. \n \nIBM \nSecurity Engineer Software Group \nClients: Sterling Commerce, Algorithmics, Social Business Jan 2014 - Current \n \nTechnical \nProvide in depth analyst of security event logs, and security events and take appropriate actions \nWork with security ticketing queue and address tickets that relate to various security issues like: firewall access requests, on-demand vulnerability scanning, and health check requests \nManage device license renewals and follow up on multiple security appliances \nProvide server health checks using IBM TSCM software \nWeekly VMS scans using Nessus software \nPatch management reports to various teams Cloud/SaaS Security Engineer IBM January 2014  –  February 2015  (1 year 2 months) Southfield, Michigan Formally: \n \nMatthew McIntosh was a SaaS Security Engineer within the IBM Software group. He provided: vulnerability scanning, health checks, patch advisory management, approving firewall requests, continued business need and employee access validations as well as daily security administrative tasks ensuring IBM ITCS104 security and compliance requirements are followed. Matthew has experience with remote troubleshooting, Intrusion Detection Systems, Intrusion Protection Systems, Host Intrusion Systems, and Cisco Intrusion Detection Systems. His industry exposure includes oil & gas, telecommunications, financial services, consumer services, utilities, & energy companies. \n \nIBM \nSecurity Engineer Software Group \nClients: Sterling Commerce, Algorithmics, Social Business Jan 2014 - Current \n \nTechnical \nProvide in depth analyst of security event logs, and security events and take appropriate actions \nWork with security ticketing queue and address tickets that relate to various security issues like: firewall access requests, on-demand vulnerability scanning, and health check requests \nManage device license renewals and follow up on multiple security appliances \nProvide server health checks using IBM TSCM software \nWeekly VMS scans using Nessus software \nPatch management reports to various teams Security Intelligence Analyst (SIA) IBM January 2012  –  December 2013  (2 years) Southfield, MI Work as a liaison between the IBM SO team and MSS on various issues for both external IBM clients as well as internal IBM divisions \nManage device license renewals  \nPolicy tuning on: IDS, IPS, HIDS, CIDS devices \nCreate detailed daily/weekly/monthly reports for security executives  \nLead weekly/monthly calls with clients to discuss various security projects \nParticipate in weekly X-force conference calls to discuss upcoming XPU releases \nFacilitate issues and coordinate troubleshooting between SOC personnel, server administrators, firewall teams, and others \nEnsure that all IDS, IPS, HIDS, and CIDS devices are running current event signatures \nAnalyze log, flow, vulnerability, user and asset data through a single solution architecture \nDetect vulnerabilities and high-priority incidents Security Intelligence Analyst (SIA) IBM January 2012  –  December 2013  (2 years) Southfield, MI Work as a liaison between the IBM SO team and MSS on various issues for both external IBM clients as well as internal IBM divisions \nManage device license renewals  \nPolicy tuning on: IDS, IPS, HIDS, CIDS devices \nCreate detailed daily/weekly/monthly reports for security executives  \nLead weekly/monthly calls with clients to discuss various security projects \nParticipate in weekly X-force conference calls to discuss upcoming XPU releases \nFacilitate issues and coordinate troubleshooting between SOC personnel, server administrators, firewall teams, and others \nEnsure that all IDS, IPS, HIDS, and CIDS devices are running current event signatures \nAnalyze log, flow, vulnerability, user and asset data through a single solution architecture \nDetect vulnerabilities and high-priority incidents Threat Analyst IBM June 2000  –  December 2011  (11 years 7 months) Southfield, Michigan Technical  \nProvided detailed and extensive policy tuning for many different clients across various types of industries.  \nProvided assistance with security and maintenance concerns through client conference calls, emails and online chat sessions \nProvided customers with advice during security audit situations with: logs, IDS policy info, and best practices  \nAdapted security policy based on customer net architecture through collaboration with customers and security engineers \nPerformed forensic analysis and research of attack signatures and vulnerabilities \nInstalled X-Press updates and new attack signatures on Internet Security Systems IPS/IDS devices on server and network sensors \nProcessed automatically generated A.I. alerts \nRemote troubleshooting of Cisco IDS, SiteProtector and ISS Proventia devices \nImplemented policy changes on: Intrusion Detection Systems, Intrusion Protection Systems, and Cisco Intrusion Detection Systems.  \nPerformed firmware upgrades \nMaintained 15 minute Service Level Agreement (SLA) for attacks and outages \nManaged large amounts of data to create tickets, notify customers and to facilitate research \nResearched, advise, create policy’s in accordance to ISO 17799, NIST Orange Book, Microsoft Site Security handbook, PCI, HIPPA and the Sarbanes-Oxley Act of 2002 \n \nManagement  \nSupervised the midnight shift of Intrusion Detection and firewall professionals \nImproved team effectiveness by developing and implementing several standard operating procedures \nCollaborated with the Service Supervisor and Operating Director for evaluation and improvement of best practice initiatives \nOrganized a two tier training program within the Intrusion Detection team  \nServed as a mentor to new hires Threat Analyst IBM June 2000  –  December 2011  (11 years 7 months) Southfield, Michigan Technical  \nProvided detailed and extensive policy tuning for many different clients across various types of industries.  \nProvided assistance with security and maintenance concerns through client conference calls, emails and online chat sessions \nProvided customers with advice during security audit situations with: logs, IDS policy info, and best practices  \nAdapted security policy based on customer net architecture through collaboration with customers and security engineers \nPerformed forensic analysis and research of attack signatures and vulnerabilities \nInstalled X-Press updates and new attack signatures on Internet Security Systems IPS/IDS devices on server and network sensors \nProcessed automatically generated A.I. alerts \nRemote troubleshooting of Cisco IDS, SiteProtector and ISS Proventia devices \nImplemented policy changes on: Intrusion Detection Systems, Intrusion Protection Systems, and Cisco Intrusion Detection Systems.  \nPerformed firmware upgrades \nMaintained 15 minute Service Level Agreement (SLA) for attacks and outages \nManaged large amounts of data to create tickets, notify customers and to facilitate research \nResearched, advise, create policy’s in accordance to ISO 17799, NIST Orange Book, Microsoft Site Security handbook, PCI, HIPPA and the Sarbanes-Oxley Act of 2002 \n \nManagement  \nSupervised the midnight shift of Intrusion Detection and firewall professionals \nImproved team effectiveness by developing and implementing several standard operating procedures \nCollaborated with the Service Supervisor and Operating Director for evaluation and improvement of best practice initiatives \nOrganized a two tier training program within the Intrusion Detection team  \nServed as a mentor to new hires Customer Service Tech GM OnStar January 1998  –  November 1998  (11 months) Internet Specialist, Buick Customer Relations Center / OnStar \nEDS/Centerobe, Inc.\tNovember 1998 – September 1999 \n \nProvided clients onboard navigation, dealer demonstrations and vehicle lockout assistance \nCorresponded efficiently on E-mail involving dealer, product and incentive concerns \nProvided assistance training to new Buick Customer employees \nTechnical assistance for OnStar customer Customer Service Tech GM OnStar January 1998  –  November 1998  (11 months) Internet Specialist, Buick Customer Relations Center / OnStar \nEDS/Centerobe, Inc.\tNovember 1998 – September 1999 \n \nProvided clients onboard navigation, dealer demonstrations and vehicle lockout assistance \nCorresponded efficiently on E-mail involving dealer, product and incentive concerns \nProvided assistance training to new Buick Customer employees \nTechnical assistance for OnStar customer Cryptologic Technician US Navy August 1988  –  August 1992  (4 years 1 month) Provide telecommunication support to U.S. Navy fleet (air, surface, and shore) \nInformation processing using computer terminals using all applicable security measures \nControlling and operation communication systems and networks including satellite systems, network servers, patch panels, and modems Cryptologic Technician US Navy August 1988  –  August 1992  (4 years 1 month) Provide telecommunication support to U.S. Navy fleet (air, surface, and shore) \nInformation processing using computer terminals using all applicable security measures \nControlling and operation communication systems and networks including satellite systems, network servers, patch panels, and modems Skills Vulnerability Assessment Intrusion Detection Information Security Security Audits Information Security... Vulnerability Management Network Security Security Policy Security Management Computer Security Penetration Testing Firewalls Security Architecture... CISSP IPS Security Application Security Cisco Technologies Servers Computer Forensics Information Technology IDS Internet Security Troubleshooting Networking Incident Management CEH Antivirus Data Center Malware Analysis Routing SIEM McAfee WAN VPN Network Architecture Disaster Recovery Technical Support DNS ISO 27001 Business Continuity Identity Management Security+ TCP/IP Security Awareness Vulnerability Scanning PCI DSS Checkpoint Health Check IBM Tivoli See 35+     See less Skills  Vulnerability Assessment Intrusion Detection Information Security Security Audits Information Security... Vulnerability Management Network Security Security Policy Security Management Computer Security Penetration Testing Firewalls Security Architecture... CISSP IPS Security Application Security Cisco Technologies Servers Computer Forensics Information Technology IDS Internet Security Troubleshooting Networking Incident Management CEH Antivirus Data Center Malware Analysis Routing SIEM McAfee WAN VPN Network Architecture Disaster Recovery Technical Support DNS ISO 27001 Business Continuity Identity Management Security+ TCP/IP Security Awareness Vulnerability Scanning PCI DSS Checkpoint Health Check IBM Tivoli See 35+     See less Vulnerability Assessment Intrusion Detection Information Security Security Audits Information Security... Vulnerability Management Network Security Security Policy Security Management Computer Security Penetration Testing Firewalls Security Architecture... CISSP IPS Security Application Security Cisco Technologies Servers Computer Forensics Information Technology IDS Internet Security Troubleshooting Networking Incident Management CEH Antivirus Data Center Malware Analysis Routing SIEM McAfee WAN VPN Network Architecture Disaster Recovery Technical Support DNS ISO 27001 Business Continuity Identity Management Security+ TCP/IP Security Awareness Vulnerability Scanning PCI DSS Checkpoint Health Check IBM Tivoli See 35+     See less Vulnerability Assessment Intrusion Detection Information Security Security Audits Information Security... Vulnerability Management Network Security Security Policy Security Management Computer Security Penetration Testing Firewalls Security Architecture... CISSP IPS Security Application Security Cisco Technologies Servers Computer Forensics Information Technology IDS Internet Security Troubleshooting Networking Incident Management CEH Antivirus Data Center Malware Analysis Routing SIEM McAfee WAN VPN Network Architecture Disaster Recovery Technical Support DNS ISO 27001 Business Continuity Identity Management Security+ TCP/IP Security Awareness Vulnerability Scanning PCI DSS Checkpoint Health Check IBM Tivoli See 35+     See less Education College of the Ozarks Bachelor of Science,  Criminology 1994  – 1997 Bachelor of Science Bachelor of Science,  Criminology 1994  – 1997 Activities and Societies:  Administration of Justice society College of the Ozarks Bachelor of Science,  Criminology 1994  – 1997 College of the Ozarks Bachelor of Science,  Criminology 1994  – 1997 College of the Ozarks Bachelor of Science,  Criminology 1994  – 1997 Bachelor of Science Bachelor of Science,  Criminology 1994  – 1997 Activities and Societies:  Administration of Justice society Bachelor of Science Bachelor of Science,  Criminology 1994  – 1997 Activities and Societies:  Administration of Justice society Bachelor of Science Bachelor of Science,  Criminology 1994  – 1997 Activities and Societies:  Administration of Justice society ", "Experience Global Account Manager ACG (Atlanta Computer Group) November 2014  – Present (10 months) Alpharetta, GA Procurement Manager / Operations Analyst The Bankers Exchange October 2011  –  October 2014  (3 years 1 month) Smyrna, Georgia Procurement and Planning Specialist Adtech April 2011  –  September 2011  (6 months) Alpharetta Georgia Inventory Analyst / Supply The Bankers Exchange June 2008  –  March 2011  (2 years 10 months) - Specialist in researching and evaluating alternative means of order fulfillment due to expansive knowledge and swift mastery of the ATM industry \n- Entrusted with complex customer service and technical vendor relations as a result of exceptional ability to resolve concerns and satisfy business partners. \n- Primary point of contact for inventory analysis. Items needed for emergency sales orders or refurbishments were consistently filled with superb accuracy and efficient costing. Threat Analyst IBM - Internet Security Systems February 2006  –  December 2007  (1 year 11 months) - Cooperatively created a sophisticated vulnerability analysis lab of more than 400 virtual / physical machines \n- Solely responsible for setup of newly discovered vulnerabilities and exploits in security due to ability to adapt to new and unknown systems quickly and effectively \n- Streamlined data redundancy system and systematic backup protocols. Manager / Operations Analyst Networks Online June 2003  –  October 2004  (1 year 5 months) - Researched and developed the primary system for setup / update / maintaining virtual inventory and system profiles. \n-Relied on to compare trends in product movement and itemize projected spending to create a profitable small business outlook for each quarter \n- Managed all day to day business and a staff consisting of 5 employees. \nSkills \n-Versed in usage of many Windows applications/ suites, including but not limited to: Word, Excel, Access, Power Point and Axapta Global Account Manager ACG (Atlanta Computer Group) November 2014  – Present (10 months) Alpharetta, GA Global Account Manager ACG (Atlanta Computer Group) November 2014  – Present (10 months) Alpharetta, GA Procurement Manager / Operations Analyst The Bankers Exchange October 2011  –  October 2014  (3 years 1 month) Smyrna, Georgia Procurement Manager / Operations Analyst The Bankers Exchange October 2011  –  October 2014  (3 years 1 month) Smyrna, Georgia Procurement and Planning Specialist Adtech April 2011  –  September 2011  (6 months) Alpharetta Georgia Procurement and Planning Specialist Adtech April 2011  –  September 2011  (6 months) Alpharetta Georgia Inventory Analyst / Supply The Bankers Exchange June 2008  –  March 2011  (2 years 10 months) - Specialist in researching and evaluating alternative means of order fulfillment due to expansive knowledge and swift mastery of the ATM industry \n- Entrusted with complex customer service and technical vendor relations as a result of exceptional ability to resolve concerns and satisfy business partners. \n- Primary point of contact for inventory analysis. Items needed for emergency sales orders or refurbishments were consistently filled with superb accuracy and efficient costing. Inventory Analyst / Supply The Bankers Exchange June 2008  –  March 2011  (2 years 10 months) - Specialist in researching and evaluating alternative means of order fulfillment due to expansive knowledge and swift mastery of the ATM industry \n- Entrusted with complex customer service and technical vendor relations as a result of exceptional ability to resolve concerns and satisfy business partners. \n- Primary point of contact for inventory analysis. Items needed for emergency sales orders or refurbishments were consistently filled with superb accuracy and efficient costing. Threat Analyst IBM - Internet Security Systems February 2006  –  December 2007  (1 year 11 months) - Cooperatively created a sophisticated vulnerability analysis lab of more than 400 virtual / physical machines \n- Solely responsible for setup of newly discovered vulnerabilities and exploits in security due to ability to adapt to new and unknown systems quickly and effectively \n- Streamlined data redundancy system and systematic backup protocols. Threat Analyst IBM - Internet Security Systems February 2006  –  December 2007  (1 year 11 months) - Cooperatively created a sophisticated vulnerability analysis lab of more than 400 virtual / physical machines \n- Solely responsible for setup of newly discovered vulnerabilities and exploits in security due to ability to adapt to new and unknown systems quickly and effectively \n- Streamlined data redundancy system and systematic backup protocols. Manager / Operations Analyst Networks Online June 2003  –  October 2004  (1 year 5 months) - Researched and developed the primary system for setup / update / maintaining virtual inventory and system profiles. \n-Relied on to compare trends in product movement and itemize projected spending to create a profitable small business outlook for each quarter \n- Managed all day to day business and a staff consisting of 5 employees. \nSkills \n-Versed in usage of many Windows applications/ suites, including but not limited to: Word, Excel, Access, Power Point and Axapta Manager / Operations Analyst Networks Online June 2003  –  October 2004  (1 year 5 months) - Researched and developed the primary system for setup / update / maintaining virtual inventory and system profiles. \n-Relied on to compare trends in product movement and itemize projected spending to create a profitable small business outlook for each quarter \n- Managed all day to day business and a staff consisting of 5 employees. \nSkills \n-Versed in usage of many Windows applications/ suites, including but not limited to: Word, Excel, Access, Power Point and Axapta Skills Customer Service Security Access Account Management Management New Business Development Process Improvement Project Planning Sales Management Windows Skills  Customer Service Security Access Account Management Management New Business Development Process Improvement Project Planning Sales Management Windows Customer Service Security Access Account Management Management New Business Development Process Improvement Project Planning Sales Management Windows Customer Service Security Access Account Management Management New Business Development Process Improvement Project Planning Sales Management Windows Education Goodfellow AFB, San Angelo TX AFSC 1N031,  Operations Intelligence 2004  – 2005 Georgia Perimeter College Computer Technology / Engineering - College work suspended, plan to return to evening classes. Goodfellow AFB, San Angelo TX AFSC 1N031,  Operations Intelligence 2004  – 2005 Goodfellow AFB, San Angelo TX AFSC 1N031,  Operations Intelligence 2004  – 2005 Goodfellow AFB, San Angelo TX AFSC 1N031,  Operations Intelligence 2004  – 2005 Georgia Perimeter College Computer Technology / Engineering - College work suspended, plan to return to evening classes. Georgia Perimeter College Computer Technology / Engineering - College work suspended, plan to return to evening classes. Georgia Perimeter College Computer Technology / Engineering - College work suspended, plan to return to evening classes. ", "Experience SIEM Threat Analyst IBM July 2015  – Present (2 months) SIEM Threat Analyst IBM July 2015  – Present (2 months) SIEM Threat Analyst IBM July 2015  – Present (2 months) Skills Seguridad Telecomunicaciones Solución de problemas Biblioteca de... Skills  Seguridad Telecomunicaciones Solución de problemas Biblioteca de... Seguridad Telecomunicaciones Solución de problemas Biblioteca de... Seguridad Telecomunicaciones Solución de problemas Biblioteca de... Education Universidad central Informática Universidad central Informática Universidad central Informática Universidad central Informática ", "Summary Networking, Routing & Switching (Enterasys, Cisco) \nFirewall configuration & management (Fortinet, SonicWall) \nNetwork Security.  \nIPS/IDS management (Top Layer Corero) \nWeb Design (Joomla, WordPress) Summary Networking, Routing & Switching (Enterasys, Cisco) \nFirewall configuration & management (Fortinet, SonicWall) \nNetwork Security.  \nIPS/IDS management (Top Layer Corero) \nWeb Design (Joomla, WordPress) Networking, Routing & Switching (Enterasys, Cisco) \nFirewall configuration & management (Fortinet, SonicWall) \nNetwork Security.  \nIPS/IDS management (Top Layer Corero) \nWeb Design (Joomla, WordPress) Networking, Routing & Switching (Enterasys, Cisco) \nFirewall configuration & management (Fortinet, SonicWall) \nNetwork Security.  \nIPS/IDS management (Top Layer Corero) \nWeb Design (Joomla, WordPress) Experience SIEM Threat Analyst IBM November 2014  – Present (10 months) Senior Network Engineer T4 Services August 2014  –  November 2014  (4 months) Network Engineer T4 Services November 2012  –  July 2014  (1 year 9 months) Technical Support Engineer T4 Services July 2012  –  October 2012  (4 months) Technical Infrastructure and Networks Holcim May 2012  –  July 2012  (3 months) Technical Support CR-Hosting S.A. January 2010  –  May 2012  (2 years 5 months) Practitioner CR-Hosting S.A. September 2009  –  January 2010  (5 months) SIEM Threat Analyst IBM November 2014  – Present (10 months) SIEM Threat Analyst IBM November 2014  – Present (10 months) Senior Network Engineer T4 Services August 2014  –  November 2014  (4 months) Senior Network Engineer T4 Services August 2014  –  November 2014  (4 months) Network Engineer T4 Services November 2012  –  July 2014  (1 year 9 months) Network Engineer T4 Services November 2012  –  July 2014  (1 year 9 months) Technical Support Engineer T4 Services July 2012  –  October 2012  (4 months) Technical Support Engineer T4 Services July 2012  –  October 2012  (4 months) Technical Infrastructure and Networks Holcim May 2012  –  July 2012  (3 months) Technical Infrastructure and Networks Holcim May 2012  –  July 2012  (3 months) Technical Support CR-Hosting S.A. January 2010  –  May 2012  (2 years 5 months) Technical Support CR-Hosting S.A. January 2010  –  May 2012  (2 years 5 months) Practitioner CR-Hosting S.A. September 2009  –  January 2010  (5 months) Practitioner CR-Hosting S.A. September 2009  –  January 2010  (5 months) Languages Spanish Native or bilingual proficiency English Professional working proficiency Spanish Native or bilingual proficiency English Professional working proficiency Spanish Native or bilingual proficiency English Professional working proficiency Native or bilingual proficiency Professional working proficiency Skills Teamwork Troubleshooting Computer Hardware Active Directory Telecommunications Proactivity Responsibility VMware Infrastructure CCNA Firewalls Joomla WordPress Routing Network Security VoIP Networking Technical Support Windows Server Management Microsoft Office See 5+     See less Skills  Teamwork Troubleshooting Computer Hardware Active Directory Telecommunications Proactivity Responsibility VMware Infrastructure CCNA Firewalls Joomla WordPress Routing Network Security VoIP Networking Technical Support Windows Server Management Microsoft Office See 5+     See less Teamwork Troubleshooting Computer Hardware Active Directory Telecommunications Proactivity Responsibility VMware Infrastructure CCNA Firewalls Joomla WordPress Routing Network Security VoIP Networking Technical Support Windows Server Management Microsoft Office See 5+     See less Teamwork Troubleshooting Computer Hardware Active Directory Telecommunications Proactivity Responsibility VMware Infrastructure CCNA Firewalls Joomla WordPress Routing Network Security VoIP Networking Technical Support Windows Server Management Microsoft Office See 5+     See less Education Universidad Latina de Costa Rica Bachelor's degree,  Telematics Engineering 2007  – 2011 EMVA High School Bachelor's degree,  High School 2002  – 2006 Amadita Primary School 1993  – 2001 Universidad Latina de Costa Rica Bachelor's degree,  Telematics Engineering 2007  – 2011 Universidad Latina de Costa Rica Bachelor's degree,  Telematics Engineering 2007  – 2011 Universidad Latina de Costa Rica Bachelor's degree,  Telematics Engineering 2007  – 2011 EMVA High School Bachelor's degree,  High School 2002  – 2006 EMVA High School Bachelor's degree,  High School 2002  – 2006 EMVA High School Bachelor's degree,  High School 2002  – 2006 Amadita Primary School 1993  – 2001 Amadita Primary School 1993  – 2001 Amadita Primary School 1993  – 2001 Honors & Awards ", "Experience Security Specialist EY May 2015  – Present (4 months) Wroclaw, Lower Silesian District, Poland Performing vulnerability assessments of different kinds of applications (web/mobile applications,thick clients, Citrix clients). Senior Consultant PwC February 2015  –  March 2015  (2 months) Wroclaw, Lower Silesian District, Poland • Performing IT General Controls.  \n• Supporting Cybersecurity team IT Auditor in security and business continuity management team Credit Agricole Bank Polska January 2014  –  January 2015  (1 year 1 month) Wroclaw, Lower Silesian District, Poland So far performed audits: \n- The compliance of Bank's IT security with the KNF's “Recommendation D” \n- The security of mail service and mobile devices \n- Business Continuity Management Network Engineer CSS Corp July 2013  –  January 2014  (7 months) Wroclaw, Lower Silesian District, Poland · Analyzing network traffic and network events ,using Deep Packet Inspection devices. \n· Supporting customers in optimizing collection of statistical information about patterns used \nby subscribers. \n· Supporting customers in classification of a traffic by implementing filtering rules. \n· Supporting customers in shaping a traffic by dynamic management of bandwidth and \nproviding different QoS. Threat Analyst IBM September 2012  –  July 2013  (11 months) Threat Analyst in Managed Security Services department: \n \n- analyzing events coming from customer’s IDS/IPS (filtering real threats from false positives, analysis of what really happened, estimation of the threat impact) \n- optimization of IDS/IPS policies, by suggesting the customer more effective signatures management.; iSeries focal point for customer SwissRe IBM August 2011  –  September 2012  (1 year 2 months) Duties of Focal Point and Technical Leader: \n \n- participating in service migration (creating new procedures and updating old ones, performing skill transfer) \n- doing operator tasks on client application (health checking, submitting jobs). \n- providing new facilities to service Security Specialist EY May 2015  – Present (4 months) Wroclaw, Lower Silesian District, Poland Performing vulnerability assessments of different kinds of applications (web/mobile applications,thick clients, Citrix clients). Security Specialist EY May 2015  – Present (4 months) Wroclaw, Lower Silesian District, Poland Performing vulnerability assessments of different kinds of applications (web/mobile applications,thick clients, Citrix clients). Senior Consultant PwC February 2015  –  March 2015  (2 months) Wroclaw, Lower Silesian District, Poland • Performing IT General Controls.  \n• Supporting Cybersecurity team Senior Consultant PwC February 2015  –  March 2015  (2 months) Wroclaw, Lower Silesian District, Poland • Performing IT General Controls.  \n• Supporting Cybersecurity team IT Auditor in security and business continuity management team Credit Agricole Bank Polska January 2014  –  January 2015  (1 year 1 month) Wroclaw, Lower Silesian District, Poland So far performed audits: \n- The compliance of Bank's IT security with the KNF's “Recommendation D” \n- The security of mail service and mobile devices \n- Business Continuity Management IT Auditor in security and business continuity management team Credit Agricole Bank Polska January 2014  –  January 2015  (1 year 1 month) Wroclaw, Lower Silesian District, Poland So far performed audits: \n- The compliance of Bank's IT security with the KNF's “Recommendation D” \n- The security of mail service and mobile devices \n- Business Continuity Management Network Engineer CSS Corp July 2013  –  January 2014  (7 months) Wroclaw, Lower Silesian District, Poland · Analyzing network traffic and network events ,using Deep Packet Inspection devices. \n· Supporting customers in optimizing collection of statistical information about patterns used \nby subscribers. \n· Supporting customers in classification of a traffic by implementing filtering rules. \n· Supporting customers in shaping a traffic by dynamic management of bandwidth and \nproviding different QoS. Network Engineer CSS Corp July 2013  –  January 2014  (7 months) Wroclaw, Lower Silesian District, Poland · Analyzing network traffic and network events ,using Deep Packet Inspection devices. \n· Supporting customers in optimizing collection of statistical information about patterns used \nby subscribers. \n· Supporting customers in classification of a traffic by implementing filtering rules. \n· Supporting customers in shaping a traffic by dynamic management of bandwidth and \nproviding different QoS. Threat Analyst IBM September 2012  –  July 2013  (11 months) Threat Analyst in Managed Security Services department: \n \n- analyzing events coming from customer’s IDS/IPS (filtering real threats from false positives, analysis of what really happened, estimation of the threat impact) \n- optimization of IDS/IPS policies, by suggesting the customer more effective signatures management.; Threat Analyst IBM September 2012  –  July 2013  (11 months) Threat Analyst in Managed Security Services department: \n \n- analyzing events coming from customer’s IDS/IPS (filtering real threats from false positives, analysis of what really happened, estimation of the threat impact) \n- optimization of IDS/IPS policies, by suggesting the customer more effective signatures management.; iSeries focal point for customer SwissRe IBM August 2011  –  September 2012  (1 year 2 months) Duties of Focal Point and Technical Leader: \n \n- participating in service migration (creating new procedures and updating old ones, performing skill transfer) \n- doing operator tasks on client application (health checking, submitting jobs). \n- providing new facilities to service iSeries focal point for customer SwissRe IBM August 2011  –  September 2012  (1 year 2 months) Duties of Focal Point and Technical Leader: \n \n- participating in service migration (creating new procedures and updating old ones, performing skill transfer) \n- doing operator tasks on client application (health checking, submitting jobs). \n- providing new facilities to service Skills Information Security Network Security Proventia Incident Response Networking IPS Intrusion Detection Threat Analysis Computer Security Risk Assessment Vulnerability Assessment Penetration Testing Security Audits VPN Skills  Information Security Network Security Proventia Incident Response Networking IPS Intrusion Detection Threat Analysis Computer Security Risk Assessment Vulnerability Assessment Penetration Testing Security Audits VPN Information Security Network Security Proventia Incident Response Networking IPS Intrusion Detection Threat Analysis Computer Security Risk Assessment Vulnerability Assessment Penetration Testing Security Audits VPN Information Security Network Security Proventia Incident Response Networking IPS Intrusion Detection Threat Analysis Computer Security Risk Assessment Vulnerability Assessment Penetration Testing Security Audits VPN Education Regional Cisco Networking Academy Wroclaw University of Technology M.Sc., Ec.E Thesis Topic: Evaluation of web service security using OSSTMM methodology and Metasploit Framework \nAdvisor: PhD. Marcin Markowski \nArea of Study: Network security, penetration testing, risk assessment Regional Cisco Networking Academy Regional Cisco Networking Academy Regional Cisco Networking Academy Wroclaw University of Technology M.Sc., Ec.E Thesis Topic: Evaluation of web service security using OSSTMM methodology and Metasploit Framework \nAdvisor: PhD. Marcin Markowski \nArea of Study: Network security, penetration testing, risk assessment Wroclaw University of Technology M.Sc., Ec.E Thesis Topic: Evaluation of web service security using OSSTMM methodology and Metasploit Framework \nAdvisor: PhD. Marcin Markowski \nArea of Study: Network security, penetration testing, risk assessment Wroclaw University of Technology M.Sc., Ec.E Thesis Topic: Evaluation of web service security using OSSTMM methodology and Metasploit Framework \nAdvisor: PhD. Marcin Markowski \nArea of Study: Network security, penetration testing, risk assessment ", "Summary Security business veteran with 15 years experience in startups, security operations, support, consulting, product management, and product marketing. Alumnus of Internet Security Systems, Dell SecureWorks, and IBM Security. \n \nI like launching and improving beautiful cloud-hosted security analytics products and especially making them easy and fun to use. \n \nPublic speaking is fun and I really enjoy playing emcee for events. \n \nThe best is yet to come! Summary Security business veteran with 15 years experience in startups, security operations, support, consulting, product management, and product marketing. Alumnus of Internet Security Systems, Dell SecureWorks, and IBM Security. \n \nI like launching and improving beautiful cloud-hosted security analytics products and especially making them easy and fun to use. \n \nPublic speaking is fun and I really enjoy playing emcee for events. \n \nThe best is yet to come! Security business veteran with 15 years experience in startups, security operations, support, consulting, product management, and product marketing. Alumnus of Internet Security Systems, Dell SecureWorks, and IBM Security. \n \nI like launching and improving beautiful cloud-hosted security analytics products and especially making them easy and fun to use. \n \nPublic speaking is fun and I really enjoy playing emcee for events. \n \nThe best is yet to come! Security business veteran with 15 years experience in startups, security operations, support, consulting, product management, and product marketing. Alumnus of Internet Security Systems, Dell SecureWorks, and IBM Security. \n \nI like launching and improving beautiful cloud-hosted security analytics products and especially making them easy and fun to use. \n \nPublic speaking is fun and I really enjoy playing emcee for events. \n \nThe best is yet to come! Experience Product Manager Rapid7 UserInsight September 2014  – Present (1 year) Cambridge, MA DETECT AND INVESTIGATE SECURITY INCIDENTS \n \nRapid7 UserInsight is an intruder analytics solution that gives you the confidence to detect and investigate security incidents faster. UserInsight gives you quality alerts without the noise, enables your entire team to investigate an incident, and add user context to your monitoring solutions. \n \nUnlike other solutions, UserInsight monitors activity not just on your network, but across endpoints, mobile devices and cloud. UserInsight gives you instant visibility into user activity across your infrastructure and monitoring solutions. \n \nRapid7's unique understanding of attacker methodologies is the key for producing these highly accurate analytics. Co-founder Data Science ATL May 2012  – Present (3 years 4 months) Greater Atlanta Area Data Science ATL is an open community organization of over 2,200 professionals, students, and enthusiasts passionate about the art and science of telling valuable stories with data. \n \nWe have hosted over sixty events since June 2012 featuring thought leaders in data science for members and guests to learn something new, network, find jobs, or recruit data science professionals. \n \nCheck out some our best events here: http://vimeo.com/dsatl Offering Manager IBM Security Services June 2014  –  September 2014  (4 months) Greater Atlanta Area Offering manager for Managed Web Defense powered by IBM X-Force and Akamai. Product Manager Dell Secureworks July 2011  –  May 2014  (2 years 11 months) Greater Atlanta Area Led product strategy for the Dell SecureWorks Counter Threat Platform (CTP) Client Web Portal and mobile apps. Account Manager IBM Security Services May 2011  –  July 2011  (3 months) Greater Atlanta Area Was responsible for security services account renewal management and driving up sell to meet or exceed plan. Network Security Operations Supervisor IBM Security Services October 2008  –  April 2011  (2 years 7 months) Greater Atlanta Area Experienced with managing complex network security operations though a diverse global team of highly skilled engineers and analysts. Cybersecurity Threat Analyst IBM Internet Security Systems December 2006  –  October 2008  (1 year 11 months) Greater Atlanta Area Monitored events for network security threats while acting as a trusted advisor to customers. Consultant Self Employed January 2004  –  December 2006  (3 years) Stuart, FL Provided IT consulting and project management to small and medium sized businesses for information security, IT services, and business continuity planning. Co-founder Doctor's Desktop, LLC October 2001  –  December 2003  (2 years 3 months) Stuart, FL At Doctor's Desktop I led the consultation, design and implementation of HIPAA compliant secure information systems for office-based physicians enabling the use of paperless Electronic Health Records (EHR). We specialized in replacing Windows back-office infrastructure with an open-source (LAMP) solution. \n \nDoctor's Desktop was a healthcare IT software & services start-up venture of which I was a principal founding member. Product Manager Rapid7 UserInsight September 2014  – Present (1 year) Cambridge, MA DETECT AND INVESTIGATE SECURITY INCIDENTS \n \nRapid7 UserInsight is an intruder analytics solution that gives you the confidence to detect and investigate security incidents faster. UserInsight gives you quality alerts without the noise, enables your entire team to investigate an incident, and add user context to your monitoring solutions. \n \nUnlike other solutions, UserInsight monitors activity not just on your network, but across endpoints, mobile devices and cloud. UserInsight gives you instant visibility into user activity across your infrastructure and monitoring solutions. \n \nRapid7's unique understanding of attacker methodologies is the key for producing these highly accurate analytics. Product Manager Rapid7 UserInsight September 2014  – Present (1 year) Cambridge, MA DETECT AND INVESTIGATE SECURITY INCIDENTS \n \nRapid7 UserInsight is an intruder analytics solution that gives you the confidence to detect and investigate security incidents faster. UserInsight gives you quality alerts without the noise, enables your entire team to investigate an incident, and add user context to your monitoring solutions. \n \nUnlike other solutions, UserInsight monitors activity not just on your network, but across endpoints, mobile devices and cloud. UserInsight gives you instant visibility into user activity across your infrastructure and monitoring solutions. \n \nRapid7's unique understanding of attacker methodologies is the key for producing these highly accurate analytics. Co-founder Data Science ATL May 2012  – Present (3 years 4 months) Greater Atlanta Area Data Science ATL is an open community organization of over 2,200 professionals, students, and enthusiasts passionate about the art and science of telling valuable stories with data. \n \nWe have hosted over sixty events since June 2012 featuring thought leaders in data science for members and guests to learn something new, network, find jobs, or recruit data science professionals. \n \nCheck out some our best events here: http://vimeo.com/dsatl Co-founder Data Science ATL May 2012  – Present (3 years 4 months) Greater Atlanta Area Data Science ATL is an open community organization of over 2,200 professionals, students, and enthusiasts passionate about the art and science of telling valuable stories with data. \n \nWe have hosted over sixty events since June 2012 featuring thought leaders in data science for members and guests to learn something new, network, find jobs, or recruit data science professionals. \n \nCheck out some our best events here: http://vimeo.com/dsatl Offering Manager IBM Security Services June 2014  –  September 2014  (4 months) Greater Atlanta Area Offering manager for Managed Web Defense powered by IBM X-Force and Akamai. Offering Manager IBM Security Services June 2014  –  September 2014  (4 months) Greater Atlanta Area Offering manager for Managed Web Defense powered by IBM X-Force and Akamai. Product Manager Dell Secureworks July 2011  –  May 2014  (2 years 11 months) Greater Atlanta Area Led product strategy for the Dell SecureWorks Counter Threat Platform (CTP) Client Web Portal and mobile apps. Product Manager Dell Secureworks July 2011  –  May 2014  (2 years 11 months) Greater Atlanta Area Led product strategy for the Dell SecureWorks Counter Threat Platform (CTP) Client Web Portal and mobile apps. Account Manager IBM Security Services May 2011  –  July 2011  (3 months) Greater Atlanta Area Was responsible for security services account renewal management and driving up sell to meet or exceed plan. Account Manager IBM Security Services May 2011  –  July 2011  (3 months) Greater Atlanta Area Was responsible for security services account renewal management and driving up sell to meet or exceed plan. Network Security Operations Supervisor IBM Security Services October 2008  –  April 2011  (2 years 7 months) Greater Atlanta Area Experienced with managing complex network security operations though a diverse global team of highly skilled engineers and analysts. Network Security Operations Supervisor IBM Security Services October 2008  –  April 2011  (2 years 7 months) Greater Atlanta Area Experienced with managing complex network security operations though a diverse global team of highly skilled engineers and analysts. Cybersecurity Threat Analyst IBM Internet Security Systems December 2006  –  October 2008  (1 year 11 months) Greater Atlanta Area Monitored events for network security threats while acting as a trusted advisor to customers. Cybersecurity Threat Analyst IBM Internet Security Systems December 2006  –  October 2008  (1 year 11 months) Greater Atlanta Area Monitored events for network security threats while acting as a trusted advisor to customers. Consultant Self Employed January 2004  –  December 2006  (3 years) Stuart, FL Provided IT consulting and project management to small and medium sized businesses for information security, IT services, and business continuity planning. Consultant Self Employed January 2004  –  December 2006  (3 years) Stuart, FL Provided IT consulting and project management to small and medium sized businesses for information security, IT services, and business continuity planning. Co-founder Doctor's Desktop, LLC October 2001  –  December 2003  (2 years 3 months) Stuart, FL At Doctor's Desktop I led the consultation, design and implementation of HIPAA compliant secure information systems for office-based physicians enabling the use of paperless Electronic Health Records (EHR). We specialized in replacing Windows back-office infrastructure with an open-source (LAMP) solution. \n \nDoctor's Desktop was a healthcare IT software & services start-up venture of which I was a principal founding member. Co-founder Doctor's Desktop, LLC October 2001  –  December 2003  (2 years 3 months) Stuart, FL At Doctor's Desktop I led the consultation, design and implementation of HIPAA compliant secure information systems for office-based physicians enabling the use of paperless Electronic Health Records (EHR). We specialized in replacing Windows back-office infrastructure with an open-source (LAMP) solution. \n \nDoctor's Desktop was a healthcare IT software & services start-up venture of which I was a principal founding member. Skills Product Strategy Product Management Security Cloud Computing Network Security Go-to-market Strategy Cross-functional Team... Competitive Analysis Sales Enablement Enterprise Software Vendor Management Program Management Strategy Development Business Management Market Analysis Requirements Analysis Mobile Applications Business Strategy Agile Corporate Development M&A analysis Product Marketing Product Launch Event Correlation Hadoop End User Research Strategy SIEM Information Security Entrepreneurship Solution Selling Professional Services SaaS Leadership Agile Methodologies Computer Security Management Networking Project Management Team Leadership Analytics Enterprise Architecture Business Intelligence Pre-sales Big Data Integration IT Strategy Analysis Data Center Virtualization See 35+     See less Skills  Product Strategy Product Management Security Cloud Computing Network Security Go-to-market Strategy Cross-functional Team... Competitive Analysis Sales Enablement Enterprise Software Vendor Management Program Management Strategy Development Business Management Market Analysis Requirements Analysis Mobile Applications Business Strategy Agile Corporate Development M&A analysis Product Marketing Product Launch Event Correlation Hadoop End User Research Strategy SIEM Information Security Entrepreneurship Solution Selling Professional Services SaaS Leadership Agile Methodologies Computer Security Management Networking Project Management Team Leadership Analytics Enterprise Architecture Business Intelligence Pre-sales Big Data Integration IT Strategy Analysis Data Center Virtualization See 35+     See less Product Strategy Product Management Security Cloud Computing Network Security Go-to-market Strategy Cross-functional Team... Competitive Analysis Sales Enablement Enterprise Software Vendor Management Program Management Strategy Development Business Management Market Analysis Requirements Analysis Mobile Applications Business Strategy Agile Corporate Development M&A analysis Product Marketing Product Launch Event Correlation Hadoop End User Research Strategy SIEM Information Security Entrepreneurship Solution Selling Professional Services SaaS Leadership Agile Methodologies Computer Security Management Networking Project Management Team Leadership Analytics Enterprise Architecture Business Intelligence Pre-sales Big Data Integration IT Strategy Analysis Data Center Virtualization See 35+     See less Product Strategy Product Management Security Cloud Computing Network Security Go-to-market Strategy Cross-functional Team... Competitive Analysis Sales Enablement Enterprise Software Vendor Management Program Management Strategy Development Business Management Market Analysis Requirements Analysis Mobile Applications Business Strategy Agile Corporate Development M&A analysis Product Marketing Product Launch Event Correlation Hadoop End User Research Strategy SIEM Information Security Entrepreneurship Solution Selling Professional Services SaaS Leadership Agile Methodologies Computer Security Management Networking Project Management Team Leadership Analytics Enterprise Architecture Business Intelligence Pre-sales Big Data Integration IT Strategy Analysis Data Center Virtualization See 35+     See less Education Emory University - Goizueta Business School MBA,  Strategy , Finance,  & Global Management 2007  – 2010 Activities and Societies:  Goizueta Technology Association (GTA) ,  Entrepreneurship and Venture Capital Club (EVCC) ,  & Venture Capital Investment Competition (VCIC) Fudan University 2009  – 2009 Doing Business in China (Shanghai) seminar with Emory University - Goizueta Business School - August 2009 Florida Atlantic University B.S.,  Management Information Systems 2004  – 2006 Concentration: Information Security Activities and Societies:  Beta Gamma Sigma Martin County High School Diploma Activities and Societies:  O.P.U.S. - Outstanding People United to Sing Emory University - Goizueta Business School MBA,  Strategy , Finance,  & Global Management 2007  – 2010 Activities and Societies:  Goizueta Technology Association (GTA) ,  Entrepreneurship and Venture Capital Club (EVCC) ,  & Venture Capital Investment Competition (VCIC) Emory University - Goizueta Business School MBA,  Strategy , Finance,  & Global Management 2007  – 2010 Activities and Societies:  Goizueta Technology Association (GTA) ,  Entrepreneurship and Venture Capital Club (EVCC) ,  & Venture Capital Investment Competition (VCIC) Emory University - Goizueta Business School MBA,  Strategy , Finance,  & Global Management 2007  – 2010 Activities and Societies:  Goizueta Technology Association (GTA) ,  Entrepreneurship and Venture Capital Club (EVCC) ,  & Venture Capital Investment Competition (VCIC) Fudan University 2009  – 2009 Doing Business in China (Shanghai) seminar with Emory University - Goizueta Business School - August 2009 Fudan University 2009  – 2009 Doing Business in China (Shanghai) seminar with Emory University - Goizueta Business School - August 2009 Fudan University 2009  – 2009 Doing Business in China (Shanghai) seminar with Emory University - Goizueta Business School - August 2009 Florida Atlantic University B.S.,  Management Information Systems 2004  – 2006 Concentration: Information Security Activities and Societies:  Beta Gamma Sigma Florida Atlantic University B.S.,  Management Information Systems 2004  – 2006 Concentration: Information Security Activities and Societies:  Beta Gamma Sigma Florida Atlantic University B.S.,  Management Information Systems 2004  – 2006 Concentration: Information Security Activities and Societies:  Beta Gamma Sigma Martin County High School Diploma Activities and Societies:  O.P.U.S. - Outstanding People United to Sing Martin County High School Diploma Activities and Societies:  O.P.U.S. - Outstanding People United to Sing Martin County High School Diploma Activities and Societies:  O.P.U.S. - Outstanding People United to Sing Honors & Awards 2014 TAG Product Management Rookie of the Year - Finalist Technology Association of Georgia February 2014 The Technology Association of Georgia’s Rookie Product Manager of the Year Award recognizes the outstanding efforts of a Product Manager, with less than 3 years of experience, to develop, adhere, and execute the ideals of our profession. Additional Honors & Awards Beta Gamma Sigma 2014 TAG Product Management Rookie of the Year - Finalist Technology Association of Georgia February 2014 The Technology Association of Georgia’s Rookie Product Manager of the Year Award recognizes the outstanding efforts of a Product Manager, with less than 3 years of experience, to develop, adhere, and execute the ideals of our profession. 2014 TAG Product Management Rookie of the Year - Finalist Technology Association of Georgia February 2014 The Technology Association of Georgia’s Rookie Product Manager of the Year Award recognizes the outstanding efforts of a Product Manager, with less than 3 years of experience, to develop, adhere, and execute the ideals of our profession. 2014 TAG Product Management Rookie of the Year - Finalist Technology Association of Georgia February 2014 The Technology Association of Georgia’s Rookie Product Manager of the Year Award recognizes the outstanding efforts of a Product Manager, with less than 3 years of experience, to develop, adhere, and execute the ideals of our profession. Additional Honors & Awards Beta Gamma Sigma Additional Honors & Awards Beta Gamma Sigma Additional Honors & Awards Beta Gamma Sigma ", "Experience Threat Researcher & Editor IBM September 2014  – Present (1 year) International Program Manager CorTech December 2012  –  August 2013  (9 months) Threat Analyst IBM April 2002  –  July 2012  (10 years 4 months) Team Lead IT-ISAC 2006  –  2012  (6 years) Team Lead IT-ISAC 2006  –  2012  (6 years) Threat Researcher & Editor IBM September 2014  – Present (1 year) Threat Researcher & Editor IBM September 2014  – Present (1 year) International Program Manager CorTech December 2012  –  August 2013  (9 months) International Program Manager CorTech December 2012  –  August 2013  (9 months) Threat Analyst IBM April 2002  –  July 2012  (10 years 4 months) Threat Analyst IBM April 2002  –  July 2012  (10 years 4 months) Team Lead IT-ISAC 2006  –  2012  (6 years) Team Lead IT-ISAC 2006  –  2012  (6 years) Team Lead IT-ISAC 2006  –  2012  (6 years) Team Lead IT-ISAC 2006  –  2012  (6 years) Languages Spanish Spanish Spanish Skills Information Security... Program Management Network Security Security Vulnerability Management Project Management Firewalls Information Security Vulnerability Assessment Computer Security Management Vendor Management Skills  Information Security... Program Management Network Security Security Vulnerability Management Project Management Firewalls Information Security Vulnerability Assessment Computer Security Management Vendor Management Information Security... Program Management Network Security Security Vulnerability Management Project Management Firewalls Information Security Vulnerability Assessment Computer Security Management Vendor Management Information Security... Program Management Network Security Security Vulnerability Management Project Management Firewalls Information Security Vulnerability Assessment Computer Security Management Vendor Management Education American InterContinental University Master’s Degree,  Information Technology 2000  – 2002 Rollins College Bachelor's degree,  International Relations and Affairs 1995  – 1999 American InterContinental University Master’s Degree,  Information Technology 2000  – 2002 American InterContinental University Master’s Degree,  Information Technology 2000  – 2002 American InterContinental University Master’s Degree,  Information Technology 2000  – 2002 Rollins College Bachelor's degree,  International Relations and Affairs 1995  – 1999 Rollins College Bachelor's degree,  International Relations and Affairs 1995  – 1999 Rollins College Bachelor's degree,  International Relations and Affairs 1995  – 1999 ", "Experience Security Intelligence Analyst IBM May 2014  – Present (1 year 4 months) Walgreens The Security Intelligence Analyst is responsible for analyzing the threats targeting a customer’s environment. The SIA monitors and researches information security threats, assesses customer data, looking for and investigating repeating trends, attacks, malicious IPs, and anomaly type events. The SIA conducts scan reviews and provides recommendations to customers with regards to filters, blocking, and vulnerability remediation; reviews customer policies for auditing purposes as well as tuning recommendations. SIEM Threat Analyst IBM December 2013  – Present (1 year 9 months) The SIEM Threat Analysts are responsible for providing IT security services to clients within the IBM Managed Security Services organization. As a member of a team, or working independently, performs an analytical and technical role in implementation, integration, and delivery of technical IT security solutions, specifically SIEM Solutions, for clients. Sr. Network & Systems Consultant COINCA - Comunicaciones Inalámbricas de Centroamérica January 2013  –  October 2013  (10 months) Network & Systems Analyst Sr. Network Security Engineer Corporacion Hostarica June 2009  –  October 2012  (3 years 5 months) T4 Datacenter, Costa Rica Network Engineer Sistemas Analiticos SA June 2008  –  June 2009  (1 year 1 month) Network Engineer GBM June 2007  –  June 2008  (1 year 1 month) Servers and Storage Engineer Hewlett-Packard 2005  –  2007  (2 years) Security Intelligence Analyst IBM May 2014  – Present (1 year 4 months) Walgreens The Security Intelligence Analyst is responsible for analyzing the threats targeting a customer’s environment. The SIA monitors and researches information security threats, assesses customer data, looking for and investigating repeating trends, attacks, malicious IPs, and anomaly type events. The SIA conducts scan reviews and provides recommendations to customers with regards to filters, blocking, and vulnerability remediation; reviews customer policies for auditing purposes as well as tuning recommendations. Security Intelligence Analyst IBM May 2014  – Present (1 year 4 months) Walgreens The Security Intelligence Analyst is responsible for analyzing the threats targeting a customer’s environment. The SIA monitors and researches information security threats, assesses customer data, looking for and investigating repeating trends, attacks, malicious IPs, and anomaly type events. The SIA conducts scan reviews and provides recommendations to customers with regards to filters, blocking, and vulnerability remediation; reviews customer policies for auditing purposes as well as tuning recommendations. SIEM Threat Analyst IBM December 2013  – Present (1 year 9 months) The SIEM Threat Analysts are responsible for providing IT security services to clients within the IBM Managed Security Services organization. As a member of a team, or working independently, performs an analytical and technical role in implementation, integration, and delivery of technical IT security solutions, specifically SIEM Solutions, for clients. SIEM Threat Analyst IBM December 2013  – Present (1 year 9 months) The SIEM Threat Analysts are responsible for providing IT security services to clients within the IBM Managed Security Services organization. As a member of a team, or working independently, performs an analytical and technical role in implementation, integration, and delivery of technical IT security solutions, specifically SIEM Solutions, for clients. Sr. Network & Systems Consultant COINCA - Comunicaciones Inalámbricas de Centroamérica January 2013  –  October 2013  (10 months) Network & Systems Analyst Sr. Network & Systems Consultant COINCA - Comunicaciones Inalámbricas de Centroamérica January 2013  –  October 2013  (10 months) Network & Systems Analyst Sr. Network Security Engineer Corporacion Hostarica June 2009  –  October 2012  (3 years 5 months) T4 Datacenter, Costa Rica Sr. Network Security Engineer Corporacion Hostarica June 2009  –  October 2012  (3 years 5 months) T4 Datacenter, Costa Rica Network Engineer Sistemas Analiticos SA June 2008  –  June 2009  (1 year 1 month) Network Engineer Sistemas Analiticos SA June 2008  –  June 2009  (1 year 1 month) Network Engineer GBM June 2007  –  June 2008  (1 year 1 month) Network Engineer GBM June 2007  –  June 2008  (1 year 1 month) Servers and Storage Engineer Hewlett-Packard 2005  –  2007  (2 years) Servers and Storage Engineer Hewlett-Packard 2005  –  2007  (2 years) Languages   Skills Fortinet Wireshark VMware Infrastructure CCNA Solarwinds Nessus Cisco CCNA Enterasys ArcSight Nmap Security Data Center Intrusion Detection Ethical Hacker Network Security Networking Cisco Technologies See 2+     See less Skills  Fortinet Wireshark VMware Infrastructure CCNA Solarwinds Nessus Cisco CCNA Enterasys ArcSight Nmap Security Data Center Intrusion Detection Ethical Hacker Network Security Networking Cisco Technologies See 2+     See less Fortinet Wireshark VMware Infrastructure CCNA Solarwinds Nessus Cisco CCNA Enterasys ArcSight Nmap Security Data Center Intrusion Detection Ethical Hacker Network Security Networking Cisco Technologies See 2+     See less Fortinet Wireshark VMware Infrastructure CCNA Solarwinds Nessus Cisco CCNA Enterasys ArcSight Nmap Security Data Center Intrusion Detection Ethical Hacker Network Security Networking Cisco Technologies See 2+     See less Education British School of Costa Rica International Baccalaureate Instituto Tecnologico de Costa Rica Computer Science Universidad Latina de Costa Rica Computer Science British School of Costa Rica International Baccalaureate British School of Costa Rica International Baccalaureate British School of Costa Rica International Baccalaureate Instituto Tecnologico de Costa Rica Computer Science Instituto Tecnologico de Costa Rica Computer Science Instituto Tecnologico de Costa Rica Computer Science Universidad Latina de Costa Rica Computer Science Universidad Latina de Costa Rica Computer Science Universidad Latina de Costa Rica Computer Science Honors & Awards ", "Experience Threat Analyst IBM November 2014  – Present (10 months) Brussels Area, Belgium Threat Analyst IBM November 2014  – Present (10 months) Brussels Area, Belgium Threat Analyst IBM November 2014  – Present (10 months) Brussels Area, Belgium Languages Dutch English French Dutch English French Dutch English French Skills Linux Server Administration OS X LAMP Drupal MySQL Apache IT Management IT Strategy PHP Git Mac OS X IT Operations Web Development XHTML CSS Agile Methodologies Solr Vagrant OpenVPN Apache Solr Teaching System Administration Memcached APC Web Applications Debian DNS Subversion OOP See 15+     See less Skills  Linux Server Administration OS X LAMP Drupal MySQL Apache IT Management IT Strategy PHP Git Mac OS X IT Operations Web Development XHTML CSS Agile Methodologies Solr Vagrant OpenVPN Apache Solr Teaching System Administration Memcached APC Web Applications Debian DNS Subversion OOP See 15+     See less Linux Server Administration OS X LAMP Drupal MySQL Apache IT Management IT Strategy PHP Git Mac OS X IT Operations Web Development XHTML CSS Agile Methodologies Solr Vagrant OpenVPN Apache Solr Teaching System Administration Memcached APC Web Applications Debian DNS Subversion OOP See 15+     See less Linux Server Administration OS X LAMP Drupal MySQL Apache IT Management IT Strategy PHP Git Mac OS X IT Operations Web Development XHTML CSS Agile Methodologies Solr Vagrant OpenVPN Apache Solr Teaching System Administration Memcached APC Web Applications Debian DNS Subversion OOP See 15+     See less "]}