{"position": "Treasury Manager", "company": "Intel Corporation", "profiles": ["Languages French Native or bilingual proficiency Japanese Limited working proficiency French Native or bilingual proficiency Japanese Limited working proficiency French Native or bilingual proficiency Japanese Limited working proficiency Native or bilingual proficiency Limited working proficiency Skills CRM Portfolio Management E-commerce Telecommunications Pre-sales Product Management SaaS Enterprise Software Strategy Analytics Product Marketing Business Strategy Financial Modeling Competitive Analysis Cross-functional Team... Venture Capital Finance Program Management Corporate Finance See 4+     See less Skills  CRM Portfolio Management E-commerce Telecommunications Pre-sales Product Management SaaS Enterprise Software Strategy Analytics Product Marketing Business Strategy Financial Modeling Competitive Analysis Cross-functional Team... Venture Capital Finance Program Management Corporate Finance See 4+     See less CRM Portfolio Management E-commerce Telecommunications Pre-sales Product Management SaaS Enterprise Software Strategy Analytics Product Marketing Business Strategy Financial Modeling Competitive Analysis Cross-functional Team... Venture Capital Finance Program Management Corporate Finance See 4+     See less CRM Portfolio Management E-commerce Telecommunications Pre-sales Product Management SaaS Enterprise Software Strategy Analytics Product Marketing Business Strategy Financial Modeling Competitive Analysis Cross-functional Team... Venture Capital Finance Program Management Corporate Finance See 4+     See less Honors & Awards Intel Achievement Award May 2013 Winner of Intel Achievement Awards in 2013 (Intel’s highest honor) for influencing a significant change of Intel’s capital structure and dividend policy. Intel issued its first dividend and embarked in a major share buyback program, paving the way for tech companies to return cash to shareholders. 2014 CFO Excellence Award February 2014 The CFO awards recognize top projects in finance that drove exceptional results while delivering to the Finance charter. Member of the core team that put together a cash pool entity structure.  Adam Smith - Best Cash Management Solution Treasury Today May 2014 Designed and implemented a new offshore cash pool structure that incorporated intercompany payable netting, which is the basis for our in-house bank. The project was selected among 206 nominations from 24 different countries.  \n Intel Achievement Award May 2013 Winner of Intel Achievement Awards in 2013 (Intel’s highest honor) for influencing a significant change of Intel’s capital structure and dividend policy. Intel issued its first dividend and embarked in a major share buyback program, paving the way for tech companies to return cash to shareholders. Intel Achievement Award May 2013 Winner of Intel Achievement Awards in 2013 (Intel’s highest honor) for influencing a significant change of Intel’s capital structure and dividend policy. Intel issued its first dividend and embarked in a major share buyback program, paving the way for tech companies to return cash to shareholders. Intel Achievement Award May 2013 Winner of Intel Achievement Awards in 2013 (Intel’s highest honor) for influencing a significant change of Intel’s capital structure and dividend policy. Intel issued its first dividend and embarked in a major share buyback program, paving the way for tech companies to return cash to shareholders. 2014 CFO Excellence Award February 2014 The CFO awards recognize top projects in finance that drove exceptional results while delivering to the Finance charter. Member of the core team that put together a cash pool entity structure.  2014 CFO Excellence Award February 2014 The CFO awards recognize top projects in finance that drove exceptional results while delivering to the Finance charter. Member of the core team that put together a cash pool entity structure.  2014 CFO Excellence Award February 2014 The CFO awards recognize top projects in finance that drove exceptional results while delivering to the Finance charter. Member of the core team that put together a cash pool entity structure.  Adam Smith - Best Cash Management Solution Treasury Today May 2014 Designed and implemented a new offshore cash pool structure that incorporated intercompany payable netting, which is the basis for our in-house bank. The project was selected among 206 nominations from 24 different countries.  \n Adam Smith - Best Cash Management Solution Treasury Today May 2014 Designed and implemented a new offshore cash pool structure that incorporated intercompany payable netting, which is the basis for our in-house bank. The project was selected among 206 nominations from 24 different countries.  \n Adam Smith - Best Cash Management Solution Treasury Today May 2014 Designed and implemented a new offshore cash pool structure that incorporated intercompany payable netting, which is the basis for our in-house bank. The project was selected among 206 nominations from 24 different countries.  \n ", "Summary Corporate Finance Leader with 15+ years of domestic and international experience, including end-to-end treasury operations, credit/cash management, and investing. Background includes progressive roles within multibillion-dollar global companies. Excel at introducing controls, strategies, plans, and policies to reduce risk and maximize returns. Offer record of success in process optimization, delivering ongoing improvements and driving efficiency. Strategic advisor and cross-functional leader with strong decision-making, analytical, and problem-solving skills. Summary Corporate Finance Leader with 15+ years of domestic and international experience, including end-to-end treasury operations, credit/cash management, and investing. Background includes progressive roles within multibillion-dollar global companies. Excel at introducing controls, strategies, plans, and policies to reduce risk and maximize returns. Offer record of success in process optimization, delivering ongoing improvements and driving efficiency. Strategic advisor and cross-functional leader with strong decision-making, analytical, and problem-solving skills. Corporate Finance Leader with 15+ years of domestic and international experience, including end-to-end treasury operations, credit/cash management, and investing. Background includes progressive roles within multibillion-dollar global companies. Excel at introducing controls, strategies, plans, and policies to reduce risk and maximize returns. Offer record of success in process optimization, delivering ongoing improvements and driving efficiency. Strategic advisor and cross-functional leader with strong decision-making, analytical, and problem-solving skills. Corporate Finance Leader with 15+ years of domestic and international experience, including end-to-end treasury operations, credit/cash management, and investing. Background includes progressive roles within multibillion-dollar global companies. Excel at introducing controls, strategies, plans, and policies to reduce risk and maximize returns. Offer record of success in process optimization, delivering ongoing improvements and driving efficiency. Strategic advisor and cross-functional leader with strong decision-making, analytical, and problem-solving skills. Experience Director Cash Mgt Intel Corporation January 2006  –  April 2014  (8 years 4 months) Santa Clara, California »\tProvide oversight and planning for $20B investment portfolio in coordination with treasurer; determine increase/ \ndecrease in exposures to issuers based on market conditions and ensure daily compliance with established limits. \n»\tDevise hedging strategies for $7B foreign exchange exposure in collaboration with CFO and treasurer.  \n»\tHead treasury operations for $3B joint venture with presence in 20 countries; crafted hedging strategy and created funding process to maximize cash held by parent company while complying with inter-company sales process.  \nRecent Highlights: \n»\tManaged roll-out of three new foreign exchange hedging programs for purchases of up to $1B and introduced controls to prevent suppliers from renegotiating existing USD contracts at a higher rate.  \n»\tImproved exposure of higher-yielding asset-backed securities from a portfolio of zero to a portfolio of $2B with yield .25% above rest of the portfolio; generated $5M in interest income annually.  \n»\tDecreased losses from mortgage-backed securities by reducing exposures to associated financial institutions.  \n»\tDeveloped training process to educate portfolio managers in credit risks associated with buying investments. \n»\tLed various enhancement initiatives, including deployment of third-party treasury system, development of policies for investing and hedging, and creation of process for managing credit exposure based on derivatives exposure.  \n»\tFocused investing on more complicated transactions to obtain above LIBOR return on cash portfolio. Cash Manager intel January 2001  –  January 2006  (5 years 1 month) Santa Clara, California »\tDirected daily investment and management activities for $15B cash portfolio contributing up to $750M per year in interest income; secured returns above benchmark and at a lower cost.  \n»\tDrove up to $2B in stock buybacks per quarter, attaining shares below volume-weighted average price (VWAP) with zero commission payments to brokers.  \n»\tPartnered with tax group to dividend $6B+ in offshore earnings during one-time tax reduction.  \n»\tAdvised in overall treasury needs and established infrastructure to enable the sale of business divisions. \n \nProcess Improvements & Controls: \n»\tSteered treasury initiatives for post-acquisition integrations, including consolidating accounts, incorporating cash management activities, and providing training to staff in managing growing cash balance.  \n»\tSimplified workflow by driving continuous process improvements, including technology-based automation.  \n»\tDefined controls for cash management in the US and internationally as well as interfaced with trading/investing group to split trading and settlement activities in alignment with SOX regulations.  \n»\tRecovered millions of dollars by discovering banking error that resulted in missed transfer, reporting, and earned interest for collected accounts receivable; negotiated resolution with bank.  \n»\tSpearheaded initiative to improve inter-company settlements, non-A/P group payments, cash flow forecasting, and in-house cash, driving efforts across 200 legal entities and hundreds of employees. Treasury Manager Intel Corporation March 1994  –  January 2001  (6 years 11 months) Santa Clara, California »\tHeaded cash management and investment for $5B-$10B cash portfolio of Intel US; surpassed investing target of LIBOR by purchasing bonds in secondary market and entering them into swaps.  \n»\tInstituted process for daily cash investing and followed up with contracted parties to ensure on-time payment and accurate interest amounts. Treasury Analyst Intel Corporation March 1991  –  February 1994  (3 years) Paris Area, France »\tHeld accountability for European cash portfolio and European commercial paper arbitrage program.  \n»\tObtained above LIBOR return on $500M portfolio and improved exchange gains and losses by instituting strategy for hedging company exposure earlier and with less volatility.  \n»\tSecured local financing for manufacturing facility construction in Ireland, attaining low interest rates and gaining a $1M savings based on hedging. Treasury Manager Intel Corporation October 1989  –  February 1991  (1 year 5 months) Munich Area, Germany »\tOversaw credit and cash activities for Intel’s Germany operations, including credit lines and customer A/R; led credit collections team as well as achieved and maintained DSO target of 35 days.  \n»\tManaged daily cash process for transfer of excess balances to European treasury for investment.  \n»\tTerminated relationship with customer on verge of bankruptcy and eliminated credit exposure.  \n»\tCreated pension funds invested in a mixture of equities and bonds to offset a growing liability Various Citibank, Germany June 1981  –  September 1989  (8 years 4 months) Frankfurt Am Main Area, Germany Began career as an OPERATIONS/FINANCIAL ANALYST with CITIBANK in Frankfurt, Germany. Promoted to CREDIT OFFICER, leading and training a team of analysts for unsecured credit lines as well as defining and monitoring credit limits for customers. Created profitability monitoring system for the bank’s operations department. Director Cash Mgt Intel Corporation January 2006  –  April 2014  (8 years 4 months) Santa Clara, California »\tProvide oversight and planning for $20B investment portfolio in coordination with treasurer; determine increase/ \ndecrease in exposures to issuers based on market conditions and ensure daily compliance with established limits. \n»\tDevise hedging strategies for $7B foreign exchange exposure in collaboration with CFO and treasurer.  \n»\tHead treasury operations for $3B joint venture with presence in 20 countries; crafted hedging strategy and created funding process to maximize cash held by parent company while complying with inter-company sales process.  \nRecent Highlights: \n»\tManaged roll-out of three new foreign exchange hedging programs for purchases of up to $1B and introduced controls to prevent suppliers from renegotiating existing USD contracts at a higher rate.  \n»\tImproved exposure of higher-yielding asset-backed securities from a portfolio of zero to a portfolio of $2B with yield .25% above rest of the portfolio; generated $5M in interest income annually.  \n»\tDecreased losses from mortgage-backed securities by reducing exposures to associated financial institutions.  \n»\tDeveloped training process to educate portfolio managers in credit risks associated with buying investments. \n»\tLed various enhancement initiatives, including deployment of third-party treasury system, development of policies for investing and hedging, and creation of process for managing credit exposure based on derivatives exposure.  \n»\tFocused investing on more complicated transactions to obtain above LIBOR return on cash portfolio. Director Cash Mgt Intel Corporation January 2006  –  April 2014  (8 years 4 months) Santa Clara, California »\tProvide oversight and planning for $20B investment portfolio in coordination with treasurer; determine increase/ \ndecrease in exposures to issuers based on market conditions and ensure daily compliance with established limits. \n»\tDevise hedging strategies for $7B foreign exchange exposure in collaboration with CFO and treasurer.  \n»\tHead treasury operations for $3B joint venture with presence in 20 countries; crafted hedging strategy and created funding process to maximize cash held by parent company while complying with inter-company sales process.  \nRecent Highlights: \n»\tManaged roll-out of three new foreign exchange hedging programs for purchases of up to $1B and introduced controls to prevent suppliers from renegotiating existing USD contracts at a higher rate.  \n»\tImproved exposure of higher-yielding asset-backed securities from a portfolio of zero to a portfolio of $2B with yield .25% above rest of the portfolio; generated $5M in interest income annually.  \n»\tDecreased losses from mortgage-backed securities by reducing exposures to associated financial institutions.  \n»\tDeveloped training process to educate portfolio managers in credit risks associated with buying investments. \n»\tLed various enhancement initiatives, including deployment of third-party treasury system, development of policies for investing and hedging, and creation of process for managing credit exposure based on derivatives exposure.  \n»\tFocused investing on more complicated transactions to obtain above LIBOR return on cash portfolio. Cash Manager intel January 2001  –  January 2006  (5 years 1 month) Santa Clara, California »\tDirected daily investment and management activities for $15B cash portfolio contributing up to $750M per year in interest income; secured returns above benchmark and at a lower cost.  \n»\tDrove up to $2B in stock buybacks per quarter, attaining shares below volume-weighted average price (VWAP) with zero commission payments to brokers.  \n»\tPartnered with tax group to dividend $6B+ in offshore earnings during one-time tax reduction.  \n»\tAdvised in overall treasury needs and established infrastructure to enable the sale of business divisions. \n \nProcess Improvements & Controls: \n»\tSteered treasury initiatives for post-acquisition integrations, including consolidating accounts, incorporating cash management activities, and providing training to staff in managing growing cash balance.  \n»\tSimplified workflow by driving continuous process improvements, including technology-based automation.  \n»\tDefined controls for cash management in the US and internationally as well as interfaced with trading/investing group to split trading and settlement activities in alignment with SOX regulations.  \n»\tRecovered millions of dollars by discovering banking error that resulted in missed transfer, reporting, and earned interest for collected accounts receivable; negotiated resolution with bank.  \n»\tSpearheaded initiative to improve inter-company settlements, non-A/P group payments, cash flow forecasting, and in-house cash, driving efforts across 200 legal entities and hundreds of employees. Cash Manager intel January 2001  –  January 2006  (5 years 1 month) Santa Clara, California »\tDirected daily investment and management activities for $15B cash portfolio contributing up to $750M per year in interest income; secured returns above benchmark and at a lower cost.  \n»\tDrove up to $2B in stock buybacks per quarter, attaining shares below volume-weighted average price (VWAP) with zero commission payments to brokers.  \n»\tPartnered with tax group to dividend $6B+ in offshore earnings during one-time tax reduction.  \n»\tAdvised in overall treasury needs and established infrastructure to enable the sale of business divisions. \n \nProcess Improvements & Controls: \n»\tSteered treasury initiatives for post-acquisition integrations, including consolidating accounts, incorporating cash management activities, and providing training to staff in managing growing cash balance.  \n»\tSimplified workflow by driving continuous process improvements, including technology-based automation.  \n»\tDefined controls for cash management in the US and internationally as well as interfaced with trading/investing group to split trading and settlement activities in alignment with SOX regulations.  \n»\tRecovered millions of dollars by discovering banking error that resulted in missed transfer, reporting, and earned interest for collected accounts receivable; negotiated resolution with bank.  \n»\tSpearheaded initiative to improve inter-company settlements, non-A/P group payments, cash flow forecasting, and in-house cash, driving efforts across 200 legal entities and hundreds of employees. Treasury Manager Intel Corporation March 1994  –  January 2001  (6 years 11 months) Santa Clara, California »\tHeaded cash management and investment for $5B-$10B cash portfolio of Intel US; surpassed investing target of LIBOR by purchasing bonds in secondary market and entering them into swaps.  \n»\tInstituted process for daily cash investing and followed up with contracted parties to ensure on-time payment and accurate interest amounts. Treasury Manager Intel Corporation March 1994  –  January 2001  (6 years 11 months) Santa Clara, California »\tHeaded cash management and investment for $5B-$10B cash portfolio of Intel US; surpassed investing target of LIBOR by purchasing bonds in secondary market and entering them into swaps.  \n»\tInstituted process for daily cash investing and followed up with contracted parties to ensure on-time payment and accurate interest amounts. Treasury Analyst Intel Corporation March 1991  –  February 1994  (3 years) Paris Area, France »\tHeld accountability for European cash portfolio and European commercial paper arbitrage program.  \n»\tObtained above LIBOR return on $500M portfolio and improved exchange gains and losses by instituting strategy for hedging company exposure earlier and with less volatility.  \n»\tSecured local financing for manufacturing facility construction in Ireland, attaining low interest rates and gaining a $1M savings based on hedging. Treasury Analyst Intel Corporation March 1991  –  February 1994  (3 years) Paris Area, France »\tHeld accountability for European cash portfolio and European commercial paper arbitrage program.  \n»\tObtained above LIBOR return on $500M portfolio and improved exchange gains and losses by instituting strategy for hedging company exposure earlier and with less volatility.  \n»\tSecured local financing for manufacturing facility construction in Ireland, attaining low interest rates and gaining a $1M savings based on hedging. Treasury Manager Intel Corporation October 1989  –  February 1991  (1 year 5 months) Munich Area, Germany »\tOversaw credit and cash activities for Intel’s Germany operations, including credit lines and customer A/R; led credit collections team as well as achieved and maintained DSO target of 35 days.  \n»\tManaged daily cash process for transfer of excess balances to European treasury for investment.  \n»\tTerminated relationship with customer on verge of bankruptcy and eliminated credit exposure.  \n»\tCreated pension funds invested in a mixture of equities and bonds to offset a growing liability Treasury Manager Intel Corporation October 1989  –  February 1991  (1 year 5 months) Munich Area, Germany »\tOversaw credit and cash activities for Intel’s Germany operations, including credit lines and customer A/R; led credit collections team as well as achieved and maintained DSO target of 35 days.  \n»\tManaged daily cash process for transfer of excess balances to European treasury for investment.  \n»\tTerminated relationship with customer on verge of bankruptcy and eliminated credit exposure.  \n»\tCreated pension funds invested in a mixture of equities and bonds to offset a growing liability Various Citibank, Germany June 1981  –  September 1989  (8 years 4 months) Frankfurt Am Main Area, Germany Began career as an OPERATIONS/FINANCIAL ANALYST with CITIBANK in Frankfurt, Germany. Promoted to CREDIT OFFICER, leading and training a team of analysts for unsecured credit lines as well as defining and monitoring credit limits for customers. Created profitability monitoring system for the bank’s operations department. Various Citibank, Germany June 1981  –  September 1989  (8 years 4 months) Frankfurt Am Main Area, Germany Began career as an OPERATIONS/FINANCIAL ANALYST with CITIBANK in Frankfurt, Germany. Promoted to CREDIT OFFICER, leading and training a team of analysts for unsecured credit lines as well as defining and monitoring credit limits for customers. Created profitability monitoring system for the bank’s operations department. Languages English Native or bilingual proficiency German Full professional proficiency French Limited working proficiency Spanish Professional working proficiency English Native or bilingual proficiency German Full professional proficiency French Limited working proficiency Spanish Professional working proficiency English Native or bilingual proficiency German Full professional proficiency French Limited working proficiency Spanish Professional working proficiency Native or bilingual proficiency Full professional proficiency Limited working proficiency Professional working proficiency Skills Hedging Treasury Management Financial Analysis FX Cash Management Financial Markets Cash Portfolio Management Fixed Income Derivatives Investments Cash Flow Credit Risk Financial Management Securities Credit Corporate Treasury Financial Modeling Capital Markets Investment Banking Finance Strategic Financial... Valuation Private Equity Asset Management Risk Management Bloomberg Corporate Finance Mergers & Acquisitions Emerging Markets Trading Options Financial Risk Due Diligence Equities Venture Capital Banking Sarbanes-Oxley Act Executive Management Financial Services Forecasting Enterprise Risk... Internal Controls Financial Reporting Divestitures Internal Audit Variance Analysis US GAAP Treasury See 34+     See less Skills  Hedging Treasury Management Financial Analysis FX Cash Management Financial Markets Cash Portfolio Management Fixed Income Derivatives Investments Cash Flow Credit Risk Financial Management Securities Credit Corporate Treasury Financial Modeling Capital Markets Investment Banking Finance Strategic Financial... Valuation Private Equity Asset Management Risk Management Bloomberg Corporate Finance Mergers & Acquisitions Emerging Markets Trading Options Financial Risk Due Diligence Equities Venture Capital Banking Sarbanes-Oxley Act Executive Management Financial Services Forecasting Enterprise Risk... Internal Controls Financial Reporting Divestitures Internal Audit Variance Analysis US GAAP Treasury See 34+     See less Hedging Treasury Management Financial Analysis FX Cash Management Financial Markets Cash Portfolio Management Fixed Income Derivatives Investments Cash Flow Credit Risk Financial Management Securities Credit Corporate Treasury Financial Modeling Capital Markets Investment Banking Finance Strategic Financial... Valuation Private Equity Asset Management Risk Management Bloomberg Corporate Finance Mergers & Acquisitions Emerging Markets Trading Options Financial Risk Due Diligence Equities Venture Capital Banking Sarbanes-Oxley Act Executive Management Financial Services Forecasting Enterprise Risk... Internal Controls Financial Reporting Divestitures Internal Audit Variance Analysis US GAAP Treasury See 34+     See less Hedging Treasury Management Financial Analysis FX Cash Management Financial Markets Cash Portfolio Management Fixed Income Derivatives Investments Cash Flow Credit Risk Financial Management Securities Credit Corporate Treasury Financial Modeling Capital Markets Investment Banking Finance Strategic Financial... Valuation Private Equity Asset Management Risk Management Bloomberg Corporate Finance Mergers & Acquisitions Emerging Markets Trading Options Financial Risk Due Diligence Equities Venture Capital Banking Sarbanes-Oxley Act Executive Management Financial Services Forecasting Enterprise Risk... Internal Controls Financial Reporting Divestitures Internal Audit Variance Analysis US GAAP Treasury See 34+     See less Education Thunderbird School of Global Management Masters of International Mgt,  Int'l Finance 1980  – 1980 University of Maryland - Robert H. Smith School of Business Bachelor's Degree,  Finance , General 1977  – 1979 Thunderbird School of Global Management Masters of International Mgt,  Int'l Finance 1980  – 1980 Thunderbird School of Global Management Masters of International Mgt,  Int'l Finance 1980  – 1980 Thunderbird School of Global Management Masters of International Mgt,  Int'l Finance 1980  – 1980 University of Maryland - Robert H. Smith School of Business Bachelor's Degree,  Finance , General 1977  – 1979 University of Maryland - Robert H. Smith School of Business Bachelor's Degree,  Finance , General 1977  – 1979 University of Maryland - Robert H. Smith School of Business Bachelor's Degree,  Finance , General 1977  – 1979 ", "Experience Treasury Manager Intel Corporation Treasury Manager Intel Corporation Treasury Manager Intel Corporation ", "Summary Holder of CPA, CFA and MBA qualifications. Over 15 years of investment management experience in equity, fixed income and alternative investments. Extensive exposure in investment program establishment and performance monitoring, development of risk management strategy, financial and banking systems implementation and treasury processes re-engineering. Outstanding analytical and communication skills, innovative attitude as well as intensive participation in financial systems developments Summary Holder of CPA, CFA and MBA qualifications. Over 15 years of investment management experience in equity, fixed income and alternative investments. Extensive exposure in investment program establishment and performance monitoring, development of risk management strategy, financial and banking systems implementation and treasury processes re-engineering. Outstanding analytical and communication skills, innovative attitude as well as intensive participation in financial systems developments Holder of CPA, CFA and MBA qualifications. Over 15 years of investment management experience in equity, fixed income and alternative investments. Extensive exposure in investment program establishment and performance monitoring, development of risk management strategy, financial and banking systems implementation and treasury processes re-engineering. Outstanding analytical and communication skills, innovative attitude as well as intensive participation in financial systems developments Holder of CPA, CFA and MBA qualifications. Over 15 years of investment management experience in equity, fixed income and alternative investments. Extensive exposure in investment program establishment and performance monitoring, development of risk management strategy, financial and banking systems implementation and treasury processes re-engineering. Outstanding analytical and communication skills, innovative attitude as well as intensive participation in financial systems developments Experience Senior Finance Manager HKUST Manager - Billing & Credit Control CLP Power Hong Kong Ltd December 2002  –  June 2008  (5 years 7 months) VP & Regional Treasurer AIG August 2000  –  February 2002  (1 year 7 months) Hong Kong Treasury Manager CLP Power Hong Kong Ltd July 1994  –  August 2000  (6 years 2 months) Assistant Treasury Manager Intel Corporation August 1986  –  May 1992  (5 years 10 months) Hong Kong Senior Finance Manager HKUST Senior Finance Manager HKUST Manager - Billing & Credit Control CLP Power Hong Kong Ltd December 2002  –  June 2008  (5 years 7 months) Manager - Billing & Credit Control CLP Power Hong Kong Ltd December 2002  –  June 2008  (5 years 7 months) VP & Regional Treasurer AIG August 2000  –  February 2002  (1 year 7 months) Hong Kong VP & Regional Treasurer AIG August 2000  –  February 2002  (1 year 7 months) Hong Kong Treasury Manager CLP Power Hong Kong Ltd July 1994  –  August 2000  (6 years 2 months) Treasury Manager CLP Power Hong Kong Ltd July 1994  –  August 2000  (6 years 2 months) Assistant Treasury Manager Intel Corporation August 1986  –  May 1992  (5 years 10 months) Hong Kong Assistant Treasury Manager Intel Corporation August 1986  –  May 1992  (5 years 10 months) Hong Kong Skills Finance Corporate Finance Valuation Financial Modeling Funding Financial Risk... ERP Credit Analysis Billing Systems Payments Accounts Receivable Collections Capital Markets Treasury Management Core Banking Credit Rating Alternative Investments Institutional... Strategic Planning Equities Risk Management Treasury Banking Strategy See 9+     See less Skills  Finance Corporate Finance Valuation Financial Modeling Funding Financial Risk... ERP Credit Analysis Billing Systems Payments Accounts Receivable Collections Capital Markets Treasury Management Core Banking Credit Rating Alternative Investments Institutional... Strategic Planning Equities Risk Management Treasury Banking Strategy See 9+     See less Finance Corporate Finance Valuation Financial Modeling Funding Financial Risk... ERP Credit Analysis Billing Systems Payments Accounts Receivable Collections Capital Markets Treasury Management Core Banking Credit Rating Alternative Investments Institutional... Strategic Planning Equities Risk Management Treasury Banking Strategy See 9+     See less Finance Corporate Finance Valuation Financial Modeling Funding Financial Risk... ERP Credit Analysis Billing Systems Payments Accounts Receivable Collections Capital Markets Treasury Management Core Banking Credit Rating Alternative Investments Institutional... Strategic Planning Equities Risk Management Treasury Banking Strategy See 9+     See less Education CFA 2001 CPA Australia The Chinese University of Hong Kong Bachelor of Business Administration (B.B.A.),  Finance University of Warwick - Warwick Business School Master of Business Administration (MBA) CFA 2001 CFA 2001 CFA 2001 CPA Australia CPA Australia CPA Australia The Chinese University of Hong Kong Bachelor of Business Administration (B.B.A.),  Finance The Chinese University of Hong Kong Bachelor of Business Administration (B.B.A.),  Finance The Chinese University of Hong Kong Bachelor of Business Administration (B.B.A.),  Finance University of Warwick - Warwick Business School Master of Business Administration (MBA) University of Warwick - Warwick Business School Master of Business Administration (MBA) University of Warwick - Warwick Business School Master of Business Administration (MBA) ", "Experience Postgraduate Researcher University of Birmingham September 2013  – Present (2 years) Vice President Barclays Capital December 2006  –  May 2013  (6 years 6 months) Director HBOS Treasury Services 2005  –  2006  (1 year) Treasury Manager Intel Corporation 2000  –  2004  (4 years) Postgraduate Researcher University of Birmingham September 2013  – Present (2 years) Postgraduate Researcher University of Birmingham September 2013  – Present (2 years) Vice President Barclays Capital December 2006  –  May 2013  (6 years 6 months) Vice President Barclays Capital December 2006  –  May 2013  (6 years 6 months) Director HBOS Treasury Services 2005  –  2006  (1 year) Director HBOS Treasury Services 2005  –  2006  (1 year) Treasury Manager Intel Corporation 2000  –  2004  (4 years) Treasury Manager Intel Corporation 2000  –  2004  (4 years) Education Aston University Bachelor of Science (BS),  Business Administration and Management , General , 2:1 1989  – 1992 Aston University Bachelor of Science (BS),  Business Administration and Management , General , 2:1 1989  – 1992 Aston University Bachelor of Science (BS),  Business Administration and Management , General , 2:1 1989  – 1992 Aston University Bachelor of Science (BS),  Business Administration and Management , General , 2:1 1989  – 1992 ", "Summary Specialties:Foreign exchange \nCredit Insurance \nCash Management Summary Specialties:Foreign exchange \nCredit Insurance \nCash Management Specialties:Foreign exchange \nCredit Insurance \nCash Management Specialties:Foreign exchange \nCredit Insurance \nCash Management Experience Credit Manager Intel Corporation December 2010  – Present (4 years 9 months) Credit manager for customer portfolio in Europe made up of large multinational distributors and OEM's. Also responsible for designing, implementing and monitoring credit programs to support our customers. Treasury Manager Intel Corporation June 2005  –  December 2010  (5 years 7 months) Responsible for managing foreign exchange and commodity risk for EMEA operations. Supported daily cash management activities, banking and controls and investing excess cash in fixed income markets. Credit Manager Intel Corporation December 2010  – Present (4 years 9 months) Credit manager for customer portfolio in Europe made up of large multinational distributors and OEM's. Also responsible for designing, implementing and monitoring credit programs to support our customers. Credit Manager Intel Corporation December 2010  – Present (4 years 9 months) Credit manager for customer portfolio in Europe made up of large multinational distributors and OEM's. Also responsible for designing, implementing and monitoring credit programs to support our customers. Treasury Manager Intel Corporation June 2005  –  December 2010  (5 years 7 months) Responsible for managing foreign exchange and commodity risk for EMEA operations. Supported daily cash management activities, banking and controls and investing excess cash in fixed income markets. Treasury Manager Intel Corporation June 2005  –  December 2010  (5 years 7 months) Responsible for managing foreign exchange and commodity risk for EMEA operations. Supported daily cash management activities, banking and controls and investing excess cash in fixed income markets. Skills Financial Risk Portfolio Management Cash Management Banking Credit Management Fixed Income Investments Internal Controls Program Management Treasury Foreign Exchange Financial Analysis Forecasting Financial Modeling Skills  Financial Risk Portfolio Management Cash Management Banking Credit Management Fixed Income Investments Internal Controls Program Management Treasury Foreign Exchange Financial Analysis Forecasting Financial Modeling Financial Risk Portfolio Management Cash Management Banking Credit Management Fixed Income Investments Internal Controls Program Management Treasury Foreign Exchange Financial Analysis Forecasting Financial Modeling Financial Risk Portfolio Management Cash Management Banking Credit Management Fixed Income Investments Internal Controls Program Management Treasury Foreign Exchange Financial Analysis Forecasting Financial Modeling Education The Association of Executives in Finance, Credit and International Business Certified International Credit Professional 2011  – 2011 Chartered Institute of Management Accountants CIMA 2006  – 2009 University of the West of England BA,  Business studies 2001  – 2005 The Association of Executives in Finance, Credit and International Business Certified International Credit Professional 2011  – 2011 The Association of Executives in Finance, Credit and International Business Certified International Credit Professional 2011  – 2011 The Association of Executives in Finance, Credit and International Business Certified International Credit Professional 2011  – 2011 Chartered Institute of Management Accountants CIMA 2006  – 2009 Chartered Institute of Management Accountants CIMA 2006  – 2009 Chartered Institute of Management Accountants CIMA 2006  – 2009 University of the West of England BA,  Business studies 2001  – 2005 University of the West of England BA,  Business studies 2001  – 2005 University of the West of England BA,  Business studies 2001  – 2005 ", "Summary Strong managerial and consulting background with senior leve, international experience and multiple sector exposures. Currently runs Finamce and Operations at Global NGO with focus on improving lives of persons with disabilities in the poorest regions of the world. Summary Strong managerial and consulting background with senior leve, international experience and multiple sector exposures. Currently runs Finamce and Operations at Global NGO with focus on improving lives of persons with disabilities in the poorest regions of the world. Strong managerial and consulting background with senior leve, international experience and multiple sector exposures. Currently runs Finamce and Operations at Global NGO with focus on improving lives of persons with disabilities in the poorest regions of the world. Strong managerial and consulting background with senior leve, international experience and multiple sector exposures. Currently runs Finamce and Operations at Global NGO with focus on improving lives of persons with disabilities in the poorest regions of the world. Experience CFO CBM International February 2015  – Present (7 months) Bensheim, Germany CFO responsible for Finance and Operations of Christian Blind Mission / Christoffel Blindenmission International: \n \nCBM is an international Christian development organisation, committed to improving the quality of life of people with disabilities in the poorest communities of the world. Based on its Christian values and over 100 years of professional expertise, CBM addresses poverty as a cause and a consequence of disability, and works in partnership to create an inclusive society for all. Head of Strategic Cash & Financial Supply Chain Management KPMG January 2013  –  February 2015  (2 years 2 months) Frankfurt Am Main Area, Germany Heading the Strategic Cash & Financial Supply Chain Management: \n \n- Cash Profile Optimization & Cash Strategy Development \n- Cash Flow Forecasting, Cash & Working Capital Controlling \n- Releasing Cash From Operations: Operational optimization or synthetic supply chain finance \n- Treasury, Financial Risk Management & Corporate Finance Head of Management Consulting - Corporates KPMG AG (Switzerland) July 2011  –  December 2012  (1 year 6 months) Zürich Head the Corporate Sector & Corporate Risk & Finance Practice of Management Consulting of KPMG Switzerland. Director - Global & US Service Development KPMG LLP (USA) June 2008  –  June 2011  (3 years 1 month) Greater New York City Area Responsible for Global & Service Service Developement: \n \n- Target Operating Model Transformation \n- Treasury & Cash Management Optimization \n- Working Capital Management \n- Banking Regulation: Capital Management, Liquidity Risk Management, \"Too Big To Fail\" Regulation Senior Manager KPMG ELLP (Germany) March 2001  –  June 2008  (7 years 4 months) Frankfurt Am Main Area, Germany Acquisition and delivery of projects with blue chip clients: \n \nCost Optimization \nCash & Working Capital Management Optimization \nTreasury & Risk Management \nOrder-to-Cash, Pruchase-to-Pay, Forecast-to-Fulfill Optimization Director Product Management & Development (EMEA) Cortera, Inc. February 2000  –  February 2001  (1 year 1 month) London, United Kingdom Product management & localization of real-time sales financing and credit risk & collection management software for the EMEA market place. \n \nResponsible fo the Implementation of system solutions at blue chip clients and for pre-sales. Treasury Manager Intel Corporation February 1995  –  January 2000  (5 years) United Kingdom & USA (California) Line management responsibility: \n \nCash Management (EMEA) \nInvestment Management (EMEA) \nCredit & Collection Management (EMEA) \nMinority Investment & Portfolio Management (USA) \nStartegic Venture Capital (USA) \nFinancial Due Diligence (USA) \nPost Merge Integration (USA) CFO CBM International February 2015  – Present (7 months) Bensheim, Germany CFO responsible for Finance and Operations of Christian Blind Mission / Christoffel Blindenmission International: \n \nCBM is an international Christian development organisation, committed to improving the quality of life of people with disabilities in the poorest communities of the world. Based on its Christian values and over 100 years of professional expertise, CBM addresses poverty as a cause and a consequence of disability, and works in partnership to create an inclusive society for all. CFO CBM International February 2015  – Present (7 months) Bensheim, Germany CFO responsible for Finance and Operations of Christian Blind Mission / Christoffel Blindenmission International: \n \nCBM is an international Christian development organisation, committed to improving the quality of life of people with disabilities in the poorest communities of the world. Based on its Christian values and over 100 years of professional expertise, CBM addresses poverty as a cause and a consequence of disability, and works in partnership to create an inclusive society for all. Head of Strategic Cash & Financial Supply Chain Management KPMG January 2013  –  February 2015  (2 years 2 months) Frankfurt Am Main Area, Germany Heading the Strategic Cash & Financial Supply Chain Management: \n \n- Cash Profile Optimization & Cash Strategy Development \n- Cash Flow Forecasting, Cash & Working Capital Controlling \n- Releasing Cash From Operations: Operational optimization or synthetic supply chain finance \n- Treasury, Financial Risk Management & Corporate Finance Head of Strategic Cash & Financial Supply Chain Management KPMG January 2013  –  February 2015  (2 years 2 months) Frankfurt Am Main Area, Germany Heading the Strategic Cash & Financial Supply Chain Management: \n \n- Cash Profile Optimization & Cash Strategy Development \n- Cash Flow Forecasting, Cash & Working Capital Controlling \n- Releasing Cash From Operations: Operational optimization or synthetic supply chain finance \n- Treasury, Financial Risk Management & Corporate Finance Head of Management Consulting - Corporates KPMG AG (Switzerland) July 2011  –  December 2012  (1 year 6 months) Zürich Head the Corporate Sector & Corporate Risk & Finance Practice of Management Consulting of KPMG Switzerland. Head of Management Consulting - Corporates KPMG AG (Switzerland) July 2011  –  December 2012  (1 year 6 months) Zürich Head the Corporate Sector & Corporate Risk & Finance Practice of Management Consulting of KPMG Switzerland. Director - Global & US Service Development KPMG LLP (USA) June 2008  –  June 2011  (3 years 1 month) Greater New York City Area Responsible for Global & Service Service Developement: \n \n- Target Operating Model Transformation \n- Treasury & Cash Management Optimization \n- Working Capital Management \n- Banking Regulation: Capital Management, Liquidity Risk Management, \"Too Big To Fail\" Regulation Director - Global & US Service Development KPMG LLP (USA) June 2008  –  June 2011  (3 years 1 month) Greater New York City Area Responsible for Global & Service Service Developement: \n \n- Target Operating Model Transformation \n- Treasury & Cash Management Optimization \n- Working Capital Management \n- Banking Regulation: Capital Management, Liquidity Risk Management, \"Too Big To Fail\" Regulation Senior Manager KPMG ELLP (Germany) March 2001  –  June 2008  (7 years 4 months) Frankfurt Am Main Area, Germany Acquisition and delivery of projects with blue chip clients: \n \nCost Optimization \nCash & Working Capital Management Optimization \nTreasury & Risk Management \nOrder-to-Cash, Pruchase-to-Pay, Forecast-to-Fulfill Optimization Senior Manager KPMG ELLP (Germany) March 2001  –  June 2008  (7 years 4 months) Frankfurt Am Main Area, Germany Acquisition and delivery of projects with blue chip clients: \n \nCost Optimization \nCash & Working Capital Management Optimization \nTreasury & Risk Management \nOrder-to-Cash, Pruchase-to-Pay, Forecast-to-Fulfill Optimization Director Product Management & Development (EMEA) Cortera, Inc. February 2000  –  February 2001  (1 year 1 month) London, United Kingdom Product management & localization of real-time sales financing and credit risk & collection management software for the EMEA market place. \n \nResponsible fo the Implementation of system solutions at blue chip clients and for pre-sales. Director Product Management & Development (EMEA) Cortera, Inc. February 2000  –  February 2001  (1 year 1 month) London, United Kingdom Product management & localization of real-time sales financing and credit risk & collection management software for the EMEA market place. \n \nResponsible fo the Implementation of system solutions at blue chip clients and for pre-sales. Treasury Manager Intel Corporation February 1995  –  January 2000  (5 years) United Kingdom & USA (California) Line management responsibility: \n \nCash Management (EMEA) \nInvestment Management (EMEA) \nCredit & Collection Management (EMEA) \nMinority Investment & Portfolio Management (USA) \nStartegic Venture Capital (USA) \nFinancial Due Diligence (USA) \nPost Merge Integration (USA) Treasury Manager Intel Corporation February 1995  –  January 2000  (5 years) United Kingdom & USA (California) Line management responsibility: \n \nCash Management (EMEA) \nInvestment Management (EMEA) \nCredit & Collection Management (EMEA) \nMinority Investment & Portfolio Management (USA) \nStartegic Venture Capital (USA) \nFinancial Due Diligence (USA) \nPost Merge Integration (USA) Skills Banking Business Strategy Consulting Change Management Management Consulting Risk Management Strategy Corporate Finance Mergers & Acquisitions Finance Management Due Diligence Business Process... Financial Analysis Skills  Banking Business Strategy Consulting Change Management Management Consulting Risk Management Strategy Corporate Finance Mergers & Acquisitions Finance Management Due Diligence Business Process... Financial Analysis Banking Business Strategy Consulting Change Management Management Consulting Risk Management Strategy Corporate Finance Mergers & Acquisitions Finance Management Due Diligence Business Process... Financial Analysis Banking Business Strategy Consulting Change Management Management Consulting Risk Management Strategy Corporate Finance Mergers & Acquisitions Finance Management Due Diligence Business Process... Financial Analysis Education Golden Gate University Master of Business Administration,  Finance 1998  – 2000 Also hold  \n- BA (Hons) Manchster Metropolitan University, UK \n- Diplom Betriebswirt, Bochum, Germany Golden Gate University Master of Business Administration,  Finance 1998  – 2000 Also hold  \n- BA (Hons) Manchster Metropolitan University, UK \n- Diplom Betriebswirt, Bochum, Germany Golden Gate University Master of Business Administration,  Finance 1998  – 2000 Also hold  \n- BA (Hons) Manchster Metropolitan University, UK \n- Diplom Betriebswirt, Bochum, Germany Golden Gate University Master of Business Administration,  Finance 1998  – 2000 Also hold  \n- BA (Hons) Manchster Metropolitan University, UK \n- Diplom Betriebswirt, Bochum, Germany ", "Summary I have substantial management and corporate experience, having worked as Manager, Consulting with the leading Irish treasury and financial consulting firm in the International Financial Services Centre (IFSC) and as Treasury Manager with Intel Ireland, before joining the Department of Economics in UCC. My research interests include innovation, regional development and competitiveness, business performance and strategy and innovation and enterprise policy. I lecture at undergraduate and postgraduate levels and also organise Executive Workshops in Innovation for Competitiveness. I am also Programme Director for the BSc (Business and Financial Economics), which is a joint degree between UCC and four Chinese universities, in Zhengzhou, Guilin and two in Beijing. Specialties:Economics, Innovation, Education Summary I have substantial management and corporate experience, having worked as Manager, Consulting with the leading Irish treasury and financial consulting firm in the International Financial Services Centre (IFSC) and as Treasury Manager with Intel Ireland, before joining the Department of Economics in UCC. My research interests include innovation, regional development and competitiveness, business performance and strategy and innovation and enterprise policy. I lecture at undergraduate and postgraduate levels and also organise Executive Workshops in Innovation for Competitiveness. I am also Programme Director for the BSc (Business and Financial Economics), which is a joint degree between UCC and four Chinese universities, in Zhengzhou, Guilin and two in Beijing. Specialties:Economics, Innovation, Education I have substantial management and corporate experience, having worked as Manager, Consulting with the leading Irish treasury and financial consulting firm in the International Financial Services Centre (IFSC) and as Treasury Manager with Intel Ireland, before joining the Department of Economics in UCC. My research interests include innovation, regional development and competitiveness, business performance and strategy and innovation and enterprise policy. I lecture at undergraduate and postgraduate levels and also organise Executive Workshops in Innovation for Competitiveness. I am also Programme Director for the BSc (Business and Financial Economics), which is a joint degree between UCC and four Chinese universities, in Zhengzhou, Guilin and two in Beijing. Specialties:Economics, Innovation, Education I have substantial management and corporate experience, having worked as Manager, Consulting with the leading Irish treasury and financial consulting firm in the International Financial Services Centre (IFSC) and as Treasury Manager with Intel Ireland, before joining the Department of Economics in UCC. My research interests include innovation, regional development and competitiveness, business performance and strategy and innovation and enterprise policy. I lecture at undergraduate and postgraduate levels and also organise Executive Workshops in Innovation for Competitiveness. I am also Programme Director for the BSc (Business and Financial Economics), which is a joint degree between UCC and four Chinese universities, in Zhengzhou, Guilin and two in Beijing. Specialties:Economics, Innovation, Education Experience Lecturer in Economics UCC September 2006  – Present (9 years) Cork, Ireland Treasury Manager Intel Corporation January 2000  –  March 2001  (1 year 3 months) Leixlip, Ireland Site responsibility for treasury function. Manager, Consulting FTI March 1994  –  December 1999  (5 years 10 months) Dublin, Ireland Lecturer in Economics UCC September 2006  – Present (9 years) Cork, Ireland Lecturer in Economics UCC September 2006  – Present (9 years) Cork, Ireland Treasury Manager Intel Corporation January 2000  –  March 2001  (1 year 3 months) Leixlip, Ireland Site responsibility for treasury function. Treasury Manager Intel Corporation January 2000  –  March 2001  (1 year 3 months) Leixlip, Ireland Site responsibility for treasury function. Manager, Consulting FTI March 1994  –  December 1999  (5 years 10 months) Dublin, Ireland Manager, Consulting FTI March 1994  –  December 1999  (5 years 10 months) Dublin, Ireland Education University College Cork PhD,  Economics 2007 Thesis title: Innovation in Ireland’s ‘High-Technology’ Businesses: The Roles of Interaction and Proximity University College Dublin MEconSc,  Economics 1991  – 1993 University of Limerick BBS,  Business 1987  – 1991 University College Cork PhD,  Economics 2007 Thesis title: Innovation in Ireland’s ‘High-Technology’ Businesses: The Roles of Interaction and Proximity University College Cork PhD,  Economics 2007 Thesis title: Innovation in Ireland’s ‘High-Technology’ Businesses: The Roles of Interaction and Proximity University College Cork PhD,  Economics 2007 Thesis title: Innovation in Ireland’s ‘High-Technology’ Businesses: The Roles of Interaction and Proximity University College Dublin MEconSc,  Economics 1991  – 1993 University College Dublin MEconSc,  Economics 1991  – 1993 University College Dublin MEconSc,  Economics 1991  – 1993 University of Limerick BBS,  Business 1987  – 1991 University of Limerick BBS,  Business 1987  – 1991 University of Limerick BBS,  Business 1987  – 1991 ", "Experience Manager, Asia Pacific Treasury Micron Semiconductor Asia Pte. Ltd. January 2011  – Present (4 years 8 months) Regional Treasury Manager - Asia Numonyx June 2009  –  December 2010  (1 year 7 months) Treasury Manager Intel Corporation October 2004  –  April 2009  (4 years 7 months) Philippines Treasury Analyst Intel Corporation August 1999  –  September 2004  (5 years 2 months) Philippines Treasury Marketing Officer Equitable PCI Bank November 1996  –  July 1999  (2 years 9 months) Philippines Manager, Asia Pacific Treasury Micron Semiconductor Asia Pte. Ltd. January 2011  – Present (4 years 8 months) Manager, Asia Pacific Treasury Micron Semiconductor Asia Pte. Ltd. January 2011  – Present (4 years 8 months) Regional Treasury Manager - Asia Numonyx June 2009  –  December 2010  (1 year 7 months) Regional Treasury Manager - Asia Numonyx June 2009  –  December 2010  (1 year 7 months) Treasury Manager Intel Corporation October 2004  –  April 2009  (4 years 7 months) Philippines Treasury Manager Intel Corporation October 2004  –  April 2009  (4 years 7 months) Philippines Treasury Analyst Intel Corporation August 1999  –  September 2004  (5 years 2 months) Philippines Treasury Analyst Intel Corporation August 1999  –  September 2004  (5 years 2 months) Philippines Treasury Marketing Officer Equitable PCI Bank November 1996  –  July 1999  (2 years 9 months) Philippines Treasury Marketing Officer Equitable PCI Bank November 1996  –  July 1999  (2 years 9 months) Philippines Skills Treasury Management Corporate Finance Treasury SAP Financial Analysis Sarbanes-Oxley Act Financial Reporting Strategic Financial... Financial Modeling Forecasting Skills  Treasury Management Corporate Finance Treasury SAP Financial Analysis Sarbanes-Oxley Act Financial Reporting Strategic Financial... Financial Modeling Forecasting Treasury Management Corporate Finance Treasury SAP Financial Analysis Sarbanes-Oxley Act Financial Reporting Strategic Financial... Financial Modeling Forecasting Treasury Management Corporate Finance Treasury SAP Financial Analysis Sarbanes-Oxley Act Financial Reporting Strategic Financial... Financial Modeling Forecasting Education University of the Philippines Bachelor of Science (B.S.),  Economics 1991  – 1995 University of the Philippines Bachelor of Science (B.S.),  Economics 1991  – 1995 University of the Philippines Bachelor of Science (B.S.),  Economics 1991  – 1995 University of the Philippines Bachelor of Science (B.S.),  Economics 1991  – 1995 ", "Experience Treasury Manager Intel Corporation June 2011  – Present (4 years 3 months) Dalian, Liaoning, China Senior Manager Mizuho Bank October 2002  –  May 2011  (8 years 8 months) Dalian, Liaoning, China Purchasing Assistant Walmart July 2001  –  October 2002  (1 year 4 months) Dalian, Liaoning, China Treasury Manager Intel Corporation June 2011  – Present (4 years 3 months) Dalian, Liaoning, China Treasury Manager Intel Corporation June 2011  – Present (4 years 3 months) Dalian, Liaoning, China Senior Manager Mizuho Bank October 2002  –  May 2011  (8 years 8 months) Dalian, Liaoning, China Senior Manager Mizuho Bank October 2002  –  May 2011  (8 years 8 months) Dalian, Liaoning, China Purchasing Assistant Walmart July 2001  –  October 2002  (1 year 4 months) Dalian, Liaoning, China Purchasing Assistant Walmart July 2001  –  October 2002  (1 year 4 months) Dalian, Liaoning, China Education Dongbei University of Finance and Economics Bachelor of International Finance 1997  – 2001 Dongbei University of Finance and Economics Bachelor of International Finance 1997  – 2001 Dongbei University of Finance and Economics Bachelor of International Finance 1997  – 2001 Dongbei University of Finance and Economics Bachelor of International Finance 1997  – 2001 ", "Summary Cash and Investment Management for Intel Treasury. Involves hands on experience with Money Market instruments, Medium term bonds/notes, Interest Rate Swaps, Cross Currency Swaps, Currency Option, Currency Forwards etc.  \n \nAccomplished investment research with xpertise in macro-economic, quantitative, and credit analysis. Hands-on experience in technical and fundamental research – asset allocation strategies, fundamental credit opinion, and ideating new investment themes. Highly regarded as a solution provider by the partners/peers and a good team player with proven track record in establishing sound investment strategies through analysis of gargantuan data. Specialties:Portfolio and Investment Mangement, Macroeconomic, Credit, and Quantitative Research/Analysis. Summary Cash and Investment Management for Intel Treasury. Involves hands on experience with Money Market instruments, Medium term bonds/notes, Interest Rate Swaps, Cross Currency Swaps, Currency Option, Currency Forwards etc.  \n \nAccomplished investment research with xpertise in macro-economic, quantitative, and credit analysis. Hands-on experience in technical and fundamental research – asset allocation strategies, fundamental credit opinion, and ideating new investment themes. Highly regarded as a solution provider by the partners/peers and a good team player with proven track record in establishing sound investment strategies through analysis of gargantuan data. Specialties:Portfolio and Investment Mangement, Macroeconomic, Credit, and Quantitative Research/Analysis. Cash and Investment Management for Intel Treasury. Involves hands on experience with Money Market instruments, Medium term bonds/notes, Interest Rate Swaps, Cross Currency Swaps, Currency Option, Currency Forwards etc.  \n \nAccomplished investment research with xpertise in macro-economic, quantitative, and credit analysis. Hands-on experience in technical and fundamental research – asset allocation strategies, fundamental credit opinion, and ideating new investment themes. Highly regarded as a solution provider by the partners/peers and a good team player with proven track record in establishing sound investment strategies through analysis of gargantuan data. Specialties:Portfolio and Investment Mangement, Macroeconomic, Credit, and Quantitative Research/Analysis. Cash and Investment Management for Intel Treasury. Involves hands on experience with Money Market instruments, Medium term bonds/notes, Interest Rate Swaps, Cross Currency Swaps, Currency Option, Currency Forwards etc.  \n \nAccomplished investment research with xpertise in macro-economic, quantitative, and credit analysis. Hands-on experience in technical and fundamental research – asset allocation strategies, fundamental credit opinion, and ideating new investment themes. Highly regarded as a solution provider by the partners/peers and a good team player with proven track record in establishing sound investment strategies through analysis of gargantuan data. Specialties:Portfolio and Investment Mangement, Macroeconomic, Credit, and Quantitative Research/Analysis. Experience Treasury Manager Intel Corporation October 2014  – Present (11 months) San Francisco Bay Area Cash and Investment Management for Intel Treasury. Treasury Manager Intel India Pvt Ltd October 2012  –  September 2014  (2 years) Bangalore Cash and Investment Management for Intel Treasury. Involves hands on experience with Money Market instruments, Medium term bonds/notes, Interest Rate Swaps, Cross Currency Swaps, Currency Option, Currency Forwards etc. Treasury Analyst Intel India Pvt Ltd April 2010  –  October 2012  (2 years 7 months) Cash management of all APAC entities of Intel, including money market investments and foreign exchange trades. Credit Associate Fidelity Investments December 2007  –  March 2010  (2 years 4 months) Macro economic and Credit research for sectors like Retail, Supermarkets, Sovereigns, and Asset Allocation, for Fidelity Fixed Income Funds in US. Senior Associate Infosys May 2006  –  December 2007  (1 year 8 months) Quantitative research on variety of interest rate based products like future basis, swap basis, TIPS, Strips etc for Deutsche Bank, Rates research team in US. Summer Intern Polaris Software Lab June 2005  –  July 2005  (2 months) Worked on Enterprise Application Intergration (EAI) industry trends and the outlook for the next year Treasury Manager Intel Corporation October 2014  – Present (11 months) San Francisco Bay Area Cash and Investment Management for Intel Treasury. Treasury Manager Intel Corporation October 2014  – Present (11 months) San Francisco Bay Area Cash and Investment Management for Intel Treasury. Treasury Manager Intel India Pvt Ltd October 2012  –  September 2014  (2 years) Bangalore Cash and Investment Management for Intel Treasury. Involves hands on experience with Money Market instruments, Medium term bonds/notes, Interest Rate Swaps, Cross Currency Swaps, Currency Option, Currency Forwards etc. Treasury Manager Intel India Pvt Ltd October 2012  –  September 2014  (2 years) Bangalore Cash and Investment Management for Intel Treasury. Involves hands on experience with Money Market instruments, Medium term bonds/notes, Interest Rate Swaps, Cross Currency Swaps, Currency Option, Currency Forwards etc. Treasury Analyst Intel India Pvt Ltd April 2010  –  October 2012  (2 years 7 months) Cash management of all APAC entities of Intel, including money market investments and foreign exchange trades. Treasury Analyst Intel India Pvt Ltd April 2010  –  October 2012  (2 years 7 months) Cash management of all APAC entities of Intel, including money market investments and foreign exchange trades. Credit Associate Fidelity Investments December 2007  –  March 2010  (2 years 4 months) Macro economic and Credit research for sectors like Retail, Supermarkets, Sovereigns, and Asset Allocation, for Fidelity Fixed Income Funds in US. Credit Associate Fidelity Investments December 2007  –  March 2010  (2 years 4 months) Macro economic and Credit research for sectors like Retail, Supermarkets, Sovereigns, and Asset Allocation, for Fidelity Fixed Income Funds in US. Senior Associate Infosys May 2006  –  December 2007  (1 year 8 months) Quantitative research on variety of interest rate based products like future basis, swap basis, TIPS, Strips etc for Deutsche Bank, Rates research team in US. Senior Associate Infosys May 2006  –  December 2007  (1 year 8 months) Quantitative research on variety of interest rate based products like future basis, swap basis, TIPS, Strips etc for Deutsche Bank, Rates research team in US. Summer Intern Polaris Software Lab June 2005  –  July 2005  (2 months) Worked on Enterprise Application Intergration (EAI) industry trends and the outlook for the next year Summer Intern Polaris Software Lab June 2005  –  July 2005  (2 months) Worked on Enterprise Application Intergration (EAI) industry trends and the outlook for the next year Skills Credit & Macroeconomic... Fixed Income Trading ST Liquidity Management Credit Macroeconomics Liquidity Management Fixed Income Financial Modeling Investments Analysis Options Treasury Trading Finance Portfolio Management Economics Mergers & Acquisitions Cash Management Treasury Management Investment Management See 5+     See less Skills  Credit & Macroeconomic... Fixed Income Trading ST Liquidity Management Credit Macroeconomics Liquidity Management Fixed Income Financial Modeling Investments Analysis Options Treasury Trading Finance Portfolio Management Economics Mergers & Acquisitions Cash Management Treasury Management Investment Management See 5+     See less Credit & Macroeconomic... Fixed Income Trading ST Liquidity Management Credit Macroeconomics Liquidity Management Fixed Income Financial Modeling Investments Analysis Options Treasury Trading Finance Portfolio Management Economics Mergers & Acquisitions Cash Management Treasury Management Investment Management See 5+     See less Credit & Macroeconomic... Fixed Income Trading ST Liquidity Management Credit Macroeconomics Liquidity Management Fixed Income Financial Modeling Investments Analysis Options Treasury Trading Finance Portfolio Management Economics Mergers & Acquisitions Cash Management Treasury Management Investment Management See 5+     See less Education CFA Institute (formerly AIMR) CFA,  Portfolio Management , Alternative Investments 2008  – 2010 Global Association of Risk Professionals (FRM) FRM,  Quantitative Risk framework 2009  – 2009 Xavier Institute of Management PGDBM,  Finance 2004  – 2006 Business Management in Finance Utkal University B Tech,  Information Technology 2000  – 2004 Graduate Program in Information Technology CFA Institute (formerly AIMR) CFA,  Portfolio Management , Alternative Investments 2008  – 2010 CFA Institute (formerly AIMR) CFA,  Portfolio Management , Alternative Investments 2008  – 2010 CFA Institute (formerly AIMR) CFA,  Portfolio Management , Alternative Investments 2008  – 2010 Global Association of Risk Professionals (FRM) FRM,  Quantitative Risk framework 2009  – 2009 Global Association of Risk Professionals (FRM) FRM,  Quantitative Risk framework 2009  – 2009 Global Association of Risk Professionals (FRM) FRM,  Quantitative Risk framework 2009  – 2009 Xavier Institute of Management PGDBM,  Finance 2004  – 2006 Business Management in Finance Xavier Institute of Management PGDBM,  Finance 2004  – 2006 Business Management in Finance Xavier Institute of Management PGDBM,  Finance 2004  – 2006 Business Management in Finance Utkal University B Tech,  Information Technology 2000  – 2004 Graduate Program in Information Technology Utkal University B Tech,  Information Technology 2000  – 2004 Graduate Program in Information Technology Utkal University B Tech,  Information Technology 2000  – 2004 Graduate Program in Information Technology ", "Skills Financial Analysis Treasury Management Treasury Financial Risk Cash Management Derivatives Corporate Finance Skills  Financial Analysis Treasury Management Treasury Financial Risk Cash Management Derivatives Corporate Finance Financial Analysis Treasury Management Treasury Financial Risk Cash Management Derivatives Corporate Finance Financial Analysis Treasury Management Treasury Financial Risk Cash Management Derivatives Corporate Finance ", "Languages Russian German Spanish Russian German Spanish Russian German Spanish Skills Financial Analysis Cash Management Fixed Income Credit Risk Foreign Exchange Customer Service Retirement Planning Corporate Finance Treasury Management Financial Modeling Treasury Finance Valuation Due Diligence Investments Forecasting Capital Markets Portfolio Management Derivatives Risk Management Strategic Financial... Banking Internal Controls See 8+     See less Skills  Financial Analysis Cash Management Fixed Income Credit Risk Foreign Exchange Customer Service Retirement Planning Corporate Finance Treasury Management Financial Modeling Treasury Finance Valuation Due Diligence Investments Forecasting Capital Markets Portfolio Management Derivatives Risk Management Strategic Financial... Banking Internal Controls See 8+     See less Financial Analysis Cash Management Fixed Income Credit Risk Foreign Exchange Customer Service Retirement Planning Corporate Finance Treasury Management Financial Modeling Treasury Finance Valuation Due Diligence Investments Forecasting Capital Markets Portfolio Management Derivatives Risk Management Strategic Financial... Banking Internal Controls See 8+     See less Financial Analysis Cash Management Fixed Income Credit Risk Foreign Exchange Customer Service Retirement Planning Corporate Finance Treasury Management Financial Modeling Treasury Finance Valuation Due Diligence Investments Forecasting Capital Markets Portfolio Management Derivatives Risk Management Strategic Financial... Banking Internal Controls See 8+     See less ", "Summary a problem solver Summary a problem solver a problem solver a problem solver Experience Finance & Accounting Manager ZWILLING J.A HENCKELS ITALIA SRL February 2012  – Present (3 years 7 months) Buccinasco Milano CO.GE , Customer Collection, Bank & Interco reconciliation, Reporting, CEE data managing, IFRS principle applications, Year end balance sheet completion , Sales statistic reports set-up, assisting sales and back office for any contractual-accounting topics Financial Controller Acal Italia May 1989  –  October 2010  (21 years 6 months) see my profile as Capra Fiammetta Treasury Manager Intel Corporation Italia srl January 1984  –  April 1989  (5 years 4 months) Customer Collection, local customer credit line set up, Bank accounting set-up, managing local bank relationships, import accounting data entries and transfer margins supervision Finance & Accounting Manager ZWILLING J.A HENCKELS ITALIA SRL February 2012  – Present (3 years 7 months) Buccinasco Milano CO.GE , Customer Collection, Bank & Interco reconciliation, Reporting, CEE data managing, IFRS principle applications, Year end balance sheet completion , Sales statistic reports set-up, assisting sales and back office for any contractual-accounting topics Finance & Accounting Manager ZWILLING J.A HENCKELS ITALIA SRL February 2012  – Present (3 years 7 months) Buccinasco Milano CO.GE , Customer Collection, Bank & Interco reconciliation, Reporting, CEE data managing, IFRS principle applications, Year end balance sheet completion , Sales statistic reports set-up, assisting sales and back office for any contractual-accounting topics Financial Controller Acal Italia May 1989  –  October 2010  (21 years 6 months) see my profile as Capra Fiammetta Financial Controller Acal Italia May 1989  –  October 2010  (21 years 6 months) see my profile as Capra Fiammetta Treasury Manager Intel Corporation Italia srl January 1984  –  April 1989  (5 years 4 months) Customer Collection, local customer credit line set up, Bank accounting set-up, managing local bank relationships, import accounting data entries and transfer margins supervision Treasury Manager Intel Corporation Italia srl January 1984  –  April 1989  (5 years 4 months) Customer Collection, local customer credit line set up, Bank accounting set-up, managing local bank relationships, import accounting data entries and transfer margins supervision Languages English English English Skills Financial Reporting Restructuring Forecasting Mergers Financial Analysis Budgets Finance Key Performance... JD Edwards Business Strategy Skills  Financial Reporting Restructuring Forecasting Mergers Financial Analysis Budgets Finance Key Performance... JD Edwards Business Strategy Financial Reporting Restructuring Forecasting Mergers Financial Analysis Budgets Finance Key Performance... JD Edwards Business Strategy Financial Reporting Restructuring Forecasting Mergers Financial Analysis Budgets Finance Key Performance... JD Edwards Business Strategy Education Università degli Studi di Milano University degree 1980  – 1987 Università degli Studi di Milano University degree 1980  – 1987 Università degli Studi di Milano University degree 1980  – 1987 Università degli Studi di Milano University degree 1980  – 1987 ", "Experience North America Credit Manager Intel Corporation March 2012  – Present (3 years 6 months) Folsom, California Credit Manager for North America responsible for setting the credit lines that Intel provides to customers like Apple, IBM, HP and Dell among others. \nConduct periodic reviews and in depth analysis of customer's financial statements. \nDiscuss strategy and business outlook with the Customer's Senior Management. Treasury Manager Intel Corporation September 2005  –  March 2012  (6 years 7 months) San Jose, Costa Rica Cash management for Intel Costa Rica's factory operations, and Ecuador and Venezuela sales and marketing offices. \nManage Intel's corporate relationship with different banks and represent Intel before multiple external organizations. \nHedging strategy and execution for multiple currencies including EUR, JPY and CRC. \nProject Manager for the world wide transition of intercompany transactions to the new Treasury system. Treasury Specialist Procter & Gamble March 2002  –  September 2005  (3 years 7 months) San Jose, Costa Rica Bank relationship management with direct responsibility for all the documentation and controls of over 600 bank accounts. \nManagement of the bank fee expense budget with the responsibility to implement strategies to reduce bank fees. \nKey member of the transition team that migrated the Treasury Banking operations from the US headquarter to Costa Rica's Service Center. North America Credit Manager Intel Corporation March 2012  – Present (3 years 6 months) Folsom, California Credit Manager for North America responsible for setting the credit lines that Intel provides to customers like Apple, IBM, HP and Dell among others. \nConduct periodic reviews and in depth analysis of customer's financial statements. \nDiscuss strategy and business outlook with the Customer's Senior Management. North America Credit Manager Intel Corporation March 2012  – Present (3 years 6 months) Folsom, California Credit Manager for North America responsible for setting the credit lines that Intel provides to customers like Apple, IBM, HP and Dell among others. \nConduct periodic reviews and in depth analysis of customer's financial statements. \nDiscuss strategy and business outlook with the Customer's Senior Management. Treasury Manager Intel Corporation September 2005  –  March 2012  (6 years 7 months) San Jose, Costa Rica Cash management for Intel Costa Rica's factory operations, and Ecuador and Venezuela sales and marketing offices. \nManage Intel's corporate relationship with different banks and represent Intel before multiple external organizations. \nHedging strategy and execution for multiple currencies including EUR, JPY and CRC. \nProject Manager for the world wide transition of intercompany transactions to the new Treasury system. Treasury Manager Intel Corporation September 2005  –  March 2012  (6 years 7 months) San Jose, Costa Rica Cash management for Intel Costa Rica's factory operations, and Ecuador and Venezuela sales and marketing offices. \nManage Intel's corporate relationship with different banks and represent Intel before multiple external organizations. \nHedging strategy and execution for multiple currencies including EUR, JPY and CRC. \nProject Manager for the world wide transition of intercompany transactions to the new Treasury system. Treasury Specialist Procter & Gamble March 2002  –  September 2005  (3 years 7 months) San Jose, Costa Rica Bank relationship management with direct responsibility for all the documentation and controls of over 600 bank accounts. \nManagement of the bank fee expense budget with the responsibility to implement strategies to reduce bank fees. \nKey member of the transition team that migrated the Treasury Banking operations from the US headquarter to Costa Rica's Service Center. Treasury Specialist Procter & Gamble March 2002  –  September 2005  (3 years 7 months) San Jose, Costa Rica Bank relationship management with direct responsibility for all the documentation and controls of over 600 bank accounts. \nManagement of the bank fee expense budget with the responsibility to implement strategies to reduce bank fees. \nKey member of the transition team that migrated the Treasury Banking operations from the US headquarter to Costa Rica's Service Center. Languages English Full professional proficiency Portuguese Full professional proficiency Spanish Native or bilingual proficiency English Full professional proficiency Portuguese Full professional proficiency Spanish Native or bilingual proficiency English Full professional proficiency Portuguese Full professional proficiency Spanish Native or bilingual proficiency Full professional proficiency Full professional proficiency Native or bilingual proficiency Skills Cash Management Financial Audits FX Hedging Credit Analysis Banking Relationships Financial Modeling Corporate Finance Internal Controls Financial Analysis Budgets Management Financial Reporting Strategy Finance Forecasting Analysis Team Leadership Banking SAP Cross-functional Team... Credit Treasury Process Improvement See 8+     See less Skills  Cash Management Financial Audits FX Hedging Credit Analysis Banking Relationships Financial Modeling Corporate Finance Internal Controls Financial Analysis Budgets Management Financial Reporting Strategy Finance Forecasting Analysis Team Leadership Banking SAP Cross-functional Team... Credit Treasury Process Improvement See 8+     See less Cash Management Financial Audits FX Hedging Credit Analysis Banking Relationships Financial Modeling Corporate Finance Internal Controls Financial Analysis Budgets Management Financial Reporting Strategy Finance Forecasting Analysis Team Leadership Banking SAP Cross-functional Team... Credit Treasury Process Improvement See 8+     See less Cash Management Financial Audits FX Hedging Credit Analysis Banking Relationships Financial Modeling Corporate Finance Internal Controls Financial Analysis Budgets Management Financial Reporting Strategy Finance Forecasting Analysis Team Leadership Banking SAP Cross-functional Team... Credit Treasury Process Improvement See 8+     See less Education Thunderbird School of Global Management MBA,  Global Management 2011  – 2013 Universidad de Costa Rica Bach,  Economics 1998  – 2001 Colegio Metodista 1993  – 1997 Thunderbird School of Global Management MBA,  Global Management 2011  – 2013 Thunderbird School of Global Management MBA,  Global Management 2011  – 2013 Thunderbird School of Global Management MBA,  Global Management 2011  – 2013 Universidad de Costa Rica Bach,  Economics 1998  – 2001 Universidad de Costa Rica Bach,  Economics 1998  – 2001 Universidad de Costa Rica Bach,  Economics 1998  – 2001 Colegio Metodista 1993  – 1997 Colegio Metodista 1993  – 1997 Colegio Metodista 1993  – 1997 ", "Summary Professional experience: \n- US: investment banking (acquisition, LBO and other high yield debt financing), with Merrill Lynch, 1991-1994 \n- Europe: private equity investment (beverage/food sector in Central & Eastern Europe), with European Bank, 1995-2000 \n- Europe: corporate development and strategic investment (technology and telecommunications), with Intel Capital, 2000-2001 \n- Global: investor relations, initially with Centrica (2001-2003) and more recently SVP at SABMiller (2003-present), combining internal business and industry coverage with strategic analysis and equity market relationship management Summary Professional experience: \n- US: investment banking (acquisition, LBO and other high yield debt financing), with Merrill Lynch, 1991-1994 \n- Europe: private equity investment (beverage/food sector in Central & Eastern Europe), with European Bank, 1995-2000 \n- Europe: corporate development and strategic investment (technology and telecommunications), with Intel Capital, 2000-2001 \n- Global: investor relations, initially with Centrica (2001-2003) and more recently SVP at SABMiller (2003-present), combining internal business and industry coverage with strategic analysis and equity market relationship management Professional experience: \n- US: investment banking (acquisition, LBO and other high yield debt financing), with Merrill Lynch, 1991-1994 \n- Europe: private equity investment (beverage/food sector in Central & Eastern Europe), with European Bank, 1995-2000 \n- Europe: corporate development and strategic investment (technology and telecommunications), with Intel Capital, 2000-2001 \n- Global: investor relations, initially with Centrica (2001-2003) and more recently SVP at SABMiller (2003-present), combining internal business and industry coverage with strategic analysis and equity market relationship management Professional experience: \n- US: investment banking (acquisition, LBO and other high yield debt financing), with Merrill Lynch, 1991-1994 \n- Europe: private equity investment (beverage/food sector in Central & Eastern Europe), with European Bank, 1995-2000 \n- Europe: corporate development and strategic investment (technology and telecommunications), with Intel Capital, 2000-2001 \n- Global: investor relations, initially with Centrica (2001-2003) and more recently SVP at SABMiller (2003-present), combining internal business and industry coverage with strategic analysis and equity market relationship management Experience Senior Vice President, Investor Relations and Internal Communications SABMiller (includes MillerCoors in US) September 2003  – Present (12 years) Director, Investor Relations Centrica plc 2001  –  2003  (2 years) Senior Treasury Manager Intel Corporation 2000  –  2001  (1 year) Principal EBRD 1995  –  1999  (4 years) Principal European Bank 1995  –  1999  (4 years) Financial Analyst Merrill Lynch 1991  –  1994  (3 years) Senior Vice President, Investor Relations and Internal Communications SABMiller (includes MillerCoors in US) September 2003  – Present (12 years) Senior Vice President, Investor Relations and Internal Communications SABMiller (includes MillerCoors in US) September 2003  – Present (12 years) Director, Investor Relations Centrica plc 2001  –  2003  (2 years) Director, Investor Relations Centrica plc 2001  –  2003  (2 years) Senior Treasury Manager Intel Corporation 2000  –  2001  (1 year) Senior Treasury Manager Intel Corporation 2000  –  2001  (1 year) Principal EBRD 1995  –  1999  (4 years) Principal EBRD 1995  –  1999  (4 years) Principal European Bank 1995  –  1999  (4 years) Principal European Bank 1995  –  1999  (4 years) Financial Analyst Merrill Lynch 1991  –  1994  (3 years) Financial Analyst Merrill Lynch 1991  –  1994  (3 years) ", "Experience Treasury Manager Intel Corporation February 2012  – Present (3 years 7 months) Cash Manager Intel Corporation April 2010  –  January 2012  (1 year 10 months) Senior Treasury Analyst Intel Corporation November 2006  –  March 2010  (3 years 5 months) Bangalore Team Lead HP January 2005  –  November 2006  (1 year 11 months) Senior Process Associate Accenture April 2003  –  January 2005  (1 year 10 months) Treasury Manager Intel Corporation February 2012  – Present (3 years 7 months) Treasury Manager Intel Corporation February 2012  – Present (3 years 7 months) Cash Manager Intel Corporation April 2010  –  January 2012  (1 year 10 months) Cash Manager Intel Corporation April 2010  –  January 2012  (1 year 10 months) Senior Treasury Analyst Intel Corporation November 2006  –  March 2010  (3 years 5 months) Bangalore Senior Treasury Analyst Intel Corporation November 2006  –  March 2010  (3 years 5 months) Bangalore Team Lead HP January 2005  –  November 2006  (1 year 11 months) Team Lead HP January 2005  –  November 2006  (1 year 11 months) Senior Process Associate Accenture April 2003  –  January 2005  (1 year 10 months) Senior Process Associate Accenture April 2003  –  January 2005  (1 year 10 months) Skills Cash Management Investments Financial Modeling Financial Analysis Business Process... Treasury Management Hedging Portfolio Management Treasury Financial Reporting Fixed Income FX Options Corporate Finance Auditing Derivatives Financial Risk Finance See 2+     See less Skills  Cash Management Investments Financial Modeling Financial Analysis Business Process... Treasury Management Hedging Portfolio Management Treasury Financial Reporting Fixed Income FX Options Corporate Finance Auditing Derivatives Financial Risk Finance See 2+     See less Cash Management Investments Financial Modeling Financial Analysis Business Process... Treasury Management Hedging Portfolio Management Treasury Financial Reporting Fixed Income FX Options Corporate Finance Auditing Derivatives Financial Risk Finance See 2+     See less Cash Management Investments Financial Modeling Financial Analysis Business Process... Treasury Management Hedging Portfolio Management Treasury Financial Reporting Fixed Income FX Options Corporate Finance Auditing Derivatives Financial Risk Finance See 2+     See less ", "Skills Corporate Finance Foreign Exchange... Fixed Income Working Capital... Treasury Management Financial Analysis Portfolio Management Derivatives Financial Risk Financial Modeling Skills  Corporate Finance Foreign Exchange... Fixed Income Working Capital... Treasury Management Financial Analysis Portfolio Management Derivatives Financial Risk Financial Modeling Corporate Finance Foreign Exchange... Fixed Income Working Capital... Treasury Management Financial Analysis Portfolio Management Derivatives Financial Risk Financial Modeling Corporate Finance Foreign Exchange... Fixed Income Working Capital... Treasury Management Financial Analysis Portfolio Management Derivatives Financial Risk Financial Modeling ", "Experience Senior Treasury Manager - Middle Office Imperial Tobacco October 2014  – Present (11 months) Bristol Senior Treasury Analyst Imperial Tobacco July 2012  –  October 2014  (2 years 4 months) Bristol, United Kingdom Group Treasurer The Peacock Group July 2006  –  June 2012  (6 years) Cardiff, United Kingdom Returned to Peacocks following an MBO which involved taking on a somewhat optimistic amount of debt, but made life often very interesting from a treasury perspective. Treasury Manager Intel Corporation UK April 2005  –  May 2006  (1 year 2 months) Swindon, United Kingdom Senior Treasury Manager - Middle Office Imperial Tobacco October 2014  – Present (11 months) Bristol Senior Treasury Manager - Middle Office Imperial Tobacco October 2014  – Present (11 months) Bristol Senior Treasury Analyst Imperial Tobacco July 2012  –  October 2014  (2 years 4 months) Bristol, United Kingdom Senior Treasury Analyst Imperial Tobacco July 2012  –  October 2014  (2 years 4 months) Bristol, United Kingdom Group Treasurer The Peacock Group July 2006  –  June 2012  (6 years) Cardiff, United Kingdom Returned to Peacocks following an MBO which involved taking on a somewhat optimistic amount of debt, but made life often very interesting from a treasury perspective. Group Treasurer The Peacock Group July 2006  –  June 2012  (6 years) Cardiff, United Kingdom Returned to Peacocks following an MBO which involved taking on a somewhat optimistic amount of debt, but made life often very interesting from a treasury perspective. Treasury Manager Intel Corporation UK April 2005  –  May 2006  (1 year 2 months) Swindon, United Kingdom Treasury Manager Intel Corporation UK April 2005  –  May 2006  (1 year 2 months) Swindon, United Kingdom Skills Cash Flow Budgets Cash Management Banking Accounting Treasury Treasury Management Working Capital... FX Options Corporate Finance Managerial Finance Risk Management Financial Reporting Forecasting Derivatives Strategic Financial... Financial Risk Business Planning Funding Financial Analysis Financial Modeling See 6+     See less Skills  Cash Flow Budgets Cash Management Banking Accounting Treasury Treasury Management Working Capital... FX Options Corporate Finance Managerial Finance Risk Management Financial Reporting Forecasting Derivatives Strategic Financial... Financial Risk Business Planning Funding Financial Analysis Financial Modeling See 6+     See less Cash Flow Budgets Cash Management Banking Accounting Treasury Treasury Management Working Capital... FX Options Corporate Finance Managerial Finance Risk Management Financial Reporting Forecasting Derivatives Strategic Financial... Financial Risk Business Planning Funding Financial Analysis Financial Modeling See 6+     See less Cash Flow Budgets Cash Management Banking Accounting Treasury Treasury Management Working Capital... FX Options Corporate Finance Managerial Finance Risk Management Financial Reporting Forecasting Derivatives Strategic Financial... Financial Risk Business Planning Funding Financial Analysis Financial Modeling See 6+     See less Education Association of Corporate Treasurers AMCT 2001 University of Leicester BA (Hons) Economics 1989  – 1992 University of Leicester MA in Business Analysis 1992  – 1993 Association of Corporate Treasurers AMCT 2001 Association of Corporate Treasurers AMCT 2001 Association of Corporate Treasurers AMCT 2001 University of Leicester BA (Hons) Economics 1989  – 1992 University of Leicester BA (Hons) Economics 1989  – 1992 University of Leicester BA (Hons) Economics 1989  – 1992 University of Leicester MA in Business Analysis 1992  – 1993 University of Leicester MA in Business Analysis 1992  – 1993 University of Leicester MA in Business Analysis 1992  – 1993 ", "Experience Government Affairs (Finance) manager Intel Corporation April 2008  – Present (7 years 5 months) Treasury manager Intel Corporation January 2004  –  April 2008  (4 years 4 months) Treasury analyst Intel Corporation June 1999  –  December 2003  (4 years 7 months) Government Affairs (Finance) manager Intel Corporation April 2008  – Present (7 years 5 months) Government Affairs (Finance) manager Intel Corporation April 2008  – Present (7 years 5 months) Treasury manager Intel Corporation January 2004  –  April 2008  (4 years 4 months) Treasury manager Intel Corporation January 2004  –  April 2008  (4 years 4 months) Treasury analyst Intel Corporation June 1999  –  December 2003  (4 years 7 months) Treasury analyst Intel Corporation June 1999  –  December 2003  (4 years 7 months) Skills Financial Analysis Financial Forecasting Finance Financial Modeling Forecasting Corporate Finance Skills  Financial Analysis Financial Forecasting Finance Financial Modeling Forecasting Corporate Finance Financial Analysis Financial Forecasting Finance Financial Modeling Forecasting Corporate Finance Financial Analysis Financial Forecasting Finance Financial Modeling Forecasting Corporate Finance Education The college of Management- Academic Studies Accounting (CPA) 2002  – 2004 Ben-Gurion University of the Negev MBA,  Corporate Finance 1995  – 1998 Ben-Gurion University of the Negev BA,  Economics & Business Managment 1992  – 1995 The college of Management- Academic Studies Accounting (CPA) 2002  – 2004 The college of Management- Academic Studies Accounting (CPA) 2002  – 2004 The college of Management- Academic Studies Accounting (CPA) 2002  – 2004 Ben-Gurion University of the Negev MBA,  Corporate Finance 1995  – 1998 Ben-Gurion University of the Negev MBA,  Corporate Finance 1995  – 1998 Ben-Gurion University of the Negev MBA,  Corporate Finance 1995  – 1998 Ben-Gurion University of the Negev BA,  Economics & Business Managment 1992  – 1995 Ben-Gurion University of the Negev BA,  Economics & Business Managment 1992  – 1995 Ben-Gurion University of the Negev BA,  Economics & Business Managment 1992  – 1995 "]}