{"position": "User Experience Researcher", "company": "Google", "profiles": ["Summary I am a Staff User Experience Researcher in Google Search. My research focuses on large-scale remote studies, as well as qualitative research, to identify cutting edge opportunities in knowledge acquisition. I also manage the Global User Experience Infrastructure Team responsible for participant recruitment, ethical treatment & incentive guidelines, & lab infrastructure. Prior to 2005, I worked as a Sr. User Experience Researcher for eBay and Oracle.  \n \nI received my MS in Engineering Psychology and a BS degree in Applied Psychology from the Georgia Institute of Technology. I co-authored a book on usability methods titled, “Understanding Your Users: A practical guide to user requirements methods, tools, and techniques.” The 2nd edition of our book is due on shelves March 2015! \n \nI have presented papers and taught tutorials to the Human Factors and Usability community in the US and Europe since 1997. I also actively volunteer for events to increase the number of girls and women entering the engineering and science fields.  \n \nSpecialties: User experience research, user requirements gathering, competitive analysis, survey design & analysis, experience sampling methodology, contextual inquiry, web apps, people management, budget management Summary I am a Staff User Experience Researcher in Google Search. My research focuses on large-scale remote studies, as well as qualitative research, to identify cutting edge opportunities in knowledge acquisition. I also manage the Global User Experience Infrastructure Team responsible for participant recruitment, ethical treatment & incentive guidelines, & lab infrastructure. Prior to 2005, I worked as a Sr. User Experience Researcher for eBay and Oracle.  \n \nI received my MS in Engineering Psychology and a BS degree in Applied Psychology from the Georgia Institute of Technology. I co-authored a book on usability methods titled, “Understanding Your Users: A practical guide to user requirements methods, tools, and techniques.” The 2nd edition of our book is due on shelves March 2015! \n \nI have presented papers and taught tutorials to the Human Factors and Usability community in the US and Europe since 1997. I also actively volunteer for events to increase the number of girls and women entering the engineering and science fields.  \n \nSpecialties: User experience research, user requirements gathering, competitive analysis, survey design & analysis, experience sampling methodology, contextual inquiry, web apps, people management, budget management I am a Staff User Experience Researcher in Google Search. My research focuses on large-scale remote studies, as well as qualitative research, to identify cutting edge opportunities in knowledge acquisition. I also manage the Global User Experience Infrastructure Team responsible for participant recruitment, ethical treatment & incentive guidelines, & lab infrastructure. Prior to 2005, I worked as a Sr. User Experience Researcher for eBay and Oracle.  \n \nI received my MS in Engineering Psychology and a BS degree in Applied Psychology from the Georgia Institute of Technology. I co-authored a book on usability methods titled, “Understanding Your Users: A practical guide to user requirements methods, tools, and techniques.” The 2nd edition of our book is due on shelves March 2015! \n \nI have presented papers and taught tutorials to the Human Factors and Usability community in the US and Europe since 1997. I also actively volunteer for events to increase the number of girls and women entering the engineering and science fields.  \n \nSpecialties: User experience research, user requirements gathering, competitive analysis, survey design & analysis, experience sampling methodology, contextual inquiry, web apps, people management, budget management I am a Staff User Experience Researcher in Google Search. My research focuses on large-scale remote studies, as well as qualitative research, to identify cutting edge opportunities in knowledge acquisition. I also manage the Global User Experience Infrastructure Team responsible for participant recruitment, ethical treatment & incentive guidelines, & lab infrastructure. Prior to 2005, I worked as a Sr. User Experience Researcher for eBay and Oracle.  \n \nI received my MS in Engineering Psychology and a BS degree in Applied Psychology from the Georgia Institute of Technology. I co-authored a book on usability methods titled, “Understanding Your Users: A practical guide to user requirements methods, tools, and techniques.” The 2nd edition of our book is due on shelves March 2015! \n \nI have presented papers and taught tutorials to the Human Factors and Usability community in the US and Europe since 1997. I also actively volunteer for events to increase the number of girls and women entering the engineering and science fields.  \n \nSpecialties: User experience research, user requirements gathering, competitive analysis, survey design & analysis, experience sampling methodology, contextual inquiry, web apps, people management, budget management Experience Staff User Experience Researcher Google May 2013  – Present (2 years 3 months) My research focuses on large-scale remote studies to identify cutting edge opportunities in knowledge acquisition. I also conduct a range of qualitative research methods like usability studies, eye tracking, interviews, field studies, card sorting, and surveys. Google's Secret Study To Find Out Our Needs Edit Staff User Experience Researcher Google May 2013  – Present (2 years 3 months) My research focuses on large-scale remote studies to identify cutting edge opportunities in knowledge acquisition. I also conduct a range of qualitative research methods like usability studies, eye tracking, interviews, field studies, card sorting, and surveys. Google's Secret Study To Find Out Our Needs Edit Staff User Experience Researcher Google May 2013  – Present (2 years 3 months) My research focuses on large-scale remote studies to identify cutting edge opportunities in knowledge acquisition. I also conduct a range of qualitative research methods like usability studies, eye tracking, interviews, field studies, card sorting, and surveys. Google's Secret Study To Find Out Our Needs Edit Google's Secret Study To Find Out Our Needs Edit Google's Secret Study To Find Out Our Needs Edit Google's Secret Study To Find Out Our Needs  Google's Secret Study To Find Out Our Needs  Languages   Skills Skills     Honors & Awards ", "Summary Understanding the way people learn and work in order to design effective interfaces and better products. Summary Understanding the way people learn and work in order to design effective interfaces and better products. Understanding the way people learn and work in order to design effective interfaces and better products. Understanding the way people learn and work in order to design effective interfaces and better products. Experience Senior User Experience Researcher Google May 2015  – Present (3 months) User Experience Researcher Google August 2012  –  May 2015  (2 years 10 months) New York City, NY Interaction Designer Eaton Corporation February 2012  –  July 2012  (6 months) Pittsburgh, PA Redesigning Silverlight-based user front-end for electrical usage and monitoring software utilizing paper prototypes, wireframes, and interactive click-throughs to inform and evaluate design decisions. User Experience Researcher Open Learning Initiative at Carnegie Mellon University October 2010  –  June 2011  (9 months) Pittsburgh, PA Discovered usability issues for their online courses using contextual inquiries, think alouds, and heuristic evaluations. Proposed design solutions to enhance site usability. (Open) 1 recommendation Bill Jerome VP of Product and User Experience at Acrobatiq Nicole was excellent at taking the lead on organizing work and meetings. Excellent final product. I recommend her highly. View User Experience Intern eBay, Inc June 2010  –  August 2010  (3 months) Campbell, CA Researched and determined main sources of inneficiency of internal developers. Wireframed digital mockups of solutions and verified their effectiveness through A/B testing. Research Assistant & Programming Intern Stanford University: Communication between Humans and Interactive Media Lab (CHIMe) April 2009  –  June 2010  (1 year 3 months) Stanford, CA •\tWhat You See Is What You Get vs. You Use More than You See: Designed and programmed the different interfaces to study how the layout of an interface affects a user’s speed and accuracy in an information lookup task \n•\tCloud Computing and Agents in Mobile, Context-Aware Interactions: Analyzed how the presence of an agent and the source of information affects a user’s preferences. \n•\tConnectedness through Simultaneous Experiences: Designed experiment to explore how the timing of events plays a role in the feeling of connectedness between people independent of their activity (publication pending). Project Engineer Stanford University: Virtual Human Interaction Lab (VHIL) September 2008  –  June 2009  (10 months) Stanford, CA Designed and programmed virtual environments to understand the dynamics and implications of interactions among people in immersive virtual reality simulations. Senior User Experience Researcher Google May 2015  – Present (3 months) Senior User Experience Researcher Google May 2015  – Present (3 months) User Experience Researcher Google August 2012  –  May 2015  (2 years 10 months) New York City, NY User Experience Researcher Google August 2012  –  May 2015  (2 years 10 months) New York City, NY Interaction Designer Eaton Corporation February 2012  –  July 2012  (6 months) Pittsburgh, PA Redesigning Silverlight-based user front-end for electrical usage and monitoring software utilizing paper prototypes, wireframes, and interactive click-throughs to inform and evaluate design decisions. Interaction Designer Eaton Corporation February 2012  –  July 2012  (6 months) Pittsburgh, PA Redesigning Silverlight-based user front-end for electrical usage and monitoring software utilizing paper prototypes, wireframes, and interactive click-throughs to inform and evaluate design decisions. User Experience Researcher Open Learning Initiative at Carnegie Mellon University October 2010  –  June 2011  (9 months) Pittsburgh, PA Discovered usability issues for their online courses using contextual inquiries, think alouds, and heuristic evaluations. Proposed design solutions to enhance site usability. (Open) 1 recommendation Bill Jerome VP of Product and User Experience at Acrobatiq Nicole was excellent at taking the lead on organizing work and meetings. Excellent final product. I recommend her highly. View User Experience Researcher Open Learning Initiative at Carnegie Mellon University October 2010  –  June 2011  (9 months) Pittsburgh, PA Discovered usability issues for their online courses using contextual inquiries, think alouds, and heuristic evaluations. Proposed design solutions to enhance site usability. (Open) 1 recommendation Bill Jerome VP of Product and User Experience at Acrobatiq Nicole was excellent at taking the lead on organizing work and meetings. Excellent final product. I recommend her highly. View User Experience Intern eBay, Inc June 2010  –  August 2010  (3 months) Campbell, CA Researched and determined main sources of inneficiency of internal developers. Wireframed digital mockups of solutions and verified their effectiveness through A/B testing. User Experience Intern eBay, Inc June 2010  –  August 2010  (3 months) Campbell, CA Researched and determined main sources of inneficiency of internal developers. Wireframed digital mockups of solutions and verified their effectiveness through A/B testing. Research Assistant & Programming Intern Stanford University: Communication between Humans and Interactive Media Lab (CHIMe) April 2009  –  June 2010  (1 year 3 months) Stanford, CA •\tWhat You See Is What You Get vs. You Use More than You See: Designed and programmed the different interfaces to study how the layout of an interface affects a user’s speed and accuracy in an information lookup task \n•\tCloud Computing and Agents in Mobile, Context-Aware Interactions: Analyzed how the presence of an agent and the source of information affects a user’s preferences. \n•\tConnectedness through Simultaneous Experiences: Designed experiment to explore how the timing of events plays a role in the feeling of connectedness between people independent of their activity (publication pending). Research Assistant & Programming Intern Stanford University: Communication between Humans and Interactive Media Lab (CHIMe) April 2009  –  June 2010  (1 year 3 months) Stanford, CA •\tWhat You See Is What You Get vs. You Use More than You See: Designed and programmed the different interfaces to study how the layout of an interface affects a user’s speed and accuracy in an information lookup task \n•\tCloud Computing and Agents in Mobile, Context-Aware Interactions: Analyzed how the presence of an agent and the source of information affects a user’s preferences. \n•\tConnectedness through Simultaneous Experiences: Designed experiment to explore how the timing of events plays a role in the feeling of connectedness between people independent of their activity (publication pending). Project Engineer Stanford University: Virtual Human Interaction Lab (VHIL) September 2008  –  June 2009  (10 months) Stanford, CA Designed and programmed virtual environments to understand the dynamics and implications of interactions among people in immersive virtual reality simulations. Project Engineer Stanford University: Virtual Human Interaction Lab (VHIL) September 2008  –  June 2009  (10 months) Stanford, CA Designed and programmed virtual environments to understand the dynamics and implications of interactions among people in immersive virtual reality simulations. Languages   Skills Top Skills 8 Paper Prototyping 7 Contextual Inquiry 6 Heuristic Evaluation 5 Wireframes 5 User-centered Design 4 User Research 3 Usability Testing 3 Usability 2 Affinity Diagramming 2 Human Computer... Nicole also knows about... 1 Persona 1 Card Sorting 1 Participatory Design 1 Java 1 C++ 1 Objective-C 1 Illustrator 1 InDesign 1 OmniGraffle 1 Interaction Design 1 User Interface Design 0 Video Sketches 0 Stakeholder Mapping 0 Photoshop Skills  Top Skills 8 Paper Prototyping 7 Contextual Inquiry 6 Heuristic Evaluation 5 Wireframes 5 User-centered Design 4 User Research 3 Usability Testing 3 Usability 2 Affinity Diagramming 2 Human Computer... Nicole also knows about... 1 Persona 1 Card Sorting 1 Participatory Design 1 Java 1 C++ 1 Objective-C 1 Illustrator 1 InDesign 1 OmniGraffle 1 Interaction Design 1 User Interface Design 0 Video Sketches 0 Stakeholder Mapping 0 Photoshop Top Skills 8 Paper Prototyping 7 Contextual Inquiry 6 Heuristic Evaluation 5 Wireframes 5 User-centered Design 4 User Research 3 Usability Testing 3 Usability 2 Affinity Diagramming 2 Human Computer... Nicole also knows about... 1 Persona 1 Card Sorting 1 Participatory Design 1 Java 1 C++ 1 Objective-C 1 Illustrator 1 InDesign 1 OmniGraffle 1 Interaction Design 1 User Interface Design 0 Video Sketches 0 Stakeholder Mapping 0 Photoshop Top Skills 8 Paper Prototyping 7 Contextual Inquiry 6 Heuristic Evaluation 5 Wireframes 5 User-centered Design 4 User Research 3 Usability Testing 3 Usability 2 Affinity Diagramming 2 Human Computer... Nicole also knows about... 1 Persona 1 Card Sorting 1 Participatory Design 1 Java 1 C++ 1 Objective-C 1 Illustrator 1 InDesign 1 OmniGraffle 1 Interaction Design 1 User Interface Design 0 Video Sketches 0 Stakeholder Mapping 0 Photoshop                     1 Persona 1 Card Sorting 1 Participatory Design 1 Java 1 C++ 1 Objective-C 1 Illustrator 1 InDesign 1 OmniGraffle 1 Interaction Design 1 User Interface Design 0 Video Sketches 0 Stakeholder Mapping 0 Photoshop Education Carnegie Mellon University Masters,  Human-Computer Interaction , 3.9 2010  – 2011 (Open) 3 projects Capstone Project Course Project that covered the end-to-end process of a research and development product cycle to create an iPad app for SRI... View ReefBot Robot Controls and In-Museum Interface for Pittsburgh Aquarium View GPSweeper GPS-based Minesweeper Game for Android View Stanford University B.S.,  Symbolic Systems; Human-Computer Interaction , 3.4 2006  – 2010 Activities and Societies:  Stanford Concert Network (Open) 2 projects Mystery Mastery Children’s Mobile Web App Game to Enhance Literacy View StoryCorder A Multi-Touch Tabletop Interface to Develop Story-Telling Skills in 1st Graders View Universidad Complutense de Madrid 2009  – 2009 Study abroad in Madrid. Carnegie Mellon University Masters,  Human-Computer Interaction , 3.9 2010  – 2011 (Open) 3 projects Capstone Project Course Project that covered the end-to-end process of a research and development product cycle to create an iPad app for SRI... View ReefBot Robot Controls and In-Museum Interface for Pittsburgh Aquarium View GPSweeper GPS-based Minesweeper Game for Android View Carnegie Mellon University Masters,  Human-Computer Interaction , 3.9 2010  – 2011 (Open) 3 projects Capstone Project Course Project that covered the end-to-end process of a research and development product cycle to create an iPad app for SRI... View ReefBot Robot Controls and In-Museum Interface for Pittsburgh Aquarium View GPSweeper GPS-based Minesweeper Game for Android View Carnegie Mellon University Masters,  Human-Computer Interaction , 3.9 2010  – 2011 (Open) 3 projects Capstone Project Course Project that covered the end-to-end process of a research and development product cycle to create an iPad app for SRI... View ReefBot Robot Controls and In-Museum Interface for Pittsburgh Aquarium View GPSweeper GPS-based Minesweeper Game for Android View Stanford University B.S.,  Symbolic Systems; Human-Computer Interaction , 3.4 2006  – 2010 Activities and Societies:  Stanford Concert Network (Open) 2 projects Mystery Mastery Children’s Mobile Web App Game to Enhance Literacy View StoryCorder A Multi-Touch Tabletop Interface to Develop Story-Telling Skills in 1st Graders View Stanford University B.S.,  Symbolic Systems; Human-Computer Interaction , 3.4 2006  – 2010 Activities and Societies:  Stanford Concert Network (Open) 2 projects Mystery Mastery Children’s Mobile Web App Game to Enhance Literacy View StoryCorder A Multi-Touch Tabletop Interface to Develop Story-Telling Skills in 1st Graders View Stanford University B.S.,  Symbolic Systems; Human-Computer Interaction , 3.4 2006  – 2010 Activities and Societies:  Stanford Concert Network (Open) 2 projects Mystery Mastery Children’s Mobile Web App Game to Enhance Literacy View StoryCorder A Multi-Touch Tabletop Interface to Develop Story-Telling Skills in 1st Graders View Universidad Complutense de Madrid 2009  – 2009 Study abroad in Madrid. Universidad Complutense de Madrid 2009  – 2009 Study abroad in Madrid. Universidad Complutense de Madrid 2009  – 2009 Study abroad in Madrid. Honors & Awards ", "Summary I'm a user experience researcher and manager with over eight years of experience working on a variety of Google products including web search, search ads, YouTube, and voice technology (\"Ok Google!\"). \n \nMy background is in Computer Science and Human-Computer Interaction and I have experience with a wide variety of quantitative and qualitative methods.  Summary I'm a user experience researcher and manager with over eight years of experience working on a variety of Google products including web search, search ads, YouTube, and voice technology (\"Ok Google!\"). \n \nMy background is in Computer Science and Human-Computer Interaction and I have experience with a wide variety of quantitative and qualitative methods.  I'm a user experience researcher and manager with over eight years of experience working on a variety of Google products including web search, search ads, YouTube, and voice technology (\"Ok Google!\"). \n \nMy background is in Computer Science and Human-Computer Interaction and I have experience with a wide variety of quantitative and qualitative methods.  I'm a user experience researcher and manager with over eight years of experience working on a variety of Google products including web search, search ads, YouTube, and voice technology (\"Ok Google!\"). \n \nMy background is in Computer Science and Human-Computer Interaction and I have experience with a wide variety of quantitative and qualitative methods.  Experience Staff User Experience Researcher & UER Manager Google January 2015  – Present (7 months) Mountain View, CA Staff User Experience Researcher & UER Manager YouTube April 2011  –  December 2014  (3 years 9 months) San Bruno, CA - UER lead/manager for YouTube's viewer experience \n- Using qualitative and quantitative methods for understanding and improving the viewer experience on YouTube User Experience Researcher Google 2007  –  2011  (4 years) Mountain View, CA User experience researcher for search and ads (Open) 1 recommendation Anne Aula User experience research lead at Google I've worked with Melanie for almost 4 years now. One thing that impresses me the most about Melanie is the fact that she's a top-notch quantitative researcher, but she is *also* an excellent qualitative researcher. Two in one! It is very rare for a... View Staff User Experience Researcher & UER Manager Google January 2015  – Present (7 months) Mountain View, CA Staff User Experience Researcher & UER Manager Google January 2015  – Present (7 months) Mountain View, CA Staff User Experience Researcher & UER Manager YouTube April 2011  –  December 2014  (3 years 9 months) San Bruno, CA - UER lead/manager for YouTube's viewer experience \n- Using qualitative and quantitative methods for understanding and improving the viewer experience on YouTube Staff User Experience Researcher & UER Manager YouTube April 2011  –  December 2014  (3 years 9 months) San Bruno, CA - UER lead/manager for YouTube's viewer experience \n- Using qualitative and quantitative methods for understanding and improving the viewer experience on YouTube User Experience Researcher Google 2007  –  2011  (4 years) Mountain View, CA User experience researcher for search and ads (Open) 1 recommendation Anne Aula User experience research lead at Google I've worked with Melanie for almost 4 years now. One thing that impresses me the most about Melanie is the fact that she's a top-notch quantitative researcher, but she is *also* an excellent qualitative researcher. Two in one! It is very rare for a... View User Experience Researcher Google 2007  –  2011  (4 years) Mountain View, CA User experience researcher for search and ads (Open) 1 recommendation Anne Aula User experience research lead at Google I've worked with Melanie for almost 4 years now. One thing that impresses me the most about Melanie is the fact that she's a top-notch quantitative researcher, but she is *also* an excellent qualitative researcher. Two in one! It is very rare for a... View Skills Top Skills 15 Usability Testing 12 User Experience 9 User-centered Design 7 Eye Tracking 7 Heuristic Evaluation 5 Persona 5 Human Computer... 3 Usability Engineering 3 Qualitative Research 3 Usability Melanie also knows about... 3 Ethnography 2 Card Sorting 1 Python 1 Survey Design 1 Diary 1 Participatory Design 1 User Scenarios 1 Task Analysis 0 Logs Analysis 0 Field Work 0 Diary studies 0 Personas Skills  Top Skills 15 Usability Testing 12 User Experience 9 User-centered Design 7 Eye Tracking 7 Heuristic Evaluation 5 Persona 5 Human Computer... 3 Usability Engineering 3 Qualitative Research 3 Usability Melanie also knows about... 3 Ethnography 2 Card Sorting 1 Python 1 Survey Design 1 Diary 1 Participatory Design 1 User Scenarios 1 Task Analysis 0 Logs Analysis 0 Field Work 0 Diary studies 0 Personas Top Skills 15 Usability Testing 12 User Experience 9 User-centered Design 7 Eye Tracking 7 Heuristic Evaluation 5 Persona 5 Human Computer... 3 Usability Engineering 3 Qualitative Research 3 Usability Melanie also knows about... 3 Ethnography 2 Card Sorting 1 Python 1 Survey Design 1 Diary 1 Participatory Design 1 User Scenarios 1 Task Analysis 0 Logs Analysis 0 Field Work 0 Diary studies 0 Personas Top Skills 15 Usability Testing 12 User Experience 9 User-centered Design 7 Eye Tracking 7 Heuristic Evaluation 5 Persona 5 Human Computer... 3 Usability Engineering 3 Qualitative Research 3 Usability Melanie also knows about... 3 Ethnography 2 Card Sorting 1 Python 1 Survey Design 1 Diary 1 Participatory Design 1 User Scenarios 1 Task Analysis 0 Logs Analysis 0 Field Work 0 Diary studies 0 Personas                     3 Ethnography 2 Card Sorting 1 Python 1 Survey Design 1 Diary 1 Participatory Design 1 User Scenarios 1 Task Analysis 0 Logs Analysis 0 Field Work 0 Diary studies 0 Personas Education Dalhousie University PhD,  Computer Science 2002  – 2007 Dalhousie University Bachelor of Science,  Computer Science and Mathematics 1997  – 2001 Dalhousie University PhD,  Computer Science 2002  – 2007 Dalhousie University PhD,  Computer Science 2002  – 2007 Dalhousie University PhD,  Computer Science 2002  – 2007 Dalhousie University Bachelor of Science,  Computer Science and Mathematics 1997  – 2001 Dalhousie University Bachelor of Science,  Computer Science and Mathematics 1997  – 2001 Dalhousie University Bachelor of Science,  Computer Science and Mathematics 1997  – 2001 ", "Experience Senior User Experience Researcher Google April 2015  – Present (4 months) User Experience Researcher Google June 2012  –  March 2015  (2 years 10 months) User Experience Researcher meebo July 2011  –  June 2012  (1 year) San Francisco Bay Area Established and developed Meebo’s first user experience design research practice across three distinct product lines.\t \n \nDesigned and managed qualitative research studies to discover behavioral and emotional user insights, interpret findings to inform design, and communicate compelling, actionable results and recommendations to cross-functional project teams and stakeholders. Generated innovative product concepts and communicated design principles and decisions based on research insights. \n \nPioneered adoption of digital research tools and remote testing methods for generative and evaluative studies. (Open) 4 recommendations, including: Chris Ferejohn UX Lead at Crunch.io Beth would be an asset to any company looking to improve their products through research and user-centered design. She has... View Martin Green Founder, GP at HawksHead Capital Beth contributes huge value to a product team. She gets a team synched on user research goals, conducts user research so... View 2 more recommendations Online Marketing and UX Manager FirstGiving February 2010  –  May 2011  (1 year 4 months) Responsible for partnering with product, account management, and sales teams to identify and drive profitable revenue via user-centric marketing and product efforts. (Open) 5 recommendations, including: Chris Myles Director of Product Management at InsightSquared Beth is a smart, focused marketing and user experience professional who is driven by an innate curiosity about people and... View Jeff Boulay Senior Creative Technologist at Hill Holliday I have had the unique pleasure of working with Beth at FirstGiving, and was consistently impressed by her ability to blend... View 3 more recommendations Volunteer Assistant Editor SocialFinance.ca October 2010  –  December 2010  (3 months) Streamlined operations and management of editorial projects and volunteer program. Developed training materials for content contributors and manual for future volunteer editors. Supported web content strategy by sourcing and editing high-quality, relevant contributions and optimizing for SEO. (Open) 1 recommendation Peter Deitz Co-Founder of GrantBook; Interested in philanthropy and nonprofit technology Bethany Pickard has a keen sense of what's working and where there's still room to advance the field of online fundraising through strong editorial skills, effective use of social media, and user interface design. Her sincere commitment to... View Marketing Specialist FirstGiving 2008  –  February 2010  (2 years) General inbound marketing, marketing communications, SEO, content strategy, vendor management, marketing plan development and execution experience. Drove results with limited resources. Aquatics Program Manager, Instructor Wellbridge 2008  –  2010  (2 years) Proactively developed program curriculum and instructor training program based on successful teaching methods. Built trust and motivated students to work through fear and frustration. Taught over 100 students, ages 6 months and older, to be safe, confident and proficient swimmers. (Open) 1 recommendation Jurek Glod drummer at --Self employed I feel very fortunate to have Bethany on the aquatic team. She has been working at Wellbridge Athletic Club as an aquatic instructor under my supervision since January 2008.\nI have been quite impressed by Bethany’s ability to work with her... View Senior User Experience Researcher Google April 2015  – Present (4 months) Senior User Experience Researcher Google April 2015  – Present (4 months) User Experience Researcher Google June 2012  –  March 2015  (2 years 10 months) User Experience Researcher Google June 2012  –  March 2015  (2 years 10 months) User Experience Researcher meebo July 2011  –  June 2012  (1 year) San Francisco Bay Area Established and developed Meebo’s first user experience design research practice across three distinct product lines.\t \n \nDesigned and managed qualitative research studies to discover behavioral and emotional user insights, interpret findings to inform design, and communicate compelling, actionable results and recommendations to cross-functional project teams and stakeholders. Generated innovative product concepts and communicated design principles and decisions based on research insights. \n \nPioneered adoption of digital research tools and remote testing methods for generative and evaluative studies. (Open) 4 recommendations, including: Chris Ferejohn UX Lead at Crunch.io Beth would be an asset to any company looking to improve their products through research and user-centered design. She has... View Martin Green Founder, GP at HawksHead Capital Beth contributes huge value to a product team. She gets a team synched on user research goals, conducts user research so... View 2 more recommendations User Experience Researcher meebo July 2011  –  June 2012  (1 year) San Francisco Bay Area Established and developed Meebo’s first user experience design research practice across three distinct product lines.\t \n \nDesigned and managed qualitative research studies to discover behavioral and emotional user insights, interpret findings to inform design, and communicate compelling, actionable results and recommendations to cross-functional project teams and stakeholders. Generated innovative product concepts and communicated design principles and decisions based on research insights. \n \nPioneered adoption of digital research tools and remote testing methods for generative and evaluative studies. (Open) 4 recommendations, including: Chris Ferejohn UX Lead at Crunch.io Beth would be an asset to any company looking to improve their products through research and user-centered design. She has... View Martin Green Founder, GP at HawksHead Capital Beth contributes huge value to a product team. She gets a team synched on user research goals, conducts user research so... View 2 more recommendations Online Marketing and UX Manager FirstGiving February 2010  –  May 2011  (1 year 4 months) Responsible for partnering with product, account management, and sales teams to identify and drive profitable revenue via user-centric marketing and product efforts. (Open) 5 recommendations, including: Chris Myles Director of Product Management at InsightSquared Beth is a smart, focused marketing and user experience professional who is driven by an innate curiosity about people and... View Jeff Boulay Senior Creative Technologist at Hill Holliday I have had the unique pleasure of working with Beth at FirstGiving, and was consistently impressed by her ability to blend... View 3 more recommendations Online Marketing and UX Manager FirstGiving February 2010  –  May 2011  (1 year 4 months) Responsible for partnering with product, account management, and sales teams to identify and drive profitable revenue via user-centric marketing and product efforts. (Open) 5 recommendations, including: Chris Myles Director of Product Management at InsightSquared Beth is a smart, focused marketing and user experience professional who is driven by an innate curiosity about people and... View Jeff Boulay Senior Creative Technologist at Hill Holliday I have had the unique pleasure of working with Beth at FirstGiving, and was consistently impressed by her ability to blend... View 3 more recommendations Volunteer Assistant Editor SocialFinance.ca October 2010  –  December 2010  (3 months) Streamlined operations and management of editorial projects and volunteer program. Developed training materials for content contributors and manual for future volunteer editors. Supported web content strategy by sourcing and editing high-quality, relevant contributions and optimizing for SEO. (Open) 1 recommendation Peter Deitz Co-Founder of GrantBook; Interested in philanthropy and nonprofit technology Bethany Pickard has a keen sense of what's working and where there's still room to advance the field of online fundraising through strong editorial skills, effective use of social media, and user interface design. Her sincere commitment to... View Volunteer Assistant Editor SocialFinance.ca October 2010  –  December 2010  (3 months) Streamlined operations and management of editorial projects and volunteer program. Developed training materials for content contributors and manual for future volunteer editors. Supported web content strategy by sourcing and editing high-quality, relevant contributions and optimizing for SEO. (Open) 1 recommendation Peter Deitz Co-Founder of GrantBook; Interested in philanthropy and nonprofit technology Bethany Pickard has a keen sense of what's working and where there's still room to advance the field of online fundraising through strong editorial skills, effective use of social media, and user interface design. Her sincere commitment to... View Marketing Specialist FirstGiving 2008  –  February 2010  (2 years) General inbound marketing, marketing communications, SEO, content strategy, vendor management, marketing plan development and execution experience. Drove results with limited resources. Marketing Specialist FirstGiving 2008  –  February 2010  (2 years) General inbound marketing, marketing communications, SEO, content strategy, vendor management, marketing plan development and execution experience. Drove results with limited resources. Aquatics Program Manager, Instructor Wellbridge 2008  –  2010  (2 years) Proactively developed program curriculum and instructor training program based on successful teaching methods. Built trust and motivated students to work through fear and frustration. Taught over 100 students, ages 6 months and older, to be safe, confident and proficient swimmers. (Open) 1 recommendation Jurek Glod drummer at --Self employed I feel very fortunate to have Bethany on the aquatic team. She has been working at Wellbridge Athletic Club as an aquatic instructor under my supervision since January 2008.\nI have been quite impressed by Bethany’s ability to work with her... View Aquatics Program Manager, Instructor Wellbridge 2008  –  2010  (2 years) Proactively developed program curriculum and instructor training program based on successful teaching methods. Built trust and motivated students to work through fear and frustration. Taught over 100 students, ages 6 months and older, to be safe, confident and proficient swimmers. (Open) 1 recommendation Jurek Glod drummer at --Self employed I feel very fortunate to have Bethany on the aquatic team. She has been working at Wellbridge Athletic Club as an aquatic instructor under my supervision since January 2008.\nI have been quite impressed by Bethany’s ability to work with her... View Languages French French French Skills Top Skills 45 User Experience 39 User Research 23 Research 19 User-centered Design 14 Ethnography 10 User Interface Design 9 Design Thinking 6 Content Strategy 5 Interviews 5 Persona Bethany also knows about... 5 Information Architecture 5 Mobile Applications 4 User Scenarios 3 Strategy 2 Agile Methodologies 1 User research evangelism 1 Design research 1 Participatory Design 1 Paper Prototyping 1 Remote Access 0 Remote research 0 Collaborative &... 0 User profiles 0 Personas 0 RITE 0 Survey Design 0 Lean UX 0 Digital products 0 Building rapport 0 Design sprints 0 Design Strategy See 6+     See less Skills  Top Skills 45 User Experience 39 User Research 23 Research 19 User-centered Design 14 Ethnography 10 User Interface Design 9 Design Thinking 6 Content Strategy 5 Interviews 5 Persona Bethany also knows about... 5 Information Architecture 5 Mobile Applications 4 User Scenarios 3 Strategy 2 Agile Methodologies 1 User research evangelism 1 Design research 1 Participatory Design 1 Paper Prototyping 1 Remote Access 0 Remote research 0 Collaborative &... 0 User profiles 0 Personas 0 RITE 0 Survey Design 0 Lean UX 0 Digital products 0 Building rapport 0 Design sprints 0 Design Strategy See 6+     See less Top Skills 45 User Experience 39 User Research 23 Research 19 User-centered Design 14 Ethnography 10 User Interface Design 9 Design Thinking 6 Content Strategy 5 Interviews 5 Persona Bethany also knows about... 5 Information Architecture 5 Mobile Applications 4 User Scenarios 3 Strategy 2 Agile Methodologies 1 User research evangelism 1 Design research 1 Participatory Design 1 Paper Prototyping 1 Remote Access 0 Remote research 0 Collaborative &... 0 User profiles 0 Personas 0 RITE 0 Survey Design 0 Lean UX 0 Digital products 0 Building rapport 0 Design sprints 0 Design Strategy See 6+     See less Top Skills 45 User Experience 39 User Research 23 Research 19 User-centered Design 14 Ethnography 10 User Interface Design 9 Design Thinking 6 Content Strategy 5 Interviews 5 Persona Bethany also knows about... 5 Information Architecture 5 Mobile Applications 4 User Scenarios 3 Strategy 2 Agile Methodologies 1 User research evangelism 1 Design research 1 Participatory Design 1 Paper Prototyping 1 Remote Access 0 Remote research 0 Collaborative &... 0 User profiles 0 Personas 0 RITE 0 Survey Design 0 Lean UX 0 Digital products 0 Building rapport 0 Design sprints 0 Design Strategy See 6+     See less                     5 Information Architecture 5 Mobile Applications 4 User Scenarios 3 Strategy 2 Agile Methodologies 1 User research evangelism 1 Design research 1 Participatory Design 1 Paper Prototyping 1 Remote Access 0 Remote research 0 Collaborative &... 0 User profiles 0 Personas 0 RITE 0 Survey Design 0 Lean UX 0 Digital products 0 Building rapport 0 Design sprints 0 Design Strategy Education Boston University BA,  Economics ,  African Studies 2003  – 2007 Activities and Societies:  Honors Program ,  Phi Beta Kappa ,  Inner Strength Gospel Choir Bentley University Activities and Societies:  UX Bootcamp Cooper U Activities and Societies:  Design Leadership ,  Interaction Design Rhode Island School of Design Activities and Societies:  Thinking Visually Boston University BA,  Economics ,  African Studies 2003  – 2007 Activities and Societies:  Honors Program ,  Phi Beta Kappa ,  Inner Strength Gospel Choir Boston University BA,  Economics ,  African Studies 2003  – 2007 Activities and Societies:  Honors Program ,  Phi Beta Kappa ,  Inner Strength Gospel Choir Boston University BA,  Economics ,  African Studies 2003  – 2007 Activities and Societies:  Honors Program ,  Phi Beta Kappa ,  Inner Strength Gospel Choir Bentley University Activities and Societies:  UX Bootcamp Bentley University Activities and Societies:  UX Bootcamp Bentley University Activities and Societies:  UX Bootcamp Cooper U Activities and Societies:  Design Leadership ,  Interaction Design Cooper U Activities and Societies:  Design Leadership ,  Interaction Design Cooper U Activities and Societies:  Design Leadership ,  Interaction Design Rhode Island School of Design Activities and Societies:  Thinking Visually Rhode Island School of Design Activities and Societies:  Thinking Visually Rhode Island School of Design Activities and Societies:  Thinking Visually ", "Summary User experience researcher with a strong technical background and a passion for working with users. Experienced in a wide range of methodologies, both qualitative and quantitative. Continually strive to develop ways to communicate research results to have the greatest impact.  \n \nSpecialties:  \n- lab and remote usability studies and interviews \n- diary studies \n- field studies \n- large-scale surveys and survey analysis \n- establishing quantitative UX metrics to measure \n- developing design principles \n- partnering with design, PM, and eng Summary User experience researcher with a strong technical background and a passion for working with users. Experienced in a wide range of methodologies, both qualitative and quantitative. Continually strive to develop ways to communicate research results to have the greatest impact.  \n \nSpecialties:  \n- lab and remote usability studies and interviews \n- diary studies \n- field studies \n- large-scale surveys and survey analysis \n- establishing quantitative UX metrics to measure \n- developing design principles \n- partnering with design, PM, and eng User experience researcher with a strong technical background and a passion for working with users. Experienced in a wide range of methodologies, both qualitative and quantitative. Continually strive to develop ways to communicate research results to have the greatest impact.  \n \nSpecialties:  \n- lab and remote usability studies and interviews \n- diary studies \n- field studies \n- large-scale surveys and survey analysis \n- establishing quantitative UX metrics to measure \n- developing design principles \n- partnering with design, PM, and eng User experience researcher with a strong technical background and a passion for working with users. Experienced in a wide range of methodologies, both qualitative and quantitative. Continually strive to develop ways to communicate research results to have the greatest impact.  \n \nSpecialties:  \n- lab and remote usability studies and interviews \n- diary studies \n- field studies \n- large-scale surveys and survey analysis \n- establishing quantitative UX metrics to measure \n- developing design principles \n- partnering with design, PM, and eng Experience Sr. User Experience Researcher Google March 2013  – Present (2 years 5 months) User Experience Researcher Google August 2010  –  March 2013  (2 years 8 months) • Conduct research to support product teams Research Intern University of Michigan School of Information August 2009  –  May 2010  (10 months) • Conducted an exploratory study of how users use online communities to manage and track their health \n• Designed and managed development of Steps, a social wellness Facebook application User Experience Research Intern TechSmith Corporation 2008  –  2009  (1 year) Summers 2008 and 2009 \n• Conducted UX research for several product teams; methods included lab usability testing, remote testing, interviews, diary studies, and surveys \n• Worked with UX team to improve processes, methods, and uptake of research User Experience Intern University of Michigan Library January 2008  –  May 2008  (5 months) • Conducted early stage research to aid the redesign of library website; methods included server logs analysis, semantic differential survey, and competitive analysis UX Intern Wells Fargo June 2007  –  August 2007  (3 months) • Worked in the User-Centered Design group on a number of usability projects such as a style guide, user personas, and researching and purchasing usability lab equipment Usability Analyst Clearsighted January 2006  –  December 2006  (1 year) • Usability testing of cognitive tutor math software application Intern IBM May 2006  –  August 2006  (4 months) • Designed and conducted internal usability tests for a new component of the System i database Intern General Mills May 2005  –  August 2005  (4 months) • Created a web application to produce internal status reports more easily.  \n• Participated in many taste tests in the food lab. Mmm!! NSF REU Research Intern National Institute of Standards and Technology (NIST) May 2003  –  August 2003  (4 months) • Research feasibility of using speech recognition to create automatic transcripts of audio recorded during usability tests Sr. User Experience Researcher Google March 2013  – Present (2 years 5 months) Sr. User Experience Researcher Google March 2013  – Present (2 years 5 months) User Experience Researcher Google August 2010  –  March 2013  (2 years 8 months) • Conduct research to support product teams User Experience Researcher Google August 2010  –  March 2013  (2 years 8 months) • Conduct research to support product teams Research Intern University of Michigan School of Information August 2009  –  May 2010  (10 months) • Conducted an exploratory study of how users use online communities to manage and track their health \n• Designed and managed development of Steps, a social wellness Facebook application Research Intern University of Michigan School of Information August 2009  –  May 2010  (10 months) • Conducted an exploratory study of how users use online communities to manage and track their health \n• Designed and managed development of Steps, a social wellness Facebook application User Experience Research Intern TechSmith Corporation 2008  –  2009  (1 year) Summers 2008 and 2009 \n• Conducted UX research for several product teams; methods included lab usability testing, remote testing, interviews, diary studies, and surveys \n• Worked with UX team to improve processes, methods, and uptake of research User Experience Research Intern TechSmith Corporation 2008  –  2009  (1 year) Summers 2008 and 2009 \n• Conducted UX research for several product teams; methods included lab usability testing, remote testing, interviews, diary studies, and surveys \n• Worked with UX team to improve processes, methods, and uptake of research User Experience Intern University of Michigan Library January 2008  –  May 2008  (5 months) • Conducted early stage research to aid the redesign of library website; methods included server logs analysis, semantic differential survey, and competitive analysis User Experience Intern University of Michigan Library January 2008  –  May 2008  (5 months) • Conducted early stage research to aid the redesign of library website; methods included server logs analysis, semantic differential survey, and competitive analysis UX Intern Wells Fargo June 2007  –  August 2007  (3 months) • Worked in the User-Centered Design group on a number of usability projects such as a style guide, user personas, and researching and purchasing usability lab equipment UX Intern Wells Fargo June 2007  –  August 2007  (3 months) • Worked in the User-Centered Design group on a number of usability projects such as a style guide, user personas, and researching and purchasing usability lab equipment Usability Analyst Clearsighted January 2006  –  December 2006  (1 year) • Usability testing of cognitive tutor math software application Usability Analyst Clearsighted January 2006  –  December 2006  (1 year) • Usability testing of cognitive tutor math software application Intern IBM May 2006  –  August 2006  (4 months) • Designed and conducted internal usability tests for a new component of the System i database Intern IBM May 2006  –  August 2006  (4 months) • Designed and conducted internal usability tests for a new component of the System i database Intern General Mills May 2005  –  August 2005  (4 months) • Created a web application to produce internal status reports more easily.  \n• Participated in many taste tests in the food lab. Mmm!! Intern General Mills May 2005  –  August 2005  (4 months) • Created a web application to produce internal status reports more easily.  \n• Participated in many taste tests in the food lab. Mmm!! NSF REU Research Intern National Institute of Standards and Technology (NIST) May 2003  –  August 2003  (4 months) • Research feasibility of using speech recognition to create automatic transcripts of audio recorded during usability tests NSF REU Research Intern National Institute of Standards and Technology (NIST) May 2003  –  August 2003  (4 months) • Research feasibility of using speech recognition to create automatic transcripts of audio recorded during usability tests Skills Top Skills 22 Usability Testing 12 User-centered Design 10 User Experience 7 Ethnography 7 Contextual Inquiry 5 Statistics 4 Analysis 4 Usability 3 Interaction Design 3 Persona Debra also knows about... 2 Interviews 2 Participatory Design 2 Human Computer... 2 Qualitative Research Skills  Top Skills 22 Usability Testing 12 User-centered Design 10 User Experience 7 Ethnography 7 Contextual Inquiry 5 Statistics 4 Analysis 4 Usability 3 Interaction Design 3 Persona Debra also knows about... 2 Interviews 2 Participatory Design 2 Human Computer... 2 Qualitative Research Top Skills 22 Usability Testing 12 User-centered Design 10 User Experience 7 Ethnography 7 Contextual Inquiry 5 Statistics 4 Analysis 4 Usability 3 Interaction Design 3 Persona Debra also knows about... 2 Interviews 2 Participatory Design 2 Human Computer... 2 Qualitative Research Top Skills 22 Usability Testing 12 User-centered Design 10 User Experience 7 Ethnography 7 Contextual Inquiry 5 Statistics 4 Analysis 4 Usability 3 Interaction Design 3 Persona Debra also knows about... 2 Interviews 2 Participatory Design 2 Human Computer... 2 Qualitative Research                     2 Interviews 2 Participatory Design 2 Human Computer... 2 Qualitative Research Education University of Michigan - School of Information MSI,  Human Computer Interaction ,  Social Computing 2008  – 2009 Social Computing \nOnline Communities \nInteraction Design \nEvaluation of Systems \nContextual Inquiry \nInformation Visualization \nNetwork Analysis \nData Analysis \nRecommender Systems \nGraphic Design \nInfo-Seeking Behavior Activities and Societies:  SOCHI Executive Board Member ,  member of Social Computing Club Swansea University Computer Science ,  Psychology ,  Media Studies 2007  – 2007 Study abroad, Spring 2007 Iowa State University BS,  Computer Science ,  Psychology 2003  – 2007 Activities and Societies:  Government of the Student Body ,  Women in Science and Engineering ,  Honors Program ,  Phi Kappa Phi ,  Upsilon Pi Epsilon University of Michigan - School of Information MSI,  Human Computer Interaction ,  Social Computing 2008  – 2009 Social Computing \nOnline Communities \nInteraction Design \nEvaluation of Systems \nContextual Inquiry \nInformation Visualization \nNetwork Analysis \nData Analysis \nRecommender Systems \nGraphic Design \nInfo-Seeking Behavior Activities and Societies:  SOCHI Executive Board Member ,  member of Social Computing Club University of Michigan - School of Information MSI,  Human Computer Interaction ,  Social Computing 2008  – 2009 Social Computing \nOnline Communities \nInteraction Design \nEvaluation of Systems \nContextual Inquiry \nInformation Visualization \nNetwork Analysis \nData Analysis \nRecommender Systems \nGraphic Design \nInfo-Seeking Behavior Activities and Societies:  SOCHI Executive Board Member ,  member of Social Computing Club University of Michigan - School of Information MSI,  Human Computer Interaction ,  Social Computing 2008  – 2009 Social Computing \nOnline Communities \nInteraction Design \nEvaluation of Systems \nContextual Inquiry \nInformation Visualization \nNetwork Analysis \nData Analysis \nRecommender Systems \nGraphic Design \nInfo-Seeking Behavior Activities and Societies:  SOCHI Executive Board Member ,  member of Social Computing Club Swansea University Computer Science ,  Psychology ,  Media Studies 2007  – 2007 Study abroad, Spring 2007 Swansea University Computer Science ,  Psychology ,  Media Studies 2007  – 2007 Study abroad, Spring 2007 Swansea University Computer Science ,  Psychology ,  Media Studies 2007  – 2007 Study abroad, Spring 2007 Iowa State University BS,  Computer Science ,  Psychology 2003  – 2007 Activities and Societies:  Government of the Student Body ,  Women in Science and Engineering ,  Honors Program ,  Phi Kappa Phi ,  Upsilon Pi Epsilon Iowa State University BS,  Computer Science ,  Psychology 2003  – 2007 Activities and Societies:  Government of the Student Body ,  Women in Science and Engineering ,  Honors Program ,  Phi Kappa Phi ,  Upsilon Pi Epsilon Iowa State University BS,  Computer Science ,  Psychology 2003  – 2007 Activities and Societies:  Government of the Student Body ,  Women in Science and Engineering ,  Honors Program ,  Phi Kappa Phi ,  Upsilon Pi Epsilon Honors & Awards Additional Honors & Awards Co-author on three published papers \nFirst place, CHI 2009 Student Design Competition \nGoogle Anita Borg Scholarship Recipient, 2007 \nGovernment of the Student Body Member of the Year Award \nNational Merit Scholar Additional Honors & Awards Co-author on three published papers \nFirst place, CHI 2009 Student Design Competition \nGoogle Anita Borg Scholarship Recipient, 2007 \nGovernment of the Student Body Member of the Year Award \nNational Merit Scholar Additional Honors & Awards Co-author on three published papers \nFirst place, CHI 2009 Student Design Competition \nGoogle Anita Borg Scholarship Recipient, 2007 \nGovernment of the Student Body Member of the Year Award \nNational Merit Scholar Additional Honors & Awards Co-author on three published papers \nFirst place, CHI 2009 Student Design Competition \nGoogle Anita Borg Scholarship Recipient, 2007 \nGovernment of the Student Body Member of the Year Award \nNational Merit Scholar ", "Summary User Experience Research consultant, focused on improving utility and usability of interfaces through user research, with a preference for iterative usability testing.  \n \nThroughout my career I've specialized in helping develop applications (from mobile to web-based) that bring complex analog processes to life online. Examples include digitizing physical wallets, managing health insurance claims and benefits online, and improving the mobile shopping experience.  \n \nWhen I'm not busy advocating for users, I write about surfing for various publications. Summary User Experience Research consultant, focused on improving utility and usability of interfaces through user research, with a preference for iterative usability testing.  \n \nThroughout my career I've specialized in helping develop applications (from mobile to web-based) that bring complex analog processes to life online. Examples include digitizing physical wallets, managing health insurance claims and benefits online, and improving the mobile shopping experience.  \n \nWhen I'm not busy advocating for users, I write about surfing for various publications. User Experience Research consultant, focused on improving utility and usability of interfaces through user research, with a preference for iterative usability testing.  \n \nThroughout my career I've specialized in helping develop applications (from mobile to web-based) that bring complex analog processes to life online. Examples include digitizing physical wallets, managing health insurance claims and benefits online, and improving the mobile shopping experience.  \n \nWhen I'm not busy advocating for users, I write about surfing for various publications. User Experience Research consultant, focused on improving utility and usability of interfaces through user research, with a preference for iterative usability testing.  \n \nThroughout my career I've specialized in helping develop applications (from mobile to web-based) that bring complex analog processes to life online. Examples include digitizing physical wallets, managing health insurance claims and benefits online, and improving the mobile shopping experience.  \n \nWhen I'm not busy advocating for users, I write about surfing for various publications. Experience User Experience Researcher (Contract Position) Google January 2015  – Present (7 months) Working within Google's Brand Studio, acted as user research lead for the Google Store, collaborating in a cross functional environment to facilitate a successful, user-focused launch. Recommended appropriate methodologies and executed on multiple rounds of pre-launch qualitative research studies with external participants. Currently informing development for additional projects by performing in-depth formative research, focused on identifying underlying needs and opportunities to differentiate with innovative design solutions. User Experience Research Consultant UsableX (Sole Proprietorship) October 2005  – Present (9 years 10 months) Clients include Twitter, Google, GoPro, Macy's/Bloomingdale's, Nixon, Blue Shield of CA, Intuit, WebEx, NEC Solutions, Sun Microsystems, and AnswerLab. \n \nIn partnership with AnswerLab, I've provided usability testing services for Honda, Acura, Yahoo!, eBay, Harley-Davidson, Kraft Foods, Cricket Wireless, and FedEx. Senior Writer Surfer Magazine January 2010  – Present (5 years 7 months) Regular contributor of feature articles for the oldest, most venerable surf magazine on earth. User Researcher (Contract Position) Twitter March 2014  –  September 2014  (7 months) San Francisco While at Twitter, I worked on consumer product, assisting during the design stage for new product features. After consulting with Engineers, Designers and Product Managers, I proposed appropriate methodologies for supporting research projects and collaborated with stakeholders on final research plans. I then implemented these research projects on an end-to-end basis (planning, recruiting, moderation of sessions, editing of highlight video clips, documentation of findings, and presentation of results). Most often, studies involved in-person or remote user sessions, focused on the usability and utility of prototypes. \n \nIn addition, I conducted in-depth formative research on the sharing of photos and video via social media. User Experience Researcher (Contract Position) Google July 2012  –  October 2013  (1 year 4 months) San Francisco Bay Area Responsible for regular RITE (Rapid Iterative Testing and Evaluation) Sessions in support of Google Wallet app development. Performed formative research, informing product decisions and UX sprints. Acted as user advocate in collaborative design environment, joined by fellow UXers, engineers, and product managers. (Open) 3 recommendations, including: Audrey Yang Generally Useful If you're thinking about hiring Lewis, you should!\nSpecifically, I was impressed by the following over his time at Google:... View Jens Riegelsberger Senior UX Manager at Google From day one Lewis has been a very strong User Researcher on our team. He impressed me in particular by his ability to link... View 1 more recommendation Usability Lead Blue Shield of CA March 2004  –  August 2005  (1 year 6 months) Created a formal usability practice within the User Experience Group. Performed iterative usability testing and formative user research in support of overhaul of Blue Shield's web portals for members, health care providers, and insurance brokers. Senior Usability Specialist Xpedior February 2000  –  December 2001  (1 year 11 months) Responsible for ensuring the usability of web applications developed by Xpedior, a former leading Internet consultancy. User Experience Researcher (Contract Position) Google January 2015  – Present (7 months) Working within Google's Brand Studio, acted as user research lead for the Google Store, collaborating in a cross functional environment to facilitate a successful, user-focused launch. Recommended appropriate methodologies and executed on multiple rounds of pre-launch qualitative research studies with external participants. Currently informing development for additional projects by performing in-depth formative research, focused on identifying underlying needs and opportunities to differentiate with innovative design solutions. User Experience Researcher (Contract Position) Google January 2015  – Present (7 months) Working within Google's Brand Studio, acted as user research lead for the Google Store, collaborating in a cross functional environment to facilitate a successful, user-focused launch. Recommended appropriate methodologies and executed on multiple rounds of pre-launch qualitative research studies with external participants. Currently informing development for additional projects by performing in-depth formative research, focused on identifying underlying needs and opportunities to differentiate with innovative design solutions. User Experience Research Consultant UsableX (Sole Proprietorship) October 2005  – Present (9 years 10 months) Clients include Twitter, Google, GoPro, Macy's/Bloomingdale's, Nixon, Blue Shield of CA, Intuit, WebEx, NEC Solutions, Sun Microsystems, and AnswerLab. \n \nIn partnership with AnswerLab, I've provided usability testing services for Honda, Acura, Yahoo!, eBay, Harley-Davidson, Kraft Foods, Cricket Wireless, and FedEx. User Experience Research Consultant UsableX (Sole Proprietorship) October 2005  – Present (9 years 10 months) Clients include Twitter, Google, GoPro, Macy's/Bloomingdale's, Nixon, Blue Shield of CA, Intuit, WebEx, NEC Solutions, Sun Microsystems, and AnswerLab. \n \nIn partnership with AnswerLab, I've provided usability testing services for Honda, Acura, Yahoo!, eBay, Harley-Davidson, Kraft Foods, Cricket Wireless, and FedEx. Senior Writer Surfer Magazine January 2010  – Present (5 years 7 months) Regular contributor of feature articles for the oldest, most venerable surf magazine on earth. Senior Writer Surfer Magazine January 2010  – Present (5 years 7 months) Regular contributor of feature articles for the oldest, most venerable surf magazine on earth. User Researcher (Contract Position) Twitter March 2014  –  September 2014  (7 months) San Francisco While at Twitter, I worked on consumer product, assisting during the design stage for new product features. After consulting with Engineers, Designers and Product Managers, I proposed appropriate methodologies for supporting research projects and collaborated with stakeholders on final research plans. I then implemented these research projects on an end-to-end basis (planning, recruiting, moderation of sessions, editing of highlight video clips, documentation of findings, and presentation of results). Most often, studies involved in-person or remote user sessions, focused on the usability and utility of prototypes. \n \nIn addition, I conducted in-depth formative research on the sharing of photos and video via social media. User Researcher (Contract Position) Twitter March 2014  –  September 2014  (7 months) San Francisco While at Twitter, I worked on consumer product, assisting during the design stage for new product features. After consulting with Engineers, Designers and Product Managers, I proposed appropriate methodologies for supporting research projects and collaborated with stakeholders on final research plans. I then implemented these research projects on an end-to-end basis (planning, recruiting, moderation of sessions, editing of highlight video clips, documentation of findings, and presentation of results). Most often, studies involved in-person or remote user sessions, focused on the usability and utility of prototypes. \n \nIn addition, I conducted in-depth formative research on the sharing of photos and video via social media. User Experience Researcher (Contract Position) Google July 2012  –  October 2013  (1 year 4 months) San Francisco Bay Area Responsible for regular RITE (Rapid Iterative Testing and Evaluation) Sessions in support of Google Wallet app development. Performed formative research, informing product decisions and UX sprints. Acted as user advocate in collaborative design environment, joined by fellow UXers, engineers, and product managers. (Open) 3 recommendations, including: Audrey Yang Generally Useful If you're thinking about hiring Lewis, you should!\nSpecifically, I was impressed by the following over his time at Google:... View Jens Riegelsberger Senior UX Manager at Google From day one Lewis has been a very strong User Researcher on our team. He impressed me in particular by his ability to link... View 1 more recommendation User Experience Researcher (Contract Position) Google July 2012  –  October 2013  (1 year 4 months) San Francisco Bay Area Responsible for regular RITE (Rapid Iterative Testing and Evaluation) Sessions in support of Google Wallet app development. Performed formative research, informing product decisions and UX sprints. Acted as user advocate in collaborative design environment, joined by fellow UXers, engineers, and product managers. (Open) 3 recommendations, including: Audrey Yang Generally Useful If you're thinking about hiring Lewis, you should!\nSpecifically, I was impressed by the following over his time at Google:... View Jens Riegelsberger Senior UX Manager at Google From day one Lewis has been a very strong User Researcher on our team. He impressed me in particular by his ability to link... View 1 more recommendation Usability Lead Blue Shield of CA March 2004  –  August 2005  (1 year 6 months) Created a formal usability practice within the User Experience Group. Performed iterative usability testing and formative user research in support of overhaul of Blue Shield's web portals for members, health care providers, and insurance brokers. Usability Lead Blue Shield of CA March 2004  –  August 2005  (1 year 6 months) Created a formal usability practice within the User Experience Group. Performed iterative usability testing and formative user research in support of overhaul of Blue Shield's web portals for members, health care providers, and insurance brokers. Senior Usability Specialist Xpedior February 2000  –  December 2001  (1 year 11 months) Responsible for ensuring the usability of web applications developed by Xpedior, a former leading Internet consultancy. Senior Usability Specialist Xpedior February 2000  –  December 2001  (1 year 11 months) Responsible for ensuring the usability of web applications developed by Xpedior, a former leading Internet consultancy. Skills Top Skills 33 Usability Testing 31 User Research 26 User Experience 15 Usability 13 Heuristic Evaluation 11 Mobile Devices 6 User Interface 5 User-centered Design 5 User Interface Design 4 Task Analysis Lewis also knows about... 4 Experience Design 3 Interaction Design 3 User Experience Design 2 Persona Creation 2 Contextual Inquiry 2 Persona 1 Content Strategy 1 Ethnography 1 Mobile Applications 1 Editorial 0 Card Sorting 0 User Scenarios 0 Paper Prototyping 0 Usability Engineering Skills  Top Skills 33 Usability Testing 31 User Research 26 User Experience 15 Usability 13 Heuristic Evaluation 11 Mobile Devices 6 User Interface 5 User-centered Design 5 User Interface Design 4 Task Analysis Lewis also knows about... 4 Experience Design 3 Interaction Design 3 User Experience Design 2 Persona Creation 2 Contextual Inquiry 2 Persona 1 Content Strategy 1 Ethnography 1 Mobile Applications 1 Editorial 0 Card Sorting 0 User Scenarios 0 Paper Prototyping 0 Usability Engineering Top Skills 33 Usability Testing 31 User Research 26 User Experience 15 Usability 13 Heuristic Evaluation 11 Mobile Devices 6 User Interface 5 User-centered Design 5 User Interface Design 4 Task Analysis Lewis also knows about... 4 Experience Design 3 Interaction Design 3 User Experience Design 2 Persona Creation 2 Contextual Inquiry 2 Persona 1 Content Strategy 1 Ethnography 1 Mobile Applications 1 Editorial 0 Card Sorting 0 User Scenarios 0 Paper Prototyping 0 Usability Engineering Top Skills 33 Usability Testing 31 User Research 26 User Experience 15 Usability 13 Heuristic Evaluation 11 Mobile Devices 6 User Interface 5 User-centered Design 5 User Interface Design 4 Task Analysis Lewis also knows about... 4 Experience Design 3 Interaction Design 3 User Experience Design 2 Persona Creation 2 Contextual Inquiry 2 Persona 1 Content Strategy 1 Ethnography 1 Mobile Applications 1 Editorial 0 Card Sorting 0 User Scenarios 0 Paper Prototyping 0 Usability Engineering                     4 Experience Design 3 Interaction Design 3 User Experience Design 2 Persona Creation 2 Contextual Inquiry 2 Persona 1 Content Strategy 1 Ethnography 1 Mobile Applications 1 Editorial 0 Card Sorting 0 User Scenarios 0 Paper Prototyping 0 Usability Engineering Education University of California, San Diego BS,  Cognitive Science 1995  – 1999 Activities and Societies:  •\tSpecialization in Cognitive Engineering\n•\tMember ,  Human Computer Interaction Lab\n•\tMember ,  UCSD Surf Team\n•\tMagna Cum Laude ,  Golden Key National Honor Society ,  New Caledonian Society San Francisco University High School 1991  – 1995 University of California, San Diego BS,  Cognitive Science 1995  – 1999 Activities and Societies:  •\tSpecialization in Cognitive Engineering\n•\tMember ,  Human Computer Interaction Lab\n•\tMember ,  UCSD Surf Team\n•\tMagna Cum Laude ,  Golden Key National Honor Society ,  New Caledonian Society University of California, San Diego BS,  Cognitive Science 1995  – 1999 Activities and Societies:  •\tSpecialization in Cognitive Engineering\n•\tMember ,  Human Computer Interaction Lab\n•\tMember ,  UCSD Surf Team\n•\tMagna Cum Laude ,  Golden Key National Honor Society ,  New Caledonian Society University of California, San Diego BS,  Cognitive Science 1995  – 1999 Activities and Societies:  •\tSpecialization in Cognitive Engineering\n•\tMember ,  Human Computer Interaction Lab\n•\tMember ,  UCSD Surf Team\n•\tMagna Cum Laude ,  Golden Key National Honor Society ,  New Caledonian Society San Francisco University High School 1991  – 1995 San Francisco University High School 1991  – 1995 San Francisco University High School 1991  – 1995 ", "Summary User Experience Researcher with expertise in qualitative approaches to studying how people interact with technology.  \n \nSpecialties: Qualitative analysis of observational data, in-home interviews, field observation, interview guide design, transcribing. Execution of laboratory experiment, coordination, recruiting, and analysis. Summary User Experience Researcher with expertise in qualitative approaches to studying how people interact with technology.  \n \nSpecialties: Qualitative analysis of observational data, in-home interviews, field observation, interview guide design, transcribing. Execution of laboratory experiment, coordination, recruiting, and analysis. User Experience Researcher with expertise in qualitative approaches to studying how people interact with technology.  \n \nSpecialties: Qualitative analysis of observational data, in-home interviews, field observation, interview guide design, transcribing. Execution of laboratory experiment, coordination, recruiting, and analysis. User Experience Researcher with expertise in qualitative approaches to studying how people interact with technology.  \n \nSpecialties: Qualitative analysis of observational data, in-home interviews, field observation, interview guide design, transcribing. Execution of laboratory experiment, coordination, recruiting, and analysis. Experience User Experience Researcher Android, Google November 2014  – Present (9 months) Mountain View, Ca User Experience Research Assistant Google [x] January 2014  –  October 2014  (10 months) Mountain View Ca Conducting qualitative need finding studies involving in-home interviews, think-aloud field observations, open-ended cluster analysis, concept validation interviews and ethnographic fieldwork to gauge market demand and end user pain points. \n \nSharing research findings and recommendations with engineering and operations stakeholders \n \nDesigning and running in-field experiments that inform the design of system operator user interfaces  \n \nRecruiting very narrowly targeted populations of participants on tight timelines User Experience Researcher Suitable Technologies August 2013  –  January 2014  (6 months) Palo Alto, CA Conducted Qualitative Need Finding studies that involved workplace interviews, concept validation interviews and ethnographic fieldwork to understand the needs of remote co-workers, distributed families and employers. \n \nDesigned and ran lab experiments that explored how people use telepresence technologies at work and their homes to inform the design of telepresence forms, functions, behaviors and user interfaces. User Experience Researcher Willow Garage May 2010  –  August 2013  (3 years 4 months) Menlo Park, CA Conducted Qualitative Need Finding studies that involved workplace contextual inquiries, in-home interviews, concept validation interviews and ethnographic fieldwork to gauge the needs and end-user pain points in service industries. \n \nSynthesized research findings to inform product development amongst hardware and software engineers, industrial designers and company leadership. \n \nDesigned and ran lab experiments that explored how humans interact with robotic and autonomous technologies  \n \nInformed the design of personal robots and telepresence forms, functions, and behaviors  \n \nCoordinated field study, recruited participants, scheduled visits to sites, facilitated meetings, collected and stored data, and analyzed footage and survey data in a multi-site field trial of telepresence robots. User Experience Researcher Android, Google November 2014  – Present (9 months) Mountain View, Ca User Experience Researcher Android, Google November 2014  – Present (9 months) Mountain View, Ca User Experience Research Assistant Google [x] January 2014  –  October 2014  (10 months) Mountain View Ca Conducting qualitative need finding studies involving in-home interviews, think-aloud field observations, open-ended cluster analysis, concept validation interviews and ethnographic fieldwork to gauge market demand and end user pain points. \n \nSharing research findings and recommendations with engineering and operations stakeholders \n \nDesigning and running in-field experiments that inform the design of system operator user interfaces  \n \nRecruiting very narrowly targeted populations of participants on tight timelines User Experience Research Assistant Google [x] January 2014  –  October 2014  (10 months) Mountain View Ca Conducting qualitative need finding studies involving in-home interviews, think-aloud field observations, open-ended cluster analysis, concept validation interviews and ethnographic fieldwork to gauge market demand and end user pain points. \n \nSharing research findings and recommendations with engineering and operations stakeholders \n \nDesigning and running in-field experiments that inform the design of system operator user interfaces  \n \nRecruiting very narrowly targeted populations of participants on tight timelines User Experience Researcher Suitable Technologies August 2013  –  January 2014  (6 months) Palo Alto, CA Conducted Qualitative Need Finding studies that involved workplace interviews, concept validation interviews and ethnographic fieldwork to understand the needs of remote co-workers, distributed families and employers. \n \nDesigned and ran lab experiments that explored how people use telepresence technologies at work and their homes to inform the design of telepresence forms, functions, behaviors and user interfaces. User Experience Researcher Suitable Technologies August 2013  –  January 2014  (6 months) Palo Alto, CA Conducted Qualitative Need Finding studies that involved workplace interviews, concept validation interviews and ethnographic fieldwork to understand the needs of remote co-workers, distributed families and employers. \n \nDesigned and ran lab experiments that explored how people use telepresence technologies at work and their homes to inform the design of telepresence forms, functions, behaviors and user interfaces. User Experience Researcher Willow Garage May 2010  –  August 2013  (3 years 4 months) Menlo Park, CA Conducted Qualitative Need Finding studies that involved workplace contextual inquiries, in-home interviews, concept validation interviews and ethnographic fieldwork to gauge the needs and end-user pain points in service industries. \n \nSynthesized research findings to inform product development amongst hardware and software engineers, industrial designers and company leadership. \n \nDesigned and ran lab experiments that explored how humans interact with robotic and autonomous technologies  \n \nInformed the design of personal robots and telepresence forms, functions, and behaviors  \n \nCoordinated field study, recruited participants, scheduled visits to sites, facilitated meetings, collected and stored data, and analyzed footage and survey data in a multi-site field trial of telepresence robots. User Experience Researcher Willow Garage May 2010  –  August 2013  (3 years 4 months) Menlo Park, CA Conducted Qualitative Need Finding studies that involved workplace contextual inquiries, in-home interviews, concept validation interviews and ethnographic fieldwork to gauge the needs and end-user pain points in service industries. \n \nSynthesized research findings to inform product development amongst hardware and software engineers, industrial designers and company leadership. \n \nDesigned and ran lab experiments that explored how humans interact with robotic and autonomous technologies  \n \nInformed the design of personal robots and telepresence forms, functions, and behaviors  \n \nCoordinated field study, recruited participants, scheduled visits to sites, facilitated meetings, collected and stored data, and analyzed footage and survey data in a multi-site field trial of telepresence robots. Languages English Native or bilingual proficiency Spanish Native or bilingual proficiency English Native or bilingual proficiency Spanish Native or bilingual proficiency English Native or bilingual proficiency Spanish Native or bilingual proficiency Native or bilingual proficiency Native or bilingual proficiency Skills Top Skills 20 User Research 17 Human Computer... 14 Research 11 Spanish 9 User Experience 7 Interviews 7 Data Analysis 7 Ethnography 6 Field Research 6 Usability Testing Bianca also knows about... 6 Qualitative Research 5 Research Design 5 Robotics 4 Quantitative Research 3 Project Planning 3 User-centered Design 2 In-Home Interviews 2 Need Finding 2 User Interface 1 Needfinding 1 Interviewing Skills 1 Rapid Prototyping 1 User Interface Design 0 Design Thinking Skills  Top Skills 20 User Research 17 Human Computer... 14 Research 11 Spanish 9 User Experience 7 Interviews 7 Data Analysis 7 Ethnography 6 Field Research 6 Usability Testing Bianca also knows about... 6 Qualitative Research 5 Research Design 5 Robotics 4 Quantitative Research 3 Project Planning 3 User-centered Design 2 In-Home Interviews 2 Need Finding 2 User Interface 1 Needfinding 1 Interviewing Skills 1 Rapid Prototyping 1 User Interface Design 0 Design Thinking Top Skills 20 User Research 17 Human Computer... 14 Research 11 Spanish 9 User Experience 7 Interviews 7 Data Analysis 7 Ethnography 6 Field Research 6 Usability Testing Bianca also knows about... 6 Qualitative Research 5 Research Design 5 Robotics 4 Quantitative Research 3 Project Planning 3 User-centered Design 2 In-Home Interviews 2 Need Finding 2 User Interface 1 Needfinding 1 Interviewing Skills 1 Rapid Prototyping 1 User Interface Design 0 Design Thinking Top Skills 20 User Research 17 Human Computer... 14 Research 11 Spanish 9 User Experience 7 Interviews 7 Data Analysis 7 Ethnography 6 Field Research 6 Usability Testing Bianca also knows about... 6 Qualitative Research 5 Research Design 5 Robotics 4 Quantitative Research 3 Project Planning 3 User-centered Design 2 In-Home Interviews 2 Need Finding 2 User Interface 1 Needfinding 1 Interviewing Skills 1 Rapid Prototyping 1 User Interface Design 0 Design Thinking                     6 Qualitative Research 5 Research Design 5 Robotics 4 Quantitative Research 3 Project Planning 3 User-centered Design 2 In-Home Interviews 2 Need Finding 2 User Interface 1 Needfinding 1 Interviewing Skills 1 Rapid Prototyping 1 User Interface Design 0 Design Thinking Education University of California, Berkeley Bachelor's degree,  Spanish Linguistics and Political Science 2005  – 2009 Activities and Societies:  GMS Scholar University of California, Berkeley Bachelor's degree,  Spanish Linguistics and Political Science 2005  – 2009 Activities and Societies:  GMS Scholar University of California, Berkeley Bachelor's degree,  Spanish Linguistics and Political Science 2005  – 2009 Activities and Societies:  GMS Scholar University of California, Berkeley Bachelor's degree,  Spanish Linguistics and Political Science 2005  – 2009 Activities and Societies:  GMS Scholar Honors & Awards Additional Honors & Awards Gates Millennium Scholar Additional Honors & Awards Gates Millennium Scholar Additional Honors & Awards Gates Millennium Scholar Additional Honors & Awards Gates Millennium Scholar ", "Summary Google Glass Edit Loon for All - Project Loon - Google Edit Summary Google Glass Edit Loon for All - Project Loon - Google Edit   Google Glass Edit Loon for All - Project Loon - Google Edit Google Glass Edit Loon for All - Project Loon - Google Edit Google Glass Edit Google Glass  Google Glass  Loon for All - Project Loon - Google Edit Loon for All - Project Loon - Google  Loon for All - Project Loon - Google  Experience User Experience Researcher Google March 2014  – Present (1 year 5 months) Mountain View, CA User Experience Researcher Google March 2014  – Present (1 year 5 months) Mountain View, CA User Experience Researcher Google March 2014  – Present (1 year 5 months) Mountain View, CA Languages   Skills Skills     Honors & Awards ", "Experience Senior User Experience Researcher Google January 2013  – Present (2 years 7 months) Zurich, Switzerland User Experience Researcher Google October 2010  –  December 2012  (2 years 3 months) Mountain View User Experience Researcher Google August 2007  –  September 2010  (3 years 2 months) Mountain View User Experience Research Coordinator Google, Inc December 2005  –  July 2007  (1 year 8 months) Sales Operations Salesforce.com August 2003  –  December 2004  (1 year 5 months) Senior User Experience Researcher Google January 2013  – Present (2 years 7 months) Zurich, Switzerland Senior User Experience Researcher Google January 2013  – Present (2 years 7 months) Zurich, Switzerland User Experience Researcher Google October 2010  –  December 2012  (2 years 3 months) Mountain View User Experience Researcher Google October 2010  –  December 2012  (2 years 3 months) Mountain View User Experience Researcher Google August 2007  –  September 2010  (3 years 2 months) Mountain View User Experience Researcher Google August 2007  –  September 2010  (3 years 2 months) Mountain View User Experience Research Coordinator Google, Inc December 2005  –  July 2007  (1 year 8 months) User Experience Research Coordinator Google, Inc December 2005  –  July 2007  (1 year 8 months) Sales Operations Salesforce.com August 2003  –  December 2004  (1 year 5 months) Sales Operations Salesforce.com August 2003  –  December 2004  (1 year 5 months) Languages Spanish Spanish Spanish Skills Top Skills 27 User Experience 11 Human Computer... 10 User Research 9 Usability Testing 6 Contextual Inquiry 4 User-centered Design 4 Usability 3 Paper Prototyping 2 Participatory Design 2 Google Adwords Patrick also knows about... 1 Interaction Design 1 Persona 1 User Scenarios 0 Heuristic Evaluation Skills  Top Skills 27 User Experience 11 Human Computer... 10 User Research 9 Usability Testing 6 Contextual Inquiry 4 User-centered Design 4 Usability 3 Paper Prototyping 2 Participatory Design 2 Google Adwords Patrick also knows about... 1 Interaction Design 1 Persona 1 User Scenarios 0 Heuristic Evaluation Top Skills 27 User Experience 11 Human Computer... 10 User Research 9 Usability Testing 6 Contextual Inquiry 4 User-centered Design 4 Usability 3 Paper Prototyping 2 Participatory Design 2 Google Adwords Patrick also knows about... 1 Interaction Design 1 Persona 1 User Scenarios 0 Heuristic Evaluation Top Skills 27 User Experience 11 Human Computer... 10 User Research 9 Usability Testing 6 Contextual Inquiry 4 User-centered Design 4 Usability 3 Paper Prototyping 2 Participatory Design 2 Google Adwords Patrick also knows about... 1 Interaction Design 1 Persona 1 User Scenarios 0 Heuristic Evaluation                     1 Interaction Design 1 Persona 1 User Scenarios 0 Heuristic Evaluation ", "Summary Key Skills  \n• Solving specific business, product and/or design problems through focus on the user experience  \n• Creating and managing large-scale international multiple-methodology Research programs  \n• Planning and executing UX tracks on projects, ranging from 5 days to 12 weeks to 9+ months \n• Deep insights into Privacy-related User topics, especially online \n• Managing and leading diverse project or business teams \n• Collaborating efficiently in multi-disciplinary project groups to create successful business solutions  \n• Creating explanatory frameworks for solutioning, pitches and business education \n \nPersonal Strengths  \n• Working with others to ensure that both team and project work most effectively  \n• Generating ideas that move projects forward  \n• Combining overview with detail and precision \n \nSpecialties: User Research, Design Research, Qualitative Research, User-Centred Design, Ethnography, Usability, Interviewing, Workshops, Facilitation, Understanding of Online Privacy for users Summary Key Skills  \n• Solving specific business, product and/or design problems through focus on the user experience  \n• Creating and managing large-scale international multiple-methodology Research programs  \n• Planning and executing UX tracks on projects, ranging from 5 days to 12 weeks to 9+ months \n• Deep insights into Privacy-related User topics, especially online \n• Managing and leading diverse project or business teams \n• Collaborating efficiently in multi-disciplinary project groups to create successful business solutions  \n• Creating explanatory frameworks for solutioning, pitches and business education \n \nPersonal Strengths  \n• Working with others to ensure that both team and project work most effectively  \n• Generating ideas that move projects forward  \n• Combining overview with detail and precision \n \nSpecialties: User Research, Design Research, Qualitative Research, User-Centred Design, Ethnography, Usability, Interviewing, Workshops, Facilitation, Understanding of Online Privacy for users Key Skills  \n• Solving specific business, product and/or design problems through focus on the user experience  \n• Creating and managing large-scale international multiple-methodology Research programs  \n• Planning and executing UX tracks on projects, ranging from 5 days to 12 weeks to 9+ months \n• Deep insights into Privacy-related User topics, especially online \n• Managing and leading diverse project or business teams \n• Collaborating efficiently in multi-disciplinary project groups to create successful business solutions  \n• Creating explanatory frameworks for solutioning, pitches and business education \n \nPersonal Strengths  \n• Working with others to ensure that both team and project work most effectively  \n• Generating ideas that move projects forward  \n• Combining overview with detail and precision \n \nSpecialties: User Research, Design Research, Qualitative Research, User-Centred Design, Ethnography, Usability, Interviewing, Workshops, Facilitation, Understanding of Online Privacy for users Key Skills  \n• Solving specific business, product and/or design problems through focus on the user experience  \n• Creating and managing large-scale international multiple-methodology Research programs  \n• Planning and executing UX tracks on projects, ranging from 5 days to 12 weeks to 9+ months \n• Deep insights into Privacy-related User topics, especially online \n• Managing and leading diverse project or business teams \n• Collaborating efficiently in multi-disciplinary project groups to create successful business solutions  \n• Creating explanatory frameworks for solutioning, pitches and business education \n \nPersonal Strengths  \n• Working with others to ensure that both team and project work most effectively  \n• Generating ideas that move projects forward  \n• Combining overview with detail and precision \n \nSpecialties: User Research, Design Research, Qualitative Research, User-Centred Design, Ethnography, Usability, Interviewing, Workshops, Facilitation, Understanding of Online Privacy for users Experience Staff User Experience Researcher Google March 2013  – Present (2 years 5 months) Senior User Experience Researcher Google February 2008  –  March 2013  (5 years 2 months) Associate Director, Innovation and Ethnography GfK March 2007  –  February 2008  (1 year) cross-functional research lead for ethnographic research projects and NPD projects on international projects (Open) 2 recommendations Sebastien Fabre UX Manager , Manager of User Experience - FUJITSU It's been a pleasure working with Martin.\nMartin is very knowledgeable about usability and also an excellent practitioner.... View Mike Cooke Global Director: Panel Management Martin is a wonderfully creative researcher. He is very action orientated and his work is thoughtful and insightful . i... View Head of Design Research, Yahoo! Europe Yahoo Europe September 2004  –  February 2007  (2 years 6 months) As Head of Design Research in the Product Development team for Europe I was responsible that the quality of products released corresponds to the needs and requirements of users across 5 different markets. Ensuring competitiveness in our geographies, we localised US-developed products and attended to European-specific projects as well as collaborating on global initiatives and international requirements gathering. In two years, Design Research delivered 22 projects while also providing consultancy, project planning and advice on over 30 others. 10-15 projects are in the pipeline for the coming 6 months. Our outputs, based on a User-centric Design approach, support business decisions and strategic direction. Senior Associate User Experience Sapient November 2000  –  July 2004  (3 years 9 months) As a User Experience Senior Associate I worked in qualitative, ethnographic and quantitative research capacities and close interaction with Designers, Information Architects and Business analysts to create solutions affecting the branding, structure, behaviour and usability of high-profile websites, applications or services.  \nAreas of expertise included Conceptual strategy, Design/Redesign, Mobility, Assessment, Visual Strategy, Methodology (Open) 1 recommendation Ash Gupta User Researcher at HM Revenue & Customs I've worked on three projects with Martin and always been impressed by his ability to see the big picture. Martin can look at the raw data from user interviews and home in on the key lessons which he's then able to articulate succinctly. I've... View Staff User Experience Researcher Google March 2013  – Present (2 years 5 months) Staff User Experience Researcher Google March 2013  – Present (2 years 5 months) Senior User Experience Researcher Google February 2008  –  March 2013  (5 years 2 months) Senior User Experience Researcher Google February 2008  –  March 2013  (5 years 2 months) Associate Director, Innovation and Ethnography GfK March 2007  –  February 2008  (1 year) cross-functional research lead for ethnographic research projects and NPD projects on international projects (Open) 2 recommendations Sebastien Fabre UX Manager , Manager of User Experience - FUJITSU It's been a pleasure working with Martin.\nMartin is very knowledgeable about usability and also an excellent practitioner.... View Mike Cooke Global Director: Panel Management Martin is a wonderfully creative researcher. He is very action orientated and his work is thoughtful and insightful . i... View Associate Director, Innovation and Ethnography GfK March 2007  –  February 2008  (1 year) cross-functional research lead for ethnographic research projects and NPD projects on international projects (Open) 2 recommendations Sebastien Fabre UX Manager , Manager of User Experience - FUJITSU It's been a pleasure working with Martin.\nMartin is very knowledgeable about usability and also an excellent practitioner.... View Mike Cooke Global Director: Panel Management Martin is a wonderfully creative researcher. He is very action orientated and his work is thoughtful and insightful . i... View Head of Design Research, Yahoo! Europe Yahoo Europe September 2004  –  February 2007  (2 years 6 months) As Head of Design Research in the Product Development team for Europe I was responsible that the quality of products released corresponds to the needs and requirements of users across 5 different markets. Ensuring competitiveness in our geographies, we localised US-developed products and attended to European-specific projects as well as collaborating on global initiatives and international requirements gathering. In two years, Design Research delivered 22 projects while also providing consultancy, project planning and advice on over 30 others. 10-15 projects are in the pipeline for the coming 6 months. Our outputs, based on a User-centric Design approach, support business decisions and strategic direction. Head of Design Research, Yahoo! Europe Yahoo Europe September 2004  –  February 2007  (2 years 6 months) As Head of Design Research in the Product Development team for Europe I was responsible that the quality of products released corresponds to the needs and requirements of users across 5 different markets. Ensuring competitiveness in our geographies, we localised US-developed products and attended to European-specific projects as well as collaborating on global initiatives and international requirements gathering. In two years, Design Research delivered 22 projects while also providing consultancy, project planning and advice on over 30 others. 10-15 projects are in the pipeline for the coming 6 months. Our outputs, based on a User-centric Design approach, support business decisions and strategic direction. Senior Associate User Experience Sapient November 2000  –  July 2004  (3 years 9 months) As a User Experience Senior Associate I worked in qualitative, ethnographic and quantitative research capacities and close interaction with Designers, Information Architects and Business analysts to create solutions affecting the branding, structure, behaviour and usability of high-profile websites, applications or services.  \nAreas of expertise included Conceptual strategy, Design/Redesign, Mobility, Assessment, Visual Strategy, Methodology (Open) 1 recommendation Ash Gupta User Researcher at HM Revenue & Customs I've worked on three projects with Martin and always been impressed by his ability to see the big picture. Martin can look at the raw data from user interviews and home in on the key lessons which he's then able to articulate succinctly. I've... View Senior Associate User Experience Sapient November 2000  –  July 2004  (3 years 9 months) As a User Experience Senior Associate I worked in qualitative, ethnographic and quantitative research capacities and close interaction with Designers, Information Architects and Business analysts to create solutions affecting the branding, structure, behaviour and usability of high-profile websites, applications or services.  \nAreas of expertise included Conceptual strategy, Design/Redesign, Mobility, Assessment, Visual Strategy, Methodology (Open) 1 recommendation Ash Gupta User Researcher at HM Revenue & Customs I've worked on three projects with Martin and always been impressed by his ability to see the big picture. Martin can look at the raw data from user interviews and home in on the key lessons which he's then able to articulate succinctly. I've... View Skills Top Skills 54 User Experience 49 User-centered Design 40 User Research 34 Ethnography 22 Usability 19 Information Architecture 12 Usability Testing 10 Contextual Inquiry 10 Human Computer... 7 Task Analysis Martin also knows about... 6 Qualitative Research 6 Persona 6 Interaction Design 6 Heuristic Evaluation 6 Experience Design 6 Wire Framing 5 User Experience Design 4 Card Sorting 3 Strategy 3 User Scenarios 3 Design Thinking 2 Usability Engineering 2 User Interface 2 Paper Prototyping 1 Survey Design 1 Quantitative Research 1 Service Design 1 Design Strategy 1 Information Design 1 Wireframes 1 User experience See 6+     See less Skills  Top Skills 54 User Experience 49 User-centered Design 40 User Research 34 Ethnography 22 Usability 19 Information Architecture 12 Usability Testing 10 Contextual Inquiry 10 Human Computer... 7 Task Analysis Martin also knows about... 6 Qualitative Research 6 Persona 6 Interaction Design 6 Heuristic Evaluation 6 Experience Design 6 Wire Framing 5 User Experience Design 4 Card Sorting 3 Strategy 3 User Scenarios 3 Design Thinking 2 Usability Engineering 2 User Interface 2 Paper Prototyping 1 Survey Design 1 Quantitative Research 1 Service Design 1 Design Strategy 1 Information Design 1 Wireframes 1 User experience See 6+     See less Top Skills 54 User Experience 49 User-centered Design 40 User Research 34 Ethnography 22 Usability 19 Information Architecture 12 Usability Testing 10 Contextual Inquiry 10 Human Computer... 7 Task Analysis Martin also knows about... 6 Qualitative Research 6 Persona 6 Interaction Design 6 Heuristic Evaluation 6 Experience Design 6 Wire Framing 5 User Experience Design 4 Card Sorting 3 Strategy 3 User Scenarios 3 Design Thinking 2 Usability Engineering 2 User Interface 2 Paper Prototyping 1 Survey Design 1 Quantitative Research 1 Service Design 1 Design Strategy 1 Information Design 1 Wireframes 1 User experience See 6+     See less Top Skills 54 User Experience 49 User-centered Design 40 User Research 34 Ethnography 22 Usability 19 Information Architecture 12 Usability Testing 10 Contextual Inquiry 10 Human Computer... 7 Task Analysis Martin also knows about... 6 Qualitative Research 6 Persona 6 Interaction Design 6 Heuristic Evaluation 6 Experience Design 6 Wire Framing 5 User Experience Design 4 Card Sorting 3 Strategy 3 User Scenarios 3 Design Thinking 2 Usability Engineering 2 User Interface 2 Paper Prototyping 1 Survey Design 1 Quantitative Research 1 Service Design 1 Design Strategy 1 Information Design 1 Wireframes 1 User experience See 6+     See less                     6 Qualitative Research 6 Persona 6 Interaction Design 6 Heuristic Evaluation 6 Experience Design 6 Wire Framing 5 User Experience Design 4 Card Sorting 3 Strategy 3 User Scenarios 3 Design Thinking 2 Usability Engineering 2 User Interface 2 Paper Prototyping 1 Survey Design 1 Quantitative Research 1 Service Design 1 Design Strategy 1 Information Design 1 Wireframes 1 User experience Education Manchester Business School PhD,  Social Anthropology 1995  – 2000 PhD thesis \"Identity, Work and Integration among Northern Finnish Farmers\" \nSummary:  \nThe thesis explores the tension in the lives of people of remote farming communities in northern Finland, between their experience of inhabiting the land and their citizenship of a modern European nation-state. I show how farmers in Northern Finland imagine their identities, and how they enact them in their work and lives. My research highlights the hopes and resentments as well as the practical strategies of farmers in responding to these processes of integration into European markets on the one hand, and the revaluation of their knowledge and engagement with the world on the other. To conclude, I show how the interplay between the practical enactment of personal identity and its discursive construction, at both local and state levels, underwrites the imagination of Finnish national identity both vis-à-vis neighbouring countries and within the European Union. Activities and Societies:  student representative to the graduate school ,  sports (basketball ,  badminton) The London School of Economics and Political Science (LSE) BA,  Social Anthropology 1992  – 1995 Graduated with a 1st class degree Activities and Societies:  rock climbing ,  basketball ,  badminton ,  cycling ,  debating society ,  International Society at ULU ,  German club ,  UJS ,  choir ,  chamber choir at ULU Manchester Business School PhD,  Social Anthropology 1995  – 2000 PhD thesis \"Identity, Work and Integration among Northern Finnish Farmers\" \nSummary:  \nThe thesis explores the tension in the lives of people of remote farming communities in northern Finland, between their experience of inhabiting the land and their citizenship of a modern European nation-state. I show how farmers in Northern Finland imagine their identities, and how they enact them in their work and lives. My research highlights the hopes and resentments as well as the practical strategies of farmers in responding to these processes of integration into European markets on the one hand, and the revaluation of their knowledge and engagement with the world on the other. To conclude, I show how the interplay between the practical enactment of personal identity and its discursive construction, at both local and state levels, underwrites the imagination of Finnish national identity both vis-à-vis neighbouring countries and within the European Union. Activities and Societies:  student representative to the graduate school ,  sports (basketball ,  badminton) Manchester Business School PhD,  Social Anthropology 1995  – 2000 PhD thesis \"Identity, Work and Integration among Northern Finnish Farmers\" \nSummary:  \nThe thesis explores the tension in the lives of people of remote farming communities in northern Finland, between their experience of inhabiting the land and their citizenship of a modern European nation-state. I show how farmers in Northern Finland imagine their identities, and how they enact them in their work and lives. My research highlights the hopes and resentments as well as the practical strategies of farmers in responding to these processes of integration into European markets on the one hand, and the revaluation of their knowledge and engagement with the world on the other. To conclude, I show how the interplay between the practical enactment of personal identity and its discursive construction, at both local and state levels, underwrites the imagination of Finnish national identity both vis-à-vis neighbouring countries and within the European Union. Activities and Societies:  student representative to the graduate school ,  sports (basketball ,  badminton) Manchester Business School PhD,  Social Anthropology 1995  – 2000 PhD thesis \"Identity, Work and Integration among Northern Finnish Farmers\" \nSummary:  \nThe thesis explores the tension in the lives of people of remote farming communities in northern Finland, between their experience of inhabiting the land and their citizenship of a modern European nation-state. I show how farmers in Northern Finland imagine their identities, and how they enact them in their work and lives. My research highlights the hopes and resentments as well as the practical strategies of farmers in responding to these processes of integration into European markets on the one hand, and the revaluation of their knowledge and engagement with the world on the other. To conclude, I show how the interplay between the practical enactment of personal identity and its discursive construction, at both local and state levels, underwrites the imagination of Finnish national identity both vis-à-vis neighbouring countries and within the European Union. Activities and Societies:  student representative to the graduate school ,  sports (basketball ,  badminton) The London School of Economics and Political Science (LSE) BA,  Social Anthropology 1992  – 1995 Graduated with a 1st class degree Activities and Societies:  rock climbing ,  basketball ,  badminton ,  cycling ,  debating society ,  International Society at ULU ,  German club ,  UJS ,  choir ,  chamber choir at ULU The London School of Economics and Political Science (LSE) BA,  Social Anthropology 1992  – 1995 Graduated with a 1st class degree Activities and Societies:  rock climbing ,  basketball ,  badminton ,  cycling ,  debating society ,  International Society at ULU ,  German club ,  UJS ,  choir ,  chamber choir at ULU The London School of Economics and Political Science (LSE) BA,  Social Anthropology 1992  – 1995 Graduated with a 1st class degree Activities and Societies:  rock climbing ,  basketball ,  badminton ,  cycling ,  debating society ,  International Society at ULU ,  German club ,  UJS ,  choir ,  chamber choir at ULU ", "Summary Usability and design researcher with 15+ experience. I get beautiful and user-friendly products into your hands.  \n \nI currently am working on Google Play for Education. This is an exciting effort to help impact K-12 learning all over the world with the appropriate use of technology. Previously I've led teams and product design projects with Android, Google Adwords, Google Commerce, and Forrester Research.  \n \nAs a Reuters Foundation Digital Vision Fellow at Stanford, I focused on technology projects for the developing world. My projects included usability testing an open-source microfinance application for Grameen. \n \nAt Forrester Research, I created the in-house usability program and designed and launched many new products, including the Forrester Wave.  \n \nSpecialties: Usability testing, field research, persona creation, project management, user panel management, cognitive walkthroughs, surveys, participatory design and facilitation, and remote testing. Summary Usability and design researcher with 15+ experience. I get beautiful and user-friendly products into your hands.  \n \nI currently am working on Google Play for Education. This is an exciting effort to help impact K-12 learning all over the world with the appropriate use of technology. Previously I've led teams and product design projects with Android, Google Adwords, Google Commerce, and Forrester Research.  \n \nAs a Reuters Foundation Digital Vision Fellow at Stanford, I focused on technology projects for the developing world. My projects included usability testing an open-source microfinance application for Grameen. \n \nAt Forrester Research, I created the in-house usability program and designed and launched many new products, including the Forrester Wave.  \n \nSpecialties: Usability testing, field research, persona creation, project management, user panel management, cognitive walkthroughs, surveys, participatory design and facilitation, and remote testing. Usability and design researcher with 15+ experience. I get beautiful and user-friendly products into your hands.  \n \nI currently am working on Google Play for Education. This is an exciting effort to help impact K-12 learning all over the world with the appropriate use of technology. Previously I've led teams and product design projects with Android, Google Adwords, Google Commerce, and Forrester Research.  \n \nAs a Reuters Foundation Digital Vision Fellow at Stanford, I focused on technology projects for the developing world. My projects included usability testing an open-source microfinance application for Grameen. \n \nAt Forrester Research, I created the in-house usability program and designed and launched many new products, including the Forrester Wave.  \n \nSpecialties: Usability testing, field research, persona creation, project management, user panel management, cognitive walkthroughs, surveys, participatory design and facilitation, and remote testing. Usability and design researcher with 15+ experience. I get beautiful and user-friendly products into your hands.  \n \nI currently am working on Google Play for Education. This is an exciting effort to help impact K-12 learning all over the world with the appropriate use of technology. Previously I've led teams and product design projects with Android, Google Adwords, Google Commerce, and Forrester Research.  \n \nAs a Reuters Foundation Digital Vision Fellow at Stanford, I focused on technology projects for the developing world. My projects included usability testing an open-source microfinance application for Grameen. \n \nAt Forrester Research, I created the in-house usability program and designed and launched many new products, including the Forrester Wave.  \n \nSpecialties: Usability testing, field research, persona creation, project management, user panel management, cognitive walkthroughs, surveys, participatory design and facilitation, and remote testing. Experience Senior User Experience Researcher at Android Google November 2013  – Present (1 year 9 months) Cambridge, MA Lead research for Google Play. Field research. Lab studies. Remote mobile research. User Experience Research for Android Edu Google November 2013  – Present (1 year 9 months) Cambridge Senior User Experience Researcher Google November 2006  –  February 2012  (5 years 4 months) Lead team of 4 researchers for Google AdWords, the primary revenue driver for Google. I also led research for Commerce. Senior Business Analyst Forrester Research February 2001  –  October 2006  (5 years 9 months) Launching products, managing plans, and architecting information. Reuters Digital Vision Fellow Stanford University September 2005  –  June 2006  (10 months) Reuters Foundation Digital Vision Fellow-Social entepreneurship program focusing on technology for the developing world. Channel Manager iCast September 1999  –  February 2001  (1 year 6 months) Web production and team management. Founder, Designer and Project Manager SkeeterMedia 1998  –  1999  (1 year) Formed with director Clark Brandon, branding, print and online design company. Producer ZuluTV 1997  –  1998  (1 year) Content producer and designer for online streaming video internet company. Assistant Denise Marcil Literary Agency May 1994  –  February 1996  (1 year 10 months) New York, NY Helping authors publish books. Bass Player Kittywinder January 1992  –  January 1996  (4 years 1 month) New York, NY Rocking it with the ladies. Senior User Experience Researcher at Android Google November 2013  – Present (1 year 9 months) Cambridge, MA Lead research for Google Play. Field research. Lab studies. Remote mobile research. Senior User Experience Researcher at Android Google November 2013  – Present (1 year 9 months) Cambridge, MA Lead research for Google Play. Field research. Lab studies. Remote mobile research. User Experience Research for Android Edu Google November 2013  – Present (1 year 9 months) Cambridge User Experience Research for Android Edu Google November 2013  – Present (1 year 9 months) Cambridge Senior User Experience Researcher Google November 2006  –  February 2012  (5 years 4 months) Lead team of 4 researchers for Google AdWords, the primary revenue driver for Google. I also led research for Commerce. Senior User Experience Researcher Google November 2006  –  February 2012  (5 years 4 months) Lead team of 4 researchers for Google AdWords, the primary revenue driver for Google. I also led research for Commerce. Senior Business Analyst Forrester Research February 2001  –  October 2006  (5 years 9 months) Launching products, managing plans, and architecting information. Senior Business Analyst Forrester Research February 2001  –  October 2006  (5 years 9 months) Launching products, managing plans, and architecting information. Reuters Digital Vision Fellow Stanford University September 2005  –  June 2006  (10 months) Reuters Foundation Digital Vision Fellow-Social entepreneurship program focusing on technology for the developing world. Reuters Digital Vision Fellow Stanford University September 2005  –  June 2006  (10 months) Reuters Foundation Digital Vision Fellow-Social entepreneurship program focusing on technology for the developing world. Channel Manager iCast September 1999  –  February 2001  (1 year 6 months) Web production and team management. Channel Manager iCast September 1999  –  February 2001  (1 year 6 months) Web production and team management. Founder, Designer and Project Manager SkeeterMedia 1998  –  1999  (1 year) Formed with director Clark Brandon, branding, print and online design company. Founder, Designer and Project Manager SkeeterMedia 1998  –  1999  (1 year) Formed with director Clark Brandon, branding, print and online design company. Producer ZuluTV 1997  –  1998  (1 year) Content producer and designer for online streaming video internet company. Producer ZuluTV 1997  –  1998  (1 year) Content producer and designer for online streaming video internet company. Assistant Denise Marcil Literary Agency May 1994  –  February 1996  (1 year 10 months) New York, NY Helping authors publish books. Assistant Denise Marcil Literary Agency May 1994  –  February 1996  (1 year 10 months) New York, NY Helping authors publish books. Bass Player Kittywinder January 1992  –  January 1996  (4 years 1 month) New York, NY Rocking it with the ladies. Bass Player Kittywinder January 1992  –  January 1996  (4 years 1 month) New York, NY Rocking it with the ladies. Skills Top Skills 51 User Experience 45 Usability Testing 20 User Experience Design 14 Information Architecture 14 User-centered Design 14 Usability 9 Persona Creation 8 Web Strategy 8 Human Computer... 7 User Research Laura also knows about... 4 Card Sorting 3 International Research 3 Field Work 3 Heuristic Evaluation 2 Remote Testing 2 Mobile Applications 1 Participatory Design 1 Friendly Personality 0 Design innovation 0 Field work 0 Creating design... 0 Mobile research and... 0 International research 0 Panel creation 0 Remote testing Skills  Top Skills 51 User Experience 45 Usability Testing 20 User Experience Design 14 Information Architecture 14 User-centered Design 14 Usability 9 Persona Creation 8 Web Strategy 8 Human Computer... 7 User Research Laura also knows about... 4 Card Sorting 3 International Research 3 Field Work 3 Heuristic Evaluation 2 Remote Testing 2 Mobile Applications 1 Participatory Design 1 Friendly Personality 0 Design innovation 0 Field work 0 Creating design... 0 Mobile research and... 0 International research 0 Panel creation 0 Remote testing Top Skills 51 User Experience 45 Usability Testing 20 User Experience Design 14 Information Architecture 14 User-centered Design 14 Usability 9 Persona Creation 8 Web Strategy 8 Human Computer... 7 User Research Laura also knows about... 4 Card Sorting 3 International Research 3 Field Work 3 Heuristic Evaluation 2 Remote Testing 2 Mobile Applications 1 Participatory Design 1 Friendly Personality 0 Design innovation 0 Field work 0 Creating design... 0 Mobile research and... 0 International research 0 Panel creation 0 Remote testing Top Skills 51 User Experience 45 Usability Testing 20 User Experience Design 14 Information Architecture 14 User-centered Design 14 Usability 9 Persona Creation 8 Web Strategy 8 Human Computer... 7 User Research Laura also knows about... 4 Card Sorting 3 International Research 3 Field Work 3 Heuristic Evaluation 2 Remote Testing 2 Mobile Applications 1 Participatory Design 1 Friendly Personality 0 Design innovation 0 Field work 0 Creating design... 0 Mobile research and... 0 International research 0 Panel creation 0 Remote testing                     4 Card Sorting 3 International Research 3 Field Work 3 Heuristic Evaluation 2 Remote Testing 2 Mobile Applications 1 Participatory Design 1 Friendly Personality 0 Design innovation 0 Field work 0 Creating design... 0 Mobile research and... 0 International research 0 Panel creation 0 Remote testing Honors & Awards Additional Honors & Awards Digital Vision Fellow 2005-2006 Additional Honors & Awards Digital Vision Fellow 2005-2006 Additional Honors & Awards Digital Vision Fellow 2005-2006 Additional Honors & Awards Digital Vision Fellow 2005-2006 ", "Experience Quantitative User Experience Researcher Google 2009  – Present (6 years) Cambridge, MA User Experience Researcher Google 2006  –  2009  (3 years) Mountain View, CA Researcher International Children's Digital Library 2002  –  2006  (4 years) Researcher University of Maryland, College Park- International Children's Digital Library 2002  –  2006  (4 years) Grad student and Research Assistant University of Maryland College Park 1999  –  2006  (7 years) Quantitative User Experience Researcher Google 2009  – Present (6 years) Cambridge, MA Quantitative User Experience Researcher Google 2009  – Present (6 years) Cambridge, MA User Experience Researcher Google 2006  –  2009  (3 years) Mountain View, CA User Experience Researcher Google 2006  –  2009  (3 years) Mountain View, CA Researcher International Children's Digital Library 2002  –  2006  (4 years) Researcher International Children's Digital Library 2002  –  2006  (4 years) Researcher University of Maryland, College Park- International Children's Digital Library 2002  –  2006  (4 years) Researcher University of Maryland, College Park- International Children's Digital Library 2002  –  2006  (4 years) Grad student and Research Assistant University of Maryland College Park 1999  –  2006  (7 years) Grad student and Research Assistant University of Maryland College Park 1999  –  2006  (7 years) Skills Skills     Education University of Maryland College Park Doctor of Philosophy (Ph.D.),  Computer Science 1999  – 2006 Williams College BA,  Computer Science ,  Mathematics 1994  – 1997 University of Maryland College Park Doctor of Philosophy (Ph.D.),  Computer Science 1999  – 2006 University of Maryland College Park Doctor of Philosophy (Ph.D.),  Computer Science 1999  – 2006 University of Maryland College Park Doctor of Philosophy (Ph.D.),  Computer Science 1999  – 2006 Williams College BA,  Computer Science ,  Mathematics 1994  – 1997 Williams College BA,  Computer Science ,  Mathematics 1994  – 1997 Williams College BA,  Computer Science ,  Mathematics 1994  – 1997 ", "Summary I am a User Experience professional with 10+ years of experience in consulting and tech industry as both an individual contributor and manager. After 5+ years at Google as a user experience researcher, I started building the Google Cloud Platform User Experience team in January 2013 with me and three interaction designers. Today, my team deeply engages with front end engineering, back end engineering, and product management to deliver the amazing user experience that powers the Google Cloud Platform and many internal Google developer tools. Today, the Cloud Platform team has 50 UXers on various job ladders (interaction design, visual design, prototyping, UI writing, and user experience research) across Seattle, New York, and Mountain View. In addition to growing individual contributors at Google, I am also leading a team of UX Managers. Google Cloud Computing, Hosting Services & Cloud Support Edit Summary I am a User Experience professional with 10+ years of experience in consulting and tech industry as both an individual contributor and manager. After 5+ years at Google as a user experience researcher, I started building the Google Cloud Platform User Experience team in January 2013 with me and three interaction designers. Today, my team deeply engages with front end engineering, back end engineering, and product management to deliver the amazing user experience that powers the Google Cloud Platform and many internal Google developer tools. Today, the Cloud Platform team has 50 UXers on various job ladders (interaction design, visual design, prototyping, UI writing, and user experience research) across Seattle, New York, and Mountain View. In addition to growing individual contributors at Google, I am also leading a team of UX Managers. Google Cloud Computing, Hosting Services & Cloud Support Edit I am a User Experience professional with 10+ years of experience in consulting and tech industry as both an individual contributor and manager. After 5+ years at Google as a user experience researcher, I started building the Google Cloud Platform User Experience team in January 2013 with me and three interaction designers. Today, my team deeply engages with front end engineering, back end engineering, and product management to deliver the amazing user experience that powers the Google Cloud Platform and many internal Google developer tools. Today, the Cloud Platform team has 50 UXers on various job ladders (interaction design, visual design, prototyping, UI writing, and user experience research) across Seattle, New York, and Mountain View. In addition to growing individual contributors at Google, I am also leading a team of UX Managers. I am a User Experience professional with 10+ years of experience in consulting and tech industry as both an individual contributor and manager. After 5+ years at Google as a user experience researcher, I started building the Google Cloud Platform User Experience team in January 2013 with me and three interaction designers. Today, my team deeply engages with front end engineering, back end engineering, and product management to deliver the amazing user experience that powers the Google Cloud Platform and many internal Google developer tools. Today, the Cloud Platform team has 50 UXers on various job ladders (interaction design, visual design, prototyping, UI writing, and user experience research) across Seattle, New York, and Mountain View. In addition to growing individual contributors at Google, I am also leading a team of UX Managers. Google Cloud Computing, Hosting Services & Cloud Support Edit Google Cloud Computing, Hosting Services & Cloud Support Edit Google Cloud Computing, Hosting Services & Cloud Support Edit Google Cloud Computing, Hosting Services & Cloud Support  Google Cloud Computing, Hosting Services & Cloud Support  Experience UX Manager (III) (Senior Staff, L7) Google December 2014  – Present (8 months) Greater Seattle Area Head of UX for Google Cloud Platform & Google Developer Infrastructure - collectively called DevUX. \n \nCurrently managing a team of ~50 UX professionals including 7 UX managers, interaction designers, user experience researchers, user experience researcher assistant, prototyper, and UI writer. My team is located in multiple offices across the US and EMEA. UX Manager II Google January 2013  –  December 2014  (2 years) Seattle, WA UX Manager (II) for Google Cloud Platform & Google Developer Infrastructure - collectively called DevUX. \n \nCurrently managing a team of 40+ UX professionals including 5 UX managers, interaction designers, user experience researchers, user experience researcher assistant, prototyper, and UI writer. \n \nI had the pleasure of growing this team from 4 to 40+ in just over 18 months. (Open) 1 project Google Cloud Platform Google Cloud Platform lets you build applications and websites, store data, and analyze data on Google’s infrastructure. View Staff User Experience Researcher Google July 2012  –  January 2013  (7 months) Seattle WA Joined Google Cloud Platform as the first user experience researcher. Transitioned to UX Manager role. Senior User Researcher - Google Engineering Ambassador Google August 2011  –  July 2012  (1 year) Bangalore, India Research lead for Enterprise (Google Apps for Business) efforts based in Bangalore - Enterprise Marketplace & Control Panel. Google Culture evangelist. Engineering education facilitator - leadership and communications. Google Serve 2012 Site Leader. Senior User Experience Researcher Google October 2008  –  July 2011  (2 years 10 months) Kirkland WA Lead researcher for variety of projects  \n-- Ads Optimization \n-- Google SmartLists (bookmarking) \n-- Experimental Search \n-- Internationalization - Fonts & Onscreen Reading \n-- Google Web Fonts \n \nStarted and led many initiatives within the User Experience team. User Experience Researcher Google September 2007  –  September 2008  (1 year 1 month) Kirkland WA Lead researcher on numerous Ads-related efforts. Graduate Research Assistant Wichita State University August 2002  –  May 2007  (4 years 10 months) -- Research assistant on several Microsoft grants for onscreen reading and page layout. (6 semesters) \n-- Research assistant for the Software Usability Research Lab (www.surl.org) User Experience Intern Google May 2006  –  August 2006  (4 months) -- Ads Team Research intern \n-- Accessibility Team Research intern Lecturer/ Teaching Assistant Wichita State University August 2002  –  May 2005  (2 years 10 months) -- PSYCH 111 instructor (2 semesters) \n-- PSYCH 411 Lab instructor (4 semesters) \n-- Research assistant on several Microsoft grants for onscreen reading and page layout. (6 semesters) \n-- Research assistant for the Software Usability Research Lab (www.surl.org) UX Manager (III) (Senior Staff, L7) Google December 2014  – Present (8 months) Greater Seattle Area Head of UX for Google Cloud Platform & Google Developer Infrastructure - collectively called DevUX. \n \nCurrently managing a team of ~50 UX professionals including 7 UX managers, interaction designers, user experience researchers, user experience researcher assistant, prototyper, and UI writer. My team is located in multiple offices across the US and EMEA. UX Manager (III) (Senior Staff, L7) Google December 2014  – Present (8 months) Greater Seattle Area Head of UX for Google Cloud Platform & Google Developer Infrastructure - collectively called DevUX. \n \nCurrently managing a team of ~50 UX professionals including 7 UX managers, interaction designers, user experience researchers, user experience researcher assistant, prototyper, and UI writer. My team is located in multiple offices across the US and EMEA. UX Manager II Google January 2013  –  December 2014  (2 years) Seattle, WA UX Manager (II) for Google Cloud Platform & Google Developer Infrastructure - collectively called DevUX. \n \nCurrently managing a team of 40+ UX professionals including 5 UX managers, interaction designers, user experience researchers, user experience researcher assistant, prototyper, and UI writer. \n \nI had the pleasure of growing this team from 4 to 40+ in just over 18 months. (Open) 1 project Google Cloud Platform Google Cloud Platform lets you build applications and websites, store data, and analyze data on Google’s infrastructure. View UX Manager II Google January 2013  –  December 2014  (2 years) Seattle, WA UX Manager (II) for Google Cloud Platform & Google Developer Infrastructure - collectively called DevUX. \n \nCurrently managing a team of 40+ UX professionals including 5 UX managers, interaction designers, user experience researchers, user experience researcher assistant, prototyper, and UI writer. \n \nI had the pleasure of growing this team from 4 to 40+ in just over 18 months. (Open) 1 project Google Cloud Platform Google Cloud Platform lets you build applications and websites, store data, and analyze data on Google’s infrastructure. View Staff User Experience Researcher Google July 2012  –  January 2013  (7 months) Seattle WA Joined Google Cloud Platform as the first user experience researcher. Transitioned to UX Manager role. Staff User Experience Researcher Google July 2012  –  January 2013  (7 months) Seattle WA Joined Google Cloud Platform as the first user experience researcher. Transitioned to UX Manager role. Senior User Researcher - Google Engineering Ambassador Google August 2011  –  July 2012  (1 year) Bangalore, India Research lead for Enterprise (Google Apps for Business) efforts based in Bangalore - Enterprise Marketplace & Control Panel. Google Culture evangelist. Engineering education facilitator - leadership and communications. Google Serve 2012 Site Leader. Senior User Researcher - Google Engineering Ambassador Google August 2011  –  July 2012  (1 year) Bangalore, India Research lead for Enterprise (Google Apps for Business) efforts based in Bangalore - Enterprise Marketplace & Control Panel. Google Culture evangelist. Engineering education facilitator - leadership and communications. Google Serve 2012 Site Leader. Senior User Experience Researcher Google October 2008  –  July 2011  (2 years 10 months) Kirkland WA Lead researcher for variety of projects  \n-- Ads Optimization \n-- Google SmartLists (bookmarking) \n-- Experimental Search \n-- Internationalization - Fonts & Onscreen Reading \n-- Google Web Fonts \n \nStarted and led many initiatives within the User Experience team. Senior User Experience Researcher Google October 2008  –  July 2011  (2 years 10 months) Kirkland WA Lead researcher for variety of projects  \n-- Ads Optimization \n-- Google SmartLists (bookmarking) \n-- Experimental Search \n-- Internationalization - Fonts & Onscreen Reading \n-- Google Web Fonts \n \nStarted and led many initiatives within the User Experience team. User Experience Researcher Google September 2007  –  September 2008  (1 year 1 month) Kirkland WA Lead researcher on numerous Ads-related efforts. User Experience Researcher Google September 2007  –  September 2008  (1 year 1 month) Kirkland WA Lead researcher on numerous Ads-related efforts. Graduate Research Assistant Wichita State University August 2002  –  May 2007  (4 years 10 months) -- Research assistant on several Microsoft grants for onscreen reading and page layout. (6 semesters) \n-- Research assistant for the Software Usability Research Lab (www.surl.org) Graduate Research Assistant Wichita State University August 2002  –  May 2007  (4 years 10 months) -- Research assistant on several Microsoft grants for onscreen reading and page layout. (6 semesters) \n-- Research assistant for the Software Usability Research Lab (www.surl.org) User Experience Intern Google May 2006  –  August 2006  (4 months) -- Ads Team Research intern \n-- Accessibility Team Research intern User Experience Intern Google May 2006  –  August 2006  (4 months) -- Ads Team Research intern \n-- Accessibility Team Research intern Lecturer/ Teaching Assistant Wichita State University August 2002  –  May 2005  (2 years 10 months) -- PSYCH 111 instructor (2 semesters) \n-- PSYCH 411 Lab instructor (4 semesters) \n-- Research assistant on several Microsoft grants for onscreen reading and page layout. (6 semesters) \n-- Research assistant for the Software Usability Research Lab (www.surl.org) Lecturer/ Teaching Assistant Wichita State University August 2002  –  May 2005  (2 years 10 months) -- PSYCH 111 instructor (2 semesters) \n-- PSYCH 411 Lab instructor (4 semesters) \n-- Research assistant on several Microsoft grants for onscreen reading and page layout. (6 semesters) \n-- Research assistant for the Software Usability Research Lab (www.surl.org) Skills Top Skills 70 User Experience 62 Usability Testing 48 Contextual Inquiry 47 Usability 44 User Research 22 User-centered Design 20 Card Sorting 20 Human Computer... 20 User Interface 19 Interaction Design Dawn also knows about... 12 Qualitative Research 11 Persona 11 Heuristic Evaluation 10 Psychology 10 Ethnography 10 User Experience Design 9 User Scenarios 8 Information Architecture 8 Task Analysis 8 User Interface Design 7 Survey Research 5 Wireframes 4 User Stories 4 Usability Engineering 3 Observational Studies 2 Fonts 2 Eye Tracking 2 Human Factors 2 Paper Prototyping 1 Research of Type &... 1 User Acceptance Testing See 6+     See less Skills  Top Skills 70 User Experience 62 Usability Testing 48 Contextual Inquiry 47 Usability 44 User Research 22 User-centered Design 20 Card Sorting 20 Human Computer... 20 User Interface 19 Interaction Design Dawn also knows about... 12 Qualitative Research 11 Persona 11 Heuristic Evaluation 10 Psychology 10 Ethnography 10 User Experience Design 9 User Scenarios 8 Information Architecture 8 Task Analysis 8 User Interface Design 7 Survey Research 5 Wireframes 4 User Stories 4 Usability Engineering 3 Observational Studies 2 Fonts 2 Eye Tracking 2 Human Factors 2 Paper Prototyping 1 Research of Type &... 1 User Acceptance Testing See 6+     See less Top Skills 70 User Experience 62 Usability Testing 48 Contextual Inquiry 47 Usability 44 User Research 22 User-centered Design 20 Card Sorting 20 Human Computer... 20 User Interface 19 Interaction Design Dawn also knows about... 12 Qualitative Research 11 Persona 11 Heuristic Evaluation 10 Psychology 10 Ethnography 10 User Experience Design 9 User Scenarios 8 Information Architecture 8 Task Analysis 8 User Interface Design 7 Survey Research 5 Wireframes 4 User Stories 4 Usability Engineering 3 Observational Studies 2 Fonts 2 Eye Tracking 2 Human Factors 2 Paper Prototyping 1 Research of Type &... 1 User Acceptance Testing See 6+     See less Top Skills 70 User Experience 62 Usability Testing 48 Contextual Inquiry 47 Usability 44 User Research 22 User-centered Design 20 Card Sorting 20 Human Computer... 20 User Interface 19 Interaction Design Dawn also knows about... 12 Qualitative Research 11 Persona 11 Heuristic Evaluation 10 Psychology 10 Ethnography 10 User Experience Design 9 User Scenarios 8 Information Architecture 8 Task Analysis 8 User Interface Design 7 Survey Research 5 Wireframes 4 User Stories 4 Usability Engineering 3 Observational Studies 2 Fonts 2 Eye Tracking 2 Human Factors 2 Paper Prototyping 1 Research of Type &... 1 User Acceptance Testing See 6+     See less                     12 Qualitative Research 11 Persona 11 Heuristic Evaluation 10 Psychology 10 Ethnography 10 User Experience Design 9 User Scenarios 8 Information Architecture 8 Task Analysis 8 User Interface Design 7 Survey Research 5 Wireframes 4 User Stories 4 Usability Engineering 3 Observational Studies 2 Fonts 2 Eye Tracking 2 Human Factors 2 Paper Prototyping 1 Research of Type &... 1 User Acceptance Testing Education Wichita State University PhD,  Human Factors Psychology 2002  – 2007 Teaching Assistant, Research Assistant, Activities and Societies:  Software Usability Research Lab Wichita State University MA,  Experimental Psychology 2002  – 2005 University of North Texas MS,  Computer Education & Cognitive Systems 1996  – 1999 Baylor University BSE,  Earth Science ,  English ,  Secondary Education 1988  – 1992 Wichita State University PhD,  Human Factors Psychology 2002  – 2007 Teaching Assistant, Research Assistant, Activities and Societies:  Software Usability Research Lab Wichita State University PhD,  Human Factors Psychology 2002  – 2007 Teaching Assistant, Research Assistant, Activities and Societies:  Software Usability Research Lab Wichita State University PhD,  Human Factors Psychology 2002  – 2007 Teaching Assistant, Research Assistant, Activities and Societies:  Software Usability Research Lab Wichita State University MA,  Experimental Psychology 2002  – 2005 Wichita State University MA,  Experimental Psychology 2002  – 2005 Wichita State University MA,  Experimental Psychology 2002  – 2005 University of North Texas MS,  Computer Education & Cognitive Systems 1996  – 1999 University of North Texas MS,  Computer Education & Cognitive Systems 1996  – 1999 University of North Texas MS,  Computer Education & Cognitive Systems 1996  – 1999 Baylor University BSE,  Earth Science ,  English ,  Secondary Education 1988  – 1992 Baylor University BSE,  Earth Science ,  English ,  Secondary Education 1988  – 1992 Baylor University BSE,  Earth Science ,  English ,  Secondary Education 1988  – 1992 ", "Summary Seasoned yet perpetually curious user experience (UX) designer / researcher with deep knowledge of human factors, design research, marketing, analytics, and business development to help clients create digital products and services that delight the end user. Specialties:Design research and strategy for interactive products and services, human factors (work) analysis, human-computer interaction, interaction design, marketing research, web and marketing analytics, ethnography, usability testing, experimental design, and statistics. Summary Seasoned yet perpetually curious user experience (UX) designer / researcher with deep knowledge of human factors, design research, marketing, analytics, and business development to help clients create digital products and services that delight the end user. Specialties:Design research and strategy for interactive products and services, human factors (work) analysis, human-computer interaction, interaction design, marketing research, web and marketing analytics, ethnography, usability testing, experimental design, and statistics. Seasoned yet perpetually curious user experience (UX) designer / researcher with deep knowledge of human factors, design research, marketing, analytics, and business development to help clients create digital products and services that delight the end user. Specialties:Design research and strategy for interactive products and services, human factors (work) analysis, human-computer interaction, interaction design, marketing research, web and marketing analytics, ethnography, usability testing, experimental design, and statistics. Seasoned yet perpetually curious user experience (UX) designer / researcher with deep knowledge of human factors, design research, marketing, analytics, and business development to help clients create digital products and services that delight the end user. Specialties:Design research and strategy for interactive products and services, human factors (work) analysis, human-computer interaction, interaction design, marketing research, web and marketing analytics, ethnography, usability testing, experimental design, and statistics. Experience Senior User Experience Researcher Google December 2014  – Present (8 months) Greater New York City Area Lead a team of UX researchers and designers on Google enterprise apps \n \n- Lean UX, Scrum \n- Internal / external users \n- Design for mobile and desktop User Experience Researcher Google July 2013  –  December 2014  (1 year 6 months) Greater New York City Area Managing Consultant, User Research and Design National Practice IBM Global Business Services October 2010  –  June 2013  (2 years 9 months) United States Broad consulting experience to government and Fortune 100 companies in the consumer goods, retail, and internet industries, with a particular focus on data-driven UX design and digital marketing. \n \n- Digital marketing, research and strategy \n- Web and marketing analytics \n- User research and usability testing \n- UI design and information architecture \n- Project management responsibilities \n \nReceived Service Excellence Award in 2011 for \"strong leadership and technical guidance\" Human Factors Engineer AT&T May 2007  –  September 2010  (3 years 5 months) Greater Atlanta Area As a member of the customer experience / UX / IT strategy team, led human factors research and design on external and internal facing systems and service models for: \n \n- Web-based, desktop (CRM), and mobile enterprise applications \n- Interactive-voice response systems (IVR) \n- In-store digital signage and kiosks \n \nIdentified significant cost savings opportunities, assessed technology ROI, and uncovered latent customer needs through nationwide design and marketing research studies. \n \nSecured a range of projects for our internal consulting team through proposals to senior management across AT&T divisions. \n \nTrained and managed contractors and junior team members on research methods. \n \nPursued an evening MBA at Emory while working full-time. \n \nReceived team performance awards in 2008, 2009, 2010 (Open) 3 recommendations, including: Ankur Vij Strategy | Product Innovation | Program Management | Global | Mobility | Technology | MBA I have known Phil through both work and school for the past few years and he has always been helpful and professional in... View Tee Adams Senior Human Factors Engineer at AT&T I am fortunate to have Phil as my team member in our Human Centered Design team here at AT&T. Phil possess a nice blend of... View 1 more recommendation Lecturer, Industrial Design Georgia Institute of Technology January 2007  –  May 2007  (5 months) Greater Atlanta Area Designed and taught a six week course with invited guest speakers on human factors and design to graduate and undergraduate students in industrial design. Research Associate II SA Technologies May 2006  –  May 2007  (1 year 1 month) Greater Atlanta Area This was a quasi-post-doctoral position taken to gain training on the Goal-Directed Task Analysis, a methodology used to guide UI design based on cognitive task analysis. It is especially applicable where the user is routinely faced with information-rich, complex decision-making tasks (e.g., air traffic control, medical environments).  \n \nSee the excellent book, Designing for Situation Awareness: An Approach to User-Centered Design (Endsley, Bolté, & Jones, 2003), for more information. \n \nConducted site visits and structured interviews with subject matter experts to construct goal-directed task analyses for the medical and supply chain Army occupational specialties.  \n \nDesigned complex graphical user interfaces, interaction patterns, and information architectures delivered as functional Flash prototypes. Graduate Research Assistant Rice University 2001  –  2006  (5 years) Houston, Texas Area Conducted research on interface design and work analysis, focusing on the effects of training and methods to reduce procedural errors in (safety / efficiency / satisfaction) critical applications. \n \nComputer Human Interaction Lab (CHIL) \nhttp://chil.rice.edu/ \n \nChung, P. H., & Byrne, M.D. (2008). Cue effectiveness in mitigating postcompletion errors in a routine procedural task. International Journal of Human-Computer Studies, 66:4, 217-232. Human Factors Graduate Intern Lockheed Martin September 2003  –  May 2005  (1 year 9 months) Houston, Texas Area Led human factors research and design for wireless headsets, a habitat for long-duration space flight, payload software interfaces, shuttle equipment, and a web-based content management system. \n \nHabitability and Environmental Factors Division, NASA - Johnson Space Center \n \nChung, P. H., Norris, L., Holden, K., Whitmore, M. (2005). Determining human factors requirements for wireless headsets in space. Proceedings of HCI International 2005. Las Vegas, NV. Mira Digital Publishing. CD-ROM. Graduate Research Assistant University of Texas System May 2002  –  September 2003  (1 year 5 months) Houston, Texas Area Co-developed a task analysis methodology and user error taxonomy for evaluating medical device safety. \n \nConducted a heuristic evaluation, literature reviews, and usability tests with nurses, leading to novel design and safety guidelines for medical devices. \n \nConference paper finalist: An extended hierarchical task analysis for error prediction in medical devices. AMIA Annu Symp Proc. 2003:165-9. (PubMed ID #14728155) \n \nZhang, J., Patel, V. L., Johnson, T. R., Chung, P. H., Turley, J. P. (2005). Evaluating and predicting patient safety for medical devices with integral information technology. In Henriksen, Battles, Marks, & Lewin, (Eds.). Advances in Patient Safety: From Research to Implementation. Senior User Experience Researcher Google December 2014  – Present (8 months) Greater New York City Area Lead a team of UX researchers and designers on Google enterprise apps \n \n- Lean UX, Scrum \n- Internal / external users \n- Design for mobile and desktop Senior User Experience Researcher Google December 2014  – Present (8 months) Greater New York City Area Lead a team of UX researchers and designers on Google enterprise apps \n \n- Lean UX, Scrum \n- Internal / external users \n- Design for mobile and desktop User Experience Researcher Google July 2013  –  December 2014  (1 year 6 months) Greater New York City Area User Experience Researcher Google July 2013  –  December 2014  (1 year 6 months) Greater New York City Area Managing Consultant, User Research and Design National Practice IBM Global Business Services October 2010  –  June 2013  (2 years 9 months) United States Broad consulting experience to government and Fortune 100 companies in the consumer goods, retail, and internet industries, with a particular focus on data-driven UX design and digital marketing. \n \n- Digital marketing, research and strategy \n- Web and marketing analytics \n- User research and usability testing \n- UI design and information architecture \n- Project management responsibilities \n \nReceived Service Excellence Award in 2011 for \"strong leadership and technical guidance\" Managing Consultant, User Research and Design National Practice IBM Global Business Services October 2010  –  June 2013  (2 years 9 months) United States Broad consulting experience to government and Fortune 100 companies in the consumer goods, retail, and internet industries, with a particular focus on data-driven UX design and digital marketing. \n \n- Digital marketing, research and strategy \n- Web and marketing analytics \n- User research and usability testing \n- UI design and information architecture \n- Project management responsibilities \n \nReceived Service Excellence Award in 2011 for \"strong leadership and technical guidance\" Human Factors Engineer AT&T May 2007  –  September 2010  (3 years 5 months) Greater Atlanta Area As a member of the customer experience / UX / IT strategy team, led human factors research and design on external and internal facing systems and service models for: \n \n- Web-based, desktop (CRM), and mobile enterprise applications \n- Interactive-voice response systems (IVR) \n- In-store digital signage and kiosks \n \nIdentified significant cost savings opportunities, assessed technology ROI, and uncovered latent customer needs through nationwide design and marketing research studies. \n \nSecured a range of projects for our internal consulting team through proposals to senior management across AT&T divisions. \n \nTrained and managed contractors and junior team members on research methods. \n \nPursued an evening MBA at Emory while working full-time. \n \nReceived team performance awards in 2008, 2009, 2010 (Open) 3 recommendations, including: Ankur Vij Strategy | Product Innovation | Program Management | Global | Mobility | Technology | MBA I have known Phil through both work and school for the past few years and he has always been helpful and professional in... View Tee Adams Senior Human Factors Engineer at AT&T I am fortunate to have Phil as my team member in our Human Centered Design team here at AT&T. Phil possess a nice blend of... View 1 more recommendation Human Factors Engineer AT&T May 2007  –  September 2010  (3 years 5 months) Greater Atlanta Area As a member of the customer experience / UX / IT strategy team, led human factors research and design on external and internal facing systems and service models for: \n \n- Web-based, desktop (CRM), and mobile enterprise applications \n- Interactive-voice response systems (IVR) \n- In-store digital signage and kiosks \n \nIdentified significant cost savings opportunities, assessed technology ROI, and uncovered latent customer needs through nationwide design and marketing research studies. \n \nSecured a range of projects for our internal consulting team through proposals to senior management across AT&T divisions. \n \nTrained and managed contractors and junior team members on research methods. \n \nPursued an evening MBA at Emory while working full-time. \n \nReceived team performance awards in 2008, 2009, 2010 (Open) 3 recommendations, including: Ankur Vij Strategy | Product Innovation | Program Management | Global | Mobility | Technology | MBA I have known Phil through both work and school for the past few years and he has always been helpful and professional in... View Tee Adams Senior Human Factors Engineer at AT&T I am fortunate to have Phil as my team member in our Human Centered Design team here at AT&T. Phil possess a nice blend of... View 1 more recommendation Lecturer, Industrial Design Georgia Institute of Technology January 2007  –  May 2007  (5 months) Greater Atlanta Area Designed and taught a six week course with invited guest speakers on human factors and design to graduate and undergraduate students in industrial design. Lecturer, Industrial Design Georgia Institute of Technology January 2007  –  May 2007  (5 months) Greater Atlanta Area Designed and taught a six week course with invited guest speakers on human factors and design to graduate and undergraduate students in industrial design. Research Associate II SA Technologies May 2006  –  May 2007  (1 year 1 month) Greater Atlanta Area This was a quasi-post-doctoral position taken to gain training on the Goal-Directed Task Analysis, a methodology used to guide UI design based on cognitive task analysis. It is especially applicable where the user is routinely faced with information-rich, complex decision-making tasks (e.g., air traffic control, medical environments).  \n \nSee the excellent book, Designing for Situation Awareness: An Approach to User-Centered Design (Endsley, Bolté, & Jones, 2003), for more information. \n \nConducted site visits and structured interviews with subject matter experts to construct goal-directed task analyses for the medical and supply chain Army occupational specialties.  \n \nDesigned complex graphical user interfaces, interaction patterns, and information architectures delivered as functional Flash prototypes. Research Associate II SA Technologies May 2006  –  May 2007  (1 year 1 month) Greater Atlanta Area This was a quasi-post-doctoral position taken to gain training on the Goal-Directed Task Analysis, a methodology used to guide UI design based on cognitive task analysis. It is especially applicable where the user is routinely faced with information-rich, complex decision-making tasks (e.g., air traffic control, medical environments).  \n \nSee the excellent book, Designing for Situation Awareness: An Approach to User-Centered Design (Endsley, Bolté, & Jones, 2003), for more information. \n \nConducted site visits and structured interviews with subject matter experts to construct goal-directed task analyses for the medical and supply chain Army occupational specialties.  \n \nDesigned complex graphical user interfaces, interaction patterns, and information architectures delivered as functional Flash prototypes. Graduate Research Assistant Rice University 2001  –  2006  (5 years) Houston, Texas Area Conducted research on interface design and work analysis, focusing on the effects of training and methods to reduce procedural errors in (safety / efficiency / satisfaction) critical applications. \n \nComputer Human Interaction Lab (CHIL) \nhttp://chil.rice.edu/ \n \nChung, P. H., & Byrne, M.D. (2008). Cue effectiveness in mitigating postcompletion errors in a routine procedural task. International Journal of Human-Computer Studies, 66:4, 217-232. Graduate Research Assistant Rice University 2001  –  2006  (5 years) Houston, Texas Area Conducted research on interface design and work analysis, focusing on the effects of training and methods to reduce procedural errors in (safety / efficiency / satisfaction) critical applications. \n \nComputer Human Interaction Lab (CHIL) \nhttp://chil.rice.edu/ \n \nChung, P. H., & Byrne, M.D. (2008). Cue effectiveness in mitigating postcompletion errors in a routine procedural task. International Journal of Human-Computer Studies, 66:4, 217-232. Human Factors Graduate Intern Lockheed Martin September 2003  –  May 2005  (1 year 9 months) Houston, Texas Area Led human factors research and design for wireless headsets, a habitat for long-duration space flight, payload software interfaces, shuttle equipment, and a web-based content management system. \n \nHabitability and Environmental Factors Division, NASA - Johnson Space Center \n \nChung, P. H., Norris, L., Holden, K., Whitmore, M. (2005). Determining human factors requirements for wireless headsets in space. Proceedings of HCI International 2005. Las Vegas, NV. Mira Digital Publishing. CD-ROM. Human Factors Graduate Intern Lockheed Martin September 2003  –  May 2005  (1 year 9 months) Houston, Texas Area Led human factors research and design for wireless headsets, a habitat for long-duration space flight, payload software interfaces, shuttle equipment, and a web-based content management system. \n \nHabitability and Environmental Factors Division, NASA - Johnson Space Center \n \nChung, P. H., Norris, L., Holden, K., Whitmore, M. (2005). Determining human factors requirements for wireless headsets in space. Proceedings of HCI International 2005. Las Vegas, NV. Mira Digital Publishing. CD-ROM. Graduate Research Assistant University of Texas System May 2002  –  September 2003  (1 year 5 months) Houston, Texas Area Co-developed a task analysis methodology and user error taxonomy for evaluating medical device safety. \n \nConducted a heuristic evaluation, literature reviews, and usability tests with nurses, leading to novel design and safety guidelines for medical devices. \n \nConference paper finalist: An extended hierarchical task analysis for error prediction in medical devices. AMIA Annu Symp Proc. 2003:165-9. (PubMed ID #14728155) \n \nZhang, J., Patel, V. L., Johnson, T. R., Chung, P. H., Turley, J. P. (2005). Evaluating and predicting patient safety for medical devices with integral information technology. In Henriksen, Battles, Marks, & Lewin, (Eds.). Advances in Patient Safety: From Research to Implementation. Graduate Research Assistant University of Texas System May 2002  –  September 2003  (1 year 5 months) Houston, Texas Area Co-developed a task analysis methodology and user error taxonomy for evaluating medical device safety. \n \nConducted a heuristic evaluation, literature reviews, and usability tests with nurses, leading to novel design and safety guidelines for medical devices. \n \nConference paper finalist: An extended hierarchical task analysis for error prediction in medical devices. AMIA Annu Symp Proc. 2003:165-9. (PubMed ID #14728155) \n \nZhang, J., Patel, V. L., Johnson, T. R., Chung, P. H., Turley, J. P. (2005). Evaluating and predicting patient safety for medical devices with integral information technology. In Henriksen, Battles, Marks, & Lewin, (Eds.). Advances in Patient Safety: From Research to Implementation. Skills Top Skills 83 User Experience 76 User-centered Design 47 Usability Testing 38 Human Computer... 31 Information Architecture 27 User Interface Design 25 Interaction Design 12 Usability 11 Research Design 7 Usability Engineering Phil also knows about... 7 Task Analysis 7 User Interface 7 Flash 6 Human Factors 5 Information Design 4 Marketing Strategy 4 Ethnography 4 Persona 3 Google Analytics 3 Mobile Applications 2 Ergonomics 2 Marketing Research 2 Digital Marketing 2 Wireframes 2 Analytics 2 Web Applications 2 Rapid Prototyping 1 Web Interface Design 1 SPSS 1 Marketing Analytics 1 User Scenarios 0 Interactive Marketing... 0 Human-computer... 0 Multivariate Statistics 0 Data Mining 0 Adobe Fireworks 0 Web Analytics 0 Applicant Tracking... 0 Coremetrics Analytics 0 Unica 0 Adobe Creative Suite 0 Photoshop 0 Illustrator 0 Microsoft Excel 0 XLSTAT 0 Adsense 0 Wordpress See 22+     See less Skills  Top Skills 83 User Experience 76 User-centered Design 47 Usability Testing 38 Human Computer... 31 Information Architecture 27 User Interface Design 25 Interaction Design 12 Usability 11 Research Design 7 Usability Engineering Phil also knows about... 7 Task Analysis 7 User Interface 7 Flash 6 Human Factors 5 Information Design 4 Marketing Strategy 4 Ethnography 4 Persona 3 Google Analytics 3 Mobile Applications 2 Ergonomics 2 Marketing Research 2 Digital Marketing 2 Wireframes 2 Analytics 2 Web Applications 2 Rapid Prototyping 1 Web Interface Design 1 SPSS 1 Marketing Analytics 1 User Scenarios 0 Interactive Marketing... 0 Human-computer... 0 Multivariate Statistics 0 Data Mining 0 Adobe Fireworks 0 Web Analytics 0 Applicant Tracking... 0 Coremetrics Analytics 0 Unica 0 Adobe Creative Suite 0 Photoshop 0 Illustrator 0 Microsoft Excel 0 XLSTAT 0 Adsense 0 Wordpress See 22+     See less Top Skills 83 User Experience 76 User-centered Design 47 Usability Testing 38 Human Computer... 31 Information Architecture 27 User Interface Design 25 Interaction Design 12 Usability 11 Research Design 7 Usability Engineering Phil also knows about... 7 Task Analysis 7 User Interface 7 Flash 6 Human Factors 5 Information Design 4 Marketing Strategy 4 Ethnography 4 Persona 3 Google Analytics 3 Mobile Applications 2 Ergonomics 2 Marketing Research 2 Digital Marketing 2 Wireframes 2 Analytics 2 Web Applications 2 Rapid Prototyping 1 Web Interface Design 1 SPSS 1 Marketing Analytics 1 User Scenarios 0 Interactive Marketing... 0 Human-computer... 0 Multivariate Statistics 0 Data Mining 0 Adobe Fireworks 0 Web Analytics 0 Applicant Tracking... 0 Coremetrics Analytics 0 Unica 0 Adobe Creative Suite 0 Photoshop 0 Illustrator 0 Microsoft Excel 0 XLSTAT 0 Adsense 0 Wordpress See 22+     See less Top Skills 83 User Experience 76 User-centered Design 47 Usability Testing 38 Human Computer... 31 Information Architecture 27 User Interface Design 25 Interaction Design 12 Usability 11 Research Design 7 Usability Engineering Phil also knows about... 7 Task Analysis 7 User Interface 7 Flash 6 Human Factors 5 Information Design 4 Marketing Strategy 4 Ethnography 4 Persona 3 Google Analytics 3 Mobile Applications 2 Ergonomics 2 Marketing Research 2 Digital Marketing 2 Wireframes 2 Analytics 2 Web Applications 2 Rapid Prototyping 1 Web Interface Design 1 SPSS 1 Marketing Analytics 1 User Scenarios 0 Interactive Marketing... 0 Human-computer... 0 Multivariate Statistics 0 Data Mining 0 Adobe Fireworks 0 Web Analytics 0 Applicant Tracking... 0 Coremetrics Analytics 0 Unica 0 Adobe Creative Suite 0 Photoshop 0 Illustrator 0 Microsoft Excel 0 XLSTAT 0 Adsense 0 Wordpress See 22+     See less                     7 Task Analysis 7 User Interface 7 Flash 6 Human Factors 5 Information Design 4 Marketing Strategy 4 Ethnography 4 Persona 3 Google Analytics 3 Mobile Applications 2 Ergonomics 2 Marketing Research 2 Digital Marketing 2 Wireframes 2 Analytics 2 Web Applications 2 Rapid Prototyping 1 Web Interface Design 1 SPSS 1 Marketing Analytics 1 User Scenarios 0 Interactive Marketing... 0 Human-computer... 0 Multivariate Statistics 0 Data Mining 0 Adobe Fireworks 0 Web Analytics 0 Applicant Tracking... 0 Coremetrics Analytics 0 Unica 0 Adobe Creative Suite 0 Photoshop 0 Illustrator 0 Microsoft Excel 0 XLSTAT 0 Adsense 0 Wordpress Education Rice University Ph.D.,  Human-Computer Interaction 2001  – 2006 Chung, P. H. (2006). Changing the interface with minimal disruption: the roles of layout and labels. Doctoral dissertation, Rice University, Houston, TX. \n \nReceived full tuition waiver and graduate fellowship stipend. Activities and Societies:  Conducted research on human error ,  interface design ,  skill transfer ,  ethnography ,  and cognitive modeling with teaching experience in research methods and cognitive psychology. Emory University - Goizueta Business School MBA,  Evening Program 2008  – 2011 EvMBA scholarship award Activities and Societies:  Marketing and ISOM concentrations The University of Connecticut Bachelor,  Individualized Major 1997  – 2001 Study abroad at University Paris-Sorbonne (Paris IV) through UConn in French studies, art history, and interaction design & computer science at Paris VIII - St. Denis.  \n \nHonor Roll 1998 - 2001, New England Scholar 2000 Activities and Societies:  Studies in computer science ,  graphic and industrial design ,  fine art ,  management ,  writing ,  communications ,  human factors ,  and French Art Center College of Design Graphic and Interaction Design 2000  – 2000 Rhode Island School of Design Media and Industrial Design 1998  – 2000 Glastonbury High School 1994  – 1997 Rice University Ph.D.,  Human-Computer Interaction 2001  – 2006 Chung, P. H. (2006). Changing the interface with minimal disruption: the roles of layout and labels. Doctoral dissertation, Rice University, Houston, TX. \n \nReceived full tuition waiver and graduate fellowship stipend. Activities and Societies:  Conducted research on human error ,  interface design ,  skill transfer ,  ethnography ,  and cognitive modeling with teaching experience in research methods and cognitive psychology. Rice University Ph.D.,  Human-Computer Interaction 2001  – 2006 Chung, P. H. (2006). Changing the interface with minimal disruption: the roles of layout and labels. Doctoral dissertation, Rice University, Houston, TX. \n \nReceived full tuition waiver and graduate fellowship stipend. Activities and Societies:  Conducted research on human error ,  interface design ,  skill transfer ,  ethnography ,  and cognitive modeling with teaching experience in research methods and cognitive psychology. Rice University Ph.D.,  Human-Computer Interaction 2001  – 2006 Chung, P. H. (2006). Changing the interface with minimal disruption: the roles of layout and labels. Doctoral dissertation, Rice University, Houston, TX. \n \nReceived full tuition waiver and graduate fellowship stipend. Activities and Societies:  Conducted research on human error ,  interface design ,  skill transfer ,  ethnography ,  and cognitive modeling with teaching experience in research methods and cognitive psychology. Emory University - Goizueta Business School MBA,  Evening Program 2008  – 2011 EvMBA scholarship award Activities and Societies:  Marketing and ISOM concentrations Emory University - Goizueta Business School MBA,  Evening Program 2008  – 2011 EvMBA scholarship award Activities and Societies:  Marketing and ISOM concentrations Emory University - Goizueta Business School MBA,  Evening Program 2008  – 2011 EvMBA scholarship award Activities and Societies:  Marketing and ISOM concentrations The University of Connecticut Bachelor,  Individualized Major 1997  – 2001 Study abroad at University Paris-Sorbonne (Paris IV) through UConn in French studies, art history, and interaction design & computer science at Paris VIII - St. Denis.  \n \nHonor Roll 1998 - 2001, New England Scholar 2000 Activities and Societies:  Studies in computer science ,  graphic and industrial design ,  fine art ,  management ,  writing ,  communications ,  human factors ,  and French The University of Connecticut Bachelor,  Individualized Major 1997  – 2001 Study abroad at University Paris-Sorbonne (Paris IV) through UConn in French studies, art history, and interaction design & computer science at Paris VIII - St. Denis.  \n \nHonor Roll 1998 - 2001, New England Scholar 2000 Activities and Societies:  Studies in computer science ,  graphic and industrial design ,  fine art ,  management ,  writing ,  communications ,  human factors ,  and French The University of Connecticut Bachelor,  Individualized Major 1997  – 2001 Study abroad at University Paris-Sorbonne (Paris IV) through UConn in French studies, art history, and interaction design & computer science at Paris VIII - St. Denis.  \n \nHonor Roll 1998 - 2001, New England Scholar 2000 Activities and Societies:  Studies in computer science ,  graphic and industrial design ,  fine art ,  management ,  writing ,  communications ,  human factors ,  and French Art Center College of Design Graphic and Interaction Design 2000  – 2000 Art Center College of Design Graphic and Interaction Design 2000  – 2000 Art Center College of Design Graphic and Interaction Design 2000  – 2000 Rhode Island School of Design Media and Industrial Design 1998  – 2000 Rhode Island School of Design Media and Industrial Design 1998  – 2000 Rhode Island School of Design Media and Industrial Design 1998  – 2000 Glastonbury High School 1994  – 1997 Glastonbury High School 1994  – 1997 Glastonbury High School 1994  – 1997 Honors & Awards ", "Summary Aaron Sedley is a staff user experience researcher at Google, Inc. in Mountain View, focused on measuring and analyzing user attitudes via surveys. He leads survey research for Google Search and Maps, and consults with teams across Google on survey methodology, planning and implementation. Aaron initiated Happiness Tracking Surveys (HaTS) at Google in 2006, an attitudinal measurement platform that is now deployed across over 15 products. Prior to joining Google in 2003, Aaron held research positions with New York Times Digital, Young & Rubicam, and the Carnegie Endowment for International Peace. He earned a bachelor’s degree in Government from Wesleyan University, Phi Beta Kappa. Summary Aaron Sedley is a staff user experience researcher at Google, Inc. in Mountain View, focused on measuring and analyzing user attitudes via surveys. He leads survey research for Google Search and Maps, and consults with teams across Google on survey methodology, planning and implementation. Aaron initiated Happiness Tracking Surveys (HaTS) at Google in 2006, an attitudinal measurement platform that is now deployed across over 15 products. Prior to joining Google in 2003, Aaron held research positions with New York Times Digital, Young & Rubicam, and the Carnegie Endowment for International Peace. He earned a bachelor’s degree in Government from Wesleyan University, Phi Beta Kappa. Aaron Sedley is a staff user experience researcher at Google, Inc. in Mountain View, focused on measuring and analyzing user attitudes via surveys. He leads survey research for Google Search and Maps, and consults with teams across Google on survey methodology, planning and implementation. Aaron initiated Happiness Tracking Surveys (HaTS) at Google in 2006, an attitudinal measurement platform that is now deployed across over 15 products. Prior to joining Google in 2003, Aaron held research positions with New York Times Digital, Young & Rubicam, and the Carnegie Endowment for International Peace. He earned a bachelor’s degree in Government from Wesleyan University, Phi Beta Kappa. Aaron Sedley is a staff user experience researcher at Google, Inc. in Mountain View, focused on measuring and analyzing user attitudes via surveys. He leads survey research for Google Search and Maps, and consults with teams across Google on survey methodology, planning and implementation. Aaron initiated Happiness Tracking Surveys (HaTS) at Google in 2006, an attitudinal measurement platform that is now deployed across over 15 products. Prior to joining Google in 2003, Aaron held research positions with New York Times Digital, Young & Rubicam, and the Carnegie Endowment for International Peace. He earned a bachelor’s degree in Government from Wesleyan University, Phi Beta Kappa. Experience Staff User Experience Researcher Google 2015  – Present (less than a year) Senior User Experience Researcher Google 2009  –  2015  (6 years) User Experience Researcher Google 2007  –  2009  (2 years) Market Research Manager Google August 2003  –  2007  (4 years) Research Associate New York Times Company January 2000  –  September 2002  (2 years 9 months) New York, NY •\tDesign and execute quantitative and qualitative research for NYTimes.com and other New York Times Co. media interests. Manage custom and syndicated research sources. Decision analysis and strategic planning research. \n-\tProduct development, sales research and training, audience surveys and segmentation analysis, usability testing, pricing studies, customer satisfaction surveys, retention analyses, strategic planning. Research Executive Young & Rubicam March 1999  –  January 2000  (11 months) New York, NY Quantitative and qualitative market research & analysis using BrandAsset Valuator, Y&R’s proprietary brand consulting platform. \nMarketing consulting for agency clients (AT&T, Time Warner, Danone, Starwood, Ford etc.) and account pitches. \nStatistical analysis of BAV brand survey data: cluster/factor/elasticity analyses, correspondence maps, correlations Junior Fellow Carnegie Endowment for International Peace June 1995  –  May 1996  (1 year) Washington, D.C. •\tStudied public attitudes over time on NATO enlargement, foreign affairs spending, peacekeeping and other issues.  \n•\tAnalyzed survey data and voting records to develop strategic marketing initiatives and predict future trends.  \n•\tWrote analytical issues reports for Senior Associates; focus on domestic influences on policymaking. \n•\tResearched, edited, and assisted writing articles published in Foreign Affairs, Foreign Policy, and other journals. Staff User Experience Researcher Google 2015  – Present (less than a year) Staff User Experience Researcher Google 2015  – Present (less than a year) Senior User Experience Researcher Google 2009  –  2015  (6 years) Senior User Experience Researcher Google 2009  –  2015  (6 years) User Experience Researcher Google 2007  –  2009  (2 years) User Experience Researcher Google 2007  –  2009  (2 years) Market Research Manager Google August 2003  –  2007  (4 years) Market Research Manager Google August 2003  –  2007  (4 years) Research Associate New York Times Company January 2000  –  September 2002  (2 years 9 months) New York, NY •\tDesign and execute quantitative and qualitative research for NYTimes.com and other New York Times Co. media interests. Manage custom and syndicated research sources. Decision analysis and strategic planning research. \n-\tProduct development, sales research and training, audience surveys and segmentation analysis, usability testing, pricing studies, customer satisfaction surveys, retention analyses, strategic planning. Research Associate New York Times Company January 2000  –  September 2002  (2 years 9 months) New York, NY •\tDesign and execute quantitative and qualitative research for NYTimes.com and other New York Times Co. media interests. Manage custom and syndicated research sources. Decision analysis and strategic planning research. \n-\tProduct development, sales research and training, audience surveys and segmentation analysis, usability testing, pricing studies, customer satisfaction surveys, retention analyses, strategic planning. Research Executive Young & Rubicam March 1999  –  January 2000  (11 months) New York, NY Quantitative and qualitative market research & analysis using BrandAsset Valuator, Y&R’s proprietary brand consulting platform. \nMarketing consulting for agency clients (AT&T, Time Warner, Danone, Starwood, Ford etc.) and account pitches. \nStatistical analysis of BAV brand survey data: cluster/factor/elasticity analyses, correspondence maps, correlations Research Executive Young & Rubicam March 1999  –  January 2000  (11 months) New York, NY Quantitative and qualitative market research & analysis using BrandAsset Valuator, Y&R’s proprietary brand consulting platform. \nMarketing consulting for agency clients (AT&T, Time Warner, Danone, Starwood, Ford etc.) and account pitches. \nStatistical analysis of BAV brand survey data: cluster/factor/elasticity analyses, correspondence maps, correlations Junior Fellow Carnegie Endowment for International Peace June 1995  –  May 1996  (1 year) Washington, D.C. •\tStudied public attitudes over time on NATO enlargement, foreign affairs spending, peacekeeping and other issues.  \n•\tAnalyzed survey data and voting records to develop strategic marketing initiatives and predict future trends.  \n•\tWrote analytical issues reports for Senior Associates; focus on domestic influences on policymaking. \n•\tResearched, edited, and assisted writing articles published in Foreign Affairs, Foreign Policy, and other journals. Junior Fellow Carnegie Endowment for International Peace June 1995  –  May 1996  (1 year) Washington, D.C. •\tStudied public attitudes over time on NATO enlargement, foreign affairs spending, peacekeeping and other issues.  \n•\tAnalyzed survey data and voting records to develop strategic marketing initiatives and predict future trends.  \n•\tWrote analytical issues reports for Senior Associates; focus on domestic influences on policymaking. \n•\tResearched, edited, and assisted writing articles published in Foreign Affairs, Foreign Policy, and other journals. Skills Top Skills 11 Usability Testing 11 User Experience 7 User Research 4 Analytics 3 User-centered Design 3 Market Research 2 Ethnography 2 Heuristic Evaluation 2 Product Marketing 2 Qualitative Research Aaron also knows about... 2 Statistics 1 Survey Design 1 Interactive Marketing 1 Survey Research 1 Information Architecture 1 Web Analytics 1 Focus Groups 1 Contextual Inquiry 1 Research 1 Human Computer... 1 Analysis 1 Usability Skills  Top Skills 11 Usability Testing 11 User Experience 7 User Research 4 Analytics 3 User-centered Design 3 Market Research 2 Ethnography 2 Heuristic Evaluation 2 Product Marketing 2 Qualitative Research Aaron also knows about... 2 Statistics 1 Survey Design 1 Interactive Marketing 1 Survey Research 1 Information Architecture 1 Web Analytics 1 Focus Groups 1 Contextual Inquiry 1 Research 1 Human Computer... 1 Analysis 1 Usability Top Skills 11 Usability Testing 11 User Experience 7 User Research 4 Analytics 3 User-centered Design 3 Market Research 2 Ethnography 2 Heuristic Evaluation 2 Product Marketing 2 Qualitative Research Aaron also knows about... 2 Statistics 1 Survey Design 1 Interactive Marketing 1 Survey Research 1 Information Architecture 1 Web Analytics 1 Focus Groups 1 Contextual Inquiry 1 Research 1 Human Computer... 1 Analysis 1 Usability Top Skills 11 Usability Testing 11 User Experience 7 User Research 4 Analytics 3 User-centered Design 3 Market Research 2 Ethnography 2 Heuristic Evaluation 2 Product Marketing 2 Qualitative Research Aaron also knows about... 2 Statistics 1 Survey Design 1 Interactive Marketing 1 Survey Research 1 Information Architecture 1 Web Analytics 1 Focus Groups 1 Contextual Inquiry 1 Research 1 Human Computer... 1 Analysis 1 Usability                     2 Statistics 1 Survey Design 1 Interactive Marketing 1 Survey Research 1 Information Architecture 1 Web Analytics 1 Focus Groups 1 Contextual Inquiry 1 Research 1 Human Computer... 1 Analysis 1 Usability Education Wesleyan University Bachelor's Degree,  Government 1991  – 1995 •\tBachelor of Arts with Honors in Government. Concentration: International Politics. \n•\tDavenport Prize for Most Outstanding Government Major. \n• Phi Beta Kappa; Magna Cum Laude Columbia University in the City of New York School of International and Public Affairs 1997 Coursework in Accounting and Finance, Macroeconomics, and Statistics Wesleyan University Bachelor's Degree,  Government 1991  – 1995 •\tBachelor of Arts with Honors in Government. Concentration: International Politics. \n•\tDavenport Prize for Most Outstanding Government Major. \n• Phi Beta Kappa; Magna Cum Laude Wesleyan University Bachelor's Degree,  Government 1991  – 1995 •\tBachelor of Arts with Honors in Government. Concentration: International Politics. \n•\tDavenport Prize for Most Outstanding Government Major. \n• Phi Beta Kappa; Magna Cum Laude Wesleyan University Bachelor's Degree,  Government 1991  – 1995 •\tBachelor of Arts with Honors in Government. Concentration: International Politics. \n•\tDavenport Prize for Most Outstanding Government Major. \n• Phi Beta Kappa; Magna Cum Laude Columbia University in the City of New York School of International and Public Affairs 1997 Coursework in Accounting and Finance, Macroeconomics, and Statistics Columbia University in the City of New York School of International and Public Affairs 1997 Coursework in Accounting and Finance, Macroeconomics, and Statistics Columbia University in the City of New York School of International and Public Affairs 1997 Coursework in Accounting and Finance, Macroeconomics, and Statistics ", "Summary Experienced professional specializing in applied ethnography and human-centered research design. \n \nExpert in research methodology: applying the most effective techniques to solving difficult research problems. Dually trained in applied anthropology (Ph.D. 2009) and public health (M.P.H. 2006) with experience in both quantitative and qualitative techniques. I have designed and implemented projects ranging from a nine-month assessment of the Malaysian national food supplementation program and its household acceptance to an evaluation of the University of Alabama Libraries, which compares the user experience for on-site vs. remote resources. My recent work has provided insights for Microsoft's next generation technologies, focusing on emerging productivity trends, cloud offerings, and user personas, and Google's performance evaluation tool, employee development website, and talent management practices. \n \nTrained and funded by the National Science Foundation, a Fulbright Scholar, and a regular presenter at the foremost national meetings for the discipline (e.g., American Anthropological Association, Society for Applied Anthropology) with a growing publication record. Persona Presentation for Onboarding Design Sprint Edit Summary Experienced professional specializing in applied ethnography and human-centered research design. \n \nExpert in research methodology: applying the most effective techniques to solving difficult research problems. Dually trained in applied anthropology (Ph.D. 2009) and public health (M.P.H. 2006) with experience in both quantitative and qualitative techniques. I have designed and implemented projects ranging from a nine-month assessment of the Malaysian national food supplementation program and its household acceptance to an evaluation of the University of Alabama Libraries, which compares the user experience for on-site vs. remote resources. My recent work has provided insights for Microsoft's next generation technologies, focusing on emerging productivity trends, cloud offerings, and user personas, and Google's performance evaluation tool, employee development website, and talent management practices. \n \nTrained and funded by the National Science Foundation, a Fulbright Scholar, and a regular presenter at the foremost national meetings for the discipline (e.g., American Anthropological Association, Society for Applied Anthropology) with a growing publication record. Persona Presentation for Onboarding Design Sprint Edit Experienced professional specializing in applied ethnography and human-centered research design. \n \nExpert in research methodology: applying the most effective techniques to solving difficult research problems. Dually trained in applied anthropology (Ph.D. 2009) and public health (M.P.H. 2006) with experience in both quantitative and qualitative techniques. I have designed and implemented projects ranging from a nine-month assessment of the Malaysian national food supplementation program and its household acceptance to an evaluation of the University of Alabama Libraries, which compares the user experience for on-site vs. remote resources. My recent work has provided insights for Microsoft's next generation technologies, focusing on emerging productivity trends, cloud offerings, and user personas, and Google's performance evaluation tool, employee development website, and talent management practices. \n \nTrained and funded by the National Science Foundation, a Fulbright Scholar, and a regular presenter at the foremost national meetings for the discipline (e.g., American Anthropological Association, Society for Applied Anthropology) with a growing publication record. Experienced professional specializing in applied ethnography and human-centered research design. \n \nExpert in research methodology: applying the most effective techniques to solving difficult research problems. Dually trained in applied anthropology (Ph.D. 2009) and public health (M.P.H. 2006) with experience in both quantitative and qualitative techniques. I have designed and implemented projects ranging from a nine-month assessment of the Malaysian national food supplementation program and its household acceptance to an evaluation of the University of Alabama Libraries, which compares the user experience for on-site vs. remote resources. My recent work has provided insights for Microsoft's next generation technologies, focusing on emerging productivity trends, cloud offerings, and user personas, and Google's performance evaluation tool, employee development website, and talent management practices. \n \nTrained and funded by the National Science Foundation, a Fulbright Scholar, and a regular presenter at the foremost national meetings for the discipline (e.g., American Anthropological Association, Society for Applied Anthropology) with a growing publication record. Persona Presentation for Onboarding Design Sprint Edit Persona Presentation for Onboarding Design Sprint Edit Persona Presentation for Onboarding Design Sprint Edit Persona Presentation for Onboarding Design Sprint  Persona Presentation for Onboarding Design Sprint  Experience User Experience Researcher Google September 2014  – Present (11 months) Mountain View, California Focusing on the Google user in Corporate Engineering to provide insights on projects ranging from the employee development website and learning management system to 'Noogler'​ onboarding, supplier compliance, and larger questions of talent management.  \n \n*Designed and led strategic ethnographic research on talent management tools and processes, then drove consensus-building and identification of data-driven next steps with a 2-day design sprint \n \n*Developed new personas and user segmentations for 'Noogler' onboarding and supplier compliance teams, disseminating results through coordinated design sprints and workshops  \n \n*Conducted concept and usability testing for employee development website and learning management system Persona Presentation for Supplier Compliance Sprint Edit Courtesy Faculty University of South Florida January 2015  – Present (7 months) Tampa/St. Petersburg, Florida Area UX Researcher Google (Globe) April 2014  –  September 2014  (6 months) Mountain View, California Provided insights for Google's performance evaluation tool and employee development website. \n \n• Developed new data collection matrix and analysis plan for team-based observational studies, leading to one of the first contextual assessments of Google’s promo process \n \n• Designed and led strategic ethnographic research including focal follows and open-ended interviews to inform a new information dashboard for people managers Research@Google Poster Presentation Edit Usability Researcher Microsoft (CompuCom) October 2013  –  March 2014  (6 months) Redmond, Washington Worked with Front End Research to provide insights for Microsoft’s next generation technologies, including cloud and mobile offerings. Consulted on research design and methodology to ensure precision and sufficiency when driving business requirements. Performed data collection and deep analysis for the larger Microsoft Office team. \n \n• Conducted strategic ethnographic research including focal follows and open-ended interviews for multi-sited project on technology use among middle school students. Developed new persona for company-wide use. \n \n• Designed and served as project lead on a study assessing consumer models of ownership and their impact of SaaS acquisition and retention. (Open) 6 recommendations, including: Greg Parrott Product Strategy | User Experience | Customer Acquisition | UX/Market Research | Project Management | Change Management Elizabeth's Front End Research work uncovered incredibly valuable insights on consumer perceptions, preferences, and desired... View Kent Lowry Principal Program Manager at Microsoft Elizabeth has a combination of super intellectual horsepower and creativity. She quickly grasps not just the right... View 4 more recommendations Cloud for Consumers Report Out Edit User Experience Researcher Gladius Consulting May 2013  –  October 2013  (6 months) Palo Alto, California Developed, planned, and implemented tailored usability testing plans for clients of a SF Bay Area boutique security firm. Clients ranged from established financial firms to security software development startups. Assistant Professor of Anthropology University of Alabama August 2010  –  August 2013  (3 years 1 month) Tuscaloosa, Alabama Researched culturally-meaningful measurement tools (qualitative techniques and metrics) for program evaluation and household-level acceptability studies. Conducted research on the measurement of food insecurity, food-based identities, hunger and household coping strategies, and the anthropology of education. Assessed teaching technologies and techniques and developed rubrics to document and improve student learning. Promoted undergraduate methods and theory training. University teaching ranging from large introductory courses (160 students) to small upper-division undergraduate seminars and advanced doctoral seminars in a two-course per semester load. Supervised student research through appointments/affiliations with the Anthropology Department, Asian Studies minor, Honors College, and Freshman Learning Communities. \n \n* Acquired funding (including a new Graduate Teaching Assistant line) to reintroduce the undergraduate methods course as an applied research project providing UX insights to University Libraries.  \n \n* Completed eight article/chapter manuscripts and gave 11 professional papers at premier conferences. \n \n* Supervised two undergraduate research cohorts (per year) and an MA thesis, leading to 10 student-led professional presentations, one publication, and a research award from Capstone International for our assessment of international students’ experience and satisfaction at UA (Open) 5 recommendations, including: Millie Jackson Associate Dean for Research & Instruction, U of Alabama I worked with Elizabeth at the University of Alabama. She led a team of upperclassmen who provided user... View Jason DeCaro Associate Professor at The University of Alabama Elizabeth was a excellent member of our faculty, and we were sad to see her move on. Her leadership in undergraduate... View 3 more recommendations Assistant Professor of Anthropology Indiana University of Pennsylvania August 2009  –  July 2010  (1 year) Indiana, Pennsylvania Introduced stronger methodological focus to cultural anthropology program through course design innovations and efforts with the Anthropology Club. University teaching ranging from mid-sized courses (50 students) to small upper-division undergraduate seminars in a four-course per semester load. Appointment/affiliations with the Anthropology Department and Asian Studies. \n \n* Presented two professional papers at premier conferences. \n \n* Introduced new, methodologically-rigorous applied anthropology course and an anthropology of food course with a service learning component that partnered with the Indiana County Community Action Program to address local food security issues. \n \n* Organized and facilitated Reflective Practice Teaching Circle Visiting Scholar Universiti Malaysia Sarawak January 2008  –  October 2008  (10 months) Kota Samarahan Designed and implemented ethnographically-based program evaluation and household-level acceptance study of Malaysia’s national food supplementation program in cooperation with the Sarawak State Health Department, including on-site recruitment and training of a seven-person, project team.  \n \n* Awarded competitive grant funding from the National Science Foundation, Fulbright, and Sigma Xi  \n \n* Achieved unprecedented 98% participation rate among eligible households within the target villages  \n \n* Disseminated results to Malaysian Ministry of Health, State, and District Health Department stakeholders and to regional, professional audiences in Malaysia and Australia User Experience Researcher Google September 2014  – Present (11 months) Mountain View, California Focusing on the Google user in Corporate Engineering to provide insights on projects ranging from the employee development website and learning management system to 'Noogler'​ onboarding, supplier compliance, and larger questions of talent management.  \n \n*Designed and led strategic ethnographic research on talent management tools and processes, then drove consensus-building and identification of data-driven next steps with a 2-day design sprint \n \n*Developed new personas and user segmentations for 'Noogler' onboarding and supplier compliance teams, disseminating results through coordinated design sprints and workshops  \n \n*Conducted concept and usability testing for employee development website and learning management system Persona Presentation for Supplier Compliance Sprint Edit User Experience Researcher Google September 2014  – Present (11 months) Mountain View, California Focusing on the Google user in Corporate Engineering to provide insights on projects ranging from the employee development website and learning management system to 'Noogler'​ onboarding, supplier compliance, and larger questions of talent management.  \n \n*Designed and led strategic ethnographic research on talent management tools and processes, then drove consensus-building and identification of data-driven next steps with a 2-day design sprint \n \n*Developed new personas and user segmentations for 'Noogler' onboarding and supplier compliance teams, disseminating results through coordinated design sprints and workshops  \n \n*Conducted concept and usability testing for employee development website and learning management system Persona Presentation for Supplier Compliance Sprint Edit Persona Presentation for Supplier Compliance Sprint Edit Persona Presentation for Supplier Compliance Sprint Edit Persona Presentation for Supplier Compliance Sprint  Persona Presentation for Supplier Compliance Sprint  Courtesy Faculty University of South Florida January 2015  – Present (7 months) Tampa/St. Petersburg, Florida Area Courtesy Faculty University of South Florida January 2015  – Present (7 months) Tampa/St. Petersburg, Florida Area UX Researcher Google (Globe) April 2014  –  September 2014  (6 months) Mountain View, California Provided insights for Google's performance evaluation tool and employee development website. \n \n• Developed new data collection matrix and analysis plan for team-based observational studies, leading to one of the first contextual assessments of Google’s promo process \n \n• Designed and led strategic ethnographic research including focal follows and open-ended interviews to inform a new information dashboard for people managers Research@Google Poster Presentation Edit UX Researcher Google (Globe) April 2014  –  September 2014  (6 months) Mountain View, California Provided insights for Google's performance evaluation tool and employee development website. \n \n• Developed new data collection matrix and analysis plan for team-based observational studies, leading to one of the first contextual assessments of Google’s promo process \n \n• Designed and led strategic ethnographic research including focal follows and open-ended interviews to inform a new information dashboard for people managers Research@Google Poster Presentation Edit Research@Google Poster Presentation Edit Research@Google Poster Presentation Edit Research@Google Poster Presentation  Research@Google Poster Presentation  Usability Researcher Microsoft (CompuCom) October 2013  –  March 2014  (6 months) Redmond, Washington Worked with Front End Research to provide insights for Microsoft’s next generation technologies, including cloud and mobile offerings. Consulted on research design and methodology to ensure precision and sufficiency when driving business requirements. Performed data collection and deep analysis for the larger Microsoft Office team. \n \n• Conducted strategic ethnographic research including focal follows and open-ended interviews for multi-sited project on technology use among middle school students. Developed new persona for company-wide use. \n \n• Designed and served as project lead on a study assessing consumer models of ownership and their impact of SaaS acquisition and retention. (Open) 6 recommendations, including: Greg Parrott Product Strategy | User Experience | Customer Acquisition | UX/Market Research | Project Management | Change Management Elizabeth's Front End Research work uncovered incredibly valuable insights on consumer perceptions, preferences, and desired... View Kent Lowry Principal Program Manager at Microsoft Elizabeth has a combination of super intellectual horsepower and creativity. She quickly grasps not just the right... View 4 more recommendations Cloud for Consumers Report Out Edit Usability Researcher Microsoft (CompuCom) October 2013  –  March 2014  (6 months) Redmond, Washington Worked with Front End Research to provide insights for Microsoft’s next generation technologies, including cloud and mobile offerings. Consulted on research design and methodology to ensure precision and sufficiency when driving business requirements. Performed data collection and deep analysis for the larger Microsoft Office team. \n \n• Conducted strategic ethnographic research including focal follows and open-ended interviews for multi-sited project on technology use among middle school students. Developed new persona for company-wide use. \n \n• Designed and served as project lead on a study assessing consumer models of ownership and their impact of SaaS acquisition and retention. (Open) 6 recommendations, including: Greg Parrott Product Strategy | User Experience | Customer Acquisition | UX/Market Research | Project Management | Change Management Elizabeth's Front End Research work uncovered incredibly valuable insights on consumer perceptions, preferences, and desired... View Kent Lowry Principal Program Manager at Microsoft Elizabeth has a combination of super intellectual horsepower and creativity. She quickly grasps not just the right... View 4 more recommendations Cloud for Consumers Report Out Edit Cloud for Consumers Report Out Edit Cloud for Consumers Report Out Edit Cloud for Consumers Report Out  Cloud for Consumers Report Out  User Experience Researcher Gladius Consulting May 2013  –  October 2013  (6 months) Palo Alto, California Developed, planned, and implemented tailored usability testing plans for clients of a SF Bay Area boutique security firm. Clients ranged from established financial firms to security software development startups. User Experience Researcher Gladius Consulting May 2013  –  October 2013  (6 months) Palo Alto, California Developed, planned, and implemented tailored usability testing plans for clients of a SF Bay Area boutique security firm. Clients ranged from established financial firms to security software development startups. Assistant Professor of Anthropology University of Alabama August 2010  –  August 2013  (3 years 1 month) Tuscaloosa, Alabama Researched culturally-meaningful measurement tools (qualitative techniques and metrics) for program evaluation and household-level acceptability studies. Conducted research on the measurement of food insecurity, food-based identities, hunger and household coping strategies, and the anthropology of education. Assessed teaching technologies and techniques and developed rubrics to document and improve student learning. Promoted undergraduate methods and theory training. University teaching ranging from large introductory courses (160 students) to small upper-division undergraduate seminars and advanced doctoral seminars in a two-course per semester load. Supervised student research through appointments/affiliations with the Anthropology Department, Asian Studies minor, Honors College, and Freshman Learning Communities. \n \n* Acquired funding (including a new Graduate Teaching Assistant line) to reintroduce the undergraduate methods course as an applied research project providing UX insights to University Libraries.  \n \n* Completed eight article/chapter manuscripts and gave 11 professional papers at premier conferences. \n \n* Supervised two undergraduate research cohorts (per year) and an MA thesis, leading to 10 student-led professional presentations, one publication, and a research award from Capstone International for our assessment of international students’ experience and satisfaction at UA (Open) 5 recommendations, including: Millie Jackson Associate Dean for Research & Instruction, U of Alabama I worked with Elizabeth at the University of Alabama. She led a team of upperclassmen who provided user... View Jason DeCaro Associate Professor at The University of Alabama Elizabeth was a excellent member of our faculty, and we were sad to see her move on. Her leadership in undergraduate... View 3 more recommendations Assistant Professor of Anthropology University of Alabama August 2010  –  August 2013  (3 years 1 month) Tuscaloosa, Alabama Researched culturally-meaningful measurement tools (qualitative techniques and metrics) for program evaluation and household-level acceptability studies. Conducted research on the measurement of food insecurity, food-based identities, hunger and household coping strategies, and the anthropology of education. Assessed teaching technologies and techniques and developed rubrics to document and improve student learning. Promoted undergraduate methods and theory training. University teaching ranging from large introductory courses (160 students) to small upper-division undergraduate seminars and advanced doctoral seminars in a two-course per semester load. Supervised student research through appointments/affiliations with the Anthropology Department, Asian Studies minor, Honors College, and Freshman Learning Communities. \n \n* Acquired funding (including a new Graduate Teaching Assistant line) to reintroduce the undergraduate methods course as an applied research project providing UX insights to University Libraries.  \n \n* Completed eight article/chapter manuscripts and gave 11 professional papers at premier conferences. \n \n* Supervised two undergraduate research cohorts (per year) and an MA thesis, leading to 10 student-led professional presentations, one publication, and a research award from Capstone International for our assessment of international students’ experience and satisfaction at UA (Open) 5 recommendations, including: Millie Jackson Associate Dean for Research & Instruction, U of Alabama I worked with Elizabeth at the University of Alabama. She led a team of upperclassmen who provided user... View Jason DeCaro Associate Professor at The University of Alabama Elizabeth was a excellent member of our faculty, and we were sad to see her move on. Her leadership in undergraduate... View 3 more recommendations Assistant Professor of Anthropology Indiana University of Pennsylvania August 2009  –  July 2010  (1 year) Indiana, Pennsylvania Introduced stronger methodological focus to cultural anthropology program through course design innovations and efforts with the Anthropology Club. University teaching ranging from mid-sized courses (50 students) to small upper-division undergraduate seminars in a four-course per semester load. Appointment/affiliations with the Anthropology Department and Asian Studies. \n \n* Presented two professional papers at premier conferences. \n \n* Introduced new, methodologically-rigorous applied anthropology course and an anthropology of food course with a service learning component that partnered with the Indiana County Community Action Program to address local food security issues. \n \n* Organized and facilitated Reflective Practice Teaching Circle Assistant Professor of Anthropology Indiana University of Pennsylvania August 2009  –  July 2010  (1 year) Indiana, Pennsylvania Introduced stronger methodological focus to cultural anthropology program through course design innovations and efforts with the Anthropology Club. University teaching ranging from mid-sized courses (50 students) to small upper-division undergraduate seminars in a four-course per semester load. Appointment/affiliations with the Anthropology Department and Asian Studies. \n \n* Presented two professional papers at premier conferences. \n \n* Introduced new, methodologically-rigorous applied anthropology course and an anthropology of food course with a service learning component that partnered with the Indiana County Community Action Program to address local food security issues. \n \n* Organized and facilitated Reflective Practice Teaching Circle Visiting Scholar Universiti Malaysia Sarawak January 2008  –  October 2008  (10 months) Kota Samarahan Designed and implemented ethnographically-based program evaluation and household-level acceptance study of Malaysia’s national food supplementation program in cooperation with the Sarawak State Health Department, including on-site recruitment and training of a seven-person, project team.  \n \n* Awarded competitive grant funding from the National Science Foundation, Fulbright, and Sigma Xi  \n \n* Achieved unprecedented 98% participation rate among eligible households within the target villages  \n \n* Disseminated results to Malaysian Ministry of Health, State, and District Health Department stakeholders and to regional, professional audiences in Malaysia and Australia Visiting Scholar Universiti Malaysia Sarawak January 2008  –  October 2008  (10 months) Kota Samarahan Designed and implemented ethnographically-based program evaluation and household-level acceptance study of Malaysia’s national food supplementation program in cooperation with the Sarawak State Health Department, including on-site recruitment and training of a seven-person, project team.  \n \n* Awarded competitive grant funding from the National Science Foundation, Fulbright, and Sigma Xi  \n \n* Achieved unprecedented 98% participation rate among eligible households within the target villages  \n \n* Disseminated results to Malaysian Ministry of Health, State, and District Health Department stakeholders and to regional, professional audiences in Malaysia and Australia Languages English Native or bilingual proficiency Malay Professional working proficiency English Native or bilingual proficiency Malay Professional working proficiency English Native or bilingual proficiency Malay Professional working proficiency Native or bilingual proficiency Professional working proficiency Skills Top Skills 52 Qualitative Research 45 Ethnography 35 Research Design 25 Anthropology 22 Program Evaluation 17 Quantitative Research 14 Social Sciences 11 Usability Testing 9 Survey Design 8 Applied Anthropology Elizabeth also knows about... 6 User Experience 5 Public Speaking 3 Interviews 3 Usability 2 User-centered Design 1 Analysis 0 Malay Skills  Top Skills 52 Qualitative Research 45 Ethnography 35 Research Design 25 Anthropology 22 Program Evaluation 17 Quantitative Research 14 Social Sciences 11 Usability Testing 9 Survey Design 8 Applied Anthropology Elizabeth also knows about... 6 User Experience 5 Public Speaking 3 Interviews 3 Usability 2 User-centered Design 1 Analysis 0 Malay Top Skills 52 Qualitative Research 45 Ethnography 35 Research Design 25 Anthropology 22 Program Evaluation 17 Quantitative Research 14 Social Sciences 11 Usability Testing 9 Survey Design 8 Applied Anthropology Elizabeth also knows about... 6 User Experience 5 Public Speaking 3 Interviews 3 Usability 2 User-centered Design 1 Analysis 0 Malay Top Skills 52 Qualitative Research 45 Ethnography 35 Research Design 25 Anthropology 22 Program Evaluation 17 Quantitative Research 14 Social Sciences 11 Usability Testing 9 Survey Design 8 Applied Anthropology Elizabeth also knows about... 6 User Experience 5 Public Speaking 3 Interviews 3 Usability 2 User-centered Design 1 Analysis 0 Malay                     6 User Experience 5 Public Speaking 3 Interviews 3 Usability 2 User-centered Design 1 Analysis 0 Malay Education University of South Florida Doctor of Philosophy (PhD),  Applied Anthropology 2004  – 2009 Dissertation (Hunger of the Body, Hunger of the Mind: The Experience of Food Insecurity in Rural, Non-Peninsular Malaysia) funded by National Science Foundation (NSF) Doctoral Dissertation Improvement Grant, U.S. Fulbright Full Grant to Malaysia, and Sigma Xi Grant-in-Aid of Research \n \n2007, 2008 GPSC Conference Grant Recipient  \n \n2007 Certificate of Recognition and Departmental Nomination for Provost's Award for Outstanding Teaching by a Graduate Teaching Assistant (Open) 3 recommendations, including: Elizabeth Danforth Richey, MPH, PhD Data Management Program Director at Iowa Department of Public Health Elizabeth is highly qualified in both qualitative and quantitative research methods with broad experience in domestic and... View AJ Faas Assistant Professor of Anthropology, San Jose State University In the time I have known Elizabeth (~7 years), she has stood out as being among the most committed, capable, and collegial... View 1 more recommendation University of South Florida Master of Public Health (MPH),  Global Health Practice 2004  – 2006 Thesis/Special Project (From International Priority to Local Reality: A Cross-Cultural Perspective on WIC and the Malaysian PPKZM) funded in part by University of Malaysia Sarawak (UNIMAS)/University of South Florida (USF) Educational Partnership \n \n2007 American Public Health Association (APHA) Student Assembly Student Presenter Scholarship awarded for work completed during MPH degree program \n \n2006 Student Honorary Award for Research and Practice (SHARP) from USF College of Public Health University of South Carolina-Columbia Bachelor of Arts (B.A.),  Anthropology 1999  – 2003 Graduated Magna Cum Laude with Honors with a Medical Humanities minor \n \nHonors Thesis (Eye of the Beholder: A Qualitative Study of the Concept of Beauty through Photography and Dialogue) \n \nStudy Abroad Program at Leeds University (2001-2002), focus on Sociology and Social Policy Activities and Societies:  Phi Beta Kappa University of South Florida Doctor of Philosophy (PhD),  Applied Anthropology 2004  – 2009 Dissertation (Hunger of the Body, Hunger of the Mind: The Experience of Food Insecurity in Rural, Non-Peninsular Malaysia) funded by National Science Foundation (NSF) Doctoral Dissertation Improvement Grant, U.S. Fulbright Full Grant to Malaysia, and Sigma Xi Grant-in-Aid of Research \n \n2007, 2008 GPSC Conference Grant Recipient  \n \n2007 Certificate of Recognition and Departmental Nomination for Provost's Award for Outstanding Teaching by a Graduate Teaching Assistant (Open) 3 recommendations, including: Elizabeth Danforth Richey, MPH, PhD Data Management Program Director at Iowa Department of Public Health Elizabeth is highly qualified in both qualitative and quantitative research methods with broad experience in domestic and... View AJ Faas Assistant Professor of Anthropology, San Jose State University In the time I have known Elizabeth (~7 years), she has stood out as being among the most committed, capable, and collegial... View 1 more recommendation University of South Florida Doctor of Philosophy (PhD),  Applied Anthropology 2004  – 2009 Dissertation (Hunger of the Body, Hunger of the Mind: The Experience of Food Insecurity in Rural, Non-Peninsular Malaysia) funded by National Science Foundation (NSF) Doctoral Dissertation Improvement Grant, U.S. Fulbright Full Grant to Malaysia, and Sigma Xi Grant-in-Aid of Research \n \n2007, 2008 GPSC Conference Grant Recipient  \n \n2007 Certificate of Recognition and Departmental Nomination for Provost's Award for Outstanding Teaching by a Graduate Teaching Assistant (Open) 3 recommendations, including: Elizabeth Danforth Richey, MPH, PhD Data Management Program Director at Iowa Department of Public Health Elizabeth is highly qualified in both qualitative and quantitative research methods with broad experience in domestic and... View AJ Faas Assistant Professor of Anthropology, San Jose State University In the time I have known Elizabeth (~7 years), she has stood out as being among the most committed, capable, and collegial... View 1 more recommendation University of South Florida Doctor of Philosophy (PhD),  Applied Anthropology 2004  – 2009 Dissertation (Hunger of the Body, Hunger of the Mind: The Experience of Food Insecurity in Rural, Non-Peninsular Malaysia) funded by National Science Foundation (NSF) Doctoral Dissertation Improvement Grant, U.S. Fulbright Full Grant to Malaysia, and Sigma Xi Grant-in-Aid of Research \n \n2007, 2008 GPSC Conference Grant Recipient  \n \n2007 Certificate of Recognition and Departmental Nomination for Provost's Award for Outstanding Teaching by a Graduate Teaching Assistant (Open) 3 recommendations, including: Elizabeth Danforth Richey, MPH, PhD Data Management Program Director at Iowa Department of Public Health Elizabeth is highly qualified in both qualitative and quantitative research methods with broad experience in domestic and... View AJ Faas Assistant Professor of Anthropology, San Jose State University In the time I have known Elizabeth (~7 years), she has stood out as being among the most committed, capable, and collegial... View 1 more recommendation University of South Florida Master of Public Health (MPH),  Global Health Practice 2004  – 2006 Thesis/Special Project (From International Priority to Local Reality: A Cross-Cultural Perspective on WIC and the Malaysian PPKZM) funded in part by University of Malaysia Sarawak (UNIMAS)/University of South Florida (USF) Educational Partnership \n \n2007 American Public Health Association (APHA) Student Assembly Student Presenter Scholarship awarded for work completed during MPH degree program \n \n2006 Student Honorary Award for Research and Practice (SHARP) from USF College of Public Health University of South Florida Master of Public Health (MPH),  Global Health Practice 2004  – 2006 Thesis/Special Project (From International Priority to Local Reality: A Cross-Cultural Perspective on WIC and the Malaysian PPKZM) funded in part by University of Malaysia Sarawak (UNIMAS)/University of South Florida (USF) Educational Partnership \n \n2007 American Public Health Association (APHA) Student Assembly Student Presenter Scholarship awarded for work completed during MPH degree program \n \n2006 Student Honorary Award for Research and Practice (SHARP) from USF College of Public Health University of South Florida Master of Public Health (MPH),  Global Health Practice 2004  – 2006 Thesis/Special Project (From International Priority to Local Reality: A Cross-Cultural Perspective on WIC and the Malaysian PPKZM) funded in part by University of Malaysia Sarawak (UNIMAS)/University of South Florida (USF) Educational Partnership \n \n2007 American Public Health Association (APHA) Student Assembly Student Presenter Scholarship awarded for work completed during MPH degree program \n \n2006 Student Honorary Award for Research and Practice (SHARP) from USF College of Public Health University of South Carolina-Columbia Bachelor of Arts (B.A.),  Anthropology 1999  – 2003 Graduated Magna Cum Laude with Honors with a Medical Humanities minor \n \nHonors Thesis (Eye of the Beholder: A Qualitative Study of the Concept of Beauty through Photography and Dialogue) \n \nStudy Abroad Program at Leeds University (2001-2002), focus on Sociology and Social Policy Activities and Societies:  Phi Beta Kappa University of South Carolina-Columbia Bachelor of Arts (B.A.),  Anthropology 1999  – 2003 Graduated Magna Cum Laude with Honors with a Medical Humanities minor \n \nHonors Thesis (Eye of the Beholder: A Qualitative Study of the Concept of Beauty through Photography and Dialogue) \n \nStudy Abroad Program at Leeds University (2001-2002), focus on Sociology and Social Policy Activities and Societies:  Phi Beta Kappa University of South Carolina-Columbia Bachelor of Arts (B.A.),  Anthropology 1999  – 2003 Graduated Magna Cum Laude with Honors with a Medical Humanities minor \n \nHonors Thesis (Eye of the Beholder: A Qualitative Study of the Concept of Beauty through Photography and Dialogue) \n \nStudy Abroad Program at Leeds University (2001-2002), focus on Sociology and Social Policy Activities and Societies:  Phi Beta Kappa Honors & Awards ", "Summary I love to create delightful, useful, and extremely usable products by thoroughly understanding potential and existing users. I focus on mobile devices and the Web, but also have experience with Mac & Win platforms. My passion is the focus on the user from start to end! Specialties:Human-computer interaction, user experience, user research, interaction design, strategic research, survey research, usability testing, field research, contextual inquiry, diary studies Summary I love to create delightful, useful, and extremely usable products by thoroughly understanding potential and existing users. I focus on mobile devices and the Web, but also have experience with Mac & Win platforms. My passion is the focus on the user from start to end! Specialties:Human-computer interaction, user experience, user research, interaction design, strategic research, survey research, usability testing, field research, contextual inquiry, diary studies I love to create delightful, useful, and extremely usable products by thoroughly understanding potential and existing users. I focus on mobile devices and the Web, but also have experience with Mac & Win platforms. My passion is the focus on the user from start to end! Specialties:Human-computer interaction, user experience, user research, interaction design, strategic research, survey research, usability testing, field research, contextual inquiry, diary studies I love to create delightful, useful, and extremely usable products by thoroughly understanding potential and existing users. I focus on mobile devices and the Web, but also have experience with Mac & Win platforms. My passion is the focus on the user from start to end! Specialties:Human-computer interaction, user experience, user research, interaction design, strategic research, survey research, usability testing, field research, contextual inquiry, diary studies Experience Staff User Experience Researcher Google August 2008  – Present (7 years) Greater New York City Area I am focusing on user research, usability evaluation, strategic product research, and occasionally user interface design. I am the user experience researcher for Google Docs. (Open) 1 project Google Drive A product that allows you store all your content in the cloud, with the ability to access it at any time from any of your devices. View (Open) 2 recommendations Kathy Baxter Staff User Experience Researcher at Google I have worked with Hendrik for nearly 4 years. He is a brilliant researcher and extremely hard working! I don't know... View Simon Raess Founder, Design Strategist at Ginetta GmbH Hendrik is one of the most talented UX catalysts I've ever worked with. He's an extraordinarily competent researcher with... View User Experience Researcher Intern Google January 2008  –  July 2008  (7 months) Teaching Assistant Georgia Tech August 2007  –  December 2007  (5 months) Research Assistant Georgia Tech June 2007  –  December 2007  (7 months) Lead Tutor Athletic Association Georgia Tech February 2007  –  December 2007  (11 months) Project Intern SAP Labs India March 2006  –  December 2006  (10 months) Teaching Assistant Dresden University of Technology April 2004  –  March 2006  (2 years) Research Assistant Georgia Tech January 2004  –  April 2004  (4 months) Staff User Experience Researcher Google August 2008  – Present (7 years) Greater New York City Area I am focusing on user research, usability evaluation, strategic product research, and occasionally user interface design. I am the user experience researcher for Google Docs. (Open) 1 project Google Drive A product that allows you store all your content in the cloud, with the ability to access it at any time from any of your devices. View (Open) 2 recommendations Kathy Baxter Staff User Experience Researcher at Google I have worked with Hendrik for nearly 4 years. He is a brilliant researcher and extremely hard working! I don't know... View Simon Raess Founder, Design Strategist at Ginetta GmbH Hendrik is one of the most talented UX catalysts I've ever worked with. He's an extraordinarily competent researcher with... View Staff User Experience Researcher Google August 2008  – Present (7 years) Greater New York City Area I am focusing on user research, usability evaluation, strategic product research, and occasionally user interface design. I am the user experience researcher for Google Docs. (Open) 1 project Google Drive A product that allows you store all your content in the cloud, with the ability to access it at any time from any of your devices. View (Open) 2 recommendations Kathy Baxter Staff User Experience Researcher at Google I have worked with Hendrik for nearly 4 years. He is a brilliant researcher and extremely hard working! I don't know... View Simon Raess Founder, Design Strategist at Ginetta GmbH Hendrik is one of the most talented UX catalysts I've ever worked with. He's an extraordinarily competent researcher with... View User Experience Researcher Intern Google January 2008  –  July 2008  (7 months) User Experience Researcher Intern Google January 2008  –  July 2008  (7 months) Teaching Assistant Georgia Tech August 2007  –  December 2007  (5 months) Teaching Assistant Georgia Tech August 2007  –  December 2007  (5 months) Research Assistant Georgia Tech June 2007  –  December 2007  (7 months) Research Assistant Georgia Tech June 2007  –  December 2007  (7 months) Lead Tutor Athletic Association Georgia Tech February 2007  –  December 2007  (11 months) Lead Tutor Athletic Association Georgia Tech February 2007  –  December 2007  (11 months) Project Intern SAP Labs India March 2006  –  December 2006  (10 months) Project Intern SAP Labs India March 2006  –  December 2006  (10 months) Teaching Assistant Dresden University of Technology April 2004  –  March 2006  (2 years) Teaching Assistant Dresden University of Technology April 2004  –  March 2006  (2 years) Research Assistant Georgia Tech January 2004  –  April 2004  (4 months) Research Assistant Georgia Tech January 2004  –  April 2004  (4 months) Languages English Full professional proficiency German Native or bilingual proficiency English Full professional proficiency German Native or bilingual proficiency English Full professional proficiency German Native or bilingual proficiency Full professional proficiency Native or bilingual proficiency Skills Top Skills 16 Usability Testing 15 Contextual Inquiry 13 User Research 11 Human Computer... 9 User Experience 7 User-centered Design 5 Heuristic Evaluation 2 Strategic Research 2 Survey Design 2 Observation Hendrik also knows about... 1 Human-computer... 1 Healthcare 1 Mobile 1 User Studies 1 Personas 1 Ethnography 1 Qualitative Research 1 Information Architecture 1 Task Analysis 1 Focus Groups 1 Participatory Design Skills  Top Skills 16 Usability Testing 15 Contextual Inquiry 13 User Research 11 Human Computer... 9 User Experience 7 User-centered Design 5 Heuristic Evaluation 2 Strategic Research 2 Survey Design 2 Observation Hendrik also knows about... 1 Human-computer... 1 Healthcare 1 Mobile 1 User Studies 1 Personas 1 Ethnography 1 Qualitative Research 1 Information Architecture 1 Task Analysis 1 Focus Groups 1 Participatory Design Top Skills 16 Usability Testing 15 Contextual Inquiry 13 User Research 11 Human Computer... 9 User Experience 7 User-centered Design 5 Heuristic Evaluation 2 Strategic Research 2 Survey Design 2 Observation Hendrik also knows about... 1 Human-computer... 1 Healthcare 1 Mobile 1 User Studies 1 Personas 1 Ethnography 1 Qualitative Research 1 Information Architecture 1 Task Analysis 1 Focus Groups 1 Participatory Design Top Skills 16 Usability Testing 15 Contextual Inquiry 13 User Research 11 Human Computer... 9 User Experience 7 User-centered Design 5 Heuristic Evaluation 2 Strategic Research 2 Survey Design 2 Observation Hendrik also knows about... 1 Human-computer... 1 Healthcare 1 Mobile 1 User Studies 1 Personas 1 Ethnography 1 Qualitative Research 1 Information Architecture 1 Task Analysis 1 Focus Groups 1 Participatory Design                     1 Human-computer... 1 Healthcare 1 Mobile 1 User Studies 1 Personas 1 Ethnography 1 Qualitative Research 1 Information Architecture 1 Task Analysis 1 Focus Groups 1 Participatory Design Education Georgia Institute of Technology Master's 2007  – 2007 Technische Universität Dresden Diplom 2001  – 2006 Georgia Institute of Technology Master's 2007  – 2007 Georgia Institute of Technology Master's 2007  – 2007 Georgia Institute of Technology Master's 2007  – 2007 Technische Universität Dresden Diplom 2001  – 2006 Technische Universität Dresden Diplom 2001  – 2006 Technische Universität Dresden Diplom 2001  – 2006 ", "Experience Senior User Experience Researcher & Research Lead, Payments Products Google December 2013  – Present (1 year 8 months) San Francisco Bay Area ~Technical Lead, Commerce Research Group (Payments, Shopping, Travel) \n~Technical Lead (UX) & Manager (Research), Payments Products at Google. \n \nPayments Products includes consumer-facing products such as Google Wallet (USA) and BebaPay (Kenya) as well as all other money-in/money-out-related product experiences -- experiences that face consumers, advertisers, and publishers, via, e.g., the Play Store, AdSense, AdWords, etc. Postdoctoral Fellow Cornell University September 2012  – Present (2 years 11 months) Continuing my academic research in my spare time (see Publications, below). User Experience Researcher Google/YouTube September 2012  –  December 2013  (1 year 4 months) San Bruno, CA I manage word-wide, strategic user survey projects and lead all tactical and strategic user research for the Creator Platform. (Open) 1 project YouTube Capture YouTube Capture is an iOS application for quickly and easily shooting, editing, uploading and sharing videos. v1 (released December 2012) won a Webby Award for Best use of Device Camera. v2 was released in November, 2013. View (Open) 1 recommendation Jason Toff GM at Vine Josh is the best User Experience Researcher that I've worked with in 5+ years at Google. He is experienced, knowledgable, thorough, straightforward, and one of the hardest workers I have ever met. He'd be an absolute asset to any team lucky enough... View Graduate Student Researcher University of Washington August 2009  –  July 2012  (3 years) Earned my PhD in Social & Personality Psychology. Dissertation title: \"You are what you emote: Emotional facial expressions impact sexual orientation judgments.\" User Experience Researcher (Intern) YouTube June 2011  –  June 2012  (1 year 1 month) San Bruno, CA User Experience Researcher (contract) Microsoft Corporation June 2010  –  June 2011  (1 year 1 month) User experience researcher & usability consultant for Microsoft FUSE Labs. Lab Manager Cornell University May 2008  –  May 2009  (1 year 1 month) Supervised and guided all operations for Dr. Vivian Zayas' Personality, Attachment, and Control Laboratory. Designed and implemented behavioral and electroencephalograph (EEG) studies. Taught practical and theoretical research methods to over 15 undergraduate research assistants. Senior User Experience Researcher & Research Lead, Payments Products Google December 2013  – Present (1 year 8 months) San Francisco Bay Area ~Technical Lead, Commerce Research Group (Payments, Shopping, Travel) \n~Technical Lead (UX) & Manager (Research), Payments Products at Google. \n \nPayments Products includes consumer-facing products such as Google Wallet (USA) and BebaPay (Kenya) as well as all other money-in/money-out-related product experiences -- experiences that face consumers, advertisers, and publishers, via, e.g., the Play Store, AdSense, AdWords, etc. Senior User Experience Researcher & Research Lead, Payments Products Google December 2013  – Present (1 year 8 months) San Francisco Bay Area ~Technical Lead, Commerce Research Group (Payments, Shopping, Travel) \n~Technical Lead (UX) & Manager (Research), Payments Products at Google. \n \nPayments Products includes consumer-facing products such as Google Wallet (USA) and BebaPay (Kenya) as well as all other money-in/money-out-related product experiences -- experiences that face consumers, advertisers, and publishers, via, e.g., the Play Store, AdSense, AdWords, etc. Postdoctoral Fellow Cornell University September 2012  – Present (2 years 11 months) Continuing my academic research in my spare time (see Publications, below). Postdoctoral Fellow Cornell University September 2012  – Present (2 years 11 months) Continuing my academic research in my spare time (see Publications, below). User Experience Researcher Google/YouTube September 2012  –  December 2013  (1 year 4 months) San Bruno, CA I manage word-wide, strategic user survey projects and lead all tactical and strategic user research for the Creator Platform. (Open) 1 project YouTube Capture YouTube Capture is an iOS application for quickly and easily shooting, editing, uploading and sharing videos. v1 (released December 2012) won a Webby Award for Best use of Device Camera. v2 was released in November, 2013. View (Open) 1 recommendation Jason Toff GM at Vine Josh is the best User Experience Researcher that I've worked with in 5+ years at Google. He is experienced, knowledgable, thorough, straightforward, and one of the hardest workers I have ever met. He'd be an absolute asset to any team lucky enough... View User Experience Researcher Google/YouTube September 2012  –  December 2013  (1 year 4 months) San Bruno, CA I manage word-wide, strategic user survey projects and lead all tactical and strategic user research for the Creator Platform. (Open) 1 project YouTube Capture YouTube Capture is an iOS application for quickly and easily shooting, editing, uploading and sharing videos. v1 (released December 2012) won a Webby Award for Best use of Device Camera. v2 was released in November, 2013. View (Open) 1 recommendation Jason Toff GM at Vine Josh is the best User Experience Researcher that I've worked with in 5+ years at Google. He is experienced, knowledgable, thorough, straightforward, and one of the hardest workers I have ever met. He'd be an absolute asset to any team lucky enough... View Graduate Student Researcher University of Washington August 2009  –  July 2012  (3 years) Earned my PhD in Social & Personality Psychology. Dissertation title: \"You are what you emote: Emotional facial expressions impact sexual orientation judgments.\" Graduate Student Researcher University of Washington August 2009  –  July 2012  (3 years) Earned my PhD in Social & Personality Psychology. Dissertation title: \"You are what you emote: Emotional facial expressions impact sexual orientation judgments.\" User Experience Researcher (Intern) YouTube June 2011  –  June 2012  (1 year 1 month) San Bruno, CA User Experience Researcher (Intern) YouTube June 2011  –  June 2012  (1 year 1 month) San Bruno, CA User Experience Researcher (contract) Microsoft Corporation June 2010  –  June 2011  (1 year 1 month) User experience researcher & usability consultant for Microsoft FUSE Labs. User Experience Researcher (contract) Microsoft Corporation June 2010  –  June 2011  (1 year 1 month) User experience researcher & usability consultant for Microsoft FUSE Labs. Lab Manager Cornell University May 2008  –  May 2009  (1 year 1 month) Supervised and guided all operations for Dr. Vivian Zayas' Personality, Attachment, and Control Laboratory. Designed and implemented behavioral and electroencephalograph (EEG) studies. Taught practical and theoretical research methods to over 15 undergraduate research assistants. Lab Manager Cornell University May 2008  –  May 2009  (1 year 1 month) Supervised and guided all operations for Dr. Vivian Zayas' Personality, Attachment, and Control Laboratory. Designed and implemented behavioral and electroencephalograph (EEG) studies. Taught practical and theoretical research methods to over 15 undergraduate research assistants. Languages Spanish Spanish Spanish Skills Top Skills 12 Experimental Design 11 User Experience 9 Statistics 9 SPSS 8 Research Design 7 Data Analysis 6 Research 4 Psychology 4 Human Computer... 4 Qualitative Research Joshua also knows about... 4 Survey Design 2 Usability Testing 2 User-centered Design 2 Matlab 2 User Experience Design 2 Survey Research 2 Strategy 2 Analysis Skills  Top Skills 12 Experimental Design 11 User Experience 9 Statistics 9 SPSS 8 Research Design 7 Data Analysis 6 Research 4 Psychology 4 Human Computer... 4 Qualitative Research Joshua also knows about... 4 Survey Design 2 Usability Testing 2 User-centered Design 2 Matlab 2 User Experience Design 2 Survey Research 2 Strategy 2 Analysis Top Skills 12 Experimental Design 11 User Experience 9 Statistics 9 SPSS 8 Research Design 7 Data Analysis 6 Research 4 Psychology 4 Human Computer... 4 Qualitative Research Joshua also knows about... 4 Survey Design 2 Usability Testing 2 User-centered Design 2 Matlab 2 User Experience Design 2 Survey Research 2 Strategy 2 Analysis Top Skills 12 Experimental Design 11 User Experience 9 Statistics 9 SPSS 8 Research Design 7 Data Analysis 6 Research 4 Psychology 4 Human Computer... 4 Qualitative Research Joshua also knows about... 4 Survey Design 2 Usability Testing 2 User-centered Design 2 Matlab 2 User Experience Design 2 Survey Research 2 Strategy 2 Analysis                     4 Survey Design 2 Usability Testing 2 User-centered Design 2 Matlab 2 User Experience Design 2 Survey Research 2 Strategy 2 Analysis Education University of Washington Ph.D.,  Social & Personality Psychology 2009  – 2012 Funded by a National Science Foundation Graduate Research Fellowship. Research specialty: snap judgments & impression formation. Expected graduation: Summer 2012. (Open) 1 recommendation Kevin King Associate Professor at University of Washington Joshua has outstanding quantitative skills that should make him valuable in any organization. He has the ability to conceptualize research questions in ways that are sophisticated and original, but also to communicate those questions and his... View Cornell University B.A.,  Psychology ,  Cognitive Science 2006  – 2009 Summa Cum Laude in Psychology Activities and Societies:  Resident Advisor ,  Hillel Programmer ,  Community Center Funding Board (chair) University of Washington Ph.D.,  Social & Personality Psychology 2009  – 2012 Funded by a National Science Foundation Graduate Research Fellowship. Research specialty: snap judgments & impression formation. Expected graduation: Summer 2012. (Open) 1 recommendation Kevin King Associate Professor at University of Washington Joshua has outstanding quantitative skills that should make him valuable in any organization. He has the ability to conceptualize research questions in ways that are sophisticated and original, but also to communicate those questions and his... View University of Washington Ph.D.,  Social & Personality Psychology 2009  – 2012 Funded by a National Science Foundation Graduate Research Fellowship. Research specialty: snap judgments & impression formation. Expected graduation: Summer 2012. (Open) 1 recommendation Kevin King Associate Professor at University of Washington Joshua has outstanding quantitative skills that should make him valuable in any organization. He has the ability to conceptualize research questions in ways that are sophisticated and original, but also to communicate those questions and his... View University of Washington Ph.D.,  Social & Personality Psychology 2009  – 2012 Funded by a National Science Foundation Graduate Research Fellowship. Research specialty: snap judgments & impression formation. Expected graduation: Summer 2012. (Open) 1 recommendation Kevin King Associate Professor at University of Washington Joshua has outstanding quantitative skills that should make him valuable in any organization. He has the ability to conceptualize research questions in ways that are sophisticated and original, but also to communicate those questions and his... View Cornell University B.A.,  Psychology ,  Cognitive Science 2006  – 2009 Summa Cum Laude in Psychology Activities and Societies:  Resident Advisor ,  Hillel Programmer ,  Community Center Funding Board (chair) Cornell University B.A.,  Psychology ,  Cognitive Science 2006  – 2009 Summa Cum Laude in Psychology Activities and Societies:  Resident Advisor ,  Hillel Programmer ,  Community Center Funding Board (chair) Cornell University B.A.,  Psychology ,  Cognitive Science 2006  – 2009 Summa Cum Laude in Psychology Activities and Societies:  Resident Advisor ,  Hillel Programmer ,  Community Center Funding Board (chair) Honors & Awards Additional Honors & Awards Graduate Research Fellowship, National Science Foundation, 2010-2013. \nSumma cum laude, Department of Psychology, Cornell University, 2009. \nDistinction in all subjects, College of Arts and Sciences, Cornell University, 2009. Additional Honors & Awards Graduate Research Fellowship, National Science Foundation, 2010-2013. \nSumma cum laude, Department of Psychology, Cornell University, 2009. \nDistinction in all subjects, College of Arts and Sciences, Cornell University, 2009. Additional Honors & Awards Graduate Research Fellowship, National Science Foundation, 2010-2013. \nSumma cum laude, Department of Psychology, Cornell University, 2009. \nDistinction in all subjects, College of Arts and Sciences, Cornell University, 2009. Additional Honors & Awards Graduate Research Fellowship, National Science Foundation, 2010-2013. \nSumma cum laude, Department of Psychology, Cornell University, 2009. \nDistinction in all subjects, College of Arts and Sciences, Cornell University, 2009. ", "Summary Usability, user experience, interaction design, research and information visualization. Specialties:Cognitive Walkthrough \nHeuristic Evaluation \nContextual Inquiry \nEthnography \nThink-aloud \nPrototyping \nDiary Study \nField Study \nFocus Group \nCultural Probe \nUsability Testing \nParticipatory Design \nInformation Visualization Summary Usability, user experience, interaction design, research and information visualization. Specialties:Cognitive Walkthrough \nHeuristic Evaluation \nContextual Inquiry \nEthnography \nThink-aloud \nPrototyping \nDiary Study \nField Study \nFocus Group \nCultural Probe \nUsability Testing \nParticipatory Design \nInformation Visualization Usability, user experience, interaction design, research and information visualization. Specialties:Cognitive Walkthrough \nHeuristic Evaluation \nContextual Inquiry \nEthnography \nThink-aloud \nPrototyping \nDiary Study \nField Study \nFocus Group \nCultural Probe \nUsability Testing \nParticipatory Design \nInformation Visualization Usability, user experience, interaction design, research and information visualization. Specialties:Cognitive Walkthrough \nHeuristic Evaluation \nContextual Inquiry \nEthnography \nThink-aloud \nPrototyping \nDiary Study \nField Study \nFocus Group \nCultural Probe \nUsability Testing \nParticipatory Design \nInformation Visualization Experience User Experience Researcher Google April 2012  – Present (3 years 4 months) Greater Los Angeles Area Evaluate all features contributing to user experience, identify product and use requirements, and analyze user behavior through a mix of formative and evaluative research. Evangelize research findings to diverse audience through written, visual and oral presentations. Collaborate with user interface designers, product managers and engineers to improve product features and develop new ones. Strive to make a user's experience feel more intuitive, accessible and fun. \n \nFormerly worked on Gmail and Inbox by Gmail. Currently working on displays ads, programmatic and brand advertising. Graduate Student Researcher UC Irvine September 2004  –  September 2011  (7 years 1 month) Irvine, CA Designed, deployed and studied interactive and collaborative technologies, including a mobile phone photo sharing system, a public display that visualizes patterns of instant messaging and physical presence, a photo display installation, and visualizations of Twitter status messages. Used performance as an analytical lens for understanding experiences with public information visualization displays and explored how public displays shift social interaction through their mediation. Researcher [Intern] Microsoft Research October 2007  –  February 2008  (5 months) Designed, deployed and studied an interactive photo display, exploring the intimacy between a display and the space in which it is situated, the representation of presence, and provocative photo displays. Also designed and built a tangible interface for navigating through large archives of photos. Online Product Support Coordinator Google February 2004  –  October 2004  (9 months) Troubleshot technical problems for webmasters and Google Toolbar users, escalated bug reports for Google services, communicated user feedback to the engineering and product teams, monitored customer feedback and product performance, responded to user email inquiries, and launched the Online Product Support intranet website. User Experience Researcher [Intern] Google June 2004  –  September 2004  (4 months) Conducted user research studies to assess the usability of Google Print, Google Pack, and Google Base. Conducted a large ethnographic study that examined the use of communication tools in the workplace. Programming Intern Sony Pictures Entertainment June 2002  –  August 2002  (3 months) Devised a central tracking system that examines and analyzes usage statistics of video clips found on the Sony Pictures website. User Experience Researcher Google April 2012  – Present (3 years 4 months) Greater Los Angeles Area Evaluate all features contributing to user experience, identify product and use requirements, and analyze user behavior through a mix of formative and evaluative research. Evangelize research findings to diverse audience through written, visual and oral presentations. Collaborate with user interface designers, product managers and engineers to improve product features and develop new ones. Strive to make a user's experience feel more intuitive, accessible and fun. \n \nFormerly worked on Gmail and Inbox by Gmail. Currently working on displays ads, programmatic and brand advertising. User Experience Researcher Google April 2012  – Present (3 years 4 months) Greater Los Angeles Area Evaluate all features contributing to user experience, identify product and use requirements, and analyze user behavior through a mix of formative and evaluative research. Evangelize research findings to diverse audience through written, visual and oral presentations. Collaborate with user interface designers, product managers and engineers to improve product features and develop new ones. Strive to make a user's experience feel more intuitive, accessible and fun. \n \nFormerly worked on Gmail and Inbox by Gmail. Currently working on displays ads, programmatic and brand advertising. Graduate Student Researcher UC Irvine September 2004  –  September 2011  (7 years 1 month) Irvine, CA Designed, deployed and studied interactive and collaborative technologies, including a mobile phone photo sharing system, a public display that visualizes patterns of instant messaging and physical presence, a photo display installation, and visualizations of Twitter status messages. Used performance as an analytical lens for understanding experiences with public information visualization displays and explored how public displays shift social interaction through their mediation. Graduate Student Researcher UC Irvine September 2004  –  September 2011  (7 years 1 month) Irvine, CA Designed, deployed and studied interactive and collaborative technologies, including a mobile phone photo sharing system, a public display that visualizes patterns of instant messaging and physical presence, a photo display installation, and visualizations of Twitter status messages. Used performance as an analytical lens for understanding experiences with public information visualization displays and explored how public displays shift social interaction through their mediation. Researcher [Intern] Microsoft Research October 2007  –  February 2008  (5 months) Designed, deployed and studied an interactive photo display, exploring the intimacy between a display and the space in which it is situated, the representation of presence, and provocative photo displays. Also designed and built a tangible interface for navigating through large archives of photos. Researcher [Intern] Microsoft Research October 2007  –  February 2008  (5 months) Designed, deployed and studied an interactive photo display, exploring the intimacy between a display and the space in which it is situated, the representation of presence, and provocative photo displays. Also designed and built a tangible interface for navigating through large archives of photos. Online Product Support Coordinator Google February 2004  –  October 2004  (9 months) Troubleshot technical problems for webmasters and Google Toolbar users, escalated bug reports for Google services, communicated user feedback to the engineering and product teams, monitored customer feedback and product performance, responded to user email inquiries, and launched the Online Product Support intranet website. Online Product Support Coordinator Google February 2004  –  October 2004  (9 months) Troubleshot technical problems for webmasters and Google Toolbar users, escalated bug reports for Google services, communicated user feedback to the engineering and product teams, monitored customer feedback and product performance, responded to user email inquiries, and launched the Online Product Support intranet website. User Experience Researcher [Intern] Google June 2004  –  September 2004  (4 months) Conducted user research studies to assess the usability of Google Print, Google Pack, and Google Base. Conducted a large ethnographic study that examined the use of communication tools in the workplace. User Experience Researcher [Intern] Google June 2004  –  September 2004  (4 months) Conducted user research studies to assess the usability of Google Print, Google Pack, and Google Base. Conducted a large ethnographic study that examined the use of communication tools in the workplace. Programming Intern Sony Pictures Entertainment June 2002  –  August 2002  (3 months) Devised a central tracking system that examines and analyzes usage statistics of video clips found on the Sony Pictures website. Programming Intern Sony Pictures Entertainment June 2002  –  August 2002  (3 months) Devised a central tracking system that examines and analyzes usage statistics of video clips found on the Sony Pictures website. Languages English Native or bilingual proficiency Mandarin Native or bilingual proficiency Taiwanese Limited working proficiency Spanish Limited working proficiency English Native or bilingual proficiency Mandarin Native or bilingual proficiency Taiwanese Limited working proficiency Spanish Limited working proficiency English Native or bilingual proficiency Mandarin Native or bilingual proficiency Taiwanese Limited working proficiency Spanish Limited working proficiency Native or bilingual proficiency Native or bilingual proficiency Limited working proficiency Limited working proficiency Skills Top Skills 11 Usability Testing 7 Heuristic Evaluation 6 Contextual Inquiry 4 Human Computer... 4 Usability 3 Ethnography 3 Interaction Design 1 Participatory Design 1 Information... 1 Cognitive Walkthrough Judy also knows about... 1 Focus Groups 1 User-centered Design 1 Python 0 Field Studies Skills  Top Skills 11 Usability Testing 7 Heuristic Evaluation 6 Contextual Inquiry 4 Human Computer... 4 Usability 3 Ethnography 3 Interaction Design 1 Participatory Design 1 Information... 1 Cognitive Walkthrough Judy also knows about... 1 Focus Groups 1 User-centered Design 1 Python 0 Field Studies Top Skills 11 Usability Testing 7 Heuristic Evaluation 6 Contextual Inquiry 4 Human Computer... 4 Usability 3 Ethnography 3 Interaction Design 1 Participatory Design 1 Information... 1 Cognitive Walkthrough Judy also knows about... 1 Focus Groups 1 User-centered Design 1 Python 0 Field Studies Top Skills 11 Usability Testing 7 Heuristic Evaluation 6 Contextual Inquiry 4 Human Computer... 4 Usability 3 Ethnography 3 Interaction Design 1 Participatory Design 1 Information... 1 Cognitive Walkthrough Judy also knows about... 1 Focus Groups 1 User-centered Design 1 Python 0 Field Studies                     1 Focus Groups 1 User-centered Design 1 Python 0 Field Studies Education University of California, Irvine PhD,  Information and Computer Science 2006  – 2011 University of California, Irvine M.S.,  Information and Computer Science 2004  – 2006 University of California, Berkeley B.A.,  Computer Science 1999  – 2003 University of California, Irvine PhD,  Information and Computer Science 2006  – 2011 University of California, Irvine PhD,  Information and Computer Science 2006  – 2011 University of California, Irvine PhD,  Information and Computer Science 2006  – 2011 University of California, Irvine M.S.,  Information and Computer Science 2004  – 2006 University of California, Irvine M.S.,  Information and Computer Science 2004  – 2006 University of California, Irvine M.S.,  Information and Computer Science 2004  – 2006 University of California, Berkeley B.A.,  Computer Science 1999  – 2003 University of California, Berkeley B.A.,  Computer Science 1999  – 2003 University of California, Berkeley B.A.,  Computer Science 1999  – 2003 ", "Summary I apply mixed-methods HCI research methods to user experience research, combining large-scale data analysis with in-depth interviews and user studies. I specialize in multi-user systems such as social networks. Specialties:human-computer interaction, distributed collaboration, persuasive technology, interaction design, machine learning Summary I apply mixed-methods HCI research methods to user experience research, combining large-scale data analysis with in-depth interviews and user studies. I specialize in multi-user systems such as social networks. Specialties:human-computer interaction, distributed collaboration, persuasive technology, interaction design, machine learning I apply mixed-methods HCI research methods to user experience research, combining large-scale data analysis with in-depth interviews and user studies. I specialize in multi-user systems such as social networks. Specialties:human-computer interaction, distributed collaboration, persuasive technology, interaction design, machine learning I apply mixed-methods HCI research methods to user experience research, combining large-scale data analysis with in-depth interviews and user studies. I specialize in multi-user systems such as social networks. Specialties:human-computer interaction, distributed collaboration, persuasive technology, interaction design, machine learning Experience Senior User Experience Researcher Google July 2014  – Present (1 year 1 month) Mountain View, CA On the Knowledge UX Research at Scale team, working on ways to do user research with larger and more representative samples and supporting product direction for Google Maps, Search, and identity products. User Experience Researcher Google November 2010  –  June 2014  (3 years 8 months) Mountain View, CA Research focus on online communities, internationalization, and Google's social products. Tactical and formative research to inform product direction on Google+. This included usability studies, fieldwork in the Bay Area, Brazil, and Malaysia, and logs analysis. Research Scientist Hewlett-Packard Laboratories August 2006  –  October 2010  (4 years 3 months) Research interests in social network dynamics, persuasive social computing, and emergent folksonomies. Created and manage an internal social network service and social media platform for HP employees. (Open) 1 recommendation Tim Chambers Senior Software Engineer at JDSU Mike and I worked together in HP's internal social media community. You can read for yourself the writeups of the system he invented, WaterCooler (google \"HP WaterCooler\"). Inside HP, Mike has been an effective promoter of social media and a dynamic... View Course Advisor Stanford University September 2004  –  June 2006  (1 year 10 months) Provided academic counseling to computer science students, coordinated departmental peer advising program, helped shape curricula for undergraduate and master's students. Residential Computer Consultant Stanford University September 2004  –  June 2006  (1 year 10 months) Senior User Experience Researcher Google July 2014  – Present (1 year 1 month) Mountain View, CA On the Knowledge UX Research at Scale team, working on ways to do user research with larger and more representative samples and supporting product direction for Google Maps, Search, and identity products. Senior User Experience Researcher Google July 2014  – Present (1 year 1 month) Mountain View, CA On the Knowledge UX Research at Scale team, working on ways to do user research with larger and more representative samples and supporting product direction for Google Maps, Search, and identity products. User Experience Researcher Google November 2010  –  June 2014  (3 years 8 months) Mountain View, CA Research focus on online communities, internationalization, and Google's social products. Tactical and formative research to inform product direction on Google+. This included usability studies, fieldwork in the Bay Area, Brazil, and Malaysia, and logs analysis. User Experience Researcher Google November 2010  –  June 2014  (3 years 8 months) Mountain View, CA Research focus on online communities, internationalization, and Google's social products. Tactical and formative research to inform product direction on Google+. This included usability studies, fieldwork in the Bay Area, Brazil, and Malaysia, and logs analysis. Research Scientist Hewlett-Packard Laboratories August 2006  –  October 2010  (4 years 3 months) Research interests in social network dynamics, persuasive social computing, and emergent folksonomies. Created and manage an internal social network service and social media platform for HP employees. (Open) 1 recommendation Tim Chambers Senior Software Engineer at JDSU Mike and I worked together in HP's internal social media community. You can read for yourself the writeups of the system he invented, WaterCooler (google \"HP WaterCooler\"). Inside HP, Mike has been an effective promoter of social media and a dynamic... View Research Scientist Hewlett-Packard Laboratories August 2006  –  October 2010  (4 years 3 months) Research interests in social network dynamics, persuasive social computing, and emergent folksonomies. Created and manage an internal social network service and social media platform for HP employees. (Open) 1 recommendation Tim Chambers Senior Software Engineer at JDSU Mike and I worked together in HP's internal social media community. You can read for yourself the writeups of the system he invented, WaterCooler (google \"HP WaterCooler\"). Inside HP, Mike has been an effective promoter of social media and a dynamic... View Course Advisor Stanford University September 2004  –  June 2006  (1 year 10 months) Provided academic counseling to computer science students, coordinated departmental peer advising program, helped shape curricula for undergraduate and master's students. Course Advisor Stanford University September 2004  –  June 2006  (1 year 10 months) Provided academic counseling to computer science students, coordinated departmental peer advising program, helped shape curricula for undergraduate and master's students. Residential Computer Consultant Stanford University September 2004  –  June 2006  (1 year 10 months) Residential Computer Consultant Stanford University September 2004  –  June 2006  (1 year 10 months) Languages English Native or bilingual proficiency Japanese Limited working proficiency Spanish Limited working proficiency English Native or bilingual proficiency Japanese Limited working proficiency Spanish Limited working proficiency English Native or bilingual proficiency Japanese Limited working proficiency Spanish Limited working proficiency Native or bilingual proficiency Limited working proficiency Limited working proficiency Skills Top Skills 27 Human Computer... 14 User Experience 10 Computer Science 8 User Interface Design 7 Interaction Design 7 User-centered Design 6 Artificial Intelligence 5 User Research 4 Machine Learning 4 Algorithms Mike also knows about... 4 Usability Testing 3 Java 2 R 2 Data Visualization 2 Contextual Inquiry 1 Natural Language... 1 MySQL 1 Enterprise Social... 1 Schemas 1 Data Mining 1 Information Retrieval 1 User Interface 0 HCI Skills  Top Skills 27 Human Computer... 14 User Experience 10 Computer Science 8 User Interface Design 7 Interaction Design 7 User-centered Design 6 Artificial Intelligence 5 User Research 4 Machine Learning 4 Algorithms Mike also knows about... 4 Usability Testing 3 Java 2 R 2 Data Visualization 2 Contextual Inquiry 1 Natural Language... 1 MySQL 1 Enterprise Social... 1 Schemas 1 Data Mining 1 Information Retrieval 1 User Interface 0 HCI Top Skills 27 Human Computer... 14 User Experience 10 Computer Science 8 User Interface Design 7 Interaction Design 7 User-centered Design 6 Artificial Intelligence 5 User Research 4 Machine Learning 4 Algorithms Mike also knows about... 4 Usability Testing 3 Java 2 R 2 Data Visualization 2 Contextual Inquiry 1 Natural Language... 1 MySQL 1 Enterprise Social... 1 Schemas 1 Data Mining 1 Information Retrieval 1 User Interface 0 HCI Top Skills 27 Human Computer... 14 User Experience 10 Computer Science 8 User Interface Design 7 Interaction Design 7 User-centered Design 6 Artificial Intelligence 5 User Research 4 Machine Learning 4 Algorithms Mike also knows about... 4 Usability Testing 3 Java 2 R 2 Data Visualization 2 Contextual Inquiry 1 Natural Language... 1 MySQL 1 Enterprise Social... 1 Schemas 1 Data Mining 1 Information Retrieval 1 User Interface 0 HCI                     4 Usability Testing 3 Java 2 R 2 Data Visualization 2 Contextual Inquiry 1 Natural Language... 1 MySQL 1 Enterprise Social... 1 Schemas 1 Data Mining 1 Information Retrieval 1 User Interface 0 HCI Education Stanford University MS,  Computer Science ,  Human-Computer Interaction 2004  – 2006 Distinction in research; joint thesis work with AI and HCI groups on probabilistic group scheduling published at CHI 2006. Activities and Societies:  Viennese Ball groupTime: preference based group scheduling Edit Stanford University MS,  Computer Science ,  Human-Computer Interaction 2004  – 2006 Distinction in research; joint thesis work with AI and HCI groups on probabilistic group scheduling published at CHI 2006. Activities and Societies:  Viennese Ball groupTime: preference based group scheduling Edit Stanford University MS,  Computer Science ,  Human-Computer Interaction 2004  – 2006 Distinction in research; joint thesis work with AI and HCI groups on probabilistic group scheduling published at CHI 2006. Activities and Societies:  Viennese Ball Stanford University MS,  Computer Science ,  Human-Computer Interaction 2004  – 2006 Distinction in research; joint thesis work with AI and HCI groups on probabilistic group scheduling published at CHI 2006. Activities and Societies:  Viennese Ball groupTime: preference based group scheduling Edit groupTime: preference based group scheduling Edit groupTime: preference based group scheduling Edit groupTime: preference based group scheduling  groupTime: preference based group scheduling  ", "Summary Javier Bargas-Avila holds a PhD in Cognitive Psychology. Before joining Google in 2011, he was the manager of the HCI lab at the University of Basel (Switzerland). He published over 25 peer reviewed papers in HCI journals and conferences covering topics such as user satisfaction, mental models in website perception, website aesthetics, first visual impression of websites or webform usability. Since 2012 he leads the YouTube Ads UX research team, where he currently focuses his work on advertising and internationalization. \n \nSpecialties: user studies, usability studies, user experience, experimental studies, cognitive psychology, online surveys, online experiments, user satisfaction, web form usability, aesthetics, usability Summary Javier Bargas-Avila holds a PhD in Cognitive Psychology. Before joining Google in 2011, he was the manager of the HCI lab at the University of Basel (Switzerland). He published over 25 peer reviewed papers in HCI journals and conferences covering topics such as user satisfaction, mental models in website perception, website aesthetics, first visual impression of websites or webform usability. Since 2012 he leads the YouTube Ads UX research team, where he currently focuses his work on advertising and internationalization. \n \nSpecialties: user studies, usability studies, user experience, experimental studies, cognitive psychology, online surveys, online experiments, user satisfaction, web form usability, aesthetics, usability Javier Bargas-Avila holds a PhD in Cognitive Psychology. Before joining Google in 2011, he was the manager of the HCI lab at the University of Basel (Switzerland). He published over 25 peer reviewed papers in HCI journals and conferences covering topics such as user satisfaction, mental models in website perception, website aesthetics, first visual impression of websites or webform usability. Since 2012 he leads the YouTube Ads UX research team, where he currently focuses his work on advertising and internationalization. \n \nSpecialties: user studies, usability studies, user experience, experimental studies, cognitive psychology, online surveys, online experiments, user satisfaction, web form usability, aesthetics, usability Javier Bargas-Avila holds a PhD in Cognitive Psychology. Before joining Google in 2011, he was the manager of the HCI lab at the University of Basel (Switzerland). He published over 25 peer reviewed papers in HCI journals and conferences covering topics such as user satisfaction, mental models in website perception, website aesthetics, first visual impression of websites or webform usability. Since 2012 he leads the YouTube Ads UX research team, where he currently focuses his work on advertising and internationalization. \n \nSpecialties: user studies, usability studies, user experience, experimental studies, cognitive psychology, online surveys, online experiments, user satisfaction, web form usability, aesthetics, usability Experience Staff User Experience Researcher & Manager Google June 2013  – Present (2 years 2 months) Zürich Area, Switzerland Conduct and manage research for YouTube Ads and internationalization Senior User Experience Researcher & Manager Google September 2012  –  May 2013  (9 months) Zürich Area, Switzerland Conduct and manage research for YouTube (advertisement, internationalization, creators) Senior User Experience Researcher Google April 2011  –  September 2012  (1 year 6 months) Zürich Area, Switzerland Working as UX researcher on YouTube Head of HCI research group University of Basel 2004  –  March 2011  (7 years) Leading the HCI research group at the University of Basel. Conduct research, define the curriculum for the HCI master, teach, provide services to companies. (Open) 1 recommendation Andreas Eggimann Head of Digital Management at Die Schweizerische Post Javier has a top-notch knowledge of UX and was of great help, when we needed constructive criticism in our web projects. He is what any customer hopes for, when he hires a consultant. He is positive, focused, reliable and delivers excellent results.... View Senior Consultant Stimmt AG 2001  –  2004  (3 years) UX Consulting Staff User Experience Researcher & Manager Google June 2013  – Present (2 years 2 months) Zürich Area, Switzerland Conduct and manage research for YouTube Ads and internationalization Staff User Experience Researcher & Manager Google June 2013  – Present (2 years 2 months) Zürich Area, Switzerland Conduct and manage research for YouTube Ads and internationalization Senior User Experience Researcher & Manager Google September 2012  –  May 2013  (9 months) Zürich Area, Switzerland Conduct and manage research for YouTube (advertisement, internationalization, creators) Senior User Experience Researcher & Manager Google September 2012  –  May 2013  (9 months) Zürich Area, Switzerland Conduct and manage research for YouTube (advertisement, internationalization, creators) Senior User Experience Researcher Google April 2011  –  September 2012  (1 year 6 months) Zürich Area, Switzerland Working as UX researcher on YouTube Senior User Experience Researcher Google April 2011  –  September 2012  (1 year 6 months) Zürich Area, Switzerland Working as UX researcher on YouTube Head of HCI research group University of Basel 2004  –  March 2011  (7 years) Leading the HCI research group at the University of Basel. Conduct research, define the curriculum for the HCI master, teach, provide services to companies. (Open) 1 recommendation Andreas Eggimann Head of Digital Management at Die Schweizerische Post Javier has a top-notch knowledge of UX and was of great help, when we needed constructive criticism in our web projects. He is what any customer hopes for, when he hires a consultant. He is positive, focused, reliable and delivers excellent results.... View Head of HCI research group University of Basel 2004  –  March 2011  (7 years) Leading the HCI research group at the University of Basel. Conduct research, define the curriculum for the HCI master, teach, provide services to companies. (Open) 1 recommendation Andreas Eggimann Head of Digital Management at Die Schweizerische Post Javier has a top-notch knowledge of UX and was of great help, when we needed constructive criticism in our web projects. He is what any customer hopes for, when he hires a consultant. He is positive, focused, reliable and delivers excellent results.... View Senior Consultant Stimmt AG 2001  –  2004  (3 years) UX Consulting Senior Consultant Stimmt AG 2001  –  2004  (3 years) UX Consulting Languages English Full professional proficiency German Native or bilingual proficiency Spanish Native or bilingual proficiency Swiss-German Native or bilingual proficiency French Elementary proficiency English Full professional proficiency German Native or bilingual proficiency Spanish Native or bilingual proficiency Swiss-German Native or bilingual proficiency French Elementary proficiency English Full professional proficiency German Native or bilingual proficiency Spanish Native or bilingual proficiency Swiss-German Native or bilingual proficiency French Elementary proficiency Full professional proficiency Native or bilingual proficiency Native or bilingual proficiency Native or bilingual proficiency Elementary proficiency Skills Top Skills 59 Human Computer... 55 Usability Testing 42 Usability 41 User Research 35 User Experience 18 User-centered Design 14 Research 13 Cognitive Psychology 12 Task Analysis 10 Heuristic Evaluation Javier Andrés also knows about... 10 Usability Engineering 9 Psychology 9 Card Sorting 7 Information Architecture 5 Statistics 5 Survey Design 4 Teaching 4 Contextual Inquiry 4 User Interface Design 3 Interaction Design 2 Human-computer... 0 User Satisfaction Skills  Top Skills 59 Human Computer... 55 Usability Testing 42 Usability 41 User Research 35 User Experience 18 User-centered Design 14 Research 13 Cognitive Psychology 12 Task Analysis 10 Heuristic Evaluation Javier Andrés also knows about... 10 Usability Engineering 9 Psychology 9 Card Sorting 7 Information Architecture 5 Statistics 5 Survey Design 4 Teaching 4 Contextual Inquiry 4 User Interface Design 3 Interaction Design 2 Human-computer... 0 User Satisfaction Top Skills 59 Human Computer... 55 Usability Testing 42 Usability 41 User Research 35 User Experience 18 User-centered Design 14 Research 13 Cognitive Psychology 12 Task Analysis 10 Heuristic Evaluation Javier Andrés also knows about... 10 Usability Engineering 9 Psychology 9 Card Sorting 7 Information Architecture 5 Statistics 5 Survey Design 4 Teaching 4 Contextual Inquiry 4 User Interface Design 3 Interaction Design 2 Human-computer... 0 User Satisfaction Top Skills 59 Human Computer... 55 Usability Testing 42 Usability 41 User Research 35 User Experience 18 User-centered Design 14 Research 13 Cognitive Psychology 12 Task Analysis 10 Heuristic Evaluation Javier Andrés also knows about... 10 Usability Engineering 9 Psychology 9 Card Sorting 7 Information Architecture 5 Statistics 5 Survey Design 4 Teaching 4 Contextual Inquiry 4 User Interface Design 3 Interaction Design 2 Human-computer... 0 User Satisfaction                     10 Usability Engineering 9 Psychology 9 Card Sorting 7 Information Architecture 5 Statistics 5 Survey Design 4 Teaching 4 Contextual Inquiry 4 User Interface Design 3 Interaction Design 2 Human-computer... 0 User Satisfaction Education Dr.,  Psychology 2004  – 2009 lic. phil.,  Psychology 1995  – 2002 Dr.,  Psychology 2004  – 2009 Dr.,  Psychology 2004  – 2009 Dr.,  Psychology 2004  – 2009 lic. phil.,  Psychology 1995  – 2002 lic. phil.,  Psychology 1995  – 2002 lic. phil.,  Psychology 1995  – 2002 ", "Experience Staff User Experience Researcher Google November 2012  – Present (2 years 9 months) Mountain View, CA Senior User Experience Researcher Google October 2009  –  November 2012  (3 years 2 months) User Experience Researcher Google August 2007  –  October 2009  (2 years 3 months) Sr. User Research Analyst, Global Market Research Adobe Systems October 2006  –  July 2007  (10 months) User Research Specialist Adobe Systems September 2003  –  September 2006  (3 years 1 month) (Open) 2 recommendations Emilio Passi User interface design and prototyping Marianne was a delight to work with. Her creative approaches to user research shed new light on how creative professionals... View Amanda McCoy Bast Sr. Experience Design Lead at Adobe Systems Marianne is a fantastic researcher who has been a great partner in design at Adobe. View Usability Consultant Marianne Berkovich Consulting March 2002  –  September 2003  (1 year 7 months) Tecnical Writer/Requirements Analyst Lockheed Martin November 1999  –  August 2000  (10 months) Staff User Experience Researcher Google November 2012  – Present (2 years 9 months) Mountain View, CA Staff User Experience Researcher Google November 2012  – Present (2 years 9 months) Mountain View, CA Senior User Experience Researcher Google October 2009  –  November 2012  (3 years 2 months) Senior User Experience Researcher Google October 2009  –  November 2012  (3 years 2 months) User Experience Researcher Google August 2007  –  October 2009  (2 years 3 months) User Experience Researcher Google August 2007  –  October 2009  (2 years 3 months) Sr. User Research Analyst, Global Market Research Adobe Systems October 2006  –  July 2007  (10 months) Sr. User Research Analyst, Global Market Research Adobe Systems October 2006  –  July 2007  (10 months) User Research Specialist Adobe Systems September 2003  –  September 2006  (3 years 1 month) (Open) 2 recommendations Emilio Passi User interface design and prototyping Marianne was a delight to work with. Her creative approaches to user research shed new light on how creative professionals... View Amanda McCoy Bast Sr. Experience Design Lead at Adobe Systems Marianne is a fantastic researcher who has been a great partner in design at Adobe. View User Research Specialist Adobe Systems September 2003  –  September 2006  (3 years 1 month) (Open) 2 recommendations Emilio Passi User interface design and prototyping Marianne was a delight to work with. Her creative approaches to user research shed new light on how creative professionals... View Amanda McCoy Bast Sr. Experience Design Lead at Adobe Systems Marianne is a fantastic researcher who has been a great partner in design at Adobe. View Usability Consultant Marianne Berkovich Consulting March 2002  –  September 2003  (1 year 7 months) Usability Consultant Marianne Berkovich Consulting March 2002  –  September 2003  (1 year 7 months) Tecnical Writer/Requirements Analyst Lockheed Martin November 1999  –  August 2000  (10 months) Tecnical Writer/Requirements Analyst Lockheed Martin November 1999  –  August 2000  (10 months) Skills Top Skills 40 User Research 20 User Experience 19 Usability 9 User-centered Design 8 Contextual Inquiry 8 Usability Testing 6 User Interface Design 5 Human Computer... 4 Heuristic Evaluation 4 User Experience Design Marianne also knows about... 3 User Interface 3 Interaction Design 3 Information Architecture 2 Persona 1 Online Advertising 1 Task Analysis 1 InDesign 1 Usability Engineering 1 User Scenarios Skills  Top Skills 40 User Research 20 User Experience 19 Usability 9 User-centered Design 8 Contextual Inquiry 8 Usability Testing 6 User Interface Design 5 Human Computer... 4 Heuristic Evaluation 4 User Experience Design Marianne also knows about... 3 User Interface 3 Interaction Design 3 Information Architecture 2 Persona 1 Online Advertising 1 Task Analysis 1 InDesign 1 Usability Engineering 1 User Scenarios Top Skills 40 User Research 20 User Experience 19 Usability 9 User-centered Design 8 Contextual Inquiry 8 Usability Testing 6 User Interface Design 5 Human Computer... 4 Heuristic Evaluation 4 User Experience Design Marianne also knows about... 3 User Interface 3 Interaction Design 3 Information Architecture 2 Persona 1 Online Advertising 1 Task Analysis 1 InDesign 1 Usability Engineering 1 User Scenarios Top Skills 40 User Research 20 User Experience 19 Usability 9 User-centered Design 8 Contextual Inquiry 8 Usability Testing 6 User Interface Design 5 Human Computer... 4 Heuristic Evaluation 4 User Experience Design Marianne also knows about... 3 User Interface 3 Interaction Design 3 Information Architecture 2 Persona 1 Online Advertising 1 Task Analysis 1 InDesign 1 Usability Engineering 1 User Scenarios                     3 User Interface 3 Interaction Design 3 Information Architecture 2 Persona 1 Online Advertising 1 Task Analysis 1 InDesign 1 Usability Engineering 1 User Scenarios Education Carnegie Mellon University MHCI,  Human Computer Interaction September 2000  – December 2001 Georgetown University BA,  English September 1991  – May 1995 University of Colorado Denver Carnegie Mellon University MHCI,  Human Computer Interaction September 2000  – December 2001 Carnegie Mellon University MHCI,  Human Computer Interaction September 2000  – December 2001 Carnegie Mellon University MHCI,  Human Computer Interaction September 2000  – December 2001 Georgetown University BA,  English September 1991  – May 1995 Georgetown University BA,  English September 1991  – May 1995 Georgetown University BA,  English September 1991  – May 1995 University of Colorado Denver University of Colorado Denver University of Colorado Denver ", "Experience Senior User Experience Researcher Google [X] March 2012  – Present (3 years 5 months) Mountain View, CA Senior user experience researcher working on several projects within the [x] lab. Including Makani, Google Glass, Smart Contact Lens project, and more. (Open) 3 projects Makani View Project Glass View Smart Contact Lens View Makani Edit Google Glass Edit Smart contact lens project Edit Unicorns, Mental Athletes, and Caged Animals (with Superpowers): A Core77 Exclusive Interview with the Design Team Behind Google X Edit Getting Hired: How to Score a Job at Google X, the Secret Lab Behind Glass and Self-Driving Cars Edit User Experience Researcher Google August 2011  –  March 2012  (8 months) Mountain View, CA News / Google+ User Experience Researcher Microsoft November 2009  –  July 2011  (1 year 9 months) Redmond, WA Office / Office Labs (Open) 1 recommendation Laura Neumann Instructor at University of Washington, HCDE department Dhvani excels at diving into a project, determining what needs doing, and getting it done. Her skills in working with teams to help them understand complex problems were also outstanding in the time she was on my team. View Member Board of Directors Safe Futures Youth Center November 2008  –  July 2010  (1 year 9 months) Greater Seattle Area Research Consultant Wugaboo LLC April 2009  –  November 2009  (8 months) Greater Seattle Area Education Policy Intern Public Education Network October 2007  –  March 2008  (6 months) Washington D.C. Metro Area Graduate Researcher George Mason University 2003  –  2007  (4 years) Fairfax, VA Conducting developmental and cognitive research with elementary school aged children on motivation, temperament, attention, and distractibility. Early Childhoood Education Intern Children's defense fund August 2004  –  January 2005  (6 months) Washington D.C. Metro Area Psychometrician Baylor College of Medicine 2002  –  2003  (1 year) Houston, Texas Area Senior User Experience Researcher Google [X] March 2012  – Present (3 years 5 months) Mountain View, CA Senior user experience researcher working on several projects within the [x] lab. Including Makani, Google Glass, Smart Contact Lens project, and more. (Open) 3 projects Makani View Project Glass View Smart Contact Lens View Makani Edit Google Glass Edit Smart contact lens project Edit Unicorns, Mental Athletes, and Caged Animals (with Superpowers): A Core77 Exclusive Interview with the Design Team Behind Google X Edit Getting Hired: How to Score a Job at Google X, the Secret Lab Behind Glass and Self-Driving Cars Edit Senior User Experience Researcher Google [X] March 2012  – Present (3 years 5 months) Mountain View, CA Senior user experience researcher working on several projects within the [x] lab. Including Makani, Google Glass, Smart Contact Lens project, and more. (Open) 3 projects Makani View Project Glass View Smart Contact Lens View Makani Edit Google Glass Edit Smart contact lens project Edit Unicorns, Mental Athletes, and Caged Animals (with Superpowers): A Core77 Exclusive Interview with the Design Team Behind Google X Edit Getting Hired: How to Score a Job at Google X, the Secret Lab Behind Glass and Self-Driving Cars Edit Makani Edit Google Glass Edit Makani Edit Makani  Makani  Google Glass Edit Google Glass  Google Glass  Smart contact lens project Edit Unicorns, Mental Athletes, and Caged Animals (with Superpowers): A Core77 Exclusive Interview with the Design Team Behind Google X Edit Getting Hired: How to Score a Job at Google X, the Secret Lab Behind Glass and Self-Driving Cars Edit Smart contact lens project Edit Smart contact lens project  Smart contact lens project  Unicorns, Mental Athletes, and Caged Animals (with Superpowers): A Core77 Exclusive Interview with the Design Team Behind Google X Edit Unicorns, Mental Athletes, and Caged Animals (with Superpowers): A Core77 Exclusive Interview with the Design Team Behind Google X  Unicorns, Mental Athletes, and Caged Animals (with Superpowers): A Core77 Exclusive Interview with the Design Team Behind Google X  Getting Hired: How to Score a Job at Google X, the Secret Lab Behind Glass and Self-Driving Cars Edit Getting Hired: How to Score a Job at Google X, the Secret Lab Behind Glass and Self-Driving Cars  Getting Hired: How to Score a Job at Google X, the Secret Lab Behind Glass and Self-Driving Cars  User Experience Researcher Google August 2011  –  March 2012  (8 months) Mountain View, CA News / Google+ User Experience Researcher Google August 2011  –  March 2012  (8 months) Mountain View, CA News / Google+ User Experience Researcher Microsoft November 2009  –  July 2011  (1 year 9 months) Redmond, WA Office / Office Labs (Open) 1 recommendation Laura Neumann Instructor at University of Washington, HCDE department Dhvani excels at diving into a project, determining what needs doing, and getting it done. Her skills in working with teams to help them understand complex problems were also outstanding in the time she was on my team. View User Experience Researcher Microsoft November 2009  –  July 2011  (1 year 9 months) Redmond, WA Office / Office Labs (Open) 1 recommendation Laura Neumann Instructor at University of Washington, HCDE department Dhvani excels at diving into a project, determining what needs doing, and getting it done. Her skills in working with teams to help them understand complex problems were also outstanding in the time she was on my team. View Member Board of Directors Safe Futures Youth Center November 2008  –  July 2010  (1 year 9 months) Greater Seattle Area Member Board of Directors Safe Futures Youth Center November 2008  –  July 2010  (1 year 9 months) Greater Seattle Area Research Consultant Wugaboo LLC April 2009  –  November 2009  (8 months) Greater Seattle Area Research Consultant Wugaboo LLC April 2009  –  November 2009  (8 months) Greater Seattle Area Education Policy Intern Public Education Network October 2007  –  March 2008  (6 months) Washington D.C. Metro Area Education Policy Intern Public Education Network October 2007  –  March 2008  (6 months) Washington D.C. Metro Area Graduate Researcher George Mason University 2003  –  2007  (4 years) Fairfax, VA Conducting developmental and cognitive research with elementary school aged children on motivation, temperament, attention, and distractibility. Graduate Researcher George Mason University 2003  –  2007  (4 years) Fairfax, VA Conducting developmental and cognitive research with elementary school aged children on motivation, temperament, attention, and distractibility. Early Childhoood Education Intern Children's defense fund August 2004  –  January 2005  (6 months) Washington D.C. Metro Area Early Childhoood Education Intern Children's defense fund August 2004  –  January 2005  (6 months) Washington D.C. Metro Area Psychometrician Baylor College of Medicine 2002  –  2003  (1 year) Houston, Texas Area Psychometrician Baylor College of Medicine 2002  –  2003  (1 year) Houston, Texas Area Languages   Skills Top Skills 47 Usability Testing 39 User Experience 17 Ethnography 16 Human Computer... 16 User Research 13 Statistics 10 Data Analysis 10 Heuristic Evaluation 9 Paper Prototyping 9 Contextual Inquiry Dhvani also knows about... 6 Storyboarding 5 Interviews 5 Interaction Design 4 Persona 3 Experimental Design 2 Literature Reviews 1 Experimental Research &... 1 Observational Research 1 Developmental Psychology 1 Child Development 1 Surveying 1 Observational Studies 1 Regression Testing 0 Cognitive Walkthrough 0 Regression 0 Analysis of Variance 0 Wearable Computing See 2+     See less Skills  Top Skills 47 Usability Testing 39 User Experience 17 Ethnography 16 Human Computer... 16 User Research 13 Statistics 10 Data Analysis 10 Heuristic Evaluation 9 Paper Prototyping 9 Contextual Inquiry Dhvani also knows about... 6 Storyboarding 5 Interviews 5 Interaction Design 4 Persona 3 Experimental Design 2 Literature Reviews 1 Experimental Research &... 1 Observational Research 1 Developmental Psychology 1 Child Development 1 Surveying 1 Observational Studies 1 Regression Testing 0 Cognitive Walkthrough 0 Regression 0 Analysis of Variance 0 Wearable Computing See 2+     See less Top Skills 47 Usability Testing 39 User Experience 17 Ethnography 16 Human Computer... 16 User Research 13 Statistics 10 Data Analysis 10 Heuristic Evaluation 9 Paper Prototyping 9 Contextual Inquiry Dhvani also knows about... 6 Storyboarding 5 Interviews 5 Interaction Design 4 Persona 3 Experimental Design 2 Literature Reviews 1 Experimental Research &... 1 Observational Research 1 Developmental Psychology 1 Child Development 1 Surveying 1 Observational Studies 1 Regression Testing 0 Cognitive Walkthrough 0 Regression 0 Analysis of Variance 0 Wearable Computing See 2+     See less Top Skills 47 Usability Testing 39 User Experience 17 Ethnography 16 Human Computer... 16 User Research 13 Statistics 10 Data Analysis 10 Heuristic Evaluation 9 Paper Prototyping 9 Contextual Inquiry Dhvani also knows about... 6 Storyboarding 5 Interviews 5 Interaction Design 4 Persona 3 Experimental Design 2 Literature Reviews 1 Experimental Research &... 1 Observational Research 1 Developmental Psychology 1 Child Development 1 Surveying 1 Observational Studies 1 Regression Testing 0 Cognitive Walkthrough 0 Regression 0 Analysis of Variance 0 Wearable Computing See 2+     See less                     6 Storyboarding 5 Interviews 5 Interaction Design 4 Persona 3 Experimental Design 2 Literature Reviews 1 Experimental Research &... 1 Observational Research 1 Developmental Psychology 1 Child Development 1 Surveying 1 Observational Studies 1 Regression Testing 0 Cognitive Walkthrough 0 Regression 0 Analysis of Variance 0 Wearable Computing Education George Mason University Ph.D,  Applied Developmental Psychology Activities and Societies:  Applied Developmental Psychology Student Group George Mason University M.A.,  Applied Developmental Psychology University of Houston B.A.,  Psychology George Mason University Ph.D,  Applied Developmental Psychology Activities and Societies:  Applied Developmental Psychology Student Group George Mason University Ph.D,  Applied Developmental Psychology Activities and Societies:  Applied Developmental Psychology Student Group George Mason University Ph.D,  Applied Developmental Psychology Activities and Societies:  Applied Developmental Psychology Student Group George Mason University M.A.,  Applied Developmental Psychology George Mason University M.A.,  Applied Developmental Psychology George Mason University M.A.,  Applied Developmental Psychology University of Houston B.A.,  Psychology University of Houston B.A.,  Psychology University of Houston B.A.,  Psychology Honors & Awards Additional Honors & Awards George Mason University Dissertation Award for 2008  \n \nGeorge Mason University Graduate Fellowship for 2005  \n \nGeorge Mason University Graduate Fellowship for 2006  \n \nOutstanding Doctoral Student Award for the Developmental, Biological, and School Psychology Program at George Mason University, 2006. Additional Honors & Awards George Mason University Dissertation Award for 2008  \n \nGeorge Mason University Graduate Fellowship for 2005  \n \nGeorge Mason University Graduate Fellowship for 2006  \n \nOutstanding Doctoral Student Award for the Developmental, Biological, and School Psychology Program at George Mason University, 2006. Additional Honors & Awards George Mason University Dissertation Award for 2008  \n \nGeorge Mason University Graduate Fellowship for 2005  \n \nGeorge Mason University Graduate Fellowship for 2006  \n \nOutstanding Doctoral Student Award for the Developmental, Biological, and School Psychology Program at George Mason University, 2006. Additional Honors & Awards George Mason University Dissertation Award for 2008  \n \nGeorge Mason University Graduate Fellowship for 2005  \n \nGeorge Mason University Graduate Fellowship for 2006  \n \nOutstanding Doctoral Student Award for the Developmental, Biological, and School Psychology Program at George Mason University, 2006. ", "Skills 6 User Experience 5 Heuristic Evaluation 4 User Interface 3 Usability Testing 3 User Research 1 Usability Engineering 1 Human Computer... 1 Contextual Inquiry Skills  6 User Experience 5 Heuristic Evaluation 4 User Interface 3 Usability Testing 3 User Research 1 Usability Engineering 1 Human Computer... 1 Contextual Inquiry 6 User Experience 5 Heuristic Evaluation 4 User Interface 3 Usability Testing 3 User Research 1 Usability Engineering 1 Human Computer... 1 Contextual Inquiry 6 User Experience 5 Heuristic Evaluation 4 User Interface 3 Usability Testing 3 User Research 1 Usability Engineering 1 Human Computer... 1 Contextual Inquiry                 ", "Experience Senior User Experience Researcher - Google Analytics Google November 2014  – Present (9 months) User Experience Researcher - Google Analytics Google June 2013  –  November 2014  (1 year 6 months) San Francisco Bay Area Graduate Assistant Wichita State University August 2007  –  May 2013  (5 years 10 months) (Open) 1 project Kansas State Science & Engineering Fair Form Evaluation Applied human factors knowledge to the improvement of the Kansas State Science & Engineering\nFair judging form, which was implemented the following year. View (Open) 1 organization Human Factors and Ergonomics Society View User Experience Research Intern Google May 2012  –  August 2012  (4 months) Mountain View, CA User Experience Research Intern Google June 2010  –  August 2010  (3 months) Web Developer Wichita State University June 2004  –  August 2007  (3 years 3 months) (Open) 1 recommendation Bryan Masters Director of Web Services at Wichita State University - University Relations Justin is a detail-oriented web programmer with a keen eye for usability and reliability. He keep his focus on the team's objectives while looking out for the end-user's online experience. He is knowledgable and gifted, and he is always current --... View IT Manager Hutton & Hutton Law Firm August 2001  –  June 2004  (2 years 11 months) Web Developer eoVision 2000  –  2001  (1 year) Senior User Experience Researcher - Google Analytics Google November 2014  – Present (9 months) Senior User Experience Researcher - Google Analytics Google November 2014  – Present (9 months) User Experience Researcher - Google Analytics Google June 2013  –  November 2014  (1 year 6 months) San Francisco Bay Area User Experience Researcher - Google Analytics Google June 2013  –  November 2014  (1 year 6 months) San Francisco Bay Area Graduate Assistant Wichita State University August 2007  –  May 2013  (5 years 10 months) (Open) 1 project Kansas State Science & Engineering Fair Form Evaluation Applied human factors knowledge to the improvement of the Kansas State Science & Engineering\nFair judging form, which was implemented the following year. View (Open) 1 organization Human Factors and Ergonomics Society View Graduate Assistant Wichita State University August 2007  –  May 2013  (5 years 10 months) (Open) 1 project Kansas State Science & Engineering Fair Form Evaluation Applied human factors knowledge to the improvement of the Kansas State Science & Engineering\nFair judging form, which was implemented the following year. View (Open) 1 organization Human Factors and Ergonomics Society View User Experience Research Intern Google May 2012  –  August 2012  (4 months) Mountain View, CA User Experience Research Intern Google May 2012  –  August 2012  (4 months) Mountain View, CA User Experience Research Intern Google June 2010  –  August 2010  (3 months) User Experience Research Intern Google June 2010  –  August 2010  (3 months) Web Developer Wichita State University June 2004  –  August 2007  (3 years 3 months) (Open) 1 recommendation Bryan Masters Director of Web Services at Wichita State University - University Relations Justin is a detail-oriented web programmer with a keen eye for usability and reliability. He keep his focus on the team's objectives while looking out for the end-user's online experience. He is knowledgable and gifted, and he is always current --... View Web Developer Wichita State University June 2004  –  August 2007  (3 years 3 months) (Open) 1 recommendation Bryan Masters Director of Web Services at Wichita State University - University Relations Justin is a detail-oriented web programmer with a keen eye for usability and reliability. He keep his focus on the team's objectives while looking out for the end-user's online experience. He is knowledgable and gifted, and he is always current --... View IT Manager Hutton & Hutton Law Firm August 2001  –  June 2004  (2 years 11 months) IT Manager Hutton & Hutton Law Firm August 2001  –  June 2004  (2 years 11 months) Web Developer eoVision 2000  –  2001  (1 year) Web Developer eoVision 2000  –  2001  (1 year) Skills Top Skills 58 User Experience 46 Usability 20 Usability Testing 19 Heuristic Evaluation 14 Task Analysis 11 User-centered Design 10 User Research 10 Human Computer... 8 Interaction Design 7 User Interface Design Justin also knows about... 7 Human Factors 7 Web Development 6 SPSS 6 Paper Prototyping 5 Statistics 5 Survey Design 5 User Scenarios 4 Usability Engineering 4 Research Design 4 Accessibility 3 Information Architecture 3 Information Design 3 Focus Groups 3 User Experience Design 3 Experimental Design 3 Wireframes 3 Survey Research 3 Wire Framing 3 Google Analytics 2 Persona 2 Card Sorting 2 Contextual Inquiry 2 CSS 2 Data Visualization 1 User Interface 1 Requirements Gathering 1 Axure 1 Technical Writing 1 Prototype 1 Ergonomics 1 Qualitative Research 1 Rapid Prototyping See 17+     See less Skills  Top Skills 58 User Experience 46 Usability 20 Usability Testing 19 Heuristic Evaluation 14 Task Analysis 11 User-centered Design 10 User Research 10 Human Computer... 8 Interaction Design 7 User Interface Design Justin also knows about... 7 Human Factors 7 Web Development 6 SPSS 6 Paper Prototyping 5 Statistics 5 Survey Design 5 User Scenarios 4 Usability Engineering 4 Research Design 4 Accessibility 3 Information Architecture 3 Information Design 3 Focus Groups 3 User Experience Design 3 Experimental Design 3 Wireframes 3 Survey Research 3 Wire Framing 3 Google Analytics 2 Persona 2 Card Sorting 2 Contextual Inquiry 2 CSS 2 Data Visualization 1 User Interface 1 Requirements Gathering 1 Axure 1 Technical Writing 1 Prototype 1 Ergonomics 1 Qualitative Research 1 Rapid Prototyping See 17+     See less Top Skills 58 User Experience 46 Usability 20 Usability Testing 19 Heuristic Evaluation 14 Task Analysis 11 User-centered Design 10 User Research 10 Human Computer... 8 Interaction Design 7 User Interface Design Justin also knows about... 7 Human Factors 7 Web Development 6 SPSS 6 Paper Prototyping 5 Statistics 5 Survey Design 5 User Scenarios 4 Usability Engineering 4 Research Design 4 Accessibility 3 Information Architecture 3 Information Design 3 Focus Groups 3 User Experience Design 3 Experimental Design 3 Wireframes 3 Survey Research 3 Wire Framing 3 Google Analytics 2 Persona 2 Card Sorting 2 Contextual Inquiry 2 CSS 2 Data Visualization 1 User Interface 1 Requirements Gathering 1 Axure 1 Technical Writing 1 Prototype 1 Ergonomics 1 Qualitative Research 1 Rapid Prototyping See 17+     See less Top Skills 58 User Experience 46 Usability 20 Usability Testing 19 Heuristic Evaluation 14 Task Analysis 11 User-centered Design 10 User Research 10 Human Computer... 8 Interaction Design 7 User Interface Design Justin also knows about... 7 Human Factors 7 Web Development 6 SPSS 6 Paper Prototyping 5 Statistics 5 Survey Design 5 User Scenarios 4 Usability Engineering 4 Research Design 4 Accessibility 3 Information Architecture 3 Information Design 3 Focus Groups 3 User Experience Design 3 Experimental Design 3 Wireframes 3 Survey Research 3 Wire Framing 3 Google Analytics 2 Persona 2 Card Sorting 2 Contextual Inquiry 2 CSS 2 Data Visualization 1 User Interface 1 Requirements Gathering 1 Axure 1 Technical Writing 1 Prototype 1 Ergonomics 1 Qualitative Research 1 Rapid Prototyping See 17+     See less                     7 Human Factors 7 Web Development 6 SPSS 6 Paper Prototyping 5 Statistics 5 Survey Design 5 User Scenarios 4 Usability Engineering 4 Research Design 4 Accessibility 3 Information Architecture 3 Information Design 3 Focus Groups 3 User Experience Design 3 Experimental Design 3 Wireframes 3 Survey Research 3 Wire Framing 3 Google Analytics 2 Persona 2 Card Sorting 2 Contextual Inquiry 2 CSS 2 Data Visualization 1 User Interface 1 Requirements Gathering 1 Axure 1 Technical Writing 1 Prototype 1 Ergonomics 1 Qualitative Research 1 Rapid Prototyping Education Wichita State University Ph.D.,  Human Factors Psychology 2007  – 2013 (Open) 10 courses Human Factors Principles  Human Factors Methods Judgement and Decision Making Industrial Ergonomics Software Psychology Advanced Research Methods Advanced Linear Models Perception Cognitive Psychology Emerging Markets See more Wichita State University M.A.,  Human Factors Psychology 2007  – 2010 Wichita State University BBA,  Management Information Systems August 1996  – May 2001 Wichita State University Ph.D.,  Human Factors Psychology 2007  – 2013 (Open) 10 courses Human Factors Principles  Human Factors Methods Judgement and Decision Making Industrial Ergonomics Software Psychology Advanced Research Methods Advanced Linear Models Perception Cognitive Psychology Emerging Markets See more Wichita State University Ph.D.,  Human Factors Psychology 2007  – 2013 (Open) 10 courses Human Factors Principles  Human Factors Methods Judgement and Decision Making Industrial Ergonomics Software Psychology Advanced Research Methods Advanced Linear Models Perception Cognitive Psychology Emerging Markets See more Wichita State University Ph.D.,  Human Factors Psychology 2007  – 2013 (Open) 10 courses Human Factors Principles  Human Factors Methods Judgement and Decision Making Industrial Ergonomics Software Psychology Advanced Research Methods Advanced Linear Models Perception Cognitive Psychology Emerging Markets See more Wichita State University M.A.,  Human Factors Psychology 2007  – 2010 Wichita State University M.A.,  Human Factors Psychology 2007  – 2010 Wichita State University M.A.,  Human Factors Psychology 2007  – 2010 Wichita State University BBA,  Management Information Systems August 1996  – May 2001 Wichita State University BBA,  Management Information Systems August 1996  – May 2001 Wichita State University BBA,  Management Information Systems August 1996  – May 2001 "]}