{"position": "WFM Analyst", "company": "IBM", "profiles": ["Experience WFM Analyst IBM Global Process Services May 2013  – Present (2 years 4 months) Real Time Analysis Team Lead IBM Daksh Business Process Services Pvt. Ltd November 2007  –  April 2013  (5 years 6 months) Working as auditor WFM Analyst IBM Global Process Services May 2013  – Present (2 years 4 months) Real Time Analysis WFM Analyst IBM Global Process Services May 2013  – Present (2 years 4 months) Real Time Analysis Team Lead IBM Daksh Business Process Services Pvt. Ltd November 2007  –  April 2013  (5 years 6 months) Working as auditor Team Lead IBM Daksh Business Process Services Pvt. Ltd November 2007  –  April 2013  (5 years 6 months) Working as auditor Skills Service Delivery BPO Team Management Business Analysis Requirements Analysis Outsourcing Incident Management Skills  Service Delivery BPO Team Management Business Analysis Requirements Analysis Outsourcing Incident Management Service Delivery BPO Team Management Business Analysis Requirements Analysis Outsourcing Incident Management Service Delivery BPO Team Management Business Analysis Requirements Analysis Outsourcing Incident Management Education S M Arya Public School S M Arya Public School S M Arya Public School S M Arya Public School ", "Experience MIS & WFM Analyst IBM Global Services MIS & WFM Analyst IBM Global Services MIS & WFM Analyst IBM Global Services Education St Columbus College BA,  English Literature 1998  – 2001 St Columbus College BA,  English Literature 1998  – 2001 St Columbus College BA,  English Literature 1998  – 2001 St Columbus College BA,  English Literature 1998  – 2001 ", "Experience WFM Analyst at IBM Global IBM Global Process Services Pvt Ltd February 2011  – Present (4 years 7 months) Working as band 5 employee. Doing analysis on real time and historical data of IBM Global. Spoc MIS Spanco BPO Kolkata February 2009  –  January 2011  (2 years) MIS Exect aegis bpo December 2007  –  January 2009  (1 year 2 months) WFM Analyst at IBM Global IBM Global Process Services Pvt Ltd February 2011  – Present (4 years 7 months) Working as band 5 employee. Doing analysis on real time and historical data of IBM Global. WFM Analyst at IBM Global IBM Global Process Services Pvt Ltd February 2011  – Present (4 years 7 months) Working as band 5 employee. Doing analysis on real time and historical data of IBM Global. Spoc MIS Spanco BPO Kolkata February 2009  –  January 2011  (2 years) Spoc MIS Spanco BPO Kolkata February 2009  –  January 2011  (2 years) MIS Exect aegis bpo December 2007  –  January 2009  (1 year 2 months) MIS Exect aegis bpo December 2007  –  January 2009  (1 year 2 months) Languages English/Hindi/Bengali English/Hindi/Bengali English/Hindi/Bengali Skills Workforce Management MIS BPO Analytics Data Analysis Business Analysis Avaya Call Center Analysis Skills  Workforce Management MIS BPO Analytics Data Analysis Business Analysis Avaya Call Center Analysis Workforce Management MIS BPO Analytics Data Analysis Business Analysis Avaya Call Center Analysis Workforce Management MIS BPO Analytics Data Analysis Business Analysis Avaya Call Center Analysis Education Hamilton School HS Hamilton School HS Hamilton School HS Hamilton School HS ", "Summary A dynamic, hardworking and result oriented individual with strong management background & excellent work ethics. Consistently going the “extra mile” to exceed expectations, seeking a challenging position where professional experience and expertise can contribute to organizational goals is my objective. Summary A dynamic, hardworking and result oriented individual with strong management background & excellent work ethics. Consistently going the “extra mile” to exceed expectations, seeking a challenging position where professional experience and expertise can contribute to organizational goals is my objective. A dynamic, hardworking and result oriented individual with strong management background & excellent work ethics. Consistently going the “extra mile” to exceed expectations, seeking a challenging position where professional experience and expertise can contribute to organizational goals is my objective. A dynamic, hardworking and result oriented individual with strong management background & excellent work ethics. Consistently going the “extra mile” to exceed expectations, seeking a challenging position where professional experience and expertise can contribute to organizational goals is my objective. Experience Lead WFM Analyst IBM Global Process Services December 2006  – Present (8 years 9 months) PROFESSIONAL WORK HISTORY \nWorking as a Lead WFM Analyst in IBM – From 04th August 2010,till date. \nJob Profile \n\tHandling Real Time Service Delivery. \n\tInteraction with the Client regarding Real Time Process Performance, AHT, Shrinkage, etc. \n\tSupervising Many Teams at the same time in the Absence of their respective supervisors. \n\tTaking care of Hygiene Issues. Sr.CCS IBM Global Process Services Pvt Ltd December 2006  –  August 2009  (2 years 9 months) Worked as an International Customer Service Executive (Band-3) in IBM– From 20th December 2006 to 14th March 2008. \nJob Profile \n\tUsed to provide Technical Support to the UK Customers Regarding Virgin STB & Virgin Phone. \n \nWorked as an International Customer Service Executive (Band-4) in IBM– From 15th December 2008 to 03rd August 2010. \nJob Profile \n\tUsed to provide Technical Support to the UK Customers Regarding Virgin STB & Virgin Phone. \n\tHandled NHT Team & Providing the Support, Coaching for Product. Lead WFM Analyst IBM Global Process Services December 2006  – Present (8 years 9 months) PROFESSIONAL WORK HISTORY \nWorking as a Lead WFM Analyst in IBM – From 04th August 2010,till date. \nJob Profile \n\tHandling Real Time Service Delivery. \n\tInteraction with the Client regarding Real Time Process Performance, AHT, Shrinkage, etc. \n\tSupervising Many Teams at the same time in the Absence of their respective supervisors. \n\tTaking care of Hygiene Issues. Lead WFM Analyst IBM Global Process Services December 2006  – Present (8 years 9 months) PROFESSIONAL WORK HISTORY \nWorking as a Lead WFM Analyst in IBM – From 04th August 2010,till date. \nJob Profile \n\tHandling Real Time Service Delivery. \n\tInteraction with the Client regarding Real Time Process Performance, AHT, Shrinkage, etc. \n\tSupervising Many Teams at the same time in the Absence of their respective supervisors. \n\tTaking care of Hygiene Issues. Sr.CCS IBM Global Process Services Pvt Ltd December 2006  –  August 2009  (2 years 9 months) Worked as an International Customer Service Executive (Band-3) in IBM– From 20th December 2006 to 14th March 2008. \nJob Profile \n\tUsed to provide Technical Support to the UK Customers Regarding Virgin STB & Virgin Phone. \n \nWorked as an International Customer Service Executive (Band-4) in IBM– From 15th December 2008 to 03rd August 2010. \nJob Profile \n\tUsed to provide Technical Support to the UK Customers Regarding Virgin STB & Virgin Phone. \n\tHandled NHT Team & Providing the Support, Coaching for Product. Sr.CCS IBM Global Process Services Pvt Ltd December 2006  –  August 2009  (2 years 9 months) Worked as an International Customer Service Executive (Band-3) in IBM– From 20th December 2006 to 14th March 2008. \nJob Profile \n\tUsed to provide Technical Support to the UK Customers Regarding Virgin STB & Virgin Phone. \n \nWorked as an International Customer Service Executive (Band-4) in IBM– From 15th December 2008 to 03rd August 2010. \nJob Profile \n\tUsed to provide Technical Support to the UK Customers Regarding Virgin STB & Virgin Phone. \n\tHandled NHT Team & Providing the Support, Coaching for Product. Languages English, Hindi, Urdu, Sanskrit, Maithili, Bhojpuri, Nepali, Prakrit & Magadhi. English, Hindi, Urdu, Sanskrit, Maithili, Bhojpuri, Nepali, Prakrit & Magadhi. English, Hindi, Urdu, Sanskrit, Maithili, Bhojpuri, Nepali, Prakrit & Magadhi. Skills BPO Service Delivery MIS Workforce Management Team Management Transition Management Vendor Management Business Analysis Sla Analytics Call Centers Outsourcing Capacity Planning Process Improvement Operations Management Resource Management Technical Support Management Microsoft Excel Operating Systems See 5+     See less Skills  BPO Service Delivery MIS Workforce Management Team Management Transition Management Vendor Management Business Analysis Sla Analytics Call Centers Outsourcing Capacity Planning Process Improvement Operations Management Resource Management Technical Support Management Microsoft Excel Operating Systems See 5+     See less BPO Service Delivery MIS Workforce Management Team Management Transition Management Vendor Management Business Analysis Sla Analytics Call Centers Outsourcing Capacity Planning Process Improvement Operations Management Resource Management Technical Support Management Microsoft Excel Operating Systems See 5+     See less BPO Service Delivery MIS Workforce Management Team Management Transition Management Vendor Management Business Analysis Sla Analytics Call Centers Outsourcing Capacity Planning Process Improvement Operations Management Resource Management Technical Support Management Microsoft Excel Operating Systems See 5+     See less Education Jamia Millia Islamia B.A.(H)Geog,  Geaography 2003  – 2006 Jamia Millia Islamia B.A.(H)Geog,  Geaography 2003  – 2006 Jamia Millia Islamia B.A.(H)Geog,  Geaography 2003  – 2006 Jamia Millia Islamia B.A.(H)Geog,  Geaography 2003  – 2006 ", "Experience Lead WFM Analyst IBM Global Process Services August 2012  – Present (3 years 1 month) Already described in the Skills and Expertise. Sr. Technical Support Officer Convergys January 2007  –  December 2011  (5 years) Sr. Customer Service Representative STRACON Backoffice Solutions Limited July 2005  –  January 2007  (1 year 7 months) Lead WFM Analyst IBM Global Process Services August 2012  – Present (3 years 1 month) Already described in the Skills and Expertise. Lead WFM Analyst IBM Global Process Services August 2012  – Present (3 years 1 month) Already described in the Skills and Expertise. Sr. Technical Support Officer Convergys January 2007  –  December 2011  (5 years) Sr. Technical Support Officer Convergys January 2007  –  December 2011  (5 years) Sr. Customer Service Representative STRACON Backoffice Solutions Limited July 2005  –  January 2007  (1 year 7 months) Sr. Customer Service Representative STRACON Backoffice Solutions Limited July 2005  –  January 2007  (1 year 7 months) Skills RTA, Real-time,... Good with Excel Knowledge about... Worked on the... Worked on the Revenue... Skills  RTA, Real-time,... Good with Excel Knowledge about... Worked on the... Worked on the Revenue... RTA, Real-time,... Good with Excel Knowledge about... Worked on the... Worked on the Revenue... RTA, Real-time,... Good with Excel Knowledge about... Worked on the... Worked on the Revenue... Education Bishop Johnson School Bachelor of Commerce (BCom),  Commerce 1986  – 2001 Bishop Johnson School Bachelor of Commerce (BCom),  Commerce 1986  – 2001 Bishop Johnson School Bachelor of Commerce (BCom),  Commerce 1986  – 2001 Bishop Johnson School Bachelor of Commerce (BCom),  Commerce 1986  – 2001 ", "Experience WFM Analyst IBM Daksh Business Process Services Pvt. Ltd WFM Analyst IBM Daksh Business Process Services Pvt. Ltd WFM Analyst IBM Daksh Business Process Services Pvt. Ltd ", "Experience WFM Analyst IBM india pvt ltd June 2011  – Present (4 years 3 months) WFM Analyst IBM india pvt ltd June 2011  – Present (4 years 3 months) WFM Analyst IBM india pvt ltd June 2011  – Present (4 years 3 months) Education NIE BE,  CS NIE BE,  CS NIE BE,  CS NIE BE,  CS ", "Experience WFM Analyst IBM January 2015  – Present (8 months) Bulgaria Technical support service representative IBM July 2014  –  December 2014  (6 months) Accounts Receivable Capgemini 2006  –  2006  (less than a year) WFM Analyst IBM January 2015  – Present (8 months) Bulgaria WFM Analyst IBM January 2015  – Present (8 months) Bulgaria Technical support service representative IBM July 2014  –  December 2014  (6 months) Technical support service representative IBM July 2014  –  December 2014  (6 months) Accounts Receivable Capgemini 2006  –  2006  (less than a year) Accounts Receivable Capgemini 2006  –  2006  (less than a year) Languages Spanish Native or bilingual proficiency English Full professional proficiency Polish Full professional proficiency Bulgarian Full professional proficiency Spanish Native or bilingual proficiency English Full professional proficiency Polish Full professional proficiency Bulgarian Full professional proficiency Spanish Native or bilingual proficiency English Full professional proficiency Polish Full professional proficiency Bulgarian Full professional proficiency Native or bilingual proficiency Full professional proficiency Full professional proficiency Full professional proficiency Education Jagiellonian University Master's degree,  Political Science 2000  – 2006 Colegio Colombo Britanico, Medellin, Colombia 1989  – 1997 Jagiellonian University Master's degree,  Political Science 2000  – 2006 Jagiellonian University Master's degree,  Political Science 2000  – 2006 Jagiellonian University Master's degree,  Political Science 2000  – 2006 Colegio Colombo Britanico, Medellin, Colombia 1989  – 1997 Colegio Colombo Britanico, Medellin, Colombia 1989  – 1997 Colegio Colombo Britanico, Medellin, Colombia 1989  – 1997 ", "Experience Project Management Officer IBM June 2015  – Present (3 months) Cairo, Egypt Dispatcher IBM January 2014  – Present (1 year 8 months) WFM Analyst IBM January 2012  –  December 2013  (2 years) WFM analyst IBM January 2012  –  December 2013  (2 years) Skype Spanish Respresentative IBM July 2010  –  December 2011  (1 year 6 months) Project Management Officer IBM June 2015  – Present (3 months) Cairo, Egypt Project Management Officer IBM June 2015  – Present (3 months) Cairo, Egypt Dispatcher IBM January 2014  – Present (1 year 8 months) Dispatcher IBM January 2014  – Present (1 year 8 months) WFM Analyst IBM January 2012  –  December 2013  (2 years) WFM Analyst IBM January 2012  –  December 2013  (2 years) WFM analyst IBM January 2012  –  December 2013  (2 years) WFM analyst IBM January 2012  –  December 2013  (2 years) Skype Spanish Respresentative IBM July 2010  –  December 2011  (1 year 6 months) Skype Spanish Respresentative IBM July 2010  –  December 2011  (1 year 6 months) Skills Requirements Analysis Business Analysis Analytics Data Analysis Service Delivery Business Intelligence Spanish-speaking Skype Workforce Management Customer Service Customer Satisfaction Skills  Requirements Analysis Business Analysis Analytics Data Analysis Service Delivery Business Intelligence Spanish-speaking Skype Workforce Management Customer Service Customer Satisfaction Requirements Analysis Business Analysis Analytics Data Analysis Service Delivery Business Intelligence Spanish-speaking Skype Workforce Management Customer Service Customer Satisfaction Requirements Analysis Business Analysis Analytics Data Analysis Service Delivery Business Intelligence Spanish-speaking Skype Workforce Management Customer Service Customer Satisfaction ", "Experience PMO Hewlett-Packard November 2011  – Present (3 years 10 months) Banaglore IT Professional with diverse knowledge in Business Planning, Resource Management, IT Operations Management and Customer Service Relations. Experience includes managing cross-functional teams and information technology projects. Strong process creation, testing, implementation and documentation background with a firm commitment to high standard. Business Planning Analyst Hewlett Packard Global Soft September 2007  –  October 2011  (4 years 2 months) WFM Analyst IBM Global Services Pvt. Ltd April 2005  –  August 2007  (2 years 5 months) Designation: VCSC Support & SME for WFM. \n \nJob Responsibilities: \nSetting up single and multiskill accounts. \nScheduling and forecasting the monthly data. \nConducting periodic quality audits of employees working in the teams and implementing procedures to improve quality standards. \nVerifying reports sent by client on regular basis and co-coordinating the same with respective teams. \nCreating Holiday & Seasonal Forecast and creating Optimal Schedules. \nReporting to the client / higher management about the progress and performance of the operation team on a regular basis. \nAttending conference calls for scheduling discussions with the client and higher management. \nPreparing staffing for the operation floor as per the calls predicted by the client. \nHandling schedules and staffing for IBM support to its clients. \nCreating Vacation Entitlements for the respective accounts. \nTo cater various Internal and external customer's queries related to staffing through the IBM Web-sites and through e-mail \nCoordinating with the Team Leads in U.S and ensure smooth operation of the Helpdesk through daily Conference calls. \nTraining the New Agents and the Managers by walking them through the eWFM. \nAdditional Responsibilities: \n \nTraining of new hires in the team. \n \nTraining of agents/call-takers to explain the role of ASA Team in IBM. \n \nIdentify improvement opportunities to take staffing and scheduling to the next level of effectiveness. \n \nManaging the access rights for different level for different tools. \n \nCLI3L e-Services (A joint Venture between ITC InfoTech and Client Logic USA Sr.Customer Care Support CLI3L e-Services April 2003  –  May 2005  (2 years 2 months) Team Manager Scholastic India Pvt ltd as Co October 2002  –  February 2003  (5 months) Job Responsibilities: \nMicrosoft Product Activation Division. And installing CALS and activating Terminal Server and Volume License. \nWorked with Vishnu Solution as Customer Service Representative in Kolkata Customer Executive Ordinator in Kolkata March 2001  –  September 2002  (1 year 7 months) Achievements \nGot promoted as Subject Matter Expert for WFM in Nov 2006 in IBM. \nGot Certified on Aspect Software on Scheduling, Forecasting, Configuration & multi-skill Scheduling. \nBest performer award for Team set up in Sofia(Bulgaria) in HP. \nReceived \"Top Performer\" award for Q1 FY09, as the best performer in the team in HP. \nSuccessfully implemented the CCI project for North America & Asia Pacific regions; Dalian sites in HP. \nKey member in one of the GB project's done in HP for Transport Department in streamlining the Cab rostering which has resulted in huge savings. \nSuccessfully completed Transition for HP - India Support, (Internal customer), North America teams & EMA teams. PMO Hewlett-Packard November 2011  – Present (3 years 10 months) Banaglore IT Professional with diverse knowledge in Business Planning, Resource Management, IT Operations Management and Customer Service Relations. Experience includes managing cross-functional teams and information technology projects. Strong process creation, testing, implementation and documentation background with a firm commitment to high standard. PMO Hewlett-Packard November 2011  – Present (3 years 10 months) Banaglore IT Professional with diverse knowledge in Business Planning, Resource Management, IT Operations Management and Customer Service Relations. Experience includes managing cross-functional teams and information technology projects. Strong process creation, testing, implementation and documentation background with a firm commitment to high standard. Business Planning Analyst Hewlett Packard Global Soft September 2007  –  October 2011  (4 years 2 months) Business Planning Analyst Hewlett Packard Global Soft September 2007  –  October 2011  (4 years 2 months) WFM Analyst IBM Global Services Pvt. Ltd April 2005  –  August 2007  (2 years 5 months) Designation: VCSC Support & SME for WFM. \n \nJob Responsibilities: \nSetting up single and multiskill accounts. \nScheduling and forecasting the monthly data. \nConducting periodic quality audits of employees working in the teams and implementing procedures to improve quality standards. \nVerifying reports sent by client on regular basis and co-coordinating the same with respective teams. \nCreating Holiday & Seasonal Forecast and creating Optimal Schedules. \nReporting to the client / higher management about the progress and performance of the operation team on a regular basis. \nAttending conference calls for scheduling discussions with the client and higher management. \nPreparing staffing for the operation floor as per the calls predicted by the client. \nHandling schedules and staffing for IBM support to its clients. \nCreating Vacation Entitlements for the respective accounts. \nTo cater various Internal and external customer's queries related to staffing through the IBM Web-sites and through e-mail \nCoordinating with the Team Leads in U.S and ensure smooth operation of the Helpdesk through daily Conference calls. \nTraining the New Agents and the Managers by walking them through the eWFM. \nAdditional Responsibilities: \n \nTraining of new hires in the team. \n \nTraining of agents/call-takers to explain the role of ASA Team in IBM. \n \nIdentify improvement opportunities to take staffing and scheduling to the next level of effectiveness. \n \nManaging the access rights for different level for different tools. \n \nCLI3L e-Services (A joint Venture between ITC InfoTech and Client Logic USA WFM Analyst IBM Global Services Pvt. Ltd April 2005  –  August 2007  (2 years 5 months) Designation: VCSC Support & SME for WFM. \n \nJob Responsibilities: \nSetting up single and multiskill accounts. \nScheduling and forecasting the monthly data. \nConducting periodic quality audits of employees working in the teams and implementing procedures to improve quality standards. \nVerifying reports sent by client on regular basis and co-coordinating the same with respective teams. \nCreating Holiday & Seasonal Forecast and creating Optimal Schedules. \nReporting to the client / higher management about the progress and performance of the operation team on a regular basis. \nAttending conference calls for scheduling discussions with the client and higher management. \nPreparing staffing for the operation floor as per the calls predicted by the client. \nHandling schedules and staffing for IBM support to its clients. \nCreating Vacation Entitlements for the respective accounts. \nTo cater various Internal and external customer's queries related to staffing through the IBM Web-sites and through e-mail \nCoordinating with the Team Leads in U.S and ensure smooth operation of the Helpdesk through daily Conference calls. \nTraining the New Agents and the Managers by walking them through the eWFM. \nAdditional Responsibilities: \n \nTraining of new hires in the team. \n \nTraining of agents/call-takers to explain the role of ASA Team in IBM. \n \nIdentify improvement opportunities to take staffing and scheduling to the next level of effectiveness. \n \nManaging the access rights for different level for different tools. \n \nCLI3L e-Services (A joint Venture between ITC InfoTech and Client Logic USA Sr.Customer Care Support CLI3L e-Services April 2003  –  May 2005  (2 years 2 months) Sr.Customer Care Support CLI3L e-Services April 2003  –  May 2005  (2 years 2 months) Team Manager Scholastic India Pvt ltd as Co October 2002  –  February 2003  (5 months) Job Responsibilities: \nMicrosoft Product Activation Division. And installing CALS and activating Terminal Server and Volume License. \nWorked with Vishnu Solution as Customer Service Representative in Kolkata Team Manager Scholastic India Pvt ltd as Co October 2002  –  February 2003  (5 months) Job Responsibilities: \nMicrosoft Product Activation Division. And installing CALS and activating Terminal Server and Volume License. \nWorked with Vishnu Solution as Customer Service Representative in Kolkata Customer Executive Ordinator in Kolkata March 2001  –  September 2002  (1 year 7 months) Achievements \nGot promoted as Subject Matter Expert for WFM in Nov 2006 in IBM. \nGot Certified on Aspect Software on Scheduling, Forecasting, Configuration & multi-skill Scheduling. \nBest performer award for Team set up in Sofia(Bulgaria) in HP. \nReceived \"Top Performer\" award for Q1 FY09, as the best performer in the team in HP. \nSuccessfully implemented the CCI project for North America & Asia Pacific regions; Dalian sites in HP. \nKey member in one of the GB project's done in HP for Transport Department in streamlining the Cab rostering which has resulted in huge savings. \nSuccessfully completed Transition for HP - India Support, (Internal customer), North America teams & EMA teams. Customer Executive Ordinator in Kolkata March 2001  –  September 2002  (1 year 7 months) Achievements \nGot promoted as Subject Matter Expert for WFM in Nov 2006 in IBM. \nGot Certified on Aspect Software on Scheduling, Forecasting, Configuration & multi-skill Scheduling. \nBest performer award for Team set up in Sofia(Bulgaria) in HP. \nReceived \"Top Performer\" award for Q1 FY09, as the best performer in the team in HP. \nSuccessfully implemented the CCI project for North America & Asia Pacific regions; Dalian sites in HP. \nKey member in one of the GB project's done in HP for Transport Department in streamlining the Cab rostering which has resulted in huge savings. \nSuccessfully completed Transition for HP - India Support, (Internal customer), North America teams & EMA teams. Skills ITIL Business Analysis Service Delivery Process Improvement Skills  ITIL Business Analysis Service Delivery Process Improvement ITIL Business Analysis Service Delivery Process Improvement ITIL Business Analysis Service Delivery Process Improvement Education Mangalore University Commerce 1990  – 1995 Mangalore University PMP preparatory program. \n \nITIL Foundation program & currently preparing for the certification. Mangalore University Commerce 1990  – 1995 Mangalore University Commerce 1990  – 1995 Mangalore University Commerce 1990  – 1995 Mangalore University PMP preparatory program. \n \nITIL Foundation program & currently preparing for the certification. Mangalore University PMP preparatory program. \n \nITIL Foundation program & currently preparing for the certification. Mangalore University PMP preparatory program. \n \nITIL Foundation program & currently preparing for the certification. ", "Experience WFM Analyst IBM Global Business Services WFM Analyst IBM Global Business Services WFM Analyst IBM Global Business Services ", "Summary I am a keen and quick learner with 12 years of work experience in both back office and front office line of business. From last 7 years I am working in Workforce Management LOB.  \n \nI am handling Accounts based of India, United States of America, Canada, Egypt, Costa Rica and Philippines. \n \nMy job profile is :-  \nPlanning, Analyzing, Forecasting (Weekly, Monthly, Short Term and long Term), Scheduling, Staffing, Sizing for Single Account and Pool Account, Capacity planning, Service Analysis, Reporting (Dashboards, Aux usage, Shrinkage, Root cause Analysis, Daily report and Hourly report, Deep Dive Analysis Report), Maintaining Employee Database, Real Time monitoring, Real Time recommendation. \n \nExtra Initiative Taken: -  \nMentoring & Coaching Team, Training Operation Team and helping them in achieving different parameters, Creating process related Documents for Operation and Internal Team, Knowledge Transfer, Process Transitioning and Analysis, Projects, Creating Quick learning PowerPoint Presentation. \n \nWFM Tools = IEX, Avaya CMS, Aspect (eWFM version 7.2, 7.5 and 8), and different ticketing tools. \n \nTo Develop my own Skills I have completed few Learning Courses:-  \nStrategic management Planning, Communicating as a Leader, Essential Skills for Tomorrow's Manager Simulation, Difficult people at work place, Interpersonal Skills on fast track, Anticipating and solving problems as a project champion, Attitude and Engagement Certificate, Building your personal Brand, career Conversation, Communicate Etiquette, How can I improve client Satisfaction, Learning and career development, Managing and Engaging your new IBM employees, Project management, project management Orientation, Conflict management, Cloud Computing. Summary I am a keen and quick learner with 12 years of work experience in both back office and front office line of business. From last 7 years I am working in Workforce Management LOB.  \n \nI am handling Accounts based of India, United States of America, Canada, Egypt, Costa Rica and Philippines. \n \nMy job profile is :-  \nPlanning, Analyzing, Forecasting (Weekly, Monthly, Short Term and long Term), Scheduling, Staffing, Sizing for Single Account and Pool Account, Capacity planning, Service Analysis, Reporting (Dashboards, Aux usage, Shrinkage, Root cause Analysis, Daily report and Hourly report, Deep Dive Analysis Report), Maintaining Employee Database, Real Time monitoring, Real Time recommendation. \n \nExtra Initiative Taken: -  \nMentoring & Coaching Team, Training Operation Team and helping them in achieving different parameters, Creating process related Documents for Operation and Internal Team, Knowledge Transfer, Process Transitioning and Analysis, Projects, Creating Quick learning PowerPoint Presentation. \n \nWFM Tools = IEX, Avaya CMS, Aspect (eWFM version 7.2, 7.5 and 8), and different ticketing tools. \n \nTo Develop my own Skills I have completed few Learning Courses:-  \nStrategic management Planning, Communicating as a Leader, Essential Skills for Tomorrow's Manager Simulation, Difficult people at work place, Interpersonal Skills on fast track, Anticipating and solving problems as a project champion, Attitude and Engagement Certificate, Building your personal Brand, career Conversation, Communicate Etiquette, How can I improve client Satisfaction, Learning and career development, Managing and Engaging your new IBM employees, Project management, project management Orientation, Conflict management, Cloud Computing. I am a keen and quick learner with 12 years of work experience in both back office and front office line of business. From last 7 years I am working in Workforce Management LOB.  \n \nI am handling Accounts based of India, United States of America, Canada, Egypt, Costa Rica and Philippines. \n \nMy job profile is :-  \nPlanning, Analyzing, Forecasting (Weekly, Monthly, Short Term and long Term), Scheduling, Staffing, Sizing for Single Account and Pool Account, Capacity planning, Service Analysis, Reporting (Dashboards, Aux usage, Shrinkage, Root cause Analysis, Daily report and Hourly report, Deep Dive Analysis Report), Maintaining Employee Database, Real Time monitoring, Real Time recommendation. \n \nExtra Initiative Taken: -  \nMentoring & Coaching Team, Training Operation Team and helping them in achieving different parameters, Creating process related Documents for Operation and Internal Team, Knowledge Transfer, Process Transitioning and Analysis, Projects, Creating Quick learning PowerPoint Presentation. \n \nWFM Tools = IEX, Avaya CMS, Aspect (eWFM version 7.2, 7.5 and 8), and different ticketing tools. \n \nTo Develop my own Skills I have completed few Learning Courses:-  \nStrategic management Planning, Communicating as a Leader, Essential Skills for Tomorrow's Manager Simulation, Difficult people at work place, Interpersonal Skills on fast track, Anticipating and solving problems as a project champion, Attitude and Engagement Certificate, Building your personal Brand, career Conversation, Communicate Etiquette, How can I improve client Satisfaction, Learning and career development, Managing and Engaging your new IBM employees, Project management, project management Orientation, Conflict management, Cloud Computing. I am a keen and quick learner with 12 years of work experience in both back office and front office line of business. From last 7 years I am working in Workforce Management LOB.  \n \nI am handling Accounts based of India, United States of America, Canada, Egypt, Costa Rica and Philippines. \n \nMy job profile is :-  \nPlanning, Analyzing, Forecasting (Weekly, Monthly, Short Term and long Term), Scheduling, Staffing, Sizing for Single Account and Pool Account, Capacity planning, Service Analysis, Reporting (Dashboards, Aux usage, Shrinkage, Root cause Analysis, Daily report and Hourly report, Deep Dive Analysis Report), Maintaining Employee Database, Real Time monitoring, Real Time recommendation. \n \nExtra Initiative Taken: -  \nMentoring & Coaching Team, Training Operation Team and helping them in achieving different parameters, Creating process related Documents for Operation and Internal Team, Knowledge Transfer, Process Transitioning and Analysis, Projects, Creating Quick learning PowerPoint Presentation. \n \nWFM Tools = IEX, Avaya CMS, Aspect (eWFM version 7.2, 7.5 and 8), and different ticketing tools. \n \nTo Develop my own Skills I have completed few Learning Courses:-  \nStrategic management Planning, Communicating as a Leader, Essential Skills for Tomorrow's Manager Simulation, Difficult people at work place, Interpersonal Skills on fast track, Anticipating and solving problems as a project champion, Attitude and Engagement Certificate, Building your personal Brand, career Conversation, Communicate Etiquette, How can I improve client Satisfaction, Learning and career development, Managing and Engaging your new IBM employees, Project management, project management Orientation, Conflict management, Cloud Computing. Experience Senior WFM Analyst IBM India Private Limited January 2012  – Present (3 years 8 months) Bangalore Area, India Planning, Forecasting, Scheduling, Staffing, Capacity Planning, Sizing, Reporting, Root Cause Analysis, Deep Dive Analysis, Training, Mentoring, Real time monitoring, Team Handling, Review (Internal and with Operation Team) Senior WFM Analyst IBM India Private Limited January 2012  – Present (3 years 8 months) Bangalore Area, India Planning, Forecasting, Scheduling, Staffing, Capacity Planning, Sizing, Reporting, Root Cause Analysis, Deep Dive Analysis, Training, Mentoring, Real time monitoring, Team Handling, Review (Internal and with Operation Team) Senior WFM Analyst IBM India Private Limited January 2012  – Present (3 years 8 months) Bangalore Area, India Planning, Forecasting, Scheduling, Staffing, Capacity Planning, Sizing, Reporting, Root Cause Analysis, Deep Dive Analysis, Training, Mentoring, Real time monitoring, Team Handling, Review (Internal and with Operation Team) Languages English Full professional proficiency Hindi Full professional proficiency Bengali Native or bilingual proficiency Assamese Full professional proficiency English Full professional proficiency Hindi Full professional proficiency Bengali Native or bilingual proficiency Assamese Full professional proficiency English Full professional proficiency Hindi Full professional proficiency Bengali Native or bilingual proficiency Assamese Full professional proficiency Full professional proficiency Full professional proficiency Native or bilingual proficiency Full professional proficiency Skills BPO Workforce Management Planning Planning Budgeting &... Scheduling Staffing Analysis Sizing Process Transitioning Capacity Planning Seat Utilization Coaching & Mentoring Reporting & Analysis Business Process... Creating process... Share best practices to... Real Time Monitoring Project Management See 2+     See less Skills  BPO Workforce Management Planning Planning Budgeting &... Scheduling Staffing Analysis Sizing Process Transitioning Capacity Planning Seat Utilization Coaching & Mentoring Reporting & Analysis Business Process... Creating process... Share best practices to... Real Time Monitoring Project Management See 2+     See less BPO Workforce Management Planning Planning Budgeting &... Scheduling Staffing Analysis Sizing Process Transitioning Capacity Planning Seat Utilization Coaching & Mentoring Reporting & Analysis Business Process... Creating process... Share best practices to... Real Time Monitoring Project Management See 2+     See less BPO Workforce Management Planning Planning Budgeting &... Scheduling Staffing Analysis Sizing Process Transitioning Capacity Planning Seat Utilization Coaching & Mentoring Reporting & Analysis Business Process... Creating process... Share best practices to... Real Time Monitoring Project Management See 2+     See less Education Gauhati University Bachelor's degree,  Business/Commerce , General , Class-First 2001  – 2005 B.Com ( honours in management) Gauhati University Bachelor's degree,  Business/Commerce , General , Class-First 2001  – 2005 B.Com ( honours in management) Gauhati University Bachelor's degree,  Business/Commerce , General , Class-First 2001  – 2005 B.Com ( honours in management) Gauhati University Bachelor's degree,  Business/Commerce , General , Class-First 2001  – 2005 B.Com ( honours in management) ", "Experience WFM Analyst IBM February 2015  – Present (7 months) Bangaon Area, India  * Develop reports on daily workload. * Participate in forecasting meetings with relevant departments; develop accurate short- and long-term workload forecasts. * Control master systems files with schedule information and shift preferences. * Serve as initial contact point for all issues regarding schedules. * Process day-off requests and update systems. * Determine workforce requirements to meet service level and response time objectives. * Determine agent schedules to meet Process objectives Senior Tech advisor IBM February 2014  – Present (1 year 7 months) Addresses and resolves basic incidents and requests; logs all incidents and requests; engages other service desk resources or appropriate service resources to resolve incidents that are beyond the scope of their ability or responsibility. \nUses the appropriate SDB categories for logging incidents and requests. \nCreates a positive client support experience and builds strong relationships through deep problem understanding, ensuring timely resolution or escalation, communicating promptly on progress, and handling clients with a consummately professional attitude. \nEnsures the end-to-end technical support experience and provides a single point-of-contact for the clients. \nAnalyzes and resolves incidents and requests regarding use of application software or hardware. Logs and tracks incidents and requests from identification through resolution. Follows up with other support staff (service resources) involved in resolution to ensure incidents are resolved, requests are filled, and the client communication is complete. Documents resolutions and updates self-help and staff knowledge bases. \nGrows general knowledge of current corporate, division, and facility-specific products, increasing ability to resolve requests on first contact. \nProvides after hours and on-call support as needed. \nAdheres to and supports HCA IT&S standards, policies, and procedures. \nMaintains and protects confidentiality with regard to all aspects of patient care and employee information. \nAdheres to Code of Conduct and Mission and Value statements. \nPerforms other duties as assigned Support Accounts and verification dept Yahoo! August 2012  –  November 2013  (1 year 4 months) Bangalore \tVerifying User Accounts  \n\tSupporting Account Recovery  \n\tIdentifying Compromised Accounts \n\tHandling Fraud Accounts Analyst Mphasis August 2006  –  July 2012  (6 years) Bangalore \tWorked as a senior Customer representative for 3 years handling inbound calls related to banking and technical queries for an American bank \n\tAs a part of Command Centre for 1.5 years managed an extensive daily workload with responsibility for Reporting, Business analysis, Process improvements Scheduling and forecasting of calls and break management  \n\tManaging the MIS reporting for the Vertical which includes preparation of P&L reports, HR tracker’s , tracking of projections against actual for financial year WFM Analyst IBM February 2015  – Present (7 months) Bangaon Area, India  * Develop reports on daily workload. * Participate in forecasting meetings with relevant departments; develop accurate short- and long-term workload forecasts. * Control master systems files with schedule information and shift preferences. * Serve as initial contact point for all issues regarding schedules. * Process day-off requests and update systems. * Determine workforce requirements to meet service level and response time objectives. * Determine agent schedules to meet Process objectives WFM Analyst IBM February 2015  – Present (7 months) Bangaon Area, India  * Develop reports on daily workload. * Participate in forecasting meetings with relevant departments; develop accurate short- and long-term workload forecasts. * Control master systems files with schedule information and shift preferences. * Serve as initial contact point for all issues regarding schedules. * Process day-off requests and update systems. * Determine workforce requirements to meet service level and response time objectives. * Determine agent schedules to meet Process objectives Senior Tech advisor IBM February 2014  – Present (1 year 7 months) Addresses and resolves basic incidents and requests; logs all incidents and requests; engages other service desk resources or appropriate service resources to resolve incidents that are beyond the scope of their ability or responsibility. \nUses the appropriate SDB categories for logging incidents and requests. \nCreates a positive client support experience and builds strong relationships through deep problem understanding, ensuring timely resolution or escalation, communicating promptly on progress, and handling clients with a consummately professional attitude. \nEnsures the end-to-end technical support experience and provides a single point-of-contact for the clients. \nAnalyzes and resolves incidents and requests regarding use of application software or hardware. Logs and tracks incidents and requests from identification through resolution. Follows up with other support staff (service resources) involved in resolution to ensure incidents are resolved, requests are filled, and the client communication is complete. Documents resolutions and updates self-help and staff knowledge bases. \nGrows general knowledge of current corporate, division, and facility-specific products, increasing ability to resolve requests on first contact. \nProvides after hours and on-call support as needed. \nAdheres to and supports HCA IT&S standards, policies, and procedures. \nMaintains and protects confidentiality with regard to all aspects of patient care and employee information. \nAdheres to Code of Conduct and Mission and Value statements. \nPerforms other duties as assigned Senior Tech advisor IBM February 2014  – Present (1 year 7 months) Addresses and resolves basic incidents and requests; logs all incidents and requests; engages other service desk resources or appropriate service resources to resolve incidents that are beyond the scope of their ability or responsibility. \nUses the appropriate SDB categories for logging incidents and requests. \nCreates a positive client support experience and builds strong relationships through deep problem understanding, ensuring timely resolution or escalation, communicating promptly on progress, and handling clients with a consummately professional attitude. \nEnsures the end-to-end technical support experience and provides a single point-of-contact for the clients. \nAnalyzes and resolves incidents and requests regarding use of application software or hardware. Logs and tracks incidents and requests from identification through resolution. Follows up with other support staff (service resources) involved in resolution to ensure incidents are resolved, requests are filled, and the client communication is complete. Documents resolutions and updates self-help and staff knowledge bases. \nGrows general knowledge of current corporate, division, and facility-specific products, increasing ability to resolve requests on first contact. \nProvides after hours and on-call support as needed. \nAdheres to and supports HCA IT&S standards, policies, and procedures. \nMaintains and protects confidentiality with regard to all aspects of patient care and employee information. \nAdheres to Code of Conduct and Mission and Value statements. \nPerforms other duties as assigned Support Accounts and verification dept Yahoo! August 2012  –  November 2013  (1 year 4 months) Bangalore \tVerifying User Accounts  \n\tSupporting Account Recovery  \n\tIdentifying Compromised Accounts \n\tHandling Fraud Accounts Support Accounts and verification dept Yahoo! August 2012  –  November 2013  (1 year 4 months) Bangalore \tVerifying User Accounts  \n\tSupporting Account Recovery  \n\tIdentifying Compromised Accounts \n\tHandling Fraud Accounts Analyst Mphasis August 2006  –  July 2012  (6 years) Bangalore \tWorked as a senior Customer representative for 3 years handling inbound calls related to banking and technical queries for an American bank \n\tAs a part of Command Centre for 1.5 years managed an extensive daily workload with responsibility for Reporting, Business analysis, Process improvements Scheduling and forecasting of calls and break management  \n\tManaging the MIS reporting for the Vertical which includes preparation of P&L reports, HR tracker’s , tracking of projections against actual for financial year Analyst Mphasis August 2006  –  July 2012  (6 years) Bangalore \tWorked as a senior Customer representative for 3 years handling inbound calls related to banking and technical queries for an American bank \n\tAs a part of Command Centre for 1.5 years managed an extensive daily workload with responsibility for Reporting, Business analysis, Process improvements Scheduling and forecasting of calls and break management  \n\tManaging the MIS reporting for the Vertical which includes preparation of P&L reports, HR tracker’s , tracking of projections against actual for financial year Languages English Kannada Hindi Urdu English Kannada Hindi Urdu English Kannada Hindi Urdu Skills Business Analysis Team Management Management BPO MIS IT Service Management Work force management Skills  Business Analysis Team Management Management BPO MIS IT Service Management Work force management Business Analysis Team Management Management BPO MIS IT Service Management Work force management Business Analysis Team Management Management BPO MIS IT Service Management Work force management Education Pc Jabins science college BSc,  Mathematics and Statistics 2000  – 2005 St Andrews school hubli 1988  – 2000 Pc Jabins science college BSc,  Mathematics and Statistics 2000  – 2005 Pc Jabins science college BSc,  Mathematics and Statistics 2000  – 2005 Pc Jabins science college BSc,  Mathematics and Statistics 2000  – 2005 St Andrews school hubli 1988  – 2000 St Andrews school hubli 1988  – 2000 St Andrews school hubli 1988  – 2000 ", "Experience WFM Analyst IBM Global Business Process Services April 2004  – Present (11 years 5 months) WFM Analyst IBM Global Business Process Services April 2004  – Present (11 years 5 months) WFM Analyst IBM Global Business Process Services April 2004  – Present (11 years 5 months) Skills SAP FICO ITIL Skills  SAP FICO ITIL SAP FICO ITIL SAP FICO ITIL Education Camp Education School, Pune Higher Secondary 2000  – 2002 Camp Education School, Pune Higher Secondary 2000  – 2002 Camp Education School, Pune Higher Secondary 2000  – 2002 Camp Education School, Pune Higher Secondary 2000  – 2002 ", "Summary A dynamic professional having over 6 yrs of work experience and 3 years of relevant experience in data processing and managerial report generation using different data sets.Possess a flexible and detailed oriented attitude. \n Summary A dynamic professional having over 6 yrs of work experience and 3 years of relevant experience in data processing and managerial report generation using different data sets.Possess a flexible and detailed oriented attitude. \n A dynamic professional having over 6 yrs of work experience and 3 years of relevant experience in data processing and managerial report generation using different data sets.Possess a flexible and detailed oriented attitude. \n A dynamic professional having over 6 yrs of work experience and 3 years of relevant experience in data processing and managerial report generation using different data sets.Possess a flexible and detailed oriented attitude. \n Experience Data Analyst LoginWorks Softwares Pvt. Ltd. May 2014  – Present (1 year 4 months) Ghāziābād Area, India •\tResponsible for daily business delivery and client communications. \n•\tActing as Team Leader and leading a team of Jr. data analysts. \n•\tEffectively managing and resolving team member queries/concerns related to their performance, growth and Organizational issues. \n•\tStatus reporting of team activities against the program plan or schedule. \n•\tTo audit and clean the raw data as per the client guidelines and uploading to client database. \n•\tActing as a liaison between various team, departments and clients. \n•\tTo keep track of daily deliveries and using proactive approach to notify client for any change/update in normal schedule of delivery. \n•\tScheduling daily deliveries and making adjustments according to ad-hoc requests priority. \n•\tInteracting with clients through voice/video chat for weekly calibrations and progress reports. \n•\tEnsuring timely delivery of the project to clients according to their requirement. Managing various clients spanning over different time zones simultaneously. \n•\tData manipulation, data merging, data cleaning and data preparation using SQL, MS EXCEL, MySql. \n•\tData validation to ensure accuracy and quality of data. Identify errors in data quality matching logic and recommend updates to quality head. \n Lead WFM Analyst IBM India ( Formerly IBM Global Process Services Pvt Ltd.) December 2006  –  August 2013  (6 years 9 months) Gurgaon, Noida, India •\tMaintaining schedule adherence/break adherence to keep service level intact as per the client requirement \n•\tCoordinating with Ops Team Leaders/ Managers for effective floor management (login/logout tracking & shift rollover), real-time break schedule adherence. \n•\tProviding ad-hoc reports request from management based on Sage/ CMS AYAYA. \n•\tManaging RTA for two major projects based out at Noida location. \n•\tCoordinating with Transition team for new project seating requirement, ID creation, skill mapping in CMS Supervisor, group creation in CMS etc. \n•\tCo-coordinating with transport team for cab arrivals before the shift logins. \n•\tPreparing transport roster and uploading to transport application for transport team use. \n•\tScheduling the required staffing based on the forecasted/projected call volume. \n•\tPreparing stack/incentive data based on the performance metrics set by management for Ops & Quality. \n•\tAttending weekly client calls and preparing MOMs/WRMs. \n•\tPreparing weekly/monthly progress report and review dashboard /slide. \n•\tLooking after new daily/weekly trends for precautionary measure. Data Analyst LoginWorks Softwares Pvt. Ltd. May 2014  – Present (1 year 4 months) Ghāziābād Area, India •\tResponsible for daily business delivery and client communications. \n•\tActing as Team Leader and leading a team of Jr. data analysts. \n•\tEffectively managing and resolving team member queries/concerns related to their performance, growth and Organizational issues. \n•\tStatus reporting of team activities against the program plan or schedule. \n•\tTo audit and clean the raw data as per the client guidelines and uploading to client database. \n•\tActing as a liaison between various team, departments and clients. \n•\tTo keep track of daily deliveries and using proactive approach to notify client for any change/update in normal schedule of delivery. \n•\tScheduling daily deliveries and making adjustments according to ad-hoc requests priority. \n•\tInteracting with clients through voice/video chat for weekly calibrations and progress reports. \n•\tEnsuring timely delivery of the project to clients according to their requirement. Managing various clients spanning over different time zones simultaneously. \n•\tData manipulation, data merging, data cleaning and data preparation using SQL, MS EXCEL, MySql. \n•\tData validation to ensure accuracy and quality of data. Identify errors in data quality matching logic and recommend updates to quality head. \n Data Analyst LoginWorks Softwares Pvt. Ltd. May 2014  – Present (1 year 4 months) Ghāziābād Area, India •\tResponsible for daily business delivery and client communications. \n•\tActing as Team Leader and leading a team of Jr. data analysts. \n•\tEffectively managing and resolving team member queries/concerns related to their performance, growth and Organizational issues. \n•\tStatus reporting of team activities against the program plan or schedule. \n•\tTo audit and clean the raw data as per the client guidelines and uploading to client database. \n•\tActing as a liaison between various team, departments and clients. \n•\tTo keep track of daily deliveries and using proactive approach to notify client for any change/update in normal schedule of delivery. \n•\tScheduling daily deliveries and making adjustments according to ad-hoc requests priority. \n•\tInteracting with clients through voice/video chat for weekly calibrations and progress reports. \n•\tEnsuring timely delivery of the project to clients according to their requirement. Managing various clients spanning over different time zones simultaneously. \n•\tData manipulation, data merging, data cleaning and data preparation using SQL, MS EXCEL, MySql. \n•\tData validation to ensure accuracy and quality of data. Identify errors in data quality matching logic and recommend updates to quality head. \n Lead WFM Analyst IBM India ( Formerly IBM Global Process Services Pvt Ltd.) December 2006  –  August 2013  (6 years 9 months) Gurgaon, Noida, India •\tMaintaining schedule adherence/break adherence to keep service level intact as per the client requirement \n•\tCoordinating with Ops Team Leaders/ Managers for effective floor management (login/logout tracking & shift rollover), real-time break schedule adherence. \n•\tProviding ad-hoc reports request from management based on Sage/ CMS AYAYA. \n•\tManaging RTA for two major projects based out at Noida location. \n•\tCoordinating with Transition team for new project seating requirement, ID creation, skill mapping in CMS Supervisor, group creation in CMS etc. \n•\tCo-coordinating with transport team for cab arrivals before the shift logins. \n•\tPreparing transport roster and uploading to transport application for transport team use. \n•\tScheduling the required staffing based on the forecasted/projected call volume. \n•\tPreparing stack/incentive data based on the performance metrics set by management for Ops & Quality. \n•\tAttending weekly client calls and preparing MOMs/WRMs. \n•\tPreparing weekly/monthly progress report and review dashboard /slide. \n•\tLooking after new daily/weekly trends for precautionary measure. Lead WFM Analyst IBM India ( Formerly IBM Global Process Services Pvt Ltd.) December 2006  –  August 2013  (6 years 9 months) Gurgaon, Noida, India •\tMaintaining schedule adherence/break adherence to keep service level intact as per the client requirement \n•\tCoordinating with Ops Team Leaders/ Managers for effective floor management (login/logout tracking & shift rollover), real-time break schedule adherence. \n•\tProviding ad-hoc reports request from management based on Sage/ CMS AYAYA. \n•\tManaging RTA for two major projects based out at Noida location. \n•\tCoordinating with Transition team for new project seating requirement, ID creation, skill mapping in CMS Supervisor, group creation in CMS etc. \n•\tCo-coordinating with transport team for cab arrivals before the shift logins. \n•\tPreparing transport roster and uploading to transport application for transport team use. \n•\tScheduling the required staffing based on the forecasted/projected call volume. \n•\tPreparing stack/incentive data based on the performance metrics set by management for Ops & Quality. \n•\tAttending weekly client calls and preparing MOMs/WRMs. \n•\tPreparing weekly/monthly progress report and review dashboard /slide. \n•\tLooking after new daily/weekly trends for precautionary measure. Languages English Hindi English Hindi English Hindi Skills Service Delivery Vendor Management Business Analysis Management Customer Service Business Strategy Team Leadership SQL Requirements Analysis Team Management Process Improvement Microsoft SQL Server MIS BPO Outsourcing Customer Satisfaction Operations Management Analytics Project Management IT Service Management See 5+     See less Skills  Service Delivery Vendor Management Business Analysis Management Customer Service Business Strategy Team Leadership SQL Requirements Analysis Team Management Process Improvement Microsoft SQL Server MIS BPO Outsourcing Customer Satisfaction Operations Management Analytics Project Management IT Service Management See 5+     See less Service Delivery Vendor Management Business Analysis Management Customer Service Business Strategy Team Leadership SQL Requirements Analysis Team Management Process Improvement Microsoft SQL Server MIS BPO Outsourcing Customer Satisfaction Operations Management Analytics Project Management IT Service Management See 5+     See less Service Delivery Vendor Management Business Analysis Management Customer Service Business Strategy Team Leadership SQL Requirements Analysis Team Management Process Improvement Microsoft SQL Server MIS BPO Outsourcing Customer Satisfaction Operations Management Analytics Project Management IT Service Management See 5+     See less Education Gautam Budha High School, Jehanabad 10th 2009  – 2009 Makhanlal Chaturvedi Rashtriya Patrakarita Vishwavidhyalaya Bachelor's Degree,  Computer Science 2001  – 2004 Gautam Budha High School, Jehanabad 10th 2009  – 2009 Gautam Budha High School, Jehanabad 10th 2009  – 2009 Gautam Budha High School, Jehanabad 10th 2009  – 2009 Makhanlal Chaturvedi Rashtriya Patrakarita Vishwavidhyalaya Bachelor's Degree,  Computer Science 2001  – 2004 Makhanlal Chaturvedi Rashtriya Patrakarita Vishwavidhyalaya Bachelor's Degree,  Computer Science 2001  – 2004 Makhanlal Chaturvedi Rashtriya Patrakarita Vishwavidhyalaya Bachelor's Degree,  Computer Science 2001  – 2004 ", "Experience WFM Analyst IBM March 2013  –  November 2014  (1 year 9 months) Bangalore Forecasting, Scheduling, Real Time Analysis, Reporting, Capacity Planning Associate Aditya Birla Minacs December 2007  –  March 2013  (5 years 4 months) Scheduling, Time and Attendance Analysis, Real Time Analysis, Technical Support Engineer Customer Support Officer Aegis BPO September 2006  –  November 2007  (1 year 3 months) Kolkata Area, India Floor Support, Customer Support Officer WFM Analyst IBM March 2013  –  November 2014  (1 year 9 months) Bangalore Forecasting, Scheduling, Real Time Analysis, Reporting, Capacity Planning WFM Analyst IBM March 2013  –  November 2014  (1 year 9 months) Bangalore Forecasting, Scheduling, Real Time Analysis, Reporting, Capacity Planning Associate Aditya Birla Minacs December 2007  –  March 2013  (5 years 4 months) Scheduling, Time and Attendance Analysis, Real Time Analysis, Technical Support Engineer Associate Aditya Birla Minacs December 2007  –  March 2013  (5 years 4 months) Scheduling, Time and Attendance Analysis, Real Time Analysis, Technical Support Engineer Customer Support Officer Aegis BPO September 2006  –  November 2007  (1 year 3 months) Kolkata Area, India Floor Support, Customer Support Officer Customer Support Officer Aegis BPO September 2006  –  November 2007  (1 year 3 months) Kolkata Area, India Floor Support, Customer Support Officer Languages English Hindi Oriya Bengali English Hindi Oriya Bengali English Hindi Oriya Bengali Skills Team Management Vendor Management Service Delivery Performance Management Employee Engagement Customer Service CRM Business Analysis Market Research Requirements Analysis Microsoft Office Skills  Team Management Vendor Management Service Delivery Performance Management Employee Engagement Customer Service CRM Business Analysis Market Research Requirements Analysis Microsoft Office Team Management Vendor Management Service Delivery Performance Management Employee Engagement Customer Service CRM Business Analysis Market Research Requirements Analysis Microsoft Office Team Management Vendor Management Service Delivery Performance Management Employee Engagement Customer Service CRM Business Analysis Market Research Requirements Analysis Microsoft Office Education Sikkim Manipal University of Health, Medical and Technological Sciences Bachelor of Business Administration (BBA),  Finance , General , 1st 2008  – 2011 Sainik School Intermediate,  Science 1997  – 2004 VEMS 5th,  Schooling 1993  – 1997 Sikkim Manipal University of Health, Medical and Technological Sciences Bachelor of Business Administration (BBA),  Finance , General , 1st 2008  – 2011 Sikkim Manipal University of Health, Medical and Technological Sciences Bachelor of Business Administration (BBA),  Finance , General , 1st 2008  – 2011 Sikkim Manipal University of Health, Medical and Technological Sciences Bachelor of Business Administration (BBA),  Finance , General , 1st 2008  – 2011 Sainik School Intermediate,  Science 1997  – 2004 Sainik School Intermediate,  Science 1997  – 2004 Sainik School Intermediate,  Science 1997  – 2004 VEMS 5th,  Schooling 1993  – 1997 VEMS 5th,  Schooling 1993  – 1997 VEMS 5th,  Schooling 1993  – 1997 ", "Experience WFM Analyst IBM Daksh Business Process Services Pvt. Ltd WFM Analyst IBM Daksh Business Process Services Pvt. Ltd WFM Analyst IBM Daksh Business Process Services Pvt. Ltd ", "Experience WFM Analyst IBM Daksh WFM Analyst IBM Daksh WFM Analyst IBM Daksh ", "Summary Customer support with analysis, verification and updation of US based businesses. Handle Paydex scores, FSS, credit scores and legal aspects of business e.g. Suits, Liens, Judgements, and UCCs. Intercation with SMEs upon quality and other process improvement aspects. Specialties:Business Transaction Outsourcing specialised in Financial Unit. Summary Customer support with analysis, verification and updation of US based businesses. Handle Paydex scores, FSS, credit scores and legal aspects of business e.g. Suits, Liens, Judgements, and UCCs. Intercation with SMEs upon quality and other process improvement aspects. Specialties:Business Transaction Outsourcing specialised in Financial Unit. Customer support with analysis, verification and updation of US based businesses. Handle Paydex scores, FSS, credit scores and legal aspects of business e.g. Suits, Liens, Judgements, and UCCs. Intercation with SMEs upon quality and other process improvement aspects. Specialties:Business Transaction Outsourcing specialised in Financial Unit. Customer support with analysis, verification and updation of US based businesses. Handle Paydex scores, FSS, credit scores and legal aspects of business e.g. Suits, Liens, Judgements, and UCCs. Intercation with SMEs upon quality and other process improvement aspects. Specialties:Business Transaction Outsourcing specialised in Financial Unit. Experience Sr. WFM Analyst IBM GPS January 2011  – Present (4 years 8 months) Gurgaon, India Analyzing trends and daily MIS to track leakage in the system.  \nData Workflow Management, Coordination with the Client and other enabling functions to ensure smooth functioning of the process. \nData analysis and consolidation of Report, Timely completion of individual / team work. \nIdentifying areas of improvement through Automation. Sr Executive, Operations IBM Daksh Business Process Services Pvt. Ltd November 2006  –  December 2010  (4 years 2 months) Sr Exec Ops IBM GPS 2006  –  2010  (4 years) Sr. WFM Analyst IBM GPS January 2011  – Present (4 years 8 months) Gurgaon, India Analyzing trends and daily MIS to track leakage in the system.  \nData Workflow Management, Coordination with the Client and other enabling functions to ensure smooth functioning of the process. \nData analysis and consolidation of Report, Timely completion of individual / team work. \nIdentifying areas of improvement through Automation. Sr. WFM Analyst IBM GPS January 2011  – Present (4 years 8 months) Gurgaon, India Analyzing trends and daily MIS to track leakage in the system.  \nData Workflow Management, Coordination with the Client and other enabling functions to ensure smooth functioning of the process. \nData analysis and consolidation of Report, Timely completion of individual / team work. \nIdentifying areas of improvement through Automation. Sr Executive, Operations IBM Daksh Business Process Services Pvt. Ltd November 2006  –  December 2010  (4 years 2 months) Sr Executive, Operations IBM Daksh Business Process Services Pvt. Ltd November 2006  –  December 2010  (4 years 2 months) Sr Exec Ops IBM GPS 2006  –  2010  (4 years) Sr Exec Ops IBM GPS 2006  –  2010  (4 years) Skills Process Improvement Analysis Outsourcing Data Analysis BPO Team Management Vendor Management MIS Service Delivery Business Analysis Analytics Operations Management Performance Management Sla Employee Engagement Skills  Process Improvement Analysis Outsourcing Data Analysis BPO Team Management Vendor Management MIS Service Delivery Business Analysis Analytics Operations Management Performance Management Sla Employee Engagement Process Improvement Analysis Outsourcing Data Analysis BPO Team Management Vendor Management MIS Service Delivery Business Analysis Analytics Operations Management Performance Management Sla Employee Engagement Process Improvement Analysis Outsourcing Data Analysis BPO Team Management Vendor Management MIS Service Delivery Business Analysis Analytics Operations Management Performance Management Sla Employee Engagement Education Jawaharlal Nehru Vishvavidyalaya M A,  Economics 2002  – 2004 Jawaharlal Nehru Vishvavidyalaya M A,  Economics 2002  – 2004 Jawaharlal Nehru Vishvavidyalaya M.A,  Economics 2002  – 2004 Osmania University Jawaharlal Nehru Vishvavidyalaya M A,  Economics 2002  – 2004 Jawaharlal Nehru Vishvavidyalaya M A,  Economics 2002  – 2004 Jawaharlal Nehru Vishvavidyalaya M A,  Economics 2002  – 2004 Jawaharlal Nehru Vishvavidyalaya M A,  Economics 2002  – 2004 Jawaharlal Nehru Vishvavidyalaya M A,  Economics 2002  – 2004 Jawaharlal Nehru Vishvavidyalaya M A,  Economics 2002  – 2004 Jawaharlal Nehru Vishvavidyalaya M.A,  Economics 2002  – 2004 Jawaharlal Nehru Vishvavidyalaya M.A,  Economics 2002  – 2004 Jawaharlal Nehru Vishvavidyalaya M.A,  Economics 2002  – 2004 Osmania University Osmania University Osmania University ", "Experience Assistant Manager Business Operations IBM India Pvt. Ltd. June 2013  – Present (2 years 3 months) Gurgaon, Haryana LEAD WFM ANALYST IBM GPS October 2009  –  May 2013  (3 years 8 months) MANAGING QUEUE IN REAL-TIME TO ATTAIN TO TARGETED SLA'S & SLO'S FOR ALL ACCOUNTS. \nPROCESSING EMPLOYEE INCENTIVES FOR 22 ACCOUNTS. \nMAINTAINING HEADCOUNT, ACCESS LIST RECORDS. \nMAKING CALL DETAIL & SL REPORTINGS TO HELP THE ACCOUNTS MEET THE REQUIRED SLA/SLO & PRODUCTION. \nADHERENCE REPORTINGS (ATTENDANCE, PRODUCTIVITY, BREAKS ETC) TO RUN PROCESS SMOOTHLY. \nINITIATED CSAT, FCR, E-SCHEDULE REPORT FOR ALL PROCESSES \nINITIATED NO SHOW REPORT FOR COST CUTTING OF THE COMPANY. \nRESPONSIBLE FOR COORDINATING WITH VENDORS FOR THE TECHNICAL PROBLEMS OCCURRING ON THE FLOOR. \nFACILITATING THE ADMIN ISSUES FOR THE FLUENCY OF WORK. \nALONG WITH ABOVE, MANAGING AD-HOC REQUEST AS PER THE REQUESTED TAT. EXEC. TECH. SUPPORT IBM GPS August 2007  –  September 2009  (2 years 2 months) WORKED AS TECHNICAL SUPPORT EXECUTIVE (OPERATIONS) \nWORK AS LEVEL 2 ON ESCALATION DESK IN INBOUND PROCESS FOR US CLIENT. HANDLING THE TECHNICAL ISSUES TRANSFERRED BY 1ST LEVEL SUPPORT (RELATED TO QUICKBOOKS). \nTAKING INITIATIVE TO MAINTAINING AND MAKING THE DATA IN MS-EXCEL FOR THE TEAM REGARDING DIFFERENT KPI(KEY PERFORMANCE INDICATORS) \nMAINTAINING DAILY & MONTHLY REPORTS FOR THE TEAM AS PER THE REQUIREMENT IN MS-EXCEL. \nGIVING TRAINING AND SUGGESTIONS TO THE NEW EMPLOYEE'S IN THE TEAM. TEAM LEADER KOCHAR INFOTECH PVT. LTD March 2007  –  June 2007  (4 months) HANDLED A TEAM OF 15-20 MEMBERS IN INBOUND ENVIRONMENT IN SPICE GPRS PROCESS. \nMAINTAINING THE CALL HANDLING & SALES REPORTS ON DAILY BASIS. \nMANAGING BREAKS TO CONTROL THE CALL FLOW. \nMANAGING SHRINKAGE AND ATTRITION. \nORGANIZATION EXEC. TECH. SUPPORT KOCHAR INFOTECH PVT LTD March 2006  –  February 2007  (1 year) HANDLING INBOUND CALLS IN AIRTEL GPRS PROCESS. \nPROVIDING THE INFORMATION ABOUT NEW PRODUCTS AND SERVICES TO THE CUSTOMERS. \nPROVIDING FLOOR SUPPORT. \nRESEARCH ON NEW MOBILE PHONES AND UPDATE THEIR CONFIGURATIONS IN THE DATABASE. Assistant Manager Business Operations IBM India Pvt. Ltd. June 2013  – Present (2 years 3 months) Gurgaon, Haryana Assistant Manager Business Operations IBM India Pvt. Ltd. June 2013  – Present (2 years 3 months) Gurgaon, Haryana LEAD WFM ANALYST IBM GPS October 2009  –  May 2013  (3 years 8 months) MANAGING QUEUE IN REAL-TIME TO ATTAIN TO TARGETED SLA'S & SLO'S FOR ALL ACCOUNTS. \nPROCESSING EMPLOYEE INCENTIVES FOR 22 ACCOUNTS. \nMAINTAINING HEADCOUNT, ACCESS LIST RECORDS. \nMAKING CALL DETAIL & SL REPORTINGS TO HELP THE ACCOUNTS MEET THE REQUIRED SLA/SLO & PRODUCTION. \nADHERENCE REPORTINGS (ATTENDANCE, PRODUCTIVITY, BREAKS ETC) TO RUN PROCESS SMOOTHLY. \nINITIATED CSAT, FCR, E-SCHEDULE REPORT FOR ALL PROCESSES \nINITIATED NO SHOW REPORT FOR COST CUTTING OF THE COMPANY. \nRESPONSIBLE FOR COORDINATING WITH VENDORS FOR THE TECHNICAL PROBLEMS OCCURRING ON THE FLOOR. \nFACILITATING THE ADMIN ISSUES FOR THE FLUENCY OF WORK. \nALONG WITH ABOVE, MANAGING AD-HOC REQUEST AS PER THE REQUESTED TAT. LEAD WFM ANALYST IBM GPS October 2009  –  May 2013  (3 years 8 months) MANAGING QUEUE IN REAL-TIME TO ATTAIN TO TARGETED SLA'S & SLO'S FOR ALL ACCOUNTS. \nPROCESSING EMPLOYEE INCENTIVES FOR 22 ACCOUNTS. \nMAINTAINING HEADCOUNT, ACCESS LIST RECORDS. \nMAKING CALL DETAIL & SL REPORTINGS TO HELP THE ACCOUNTS MEET THE REQUIRED SLA/SLO & PRODUCTION. \nADHERENCE REPORTINGS (ATTENDANCE, PRODUCTIVITY, BREAKS ETC) TO RUN PROCESS SMOOTHLY. \nINITIATED CSAT, FCR, E-SCHEDULE REPORT FOR ALL PROCESSES \nINITIATED NO SHOW REPORT FOR COST CUTTING OF THE COMPANY. \nRESPONSIBLE FOR COORDINATING WITH VENDORS FOR THE TECHNICAL PROBLEMS OCCURRING ON THE FLOOR. \nFACILITATING THE ADMIN ISSUES FOR THE FLUENCY OF WORK. \nALONG WITH ABOVE, MANAGING AD-HOC REQUEST AS PER THE REQUESTED TAT. EXEC. TECH. SUPPORT IBM GPS August 2007  –  September 2009  (2 years 2 months) WORKED AS TECHNICAL SUPPORT EXECUTIVE (OPERATIONS) \nWORK AS LEVEL 2 ON ESCALATION DESK IN INBOUND PROCESS FOR US CLIENT. HANDLING THE TECHNICAL ISSUES TRANSFERRED BY 1ST LEVEL SUPPORT (RELATED TO QUICKBOOKS). \nTAKING INITIATIVE TO MAINTAINING AND MAKING THE DATA IN MS-EXCEL FOR THE TEAM REGARDING DIFFERENT KPI(KEY PERFORMANCE INDICATORS) \nMAINTAINING DAILY & MONTHLY REPORTS FOR THE TEAM AS PER THE REQUIREMENT IN MS-EXCEL. \nGIVING TRAINING AND SUGGESTIONS TO THE NEW EMPLOYEE'S IN THE TEAM. EXEC. TECH. SUPPORT IBM GPS August 2007  –  September 2009  (2 years 2 months) WORKED AS TECHNICAL SUPPORT EXECUTIVE (OPERATIONS) \nWORK AS LEVEL 2 ON ESCALATION DESK IN INBOUND PROCESS FOR US CLIENT. HANDLING THE TECHNICAL ISSUES TRANSFERRED BY 1ST LEVEL SUPPORT (RELATED TO QUICKBOOKS). \nTAKING INITIATIVE TO MAINTAINING AND MAKING THE DATA IN MS-EXCEL FOR THE TEAM REGARDING DIFFERENT KPI(KEY PERFORMANCE INDICATORS) \nMAINTAINING DAILY & MONTHLY REPORTS FOR THE TEAM AS PER THE REQUIREMENT IN MS-EXCEL. \nGIVING TRAINING AND SUGGESTIONS TO THE NEW EMPLOYEE'S IN THE TEAM. TEAM LEADER KOCHAR INFOTECH PVT. LTD March 2007  –  June 2007  (4 months) HANDLED A TEAM OF 15-20 MEMBERS IN INBOUND ENVIRONMENT IN SPICE GPRS PROCESS. \nMAINTAINING THE CALL HANDLING & SALES REPORTS ON DAILY BASIS. \nMANAGING BREAKS TO CONTROL THE CALL FLOW. \nMANAGING SHRINKAGE AND ATTRITION. \nORGANIZATION TEAM LEADER KOCHAR INFOTECH PVT. LTD March 2007  –  June 2007  (4 months) HANDLED A TEAM OF 15-20 MEMBERS IN INBOUND ENVIRONMENT IN SPICE GPRS PROCESS. \nMAINTAINING THE CALL HANDLING & SALES REPORTS ON DAILY BASIS. \nMANAGING BREAKS TO CONTROL THE CALL FLOW. \nMANAGING SHRINKAGE AND ATTRITION. \nORGANIZATION EXEC. TECH. SUPPORT KOCHAR INFOTECH PVT LTD March 2006  –  February 2007  (1 year) HANDLING INBOUND CALLS IN AIRTEL GPRS PROCESS. \nPROVIDING THE INFORMATION ABOUT NEW PRODUCTS AND SERVICES TO THE CUSTOMERS. \nPROVIDING FLOOR SUPPORT. \nRESEARCH ON NEW MOBILE PHONES AND UPDATE THEIR CONFIGURATIONS IN THE DATABASE. EXEC. TECH. SUPPORT KOCHAR INFOTECH PVT LTD March 2006  –  February 2007  (1 year) HANDLING INBOUND CALLS IN AIRTEL GPRS PROCESS. \nPROVIDING THE INFORMATION ABOUT NEW PRODUCTS AND SERVICES TO THE CUSTOMERS. \nPROVIDING FLOOR SUPPORT. \nRESEARCH ON NEW MOBILE PHONES AND UPDATE THEIR CONFIGURATIONS IN THE DATABASE. Skills MIS Call Centers Workforce Management CRM Training BPO Service Delivery Technical Support Microsoft Excel Business Process... Customer Satisfaction Customer Experience Team Leadership Requirements Analysis Business Intelligence Avaya Resource Management Telecommunications Sla See 4+     See less Skills  MIS Call Centers Workforce Management CRM Training BPO Service Delivery Technical Support Microsoft Excel Business Process... Customer Satisfaction Customer Experience Team Leadership Requirements Analysis Business Intelligence Avaya Resource Management Telecommunications Sla See 4+     See less MIS Call Centers Workforce Management CRM Training BPO Service Delivery Technical Support Microsoft Excel Business Process... Customer Satisfaction Customer Experience Team Leadership Requirements Analysis Business Intelligence Avaya Resource Management Telecommunications Sla See 4+     See less MIS Call Centers Workforce Management CRM Training BPO Service Delivery Technical Support Microsoft Excel Business Process... Customer Satisfaction Customer Experience Team Leadership Requirements Analysis Business Intelligence Avaya Resource Management Telecommunications Sla See 4+     See less Education Symbiosis Center of Distance Learning PGDBM,  FINANCE 2008  – 2012 Guru Nanak Dev University B.Com 2004  – 2007 Symbiosis Center of Distance Learning PGDBM,  FINANCE 2008  – 2012 Symbiosis Center of Distance Learning PGDBM,  FINANCE 2008  – 2012 Symbiosis Center of Distance Learning PGDBM,  FINANCE 2008  – 2012 Guru Nanak Dev University B.Com 2004  – 2007 Guru Nanak Dev University B.Com 2004  – 2007 Guru Nanak Dev University B.Com 2004  – 2007 ", "Experience WFM Analyst IBM Daksh WFM Analyst IBM Daksh WFM Analyst IBM Daksh ", "Experience WFM Analyst IBM February 2015  – Present (7 months) Bengaluru Area, India Currently working as WFM Analyst at IBM Senior WFM officer Sitel, Mumbai February 2014  –  February 2015  (1 year 1 month) Mumbai Area, India Worked in Centralized Workforce Management WFM Executive Firstsource Solutions Limited December 2012  –  February 2014  (1 year 3 months) Bengaluru Area, India Queue monitoring, Worked on tools like IEX and Avaya Customer Service Representative Firstsource Solutions Limited, Chennai January 2008  –  September 2011  (3 years 9 months) Chennai Area, India WFM Analyst IBM February 2015  – Present (7 months) Bengaluru Area, India Currently working as WFM Analyst at IBM WFM Analyst IBM February 2015  – Present (7 months) Bengaluru Area, India Currently working as WFM Analyst at IBM Senior WFM officer Sitel, Mumbai February 2014  –  February 2015  (1 year 1 month) Mumbai Area, India Worked in Centralized Workforce Management Senior WFM officer Sitel, Mumbai February 2014  –  February 2015  (1 year 1 month) Mumbai Area, India Worked in Centralized Workforce Management WFM Executive Firstsource Solutions Limited December 2012  –  February 2014  (1 year 3 months) Bengaluru Area, India Queue monitoring, Worked on tools like IEX and Avaya WFM Executive Firstsource Solutions Limited December 2012  –  February 2014  (1 year 3 months) Bengaluru Area, India Queue monitoring, Worked on tools like IEX and Avaya Customer Service Representative Firstsource Solutions Limited, Chennai January 2008  –  September 2011  (3 years 9 months) Chennai Area, India Customer Service Representative Firstsource Solutions Limited, Chennai January 2008  –  September 2011  (3 years 9 months) Chennai Area, India Skills BPO Call Centers Workforce Management Sla Transition Management Contact Centers Service Delivery Customer Experience Customer Satisfaction Inbound Marketing COPC Avaya Skills  BPO Call Centers Workforce Management Sla Transition Management Contact Centers Service Delivery Customer Experience Customer Satisfaction Inbound Marketing COPC Avaya BPO Call Centers Workforce Management Sla Transition Management Contact Centers Service Delivery Customer Experience Customer Satisfaction Inbound Marketing COPC Avaya BPO Call Centers Workforce Management Sla Transition Management Contact Centers Service Delivery Customer Experience Customer Satisfaction Inbound Marketing COPC Avaya Education University of Mysore Bachelor of Arts (B.A.),  English Language and Literature/Letters 2010  – 2013 English Literarture, Sociology and History University of Mysore Bachelor of Arts (B.A.),  English Language and Literature/Letters 2010  – 2013 English Literarture, Sociology and History University of Mysore Bachelor of Arts (B.A.),  English Language and Literature/Letters 2010  – 2013 English Literarture, Sociology and History University of Mysore Bachelor of Arts (B.A.),  English Language and Literature/Letters 2010  – 2013 English Literarture, Sociology and History "]}